{
    "name": "La Patrona Restaurant",
    "place_id": "ChIJV8naGrr1wokRlmBGgvH5HQU",
    "grid": "BX1",
    "address": "558 Southern Blvd, Bronx, NY 10455, USA",
    "rating": 4.4,
    "user_ratings_total": 361,
    "phone_number": "(347) 270-5545",
    "reviews": [
        {
            "date": "7시간 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMlRtWndSMDFKV0dGamJUTkhXVFl0ZFZCMWRVRRAB",
            "text": "i got the chicken burrito and it bussssss!!! mi restaurante mexicana favorito! siempre voy a volver."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQ1pIUmlRMDlIVUUxRmEwNVhjVEpJYVhOMk0yYxAB",
            "text": "No puede ser que te dejen esperando una hora y media te cobren el delivery para que después no llegue la comida y después no te den una respuesta. La comida no es mala pero el\nServicio de delivery es pésimo"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOU1duVnJhMGN6U25vNU9WQlZRVEpoVjBONWJVRRAB",
            "text": "This Mexican restaurant was a great find! The food was absolutely amazing — flavorful, fresh, and beautifully presented. The service was just as impressive, with friendly staff who made the experience even better. Prices were very fair, especially considering it’s located in New York, and the overall atmosphere was lively and welcoming. My only small gripe was that they didn’t offer complimentary chips like most Mexican restaurants do, and I wasn’t informed ahead of time that a 15% tip would be automatically added to our bill for a small group. I still adjusted it to 20% because I genuinely had a great time, but giving customers the choice before adding the tip would make the payment process smoother. All in all, an excellent spot that I’d happily visit again!"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUlZFMVRUbGxUUTFSak9UaFphM0JIVFhVdFJYYxAB",
            "text": "Muy bueno"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210d2JEbG5XbEF6WDJ4M2ExZDViSEUzY1hKdmNGRRAB",
            "text": "Great food, friendly staff.  My go to place for lunch."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLYS0tNmlDcE5pZldnEAE",
            "text": "I ordered Churrasco and this is not it. For the price  I expect the meat I paid for."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cU1EWndNVlZOWjBkbVFXRnVhekZzWkdsMU1WRRAB",
            "text": "Food was good, my family loved the food. Music was on point. Thank you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMk4wdHpTRzU0Y2xKWlprRlZXRXBHV21FNFIzYxAB",
            "text": "everything fantastic"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMlkwVmlaVkZhUzFoYWNUZEZOVlZYWDJSblZrRRAB",
            "text": "What a great atmosphere! Amazing food and drinks are top-notch. It feels like you are on vacation when you come here, be sure to bring a group of friends and spend the time here eating and drinking. The music is great too, I was actually bopping around to some tunes. Very close to the train as well, a must-stop!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RlVGUnZkbk53UXkxQ2RtUlNiVnB1U2tkNlQwRRAB",
            "text": "Es super se pasa un rato muy divertido siempre voy los sabado por que hacen un show muy especial y me divertido hacen kareoke y la comida 10 de 10...."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaFpGVnhaVmRLUWt4elRrODVObE5LZGxsaE5IYxAB",
            "text": "Q ricooooo todo!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnelQxUkRTV3A0VlROdlRVOTFTRlV4WDFBMGVHYxAB",
            "text": "Food always came quick. People are very friendly. Delicious tacos and nachos. Serving sizes are generous. Ordered catering and good was also on time"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLMl94T1RraGM3d3B3RRAB",
            "text": "1st time going there with my Daughter."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX2JxQllBEAE",
            "text": "pesinama la carne asada no la recomiendo seles dise como quiere uno la carne y ellos la mandan como ellos quieren es mas yo no recomiendo este restaurante pues asta cuando uno llama las meseras estan asta de malas muy mal servicio"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3amJUSXZ3RRAB",
            "text": "Best place to go. Food was  delicious:)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN0liUHZRRRAB",
            "text": "Delicious food, tasty and reasonably priced. Great atmosphere and good music"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmb3N5NDFnRRAB",
            "text": "We had our foo delivered  to us, and wre very dissappointed in the  food. My taco salad  was in a shell that was fried in rancid oil. It was not edible and the contents of the salad were slimy,\nit went into the trash.  The bananas were also very greasy,swimming in oil.  Thr chicken tacos were ok.  The Flan was good. We won't be ordering  from them again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQX3Z2QVNnEAE",
            "text": "The food is good but ordering online or over the phone is a waste of time. I live close but the delivery guy didn’t want to deliver to my address. I ordered from two different parties & both orders were canceled. Canceled through grubhub because apparently they’re out of tacos, guacamole, chips and rice and beans lol. Don’t order through chownow even though it’s an option. Just wasted an hour of my life. If you live close just do a pickup"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMWRYanR3RRAB",
            "text": "Cute pics, nothing else"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3aDhIOTd3RRAB",
            "text": "Amazing food cheap prices great atmosphere I love this place shout out to Mariana she is amazing 🤩 karaoke 🎤 Friday Saturday and Sunday I recommend this place so much"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cHNEdklnEAE",
            "text": "Please don’t come here. The bartender was training someone while making my drinks and they poured some into their hand and also weren’t sure how to make a simple margarita with passion fruit ( the tequila measurements were guessed) , staff very inattentive but it was also empty (now knowing why), I went to the bathroom and I came out and their dj was literally moving my bags from my chair at the bar without my permission? It was so unprofessional then had his bag chips and redbull where my food and drink were. Quesadilla was ok, steak cooked perfectly but nothing special other than that. Usually when you say con todo they include more than just pico de gallo and lettuce but every place is different. Cotija cheese would have made this much better but I guess not an authentic place. There’s many other Mexican bars near by. I’d suggest picking one with better professionals and quality."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiME9EZ3d3RRAB",
            "text": "Best nachos, chips n guacamole and margaritas I've had"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMjZ5SkhnEAE",
            "text": "I’m not gon lie this taste sooooooooo good like omg and the guacamole well seasoned this restaurant 10/10 HIGHLY RECOMMEND IT BE FRESH"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdFBEQjZ3RRAB",
            "text": "10/10 I really like it I enjoy the breakfast, Horchata Etc"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6ZzdIeS1BRRAB",
            "text": "El servicio pésimo , meseras con una actitud poco agradable, pedí una cerveza y la tuve que pedir dos veces por qué la señorita estaba en el teléfono, los tacos 🌮 que ordene la tortilla estaba más dura que el corazón de mi ex ,\nLo peor de todo que la carne y la salsa verde ya olían mal ,\nSoy chef en Manhattan pero eso no tiene nada que ver, espero y Agan cambios en ese lugar tan hermoso sin correr a nadien ,"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeV9yYzNRRRAB",
            "text": "Overwhelmingly delicious. Atmosphere was beautiful. Kind and respectful people.\nWith food to die for"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUcC03dGNBEAE",
            "text": "Great food and great music!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5cnRxSUFREAE",
            "text": "Es muy bueno el lugar y la comida"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dEp2TXBBRRAB",
            "text": "Excelente lugar hay me enamore"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bUktOVpnEAE",
            "text": "Un lugar familiar,  un ambiente,  lo recomiendo 100%"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5LXMtWUxnEAE",
            "text": "HOLA ITS CARLOS FROM HEALTH PEOPLE I HAVE AN OFFICE ABOVE LA PATRONA, I ALWAYS ORDER FOOD FROM THEM AND ITS ALWAYS AMAZING THE FLAVORS. I ALSO GET FOOD CATERED FOR MY TEAM AND YOUNG MEN WE MENTOR ON A WEEKLY BASIS THEY LOVE THE BURRITOS STAFF IS AMAZING CHECK THEM OUT."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bkk2SkJBEAE",
            "text": "El mejor sitio para comer, beber y disfrutar con amigos o la familia\nLas mejores meseras del área\nEl mejor Dj 730\nServicio 1000\nQuisieran muchos tener un restaurante tan bueno bonito y barato!!! Thanks guys I appreciate your good service 😈💜😈"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5blBiMElBEAE",
            "text": "Such a nice and welcoming place."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N05Hc2lRRRAB",
            "text": "La comida muy mala, servicio sin experiencia , no vuelven a la mesa y se les olvida los que ordenaste. no volvería nunca."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNzVPZUtBEAE",
            "text": "Amazing. I ate there four times in a week. This place is awesome. The nachos alone...\n\nMexican style tacos... perfect 👌\n\nGreat service and food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMFBHOFN3EAE",
            "text": "All the food is super delicios. I am recommended, all food is very fresh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0MTZUWDFBRRAB",
            "text": "Great spot for a great time. Love Louie and his staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0bU12R2x3RRAB",
            "text": "Great place for lunch take out and to unwind afterwork with coworkers..  Excellent Servce and always with a smile.🤗"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNObGVfbi1RRRAB",
            "text": "Exelente hambiente en especial los viernes"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxc1pMdXpRRRAB",
            "text": "Muy ricos los tacos de Pollo, Carnitas y Chorizo 🥰🥰😍 saludos desde Holanda 🇳🇱"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxa1pEdWNnEAE",
            "text": "Great taste,  excellent food and service. Amazing show on Friday. Loved it. I'll be back again 💕"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNXF2RWF3EAE",
            "text": "The food tasty. Quick delivery."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbU16QjB3RRAB",
            "text": "The flautas only come with 3. I don’t mind but with no rice and beans? I purchased rice on the side and they serve it in a 8oz coffee cup. The chicken was so dry and it’s not even shredded (how chicken in flautas are usually served). I will not be returning to this establishment nor would I be recommending this establishment to any of my friends or family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsaTVLS1VnEAE",
            "text": "good service!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMnVHWlRnEAE",
            "text": "Pedí 3 piñas coladas y en una tenia un pelo para mi eso es algo 🤢🤮 deberías tener más cuidado"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGNjdTOHpRRRAB",
            "text": "Agradable lugar"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCd3JHQW93RRAB",
            "text": "Catered birthday celebration at another location and the food was superb. Delivery & set up were on point, such a joy to work with La Patrona. Highly recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxeE1QdmVREAE",
            "text": "Second time ordering and can confirm that La Patrona isn't bad, and also it's not great.\n\nTheir carnitas are unconventional and very well-seasoned. No crispy ends, and they use small chunks instead of large, juicy hunks, but there are hints of citrus and maybe cardamom (???). They're pretty good. 4 stars.\n\nTheir grilled chicken isn't my type, as they keep the chicken cut into large, hunky strips that are dry and lack flavor. 2.5 stars.\n\nLa Patrona's rice is verrry pale. One of my main complaints, as it lacks flavor. Their beans are meh. Very bland black beans with no extra thought.\n\nThe nachos never have enough chips or moisture. And while their chips are house-fried, they're incredibly thin. They'll almost dissolve by the time they make it to you. I've specified that I'd like extra in my order... Fortunately, I always have extra chips and salsa on hand to turn these into a pretty decent, certainly large meal. $12, 3 stars.\n\nPatrona offers a taco salad, and I love that! Actually this is one of my favorites, just because it's difficult to find. Because the rice and beans are bland, this dish won't astonish you. But the green salsa (otherwise wayyy too salty) makes for a good dressing. $12, 3.5 stars."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLZ0x5TFRREAE",
            "text": "Visited on a Saturday night and tried the special chicken with chipotle cream sauce and the hibiscus agua fresca, delicious meal! Will definitely revisit."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwMjhIeURREAE",
            "text": "Great food!! Love the decor, great music always playing; great service, it is going to be one of my regular spots, for sure."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPd1lPRnV3RRAB",
            "text": "Food was great! Vegan and vegetarian options and everything was delicious. The owner and server was very friendly."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaenJIRmlBRRAB",
            "text": "Pedí una sopa de camarones y solo me mandaron 4 piesas de camarones y lo demás fue una agua con zanahoria y lo peor q su agua salía muy mal no tenía nada de sabor"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadU9IWjBnRRAB",
            "text": "I may have just fallen in love.  Not sure how I got lucky enough to land this food at this time of night but thank you.  Three sauces came with my Quesa Birria.  All of which where delicious.  But the one that came right inside the the package paired perfectly with this pocket of perfect flavor.  I can tell that the people that prepare this food care about what they do.   I can taste it.  It's spicy, flavorful, quality ingredients and very well prepared.  Not cheap on the proteins.  Thank you  for a quality meal!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOE1LYW5RRRAB",
            "text": "This restaurant is very stylish, cozy, very clean, the staff is friendly and super professional the food is delicious. Yes it’s popping! It’s not that big but you can definitely come with a large crowd and they will accommodate you! The sangria tastes amazing! I will def be coming back! Thumbs up!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCai1fZW9BRRAB",
            "text": "I’ve had tacos and quesadillas from this place. Never disappoints. But the birria tacos….just WOW. The best I’ve had so far. They have a little kick to them which normally I wouldn’t like but the spices and flavors are phenomenal. I’m definitely making this my go-to for tacos etc. and the guacamole was great as well. The chips didn’t have salt which I prefer since, you know, tryna cut down. 😆 great food!! Excellent service"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4M0wtanlBRRAB",
            "text": "Started ordering from this restaurant a few weeks ago and I must say I have been thoroughly pleased with every meal so far! Everything is fresh and perfectly spiced and arrives in great condition on time. I especially love the flautas,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OC1IVmNREAE",
            "text": "Don’t be fooled by cute decor. NOT authentic Mexican food. Food is reheated tastes freezer burnt. Waitresses is inattentive and doesn’t care if you’re taken care of.\nWho puts cheddar jack in a burrito and peas and carrots in rice and black beans in a burrito."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4bHViMFZREAE",
            "text": "First time I ordered from this restaurant and i must  say the food was amazing! everything was fresh and good with such good mexican flavors So so happy. I saw someone had ordered the shrimp ceviche..they were right so good. I will definitely be ordering from  here again  they made my birthday dinner Great!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcTZMZWRREAE",
            "text": "I'm from Texas, which we're known for Tex-Mex. I live in NY now, and I tread lightly cause I know how folks up here can't cook in comparison to. When I tell you I just ordered two orders of steak tacos, thinking cause this place had high reviews it would be better. This is maybe the WORST tacos in NYC I've ever had! It was the tacos that had about 3 or 4 extra toppings, which I was thinking it would give it extra flavor. When I SAY YOU'RE BETTER OFF EATING THIS WITH COVID! It might taste better! There was ABSOLUTELY ZERO FLAVOR, there was no taste for the sour cream. No taste for the cheese. No taste for the flour tortilla. No taste for the steak. Steak actually tasted boiled. I'm so disappointed in the food in NYC, and this place just adds to the problem. I'd never try this place again. Ridiculous is an understatement for the lack of taste! NY air pollution has more flavor than these oxygen tacos! How embarrassing. The Bodega makes a better Chicken Cutlet Salad than this! Would it kill you to add some Sazon to the meat? Adobo? SOMETHING!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvajRXdnFBRRAB",
            "text": "Cozy little restaurant with flavorful food. Service is outstanding, owner makes sure you are well atended and satisfied with your meal and service. The Nachos are superb, so is the skirt steak. Please do try the Tacos, they are heavenly."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c1p6YS1BRRAB",
            "text": "¡Atención¡ a clientes que consumen en este lugar, se le hizo un comentario en esta misma página sobre un pedido que se realizó sobre cierta comida pero resulta que quiero realizar otro pedido y me dicen que no lo pueden realizar por que en…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3NkxUWUlnEAE",
            "text": "Not sure why all the great reviews. I'm guessing that perhaps their other dishes might be better and thats why. As for me, I've only had the tacos and guacamole there to take out so my review is based only on that. Chicken taco not bad, but not the best either, but pork taco even more lacking. It had a little bit of a weird taste like it had cinnamon. I like cinnamon, but not in meat. Perhaps that is a typical thing for them to use and they used too much? Not saying for sure that's what it had, but that's the taste I got. I absolutely loved their guacamole though, so I went back another day and ordered only that with chips for a game day snack. For some reason the guacamole was very different the next time. It was very bland and tasted like it had too much lime in it and started smelling a little bad from one day to the next even though I kept it refrigerated and it had not been double dipped into. $7.50 down the drain. A restaurant is supposed to be consistent with their dishes. I hate giving anyone negative reviews and wanted to like this place but I wont be spending my money here again. In fact, most of the mexican restaurants in this particular area disappoint. Mi Estrellita Poblana is here in The Bronx, 2 locations in other areas, and although not close to me, I would rather go there."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDdFpxZWxBRRAB",
            "text": "THE BEST MEXICAN FOOD  IN THE BRONX. TELL THEM MANNY ORTIZ SEND U YOU GONNA GET A FREE TOSTADA"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1dkxIUGFBEAE",
            "text": "El mejor lugar de new york para comer verdadera comida mexicana con el mejor sazón del chef.\nMe recordó por un momento estar en México.\nAtención 100\nComida 100\nVariedad de platillos 100\nPrecios muy accesibles."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2OWVpRkJ3EAE",
            "text": "I give 3 stars because this place is a hit or miss spot. When they miss I get so upset over the lack of love for culinary. I guess maybe there’s different cooks or the regular cook is losing his love for cooking.\nMy go-to plate is always the birria tacos or the quesa birria. Some days it’s bland, soggy and the consommé is way too spicy. Seriously so irritating to go through this.\nOther days everything is succulent, flavorful and the consommé we can put the left over broth over rice for lunch next day! So I’m really trying to figure out what’s the deal with the chefs here. Do they all not follow same recipe or does the owner just let everyone cook how they want to? Get it together before I end up at Don Chiles because they are more consistent!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLOHNERnl3RRAB",
            "text": "Ordered a chicken and shrimp burrito with pork tacos. The burrito was tasty - although I’ve had better - but no complaints. But the pork tacos were the best I’ve ever had hands down! I can’t wait to try the pork chorizos :)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLa0x1aGd3RRAB",
            "text": "I found out about this place on tik tok. I ordered chicken enchiladas with chips. The rice and beans were alright. Really good portions they give you a lot of pico, guac and chips. Chips could be shared amongst 2 people. Delivery was quick :)"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURja2JMWnRRRRAB",
            "text": "We love La Patrona Restaurant . I have family in New York and every time we visit we have to stop by and get some delicious food. The service is great and they also offer delivery through delivery apps.  My favorite dish is probably the…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTMHFDU0ZBEAE",
            "text": "Fish bowls are awesome. Food is awesome. Vibes are awesome. They have great social distance seating too. Packed on the weekends so be ready for about a 15 min wait"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MzktNklBEAE",
            "text": "This is a Cool Place.This is an authentic Mexican Spot with real Mexican food.\nThe service is good and our food came out quickly.Our dishes were tasty and they give good portions."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4cUx2eWpBRRAB",
            "text": "Rally good  Mexican restaurant, I love it  best food in the bronx"
        }
    ],
    "reviews_count": 71
}