{
    "name": "Hacienda Agave",
    "place_id": "ChIJI8z61xb1wokRdCyYtXD1Ghk",
    "grid": "BX1",
    "address": "496 E 138th St, Bronx, NY 10454, USA",
    "rating": 4.7,
    "user_ratings_total": 134,
    "phone_number": "(347) 270-2144",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNGExbE9VMDlHVlZneWJtRkNkRTFCV1hRd1RXYxAB",
            "text": "This place is exactly what I needed. The service was on point, and the food unbelievable.  Will definitely come back!"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toV2ExODRNME0xVTFFMVdqRldUa1ZCZDBWb1VWRRAB",
            "text": "Hermosa experiencia buen ambiente divertido y el karaoke uuufff divertido"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQk4waElabTF5YkZCQmVqVkxiM290YnpOelJWRRAB",
            "text": "Great Mexican food 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dWMzcHRUV3BmTmxaQ2JWSnZVbVpzVVhJMFUwRRAB",
            "text": "Good place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRGEyTkdOa1V4UlZWS01sWjRVVXg0ZERremRHYxAB",
            "text": "I have been coming to Hacienda agave for a while now, the food never disappoints, today I had their Guacamole for the first time and it’s by far the best guacamole I had in a long time! Do not hesitate to come the staff is also VERY hospitable they make you feel like you are visiting an old friend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wb1h6SmFjVUZYVDNKbGRHczNhazV5VG1ONlJWRRAB",
            "text": "HORRIBLE!! CAME FROM FAR AWAY\nWant it to give this a try it says they open at 1pm I get there 1::30 and still not open my cus had the same experience but I sed maybe it was a bad day for them but the same thing happen and I guess it’s tru they all get drunk Saturday and they open Sunday when ever they want I’m so mad but if this happens to you don’t waste your time and money come str8 to mexicosina small nice place amazing food fresh cafe de oya"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSWMyOTJRblUyV1hGWmIySjBhMEV0YURKSlZGRRAB",
            "text": "Everything was amazing here the food drinks and the customer service this was my first time and definitely not the last really good tacos and quesadillas."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sR1Qya3pNSFJEYTNSamFFcEVlWEpSTmxSNVFtYxAB",
            "text": "As soon as we walked in, we were greeted and seated quickly. It felt very homey, very spacious too! For appetizers we had: esquites and nachos with El Pastor (both were soooo good btw) our drinks: miche - la tóxica and agua fresca de limonada (not sweet and it was amazing). We were pretty much full but for our entrees we had: enchiladas de mole con pollo & tacos birria. Food and drinks were amazing. Definitely going back to try other foods. We spoke with Yair afterwards who let us know how long they’ve been opened and their purpose and events that are happening throughout the week. Really nice guy. Service was 10/10. They constantly checked in on us. Refilled our waters when needed. We’ll definitely be back! Bill came out to about $137. I think this will become our go to spot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kd1QxTlRNbUl0ZUROV1RVbHZlRkpqUlZGRlExRRAB",
            "text": "My favorite Mexican restaurant..\nThe food is delicious and the drinks are great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zdGJrRnVUbnBoZUhaUE1qbEdOVWxITUcxRWVtYxAB",
            "text": "This small establishment provides a welcoming atmosphere, treating patrons like family, which is a welcome development in the South Bronx."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRWJHWkNlRkkyTlhweFpUbE1abkZEVDBSUFNHYxAB",
            "text": "I was surprised to be charged close to $50 for just two margaritas. What was especially concerning was the automatic 18% gratuity added to the bill without any prior mention. On top of that, I was still prompted to leave an additional tip. This felt misleading and reflects poorly on the service and overall experience.\n\nEdit: Hi, thank you for your response. I appreciate the clarification, but I would like to point out that this was not a seated party — it was a simple drink order at the bar. Given that, I was surprised to see an automatic 18% gratuity applied, especially since there was no clear verbal mention at the time of ordering. While I understand that it's printed on the menu, it may not be obvious in situations where customers are not dining in.\n\nI also noticed that the prompt still asked for an additional tip on top of the gratuity, which felt misleading. I genuinely have no issue tipping for good service, but clearer communication would go a long way in avoiding confusion.\n\nThanks again for taking the time to reply."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preVJqRnRhRzR4YjB4Rk1tOTFRVXRIYlhoQllXYxAB",
            "text": "La Comida es una experiencia fantastica uno de Los mejores restaurantes en New York el servicio exelenten el ambiente muy familiar y ameno sin duda un lugar para regresar cada fin de semana  super  recomendado"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocE1WQmlORVF0TkRSWFpsSmhabVpmYnpkNVZXYxAB",
            "text": "Fun after work spot"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMMmQ4Ym1fZ2JpdHhnRRAB",
            "text": "Excellent service, exceptional food, highly recommended, a totally family atmosphere"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SGNHOVpZV1U1VkhJeFkyczNXVGQ0TW1OUmRFRRAB",
            "text": "Exelente servicio exelente comida exelente lugar super recomendadisimo!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTVZ6aDRPSEJ0Ym5oM1MyUm1WVjl0TVU1UFNHYxAB",
            "text": "10/10 recommend to come and have fun or just a drink. The waiters are amazing and let me not get started with the food ugh 😩. Too die for. Definitely one of my favorites place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcVl6YTNkczlqZmJREAE",
            "text": "This spot is an absolute gem. From the first bite to the final sip, it was all top-tier. The guac? Fresh and flavor-packed. The tacos and fish? Straight fire. And don’t even get me started on the drinks—pure magic in a glass. Add in flawless service and you’ve got a place that doesn’t just serve food, it delivers an experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSEQxZmZUbU1XeVNnEAE",
            "text": "This place is such a gem! The service, ambience, and food were excellent. One of the best guacamole I’ve ever had! The chicken tacos were perfect as well as the drinks. Came for happy hour and would definitely visit again when I’m in town."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMktEX1hnEAE",
            "text": "Beautiful restaurant, the margaritas were delicious as well as the food! The staff is very friendly and attentive."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvelBXeVR3EAE",
            "text": "I think this is the best Mexican food I have ever eaten. High end feel and taste. Spent more than I expected but was well worth it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva2I3bERBEAE",
            "text": "This place is overpriced. My partner and I had tacos and water and it came to $70. The food was ok but nothing special. They have the nerve to add a 1% restaurant fee and an 18 % tip to the bill. Their loss because I usually tip 20%. Never going back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJck5QYUl3EAE",
            "text": "Honored to leave the one hundredth review for this lovely restaurant. We had a delicious dinner with beautifully crafted cocktails. The service was excellent and so was the ambiance. Great for a date night or with family, highly recommend!!"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNV9EQVd3EAE",
            "text": "La comida de Calidad y deliciosa! Las margaritas recomendadas! La atención y el servicio 10/10! Lugar para compartir en familia y amigos!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbk8tRFRnEAE",
            "text": "I can't comment on the food but the drinks are such a scam, it's a $46 bill for TWO margheritas, and the slimiest thing is they force a 18% gratuity in the receipt that's never mentioned and ON TOP OF THAT still ask for you to tip! Sleezy behavior and service"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcE9qbXZBRRAB",
            "text": "The food was so fresh and a party in my mouth I tasted every ingredient and the drinks were off the chain I recommend this Mexican spot a needle in the haystack"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcEtpZnFnRRAB",
            "text": "This place hands down one of the best authentic Mexican restaurants the food was 10 of 10 stars. The drinks and the food and the people perfection."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXNETmxnRRAB",
            "text": "This place is amazing. It’s pricey but the food is delicious. Very lovely restaurant."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncXV1ajV3RRAB",
            "text": "Friendly staff. Music is also nice. 10/10, recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncXJ1UXNRRRAB",
            "text": "Very nice staff and atmosphere. Definitely recommend to anyone looking for delicious and authentic Mexican food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLUttSGV3EAE",
            "text": "This place is amazing! The food, the drinks, the atmosphere is done just right here"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbGRhM1R3EAE",
            "text": "El lugar es bonito y las micheladas muy ricas, pero cobran muy caro por una michelada, en el\nMenú del sitio web dicen que valen $11 sin importar la que cerveza elijas, en el menú del restaurante $14 con Tecate o doble XX y si quieres diferente te cobran 3 dólares extra, te cobran fee cuando pagas en cash y al final terminas pagando 18 dólares por una michelada y si eliges cerveza diferente $21\nMuy caro por una michelada y coda no soy, pero tampoco que abusen."
        },
        {
            "date": "수정일: 9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWbDQ2ay13RRAB",
            "text": "Excelente toda su comida!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX1l6d0JBEAE",
            "text": "Customer service amazing!! Authentic Mexican cuisine in sobro! Check it out"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeGU2azRnRRAB",
            "text": "Best Mexican restaurant in the entire area!!!!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeE1IN0dnEAE",
            "text": "El servicio en Hacienda Agave es impecable, con un personal atento y amable que hace que te sientas bienvenido desde el primer momento. Probé el aguachile negro, y fue simplemente espectacular: un equilibrio perfecto de frescura y sabor, con ingredientes de excelente calidad. Definitivamente, un lugar al que vale la pena regresar."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MVBuVDRnRRAB",
            "text": "Great food. Environment is very cozy and the staff were welcoming. Stumbled upon this restaurant and immediately welcomed by Jair, the restaurant manager who encouraged me to try the food. Being vegetarian, I ordered a black bean taco during the happy hour and it was flavorful, delicious & hit the spot. I’d definitely recommend this restaurant to all. I’ll be visiting again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MUxuZlVBEAE",
            "text": "The chicken tacos were tender and flavorful and the mango Margarita was smooth and tasty. This will be my regular taco Tuesday space thanks to Jair."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dlp5T05nEAE",
            "text": "Un sitio muy acogido y súper bonito,limpio, decorativo ,agradable y los camareros súper atentos y amables ,  la comida espectacular y casera.\nVale la pena pagar.\nMuchas gracias!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdExma1hREAE",
            "text": "So this place opened up less than a year ago.Me and my husband have definitely been here at least 4x  ... Let's start with the bartender ( same guy every time) his personality is absolutely amazing.The whole atmosphere is insane.Lee literally like a breath out of the Bronx for a minute... I can't stress their shrimp tacos enough... it is my ultimate favorite but I also had prime rib taco's last time &  beyond 😋... Me and my husband have date night at least 2x weekly & if you want an intimate atmosphere that's décor is beautifu. l.Music is mexican music which is very fitting but know this \"you're gonna spend money\"  for 2 ppl a shot and a Margarita each then an entree. y  appetizer is gonna.\nCost you around $200 and it's worth it every time!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcE1qTFdBEAE",
            "text": "Amazing food and amazing service. I shall be back!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdHE3MktREAE",
            "text": "Hacienda Agave!! Es un lugar que te ofrece un ambiente agradable, familiar su personal es amable,buen servicio y disponibilidad... Sigan así muchachos ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYN3F1SEJREAE",
            "text": "Food was absolutely delicious, I would recommend the sopes and aguachile. The martini and jamaica were very tasty as well. The chips and guacamole were noticeably fresh. Lastly the churros and ice cream were a great end to a great meal. The decor is lovely and service very professional."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOHBUSWRREAE",
            "text": "Para mi es un excelente lugar para comer y cómo yo soy un soltero y trabajo duro me merezco comer sin importar el precio mucho personas se queja los precios de comida pero ama ati mismo si piensan que tu cuerpo se lo merecen comprártelo disfrutarlo"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOWZIb0hnEAE",
            "text": "Muy buena vibra !"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudHRlQnNRRRAB",
            "text": "!Omar muchas gracias  por tus hermosas  atenciones... nos vemos pronto ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucFpqVEh3EAE",
            "text": "Wonderful experience on both times that I have come here. The service is super attentive and the food excellent…hand made tortillas, delicious sauces with deep flavor, and meats cooked to perfection. 10/10! So glad to have them here in the Bronx."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNFpxazJBRRAB",
            "text": "It was a very nice place, they just opened a few months ago too. The atmosphere was great. There is a DJ on Wednesdays (it can get a little loud but we lived the vibes) Drinks are spectacular. The waiter and whole staff were very attentive and friendly. Even the manager was helping out and talking to every customer. We were a group of 4 and our bill was high ($400+) just because majority ordered 3 drinks each and 1 shot each. *Be aware: on your bill they have a restaurant fee? Which was weird because we never heard of that or seen that and we go out a lot… and they already charge gratuity in the total bill which is the waiters tip btw ! Once you get the receipt it shows to tip, do not tip. It’s just a trick to double tip! * anyways that’s why 4 stars….\nSo overall, it’s a little pricey but the food was great. I wouldn’t go on the regular just for special occasions: birthdays/celebrations."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeGJXTEZnEAE",
            "text": "Nice after work spot.  Happy hour is from 3 to 7. Drinks were $10.00. The tacos were tasty.  The atmosphere was calm.  They have a big swing you can sit on and take pictures."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOGEtSU53EAE",
            "text": "Overpriced and Overly Loud\n\nThe food was completely underwhelming, especially for the price. To add to the disappointment, the restaurant was so loud that we couldn’t even hear the server. The  loud music made it an unpleasant dining experience. Save your money and go elsewhere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIenU2Q29RRRAB",
            "text": "The food is my favorite in the neighborhood and just like eating in Mexico - quality, fresh ingredients, flavor, variety. I’ve had the tuna tostadas and birria tacos at least 4x and they’re incredible every time. Baja fish tacos are 💯. DJ on Wednesdays, karaoke on Fridays and Saturdays. And THE BEST service, you can tell they love this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc09yNHd3RRAB",
            "text": "this newly opened restaurant is a breath of fresh air to the neighborhood.\n\nthe food is delicious. the care is visible in the plating and presentation. the authentic Mexican flavors shine in their dishes. the portions are large and filling but not overwhelming.\n\nthe service is top notch. our server was friendly, knowledgeable, and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdE5DWkRnEAE",
            "text": "Love this new restaurant. The staff were really nice and attentive. The hibiscus margarita is made with an authentic hibiscus puree, and was absolutely delicious.  I had the special kebabs which aren’t on the everyday menu. The steak was flavorful and tender and I couldn’t get enough of the accompanying salsas and chimichurri.  I also had the tres leches cake which was good but didn’t need the extra sprinkles, it made it a little too sweet. Can’t wait to go back and try more of the menu. They have live mariachi on Fridays and Salsa on Saturdays. Great addition to the block!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqa0xuRUd3EAE",
            "text": "the best birria i’ve ever had, some of the best customer service i’ve ever experienced. all of the food was so tasty and fresh, wishing them tons of success in the future. mango margaritas were also delicious, the perfect ratio of alcohol to juice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NTZuNEtnEAE",
            "text": "This place is the best , they make you feel welcome. Food everything is delicious. If you just want to just randomly pick you won’t be disappointed. Drinks the bartender takes pride in making drinks. Drinks are awesome, I recommend this place you won’t be disappointed 🙌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidEp1WFVnEAE",
            "text": "I have always wanted to try this spot out since I seen they opened and today was the day. My waiter was amazing and had great customer service skills thank you. Now the food was outstanding. For appetizers we had the puplo with pineapple potatoes and Roja salsa amazing starter. I have the Roja chicken enchiladas and my partner had the nachos with carnitas. The food plate presentation was beautiful and looked delicious. We also had drinks I had the margarita with passion fruit and my partner had Michelada/toxica. This is my new spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMFp5cWh3RRAB",
            "text": "I rarely take the time to write out reviews but this was probably some of the best service I’ve gotten in a long time. The guy who was bartending really made my experience. The drinks and the birria tacos was amazing. I’ll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdGJ1T1R3EAE",
            "text": "I’m actually here can’t wait till tomorrow to let you know you have to come down here.. best food, drinks and service (bar-Omar), live dj, I’m having the best time !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNktMWGxnRRAB",
            "text": "Food is amazing highly recommend Birria tacos. Superb service 💯"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkb3YyVUp3EAE",
            "text": "Un lugar perfecto para pasarla en pareja o solos, excelente atención, servicio y decoración.\nUn lugar acogedor e instagrameable.\n100 % recomendado"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdFlmVEZBEAE",
            "text": "The food extremely good, the drink too good, everything is amazing, I recommend this place, the bartender Omar always makes sure that everything is fine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5anB6TS1BRRAB",
            "text": "Always breaking my diet here😮‍💨 I Can not describe how good the food is, you just have to experience it yourself."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdDliNjNBRRAB",
            "text": "Amazing food and drinks the best Mexican place in Bronx ..!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOUt5eFBREAE",
            "text": "Rich and freshly curated food , made with love and delight! The staff and chefs are super hospitable !"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbnRyd1hBEAE",
            "text": "100% recomendado. La comida exquisita  pedimos un guacamole, un molcajete las carnes en su punto y la salsa ni se diga, tortillas hechas a mano, lo malo solo trae 3, pedimos una orden por separado, las margaritas muy buenas las primeras, las segundas para mi opinión les falto tequila. Fuera de eso, me gustó el sitio, la decoración de muy buen gusto 👌."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWN1BuV21nRRAB",
            "text": "La comida estuvo deliciosa, el servicio excepcional, muchas gracias por una grata experiencia."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyenJ2NnV3RRAB",
            "text": "Tuve la oportunidad de ir hace un tiempo, la atención por parte del personal es excelente, son muy amables, la comida es rica solo creo que es cuestión de uno que otro detalle sin embargo fenomenal. Realmente es un lugar muy agradable para ir con familia y pasar un rato agradable, sin duda alguna iría nuevamente. Mis mejores éxitos para este restaurante."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZ2NQZG1BRRAB",
            "text": "It was my first time today, and it was amazing!! Definitely will be back for the drinks!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3OWFUMXFRRRAB",
            "text": "Vegan and veggie options... just ask the server!!"
        }
    ],
    "reviews_count": 68
}