{
    "name": "El Valle",
    "place_id": "ChIJAwMPh8j1wokRyjIcgCEa2ZY",
    "grid": "BX1",
    "address": "640 Melrose Ave, Bronx, NY 10455, USA",
    "rating": 3.7,
    "user_ratings_total": 771,
    "phone_number": "(347) 271-9191",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210QlJEbFlhWEZ6ZERoMlRuRnBiVjh6UVVsZlEwRRAB",
            "text": "The food is nasty always dry taste horrible no way to enjoy a lunch its so sad"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNVZFVnVVV1JrYVZSb0xUWk9PV3RZU1VJMlpGRRAB",
            "text": "The sancocho was AMAZING!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTFgydEVka2R3V0VFd2RrcFJkVmxHWldKQlMwRRAB",
            "text": "I ordered via Uber Eats told them in Spanish that I was at work and no utensils to please ad them. Now I have food but no way to eat it. Beans no spoon, rice no fork, grease fingers now to drive valet cars. I’m very upset. Had to brake a soda cover to use as a fork. Website not working."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MnBXampnRRAB",
            "text": "People are rude and sancocho soup was so oily omg soup is not supposed to be oily like see the pic they charge 15 dollars and with hardly no soup"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ob09HTlNSekpvYkRCMGJFbFdTbWhsYXpoUGRYYxAB",
            "text": "It’s the Go to Spanish food\nRestaurants space a little crowded even if empty.\nJust not ALOT of space with people walking around and coming in and out.\n\nDelivery is slow,\nService is Iffy\nFoods Good. 👍🏽"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUVRIWm5WMmhXUVZZM1FsaHljVkp5VmpWSWNGRRAB",
            "text": "Ordené un sancochó y estaba horrible el sabor era a chivo, es algo desagradable, solía comprar aquí muy seguido pero ya se dañaron, aparte de los jugos supuestamente naturales  y los venden aguado. Llame para decirle q no me gustaba y lo que me dijo q no podía hacer nada."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSVEwMXNlSEZ1VGswM2JWZzBSeTExZGxKNFNIYxAB",
            "text": "So it’s like 11:02 they close at 12 I’m being rushed, they locked me in by closing the gate\nso one can come in, then gives me attitude. N this is with all ppl of color I see them always have an attitude no one smiles in that place as a person of color I don’t feel welcome to eat there"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobFpHYzBWWE55ZVVKT2VWOW9aV3ByWWtGS1YxRRAB",
            "text": "Order a oven chicken and i recieved all burn not satisfied with the services as well recomend not to buy food from this location......"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPNl92ZF9DaG9uSkhBEAE",
            "text": "Basic Dominican restaurant. Very good service and the food is great and affordable.\nWish they had a in-house hot sauce vs just packets"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKUDVuTi1ueDdqeTFnRRAB",
            "text": "Bland.  Maduros were def over done and the oil must've been old.\nRotisserie chicken was good flavor, but dry."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLRFVpdV92MFphU0RBEAE",
            "text": "To expensive"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLem1vdENyeTdtWFJBEAE",
            "text": "The best"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMXy1fSkwzdk5pcjN3RRAB",
            "text": "Nice little restaurant with great food. Sevice was with a smile."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMFlfTlBBEAE",
            "text": "I placed an order from this restaurant pork chops with white rice and beans, plus an order of boneless chicken chunks and fries. I called at 8:35pm and after over an hour with no delivery, I decided to call back to check on the status. Every time I tried to explain my order, they kept hanging up on me. It was beyond frustrating. It’s now 9:30 pm and I still haven’t received the dinner I was really looking forward to. I don’t usually leave complaints, but this restaurant seriously needs to improve its service!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNTYzQWJREAE",
            "text": "Horrible servicio al cliente\nEs la 3ra vez que ordeno y siguen mandando lo que quieren, no escuchan lo que uno pide en realidad y cuando llamas te contestan con actitud.\n\nHorrible"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdDdQZ3JnRRAB",
            "text": "La comida carisima y no saben hacer batidos 😩😩…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRN042eTJBRRAB",
            "text": "Love this spanish food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbDhXVzZ3RRAB",
            "text": "I have always ordered from here and never had an issues before today I order a sancocho and rice the sancocho was supper salty I couldn’t even enjoy it I called and the put me to speak with the manager she was abruptly and told me that she could not do anything because I was the only person that had complained about this. She was very dismissive and didn’t even offer to exchange the food. I was very disappointed because I very si k with the flue and felt the need of a soup but this restaurant destroyed my order and on top of that were very dismissive and rude. Unfortunately I won’t be buying from them again."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJaXZfRzlBRRAB",
            "text": "Always Amazing Service!!! Been goin there since the other location. Amazing, Amazing!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeTZiaGFBEAE",
            "text": "My friend and i visited this spot and the food is very tasteful and delicious! The chef made the quality food with love and passion."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDMy1HdUxnEAE",
            "text": "This place use to serve good food. I ordered a combo $40. Food was cold and no flavor on the beans. Chicken tasted like it's been sitting their all day. Very disappointed and a waste of money. Never again will I ordered food from here. I rather eat Chinese food next time. YUCK!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NElMcnNBRRAB",
            "text": "Visited here was assisted by Saul who interpreted for me and made sure I had everything I needed and informed ne about the lunch special as opposed to buying everything separately he is an asset to this restaurant"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvMEpMSGV3EAE",
            "text": "🥰🥰🥰🥰"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LUpMbHhnRRAB",
            "text": "I ordered food for my parents from El Valle Restaurant through the Seamless app and I received a text notification that the order was completed and the delivery was made. However, my parents did not receive the food and when I called the courier he did not answer. I then called the restaurant and they said that the order was actually not completed because they did not have chicken. The restaurant should have called me to tell me they did not have chicken but they didn't do that. I requested a refund from Seamless and I will not order from this restaurant again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NkszTHp3RRAB",
            "text": "This is an  amazing place and the food is DELICIOUS wow!!  It’s everything you need when you want to dine in with your family. The  owner and  employees make you feel very welcome… I love it! I will definitely keep going…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaW8yeU1nEAE",
            "text": "I have been having difficulties here lately, but I work in hospitality so I let it go.\n\nCame in tonight to order tostones to go, left and came back 15+ minutes later so I can watch them talk about giving away my tostones to a table instead and take it out of the to go box and plate it while\nI’m standing there asking to pay. Everyone understands Spanish in New York, please be professional"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcUtXZHRRRRAB",
            "text": "Too expensive"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNGUyNk9nEAE",
            "text": "Quite clean place to eat, good food also"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueTVyZ3J3RRAB",
            "text": "I use to like the food but tonight I would have love to have my beans with no bug in it 🤢…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NmF6ZmdBRRAB",
            "text": "The food use to be top tier now they fell off…dry rice dry chicken, i don’t know if i have to go in personally to order food but the food that u get through Grubhub is trash ..they love to give the old food to people who order through a third party app"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NlA3U2FBEAE",
            "text": "Food is always amazing at this el valle unlike others the rice is always fresh and never hard"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvMFA3YUh3EAE",
            "text": "Good Dominican food and a clean friendly place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNia3NIdXdnRRAB",
            "text": "Food is bland, with no flavor and they overcharge you for a plate of vegetables , rice and beans ($15). They also don’t have any avocado and they’re supposed to be Dominican?!? Take it from an actual Dominican this is not real or well cooked Spanish food."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyal9UVlVREAE",
            "text": "Muy buena su comida cocinan bajo de sal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6bHR2TXdBRRAB",
            "text": "Good food"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUellMTWxBRRAB",
            "text": "👍 👌"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMVphdEtBEAE",
            "text": "Muy mal servicio, fui a comprar un salcocho hoy aparte que me cobraron 15 dólares no le hecho carne."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cDh6WENnEAE",
            "text": "Food is good, they just charge to much for a plate that's just rice and beans.....$15 for mad rice ,a bowl of beans and literally 3 pieces of oxtail  with half spoon of gravy on rice...smh should have stuck to chicken"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eWVhdTN3RRAB",
            "text": "Todo muy bueno"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOajVmajF3RRAB",
            "text": "Good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcWQzcFpBEAE",
            "text": "The driver came and hour late and they messed up my order …..they get no tip from me"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxN01XaWZREAE",
            "text": "Food was on point! 3 Golpes is the best here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWNm91Y2hBRRAB",
            "text": "Been before but friends ordered Tres Golpes / Mangu with everything. Es muy delicioso!  Didn't get to take a pic, was so good.  They did it right! 😋"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZbUtpaWxBRRAB",
            "text": "Great and amazing place, highly recommend eating here. El valle is a homely and authentic Dominican restaurant serving up some of the best dishes from Latin America. If you have a sweet tooth, I recommend the habichuela con dulce or the…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDanZPTm53RRAB",
            "text": "On a scale from 1-5, delivery time, the food & service are usually a 4. However, there’s 1 cook that loves salt! A tragedy lead me to buy food from here for a whole 2 weeks & as you can see the lasagna has no cheese & more over its so salty…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRX1l5R2JREAE",
            "text": "What a spread, great food, good people and of course, baseball playing on their two wall mounted TV's."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNTRxY0R3EAE",
            "text": "Horrible! Ahora estoy aqui parade y las personas que trabajan aqui ni cado me hacen y le digo lo que quiero y se quedan como que soy invisible. Muy mal trato"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocElHc2RnEAE",
            "text": "This place is so good as in food but very bad customer service. If you don’t speak Spanish don’t place a order over the phone because they continuously hang up on you until they can find someone that speaks English to take your order by then everyone has an attitude and the food comes to your home cold and like it came out of the refrigerator and just heated up, doesn’t taste as good as it would if you ordered it in person it’s something personal against English-speaking people I only gave this a two star because the food is good, but the people are not."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcGNLZDJ3RRAB",
            "text": "Food here is always great but when they mess up the order they do not give money back and they don’t have quick enough service to correct your delivery order. Money lost. Other than this they are great"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ejg3VFJBEAE",
            "text": "Food is always fresh and delicious. Current staff work the establishment like a well run machine. The staff has a team mentality that helps get customers what they want quickly while providing good customer service. This El Valle does not disappoint!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1bTY2QlpnEAE",
            "text": "The food is too good here I come like every other day I can’t help it lol. Food is worth your money."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvMFBiTnlRRRAB",
            "text": "Great food,  however they suck at service. The ladies try to beer polite but they're over worked. They're poorly organized. The 2 or 3 ladies that work the counter are running between taking orders from customers at the counter, the phone…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad2UtR3h3RRAB",
            "text": "Today I didn’t like the food the rice was cold and old and hard. And the beans were extremely burnt. I never have problems I order from here so much they always tell me my address and name before I tell them. Smh I was very disappointed in the food today tho."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMTZPTmZ3EAE",
            "text": "I had ordered a paella with seafood. NEVER again. There was barely any seafood in it if any at all. Only found two shrimps and the big bowl of rice they sent. It was enough to feed three but it was basically just rice with peppers. They…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNa2JPeF9BRRAB",
            "text": "super service great prices and great products"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTd3VPZXBnRRAB",
            "text": "This has been the 3rd time I order from\nThis place and will definitely be the last One.\nAs the other 2 times my food got here almost 2 hours late, it also got here frozen cold and to top it off the delivery guy said “he didn’t have change” and gave me my change one dollar less\nAlso I’m only a 8 minute walk from this place and every time I have to wait an over an hour and half for bland, overpriced cold food. To only get an “I’m sorry it won’t happen again” from the manager and it DID, twice ! If you’re from the morrisania area in the Bronx don’t ever order from here you’ll only be disappointed"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJMjRYRHR3RRAB",
            "text": "The food is undeniably good BUT I do not want to go again because the waitress with the stink face is ALWAYS assigned to attend to me whenever I go... She is so rude. She has ignored me when I greeted and Thanked her. Her vibe just kills my…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvMFBxTElnEAE",
            "text": "This place have terrible customer service.  All the waitress stay behind the counter. The food is good but no one comes to your table and you have to get up to oder and still then the waitresses are just gathered talking nor paying…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURncmR5OTVRRRAB",
            "text": "ok. so let me start this off by saying this chain is pretty good. except when it comes to this specific location. i went last night to eat and it was terrible, everything. the waitress took forever to come. when she did and we ordered the…"
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReUlITmNBEAE",
            "text": "I had the paella and it was great. Very fresh seafood. My only complaint was that it was a bit dry, otherwise I would have rated it a bit higher. The food portion was large, the paella was enough for two. Overall, good clean place, nice atmosphere, and fresh quality food."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMnVHbjJBRRAB",
            "text": "Food is good. The prices have went up. & They can work of their customer service skills.  They will forget to take your order once you've been seated and after you're done with you're meal they will take 15 mins to bring you your check."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReWJhOHh3RRAB",
            "text": "My experience here was ok. The food is great depending on what you order. They specialize on dominican food. Do no order there mozerella sticks. They're frozen and they don't cook it all the way through. Order take out it's cheaper than…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdm9qX0h3EAE",
            "text": "Good food. Subtle racism as with any other Spanish restaraunt. They serve black people last even if there's no one ahead of them. I patiently waited as the server acted like she was busy doing a bunch of other things instead of serving the customer in front of her. I'm not surprised."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDd1pibVF3EAE",
            "text": "Overall great food I’ve been eating here for a while\nSometimes depending what day you call it’s hard to get tour order across if you don’t speak Spanish but they try their best . Chuck chucks are always a slam and…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaVo2YVBBEAE",
            "text": "Es un lugar pequeño y limpio.comimos un jamón slices, huevos fritos y unas papas como hervidas y sazonadas con paprika. Pedimos pan tostado y estaba un poco duro y grasoso. Pedí limonada y está demasiado dulce le faltaba más sabor a limón. El personal muy atento y amable.\nRecomiendo el pollo a la varita,con arroz y habichuelas. Para los niños no hay facilidades ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1cHJqNFFBEAE",
            "text": "Food was hot and fresh. Good, fast and friendly service. Small quaint tables. Very clean atmosphere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyZ3Y3dFVREAE",
            "text": "I am horribly upset about what happened. Okay first, I wanted cheese pastelitos and they gave me beef. Second of all, I call them informing them of the mishap and they said they would give me my right one. MIND YOU, I already opened the bag with the beef, so I didn't think they would want it back. GIRL, tell me why they wanted to exchange it for my actual order. I asked them if they were sure cause its not sanitary and he said yes and he even called his boss. Tell me why, the minute I went inside to get the wrong order, the boss tells him to LEAVE and he leaves with my actual order. I WAS FURIOUS. Never again. If I could give them a zero, I would. Do NOT order from here. Thank you."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXeHNtNTF3RRAB",
            "text": "Dicen que abren a las 7:00 am y son las 7:16am y no an abierto aún en el 640 Melrose"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvMEpxSElREAE",
            "text": "Worse place to order from I advice no-one to order from here, I had the worse experience ever ordered food from this restaurant's at 6:20 pm and when I called the restaurants 7:42pm to ask where is my food they said the delivery man had…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteFpMUmlBRRAB",
            "text": "The food is usually really good but they are horrible when you order over the phone. I’ve been waiting an entire hour for my order and when I called back to ask about the order, they hung up on me twice. Once I ordered from them and they didn’t even come. Only get food from them if you’re going into the restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyLTlTLUZ3EAE",
            "text": "Ordered the stew chicken with rice and beans (separated.) It was VERY EXPENSIVE.  The restaurant included a menu with my order and the price of the stew chicken is not even listed. I wouldn't care if the food was on point but the chicken…"
        }
    ],
    "reviews_count": 71
}