{
    "name": "Mr.N seafood market",
    "place_id": "ChIJsZSdMsj1wokR2Y7o9o0YTy8",
    "grid": "BX1",
    "address": "351 E 138th St, Bronx, NY 10454, USA",
    "rating": 4.5,
    "user_ratings_total": 44,
    "phone_number": "(347) 340-4910",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRmExQjJjRzUyV2sxeU0xZE1NVGx2YWw5dlNYYxAB",
            "text": "Had steam salmon, shrimp, potato’s, corn and broccoli. All I can say I’m in a very delicious food coma.  I can’t move.\nI also had a crab stick while waiting for my meal and it was very fresh.\nThis place is clean."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWGRtdFJXR3h0YzNNeFNVWmhWelZqT1RaSVVuYxAB",
            "text": "Mother and father is nice, but their son is nasty.Don't go he's ready to fight"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRFFrSnBhbVE1Y2xrME9WSkVaMnBQU2xRMGFWRRAB",
            "text": "I’m only rating it low because the truth is I didn’t get to order I got there as someone was preparing to open . As a person who’s been I. Food service myself for over a decade the low rating is because of the slightly aggressive tone in which the worker was asking what I wanted and in a round about way letting me know he wasn’t prepared to open for full orders. Word of advice to the owner in the future when google says you’re open that means open and completely ready for full business. I had actually heard great things about this place but if my friends and I go back I hope the interaction is a bit different. 🖤"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUFdFd3pVV2xpUW1WQldHaEJTV2RNYm1aeloyYxAB",
            "text": "I Literally Stopped To Write This Review After Only Two Scoops!!!!!!! AND A Callback To The Restaurant to Let Them Know How OVERLY Satisfied I Was.. About A 25 min Walk From My House Which I Didn’t Mind Nice Cool Day After The 3 Day Heatwave We Just Had. I’m Originally From The Area Moved A Long Time Ago So This Place Wasn’t Around But It’s EXACTLY What The Neighborhood Needed!! The Food Was Amazing! as Well As The Service. I Was Properly Greeted, Assisted With Any Questions I Needed Answered as Well as Recommendations Food Came Out Fresh,Hot & Made to Order Nomore Than 15mins of Me Being There. Hands Down 9 out of 10 And Only Because I Should Have Gotten It A Little More Spicy & Ask For Some More of That Damn Good Sauce The Shrimps are Cooked In Lol.. THANK YOU SOOOOOOOOOO MUCH AGAIN!!! I’ll Definitely Be Returning at Least Once A Week."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOLXN6dUhFai1LYTh3RRAB",
            "text": "Rude over the phone"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcF9MVTJBRRAB",
            "text": "Everything was perfect ! The food the staff the store everything ! 10/10 came all the way from Westchester for this! Thankyouuuu"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdDZiWXZnRRAB",
            "text": "I love the food I love the soup I love this place no Bap"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubUpHUkhnEAE",
            "text": "Just moved into the neighborhood! Mom and son have some of the best hospitality I have seen in a while. The seafood is fresh! And you have to try the ice tea!!!!!!!!! Best I’ve had in my entire life. Will be a regular going forward."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucTR5d0hREAE",
            "text": "What an amazing place !!! The service is exceptional! The food was amazing !!! The place is soo clean!! This is one of my new favorite  places to go for seafood! Thank you for an amazing experience !!!!! This place is a GEM. If you thought about going here, JUST GO. You will not be disappointed. They are amazing !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNDh2blBREAE",
            "text": "The food was Absolutely Amazing!! When you walk in, you are greeted by Ms M, who is confident, gracious, humble, & accommodating to all of her patrons! I had the orange top with braids! Get that drink with the ginger; it will set your meal just right. Sending a shout out for real to all the staff! Don't ever change for anything; you will be Abundantly Blessed! To the community, Bronx News12, & the Preceint up the Block, pull up at least once you won't regret it. For those coming from outer boroughs or areas, this spot is fire 🔥 Peace & Blessings to Queen M. May you prosper in your business!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aE1HY1hnEAE",
            "text": "The butter sauce everything 😋 the food always fresh..…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdTR5MnF3RRAB",
            "text": "Solía comprar mis mariscos en este lugar pero he visto que el hijo de la dueña trata mal a los clientes sin motivo alguno. Puse mi queja directamente con ella y espero hagan algún cambio"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdGN6al9nRRAB",
            "text": "Love them the food is really good and fresh and stay open later then most markets that's a plus in my book"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsaGZlNWtnRRAB",
            "text": "My first review was excellent as it was my first time there and in person but theres been a change since dec 1. My husband and i decided to place an order over the phone since we werent feeling well and it was a totally different experience. The young man was so rude and even hung up on me because I was speaking to my husband in Spanish because he is Spanish dominant and I had to explain what the young man was saying. He did tell me in Spanish before hanging up that he spoke the language too. I explained I know we are all bilingual but my husband understands better in Spanish. I shouldn’t have had to explain myself. Needless to say we weren’t able to place our order and we wont be back in person either. Treat people with respect as you want to be treated too. Que dios lo bendiga."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1NF9fZ2tnRRAB",
            "text": "Not only a good seafood market but also stellar food. If you told me you traveled from other boroughs to eat here, I'd commend you on your good taste. The owners are welcoming, the seafood is fresh, the menu is huge, and the dishes are so flavorful. Writing a review even though I can't stand review culture because I appreciate this local spot so much. And because the good taste of garlic butter shrimp compels me. Really impressive place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab3RIT1pREAE",
            "text": "IT WAS THE ICED TEA WITH GINGER THAT GOT ME. I WASNT FEELING WELL AND THE BEAUTIFUL CONVERSATION AND CUSTOMER SERVICE WAS WHAT SOLD ME. GOD BLESS AND THANK YOU FOR KEEPING THE CULTURE ALIVE 🇭🇳"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMmZyQ19RRRAB",
            "text": "I love there food and service they are great. ❤️💯"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbDkzb1hBEAE",
            "text": "Buen servicio, buenos precios, excelente comida!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdy1uNjd3RRAB",
            "text": "Cocina delicioso"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M0xleFl3EAE",
            "text": "This place is amazing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoM3B1cElBEAE",
            "text": "Tried them for the first time today. Food was great. Customer service even better. Will be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoai1Xbm1nRRAB",
            "text": "10/10 I highly recommend best seafood I’ve ever had"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoaXBIZndBRRAB",
            "text": "I had lunch from here today.  The owner was very friendly and the food was great.  I'll be coming for lunch more often."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbWFQZ0VnEAE",
            "text": "Best seafood ! Love the flavors in their food!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNlptTUZnEAE",
            "text": "Best seafood in the Bronx mother and son are always polite and nice everybody needs to come and support them"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlN3BtZUV3EAE",
            "text": "The food was amazing and very delicious. The customer service was off the roof, highly recommended to eat from this establishment"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlN3JIcDhnRRAB",
            "text": "Amazing, definitely recommend. Very nice staff and welcoming environment. Will definitely be coming back soon 😋"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlc3MybDZ3RRAB",
            "text": "The mother and son are such caring individuals. Thank you for contributing love and fresh fish to the community."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyc3BMcFJ3EAE",
            "text": "They must have a secret to how they make this seafood cus hunnnyy!!! I Did a review from my hubby account and had to come add some more details!! The staff there is veryyyyy nice!! Pleasant and helpful!!! I’m eating as we speak and can’t put the fork down!!! Keep Up the good work Mr.N.. BOMBBBB!!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyc3VMMDBnRRAB",
            "text": "I came here today because I used to live around the way and was visiting friends.This restaurant was never here so I decided to try it.. and I’m glad I did!!! The food was amazing better than any seafood I’ve tasted.. I live uptown Bronx…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXclBpeEt3EAE",
            "text": "Love this market! Mother and son are so kind, fish is fresh! Highly recommend!"
        }
    ],
    "reviews_count": 31
}