{
    "name": "Mummy's Caribbean Kitchen & Bakery",
    "place_id": "ChIJhdF8yO31wokRX7TONBCSH3M",
    "grid": "BX1",
    "address": "557 E 137th St, Bronx, NY 10454, USA",
    "rating": 5,
    "user_ratings_total": 17,
    "phone_number": "(347) 591-0103",
    "reviews": [
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscXVtcHVnRRAB",
            "text": "Oxtail... One of the best I've had.  Sauce delicious with rice and peas. I havent washed my hands yet before typing this review.\n\nI was passing by on way home. And now I'm sitting on my couch in brooklyn. Feeling nicely full.  Not greasy. Not salty. Just happy. You can see the food is cooked with care.  Mummy's is now bookmarked for anytime I'm in the area.\n\nMet Ray. So friendly.\n\ni was skeptical seeing all the reviews were from past one week. So glad i walked the one extra block to check if they're legit.  They opened up a week ago! And yes! I'm happy to add my thrilled review to the list."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsM0xxRUlREAE",
            "text": "Food was amazing! The man who served me was very nice and welcoming. I got the jerk chicken rice and peas and then came back and tried the oxtails. It was soooo gooooooddd. Best I had hands down."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdUxXQ1dREAE",
            "text": "The best carribean food in the area! It’s fresh and cooked with love you can literally taste in the jerk chicken and oxtails are phenomenal. Not disappointed at all"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMklfeTR3RRAB",
            "text": "When you visit Mummy’s expect real, & genuine Jamaican food. This is the real deal! The food is sooo good, especially the fried chicken and the Oxtail! 10/10! 🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMkt1WGlBRRAB",
            "text": "Went on lunch and the food was excellent. Taste on point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbVBpWmlBRRAB",
            "text": "My take out experience was great the food was fresh, flavorful, & filled with rich spices that reminded me of my childhood. I would recommend and return to Mummy’s Caribbean kitchen again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbUpqd2JREAE",
            "text": "I found my new favorite place to eat, I barely give reviews but this one truly deserves it, everything was so delicious, the place is super clean the staff is out of this world, please go and enjoy some real authentic Caribbean food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNkpuU1FBEAE",
            "text": "I love love the spice in their food!!!! Me and my whole family loved it so much!! Even if you don’t like spice there are a lot of options but I love spice and we’re already talking about going again!! Super satisfied ! :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsa0lqUjB3RRAB",
            "text": "I would recommend this place it’s 10/10. They have the best food out there. It is my favorite place to eat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsb01YZWNnEAE",
            "text": "They have the best Caribbean food! I would give this place a 10 star if I had the option. I would recommend everyone to try this amazing place! Food was amazing, I’ll be going there again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsZ09uTlBnEAE",
            "text": "Mummy’s kitchen is where you will find authentic Caribbean food consistently. It’s difficult to find quality Caribbean food with good services and I guarantee this kitchen will not have you disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbC15UEdnEAE",
            "text": "This place was amazing. Best jamaican food i’ve ever had!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGcDVDNVBREAE",
            "text": "Food was amazing we needed this in the area. Good food and someone who is polite. Welcome mummy’s Caribbean kitchen and bakery"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcDRDZ3JRRRAB",
            "text": "The food here is delicious.  It is definitely worth every penny. It's grunatee to leave you fulfilling and satisfied. If anyone is craving some \"REAL\" caribbean food, #MummysCaribbeanKitchen the perfect place to pull up. 💯💯💯💯💯 #greatfood #Jamaicanfood #allfacts"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGeDRPTVl3EAE",
            "text": "The Food is very Good🔥🔥🔥🔥🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGLTV5M0ZnEAE",
            "text": "I was in the area and saw Mummy’s kitchen. Decided to give it a try and I am glad that I did. Got the jerk chicken and oxtail w/ rice and peas and cabbage..very picky with Jamaican food as not all Jamaicans can cook… needless to say, I will definitely be back as the food was BANGING!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMjRmYU53EAE",
            "text": "It’s Surprisingly it’s hard to find Caribbean in the south  Bronx area. So I decided to check out Mummy’s Caribbean food . Honestly 10/10.  The food is real authentic Caribbean food! They  make rice & peas , curry goat, oxtails , jerk chicken & pepper steak! (I love the pepper steak !!)  the customer service isn’t like the rest of the Jamaican spots that I’ve experienced rude and don’t care.. Very impressed.. They’ll be making little go to breakfast menu soon.. I’ll definitely be coming back soon to support . ❤️"
        }
    ],
    "reviews_count": 17
}