{
    "name": "The Original Venice Restaurant",
    "place_id": "ChIJD9Cu-rn1wokRJQkgJLt3Gos",
    "grid": "BX1",
    "address": "772 E 149th St, Bronx, NY 10455, USA",
    "rating": 4,
    "user_ratings_total": 499,
    "phone_number": "(718) 585-5595",
    "reviews": [
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dFZrbDNaVUpJZVhsaU1GRnhkREZRU2pkZlMyYxAB",
            "text": "I had a very good experience when I came here. I was looking for a simple lunch and I came across this place that has many options to select from the menu. I ordered their lentil soup and they made me a freshly squeezed grapefruit juice. Both the lentil soup and the freshly squeezed grapefruit juice were absolutely delicious and I enjoyed it very much. I will definitely be coming back here and I cannot wait to come back here! This is my kind of place! I was more than happy with my order. My photos are attached that show my experience and what I ordered. The lady that worked their shared with me that they are a family business and when school is not in session the business is more slow for them. Thank you for your service in the community!!! 🙏🙏🙏\n\nI also tried ordering their chicken parmigiana with Capellini pasta/angel hair pasta and it is very good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRmNtaERlWEpYWmsxbWNGRlJhRVZXTVhkVmVtYxAB",
            "text": "Friendly, clean, good service, nice bathrooms, affordable prices. And delicious food. With complimentary garlic bread! Delicious :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaGNXMWtSRWxVWTNvMVRVSkpaV2R0V1ZwbWFYYxAB",
            "text": "I ordered takeout for the first time and was impressed with the quality and quantity of the food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNYWFyc0xhMVp5MFBBEAE",
            "text": "You know what the problem of this restaurant is? Nostalgia. Many of us thinking that it is the same place we used to come to decades ago. And it is not. The food is good but over time it has lost the essence we know it for.  While it is not the same place we used to know the food is still good."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKelB5UDJHLXZtcnlnRRAB",
            "text": "An excellent take out dining experience! The ingredients are great quality and fresh. The pasta sauces are rich. The salads and sandwiches well made and ample. Desserts are heavenly! The staff is courteous and attentive. The prices are reasonable for the quality."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYlM1dV92M19Ic3RRRRAB",
            "text": "Fire , was very surprised"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcHN5N09nEAE",
            "text": "Calamari always fresh and light."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN2Y2clJnEAE",
            "text": "Never ordering from here again!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNHRDZHpBRRAB",
            "text": "We walked in, Waiter was extremely shy or maybe nervous maybe because we were “BLACK” she left after we ordered and another waiter attended to us! We got there about 2:45pm, it was empty, others came in and we finally received our food at 4:55pm! I requested an Alfredo with Chicken and Bacon! The chicken tasted like Dog Food Chicken! It wasn’t grilled! Alfredo tasted like so much celery! The actual pasta sauce was soupy! The steak was good but it was missing what was requested! This is NOTHING compared to Italian food or even close to Olive Garden! Maybe I’m just picky or have ocd, but for the wait n the price, the food should have been exceptional"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURROWZ1NzJRRRAB",
            "text": "This place is a solid choice for Italian in the area. And since Yolanda’s closed they have the best local chicken parm heroes."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReEpxRkJnEAE",
            "text": "I’ve been coming to this establishment for over 50 years. Every time I’m in the city I come back. When it moved from his original location to the present location now which is directly across the street hands had changed. I still would come at least twice a month. Last night, the cook Ray was above and beyond exceptional. Please keep up the standard. The meal was fantastic. My veal & shrimp was cooked to perfection!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdWZPTnd3RRAB",
            "text": "I gotta say I was a little skeptical of it but they went above and beyond and really delivered the goods. The delivery man was nice and very personable. Their Margarita Pizza was top tier. Filling but light, it put me right into itis and I was out for the count. Best mozzarella and basil pizza I've tasted in the Bronx in a long time and worth a try. I will now be a faithful customer"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMHViaXVnRRAB",
            "text": "After covid, a lot of people have stopped congregating and eating at restaurants. This place used to get packed, but people have decided to order their food. Either way, if you di ne in or order your food, the food is very good!!! I've been going there for the past 10 years and I have never gotten sick from their food! I like to order the chicken and shrimp sandwich but light on the tomatoe sauce! Boy oh boy is that filling and delicious!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcG9uRjhnRRAB",
            "text": "Good food very friendly"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaVlxVTVRRRAB",
            "text": "The first time they made was 5/5 no to much or lil sauce 2nd time not so much they drenched it in Alfredo sauce the food is good I just hope next time it's not drowning in Alfredo"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQOHRQdS1RRRAB",
            "text": "I don’t know if the owners are the same from the late 60s early 70s but I remember the spaghetti and meatballs were to die for as well as the lasagna and my dad’s favorite spaghetti and meat sauce. I also remember the veal Parmesan; outstanding. I grew up in the projects a block away until 1975. Venice Restaurant was a pure slice of Italy. I remember the owner and his wife; they loved my appetite! Good memories! I’m trying to get back to eat next year since I’m in California now. Thank You"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzOGNpTmNBEAE",
            "text": "I ordered food from this restaurant through Uber eats, WHEN I TELL YOU THE FOOD WAS ABSOLUTELY DELICIOUS!! They gave me a good portion of food and the salad was fresh with a good portion of olives, cheese and peppers!! I recommend you try this delicious, fresh well seasoned Italian food!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucl8zUHRnRRAB",
            "text": "Great food and amazing service. Great music, very friendly staff and the food is delicious, they never disappoint. Would definitely recommend for a family or if you want a quick bite"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIanBESUdnEAE",
            "text": "Their pizza is some of my favorite for delivery but the delivery driver will always call you and ask you to come downstairs or outside to make the pick up. Frustrating, obviously no reason to tip them if they don’t even complete the service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdHZ1NG1nRRAB",
            "text": "Great food same taste for over 40 years of my life. Definitely recommend everything on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicW9fcXd3RRAB",
            "text": "I liked it a lot and not just because we share the same name but because the ambiance was so inviting.\nI like the music they played too.\nI had the chef salad, and it was just so fresh. Would definitely return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiZ29lTVRnEAE",
            "text": "Not my cup of tea. The staff was pleasant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyb1p6XzV3RRAB",
            "text": "Food is great, service is great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeEpTM0RBEAE",
            "text": "Got sick 🤢 with the Pizza. Would never get anything from there again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3OXByazZ3RRAB",
            "text": "Still the most affordable Italian food in the south bx"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cjdHUUdREAE",
            "text": "The Chicken Parm with Baked Ziti is my favorite dish here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcDVLbUFREAE",
            "text": "The food and the service is amazing!!! Make you feel welcomed and the like authentic Italian cooking."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURULTVMYzl3RRAB",
            "text": "Am a old timer...Customer  when restaurant catered to police dept....That was good Italian cuisine.\nNow the meatball tastes like mush.\nWhen you mess up spaghetti  & meatballs, don't want to see menu.\nAnother down the drain."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdXZTaGd3RRAB",
            "text": "Has rhe food at Venice fallen off?! Yes! With a capital Y!\nAnd THAT Y begs to ask the question of \"With the likes of Fresca Pizza and Giovanni's nearby, with cheaper prices and free delivery, are Venice s days counted? I think so."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdzdHT0x3EAE",
            "text": "Lasagna is not freshly made, they keep it in a fridge and re-heat it later. I had my Lasagna cold many times especially in the center."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaDdIYTVnRRAB",
            "text": "The service is A-Mazing! They make u feel like u went to someone's house and they cooked u dinner. Plus, the food is so good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdDVfOFRREAE",
            "text": "Oh my lord this food was out of this world so so soooo good if I wasn't full I would order another meal lol"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMUszSk1nEAE",
            "text": "If I told you there was an Italian place right here in the heart of the South Bronx, that not only was true to its name but was a relaxed sit down restaurant, what would you say?\n\nI would assume you would laugh in my face and so would I, for good reason. Almost like a hidden treasure Original Venice is one of those locations that aren't too flashy when it comes to getting people's attention. Most likely if you lived in the area you would have walked past it, noticing the name, but also not observing the fact that it was a cool Italian spot there.\n\nWell here is your recommendation to visit the place, take a seat, and just enjoy yourself.\n\nPrices are good, food is plentiful, and taste. They say they do pizza but I'm all about that fried calamari.\n\nThe place is a little on the small side, so if you're a group of 200+ I'd suggest having them cater. My brother orders from them on Uber eats all the time and I have visited several times. Whether to sit in, or take out, it all out.\n\nThumbs up."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZM2JMa3ZnRRAB",
            "text": "This has been my favorite Italian restaurant since the 80's.."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnaUpIZEVREAE",
            "text": "home cooked style meals. With some style. Rich in flavor. Freshly cooked.\nServers are great people. The ambiance feels nice. Order what you want how you like it. There's always room for dessert."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkaDlIVWRREAE",
            "text": "Back in the days as a young kid growing up. My aunt and uncle ordered either chicken, sausage, or meatball parmesan hero sandwiches. Whenever they would share their sandwich with me, it would make my mouth as if that sandwich was made with love and came straight from heaven. Venice Restaurant has since fallen off. Today I ordered 2 chicken parmesan sandwiches and those was the worst sandwiches that I've ever tasted in my life. The bread was hard and burnt the chicken was breaded and fried or baked to long, which made the chicken dried and It seemed as if they really didn't want to put any tomatoe sauce on it. Then when I called Venice to complain about the food, the female manager was unprofessional and very rude. She tried to blame it on doordash. doordash isn't responsible for preparing my food Venice is responsible.  I WILL NEVER EVER BUY ANY FOOD FROM VENICE RESTAURANT ON 149TH STREET AGAIN. The service sucks and  the Food is Trash."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0MkphTnVnRRAB",
            "text": "Food was Good\nService not so much"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOaE91ajNnRRAB",
            "text": "I've been going to Venice for many years.  It's where I get my chicken parm heros from.   It's one of the best you're gonna find.  And if chicken parms are your thing, the one flaw is that it is too light in sauce and cheese.  This typically can be the difference.   Through the years and experience with Venice, I've learned to order it with extra cheese and extra sauce.  It's a buck or so more, but it makes all the difference.  Give it a shot, and you'll see that it really matters, and it's one of the best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxdjhTaHVnRRAB",
            "text": "I was craving eggplant Parmesan I googled and I found this place. This may actually be one of the worst eggplant dishes I’ve had in my entire life. They cut the eggplant so thin and put so much breading that you can’t even taste the actual eggplant. The bread that they put in the bag was also stale not like the good old fresh Italian bread. The price is unreasonable and I understand that we have to follow the inflation style but please if you are going to charge this much make it worth it. Lastly I also ordered chicken Alfredo and the quality of the chicken felt like fast food chicken put in good sauce."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGeGRfTTR3RRAB",
            "text": "The food was on point and they followed the written instructions I added"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1Z28tdXBnRRAB",
            "text": "Great Place to come dine in with family\nHad the Penne Alla Vodka , fried calamari it was amazing 👏,  little hidden gem in the bronx. Would definitely come back again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabXNiZTV3RRAB",
            "text": "Venice at 149th Street is not the same , Ever since they have  new owners the food is not authentic they use least  expensive ingredients ,I will never again order food from this place. The spinach manicotti was over cooked , the baked clam was not cooked well very oily and it was not olive oil at that. Worst food I had in a while. This place was awesome years back but now it’s not worth it.  A waste a time and money. ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCME9ITVVBEAE",
            "text": "The foods are prepared fresh. Their calamari was delicious. Overall the place is clean and well maintained. Staffs are great. Enjoyed our early dinner in this place. Will soon come back."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdk52dmJ3EAE",
            "text": "A neighborhood staple. The food here is absolutely delicious. This place has gone through a renovation, and boy has it paid off. Plenty of seating for large groups."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4d1pYNnhnRRAB",
            "text": "Barely any sauce or cheese on this “chicken Parm sandwich.” Def not worth the price. Hope the owners revamp the cooking bc this restaurant keeps missing which is a shame bc many many years ago it was a phenomenal place to eat at."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaU9PTzFnRRAB",
            "text": "Can't believe the food was so poorly prepared.  I mean mushrooms were soggy and the crabmeat dry. Microwave cooked"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdDdpSW13RRAB",
            "text": "An amazing place. Always have and always will be. The food is top notch! Cozy. Quality service. If you're in the South Bronx you have to try it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNEkteDVnRRAB",
            "text": "Best Italian Food in the South Bronx. Authentic and very family oriented. Recommend chicken Parmigiana best ever 👌🏻😋"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvM3NTVS13RRAB",
            "text": "Great food and friendly staff. They can get my $$ again for sure"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdVByd0hBEAE",
            "text": "I love the original Venice. The waiters are very polite and respectful. I’ve come here 3 times and I could honestly say that everytime that I have come here the mozzarella sticks and garlic bread it always on point. 🔥🔥 these people are hands down the best when it comes to their appetizers. I haven’t tried there specialties so I’ll keep you guys posted on my next visit 😊😊"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdXJEVzJnRRAB",
            "text": "Service and food are not the same.\nThey also do not have parking. There is basically no parking in the area.\n\nI wish them luck but they're going to close soon."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTZ0tpak9nEAE",
            "text": "I’ve been eating here since the 1980s. I love, love, love their food. My favorite is the combo chicken and shrimp Parmesan. It’s delicious and the portions are huge. When I order this dish I can get at least three full-size servings from it. Lucky to have this restaurant in the Bronx."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNza1Blck13EAE",
            "text": "I've been coming to this restaurant for over 15 years, from the time of the old management until now. It is quaint, cozy and I always feel as if I've left the neighborhood and I've gone to a small town in a foreign place. It has endured as a place of restoratiion and communion. I feel refreshed and able to regroup once I've dined there. The food is tasty in generous portions. The staff are pleasant and attentive, but not overly familiar. The ambiance is very good. It is neatly arranged with a linear array of tables (as opposed to clusters), sparse but appropriate decor and sprite pop tunes play in the background. It is sometimes frequented by the movers and shakers of Bronx politics. I love this place!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwOXYya2lnRRAB",
            "text": "The decor was very beautiful- made for the fall setting. Everything was clean from floors to the plates. The service was moderate- nice servers. The prices were reasonable. However, the food could have been better. It was okay, but I…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVd3BuVXB3RRAB",
            "text": "This is a real hidden gem in the South Bronx.  Bring an appetite tho, because the pasta portions are so massive that one person can't possibly finish a whole bowl of pasta here.  The garlic bread is delicious and even the fries were…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeU0tR29RRRAB",
            "text": "I usually speak well of this resturant I came here as a kid back like 25 years ago. But I ordered the chicken Parm sandwich it didnt taste like before and the sandwhich was very dry and barely any sauce it seem like it wasnt made with love…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaEl2eDR3RRAB",
            "text": "In my opinion, one of the best Italian places in the Bronx. I've been eating here over 30 years and my mom longer than that. The food is nothing short of amazing and the portions are huge! They don't make places like this anymore!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReV9LOHN3RRAB",
            "text": "Have not been in years so decided try it again... The food is almost as we remembered but I guess they have new owners the service wasn't as good as before. Our server never came back to check on us after our food came out nor did she…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4Z3N5eW9RRRAB",
            "text": "I don’t write negative reviews I rather forgive and forget but THIS. This was unacceptable. Almost $30 for one pepperoni pie, same price I pay for good, real pizza around morris and even little Italy. There was no excuse to give me a pie that had been reheated. I ordered delivery I was expecting a fresh baked pie not a display order by the slice pie. You can tell the difference. So not only was the pie dry as hell all the sauce had dried out probably due to the many times they reheated it but cheese wasn’t even cheesy it was just one big crisp. Even with all that, pizza is pizza and money is money so I ate freaking 3 slices and at 4am I’m woken up out my sleep drenched in sweat and having to vomit . Throwing up for a couple hours and retasting that disgust of a pizza. I’m extremely upset and disgusted this is probably the worst experience I’ve had with pizza and it’s just so unbelievable that an Italian place can mess up bread sauce and cheese. Either lower your prices to match the quality of the food or do the right thing and throw the pizzas away at the end of the day and make news ones instead of delivering food poisoning to people."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbXJhUGR3EAE",
            "text": "I've been to Venice so many times and I've ordered enough to give an honest review. While I love their food, the quality isn't always on point. The place is not how it used to be. The customer service isn't always great either. There was an…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMnItLXJ3RRAB",
            "text": "Food took two hours to arrive to my house. When I called the owner he yelled at me and was super rude, unprofessional, and sarcastic.Wanted to give me $1.50 off of my following order. I have been ordering from that place for two consecutive…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2N3NfMDhRRRAB",
            "text": "I placed an order online and called the restaurant to pay for it by card. My order came with the wrong kind of bread and no fettuccine noodles. When I called the restaurant they said it doesn't come with additional noodles and blamed it on the website. I asked why didn't he mention that before taking my money and he said he didn't notice it. But even though it's a website they chose to present to their customers and an oversight on their end they did not give me a credit or anything to resolve the issue. All they offered was for me to wait for the correct bread to be delivered to exchange. I was extremely hungry and my order was wrong and the ravioli didn't even taste good. Never ordering here again. I spend my money where it is valued. In the hood or not."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMUpMY0pBEAE",
            "text": "I order a meatball sandwich, there was no meat it was by product and dry. The clams with linguine was so dry no flavor. I have been going there since my daughter was 4. 5 years back we stop going due to financial problems. So now I am able to by outside food they was the first and the disappointing of the food. Never going back."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacjU2NVJBEAE",
            "text": "Solía venir a este lugar hace años atrás y el dia de hoy me dieron ganas de comer rico como lo hacia anteriormente cuando venía,  lastimosamente mi experiencia en esta oportunidad no fue la misma que años atrás,  pedí una Bruschetta de entrada y el pan estaba quemado, aparte mi comida que era Penne en salsa Blanca con hogos estaba fria y solo me pusieron la pasta fria con los hogos por encima vacio sin salsa, estaba horrible. me fui con pena en mi alma por que realmente tenia mucho deseo de poder comer decente y rico.\n\nI used to come to this place years ago and today I wanted to eat delicious food like I did before when I came, unfortunately my experience on this occasion was not the same as years ago, I ordered a Bruschetta as a starter and the bread was burnt Apart from that, my meal, which was Penne in White sauce with mushrooms, was cold and they only put the cold pasta with the mushrooms on top, empty without sauce, it was horrible. I left with sadness in my soul because I really wanted to be able to eat decent and delicious food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbnN1bWtRRRAB",
            "text": "Food was delectable.  I really enjoyed every morsel.   I ordered chicken marsala, shrimp Parmigian, lasagne and it was all incredibly spectacular.  The lasagne was the best i have ever eaten at a restaurant. I ordered half trays of all on…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvLTVYWmJREAE",
            "text": "The only thing I don't like, is that they don't have wine and beer anymore, since they have new owners. I live in Queens, and I don't mind driving and paying tolls. They have the best veal cutlet parmagian. I think their success is in the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeElhSExnEAE",
            "text": "Very old Bronx Borough Italian Restaurant. It was recommended to me 20 years ago when I moved to this neighborhood. We love the baked ziti with meatballs, and ricotta cheese. Pizza is great also."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzcy1fdFpnEAE",
            "text": "Horrible service. I’ve lived in this neighborhood for over 40 years and I remember the original owners. The food used to be great and the service was outstanding but now since the new owners took over everything has changed. Maybe it has…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDaXZMWmVnEAE",
            "text": "It really should be zero stars, I order fried shrimp and fried calamari. It was so disgusting, first it took 2 hours for me to receive my food , then when I received my food it was cold and my calamari was soggy and had no flavor very…"
        }
    ],
    "reviews_count": 69
}