{
    "name": "Jalisco Tacos",
    "place_id": "ChIJsQ1qjcH1wokRMxtWVBcbvyg",
    "grid": "BX1",
    "address": "214 St Ann's Ave, Bronx, NY 10454, USA",
    "rating": 4.5,
    "user_ratings_total": 584,
    "phone_number": "(718) 585-4148",
    "reviews": [
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sYVZYUTJhamRzU1ZWRU9HUmllRVZaYzNGaFFXYxAB",
            "text": "Horrible la peor comida q e comido dios"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NU9IaGtTbTlVV1dGUlRHRmlja0p1ZEU1U04xRRAB",
            "text": "Nada que ver .. cadaves peores.. y la salsa verde .. es pasto en licuadora"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kblMwVjBielpGTVVoWGRGTlpiR3RmU0VkMVVYYxAB",
            "text": "Aceptable.. desde que no usan el grill la comida perdió sabor.. ☹️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaFNqSm5RbU5UTVROeGFFcEhWWFZNZUhoMlpHYxAB",
            "text": "Best tacos in the Bronx no cap 🧢"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVGJXTndVRjlpV1hjd1RXWnVlV2xYUkVGcWFtYxAB",
            "text": "Doesn’t know how to follow orders. Asked for a very simple instruction and couldn’t follow it. Tacos & Burritos all extremely soggy in a bad way and falls apart before even biting. This experience was experienced after picking it up on-time & eating it fresh. Would not recommend. $25 for 3 soggy steak tacos & a soggy chicken burrito that was more tomato (the 1 thing I asked to remove) than chicken."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONFQyUm9ZbE5QTFhwWk5qQlhXbWxhZVZZdFVHYxAB",
            "text": "Must try the quesadillas!! Very delicious food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPX2xvdjNEX2RUTk13EAE",
            "text": "It is one of those hole in the wall tiny restaurants with excellent food I highly recommend it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOMnpub0xHeTViZnV3RRAB",
            "text": "Horrible Tacos. The meat is boiled and unseasoned. It tastes like literal dog food. I’ve had good tacos before and it’s not here. You would think for $5 per taco that it’d be worth the money, but its not. If you want better tacos, go across the street, next the shoe store. Their tacos are way better."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHb3VyWDZnRRAB",
            "text": "Tacos are good, they're generous with the portion size. Same friendly staff for years."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bElfbzNBRRAB",
            "text": "Me dieron diarrhea los tacos de cabeza que comi. 🤮🤢🤮🤢"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3LWFlRnVnRRAB",
            "text": "Even though it’s a tight space it has great food at great price!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eXRqRHZ3RRAB",
            "text": "The chunk of good reviews on here must be fake. These tacos were the worst my partner and I ever had. While they do fill them up, the taste was awful, the meat tasted boiled and unseasoned. Spend your money somewhere else."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcDRMNWJBEAE",
            "text": "Pedi unos tacos de pollo y lo que me entregaron parece que el pollo lo sacaron de un pollo rostisado y con huesos pqueños y tambien venia incluido con sangre. Sabe muy feo no me gustó y me dio náuseas solo al probarla"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQb3VuMXZRRRAB",
            "text": "Es muy buena comida tengo más de 15 años que conozco y he consumido esa comida my bien ambiente y bue trato"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMTZLeWV3EAE",
            "text": "Worst tacos I ever had no flavor dry and tortillas break easy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyLWQyRFBBEAE",
            "text": "One of the best tacos you will find."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaXVlV3pnRRAB",
            "text": "I like that I have come here in fear of eating and eating out… but have allways left with a pleasantly healthy and happy stomach… I just want to really appreciate the guys for taking care of the food…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bWVQc1p3EAE",
            "text": "BUENOS LOS TACOS Y BUEN SERVICIO SE LOS RECOMIENDA EL SONIDO DEL BARRIO 7HALCONES"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NmZIS3p3RRAB",
            "text": "Personal Muy atentos , muy buen sabor y variedad en los tacos 🌮 😋"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNDRMYnF3RRAB",
            "text": "Small restaurant but the food is delicious.  You can make two tacos for the price of one. My favorite are the tacos dorados"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5a2Y3MHRRRRAB",
            "text": "Best tacos in the South Bronx"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURObmFYbUlBEAE",
            "text": "Best tacos in NYC...and I'm Mexican, and been to hundreds of taco spots..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURObVliNklBEAE",
            "text": "Best tacos I had in a long time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOcmNPSEpnEAE",
            "text": "Great value and speedy service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNObUlLUXpRRRAB",
            "text": "Close enough to Texas or Georgia tacos in the Bronx good and fresh"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnN2JfTHJRRRAB",
            "text": "Lugar pequeño donde sirven tacos, tostadas, pancita, buen sabor, recomendable."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcU11TDJBRRAB",
            "text": "The best tacos in the Bronx.!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGazc2RWNREAE",
            "text": "Not really authentic mexican style tacos, WAY too much lettuce. Do not get the beef steak tacos, no flavor. Also, over priced tacos, $5 for one taco? Staff was nice though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1bW9xNmNBEAE",
            "text": "Love this little spot.. tacos de lengua are the best"
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLd3JpbXR3RRAB",
            "text": "Buena comida y buen servicio"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1X01XVV9BRRAB",
            "text": "The food all bronx 🔥🔥🔥🔥😋🤤"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabXJlWXZnRRAB",
            "text": "La verdad no me gustaron"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMHJPX3ZRRRAB",
            "text": "Lo mejor de lo mejor mi #1 Taco Place in NYC! Jalisco, the best in taste, size, Quality OMG!! This is a Yes or a Yes!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabzhyR093EAE",
            "text": "Food has no flavor. No salt or any condiments."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OE9uM21RRRAB",
            "text": "Very good authentic tacos and tostadas. Had the tostada with pernil, a taco with ground beef, and a taco with chorizo, cc style. All were good but I think the tostada was my favorite and the ground beef my favorite of the meats."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJOXZyM1J3EAE",
            "text": "Delicious Mexican food. Tacos, burritos, quesadillas, soups, fajitas, guacamole, et cetera, modified to your preference. Wide variety of traditional fillings and toppings. Very fresh and flavorful. Several spicy sauces from which to choose.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLckx5ZUxnEAE",
            "text": "This a good convenient taco spot that I found on my way back to work, and what a luxury it was to eat their food. The tacos I ordered were Spicy Steak, and Ground beef, and they were made pretty quickly, and the owner and the chef were really nice people. They also hooked up my meal and weren’t stingy at all!\nI will def come back for steak tacos and other things on their menu, however, I do not recommend eating ground beef tacos, because the tacos with ground beef inside fell apart quickly. Overall definitely a great experience!\nTry their hot sauces, they give it a great kick along with your tacos!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxNUs2RHVBRRAB",
            "text": "Para mi estos  tacos son los más ricos  que he probado  en especial estos  dos  también ay de tripa que es muy rico. Su estilo de este lugar me encanta lo recomiendo  es pequeño  el lugar  pero muy rica su comida"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNFa2EtczVRRRAB",
            "text": "Authentic, really authentic Mexican tacos. Delicious!!!! Los más auténticos tacos que he probado en NYC. Los tacos suoer bien servidos, la tripa y la lengua guisadas a la perfección, la salsa.. podría ser más picante , pero bien. Y el servicio rápido y amable. Definitivamente voy a volver para probar más variedad de tacos y sopas."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcHFEMTVnRRAB",
            "text": "para mi los mejores tacos 🌮 bueno bonito y barato"
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3NnFESG5nRRAB",
            "text": "Deliciosas tostadas, tacos, cemitas,  burritos y sopes al puro estilo mexicano 🌮🌮🌯🥙…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKM3FTUV9BRRAB",
            "text": "First they need to fix the pricing google showing one price and it actually more when you get there. Also they got my order wrong so end up paying far more then expected but didn’t want the food to go to waste. Yet when I got home to see they use yellow cheese when I ask for white cheese taste like Kraft. The chicken has little to no flavor. And they put far to much veggie on the taco just spills out. So Now I regret paying more for bland food I see why they offer spice. Sorry but for the price it was worth it and I won’t be going back. They kind people and keep the shop clean but if I’m paying $4.50plus a taco I would hope it better then this."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSamVMQnZ3RRAB",
            "text": "I literally LOVE this Authentic Mexican Restaurant! I have been coming here since I was about 5/6 Years old thanks to my father putting me on lol. Best prices and best coctel de camaron y Pancita!!!! Tacos are also good! Really recommend this small Gem! If YOU want oily over seasoned greasy stomach ache tacos this place aint for you! These tacos are not overly seasoned or greasy they are great tacos just like that."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OVBpX053EAE",
            "text": "Great tacos, yes the meat doesn’t have any condiments or seem to have oil but it’s better than having very greasy meat. Plus if you want some flavor on your taco put some green sauce on that it’s not as spicy as red one. I recommend “tacos de lengua” 😜…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcFBUWEN3EAE",
            "text": "This was the most disgusting taco I’ve ever had. I would rather get Taco Bell. The lengua tasted like washed tofu, chicken was the absolute worst though tasted like canned chicken washed under warm soap water. Portions are good but remember the food is absolutely horrendous."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdlo2dENnEAE",
            "text": "I went here to satisfy a taco craving and I love to support small businesses, i ordered 9 tacos (for the family) and I guess he took advantage of the fact that I was in a rush because i was parked at the pump and overcharged me. When I got…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbDc3ZFlBEAE",
            "text": "I never ever write reviews on ANYTHING. But please read: I've Been going here over 15 years, their recipe has never changed. You can always expect authentic Mexican tacos, with the best quality foods. The tacos are reasonably priced and…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3dXBtQnZBRRAB",
            "text": "I absolutely love this place and their food!\nmy parents have been ordering from here since I was 9 maybe even before that and I'm 21 still ordering their tacos. Their hot sauce is also the best if you like spicy things like I do."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4cS1MNUlREAE",
            "text": "Extremely disappointed. I saw that it was rated one of the best taco places in NYC. We went And had chicken and steak tacos. The tacos were bland and not very tasty. The overstuffing of toping did nothing for the flavorless meat..I've had many tacos from places through out the city and this is on the bottom of my list."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJaTRlX0ZnEAE",
            "text": "Worst tacos ever. The meat seems like it was boiled. Flavorless with a strange texture.... and what Mexican taco place doesn't have carnitas or tacos AL pastor. Worst part is 3 tacos cost $9.75. If you are gonna charge that much, don't serve boiled meat. The shrimp and avocado cocktail was half decent."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcS1HVllREAE",
            "text": "Haven't been here since 2002 because i moved out of state but, oh my! The tacos i had here have been my absolute favorite. In 14 years I've visited many taco places and nothing will ever beat this place! Can't wait till i come back to visit the Bronx and you guys will be my first stop!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDMExXOE9REAE",
            "text": "I agree with the last post, and I have ordered here before, they must have changed the cook because this taste awful. Absolutely no seasoning on my chicken burrito. It taste like it was boiled and thrown into a tortilla. I will never order here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMXFHZm93RRAB",
            "text": "Ive been going here since my elementary school days the food dosent change always delicious prices are descent. The team is amazing! I love Jalisco Tacos"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwak5iNTl3RRAB",
            "text": "BEST TACOS DE LENGUA I'VE EVER HAD. This place is nothing fancy so expect to have your food served from disposable plates. However, this restaurant makes the best beef tongue tacos. So simple yet delicious. Best dish to order after a night of partying - go for the tripe soup. Super delicious tacos de lengua and pancita."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNdExMa2x3RRAB",
            "text": "I would give it 5 Stars if the place had a better seating arrangement!(could use a makeover) BUT You will not be disappointed by the food though, I always like to get any kind of tacos but make sure you order that Crunchy quesadilla that they make ... my mouth is already watering !!!"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndGV6cWNREAE",
            "text": "Best tacos in the Bronx! I frequently come here to eat and always leave satisfied. The tacos always have lots of meat on them which is rare in other restaurants. Worth the wait and the money."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtOGZ6UUhBEAE",
            "text": "Don’t believe everything you read on the internet.\n\nTried 4 different tacos (cabeza, lingua, pernil, steak), tripe soup… no flavor. Kinda mushy. Worst tacos I’ve had in NY.  Overpriced at $5 a taco."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrM3BhcmtnRRAB",
            "text": "These tacos are the best and fresh very traditional you always end up wanting more and the staff are friendly they are not afraid of serving to people outside of thier race. I spend my whole pregnancy eating there!!"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cC1uc1h3EAE",
            "text": "Fresh tacos, delicious and cheap. Like every Taco place in the world should be. Taco is a basic food, so shouldn't cost a lot, some places in New York forgot that, and over charge you for medium Tacos. Here they did not forget it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLeHQtZEJBEAE",
            "text": "An interesting take on some classic Mexican street food. Plentiful toppings with their tacos and a very interesting quesadilla like none other!   This is a great spot for a quick and inexpensive lunch any day!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMzd5TUN3EAE",
            "text": "The chorizo, asada, and pork tacos were good. The tripe was okay. Asked it to be extra crispy and apparently they couldn't do it so it was soft and chewy. Lit bit of a disappointment on that one."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwNGJqaFRREAE",
            "text": "I love their authentic mexican food! Totally worth going to the bronx! They cook if fresh and serve it hot! Infeel like i am in Mexico in every bite.\n\nIts a tiny place but theres a room to sitdown in a table.  Many people come for take out their orders.  Its busy, meaning its food are good!  There are side street parking close by."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXXzhLWl9RRRAB",
            "text": "The triple beef sopas had barely any taste, threw it out unfortunately.\nThe taco was decent but soggy after being walked home for 10 mins."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdDl2b3Z3RRAB",
            "text": "if you want a big fully taco here is the best place to go for one. there red sauce (salsa) is my favorite of all very spicy 🌶 and gives it a touch to your taco!…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJZ3ZfN3pnRRAB",
            "text": "The best hole-in-the-wall taco shop the South Bronx has to offer! Possibly the best in the whole New England corridor and Tri-state area! Not much left room, but this isn't your gourmet type of restaurant. The menu is simple enough ...…"
        }
    ],
    "reviews_count": 65
}