{
    "name": "Nourish",
    "place_id": "ChIJD3rfIen1wokRIjYbx4B_ZIs",
    "grid": "BX1",
    "address": "141 Alexander Ave, Bronx, NY 10454, USA",
    "rating": 4.6,
    "user_ratings_total": 71,
    "phone_number": "(212) 871-6155",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUGRGbDNVMW8xZEZaeVltNUJjVFEwTVdSMGRIYxAB",
            "text": "Instantly felt comfortable - aesthetic was high end, but vibe was intimate and cozy..danced a few tunes to a great dj Halloween night and the staff was super fun and attentive. Tasty mocktail 🍸"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV09VSlRlV3hIZDJGS1R5MTZjRlJ6VmxGbGFuYxAB",
            "text": "Last Friday, we stopped by Nourish and were treated to an amazing performance. If you want to experience truly high-quality Live Music South Bronx, you have to check out their schedule. The band was talented, and the sound mix was…"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKd1NuVkJaRGxrZEc5SFV6aEliaTFWT1docVRXYxAB",
            "text": "Good food, Good service, Good company, Good times!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoM1NXZExVbGM1UmtoV1ZGSjVhVGx1Y25aRmFWRRAB",
            "text": "Nourish has quickly become my go-to spot right after work. I was searching for a decent Happy Hour South Bronx location, and their deals on craft beers and small bites are unbeatable. The atmosphere is relaxed, the staff is attentive, and…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STlFUUkdRbDh6WlhWZmVrWk9hMWRyUzA5MVdsRRAB",
            "text": "My friends and I had one of the best experiences visiting Nourish, definitely check out Kilvin behind the bar. He definitely knows the meaning of excellent customer service and knows the menu very well, he gave us great recommendations. We will be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMlRrdEJSbXBNWkdvNVRtWkRRbDlrTUVaeFpsRRAB",
            "text": "Among all the local eateries, Nourish stands out as one of the best Restaurants South Bronx has to offer. They truly excel across the board, providing great food for all meals, excellent drinks, and a genuinely warm, inviting atmosphere.…"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKc1EzQTVaSFp5T1ROZlpYWTJOalJNUVZNMlIzYxAB",
            "text": "Love having quality places like this in the south Bronx!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSeU4xcHJlakpZZUdGelZrVmxhMGxYVFZONFMzYxAB",
            "text": "Loved my recent dinner here. Food and drinks were incredible and people very friendly. Highly recommend. Great vibes."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xST1pYWTVjbnBVWjJVd1FqQkVVSGRIYlRKUmRHYxAB",
            "text": "We finally made it to Nourish for the weekend and were completely charmed by the experience. Their Brunch South Bronx menu is exceptional; the eggs benedict were perfect, and the coffee was strong and delicious. The atmosphere is bright and…"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKemFIbEtjV3h3VWxsUU5FazFXR2QwV2xnNFUxRRAB",
            "text": "Priscilla was gorgeous and amazing! Stellar service the drinks she made incredible! The food was great the vibes amazing and the DJ spinning the 1s & 2s got me moving in my shoes lol"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNlUybEtNVXhaYTFCUk5ESnBXRWhqWVRWRGVFRRAB",
            "text": "Great happy hour, the vibes are awesome"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQk5YUkRiR1YwVDJ0d2NUbG1Ua016VEU5S1duYxAB",
            "text": "I really like the vibe of the restaurant—great energy and welcoming atmosphere. I just wish there was a bit more space. The drinks were bomb, and the price point for both food and drinks is perfect for the community they serve.\n\nI tried the Korean chicken and waffles. The sauces were new to me, but I enjoyed them—the green sauce had a nice level 2/10 spice that hit just right. The honey with red pepper flakes on the waffles was a creative and tasty alternative to syrup.\n\nIf I’m being honest, I could’ve passed on the waffles and would’ve liked a larger portion size. Also, the menu should mention that it’s popcorn chicken to set expectations."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRdFdtNWpXSEZRTjJobmEyOXlYMlk1UkdFME9FRRAB",
            "text": "Sat at the bar and ambience was very nice. Eric was amazing. Very attentive and helpful. Very friendly and knowledgeable on the menu. We ordered appetizers Hummus , Truffle Fries and kale salad. All 3 tasted really good! Would definitely come back. Eric made my stay very welcoming"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeU1YUTBRVFJ3UlZKdGJGWlhhMUJDU0ZrM1NIYxAB",
            "text": "Food and drinks were amazing. Staff was attentive and accommodating."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preVdYZFVXV2g0TlRWWGFVNTZURVpLYUhRMWVWRRAB",
            "text": "Amazing service staff food ambience 10/10 definitely will frequent again!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jelZIWTJVakY0Y21odmNVNXNjRlprYXpSbVluYxAB",
            "text": "Nourish is easily one of the best restaurants in the Bronx. The food is fresh, flavorful, and beautifully presented, and the staff makes you feel right at home. I’ve tried several spots in the area, but nothing compares to the quality and atmosphere here. It’s the kind of place you’ll want to come back to again and again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUVgxWkVSMFo2WkhCUU5YaHJSR2RhUTAxZk0wRRAB",
            "text": "From the moment you walk in, it feels like you’ve stepped out of the Bronx for a while. The space is beautiful and clean, the food is delicious, the music is on point, and the service is fantastic! I’ll definitely be coming back and bringing friends along."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbGJYUnJNRVJuUzA5UFRqUXpZbUkyVWtWeldHYxAB",
            "text": "This is gem in the Bronx!!! We wanted to try something new but not to far from home haha. We came here, and we were happily surprised. Pesto pasta and the chichiarron were so good!!! The service was nice. I can't say enought about the environment and the decoration, very cozy. We can see the owner pays attention to small details and did a good job with this place. We are definitely coming back for food and a cup of coffee! 🥰"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUVNEUlZkVk5STVVFNVpXOWliR1pKVkhWUU0xRRAB",
            "text": "The coffee is decent but overpriced. Got a biscuit for breakfast and it was raw dough in the center…inedible. I went for dinner before and they didn’t have ingredients to make a martini…wouldn’t recommend with the inconsistent product and steep prices."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oS05GOUVNREJ1U1doTFRrSjRaa1o2ZDB3elZtYxAB",
            "text": "Went for dinner a few weeks ago.  Chill vibes.  Great food.  Absolutely loved the drinks.  The half day chicharron is a must!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWVNIbGZRVFZYZUU5SGIySnNWbHBqY2xkS2RuYxAB",
            "text": "Nourish is an amazing restaurant and cafe with a great mission! The food and drinks are delicious, and all proceeds are given back to the community!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdWIyeEpkbmhWV0dkemVrZFhjMjFZY0ZaM2VXYxAB",
            "text": "A Gem 💎\n\nI had a really busy week so just wanted to stop by for a drink. I sat at the bar and got served right away by Pricilla. I had such a great experience i got dinner & desert too. Now i fear it may be my new go to for the neighborhood lol. The Pistachio Pesto pasta is AMAZING! The drinks were bright, flavorful and tasty. The bartenders definitely know what they’re doing. Strong enough for a buzz but not over powering the drink. The only thing i wasn’t a fan of was the banana cream pie because the crust was extremely hard. I ended up getting the Chocolate cake instead. Overall i left satisfied and look forward to stopping by again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTFh6ZDNRekJNYUU5MVFtTnZSR1JYTWt4TVdXYxAB",
            "text": "Nourish was a lovely experience all around. The food, the ambiance, the service…all of it.  I ordered the Korean Fried Chicken and Waffles and it was scrumptious!!! I highly recommend.  The staff was very attentive as well.  Thank you, Nourish, I’ll be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQ1VIcGthek54Y0hadGFITmtjVkZrZEdWNlpGRRAB",
            "text": "I visited Nourish today with my family for Brunch & it was absolutely amazing! The environment was calm and welcoming. The food was served quick and was delicious! I got a sneak peek at the dinner menu and I cannot wait to come back to order some more great food! The server brought it all together, very appreciative of my experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWelVGZENaMk5ZUVcxNldEbFZOMU16YXpaNWJsRRAB",
            "text": "Great food, Great Drinks, Great Hospitality! Felt like I was in Tulum for a second. The whole team is  attentive and welcoming! Shout Outs to Katheryn for taking care of us!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MlpucG5iazFyTkhKd1UxRm5PSEJsVVZjeGIzYxAB",
            "text": "What a wonder addition the South Bronx community! Nourish brings quality healthy foods, creative and delicious cocktails and a beautiful space to vibe with friends or get work done to its customers. Since they’ve opened, I’ve visited more times than I can count. For lunch, try the double chicken sandwich and you will not be disappointed. If you’d like to try a cocktail you can’t find anywhere else, order the Roma Daq. I like to swap the rum for vodka, but the original is just as good. And for dinner - there are no wrong choices - everything is prepared expertly and plated beautifully. My personal faves are the flatbread, hummus, pistachio pesto pasta, and sea bass. Lastly, their Mexican chocolate cake is to die for! A special shout out goes to Anthony who makes the best cocktails 🍸"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdWRtWjNWbVZETW5ST2IzRTBUVVZsVjA0MmRHYxAB",
            "text": "Beware: Mandatory 20% service charge even for take out. Food is not as good as I expected. Otherwise atmosphere is good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WVNrcExTM0ZvVFZGblkwcEZOWHBKTmxSNVQwRRAB",
            "text": "I’ve been to Nourish a few times and have sent my out of town friends there for breakfast. The food is delish. The coffee is great. Desserts during dinner are amazing. It’s really nice inside with lots of pretty details. This is not a dive or diner, it’s a proper restaurant.\nFave dishes: pistachio pesto pasta, fried chicken chunks, the fish, salads, the steak, the homemade Mexican chocolate cake and the banana pudding."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRGNqVlBhV2RRYkcxUWQwVnFSRVZ1V1ZORFJWRRAB",
            "text": "Service was terrible, had to wait for a long time for someone to pay attention to me. Then they kept bringing out the wrong dishes. Food tasted bland."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ad2JYTXpkazQxZG1velpXa3dlbGhUY2xKbGIwRRAB",
            "text": "Everything was so good. The flavors were amazing and the service. And supports a good cause too!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONVJXOVpURVZyTm1zeVNXTlViRE52VUVaWFNXYxAB",
            "text": "An exceptional dining experience that beautifully combines bold, cultured flavors with a vibrant atmosphere.  The steak frites were prepared to perfection, the three layered chocolate cake was so exquisite I ordered two, and the watermelon mocktail was refreshingly delightful. To be honest everything was amazing! The menu reflects both creativity and authenticity, making every dish memorable.  What truly sets this restaurant apart is its commitment to giving back to the community — a purpose as inspiring as the food itself.  I very much look forward to returning!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONFFtUXpiRkF0Y0VoRE1tY3RVVzR4WlRKVFNuYxAB",
            "text": "Really cool atmosphere. Feela like you are downtown and not in South Bronx. Hopefully this sparks more businesses like this in the area. I had the steak frites which was really good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeFpIcHNWSGsyU0dSVFUxQnhVbFpVY1ZwcFUzYxAB",
            "text": "What an unexpected surprise Nourish is, in the best way possible. From beginning to end my experience was all you can ask for from a restaurant! The vibes were immaculate and the hospitality was unmatched. Staff is extremely pleasant. The owner, Tomas, greeted us at the door and shared his inspiration and vision for Nourish with us. The food/drinks was absolutely amazing and cooked to perfection with flavors that were new to my taste buds. I will recommend this place over and over again. 5/5!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeE5rTjJNSEppYVdoNU0xOHhNRVpDVjBkU1NVRRAB",
            "text": "Country Cobb salad was such a delight. The espresso is so tasty and balanced — doesn’t need anything else! And all profits go back into the community!! Nourish is truly a gem in Mott Haven. Can’t wait to be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNFFVczNiVkZRVFdsZk1taEdiSE5WTkdkRWFXYxAB",
            "text": "Not worth the price and the location is not convenient"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bk5UZ3lNalZzWjE5NE0yMVBSM2d4WDFwUFNHYxAB",
            "text": "Went during lunch time. Service was alright for a new restaurant. Food and atmosphere is 5 stars but it is expensive. I suggest coming prepared to spend quite a bit so perfect for a date or to bring someone to a nice high end feel within the neighborhood. Haven’t tried the cafe but it smelled really good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxQlJYTXdPV1ZYWVd4RVVVMVBhelZ3VmpOMU4yYxAB",
            "text": "Such a treat to have access to a high-end culinary experience right in the Bronx. The space has an atmosphere that instantly transports you, paired with a menu full of delicious foods and amazing cocktails. I’ll definitely be returning!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oT2JXaGFia1JQUW13MkxXOW5WbWx2WlRkUGIyYxAB",
            "text": "Can't wait to go back.  Food was fantastic service was impressive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVWNHaEhRMGswWlc5UFVUUjJjVWxaVVcxNlQyYxAB",
            "text": "I had such a wonderful experience at Nourish! The pesto pasta was absolutely delicious—bright, flavorful, and perfectly balanced without ever being overpowering. The real standout, though, was the octopus. Tender, beautifully prepared, and seasoned just right, it instantly transported me back to the flavors of Portugal. The combination of warm hospitality and thoughtful cooking makes this spot a gem in the Bronx. I can’t wait to come back and try more dishes!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKU2MyTk1jMDR6VEY4eU9YSm9ZVWxSY2pCTGFWRRAB",
            "text": "The food and vibes were absolutely outstanding. I can’t wait to go back and try more from the menu. The cocktails I had were phenomenal especially the picante, which was out of this world. The interior transported me straight to Latin America, making the whole experience feel authentic and unforgettable."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4U1MyeHRSVEJVU0dGa1puWmxVRVZvYTNCQ1IzYxAB",
            "text": "Really enjoying this addition to the NYC culinary scene.  Food and service are on point and the community aspect is amazing.  Not only are young people actively getting paid living wages AND hospitality experience, but 100% of the profits are directed to funding workforce development programs.  It's a win, win for your mind, body, and soul."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TFRHdGtjM1ZJY25KdlRIUlhSVWcwWlhCUGNsRRAB",
            "text": "Had the pleasure of dining here with some of my friends visiting from Los Angeles. Amazing vibe, cute little back room with an area to dance and have fun with your friends and amazing energy from the staff. 10 out of 10 experience! Pull up here for a cute pregame before the club or a chill night in your local neighborhood - they don't disappoint!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUmNubzJaMkl5VEZsRU1WQjFiMnh0U21KTE1GRRAB",
            "text": "Great good, good service, amazing ambiance— Nourish has it all. It’s great to have an elevated vibe right in our neighborhood 💕"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdFJEZEZZekpHV1RNNVUxUnlVbTVJUlV4c05WRRAB",
            "text": "I had the absolute pleasure of dining at Nourish, and I can confidently say it’s one of the best new spots in the city. From the moment I walked in, the warm and attentive service set the tone for the evening—every staff member made me feel genuinely welcome and cared for.\n\nThe atmosphere is chic yet inviting, with a perfect balance of elegance and comfort. Whether you’re looking for a lively dinner with friends or an intimate night out, this place has the kind of vibe that instantly makes you want to stay longer.\n\nAnd the food—simply outstanding. Every dish was crafted with such attention to detail, both in flavor and presentation.\n\nNourish Is more than just a meal—it’s an experience. With exceptional service, a beautiful setting, and unforgettable food, it’s destined to become a favorite for anyone who visits. Highly recommend\n\nAlso extremely recommend the cafe in the morning! The chicken empanadas are to die for with refined beverages options!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMlJtdENlVEkxWnpoRmJUUTFVbFZXYzJwd1kwRRAB",
            "text": "Nourish has become a staple in my routine. From the first time I walked in, I felt like they truly cared. Not just about the food, but about the people walking through the door. The service is sincere, and the meals are always spot-on."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOa01qWTFZVkpHZUhkNE4zVjNlRlppZFhGVFZIYxAB",
            "text": "Amazing coffee—iced lattes are perfect for hot days! The chocolate chip cookies are a must-try. Great food, great vibes, and a perfect spot to enjoy with family or friends. Highly recommend Nourish!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMVIySnlWR1JYU0dkdWNGQjZOR3Q0UW05U05HYxAB",
            "text": "Love supporting this business. The team clearly has heart and hustle. It’s more than just a restaurant it feels like a gathering place. Whether you’re solo or with friends, there’s always good energy here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNFJGUTJXa2h0TlRkelRYbDZNWE0wYmxSRFEwRRAB",
            "text": "What a cute new restaurant!! Yummy food and the staff were all super friendly! I definitely recommend the chocolate pistachio cake!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twd2VWVlZieTFVTjBsa1V5MWFZemRKZWpkMGMxRRAB",
            "text": "I don’t usually leave reviews, but Nourish deserves the shoutout. Great service, food that actually tastes homemade, and staff who remember your name. Places like this make the city feel smaller in the best way."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTmNXdDFPSGxTWmpReVNqSXpMVGhuTm5WekxXYxAB",
            "text": "Nourish is a beautiful space that feels so light and airy. The food is delicious and the people are so nice. I love this new gem in the neighborhood."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVmJtNVJRek00YUVadWVtZENSM1V4UkZkSlUzYxAB",
            "text": "Nourish was definitely an unexpected surprise! The decor is so inviting and relaxing from the minute you step into the place. I guess your mind does just drift away to Tulum for a bit!\n\nWhat's even better is that the food was very diverse. It truly is a global cuisine so you will definitely have something you will like as opposed to going to a restaurant that only has one type of food.\n\nThe staff was very attentive, but also knew how to keep their distance. No mid- chew questioning lol.  All the dishes we tried were actually very good, which is surprising, but I truly have nothing bad to say about any of the dishes.  Definitely want to come back and try the Pistachio Pesto Pasta and Bass and those seem to have been very popular for the other tables.\n\nBest part-- all of the profits go to their non profit called Oyate Group to help empower the youth!  Literally grassroots impact spending right here!  Kudos and best of luck to the Nourish Team!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UlJYUmxWUzAwZEZCd1VWOXZhbEZUVlVWdk1uYxAB",
            "text": "We loved the cocktail menu and atmosphere.  The service was super fast and friendly.  We shared a couple of dishes and loved everything. Try a dish that features the avocado mousse…it’s amazing. Loved all attention to details in the interior design and dish ware.  Definitely going back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWGRXRXphRFZOWlRSa2NsWmhTRUZHVDJodFlVRRAB",
            "text": "Thrilled to welcome Nourish into the neighborhood -- looking forward to the way its model and presence leave a mark on Alexander Ave and the entire community. From the thoughtfully curated space, menu, and vibe to the unapologetic proclamation on the menu: \"100% of profits are invested into workforce development programs for young people in New York City.\""
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcGNtcEhWV3BvUW10TWVtMXdSVGxFT0dWVU1FRRAB",
            "text": "Food is incredible. Service is of some of the best ever enjoyed. Who needs downtown? Nourish truly brings the food, the quality, the drinks, the vibes, but most of all the incredible package put together in a way the community needed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMlNrRXdkazExV1ZKM1lUUkxRMGxwTFdZemRtYxAB",
            "text": "I loved their cocktails so much that I ordered every single one in menu twice!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUVZHcEJTbEpoU21adldsTmlRek5UV0V4VldXYxAB",
            "text": "Love this space. Staff were really nice. Had a hibiscus iced-t, but can't wait to go back for dinner!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMVRtVjRhbEU1YmxseVdrWk1TSEkyTkhGMVJtYxAB",
            "text": "Im up early everyday. It’s great to have a location in the neighborhood that is open when I need a morning coffee that doesn't break the bank. Also, the staff - are always there with a smile. #grateful"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bGNuWnlPVXRJU1U1S2VtRjRXblZyVDJkNlZGRRAB",
            "text": "Amazing food and coffee! Highly recommend will come back for their dinner menu too."
        }
    ],
    "reviews_count": 58
}