{
    "name": "Xochimilco Family Restaurant",
    "place_id": "ChIJu8iHasn1wokRumLZtGnNVr4",
    "grid": "BX1",
    "address": "653 Melrose Ave, Bronx, NY 10455, USA",
    "rating": 4.4,
    "user_ratings_total": 841,
    "phone_number": "(718) 402-5400",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMGQxRlpOSEZZVWtoWlUyRjZUbFJUZW1SUE4zYxAB",
            "text": "I love the atmosphere of the restaurant. Although it may look small, it’s a very nice and decorated place. Beautiful Mexican restaurant to build an appetite for something special. The food was not a long wait and it felt like a dish you’d eat at home with family. Their customer service was great and patient which I humbly appreciate. I’m normally not a tortilla guy but I was happy to know that their basket of tortillas with their main dishes was plentiful. It felt like it was never ending! Lol\nI appreciate this restaurant and I will be coming back if not for dinner, then for sure some Tacos y Tortas."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MllrNTZVSEpwTkdSbFltY3RVVlZXTVhoM2EyYxAB",
            "text": "I usually order on ubereats at this place so i was curious on how the restaurant is so i stopped by today and it was extremely amazing.\nGreat customer service\nAnd amazing food"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbFYzSk1hbGhqTUZBNFdHdDFURzVGWkVOM1pGRRAB",
            "text": "¡Definitivamente quedamos encantados con la exquisita comida y ya no se diga del excelente servicio! Desde que llegamos la mesera Karmen muy atenta, muy amable pero sobretodo paciente. 10/10 lo recomiendo sin dudarlo. La pasamos muy bien."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcE16Wk1ObkoyTjBReGNXaFBVR0pyYVRoTVpHYxAB",
            "text": "Excelente Servicio y atención,  muy buena su comida y exquisitos platillos..."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSWQxWjFOMWRpYzFKU2RVWlNUWEkzTlZRMFprRRAB",
            "text": "Top"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMlgwMVZibFpFWVhneFFtdG9ia3RKVFZJd1JGRRAB",
            "text": "Delicious food and clean surroundings. Will definitely be back."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TVkzZElMWGh4VVd4Tk4zZHRNamR1WjJkbldsRRAB",
            "text": "Tenia mas de un año que no habia regresado antes la comida era buena llegamos y solo habian dos mesas con personas una estaba por irse y la otra  justo le lleva an la comida cuando nosotros llegamos  basicamente solo estabamos nosotros despues tomaron  nuestra orden y era un huarache de pollo y una carne azada termino medium Pues tardo  40 min para que llevaran nuestra  comida y la carne  fueron dos pedasitos muy pequeños el savor era malisimo cuando la carne tiene ya mucho tiempo en refrigeracion y me la dieron extra Cocinada do podia masticarla paresia una goma y fueron  $30 por ese Plato solamente fue una desepcion total"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjdGRGRlpTbTlzYW13MFgxbEJOSFk0VTA5ak9VRRAB",
            "text": "Pretty good! Friendly fast service, and some excellent fajitas!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNFgzY3RXWGMxYnpWaWVVRlRhbkZtV2w5TGJrRRAB",
            "text": "As a visitor to the South Bronx, I was absolutely delighted by my experience. From the moment I walked in, I was greeted by truly wonderful staff who made me feel welcome and right at home. The entire atmosphere was perfect, with great music filling the air and beautiful decor all around.\n\nWhat really made the visit special was the personal touch. I was delighted to meet the owner's daughter, who was a genuinely humble and gracious hostess. Her presence made the experience feel so personal and memorable.\n\nThis is a true gem, and I highly recommend it to anyone looking for a place with fantastic hospitality and a wonderful atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NldsVk5UWHBWZDA1VFZXaGhhVmxxV1dSS2JGRRAB",
            "text": "Came to visit based on google reviews on the first day of the trip to NYC and the Bronx. And this restaurant was the best out of all restaurants we visited in 4 days in NYC area. Super friendly staff, good affordable pricing, and super delicious food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSR1dYYzNUMUV5TlhsMVowWlJNbEZrT0VKVVJVRRAB",
            "text": "Bronx"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM1lUWmhOVXc1V1hOQ2JpMTJWbVpKVURWTVpuYxAB",
            "text": "La arrachera  que me recomendaron demasiado rico  guacamole pico de gallo y el\nThe skirt steak was amaziing and pico the gallo and guacamole but the most importan jalapeño thank you for New dish don Rafa"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNFMzZGZPR1JwY1ZKUlRqQkxhbXMzV25KMVpYYxAB",
            "text": "La comida todo bien pero muy caro ellos ya incluyen su propia propina me cobraron casi 20 dolares de propina."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS2IwWm1VRVpTUTNWeGFWWkNYek5LUmxKdVEyYxAB",
            "text": "Uno de los mejores sitios para desayuno o brunch en la zona..."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMlUwMUthV2wxVjB4RlExVXRhVWxxYVVwM1ptYxAB",
            "text": "Amo este lugar, la comida es increíble y super auténtica. Los jueves hay karaoke. Los tacos de cecina o carne enchilada con cebolla y cilantro son muy muy ricos."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTWIyRTRlalJyTkdSb2RIVkZhM1JhWTNSNFZrRRAB",
            "text": "The dessert menu is creative and absolutely worth saving room for."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTU0wMUpTbWQwUlZWQ1JrcEpNa1JJTTBNMGRGRRAB",
            "text": "Best Nacho dish I had so far. 🙏"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RVdXNVNZbnA0WHpFemQzQmlhekJXYXpBd2NWRRAB",
            "text": "Best guacamole out there. Also good food"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOV0t5cGJSLTVHcy1BRRAB",
            "text": "Es un restaurante con mal servicio\nSiempre que hacemos una orden de comida tardan más de 1hora\nSu respuesta es que están  ocupados\nEso pasa por no querer contratar mas personal"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQLV93OWI3NjZPdmRBEAE",
            "text": "Excelente comida mexicana y un personal amable y buen servicio… y buenos precios"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLNmFpdGVCam82emlBRRAB",
            "text": "REAL Mexican food - a level of good that is surprisingly hard to find in NYC. Do not miss"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJTFN4cjIydTQ3UEtREAE",
            "text": "Very good food and excellent service\nDanna is the best 🙌🏻"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyZ2JpTHRRRRAB",
            "text": "Homemade Mexican food, if my mother liked the pozole(homemade) that says it all. Our plates were delicious, first time here but I can truly say that it's my favorite Mexican restaurant. Very very happy, I live in Miami but whenever I come back to NYC I'll come here for Mexican food. I strongly recommend it.\nI came back and brought my family and we had a delicious meal."
        },
        {
            "date": "수정일: 6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZemM3UGFnEAE",
            "text": "Un buen lugar para pasar un buen momento en familia"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbU9XN2t3RRAB",
            "text": "This is one of our favorite spots. They have great service and food. We come here after dance class with a group and they always treat and feed us well!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MC0yV2dRRRAB",
            "text": "Ambiance staff and the food(tacos) were great, just the shrimp(shrimp taco) was a bit bland. And for a $12 happy hour classic margarita- a 3.25oz glass is too small- specially if you’re going to use so much ice in it."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMzVMbWR3EAE",
            "text": "Muy rica comida, súper recomendable, saludable. Les recomiendo este lugar para comer. Gracias por su atención."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNE1DMmd3RRAB",
            "text": "Great food!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN2NHRDBnRRAB",
            "text": "Xochimilco is one the best Mexican restaurants in the Melrose area hands down.  Very friendly attentive service. Came in on a karaoke night and was surprised by the amazing talent that was in the restaurant. They make everything fresh for you. The tortillas are homemade. The food is amazing, it’s crazy. This place has a whole scene around the restaurant , people love to sit here even if it’s for a drink. This place definitely up and coming."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcE52eE5REAE",
            "text": "Best nachos !!!\nHav years ordering food for me & family !!!\n\nThe best authentic mexican food in melrose av bronx ny ."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSM3RQci1nRRAB",
            "text": "This quaint little place located in the South Bronx might not be the easiest place to get to BUT definitely worth the trip. It is the closest place for True Authentic Mexican food next to getting on a flight to Mexico. I can go on forever about this place & look forward to my next visit"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdGJEcnVBRRAB",
            "text": "Always a wonderful experience at this place. The food is flavorful, the staff is attentive, and the atmosphere is perfect for a leisurely meal with loved ones."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmd19DbmJREAE",
            "text": "I’ve been ordering food from here for years and have dined in a few times. This is a family owned business and the food is AMAZING! It’s typically consistent and delicious. I’d definitely recommend. However, I have one major complaint and that is one of their delivery guys. I usually have a good experience will all the others but the one I had tonight is always difficult. He always rounds up instead of telling me the exact amount (mind you I am not a cheap tipper). I just hate that it feels like he’s trying to be slick. Tonight, I realized he took an extra dollar from me after I gave him an already very generous tip due to the bad weather outside. He was visibly frustrated when I asked for the receipt (which is rightfully mine to see to ensure I am being charged the correct amount). I did not appreciate his poor attitude. I understand it’s bad weather but I tried my best to tip accordingly and I do not think his poor attitude was warranted. Also, this is not my first encounter with him but this was the worst. Maybe he’s having a bad day but I think the owner/manager needs to understand that the delivery guys are a representation of your business. I will still order because I love the food but this poor interaction will make me think twice before I do. My humble suggestion is talking to your workers about customer service because good customer service goes a very long way. It’s not just about good food. However, the food is amazing if you’re willing to deal with a not so happy delivery driver."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bGYtYWx3RRAB",
            "text": "Excellent food and the service was exceptional as well. Small place with amazing food."
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2b09XSmhnRRAB",
            "text": "Très bonne expérience\nExcellent service, super ambiance et cuisine délicieuse\nJe recommande"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMjlleWxnRRAB",
            "text": "Best Mexican food in the Bronx!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbTdLT2lnRRAB",
            "text": "Aguas frescas diez de diez🤤…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNkttLXhBRRAB",
            "text": "5 stars for Xochimilco. My favorite restaurant anywhere in NYC. Thanks for making 2 hungry Canadians feel like family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNS1DbElBEAE",
            "text": "This was a wonderful place to come for truly homemade tasting Mexican food. The food was incredibly fresh and the chicken mole was probably the best I ever had. I would return to try other dishes if I am in this area again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyX042QmNnEAE",
            "text": "Un lugar increíble para comer buena conmigo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuX2JpeVRREAE",
            "text": "the BEST tacos in nyc ! my family and i have been coming here for years. no place in the city has come close to the tacos from here! i love them smmmmm !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua0lfWmtnRRAB",
            "text": "We were very happy with our meal. We would eat here again."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIXzltZzZRRRAB",
            "text": "Los meseros son amables, el tiempo de espera es razonable, el ambiente es agradable.\nLa comida es rica.\n*No consumo mucha azucar, ni sal, por esa razon algunas de sus comidas tienen mucha sal para mi."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqanJ2UWhRRRAB",
            "text": "Muy mal servicio por la mesera poco corte y poco educada no presta atención a los clientes no hay un control definitivamente no recomiendo el lugar muy pequeño y te corren porque no hay mesas te mandan la cuenta para que te vallas porque les estorbas\nPésimo servicio no lo recomiendo no vallan porque no dan buen servicio me cobraron el doble son bien tontas las meseras además de que no son amables la culpa lo tiene los dueños que no emplean más personal y andan corrido h hacen mal las cosas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ejZLMGFBEAE",
            "text": "Delicious fresh and tasty food with excellent customer service. A staple for me. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bWNMeVhBEAE",
            "text": "Amazing food, great service and cozy environment! You can’t go wrong here!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dmZ2NG53RRAB",
            "text": "es un lugar con una gran de bariedad de platillos de gran sabor y con gran personal"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaXZPMjlnRRAB",
            "text": "He comprado comida ahí desde ase 3 an̈os y jamás me avían tomado una orden de tal mal genio llame par adelivery y la mesera contesto de una manera tan grosera le di mi dirección y número cuando me llama el chico me dice que esta afuera no estaba la mesera le avía dado la información incorrecta no se por que hacen eso si todo aparece en sistema"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaXFIbUZnEAE",
            "text": "I ordered a burrito and horchata the burrito was small and not well portion the horchata was horrible tasted sour like if it was made with expired food back then their food and drinks were amazing nowadays it’s just horrible"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZX2JDd2N3EAE",
            "text": "Consistently delicious!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUb2I2aV9BRRAB",
            "text": "I went with a small group and shared a few dishes. My go-to dishes when getting Mexican food are birria tacos and Huaraches. I got the Huaraches here and it was cool. I would have scored it better if the shell/tortilla had a better texture to it. Mine was a little fragile and broke apart. It wasn't bad though. The mole and tacos were good. The best part was their aguafresca."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcTVxZV9RRRAB",
            "text": "Oh wow, came here first day in the Bronx, and was really impressed with this quality delicious feast! I had a chimnichanga, which was awesome and good value, very filling, and my partner had the special cemita sandwich, which has a unique veggie in it called a Papalo ,  super tasty!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcE5EZUdnEAE",
            "text": "A small and extremely cute spot with incredible food and equally incredible service. The staff was lovely, the food was very reasonably priced, and quality was incredible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUc3VteDBnRRAB",
            "text": "The food is was favorable! The enchiladas de mole  with chicken was a bit spicy, and that came with rice and beans. The French fries were good too. The quesadilla de queso big in portion, good for the price. It was 8:30pm and it was not packed for a Wednesday. Agua de Jamaica was delicious. The margarita flavor Maracuya was exceptional!! The only thing it can improve in would be to check in with us more to ask if we needed anything else. Besides that everything was acceptable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEd0xqTXdRRRAB",
            "text": "The best mexican restaurant I have been. Service made me feel like home, atmosphere and music was amazing. And the food was incredible, legity Mexican. This is heaven, just go."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1M29xUU9nEAE",
            "text": "Awesome spot for Mexican food in the S Bronx. Great vibe, friendly service, and delicious food - it’s places like this that put a lot of Mexican restaurants in Manhattan to shame. I had the molotes - one of their specialties and a dish I’ve not had before. Basically they’re crispy tacos filled with beans and in my case, chorizo. Wonderfully crispy and tasty. And then I had to try one of their tacos. Got the carnitas - first off, it was packed full. The pork was wonderfully tender  and juicy and the corn tortilla was moist but held together well. Outstanding! I will return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdGZLdkdnEAE",
            "text": "I was planning to travel downtown this morning for Sunday brunch, I had Thai food in mind! On my way to subway I find out the train is not running, not in mood for shuttle buses, I changed my mind, and opt for local restaurants near train station, Xochimilco, had good reviews, I decide to experience the summertime menu, shrimp cocktail is delicious, I was impressed with the quality of the hospitality, the all staff is friendly and professional despite the busy hours, for sure I will go back for more deep mexicain food experience"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtcThXX0tBEAE",
            "text": "Mexican dishes: sopa de mariscos, Frijoles con chorizo.\nCecina a la Tampiqueña all common Nachos, Tacos, Sopes, Quesadillas. Taste chicken or red meats and sea food. Natural sweet water: maracuya, sesión fruits, well attended by Waiters\nFresh food. Prepared until you ordered. Prices razonable and 10% down from other places. Delivery avaliable. Personal paciente,"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXaXA2NWxBRRAB",
            "text": "Es el mejor restaurante de comida mexicana que he probado. He ido a muchos sitios pero este me encanta. Soy súper fan de los guisados, en especial de éste, el adobo de pollo, pero también el adobo de puerco es súper delicioso. Me encanta el pozole blanco, el guacamole picante, en fin, mi lista es muy grande. Lo súper recomiendo."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdWZ2djZBRRAB",
            "text": "Hidden Gem in the Bronx. The restaurant is small but it's worth the wait if you can't wait just order in advance. Nice Mexican Decor when you entered the restaurant. They had hand sanitizerd on every table!! That was definitely a plus!!!\nI ordered a steak burrito for $9 with a horchata. The burrito was good and it was filled!! The steak was seasoned well not dry lol  They also have an XL burrito on the menu which is twice as big!!! I was good with the regular size burrito. My kids ordered chicken and spicy pork tacos! They loved it! For dessert, I ordered a tres de leches well I had only a single bite before my children decided to demolish the entire piece. Yes, I highly recommend it if you're in the Bronx."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoM09XcWh3RRAB",
            "text": "Great food and friendly service. The Horchata was awesome!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3bTVTOHBRRRAB",
            "text": "Best restaurant ever!!! 😍I know this place for like 11 years and the food is really good. Owners of the restaurant very nice and friendly.…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNXZ5azlBRRAB",
            "text": "Excelente servicio y buena comida, es autentica comida mexicana. Recomiendo el pipián de pollo y los tacos de pollos 👌🏾"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNneFpqMENREAE",
            "text": "Delicious home style Mexican food, enormous serving sizes and amazing horchata. Great service and really sweet owners. Best Mexican food experience I’ve had :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocVlYaGdnRRAB",
            "text": "I like this place, the staff is so friendly, kind , and nice.  I love how it looks inside, the decoration  is great. I ordered a burrito al pastor was so yummy.  i like they have boing de mango .. Definitely, I like to come here when I have the opportunity."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJazRMMGN3EAE",
            "text": "Was my favorite place but last time I went I ordered a quesadilla and it came cold. I informed the waitress and she told me that it’s supposed to be like that. I insisted she heat it up and she took it back. It barely came back warm. I…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMFkzU0ZREAE",
            "text": "Ordinary Mexican cuisine .. nothing stellar. My chimichanga was more like a burrito just lightly grilled. Probably would order from the place again if I was in the neighborhood and craving Mexican."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaejh2bHpBRRAB",
            "text": "Excelente comida, buen sabor, ambiente familiar, muy buena atención"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMVBqOGlRRRAB",
            "text": "We recently celebrated with our daughter's soccer team at Xochimilco Family Restaurant and were thoroughly impressed! The staff went above and beyond to accommodate our large group by setting up a dedicated outdoor area for us, ensuring everyone was comfortable and well taken care of. The food was excellent, with each dish being a hit among both the kids and adults. The kindness and attention to detail by the staff really made our visit special. We're so grateful for the wonderful service and can't wait to return. Highly recommend for anyone looking for great food and a welcoming atmosphere!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcGFUSTh3RRAB",
            "text": "Authentic Mexican food in a smaller family restaurant.  Fresh and tastes homemade... the Guacamole was excellent!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpb09LLXd3RRAB",
            "text": "Food was delicious, I’m coming back to have the red pozole again. Delicioso y picante 🌶!!…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwNnBXTi1RRRAB",
            "text": "Came here for lunch. I had tacos, which were disappointing. They were served at room temperature, and we're mostly filled with lettuce and cheese. The Horchata was good though."
        }
    ],
    "reviews_count": 72
}