{
    "name": "Parrilla Latina",
    "place_id": "ChIJp9joIcn1wokR3hMddJXKCVo",
    "grid": "BX1",
    "address": "614 Melrose Ave, Bronx, NY 10455, USA",
    "rating": 4,
    "user_ratings_total": 755,
    "phone_number": "(718) 993-5894",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNE1IRXRiWFZxYkVveFZrOXBWWEpOYXpZMVIzYxAB",
            "text": "They have a price online and when you call will give you a different price. Call and call and the ladies keep hanging up the phone.\nRude, slow service. Food is ok depending on the day."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jdFFqTXhSVlJHVm5kNE5ETnFSemM1VVZaNGRsRRAB",
            "text": "Greatest #Atmosphere #lovethevibe"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCclYzRkhYMUZVZWtoQ2IwSlVRbnByTlZWcFNHYxAB",
            "text": "My favorite place"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KT1RXaFZPREJDT1ROd1ZYWkJTekJwVFhnMmVWRRAB",
            "text": "Paella was excellent. Bar ladies very accommodating to my drinks requests!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNmNteE9YMFpaWDI5VlZtcEdNa3BKWkdacU5rRRAB",
            "text": "Food and service are excellent...The servers are very attentive."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUlZWUTVUVXBSUVZsV2FGOHpjMHg2UWtkWVJIYxAB",
            "text": "Me gustó el Churrasco..Muy bueno👍"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWb1VFSkdTWGxqU0hoME0xaG1XVTltZG5ocU9VRRAB",
            "text": "Muy Buena la comida y el servicio.. Excelente"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdHRXLVBnEAE",
            "text": "Excellent"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbGRXSlZUWEpuTjA1bVRsZFFabXBDVjNoc1JFRRAB",
            "text": "The store was clean and well organized."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdU4xOVNTV1l4U3pZMldtWlRWWEZ1ZDE4MlNXYxAB",
            "text": "The food is always fresh and delicious.  The pepper steak and white rice with beans on the side never disappoints."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWlgzbzFUamRDU21aQlFVWjBOekZCWkY4elMxRRAB",
            "text": "Good variety of bottled teas."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWclRYRmhWbGRRYWpWRGVWcG9UMXBaVDNKamExRRAB",
            "text": "Muy bueno todo la comida rica n lugar muy agradable y la mesera excelente servicio volveremos"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVmFIcHlTMjVOY214WE9YRjRVRzg1Wm1Sd01WRRAB",
            "text": "I ORDER A LUNCH SPECIAL & THEY GAVE ME A SMALL DAMN CHICKEN WITH A WHOLE A LOT OF RICE .. I SPOKE TO THE MANAGER AND HE SAID THE CHICKEN ARE SMALL NOW ! NEVER AGAIN WOULD I ORDER FROM THIS PLACE AGAIN !!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdmRGRjBUalV3Y1dWMFV6bG1XV1J0U1c0MlgwRRAB",
            "text": "-0 on service-0 on atmosphere. This is the second time I have come here and I will NEVER come back again. I have lived in the area for 14 years. They are extremely rude and nasty. I was not the only Black person in the resturant yet we were both served LAST and with nasty attitudes.I try my best to give buisness to the local mom and pops in my neighborhood but this is the LAST time I will go here. If you dont want your chicken served witha side of racism DO NOT go to this resturant!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aVNsaHpWVkl6UVVsRU5IbHdSbmQ2YzJwT2VVRRAB",
            "text": "Food is good. The service is horrible. If your a non Spanish speaker, you’ll be treated differently.  This is my 3rd time here, my wife enjoys their drinks and churassco. The service gets worse every time. I ain’t coming back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTFpteEZjbXRmU3pKdU9FWlZSblJqVVd0aGJWRRAB",
            "text": "The food top notch; I mean top tier. The monfongo was prepared perfectly in a white sauce. The rice and beans were fresh and just how I like. Pork chops, juicy and fried to perfection. The food, never misses here. It was a bit loud for my old ears but that is probably more of a me issue above anything else. The waitress was attentive and knowledgeable. What more can you ask for?"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUlozUTJiR1JDU0c1blFraGhhRFYyUkZSNFRrRRAB",
            "text": "Took my niece and nephew to eat. My niece had the steak which i tried and it was delicious. My nephew and I had the chicharron de Pollo no bones with tostones and the food was really good.  I left the restaurant stuffed and had to take a bunch of food home.  All around a very positive experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MmNsZHZVM1JFT0V0WFdtdEhVV1p0YTFjemFuYxAB",
            "text": "Wanted to pick up food before heading home. I could see some of the food had been sitting for a long while. I figured there must be a turn over of rice right? Wrong? The rice was dry and hard. I was given gravy with 3 beans in it. Chicken was dry with no flavor."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SU1dHNXVSRzlTV1hnNFpHWkNUMUJKWW14cE1IYxAB",
            "text": "Amazing Latin food."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCU1ZqVkVNbWRuYURWQ2EzQkhabEJaZVc5NFkzYxAB",
            "text": "hoy he comprado dos pollos en este restaurante , con la sorpresa que me salieron malísimos, a mi parecer cocinados de ayer . Imposible comerselos!🤬…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSFRVRlBTRUV6TjNoSmEzcDJaMFJUVW1ReGIyYxAB",
            "text": "This is a restaurant with bar next door.\nTheir food tastes amazing but varies depending the day.\nI have come here multiple times and I don’t recommend the hookah or drinks due to feeling sick each time.\nI would recommend to come here for a late dinner and then head to the bar next door for beer/ wine and good music.\nThe bartenders are very attentive"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3d2NVTkVhM1ZoT0MxMFgwSlBkV1ZLUlVsMFJsRRAB",
            "text": "Always good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOckFqN0xEc2NTSWV3EAE",
            "text": "Food has no flavor. Paid over $100 for 2 dishes and 4 juices. I pointed to a dish that cost under $12 and was charged $18 for it. I was charged gratuity to not be checked on. The cherry on top is getting food poisoning."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdFZUaGFNbGhEYVZsM2VGOXdaSEZmVDFwcmRuYxAB",
            "text": "One of the best restaurant I ever visited, I’ve been there Friday, Saturday and Sunday and those days atmosphere was amazing. The Dj is crazy good on what he does. I strongly recommend this place"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQbWV6ZTNibDdpRVNREAE",
            "text": "esas empleadas tratan a un cliente como si fuersn animales. mejor aprende hablar a su clientes mas profesional"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcTJtWVRYMGVQUkt3EAE",
            "text": "Un lugar muy agradable para compartir en familia , buena comida , muy buena atencion,, ,, el servicio es muy buena 🙏🙏🙏😋😋😋😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQRE5vOVBneGV1SU5nEAE",
            "text": "Food is literally the best! The chicken from the grill is to die for!! Very fast service and on time"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLUG96WWlqZ3RxYXB3RRAB",
            "text": "I love the food! Great for family to come on over! Drinks are top notch!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNM1V4WW1vZ0txR2ZnEAE",
            "text": "This resteruant is amazing with amazing workers and amazing food , and the mofongo with cheese is one of my top favorites"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNelpfT2VtaDZ6SXBRRRAB",
            "text": "Las chicas muy amable, el asopao de camarones muy bueno. La carne de res muy buena."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMlc1T3otMUpQUFhnEAE",
            "text": "Comida muy buena y caliente 😏😎"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNamhqX21ibUpUb3R3RRAB",
            "text": "Pedí un fetuccini a lo Alfredo y la pasta no era fetuccini, me trajeron otra cosa llena de pimientos, cebolla y cilantro, además de una mala atención por parte de los mozos muy despota y aunque les pedí amablemente que no le pusieran pollo igual le pusieron. 05/08/2025"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZak9HRlRnEAE",
            "text": "I first thought it was a authentic place but I soon realized that there’s a bar next to me I’m scared rn"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eHRQTG93RRAB",
            "text": "Very good food and service. Wait staff extremely friendly and attentive,  most of the time I get the skirt steak with their signature Chimi sauce, I also like a little hot sauce added,  accompanied by rice and beans or tostones , and some vegetables.  I've had skirt steak in many other places,  and this is Always the best one for me ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcWFxaDNBRRAB",
            "text": "Nice place. Awesome staff but check your bill."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eklyWWtRRRAB",
            "text": "Super good food at a very affordable price, considering is in The City!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMjVLNkdREAE",
            "text": "Good service"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdXAzejRBRRAB",
            "text": "Excelente servicio al cliente"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdC16Z19RRRAB",
            "text": "No me gusta compre un pollo a la parrilla con arroz y avichuela  lo tuve que  botar super salado jamas buelvo a  comprar comida ahí pague 27 dolares y no lo pude comer uff"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBemNqellBEAE",
            "text": "I always go to Washington High to eat lambi but I went to this place today with my husband they only make it fry or sauce but they make it for me the way that I want it in a salad and he was the best my husband churrasco with shrimp and lobster a mashed potato and he told me like this babe this is the best churrasco ever that I have for my husband to tell me that it's crazy I'm coming back well we coming back the service the fool it was great"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOTZqYnhnRRAB",
            "text": "We ordered online and the food was so good that we decided to go in person and that was a mistake because the place is super loud, and the service and drinks were terrible. Food was still delicious tho."
        },
        {
            "date": "수정일: 9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvOXBqVUhBEAE",
            "text": "Exelente lugar lo recomiendo"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvbzh5aGdBRRAB",
            "text": "치킨이 맞있고 분이기가 좋은 가게입니다.강추!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcDdQa1ZREAE",
            "text": "The food is so good all my coworkers love it. Personally I don’t like the taste of celery. On all of our plates they had Celery on them. The food is well done."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bWNxUWRBEAE",
            "text": "I got here for dinner and ended up enjoying their happy hour. The staff is friendly and their prices are reasonable. They had great music, hookah, and big selection of drinks. Clean place that you can enjoy with family. I did see a VIP section and  it seems they also host special events/parties. Will be visiting again soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eE4yQXpRRRAB",
            "text": "Idk what these one star reviews are saying! The service was nice. Drinks are very delicious. Music is bumping. Bring a couple friends you'll have a great time. The place look phenomenal.. I love it. Maybe others had a bad experience given a one star rating... it is a 5 star rating. At its best it would be a 10 star rating. Give it a chance and take a shot... literally.. now let's try this hooka out.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwX195clBBEAE",
            "text": "The food is sooooo good. I love the grilled and baked chicken, with the bananas and onions the yellow rice and beans as well as the black rice are a 20 on a scale of 10. The beans a lone is sooo good as well. You can't go wrong eating from here."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aXFQYWZBEAE",
            "text": "Compré un sancocho y sabía asqueroso y me enviaron dos alas de gallina con todas las plumas, lo bote a la basura, y ya alguien me había dicho y no le creí,está Parrilla Latina no la recomiendo"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1eUttMXp3RRAB",
            "text": "I’ve went there many times and enjoyed the picadera with a cubetazo love the atmosphere very welcoming restaurant"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKd29ER0tREAE",
            "text": "Great food and friendly staff at this neighborhood restaurant. Pretty good coffee with breakfast too."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cmUtNHJnRRAB",
            "text": "They do not prioritize customer service at all.\nWhen they make a mistake they don’t take accountability for it and choose to argue with the customer. They did not make me feel good while dining there one bit and I will not be returning. Such a shame because their food was pretty good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuZ1k2WVRREAE",
            "text": "the food is amazing but i was just a bit thrown off and concerned about the service we received, if you don’t speak Spanish they can care less about you. They dont acknowledge you and you can be standing directly in front of them. I was there recently and I came in happy and smiling  to try the restaurant. I felt very discriminated against and non existent customer even with me being nothing but happy and enthused since this is my first time coming into this location.\n\nWe had to ask to be serviced. We also paid for the food which was $31 dollars we  should have received changed back after giving the host $40. We had to ask for change the host never bring the change back to the table. She stated it’s only 9 dollars  left.\n\nTo sum it up the food is good but if you’re not part of the restaurant culture you will feel very much out of place and non existent."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBczdDeTVnRRAB",
            "text": "The mofongo of shrimp is amazing. Try it with the white sauce Gosh. The juice of passion fruit is amazing as well. Great service , great people !!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1eE9ubE5REAE",
            "text": "Nice atmosphere. Pleasant and courteous service. Excellent food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cmJlTFZBEAE",
            "text": "These people are so unorganized! And they won’t accommodate you for their mistakes. They failed to send me the correct order twice and still had the nerve to argue with me. My coworker told me she had a similar experience with them as well. I do not recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaXFMY05REAE",
            "text": "I ordered a Shrimp Mofongo with White sauce honestly it was of the best I have tasted the cream sauce was so amazing and the plantains were soft and just rightly cooked.  Authentic Dominican food made from the heart."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcHY2Ylp3EAE",
            "text": "My Best friend and I love this spot. It's our go to when we have our kids and want to eat really good food, have a mojito or two and some hookah while catching up."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cF9iNmRnEAE",
            "text": "I ordered take out chicken soup and this is what I got. Lots of broth, lots of carrots, no potatoes, no spaghetti and chicken. They should be embarrassed because this is the second time I ordered take out chicken and this happens. Won’t happen again, I assure you.Not ordering take out soup anymore. Seems they save the good stuff for the seating customers’. Meanwhile I payed $30 for one large and 1small soup and both are pitiful."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLemVMTVhnEAE",
            "text": "Food taste amazing, you get a lot for the serving size. I love the outdoor dinning , you have your own personal space. The drinks are a must.  I had an 8oz mango margarita. And for the light drinkers thats all you need. The only thing that was bad about this place was the service.  But not bad enough to keep from going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaa01qMzhnRRAB",
            "text": "The food here is incredible!!! I have tried just about everything on the menu and it has never disappointed. The service is quick and the staff is friendly. I highly recommend! My personal fav is their shrimp mofongo."
        }
    ],
    "reviews_count": 60
}