{
    "name": "Angie's Cafe & Pizza",
    "place_id": "ChIJa4QXf9v1wokRBkH_7sHrnZ8",
    "grid": "BX1",
    "address": "2559 Third Ave, Bronx, NY 10451, USA",
    "rating": 4.6,
    "user_ratings_total": 404,
    "phone_number": "(718) 292-3606",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeVEyNUtia3MwTlhKT2IyMXVaemQyYjNSYU5sRRAB",
            "text": "Never heard of it before, but this spot had a good plain slice and a good margarita slice. The grandma slice by far was the best. The South Bronx is a pizza dessert but this place is legit quality"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReFRVWnRZWFZ3TW5SQ2IyOXJZM2h6Wld3NE5rRRAB",
            "text": "Muy buena comida y el servicio al cliente excelente 🙏🏻❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SelpUSkdlVWQ0U3kxWk5HUnFWazlmVmtvMllsRRAB",
            "text": "Whole pizza pie taste delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWVRubEZZV0pZV0ZRMmJYWk9iQzFrTFZKT2JVRRAB",
            "text": "Well this is the only nice pizzeria place near my work place. And it’s a genuine pizza restaurant along side it they do have nice sandwiches and salads too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toZlZVdGhkRkZLVlhOMFpIZHRPVXRDZFZST1pXYxAB",
            "text": "Good food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJelRsRlJjR3R5ZHpkU05qRk9URWhEVGsxZlZFRRAB",
            "text": "We love ordering Angie’s for work lunches a few blocks down the road. When those pizza boxes make their way to the staff lounge we know it’s going to be a delicious treat. We often place a large order for a variety of pies including classic cheese, pepperoni, meat lovers, veggie, white, and Hawaiian. Every time we open the box and see the delightful sprinkles of oregano seasoning atop the fresh cheese pies we know we are about to bite a tasty Bronx slice. Thank you Angie’s for making our work lunch breaks something to look forward to. You are more than just a NY pizza shop! 🍕 ✨"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKZmFXeHVTbUZoZEd4amR6QlFlVGcwVjBkbmRWRRAB",
            "text": "I have been coming here for decades .\nQuality and taste has not changed\nDelicious 😎"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVWVVcElOWEo0T1dOdlRXOVlSVlJqUmxocVVYYxAB",
            "text": "The place was nice , friendly people"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOb1VHMWhWa3d6VjBaNk4xRXpWRXR6YTBWVk5GRRAB",
            "text": "Delicious"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdF9LcDJnRRAB",
            "text": "My daughters and  I favorite pizzeria in the bronx"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOC1HVEx3EAE",
            "text": "Never will I come in here again. I saw the pizza from the display. I said oh that looks good.\" Let me try it. I got two. One for me and one for my friend to go. After I received it and walked outside and immediately took a bite, the pizza was cold even though they put it in the oven. If they can't get pizza temperature right, imagine how much more things go wrong ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURROFozNFl3EAE",
            "text": "OMG THERE MEATBALL PARMAGAN IS EFFNING AMAZUNG ! LOVE ANGIES"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdHBUUFVBEAE",
            "text": "I placed an order on uber eats, however the gentleman who handles the orders called me and informed me that the food I ordered they didn’t have to cancel the order so I did. When I cancelled the order I didn’t get my money back so I immediately chat with an uber representative and uber tells me that because the restaurant accepted the order they can’t refund me the money. So I then call Angie’s Cafe and some guy, who was extremely rude, tells me that it has nothing to do with him to deal with uber.\nSo I call uber and explain to them how rude the guy was and that he wasn’t being helpful at all. The guy from uber then calls the restaurant and tells me the same thing that the guy that answered was rude and that I had to wait till Monday to speak to the supervisor. So I now head to the restaurant because this is ridiculous. When I get there I ask for the supervisor they tell me he’s not there I ask for the name of the supervisor and the gentleman who called me first to let me know that they didn’t have what I ordered asks me what’s wrong, he was very helpful and understanding of my situation and try’s to help me. He ask the big rude guy if uber had called and the big guy still being rude replies that I have to deal with uber that he can’t do nothing and that when I speak to his supervisor that the supervisor is going to tell me the same thing. I explain to him in Spanish because he barely speaks English that uber is telling that it has something to do on their end. I ask again for the supervisor name and he tells me I don’t have authorization to tell you the supervisor name come on Monday and ask him. Disgusting!\n\nI step outside and call uber again, this time the lady I got calls the restaurant again and speak to the gentleman who called me and helped me in the restaurant, I didn’t get his name but he was very calm and nice and helped me. He spoke to the uber lady and I was able to get my refund. In the years I’ve been going there never would I have thought something like that would happen usually the ppl there are so nice and friendly. I like going here because the food is fresh but if they going to have ppl like that guy who acts like the food and money is coming from him I want no parts. They need to hire more ppl like the gentleman who helped me. Thank you to that guy I was able to get my money back and buy my daughter something to eat. I just can’t believe how rude that guy was I’m pretty sure the supervisor would’ve not dealt with that situation like that because I’ve been to that restaurant before and have dealt with the supervisor and he is not rude he’s actually a nice guy as well."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfLVAyYmxnRRAB",
            "text": "Everything was great, food was authentic, but then as we walked through out the city and our flight home, one by one it began picking us off. The bathroom was our best friend and we had to be wherever a bathroom was even if it meant not doing what we wanted to do. Great if you like explosive diarrhea."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOHBXeG1nRRAB",
            "text": "Chicken Caesar pizza is amazing. The food overall is amazing."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpZ2NEQk1nEAE",
            "text": "one of the best grandma pizzas!!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbVpxcGNnEAE",
            "text": "Family oriented,  good tasting food. The serving are excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MUtXUU1nEAE",
            "text": "I just can’t thank enough Giuseppe. He has really made a great impression with catering service!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MUxudzZRRRAB",
            "text": "Always on point with everything, thank you guys!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ3V1UDNBRRAB",
            "text": "It's not organized. The pizza is not good. The hot food is MID @ best. They keep the seating area clean. Just my opinion. Check this place out"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycnZIbjVRRRAB",
            "text": "Owner has the biggest heart ever. Not because he just wants good business. But you can genuinely  feel his heart. But I already had two altercations with the workers there. I can understand one having a bad day but now when they try to come at you in front of other customers by asking question or trying to get an order in…… the place is small and at times it will be crowded. Customers dont  know who order or not. Doesn’t hurt to ask….On top of that coming out their faces for some plates!!!! NOT that serious after we ordered a few pies for a pizza party."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybF9qX2dRRRAB",
            "text": "Staying couple of blocks from Angie’s Pizza walked in and all the flavors  from the smell that hit us so delicious. We didn’t have second thoughts. Coming from Orlando,where pizza sucks to my taste ,Angie’s pizza , the price and the slices blow my mind ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNjQ3OXhBRRAB",
            "text": "Best food you can ever eat I love the service I love the food this place is a must try 10 out of 10 recommend"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNk1LcFhBEAE",
            "text": "Tengo anos visitando este lugar excelente 👌."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5XzZpWFFREAE",
            "text": "Very good pizza and friendly staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkcksyZDZRRRAB",
            "text": "Nice people great pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeEtTbERREAE",
            "text": "Best kept secret in N.Y.\nBeen eating everything here , in all its vast varieties for over 20 years .\nThey make the best shrimp Parmigiano heroes in NYC .. .\ndriving a yellow-cab , I've tried others allover NYC , and that includes Brooklyn , where they have great pizza spots  😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOX055ZnJBRRAB",
            "text": "Visiting from out of state, we really wanted a genuine NY pizza. This place has GOOD pizza. The previous reviews do not lie! We got a medium pizza and it was still huge. The staff was friendly and served us as soon as we walked in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxa2R2cTF3RRAB",
            "text": "Food is amazing with the old school pizza shop vibes . Great service,  awesome food at a reasonable price 👌🏾 👍🏾"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMElqczh3RRAB",
            "text": "Good pizza, chicken cutlet, beef, vegetable, fish, shrimp, rice, sandwich, wraps, sausage & peppers. Busy at lunch time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbzZTRy1nRRAB",
            "text": "Going here for 15 years and never had a bad experience with him. Aways fresh and always happy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsZzZuaWFBEAE",
            "text": "Best pizza on new york"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNzdESVRREAE",
            "text": "This little corner gem is a great place to have lunch or dinner if you didn't already know.\n\nI had a broccoli chicken pizza that was crispy and with lots of cheese today. My son had spaghetti and chicken cutlet parm diah that comes with veggies broccoli green beans and carrot mix steamed to perfection and they add a small garlic bread yum!\nWhen you walk in it appears to be small but tjwre is a small seating area upstairs as well. The parking is not too good out there on the Avenue but there are meters if you can find them. 😊\nThe cooks are friendly and food taste great.\nFor the two I spent a total.of $19 and well worth it. This indludes 2 drinks.\n\nStop by and check them out.\n\nHablan Español"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGaV83Smd3RRAB",
            "text": "Awesome pizza and definitely the BEST pizza in the area.\nThey are genuine HUGE New York slices. I took pictures with the remote for sizing references. If you live close by the delivery is free and fast. My fave from them is definitely the pepperoni slices or pie. I frequently visit the physical location and had a chance to speak with the owner - He’s such a sweet guy. They’ve been in the area for years and watched it grow to what it is now. (Mott haven use to be really industrial) Definitely a gem in the neighborhood! They have menu options other than pizza which is a plus too."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMWJIc1JREAE",
            "text": "♥️🙌…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcy1hTEJnEAE",
            "text": "These guys make you want to forget your lunch thats how good the pizza is!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGbzYtWFhBEAE",
            "text": "Their salad is good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eUw2OGdnRRAB",
            "text": "The food is so good this is a must try place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1OGFmdUVnEAE",
            "text": "Nice go to place to pick up Italian food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacjRlV1pnEAE",
            "text": "I Ordered a large extra cheese pizza pie. I recieved a cold pizza pie no extra cheese. This is the 2nd time I've been disappointed. The first time  I was charged twice on my debit card for the same order, needless to say I will not order again from this establishment."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacDQtTlF3EAE",
            "text": "When placing an order, call and ask for the coco-bread!\nYou won’t regret it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaOHFiQ3pBRRAB",
            "text": "This is a great hole in the wall spot for Italian/pizza.  I've never dined in; take out only.  They have super fast service, friendly staff & great food.  What else can you ask for?"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMnVpMDZBRRAB",
            "text": "Just started going to a physical therapist that's around the corner from Angie's.  First time getting food from Angie's and I'm going to say that I was extremely good. I've been craving some Italian for a while.  I got the spaghetti and meatballs for lunch which was extremely good.  I also got a meatball hero which my mother and I ate for dinner and we both loved it.  The meatballs are nice large size meatballs which I love, some other Italian places serve smaller size meatballs and the sauce was amazing.  I'm happy to say, that I'll be a returning customer from this point on."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNHJyVklnEAE",
            "text": "Tasty"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NFkzTXdBRRAB",
            "text": "Angie’ cafe is a true Gem in Italian food in the. Bronx. Just taste their meat balls!!!  Or Pizza"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSck9qXzhnRRAB",
            "text": "The best bang for your buck and the food is good.. $13 grilled flank steak, fried shrimp,bowtie alfredo, garlic spinach, and garlic bread"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtb1pxZzZRRRAB",
            "text": "They make good pizza fast. I especially love their crust, nice, crispy and flaky. Been wasting years going to the other place up the block when I could have been coming here.\nUPDATE\nI had to drop a star. The last few times I’ve been here the crust was super thin. I don’t know if it’s a budget thin but it was paper thin. Couldn’t even hold up the cheese and thin layer of sauce. Pretty disappointed. I’ve been going somewhere else for the last month or so. Hopefully others are letting them know. Good people working there but the pizza has downgraded sadly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeXNuMHpBRRAB",
            "text": "Great food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSLUtELVBBEAE",
            "text": "Best place for Pizza and Pasta in the Bronx"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodV9UMHJBRRAB",
            "text": "Fabulous NY pizza!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNVliZkV3EAE",
            "text": "The food is pretty good but the eating space upstairs does not accommodate people who are big. They have booths that is tight and uncomfortable for a big person to sit. They should invest in at least 2 tables with chairs."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNHRlRkt3EAE",
            "text": "I love this place.. Good pizza and good food/plates at a reasonable price"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZdnJTVlhBEAE",
            "text": "A really nice pizza place, their Caesar wrap is delicious"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3eXR5WWl3RRAB",
            "text": "Food is Amazing!!! grilled chicken Salad is always fresh and very well made"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2bU1xTjZRRRAB",
            "text": "I believe it's the owner who I'm referring to, but he is super nice and professional, his workers are okay, but personalities are fairly dry.\n\nFood is okay, hence the one star deduction. I've had better. But the variety is there and the do customize upon request. They also have pre made Italian food.\n\nThe appearance is clean but dated. I think they have a seating area upstairs, but I've never physically observed it, but I've seen non staff go up and down the stairs that shares the space."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNjdhSHR3RRAB",
            "text": "One of the few really good pizza spots in the Bronx‼️They are Pizza specialists...no doubt, their pizza is authentic and if great pizza is what you are looking for this is the spot for you!\n\nI've been going there for a few months and I have observed that they have a dedicated staff that treats everyone with courtesy & professionalism. They also serve other Italian dishes and their food is made fresh everyday. Oh! And if you ever feel like  baked salmon with a side of pasta or veggies they serve up a nice dish.\n\nThey have an upstairs spot for dining too...it is immaculate; the dining experience is enhanced because of this. Nice Spot‼️"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbTY3c3BBRRAB",
            "text": "I love this place. It gets really crowded during lunch time though. They deliver, the food is great and inexpensive. The staff is very pleasant. I also love that all the lunch is the same price regardless of what you get. Since I don't eat meat i usually find my self paying extra to get seafood, but not here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeTZiSFRREAE",
            "text": "Zero stars if I could. They’re all very racist in that pizza shop. I don’t care what anybody Else says, how the pizza is, whatever. They are racist to black people to dark skin colored people even if you’re spanish and your skin is dark, they’re rude, disrespectful and service is nasty towards you. Point blank period. They all said black people on welfare they don’t them in here. I’m Spanish but dark skin and they didn’t think I speak Spanish. I heard everything they said amongst each other, they don’t want black people in their pizza shop. Plus they feel uppity because the cops come in there 🙄 Never ever I am or anyone of my family and friends going back in there. Byw the pizza is not good I had way better, it was my first and last time there 👎"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCbTQ3WlJBEAE",
            "text": "Awesome pizza, awesome entrees. Thier salmon with bowtie pasta in garlic and olive oil was so good! Their have a Margherita pizza which I am looking forward to trying. The smells inside this place definitely wet your appetite."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dVlPdXBBRRAB",
            "text": "A hidden gem!!!  Great selection of pizza, including 1 of the best margherita slices around.  The heros are filling and the price is very fair!! There is ample seating upstairs with a bathroom.  The place is always clean and the service is always friendly and on point!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMweDV1aV93RRAB",
            "text": "The absolute best!! Food and pizza can't be beat. Sooo good. Steak and spinach plate is the best. Tender, tasty steak slices. Highly recommend. Between 12 and 1 it's crowded. One experience where they let Spanish speaking  customers skip…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMjhMbktBEAE",
            "text": "I ordered carry out pizza. A medium is huge! The sauce is the perfect mix of spices, and the ratio of sauce to toppings to crust is excellent. If I lived here, I’d order from Angie’s every week!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDcEtEN3JnRRAB",
            "text": "Best pizza in all of SOUTH BRONX.  Service is always great, and you can tell they make their pizza with love.  They do need to get some chairs for those little white tables they put in the middle of the pizza.  that would be great."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLMjhEdEhBEAE",
            "text": "My daughters and I have been coming here for their delicious pizza for the last 3years and today I decided to try their food.....Wow!!! I can't believe I've been missing out.( BTW I had a plate of Salmon, Shrimps, Spinach and Mash Potatoes)…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJc2E3WXJRRRAB",
            "text": "The variety of food is very impressive. From chicket cutlets to baked or fried chicken or flat iron steak. There's something for everyone. I especially like the split pea soup which they definitely should serve more often."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycC1HU0lBEAE",
            "text": "Whoever owns this place I love you. I don’t write reviews but I had to find this place and give you guys a review. Y’all food is very good, fresh. Keep it up."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbzRIZG53RRAB",
            "text": "The best pizza in the south bronx and the best stuffed chicken I've ever had in my life! They are a light in a food desert where the nearest food id McDonalds. Fresh ingredients every day and it shows. I LOVE this place and you will too!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHLVBxSWhRRRAB",
            "text": "I'm not a regular at this place because is always crowed and it's a very small storefront. I was recommended the Chicken Panini by a coworker and man it was amazing. The size of the Panini was more than I expected and price was reasonable.\nOVERALL 10 🌟"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjdDlmRjRRRRAB",
            "text": "The people there are the best kinda human you want to be around. There Italian food and pizza all kinds they are alll good u will not be disappointed i travel from queens just to get there food at least twice a week. Got to have it and when you try it you will to ."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMGJuSDRnRRAB",
            "text": "Joe is the best Italian chef  I know. And he always has a smile on his face. Been eating there for 10 years. Now I travel an extra 10 miles to get his food."
        },
        {
            "date": "15년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNRM05aNxAB",
            "text": "The food is great. The service is great. This place will not kill your stomach. You could eat here every day if you wanted to. It was a secret well-kept from me for a while, so go tell all your friends what's up with this place."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdGZtVFl3EAE",
            "text": "Low on variety but the buffet food by the pound is a great option and different from other Italian restaurants. The pizza is pretty good. Standard NYC pizza if you will, thin crust and crispy."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3MmEtMklnEAE",
            "text": "Angie's is my go to place for lunch. It is busy most of the time but this is only because the food is good! They are affordable. The first floor (where you order out) is wheelchair accessible, however the seating is in the second floor."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcGFlV1B3EAE",
            "text": "Amazing food!!! Freshly made, delicious choices, well worth the money spent! Highly recommend this place for dining in or take out.."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5bUpxZjlBRRAB",
            "text": "Their pasta is really good but a couple times I ordered for delivery and it came cold . I only live a few blocks away. Overall they have good food."
        }
    ],
    "reviews_count": 75
}