{
    "name": "Madison Cafe",
    "place_id": "ChIJzz6968X1wokRXJAJ2cQqXec",
    "grid": "BX1",
    "address": "463 Willis Ave, Bronx, NY 10455, USA",
    "rating": 4,
    "user_ratings_total": 524,
    "phone_number": "(718) 993-3555",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORGExSlFkUzB4ZG1KdlZuVkNibWQwWm5WU1pVRRAB",
            "text": "The ambiance was great and the staff made us feel at home. Excellent experience overall."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wYVRFeG9VMWR1Y2trMlMyMWFXalJuY1VGQlUzYxAB",
            "text": "Great Food ! Love it here !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeFRVZEZZemhNTjNKVGIyZHVaVXBZUzJveFdXYxAB",
            "text": "Madison Café – Willis Ave & 146th St.\nWould not recommend\n\nThe food here is decent, but the service is terrible. The staff are unfriendly, the cook always seems irritated, and asking for something simple feels like an inconvenience to them. I also noticed they sometimes charge more than the actual price unless you question it — which makes me feel they’ve been doing this to others too. Between the bad attitude and shady pricing, this spot isn’t worth supporting."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTmNuQkVaa3RrTmxSS1pFMTJUMFYzYmpRM2IzYxAB",
            "text": "I used to stop by this café regularly, but my experiences here have gotten worse to the point where I don’t plan on coming back. The food itself is fine, but the staff’s attitude ruins the whole experience.\n\nThe people at the counter and in the kitchen act like they’d rather be anywhere else. The cook in particular looks frustrated and irritated all the time, and if you ask for something simple — like extra toppings or seasoning — you get the sense you’re bothering them. There’s zero friendliness, and it creates a very unwelcoming environment.\n\nOn top of that, the pricing has been questionable. If you don’t ask about the total, they’ll sometimes overcharge. I caught it once when the numbers didn’t line up, and only after I pointed it out did they say “sorry” and call it a mistake. But after noticing it more than once, it feels less like an accident and more like a bad habit.\n\nBetween the cold attitude and the lack of honesty at the register, I can’t recommend this place anymore. If you do go, make sure you check the prices carefully. Personally, I’d rather give my business to a café that appreciates its customers and treats them fairly.\n\nThis place doesn’t live up to the stars it’s getting."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5R1oxaFVaa1ZuTlhOR05YbGFPRk5ZZURkemFHYxAB",
            "text": "This spot used to be one of my go-to places, but I can’t ignore how badly it has gone downhill. While the food itself hasn’t really changed in flavor or quality, the way the staff treats people has gotten worse and worse.\n\nThe cashier and the cooks act like they’re being forced to be there. The man cooking especially comes across as angry or fed up all the time. There’s no friendliness, no smile, and if you ask for something simple like a little extra onion, peppers, or seasoning, they act annoyed as if you’re asking for the impossible. It gives the whole place a negative, uncomfortable vibe.\n\nWhat really made me stop trusting them is the way they handle prices. If you don’t specifically ask for the total or break it down, they’ll sometimes charge you more than what it should be. I caught it myself when the math didn’t add up. Only after I pointed it out did they apologize and call it a “mistake.” But once it happens more than once, you realize it’s not just a mistake — it’s a pattern.\n\nBetween the rude service, the miserable attitudes, and the shady pricing, it’s hard to keep supporting a place like this. If you decide to buy food here, double-check your receipt and what they charge you. Personally, I’ve decided to take my money elsewhere — there are plenty of cafés and delis in the Bronx where customers are treated with respect and honesty.\n\nMadison Café has proven it doesn’t deserve loyal customers, and it certainly doesn’t deserve four stars."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eGFVbFpkM0p0UVV4WWNXdDFkVTVNV0VSMVMxRRAB",
            "text": "Review of Madison Café – Willis Ave & 146th St., Bronx\n\nI used to genuinely enjoy going to Madison Café. It was a convenient spot where I could grab food and exchange a few friendly words with the staff. Unfortunately, over time my experience there has drastically declined, and I feel it’s important to share what I’ve noticed so others can be aware.\n\nFirst, let me be clear: the quality of the food itself has remained consistent. The taste is decent and they prepare orders fairly quickly. That said, the way the staff treats their customers completely overshadows the food.\n\nThe girl at the register and the men cooking behind the counter have become increasingly unfriendly and unwelcoming. It feels like they have no interest in their job or in treating people with basic respect. One of the cooks, in particular, gives off the impression that he’s either deeply unhappy with life or completely resentful of the work he’s doing. He never smiles, always seems irritated, and if you dare to ask for something simple like extra onions, peppers, or a little salt and pepper, they act as though you’re bothering them. This is not how you treat paying customers.\n\nBut here’s what really made me lose trust in this place: the pricing. If you don’t ask in advance what your total should be, there’s a high chance you will be overcharged. I’ve noticed it several times. On one occasion, I actually added up the prices myself and caught the mistake on the spot. When I confronted them, they quickly apologized and called it a “mistake.” But if I hadn’t said anything, they would have pocketed the extra money. That experience made me realize this might not be an accident—it’s a pattern.\n\nTo me, this behavior shows dishonesty. Whether it’s intentional or not, overcharging customers is unacceptable. Combine that with the rude, miserable attitude and the lack of hospitality, and it becomes very clear: they do not value the people who keep their business alive.\n\nAt this point, I’ve decided to stop going there. If you do choose to eat at Madison Café, my advice is this: always check your prices carefully before paying and don’t expect a warm or respectful interaction. In my opinion, a business that treats its customers this way does not deserve your money.\n\nThere are too many other cafés and delis in the Bronx where you’ll be greeted with a smile, charged fairly, and actually appreciated for your business. Sadly, Madison Café is not one of them anymore."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNMm9rNUd1bmFYS1FREAE",
            "text": "I’ve been a regular customer at Madison Café for quite some time, visiting almost every day. In the beginning, I really enjoyed coming here—the food was fresh, flavorful, and served with a smile. The woman up front taking orders is always friendly, professional, and makes you feel welcome. She’s definitely one of the highlights of this place.\n\nHowever, I’ve consistently had a different experience with the two gentlemen in the back who prepare and package the food. They’re not very approachable or cooperative. Whenever I’ve asked for something simple—like a small adjustment or clarification—they act annoyed or bothered, as if customer requests are a problem. That kind of attitude doesn’t sit well, especially with regular customers.\n\nLately, I’ve also noticed a drop in food quality. I usually order the cheeseburger deluxe, and I used to really enjoy it. But recently, the burger has been overcooked, dry, and lacking flavor. The bun is soggy and sticks to the meat, which makes the whole thing less appetizing. I’ve also asked for an extra slice of pickle a few times—nothing major—but even as a regular, they don’t want to accommodate. That’s disappointing.\n\nConsidering how expensive the food is, I really expect better quality and service. Madison Café definitely has potential, but there are areas that need improvement—especially consistency in food quality and the attitude of the kitchen staff. For now, I’d rate it 3 out of 5 stars. Hopefully, they’ll listen to feedback and make the necessary changes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLQ2wwOUc2bzRiUFBnEAE",
            "text": "5/5 stars\nDish Tried: California Wrap\n\nHad a really nice lunch at Madison Caffe. I ordered the California Wrap—it was fresh, tasty, and the sauce that came with it was actually really good. It also came with a pickle, which was a nice little touch.\n\nThe fries were okay—not bad, but I like mine a bit hotter and crispier. Still, the overall plate was satisfying. The place has a cozy vibe and the staff were friendly. I’d definitely come back to try more."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3a0lHeENREAE",
            "text": "I ordered a veggie burger and I was not pleased at all. I couldn’t even eat it. They placed cheese on both sides so I couldn’t even add my lettuce and tomato because the bread broke apart what a mess. I also wasn’t expecting the burger to have actual vegetables. If you’re someone who likes your veggie burgers like that great but I am not. They also serve you on paper plates terrible. I am so upset because I didn’t even eat my food. Left without even eating. Never going back to this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdi1yTnVRRRAB",
            "text": "The customer service was great! As soon as you walk in, you're greeted with a smile. Best of all my bacon egg and cheese was delicious 😋"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNUlyS2tBRRAB",
            "text": "Buen servicio"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaS1PSlF3EAE",
            "text": "DO NOT ORDER FROM HERE. Ordered off Grubhub. They robbed me. Never sent anything and even lied to the Grubhub rep and said they are waiting for someone to pick up a 3 hour late order"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMV9PRF9nRRAB",
            "text": "My favorite place to eat in the area!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNua1pqOFRnEAE",
            "text": "Went there this morning for breakfast. Food was decent, but asked for well done home fries. They were cooked like Chunky Mashed Potatoes.\n\nOVERALL: I cautiously recommend this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyLXQtY0RREAE",
            "text": "Great food and always friendly service. It’s so hard to find good healthy options in our neighborhood, they’re truly a gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeXFibTFRRRAB",
            "text": "I’ve been to this store for years. I even remember when this store first opened. This spot was good place to get food years back… very affordable too but now This store is a total RIP OFF! I understand inflation is causing food and products to go up but these prices here is ridiculous and definitely overpriced on purpose! Please Do not waste your money and eat here! The food here is good but not the best quality especially for the price! It is not worth it! They are also very stingy with the amount of food they serve you..giving you small amounts at an expensive price! This store need to change they prices! For example: A bacon egg and cheese at this store is over $5 for one piece of egg one piece of bacon and one piece of cheese! There’s no reason anybody should paying over $20 for food and not getting a good amount of food or the best quality for that price! Platters here used to cost under $10. The prices here kept going up tremendously over the years! The prices here now needs to be lowered! There’s no way people will buy food there if the prices continue to rise. This is the Bronx. This store is in a area where people struggle everyday! Have some sympathy! Lower your prices OR give more food for the expensive amount we pay for!! Jesus Christ!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeE03LThnRRAB",
            "text": "Good food. And clean"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSMDhIQ1FREAE",
            "text": "Came here 3/30 for breakfast. The food was really good. I always love me some good diner food. Who would’ve thought. I think I’ll make this place one of my regulars. Highly recommend this spot. The service was fast and friendly."
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUclB2amJ3EAE",
            "text": "Best tostadas, ever!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbF9hTUVnEAE",
            "text": "Decent food, clean. A modest establishment in a modest location. Diner food, good coffee."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqLWJDYUtBEAE",
            "text": "Food is ok, mediocre at best. No standout plates and extremely overpriced especially for the south Bronx. Prices change every day and they charge an exorbitant amount of taxes. Recommended only if you don’t bring your own food to work and want a healthier (even more expensive)option than the other local places."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREX196a1l3EAE",
            "text": "WORST CUSTOMER SERVICE EVER ! They tried to overcharge me and when I pointed it out they no longer took my order. They are so money hungry."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREZzdUQXBRRRAB",
            "text": "Service Representative is rude, and seems angry at her work 😤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MFlqaGNREAE",
            "text": "I had been to Madison Cafe lots of times. It's just a couple of blocks in my neighborhood. I tried their dishes & I can tell you, it's really delicious. Their quesadillas & wraps are awesome. I'd definitely recommend this place."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZcWNEamN3EAE",
            "text": "Reasonable price"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKajl6NzVnRRAB",
            "text": "Foods amazing the atmosphere and it's waiters are astounding however the males behind the register are what kills this business. They'd rather talk amongst each other and not listen to your order than get angry with you when u tell them they messed up. Unless the women are behind the counter, I.HOP is up the block."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkcUlHQWt3RRAB",
            "text": "Nice small spot for quick in the go breakfast. I get my bacon egg and cheese on a toasted bagel or my butter and jelly. The staff is nice the I never have complaints."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROMV9MWEh3EAE",
            "text": "Visited a couple of times exclusively because of their salmon 😅\n\nVERY good and tasty - usually ordered with mashed potatoes or with rice and vegetables\n\nThe place was very clean and the service was excellent - they always made you feel as if you were having lunch back at home!\n\nThe prices are very affordable, no matter what your order\n\nTheir food is very tasty, fresh and clean - very good latin american cuisine 👍🏻\n\nTheir coffee is also pretty good, unlike the regular coffees you find in some other places 🌝"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0NE1qdnd3RRAB",
            "text": "There is nothing special about the atmosphere since it appears that most people order from here for delivery or pickup. The food is good and healthy fruit smoothie options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdmRMdklnEAE",
            "text": "Not a good place to eat. The food was horrible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxeW92cGV3EAE",
            "text": "Terrible hospitality uncooked home fries"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscC0tQ2VnEAE",
            "text": "They need a new cook  can’t even do a simple omelet or bacon eggs cheese 👎🏾👎🏾👎🏾"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMkxTSFd3EAE",
            "text": "I was hungry and I asked for a sandwich with everything and they send it plain and then I call the store again and they send me the lettuce and tomatoe with ketchup and mayo so when you order from here you basically have to make your own sandwich"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNXZlRXdnRRAB",
            "text": "La comida y el servicio son de primera desde quie atiende hasta quién te lleva la comida brindan un servicio afable y diligente. El ambienta no es nada impactante pareciera que estaba cerrado y están abriendo nuevamente"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoODZ1ZXFBRRAB",
            "text": "Resultados buenos"
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNROHVLX253RRAB",
            "text": "Muy buenas atenciones y precios justos"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNob3BxTFNBEAE",
            "text": "Very mediocre and horrible service. The food was cold and expensive. You’re better off ordering food from another restaurant. Definitely stay away!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNob3VybEZ3EAE",
            "text": "El sitio es bien sucio. Encontré cucarachas en mi comida. Cuando me quejé me ignoraron. Este sitio no vale la\nPena. El peor restaurante del Bronx."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCeTRTOFdnEAE",
            "text": "A staple in this area. Consistent."
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCM3NuR1FnEAE",
            "text": "Le service est très medioc ,regardé j'ai commandé un plat de 10$  ,le gérant m'augmente 40centim que c'est le fret de leur machine vu que j'ai n'ai pas l'argent en espèce"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCN3J5YXp3RRAB",
            "text": "I ordered bacon cheeseburger deluxe with onion rings instead of fries (paid extra to substitute the fries). Only for them to deliver the deluxe with fries and still charged me extra and didn’t even mention they were out of onion rings. At least give me the option to choose. I’m want my money back Don’t force people to buy food they don’t want or might be allergic to for a couple of extra bucks. It’s not worth the lawsuit payment"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcElMbEdBEAE",
            "text": "I’ve been looking everywhere for the best grilled chicken salad. Finally found it. Thank you Tony for stellar customer service!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtay1Ydk1BEAE",
            "text": "Pollo rostizado esta muy crudo"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdE1MRXhBRRAB",
            "text": "Great coffee!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtajluenJBRRAB",
            "text": "Discrimination against service 🐕‍🦺  n people with Disabilities.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbDltaThnRRAB",
            "text": "The delivery service is unprofessional."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOEptOTNBRRAB",
            "text": "Nice, friendly, and prompt service. Ive always seen this place when I do laundry. It's located right next to it. I decided to check if they serve breakfast all day. To my delight they do. It's an extra $1 after 11am, but who cares it's…"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdklmVVZ3EAE",
            "text": "The staff was friendly and courteous. The atmosphere is a breath of fresh air. I came here twice when it was a steakhouse. Total change and for the better. Large windows and vibrant colors add to the appeal. I ordered a Philly cheese steak…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhdF9IV19nRRAB",
            "text": "The food was really good and I love how it had a variety of options. The staff was nice and very attentive too. My only issue was the bathroom, it looked like it hadn't been attended in awhile."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRX3BhcU5nEAE",
            "text": "It was awesome!! Just 15 minutes away from Manhattan you'll find this awesome place. I am vegan and in a daily struggle to get good food, the staff took really good care of us and made me a huge portion of vegetables. You get water for free…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyemN6TEJBEAE",
            "text": "If I could give them 0 stars I would. Worst food in the south Bronx and very expensive on top of that. The food lacks taste and not too mention very small portions. Would anyone in there right mind pay $9 for this? Complete rip off. We live in the south Bronx and not in Madison Ave. Places like this should be shutdown!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyam8zSTVBRRAB",
            "text": "Ordered Madison Today, My husband ordered the  Quesadilla. After a few bites he started spitting the food out due to the Chicken not being well cooked. Once he opened the quesadilla he saw a piece of Brillo in the food. I called Madison spoke to Mr. Hernandez and he stated they clean the grill with Brillo. Well then why did it end up in my husband's food? Then Mr. Hernandez wanted me to bring the food back to the store for a refund or I can order something else for them to deliver. He was very rude, we will not be ordering from there ANYMORE"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNcWRQck5nEAE",
            "text": "The food is delicious, I love going there for breakfast with my nephews and they enjoy it so much"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtN3YyRWV3EAE",
            "text": "First time ever trying the food from here and it did not disappoint. Everything was really good will be coming back again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1aEwzUVJREAE",
            "text": "The food was amazing the waiter was very attentive and friendly. They even gave us buffalo wings on the house. The only reason I didn't give this place five stars is because is no longer well kept as before. When I first walked in I was getting ready to turn back around but as soon as we walked in the waiter greeted us is why I proceeded to walk in."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRMHMzX3NnRRAB",
            "text": "Muy rica comida y el servicio es muy amigable y servicial"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRX1ozWGN3EAE",
            "text": "Service was quick and efficient, seating is awkward since it's a eat in / takeout hybrid restaurant. Overall was a good experience and food is more than adequate. Decorative walls are interesting and the wide selection of choices on the menu are bound to satisfy most people."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwdEo3YTZBRRAB",
            "text": "All staff are very generous and they love what they are doing. I pick everything bagel and coffee from them many times. As soon as I call them, they know my order already, so you can guess how good their customer service is. Their food tastes amazing."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdmVpWmJREAE",
            "text": "I have been eating in this establishment twice a month for over a year with never a problem until today. I take a seat at the 1st table because the other five were taken. All of the sudden I’m invisible. I sat there for almost 15 minutes…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwcXM2d0N3EAE",
            "text": "After Googling vegan food near me, this place came up. A friend of mine has food restrictions so we decided to go there and check it out.\n\nThe place is dated, but CLEAN. The people who work there aren't overly friendly but they do a good job in making sure that they get your order right.\n\nThe place isn't vegan, which holds no bearing on me, but of you're going to Google a vegan place and it comes up as an option, they SHOULD have vegan dishes - granted, they do have a veggie burger....and a few Mexican vegetables dishes that are more vegetarian than anything.\n\nThe food was really good and the waitress(?), made sure we got what we needed as far as utensils and a box to take the leftovers.\n\nThis place is GREAT for a quick bite or something to bring home if you're not up for cooking."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJbHNlOFl3EAE",
            "text": "Do not order from this place!!!!! They overcharge every order and apon calling they say the prices changed. I ordered a gyro sandwich ( menu price $4.95 ) and was charged $5.95. I also order 2 Mexican Tacos ( menu price $2.75 ) charged…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVbklEb29BRRAB",
            "text": "This spot is so bomb to me fr fr . Like I already wrote a review on grub hub but I got to update it and just give them a extra 5 points . As far as delivering and instructions you can never go wrong with this spot . I ask for extra bacon…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBakpmQ2V3EAE",
            "text": "Both myself and coworkers have ordered from here and have been extremely dissatisfied with the food, the service and the delivery people. In addition to cold food, missing items and slow delivery now they seem to be trying to tack on extra…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRMzVHZ3BRRRAB",
            "text": "Amazing food. Very polite and professional staff. Takes Debt / Credit over the phone and will deliver sometimes straight to the apartment (Don't recommend they do that). However, their pricing is a tad on the higher side."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlanVqS3R3RRAB",
            "text": "I'm having this now. It's delicious It gots taste well sized."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4c1lPNVZREAE",
            "text": "I loveeeeeeee Madison whenever I don't feel like cooking this is my go to place since they have opened ... its always order to go though ... i sat inside once their serve was amazing. They are very nice to the customers. U wouldn't be…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjNU1IWHNnRRAB",
            "text": "I go there all the time and I took my fiancé there for the first time 2 years ago coming from CT. and she really likes there food. Very friendly staff and attentive. The prices are very reasonable for the amount of food you get on a plate ."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3OHVEU3N3RRAB",
            "text": "its a great place the food is good. a little pricey but you get what you pay for. it would be 5 stars if my 3 dollar cup of iced coffee would be full when it arrived here. if they placed the little sandwich bag under the cover, it would spill a lot less."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MXV5RmlBRRAB",
            "text": "i have ordered from this place on 4 separate occasions and the last three times my order has come incorrect. My last order was for a bacon cheese burger with hot wings and fries but the burger had no flavor and the fries were hard. Also i…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneUxyWHh3RRAB",
            "text": "The only reason I gave this a second star was because of one of the ladies named Lupe works there. Otherwise the manager is a nightmare. He served me rotten sausage and refused to give me a refund and he had a serious attitude problem over…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzOXFlLTdRRRAB",
            "text": "If you’re looking for a nice, casual, laid back place with good food, fair pricing, and in the south Bronx, then this the place. Staff is friendly, the atmosphere is colorful and inviting. Great place to enjoy a meal, and it won’t hurt when you see the bill."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1Mks2RzF3RRAB",
            "text": "As I was sitting, reviewing the menu, I was approached by a stranger from the street soliciting for money. I didn't have any cash, but he wouldn't accept my answer. After several minutes, they shooted him off. Feeling uncomfortable and hungry, I ordered a vegetable omelet w/bacon, pancakes with blueberries and strawberries. My eggs were far from an omelet, and the pancakes were dry."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURReHNQTklBEAE",
            "text": "Called today for a delivery and the girl informed me they are no longer accepting payment through the phone not debit nor credit. Last time I checked we lived in the 21st century how can you take that option away. This is the second time,…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRZ3JtUlN3EAE",
            "text": "There food is good, but there prices outrageous, especially for the area. In my opinion if they are going with those prices then up the quantity of the food.  This will bring praise and more value to your customers."
        }
    ],
    "reviews_count": 74
}