{
    "name": "Rosa's At Park",
    "place_id": "ChIJgfSTonj1wokRA3vK2Lzo04Q",
    "grid": "BX1",
    "address": "2568 Park Ave 1st Floor, Bronx, NY 10451, USA",
    "rating": 4.4,
    "user_ratings_total": 530,
    "phone_number": "(929) 502-3700",
    "reviews": [
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRk9FMHhXbEpYVjBGNE9WaEVkbmc1ZFhSTGRtYxAB",
            "text": "Great food. Great Great food... one of the bronx's hidden gems 👌"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVGVsRlVia1UwVmxGNlIzRlJWelZRV2tSNmFVRRAB",
            "text": "Great food and service. I feel bad I for got my waitress name but she was great."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMVZITmlURFZEV2toS2FucDVZWFozT0d4NGMwRRAB",
            "text": "I absolutely love the stuff and food is always amazing. I left my phone and was going crazy and the found it at my table and left it with the front desk. Love love love the team here."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTk4xSnBZMFpoYkVwWk1rbHBVRGRJYVZnMU5WRRAB",
            "text": "The hotel stacks on service charges and other charges and makes the meal more expensive than it should be. The service charge is not the tip either."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVlFVRlVjblI1WkV0aWNqQjVURXhmT0doSmVYYxAB",
            "text": "Enjoyable seating, wonderful service! Stayed at the hotel so went down for a quick meal the night I arrived. They had a taco & margarita special that was delicious! Excellent margaritas and a beautiful roof top venue as well. The menu has something for everyone and you can dine alone or with a large group. Come check them out for a fun night with your friends!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTlJrVklSa2N3ZFRWQmFUaEVMVmh2WW1JM2FtYxAB",
            "text": "My friends and I had a great time celebrating our friend’s birthday. Skye was so nice and offered great service and vibes!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdFp5MXBhMlJIV1cxUU4wSnNWWEJIWlVVNVgxRRAB",
            "text": "Rosa’s at Park is the Bronx’s best kept secret. I love the vibes and the atmosphere. The staff is dope and they are fun to be around. The food and drinks are delicious and affordable. And of course the roof top is pretty in pink decor and lights. DJs always got the true tunes! The crowd is cool too. Check out their website for the food menu or for all the awesome events they have - game nights, brunch, movie nights. Dag. I really want to keep Rosa’s a Secret, but they deserve their flowers! I wish this place to stay just as they are - for the community. But also, please go support them! 💕☂️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKT2MyOWxibkE1UmxscmRGZENVMnBLWTFscE5FRRAB",
            "text": "Food was mid, French toast was very hard not really soft.. steak was delicious and bottomless option was great! Service was amazing our server was very sweet and always checked on us, she was great. But I give the food 3/5 tbh.. Music was A1, different vibes every song I liked it but it was extremely loud for just us being outside"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSclVHaHdhbGxvVFV4T05FNDRhR3BrVm1oM1FrRRAB",
            "text": "This place is a gem.   Great atmosphere and service.   The food was presented well and tasted great.   Highly recommend the brunch dish \"Siete Golpe\"."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vd1VEUk1hemhMVVdSZmFuSnZiMm80T1dacE9VRRAB",
            "text": "Our car was broken into  while we ate no one helped and we oaid a 500 dollar bill there was no one checking cars. Area sucks even though food was great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVGRFTldNVmRYVTI1S2NVeFhNa1JQZFhoNWQzYxAB",
            "text": "The food, service and ambiance were great, however, there were little gnats and flies throughout the restaurant (inside dining area) which disturbed our meal. We asked our waiter if he could do something about it but he said he couldn't and could only apologize. We had margaritas from the happy hour menu and they were strong and good. The food was flavorful and delicious. We had beef empanadas which were a bit salty but still good. The waiter was attentive and always checked on us."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMk0ycG5Nbmw2VVVkSk1XcEdXbkpJZW5CUGJWRRAB",
            "text": "The staff is just a vibe.. good food,  good music, beautiful ambiance..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSk4ybFdlblpPUVRBMlZXeFZiM1Y2UW1FelZWRRAB",
            "text": "Staff was very nice and accommodating ! My party was late but was still able to be seated for brunch. Food was mid but bottomless drinks options were great. Would have been nice to eat brunch on the rooftop would have been a better vibes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbFluaHBkamhFVGxVdE9WbHJORGhoZERGTVdWRRAB",
            "text": "#whereisweekes.....Eating at Rosa's At Park. The shrimp pasta I had was good, my son's food oxtails were tough, GiGi and her moms food was ok. The host Joseph was the most....he was great and made sure our unlimited drinks kept coming. The rooftop was cool but the supervisor wanted us to pay $20 to stay on the roof....NOT. We just spent $290 down in the restaurants, we good. The 🎶 was on point, security cool people. In all we had a good time. That was my second time there."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNE5HZGtOMVZQY2s1WmFsTmhPSGh5Wm1GRVJIYxAB",
            "text": "Food and drinks good\nDecor was amazing\nTo many flys 🪰 around the table"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbFRFeEhRVnBxVlhRd01YaGhlREZFVkd3M05FRRAB",
            "text": "Enjoyed my dining experience here. I was visiting with a friend. The food was great, as well as the service. I will definitely come back to check out the Rooftop, where they have a DJ playing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRVpqbENPRkV4YlhsTVVYVjNWVXR3VVRsMVZGRRAB",
            "text": "I loved this place!!! Food was great. Drinks, great!! Isabel was awesome and she made sure I enjoyed my birthday. Will visit this place again soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JdGQzWkphV2MwV1VWUWVrZHdNRzlwY21OdlNuYxAB",
            "text": "The service is horrible there. The Ambience was Nice There. Good Music & Drinks"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdUxXbGlNREZNVUZNM1drMVZUbmx2UWs1MlpFRRAB",
            "text": "I got food poisoning here. Service left much to be desired. A lot of bugs flying around."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kYVQwcG1SM3BMYzJ0b2NGZG9kREk0TWsxMkxXYxAB",
            "text": "The food and drinks were good. The calamari was very good!\nI asked for my steak medium rare, but it was rare. My salmon wasn't great, it was dry and didnt taste fresh. I would have been upset if I only got the salmon. The atmosphere was nice. The service fee was unexpected and the ny state tax was unexpected, so that added an additional 40 dollars to the meal on top of the meal cost and the tip. Was it worth it, yes, I'd go back, I just wouldn't get the salmon again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MlJXeExiR2xJWW14R2RsRkZkbUo0VUhGV1pFRRAB",
            "text": "Good food, service and nice atmosphere. DJ on a Friday evening was good. Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacFRVZHZkMlF6VlVOV2JDMTJVa0ZJYUZaa1gwRRAB",
            "text": "Fun place with great vibes and good drinks. Definitely would recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1R1lreGhSMmcxUXpORVlWZDZPVmx6VkVKUWEwRRAB",
            "text": "I stumbled upon this place by accident by staying at the hotel. Let me tell you they do not disappoint.  Staff is 10/10. Food 10/10. Vibe ✅️10/10. Owner is amazing. The indoor and outdoor space and decor is a vibe. Highley reccomenend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMVMweE9WMVpMWmpsdVIwbFllV2RJZEd4cWVXYxAB",
            "text": "The food is ALWAYS amazing! The service is ALWAYS excellent! The vibe is ALWAYS perfect!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMFpXRkNSbFpGU1hkU09EZEJlVXhhTmt4MFRWRRAB",
            "text": "Came here on July 6,2025 to celebrate my sister July 4 birthday. When I found the place I was a bit shocked of it's location but knowing that The Bronx is up and coming I said ok it looks cute. Once our entire party arrived we were seated. The music was a tad bit loud as the place had just opened at 11 and there was no crowd by the time we sat down at 2. Once our waiter came to take our order he realized that the music was loud and turned it down. Like I said the place is really cute. 4 of the 8 of us ordered the bottomless Mimosa for $30 for 90 min. Now time to order food. Since I don't eat read meat I had a choice of chicken or a crab salad. I opted for the chicken & waffles white meat OR you can get a leg & breast or 2 dark 2 white no wings as an option (SAD). I cannot remember our waiters name but he was VERY attentive to ALL his tables. I'm the type that like to people watch. NOW ON TO THE FOOD. Waffle very light fluffy & flavorful, Chicken crispy juicy UNTIL you start getting to the middle of the breast and it's TOUGH as nails. I took the leftovers home tried to eat the chicken and AGAIN TOUGH as nails. I am hoping this place is not using 3D printed meat and not letting the public know is not only FALSE ADVERTISEMENT but endangering people who may be allergic or have a sensitive stomach to fake foods such as myself.                                                                                                                Another thing they were so focused on keeping the railing and floor around the railing clean (if that woman was the manager) at no time did she walk around and check on ANY patron. As a previous manager of a bar in a casino I made sure to engage with the patrons make them feel appreciated that they came out to spend their hard earned money. Just a thought. But overall the place is beautiful under a hotel even better. I would definitely return as long as the EXTREMELY LOUD party of 9 that was there aren't there they made the experience hell where as our waiter had to turn the music back up to drown out their noise.                               Everyone at my table had something different to eat and there were no complaint from the crab salad to the steak and sweet potato waffles.                                                                  I can go on about my first experience. It wasn't bad at all with the minor loud crowd of people.      Will bring new friends next time to experience this beautiful place."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURta19yaV9nRRAB",
            "text": "First time I came to Rosa’s was for Brunch. Food was amazing and the vibe is incredible. This is definitely a “Insta-worthy” place to take pictures. I go earlier if I’m with my kids. For Bruch, I had ordered the French Toast which was amazing!! The wings are on the sweeter side. Went for dinner as well, Pollo Relleno was delicious! Chicken was so juicy! Drink wise…their mimosas be hitting! My favorite drink to have is called Wonder Woman (I substitute the Henny for Jack Daniels). Also attended events & pop up shops on their rooftop. This is overall an amazing spot to hang with friends, family or by yourself. A staple place for the Bronx! Rosa is amazing & so is her staff! They also cater now, events for dogs & more."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQlJuRjRhRzF5UTFkeVYwTlJWVUUwWm5GWGVWRRAB",
            "text": "Had a fantastic time at the Rosa Parks brunch with my family! Even though we arrived a bit late, the staff was incredibly welcoming and flexible. I have a seafood allergy, and they were super attentive, making sure my meal was safe and enjoyable. The service was excellent—friendly, professional, and accommodating. The vibe was upbeat with great music, and a warm, inclusive atmosphere. The food was delicious, and the mimosas and sangria were perfectly made. It truly felt like a celebration. We had such a great time and can’t wait to come back. Highly recommend this brunch experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaVJVOXlVREZGZGpWNlgzUXllVU01Vm5aQ1VrRRAB",
            "text": "First, I would like to say what a beautiful atmosphere you have for a really great brunch. The DJ was spinning all of my favorite hits while the sangria was poured into my (and my husband’s) glass. We had a delicious meal of avocado toast, Dominican Benedict, pico de pollo and fries. We enjoyed the sangria and the passion fruit mimosas.\n\nUpon being sat, our waiter excitedly told us that it was your fourth year anniversary! Congrats! The vibes were great from the moment we sat down until we entered the rooftop (which our waiter specified we could attend with our children (6 &3 mo) before 5:00 PM)\n\nAlthough I suppose it is not traditional to bring your daughters out with you on a day like today, my husband and I do not have family support. He and I raise our children on our own and we pride ourselves in our children being well behaved and fun in these situations.\n\nUpon entering the rooftop, we are told children are not allowed. That is fair, as anyone is entitled to run their establishments how they see fit. However, after spending $150 on brunch and looking to continue the party with more friends visiting us, we were unaware of this policy. In fact, the opposite. We were told children were welcome until 5 PM. Arriving upstairs we were told we were allowed in, but we must stand at a high top, regardless of the many empty tables around us.\n\nAs we were planning on spending more money in your establishment, we decided standing wouldn’t work for our family. Unfortunate, considering we are avid hookah smokers and would have loved a few more cocktails with our friends.\n\nNo signs were hung saying 21+, nor was it listed on your website. This is discriminatory and biased.\n\nIt certainly puts a damper on any future experiences and any recommendations we may give to our many friends in the local area.\n\nLooking forward to a better experience in the future, given we now know the secret rules."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeWVrVktVazF5YjJkM1gxOHRNakZ5YkdOZk4wRRAB",
            "text": "The food is and good and atmosphere is nice . Me and my friends decided to order a casamigos margarita pitcher . It was nothing but juice . When we look at the bar it was no casamigos please be careful when ordering top drinks . We pay 90$ for juice . On top of that the server was telling people to go to her to order the drinks etc."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQ1ZVbEtRV3R3ZVRsMllWbG1ka2gwUm00eGNtYxAB",
            "text": "This place is nice and has potential be careful with one of the servers . Me and my friend order a pitcher of casamigos margaritas and was charged 90$. The pitcher tasted like koolaid no liquor.when I looked at the bar there were was no casamigos . The server didn’t want to come to us . She didn’t want to do nothing . The food was good but be careful when you order too shelf drink."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNVpWUlZMVk0xUm1jM2ExbExia0ZaYWxCWmFXYxAB",
            "text": "Stopped by to support a rooftop gathering. Had one drink. Great sound system, that's for sure. First time there. We'll decorated. Easily accessible by different modes of transportation."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeFZUVk9SWGMxWDNCYU9HZFJMWE50UTFwMFNFRRAB",
            "text": "The food was good. Service was excellent.  Clean surroundings and excellent photo ops."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMFZrRTJkM2hvUVc5cE5FeDVVVkZOV0Y5YVNIYxAB",
            "text": "It's always a good time here. I finally experienced the rooftop and loved it. Im thinking of renting space for a work event."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NnRIX2pBRRAB",
            "text": "Place is a nice vibe good music and great food always getting a parking spot no problem the oxtail was a lil tough but other than that everything was great for the party of 12 that I came with everyone enjoyed the food and place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsck9HUktWRkJ2TVc5SFQwdzBYelpaWDI1cFpFRRAB",
            "text": "Great bartenders with good vibes and  great drinks"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJS1Z6cXVLaDhfeEN3EAE",
            "text": "Love it is the place to stay and eat in the area"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPdmpuSWVhb012R0V3EAE",
            "text": "The atmosphere here is top-tier—great music, beautiful rooftop views, and a really cool vibe overall. It’s the kind of place you want to love.\n\nUnfortunately, the service was a huge letdown. I waited over 45 minutes and wasn’t acknowledged once—not even a menu or a glass of water. It’s hard to enjoy the setting when you feel completely ignored.\n\nThere’s definitely potential here, but the service needs serious improvement. Come for the aesthetic, but don’t expect to be taken care of right away."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VOMlAxSUhEaU5sTBAB",
            "text": "Really cute place. The food was delicious. The music was on point and the staff was very nice. Happy hour prices and options were great"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKenR4YW5sOU1xbXB3RRAB",
            "text": "Food and service was great highly recommend coming here for brunch"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJUEN3c3ZmcmVTZHNRRRAB",
            "text": "I really don’t ever leave reviews but they deserved it. I hosted my birthday celebration here and everything was beyond amazing. The rooftop closed last minute due to weather, but I was still accommodated and the staff made sure everything turned out great. My guest loved the atmosphere, the music was AMAZING, and the service was perfect! I will definitely be returning. Thank you so much Jess, Cyndy, and everyone who made my day what it was :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYmcyUGZVM2R2Z05nEAE",
            "text": "Great restaurant like the food and drinks.  Also love that their dog friendly I enjoyed the wooftop Wednesdays."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQRHhnY09iLU9PLXZBRRAB",
            "text": "Had a princess Brunch with the ladies and our girls ❤️ great time!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPbVE3ZUMwX0t1cG9BRRAB",
            "text": "Myself my mom and sister came here recently. We had a reservation, so it was really a matter of us just being seated which we had no issues. We were seated and maybe after about 5 mins the waiter came and took and drink orders and our food order. This is where things began to go left. As he is taking the order my mom specified one thing to him and I’m assuming due to the music being so loud he heard something else. The food came out and the order was wrong. In addition to it being wrong the food was so salty. My mom had spinach on her plate, tasted like they dumbed a bag of salt on it. I ordered the chicken with rice & beans. The beans t salty as well just not as bad as the spinach. My sister ordered the most decent thing on the menu, the Cesar salad with chicken 😂. It took forever to try to get the waiter because it was clear he was either the only waiter or maybe all of two. When my mom told him about the food and the mix up with her order he tried to tell her, “ you said you wanted …etc”. I have worked in the food industry and I did it for 5 years, you don’t say that to the customer. All he had to say was I understood you wanted a vegetable, so I was under the impression you wanted it for both sides. They brung out the beans she asked for and again hers were salty. At this point we asked to speak to the manager because we were sending the dish back, but also so they were aware of the quality of the food. We asked the only other waitress if she could get the manager….she never said anything to the manager. I myself walked and asked her if she could come to the table and eventually she did. They took the order off the bill. That was another issues because we waited over 30 mins to receive and pay. It was getting so bad I told my mom we should just walk out because why are we waiting over 30 minutes to pay for our meal? That is ridiculous. Overall, worst experience I think I have ever had at a restaurant. I understand they may be understaffed, but then unfortunately either you cut down the amount of customers or I suggest you hurry up and get some extra staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNREp1YXlSNzZxYzlBRRAB",
            "text": "Amazing food, Great service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSDNqTWVaX2RHOWZ3EAE",
            "text": "I love reading reviews. I wish there was a way to engage and interact with other people and ask questions. I would love to ask the young lady that had a horrible experience, in what planet or alternate reality do people just walk into a place, sit themselves down and then storm out like petulant children when told to allow people with reservations to sit? Can’t make that up. Entitled much? I see that 98% of the time, like me people love the service and the food. Music is always fire. Definitely going to keep coming."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbVd3TnpYc2FTVHdnRRAB",
            "text": "Cinco de mayo at Rosa’s at park was a vibe. My friend hosted a party here and you had to make reservations in advance. It rained and we couldn’t go to the roof but they still accommodated everyone in their main area. The Dj was fire so was the drinks. Will definitely be coming back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMS28yWlBVN0k2alNREAE",
            "text": "stopped by here because i was in the area and wow this place is underwhelming. do yourself a favor and don’t go here. the service is terrible, and food looks underwhelming. not only was the place filthy, but the owner clearly hates her life and job. she is rude and literally told me “i don’t care”. place is literally a dump, save yourself the trouble and go elsewhere"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZLVpIaTZnRRAB",
            "text": "Went last Wednesday for a doggy happy hour and The atmosphere of happy dogs,  their friendly dog parents and the music  was the only part of the event that I enjoyed. Everything else I felt like it was pulling teeth and it went down hill as soon as we ordered . I paid $11 for my ticket and when I arrived no one was there to receive me and other guest - I patiently stood at the entrance and waited for the host to get his phone and log into the scanning app. As I waited , I realized that the line for food and drinks was getting longer and longer , immediately I felt like they were not prepared for the crowd.\n\nI made it to the line, good energies and so I sparked up conversations with dog owners but after a WHILE ,we just wanted food.  I realized we were waiting close to an hour!!! Stomach growling, I Finally I made it to the front and the bartender said “No Food Only drinks” we are backed up in orders. Mind you,  they only had wings on the menu , nothing else. Drinks were advertised as       $ 8.00 but after tax and automatic 18% gratuity 2 drinks were $24.00 . The bartender was rude because he knew he was automatically tipped. I’m going to spare you with the details. To add insult to injury . 30 minutes later , I realized the line was shorter and that people were ordering food. I got back on line for 10minutes     ( total of 60 minutes waiting to place an order that evening )and when I reached the front , 2 drinks later , I asked for wings , he straight up said , we’re not serving food anymore, the lady in front of you got the last order!!!! Tipsy from having almost two drinks with no food and irritated I was almost on the verge of tears !!! 🤦🏽‍♀️😭🥺🥺I guess the manager saw my disappointment and disbelief, felt sorry 😢 for me and said , just give it to her. Not trying to sound bitter, but the wings were thrown together with no flavor and I just took the L and washed it down with the rest of my terribly made margarita. 😖😖. I’m glad I met some nice people because we all were in the same boat when it came to terrible food and service."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBc3NhUXhBRRAB",
            "text": "Rosa, you know what we want !! , Great food, great service and last but not least your entertainment is simply \" FUN\". You make people happy . Keep it coming,  we love the whole package."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaF9ETGdnRRAB",
            "text": "I had a beautiful time there with my family the music was good the food was good the staff was excellent"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzb0ppNWp3RRAB",
            "text": "The experience was truly remarkable. My wife and I had a delightful time today. The food was exceptional, the drinks were crafted to perfection, and the music was enjoyable. However, the only minor issue was that the music was slightly too loud, making it challenging to converse with my wife. Apart from that, I thoroughly enjoyed myself and expressed my desire to return. The ambiance was pleasant, and the staff, particularly the hostess, was welcoming and exuded positive energy. It was a wonderful opportunity to come together and enjoy singing and dancing. Thank you, Rosa. We look forward to seeing you again soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3LTVYZE9nEAE",
            "text": "Delicious food and top notch service! Came here for a late lunch on a Tuesday - had the shrimp croquettes for appetizer and steak entree. Both were delicious and flavorful! Even the veggies were good. The waitress was polite, courteous and just great! Drinks were well made and not watered down. I can’t wait to go back and highly recommend Rosa’s!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREb2NlUU5BEAE",
            "text": "We had a family brunch... party of 6 on a Saturday afternoon. Atmosphere is good. Spot is located in hotel lobby. we actually walked passed the hotel looking for the spot at first. its conveniently located near 4,5,6 trains. Service staff was great. Sky was our waiter. She did awesome. The food and drinks were good. DJ played good music. My wife hasn't stopped talking about the place since we left."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNTRTU3ZnRRAB",
            "text": "We had such a great time!! . Excellent experience over all!! From the moment I called to confirm the reservation,  Jonas took his time to explain everything to me. We were updated  to a private room to accommodate our group size. The service was attentive,  friendly and professional. To the food , the prices ,the drinks and DJ were wonderful.  Highly recommended!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2dzVHaVVBEAE",
            "text": "Amazing atmosphere. Was greeted by every staff member upon arrival, seated very quickly! Our waitress, Elsy was phenomenal! She explained the menu very well, offered us suggestions for drinks and appetizers and substituted one of the sides for my friends entree. The music was a great mixture of old school and updated hits.\n\nThe food?? SPECTACULAR!! I was blown away by the appetizers, and the entrees were just as great! I had the purple Reign drink and it was sweet, refreshing and had the perfect amount of alcohol!\n\nWill definitely be returning to try out the Brunch menu!\n\nI give this restaurant a 10/10!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyLU4tcEVREAE",
            "text": "Went here for a birthday brunch on a Saturday afternoon. It was nice to find a rooftop bar and restaurant in the Bronx. It looked very nice but We were seated on the rooftop and it was extremely hot. I feel sorry for the employees working up there. We were literally burning despite the umbrellas being up. I suggested to one of the staff that they should put fans up there during the summer because it is very uncomfortable. Overall the place had a nice atmosphere inside but the pre-fixed menu on the rooftop was very lame and extremely expensive. It was unlimited mimosas our sangria and only a few food options which were all bad (see photos) for $65 plus 20% service charge plus taxes. I’ve had much better at other places for way less money. The service charge sucks given how much we suffered in the sun up there and how bad the food was. Maybe the food downstairs is better but I don’t understand how this place has 4+ stars.\nI’m not used to paying this much money and have a bad experience. I feel like this place has a lot of potential but they definitely need to work on their pre-fixed menu on the rooftop."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyLWJUekl3EAE",
            "text": "4 Stars because the music is too loud for chatter! Extremely limited vegetarian options and no vegan options.\n\nI don't know why on IG and other places all you see are pictures of people on their swinging bench when the food is as good as it was. So 5 stars for the food and service. The space is clean and trendy. Definitely a cute place to gather for a celebratory brunch. But if you didn't read the 1st sentence well this is NOT a place to catch up with friends. I lost my voice. Between alcohol and screaming over the beats, my vocal cords couldn't keep up. The music was great other than being too loud for a restaurant. We went on a Saturday. The all you can drink (times) brunch we never had to worry about them being stingy with replenishment. Our waitress was also very good about getting some vegetarian options for our 1 friend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeE83VFl3EAE",
            "text": "Stopped at this place, on the way back from a hike across Highbridge. The atmosphere was exciting and fun. However the service was lacking. The staff appeared new and untrained. From the greeter who told us it was her first day and did not know how long the wait was to the waiters trying to figure out who should be our server. Presentation of the food was beautiful, but it bland for Caribbean  food and not very authentic. Ordered the Tito’s Mule but it tasted if they forgot the Titos. Order 2 separate drinks and both weee watered down. The food was reasonably priced, the drinks were not. All said , I love the concept. They may have just hand an off day. So I plan to return to give them a second shot… let’s see outcome."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaVlMY1dnEAE",
            "text": "Came here for my birthday celebration, ofc I was late but the lovely owner saved my table for me and was more than accommodating. By the end of the night I was in love with her lol personality💯She kept checking in on us and making sure everything was perfect. Food was beyond amazing😍my favorite were the fried calamari🥰omg they were delicious in every way and freshly fried. I ate 2 orders of it ended up taking my entree home🤣🤣They played great music as well, at certain Points the whole restaurant was having a karaoke singing along it was definitely a vibe😌Overall I highly recommend this place for a fun night out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqX3BlY0dnEAE",
            "text": "FIRST OF ALL, this spot is deff a hidden gem. Who would’ve thought this would be inside of a hotel. Everything 10/10. I usually only have at least one drink, but that passion fruit margarita was calling my name, I had to get two. It’s the aesthetics for meeeeee. Food was indeed amazing and not expensive at alllll. Please go here and tell them I sent ya. I will deff be back again to take photos on that little machine thing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eXZMWnN3RRAB",
            "text": "We had a good to for Mother's Day Weekend.  The food was ok drinks needed more alcohol for happy hour but the music was banging.  The rooftop was another highlight of the restaurant. I have to come back another day to see if there is a change.  This is a cozy, laid-back spot to chill at after-work.  I do recommend Rosa's At Park!!!!."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdmFlMmJREAE",
            "text": "It was a wonderful atmosphere the staff and ambiance was great. The food was excellent kudos to the chef  who understood the assignment. I went for brunch the DJ was bumping it was a little loud but everyone seem to be enjoying themselves. I was told the volume was brunch crowd related. I get it still 5 stars 🌟 across the board!!! Rosa you did the dam thing! I will recommend you to everyone! Thanks for settling in the BRONX!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHaC03Tkl3EAE",
            "text": "Went out with some fellow coworkers who wanted to try this spot (our first time here). The restaurant is located in a hotel. Nice decor and the place was relatively clean. Our waitress was very attentive and polite. The food was amazing also; especially the wings, yucca croquettes and the filet mignon  and spinach salad. Music was great too. You can park in the street (if you find parking) or use the hotel garage. Had to order the wings to take home since they were so good. Would definitely come again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMV9EdlJBEAE",
            "text": "I have nothing but good things to say about this place. Very attentive and personable. Definitely not shy with the alcohol in the drinks. Great food selection and servers are all nice. I stayed at Windham by Wyndham..Rosa's is located in their lobby (separate businesses) both are great. However, the reason I'll stay at this hotel again in the future is because of this spot. Great vibes and feel. 100 percent recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNONjVhVF9BRRAB",
            "text": "Loved discovering this hidden gem last weekend for a friend’s birthday and now it’s one of my favorite party brunches in NYC!\n\nI’m a big fan of a day party vibe and with a live DJ, a 90 minute bottomless experience for just $30 and delicious entree options — this was the ultimate day party!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdHMtenB3RRAB",
            "text": "Came for brunch! Good drinks and aesthetic were great! Mimosas was unlimited so I was definitely feeling it! I just moved to the bx like 6 months ago so this place was actually great for my first time trying a brunch spot out here. Will definitely come back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdE02al9RRRAB",
            "text": "Definitely a vibe and great food (dinner)! The DJ was on point and the drinks (happy hour) was not bottom shelf.. I would come back for brunch and roof experience. For a party of 6, the  bill spilt $52.."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1c0x6Q0V3EAE",
            "text": "This is a chill hotel lobby lounge/restaurant with a unique flavor. The staff work diligently to keep customers happy, fed and hydrated. The food is a unique blend of Hispanic and Caribbean flair that are extremely well done. The portions are just right but priced just a little higher (~+$2) more then one would expect but  there is no skimp on quality. If you're looking for a great after work vibe it doesn't take long for this place to get busy. I will be back to try out Brunch but this is a welcome addition to this section of the Bronx that has been missing out on the food and locale scene."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyajk3ODB3RRAB",
            "text": "The food is good and coconut mojito is amazing! me and my friends had fun!\nAttention to the owner please hire a staff at least 2 people coz Edi is a one woman show. She’s the bartender the waitress and she’s the one who takes out the food from the kitchen and serve it. It took a while for her to accommodate our orders. Sat there for almost 2 hours to get our order. It’s not fair for Edi to  do everything and compromising costumers demands. I was gonna give this place a 1 star or zero but I feel bad for Edi who works hard and she gave her best to attend to everyone’s need. The 5 star is for Edi she’s the MVP! give her a raise please!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNGFUdnp3RRAB",
            "text": "Food was amazing, music was jumping. The 30 dollar bottomless mimosas was amazing. The only thing I hated was that u only have 90min at the table. But 10 out of 10 will go again."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURteXY2QnpBRRAB",
            "text": "I wish I could give the ten stars This place is a vibe. The food is so amazing. I wish I could have sampled more of the meal because it is so delicious. There is a lot of diversity on the brunch menu. The additional $20 for 90 minutes of mimosa or sangria is a fantastic deal. They provide different flavors of Mimosas, white sangria, and red sangria. I was a little confused when I arrived at 1st. I didn’t know the restaurant was in the hotel, I was looking for a storefront. It didn't matter because you were greeted as soon as you walked in. Michelle, our waitress, was extremely pleasant and provided excellent service. I'm looking forward to returning."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaTlmVXhBRRAB",
            "text": "It was an excellent experience as we celebrated a Birthday and it ended up being a powerful moment. The food was spectacular from the wings, calamari, crab cakes, oxtails up to the red snapper, I was able to enjoy what was presented. The DJ…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNllucjhnRRAB",
            "text": "A absolute must, the food and drinks are amazing. I went for happy hour and stayed for dinner, had a great time. The music is on point. Have 7pm that have a DJ and that's when things really get going. They do have a rooftop that will be opening soon. Will be going back to get that out. If you're looking for good time in the South Bronx stop by Rosa's at park 😊🥂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cE5USENREAE",
            "text": "Came here for brunch with my friends and it is in such a hidden spot! But I just say, our server was good at what he did, he sold us in a few recommendations, and the vibes were just right. The food was also pretty great! They also did this thing where they took your picture and you were able to buy a printed version of it, but that I wasn't about. It was cute to see though.\n\nAll and all, if you're looking for a Brunch spot in the BX it's sleek, tasty, and fun here. I also appreciated the fact that it wasn't super loud in there, so we could still have a party vibe but still have a conversation without screaming.\n\nTip--the Mac and cheese balls are DELICIOUS OMG. The best ones I've ever had."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1Z09INVZREAE",
            "text": "Beautiful place nice and cozy. The upstairs was outdoors it’s very nice as well with colorful hanging umbrellas!! The  music was awesome had me on my feet!! The food was very flavorful. The mimosas were great! However the 11 of us were seated in a closed area that was dark with no decor Plates were served at different times the server definitely needed some help!  Manager was told about our service & gave us a complimentary bottle of mimosas.looking forward to returning hopefully they have more servers."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPc0tUcUZ3EAE",
            "text": "The food was delicious and the atmosphere was a lot of fun. My group had brunch in the main inside area where there was a live DJ and then we went upstairs to the outdoor rooftop for drinks. I would certainly come back here again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbXFyeV93RRAB",
            "text": "The restaurant is inside a hotel. There are multiple areas to dine in. A regular seating restaurant style area. A very nice bar area. I saw 2 private rooms for indoor private gatherings. As well as a huge rooftop. DJ was amazing. A cute grass wall with rocking bench spot for you to take your IG pics. They have a photo machine. The food was so tasty, freshly made and good amount per plate. Went with family and some of us got the unlimited mimosas for $20 per person.  I like the option of juices for my mimosas and I didn't have to stick to one, each glass was different (3). Staff was friendly and informative."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLXZyNzlRRRAB",
            "text": "Very cool spot. We made a reservation, and it went smoothly. The host sat us down as soon as she saw our name in the system. We were there for the unlimited brunch, and we had Sangria, both white and red. They were both really good. I had the bacon egg and cheese burger, and I give it a 10/10. Also tried the Thai wings, and they are good and flavorful. Great music and good drinks will come again. DJ was iamsomekid really good music"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbmFxSElREAE",
            "text": "The new menu items are very good I recommend the Los dumplings. Braised ox-tail dumplings are heavenly. The Thai chili wings also are very good. Fun place great for groups"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaXFEZGdRRRAB",
            "text": "I love Rosa’s for the most part. But for the second time I was served food that wasn’t cooked throughly. The first time the server fixed it with no issue but tonight when I asked for it to be fixed I was told I came at 9:12pm and the kitchen closes at 9:30pm so they did me a favor. Unreal. I can not eat steak that’s chewy waste of money after a long day of work. It’s all well seasoned and it’s nice inside but I’m so saddened about this tonight"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNk9fRGF3EAE",
            "text": "I need more stars!!!!! Eeeeeeverything was amazing! We came on a Sunday and because we came in the evening time we had a choice between the brunch and dinner menu which was nice. The drinks were perfectly made. I had the passion fruit…"
        }
    ],
    "reviews_count": 81
}