{
    "name": "Mottley Kitchen",
    "place_id": "ChIJqWuyfsP1wokRVGQNznSLGU8",
    "grid": "BX1",
    "address": "402 E 140th St, Bronx, NY 10454, USA",
    "rating": 4.7,
    "user_ratings_total": 663,
    "phone_number": "(929) 308-2099",
    "reviews": [
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbjVDc3JBRRAB",
            "text": "Loved this place. The food was delicious, service was kind and polite, and we enjoyed the roof seating area where it appears yoga classes are led. Barista type coffees, Matcha, Chai Lattes, teas etc. They had fresh herbs and berries growing on the roof which they must use for their dishes.\n\nThe only disappointment was the narrow 20 step staircase to the roof which will not be possible for many to use. It competed with the nose bleed bleachers of the Old Yankee Stadium. Scary.\n\nA little more than we wanted to spend. ($39 for 2), but a nice place if you need a change or have guests visiting. Disabled accessible on ground floor only. They accept credit and debit cards. Digital receipts available. The new Bronx."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSVlrSkdaVzFIY1RKRVJFWm5WR1JKY21WSWFFRRAB",
            "text": "The rooftop is a wonderful oasis in a concrete jungle. Flowers, comfy bench tables, and even some outlets for working really make this a nice spot for an afternoon coffee or brunch. I’ve visited 3-4 times now and highly recommend the chicken tagine served in a traditional clay pot, the shakshuka eggs, and the quiches. There was a significant delay once with my coffee but they remembered and acknowledged it on a subsequent visit. I wish we had more spots like this in the south Bronx."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGb2NFaHFTR0UyUzB0cGVsQmtZekJVZFMxNlFuYxAB",
            "text": "Good food good service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMFNrZEhWMnRQU2xaTVQxbG9lVFp3VEZCc05GRRAB",
            "text": "Found this location while randomly riding around the neighborhood. I was lucky. This is a little hidden treasure full of amazing surprises. The atmosphere is very laid back, the staff is attentive, polite, and willing to help make your experience with them a joy. The food came out quick and was worth every bite. I recommend a 10/10. Please check them out and I’m already looking forward to stopping by again. Thank you for a wonderful experience and great meal."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbWVFTkpSVzFNY2tJNGIyTkZZalpKYVhGM2JtYxAB",
            "text": "I ordered for pick up. went in and waited by the register, I waited for exactly 9 minutes. no one greeted me during that time or asked if I wanted to order, I was completely ignored. The drink was good but the vibe seemed unwelcoming. Is this cafe for the community with that kind of service?"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNFkxQk9RWEF5ZGsxRlUzaHJNVkJZT0dOeGNXYxAB",
            "text": "Truly the definition of a hidden gem. What an incredible find! Every dish was full of flavor and beautifully presented. Combine that with friendly service and a great vibe it’s easily one of my new favorite spots"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSloySnJUVkptUm1VNGVFNTFTWG8xVkZwclRWRRAB",
            "text": "Amazing coffee, super food, home made quality."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWV1NtcHJTamgxUzBSMFpWQmtaVXh3UldGTlNYYxAB",
            "text": "Overall this place is amazing!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SU2IxRnBVRWRGTWtGRFdWWlJOQzFJUzFSdk1uYxAB",
            "text": "Love this place! Always a pleasant experience."
        },
        {
            "date": "수정일: 3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMta09fUm5nRRAB",
            "text": "Deliciosa comida. Hambiente tranquilo. Excelente atención."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMFgwSnVSa3RmU0U1a1NWUTFlbDlQV1RRMk0xRRAB",
            "text": "I went to Mottley Kitchen this morning with my girl. There wasn’t a long line when we arrived, but it did get busy as we waited for our food and coffee. I ordered the Chicken Avocado Sandwich, a side of potato wedges, and a flat white. My girl got the French toast and a hazelnut iced latte.\nFirst of all, presentation was amazing — everything looked upscale and thoughtfully plated. The quality of the food was top-tier. You can see the freshness in the strawberries and blueberries. I’ve been working in produce for 9 years, and I know how hard it is to find good berry quality this time of year, so I could tell they took their time choosing the right ones.\nI expected the potato wedges to be your usual frozen kind, but they were clearly made fresh — garnished with arugula and sautéed onions. The only thing I initially thought was missing was salt… but honestly, that turned out to be the best decision on their part. I could season it to my liking instead of it being overly salty. Smart move.\nNow, the Chicken Avocado Sandwich? I won’t spoil it for you — that’s something you need to try yourself. Just know I’ll definitely be a regular here.\nThe coffee was amazing too, and the whole experience was warm, friendly, and worth every penny. Thank you, Mottley Kitchen, for your service and attention to detail!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVk5YVmhhVXRhUVRSWFMwZ3lMWGR4TW1wNFZsRRAB",
            "text": "Love this gem in the south Bronx! Food is so good and well prepared. The staff is incredibly friendly and patient. Atmosphere is spacious with shared seating and plenty of space to meet and spread out. Pastries are delicious and the coffee is top notch!"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNnJ1cmVREAE",
            "text": "This trendy spot is in the SOUTH BRONX, but when you step indide you are you are in SOHO, Tribeca or any other trendy NYC neighborhood!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MlpIZ3hlQzFETkUxWFJsaDNWMUJKY0RReFUzYxAB",
            "text": "THE BEST CAFE IN NYC so far. I have written so many reviews and have been to many places around the world, this is one of the moments i write a review and feel like i wanna give 10 stars !\nFood is delicious i mean MICHELIN STAR kind of delicious. Service is beyond wonderful and atmosphere is heavenly and homey. I'm in love❤️"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGeGJXcEpZVkphU21ZeVIwVmxWMmxZTldORU5VRRAB",
            "text": "OMG! It was my first time going yesterday and this place is amazing!! The customer service was great, food great, plenty of seating. They also have rooftop seating with a beautiful garden. Definitely will be my go to spots! Truly is a gem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNd09ISlFWRVJpT1dvMFdERmxYM1JhWlhWRWFWRRAB",
            "text": "The food is good. I love to get  the Iced Dirty Chai, Iced superfood Chai latte with a double shot of espresso and the pimento cheese sandwich with an add on of roast beef. As far as my drink, it tends to taste a bit different depending on who’s making it but overall I enjoy this cafe."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNGFubElNWGxZWkVKWVNsSk5Remd5ZGpCVGRHYxAB",
            "text": "Si el ambiente, la comida y las atenciones siguen igual como las encontré hoy siendo mi primera vez entonces este será mi lugar favorito para tomar café con la familia. El sábado iré temprano ❤️"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5V2RUaE5Wa3RNWTNKeU4wbFVRMnhMU1VveldYYxAB",
            "text": "Excellent excellent place. Does feel like something out of Brooklyn and I love it. Everything is great all around from the atmosphere to the food and decor. Sunday morning and it’s a bit busy. Can’t believe I waited this long to come. Will be returning very soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcmREZDRZVWc1YldVM2RrNXZYMk0xZUVSd1ZVRRAB",
            "text": "We’ve been long time customers of Mottley, we are there at least 1x a week. Recently we just have been having really poor experiences. Our past 4 orders have had something wrong, including actually getting the completely wrong order for delivery. Since the wait has also been getting longer, we’ve been doing pick up but their pick up system has to be revised, it just doesn’t work. You can stand there for 10 minutes without a single person noticing you. Today, our order is missing pieces of it. The food is good, the atmosphere is good, the people who work there are so nice but something just isn’t working."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUk1VMWtSM0ZHYzA1WWVETnFVa0pDTlZwclJGRRAB",
            "text": "Oh man!!!  A very relaxed, communal atmosphere with delicious food and friendly service.  The Bronx is lucky to have them here.  Definitely returning."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUlZqVlVTVkpTUnpoWk4yTkdXbXRpYTBwT2NuYxAB",
            "text": "A great place for a delicious brunch in the Bronx. Many people worked there, too, and it was a very diverse and interesting environment. I would definitely come back to this place again. The food is delicious and the service is good. However, there were two mix-ups regarding orders both times I went. Sometimes people forgot the order that came after. I suggest kitchen staff throw away the order only after the full order is placed, or deliver the full order instead of splitting it, to avoid confusion and the second order not being delivered. This is just a small detail given the sophistication of this excellent restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOM1REVmFWa1I1UTFsVE55MDVhWFV4TjNWUVJtYxAB",
            "text": "Honestly its such a chill oasis for a meal or some wfh 👩‍💻 energy, decent chai latte"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUWNuTTRaSEV0VXpKS1NqZDRSbFU0YVhVMlYzYxAB",
            "text": "Food is ok inconsistent by that fine make sure when you order the lox sandwich they include everything before you leave I’ve already ordered this 4 times and didn’t do that just asked if the made sure it was include and the associate blatantly lie telling me they check lol definitely expensive would order again but will not leave the store without checking and if not included they will have go back and fix before leaving"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210a2FtaEJUa1l3U3pKMlNEUm9TMGxJVUc0M2FYYxAB",
            "text": "Hidden gem, check it out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTFIwdFZkRzVXVGpoWWVuWXdORk56UVRKV2FIYxAB",
            "text": "We love having some more healthy options in the South Bronx area. This cafe is adorable, charming and serves up tasty breakfast, brunch and lunch options. The avocado toast is a staple favorite. We love the fresh smoked salmon that pairs well with the hot sauce kick. Always a delicious breakfast bite."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdlJHSkJZMFZWTFhoSGRVSlZiRkZ2WjIweGRsRRAB",
            "text": "The food was amazing! The service was fast I will definitely come back here again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTVpHaHdWRTE1UXpkTlJsbEhWV2x2TVRkRFVFRRAB",
            "text": "Loved it, my chai latte was amazing and very good customer service."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4d04wRnJNRWRCTTBKS2RITm5lVGd4WTBOd09YYxAB",
            "text": "Me encanta"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aFNWRjNVbk5NUzBWWmVsZ3lTMVpMZFZwNlgwRRAB",
            "text": "Its a nice spot. Food was great. Staff was friendly, they even surprised us by singing happy birthday to my son."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWS1dHSmxVR3R4WTFGdVNYUk9aMlJQZFZaWVZYYxAB",
            "text": "Food in-house was good\nUber eats was a different story made a simple order paid 29 dollars called back\nAbout the coffee order says milk sugar on the side  i did not get any at all in the order the person that i talked to said maybe you should buy some we delivered and it is what it is\nHung up the phone bad customer service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSE5IVkZiMDl0Vnpoa1EwSjVlbXhaVG1wQ1VsRRAB",
            "text": "This is the BEST coffee shop north of 96th Street. Best coffee, the most pastry choices, nice space, great people."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNmVVTkNPR3N3TVZwNlJuZFROa05JWTBGWk9XYxAB",
            "text": "I‘be loved this place since it opened. It’s the perfect addition to the neighborhood and lets people come and connect. The roof in the summer is magical. Good things come to those who wait, so don’t come here in a rush. The last two times I ordered from their website (square ordering), my order wasn’t started until I arrived - despite my ordering 15-20 minutes ahead of when i arrived. Not a biggie if you’re just getting pastries, but ended up being a 10+ minute wait each time because I ordered at least one coffee. The times I’ve eaten in, it’s been ok on speed but chatting with a friend/neighbor eats up the time (plus, it’s an expected wait since I didn’t pre-order to eat in). I recommend the horchata latte, the lavender honey latte, and anything from the bakery case!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQlZVOXFNRTB5TmxKU1dtcElNbVo0VmxwTGRFRRAB",
            "text": "Come in for the food, stay for the vibe.\nGreat healthy and vegan options.\nAnd….not so healthy to boot"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWlFtVk5kMDFpYTFvMmJYZEVVSEpqTFdOV1gwRRAB",
            "text": "Every bite was packed with flavor and cooked to perfection."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U2FuSktZemhuYW1aVlptWlZSbU5hUVZjMFptYxAB",
            "text": "I got the sausage and egg Sammie it was EXTREMELY good!!!!!! Highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbWJEZENlbGczYkdwUlpsOTVVMVpUYkhWTFJVRRAB",
            "text": "Absolutely loved this place! From the moment we walked in, the staff made us feel genuinely welcomed — friendly, attentive, and clearly passionate about what they do. The food was outstanding: fresh, flavorful, and beautifully presented. Their drinks were just as impressive, and the pastries? Absolutely amazing — flaky, rich, and made with real care. The atmosphere was cozy yet vibrant, with a warm, inviting vibe that made it easy to relax and enjoy every bite. Truly a hidden gem. Can’t wait to come back! 👏🙌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VFNFMHhRWGcxWVdkUE9VOXBXbTg1UXpGSVFXYxAB",
            "text": "We are new to the area, and we’re looking for a new breakfast spot. Read the reviews and decided to head to Mott Haven. Mottley Kitchen exceeded expectations, from the dining room, to the selection, and the staff was very welcoming. Had the sausage sandwich and the maple glazed cruller. Cannot wait to go back and try the rest of the menu."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCZlJsTmpiV2x6TlhoWFdsbHhVVWhzWlZoVmFHYxAB",
            "text": "Nos acabamos de mudar al area y estábamos buscando un lugar para desayunar y la verdad es que nos encantó, el café, el desayuno y la atención del personal. Definitivamente volveremos."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaWFYVkhlVjlTVGw5UlNsaHVZbHA1YTJ4Sk1IYxAB",
            "text": "I've been to many cafe's, mostly in Manhattan. This place can easily compete among the best of them. So far this is easily the one in the Bronx. Don't really care for pastries but tried their custard cream cuffin and blueberry muffin and was very good. Flavorful, not dried out, not overly sweet. Then tried their Spicy chicken sandwich and was extremely good! Tried their iced latte and was pretty happy about that. Taste was smooth, not bitter. Inside was really spacious, comfortable, clean. The staff were on point, service was very good (especially difficult to have today). I'll definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poS1UyWTVWQzFHZDFwWlRHeFljRVZyTkhSYVVVRRAB",
            "text": "This place is awesome! Very chill vibes, all the staff was extremely friendly, and most importantly the food was delicious! 10/10, if I'm ever in the area again I'm making a repeat visit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UFRVNU5aQzFHT0Vrd2F6SnRVMGQwYXpSaVVIYxAB",
            "text": "I went here twice and they took so long to give me my order. I asked and they forgot about it. I had to remind them twice about it so they can give me my order that my sister paid for. The drinks are faster to receive but the desserts take too long just for them to heat it up and give it to the customers. The place wasn’t even packed and they forget often about orders. One time they forgot my sisters order and she asked for them to give it to her but it was the wrong one they gave to her but we were just tired of asking and asking over again so we just ate and left."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toS2MxRndRWEE0Y1d4UFEyeHZaa0pqT1RkUlkwRRAB",
            "text": "Workers can be rude"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MU4wOXFVa1ZhV0dKbGRYWXpUVkZtVVZoeFYxRRAB",
            "text": "The best cafe ever! Been to hundreds of other coffee shops and none can compete with Mottley!\n\nThe atmosphere, the staff, the FOOD, the drinks… there’s no way to explain it but by coming in!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLSzVtNVNjcE1QdDNnRRAB",
            "text": "Love to go for breakfast every Monday"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNU0MzYlh5eHY3SmtBRRAB",
            "text": "Delicious food, great service, excellent ambiance. Loved the smoothie and the cruller."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNU182dlhMdk5pQzNnRRAB",
            "text": "Staff was super sweet and clean environment. First time customer and I was excited to try this place as it had many awesome reviews.\n\nI ordered the horchata coffee and avocado toast with a fried egg.\n\nCoffee was amazing, avocado toast was super good, however, my bread / toast was REALLY hard. So tough that I couldn’t even cut the bread with a knife and I had to bite the bread with caution. I didn’t want to complain 1. because I was sooooo hungryyyy and 2 because I was unsure if that was the norm. I ended up eating it as if but I was a bit disappointed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQWFB4Y3FJODVIZXJ3RRAB",
            "text": "I ordered 10 minutes prior to me getting to the cafe m and when I got to the cafe I still have to wait 25 minutes for my order. I was really disappointed with my visit. I ordered a drink and it was completely wrong — not even close to what I asked for. When I brought it up, the staff seemed annoyed and dismissive rather than apologetic. Service was painfully slow I didn’t get napkins and forks in my bag and I ordered a bread pudding. The overall vibe was unwelcoming. Definitely won’t be coming back."
        },
        {
            "date": "5달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNMjg5TGlsanI2NG93RRAB",
            "text": "Ottimo posto davvero per un brunch il locale è davvero carino e la qualità dei prodotti è elevata..."
        },
        {
            "date": "5달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKSzRtNTdFc29ta0VBEAE",
            "text": "Sehr tolles unscheinbares Cafe mit einer wunderschönen Dachterrasse"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURib3NlbnlRRRAB",
            "text": "Coffee here isn’t much to rave about but the food is good. Miss the old staff though new ones aren’t as hospitable"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmelk3UEt3EAE",
            "text": "This shop serves chocolatey, floral, bold North African/ Moroccan coffee and other goodies. The price point is perfect, and the breakfast is hearty and filling—a great way to start the day. I highly recommend getting the Murguez sausage along with the Casablanca omelet. The pistachio croissant and maple glaze cruncher hit the spot. If you want a space to chill and get away from the hustle and bustle, this is a great place to come. The space is big and open. The ladies behind the counter provided excellent service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcHRQU1h3EAE",
            "text": "Mottley Kitchen in the Bronx is a hidden gem! The vibe is amazing, with great music playing in the background. I had the butternut squash salad and a turkey sandwich, and both were incredibly flavorful and elevated. The artichoke on the sandwich was a delightful surprise! The pastry selection is mouthwatering – I couldn't resist trying a few!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvd2NMbDFBRRAB",
            "text": "Very nice chill vibe. Forgot I was in the bronx lol. Don't get me wrong I love the bronx so I'm happy this place is here. The pastries are ok, does taste like it's been sitting out for a while and looses it's moisture. But I'm ready to try their other foods. Even when the place is busy it's still quiet and I can always find a seat to work remote. Music is cool too! Did i mention in obsessed with their hot chocolate! Staff is also pleasant and wonderful.\n\nGet out the way starbucks, Mottley is in town🥰"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OGRlVFNBEAE",
            "text": "Loveeee motleys kitchen. The roof top is beautiful in the fall, spring and summer. If you have there horcahata latte add one pump of vanilla (size small) 😋 it's delicious. I recently had the apple french toast and they are not greedy with the portions. The price ranges from $4 - $ 12. If your getting a meal and a coffee then it's pricy. The atmosphere is lovely, on the main floor they have benches were you can work from or just chill. The only thing so far am not a fan of is there egg sandwiches  (has no flavor and the bread is too thick)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eXFyY3NnRRAB",
            "text": "This place is FABULOUS. I came here with My friend who is pregnant to enjoy a brunch with Her, and I got the Chicken Tajine, it was Phenomal… wow. Well priced, beautifully made and displayed, DELICIOUS. The chicken pieces were wonderful, no bone, white meat. They always make their potatoes lovely. The sauce. The olives with and without pits! Everything. I added Arugula, Shallots and Avocado for $3 extra. Worth it! Maybe they can add it apart of the meal. Maybe a small cup of mint tea for after! And maybe they can add Moroccan cookies on the menu if there isn’t! My friend got a sausage egg and cheese which after receiving She had to change some ingredients due to her pregnancy and they did so with no problem!! They were so helpful and attentive, no attitudes or sign of unhappiness. The menu is just incredible. The Guy who made it was in the store and I went to recommended the Tajine to Him without knowing as I saw He was about to order. God Bless Him 10 fold. I love this place and will visit more often. I got the Rose Lemonade. Incredible and delicious as well topped with real roses. This place is a Gem! No place in the area like it. I wish they stood open later!! THANK YOU! A good spot for any type of meeting or a good place to chill. I’m not sure if they’re having events at the moment but I’ve been to one before, mostly during Summer. Very comforting. A good place to spend money."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eHNublRREAE",
            "text": "Single handily the best açai bowl I’ve ever eaten in my life. Every flavor was pronounced and created culinary greatness😂. A large yet non overwhelming menu gives plenty of options to choose from. Great collaborative tables and open space for working, socializing and eating!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYOF82TUNBEAE",
            "text": "Don’t walk, RUN to Mottley Kitchen for  fabulous coffee, unique and tasty food options, and great pastries as well. My husband is a vegetarian and had plenty to choose from! The only thing better than the food was the outstanding service. The guys were super friendly and attentive. We’ll be back the next time we’re in NY!!! Thank you!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MmVuVkF3EAE",
            "text": "I love the staff, atmosphere, and coffee at Mottley Kitchen. As a Latina from the South Bronx, it’s refreshing to have a clean, open, and friendly café where I can study and work. I just wish the food prices were a bit more affordable or that they had a better rewards program for CUNY students! I love coming here, but I do have to budget my visits. That said, Ronnie is also the sweetest soul, and sometimes I come in just to see his smile!\nThank you Mottley!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfLUxEY1RREAE",
            "text": "Mottley Café is a fantastic third space with a warm atmosphere, excellent food, and outstanding service. It’s a great spot to relax, catch up with friends, or get some work done. I’m also excited to try their coffee beans at home in the meantime. I’ll definitely be back in the spring to enjoy their outdoor seating and soak up the ambiance. Highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcUphVzdnRRAB",
            "text": "My sister lives just down the street and works often on her laptop at Mottley, especially when the rooftop is open. She took us here while we were in town, and it was so good we had to visit twice! The Middle Eastern influence of this cafe shines through each dish and their hot and cold drinks. They even press their own juice! The bakery items are all perfect, unique, and delicious. You have to try something new every time. The staff were so kind with recommendations and explaining dishes. Much lower prices than what you'll pay for much less food in Manhattan. It's a must stop if in the Bronx!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aXN6N1R3EAE",
            "text": "We have decided to celebrate my sister's birthday  breakfast at this place today. The staff and the owner were very kind and the food was delicious. We definitely enjoyed the vibe , the atmosphere, and the setting area on the balcony, which we loved the most. The food was very fresh, simple, taste, and not too overwhelming with the seasoning. The presentation of the breakfast platter was beautiful and colorful. I am definitely looking forward to bring my parents here and they will love it as much as we did. Thank you for offering us a beautiful service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREN1lUS3FBRRAB",
            "text": "I absolutely love the cozy atmosphere and friendly staff at this coffee shop. The coffee is always delicious and the pastries are a great complement.\nI appreciate the effort put into creating such a vibrant and welcoming atmosphere in this area. It's a true gem for anyone looking to explore different venues and have a great time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJakxUSU9BEAE",
            "text": "My experience was really amazing\nThe best Chai latte ice ever had . I love the art on the wall and the Ambience of the place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMk5PaDVnRRAB",
            "text": "Excellent place for lazy (or quick) afternoon lunch!\nThe chicken sandwich, soup and latte we had could not have been better, and discovering the patio just made the experience so much better. The cafe really benefits from the tree-lined street it’s situated on, and the trees provide just the right amount of shade from the afternoon summer sun. For those with a discerning palate, find the mild notes of spices often used in North African and south Asian cuisines in the food they served.\nWill definitely be returning to try more from their menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1c0tIbWJnEAE",
            "text": "This is place is around the corner from the main street which in our opinion is perfect. As you walk into the block you travel back to the 60’s with all the brownstones.\n\nAs for the food and service we were greeted with a smile and a large variety of pastries. They serve brunch all day. We had the supreme omelette and avocado toast.\n\nThey have outdoor seating and a second floor space.\n\nThe decoration and ambience are very welcoming. The music volume is just right. You can talk to friends or even get some work done."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyM3NxM0JREAE",
            "text": "Wonderful cafe! Great barista and menu! They had so many amazing looking desserts. It’s spacious inside and out and def somewhere I can’t wait to get back to. The service was exemplary and the coffee is good. It said medium but was darker and nice. They have an amazing kitchen too. Def come check them out. They have a cinnamon croissant too that’s hard to find"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaZ2NTQklREAE",
            "text": "Ordered on Uber Eats,\nEverything was fresh tasting, unprocessed and yummy. The chicken avocado is amazing! I had it on a croissant and it was a dream! All the pastries were soft and fresh. The lemon olive oil cake was extremely moist, exceeded my expectation. Best eaten warm. Will definitely order again or visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbTdtVFBnEAE",
            "text": "I love the staff here, they’re really sweet. Amazing pastries, can’t wait to try more items off the menu. It is a nice treat to have locally roasted coffee in the neighborhood. I would come here all weekend :) there’s also free books 🫶\n\nP.s. I love all the decor, especially the paper plate display that’s on rn."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNjdTYmFnEAE",
            "text": "The food was very delicious! This was my first time and I enjoyed what I ordered. However, I wish there was a bread choice with the ranchero sandwich. It comes with a brioche bun, but I’d love to see more health-conscious choices. Like multigrain, flax, etc. The iced coffee is pretty on point as well. I like the fact they put a decent pour in there, like an ounce or two, rather than a small splash. Thank you!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3b3J6RXpnRRAB",
            "text": "Food was amazing! Sometimes I get weary about ordering French toast because a lot of places make them so tasteless. But it had flavor. There’s were delicious and the vanilla latte was great 😭"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRLXAyLUtREAE",
            "text": "great vibes, great food, wifi.\nThis is a nice spot to work if you work remotely or just relax if you want to drink a nice tea and lounge on the roof in the sun."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdzRfSDBRRRAB",
            "text": "Great place for lunch! Pleasant atmosphere. Ample seating. Delicious tea and coffee, and very fresh pastries. Bread pudding to kill for! Vegetarian options available. They use very fresh ingredients for soups, salads and sandwiches. Very…"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuM2ZYellBEAE",
            "text": "This place is so cute. You don’t even feel like you’re in the South Bronx for a bit. The workers are so nice and lovely. First time coming and I completely enjoyed it. I’ll come again 💕"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeHFTa2tRRRAB",
            "text": "This little gem is a blessing to our neighborhood! It’s a peaceful, delicious, and aesthetic getaway. There are vegan and gluten-free options as well. I got the avocado toast (with heart shaped drizzled sriracha) and beet root chai latte."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRa2RYcnp3RRAB",
            "text": "I'm glad I found this hidden gem! Everything here is perfect. The price is reasonable, service is friendly, and the atmosphere is relaxing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bHNXOTNnRRAB",
            "text": "Although the pastries were 4 for me (coffee was 5,) the additional 1 star is for their community-engaged space.\nThe cafe was welcoming with some t-shirts from local for sale.\n\nI had the vegan carrot cake and maple cruller. The texture of cake was good but overall kinda too sweet for me; the cruller was the same and was burnt a little bit so I tasted the bitterness.\n\nCoffee was great. Nothing to worry."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxbzRLb0h3EAE",
            "text": "My second time here. By far, the best cafe in the Bronx if you want to work or just have a relaxed time with you and your coffee. The staff is very kind and friendly. I always order the Mocha it’s so delicious!! The ambience is so beautiful and so so so calming! There’s always parking except Tuesday and Friday 11:30am-1pm"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzZ1AtWklnEAE",
            "text": "Service can take a little while (smoothie was a 20 minute wait), but tasted good when made. A nice vibe overall and a gem in the South Bronx area. They have a rooftop terrace which is super nice on a sunny day; along with chairs and tables there are even sun loungers if you wanted to laze around.\nHaven't eaten here, but there's some vegan options on the menu which is great to see."
        }
    ],
    "reviews_count": 78
}