{
    "name": "Beatstro",
    "place_id": "ChIJbwExnN31wokRZZ9XeXdpYXg",
    "grid": "BX1",
    "address": "135 Alexander Ave, Bronx, NY 10454, USA",
    "rating": 4.3,
    "user_ratings_total": 1349,
    "phone_number": "(718) 489-9397",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMGMxcHFibDl5WW5wWFZtZHZla1YwTWxVNFJFRRAB",
            "text": "The food and drinks are amazing, BUT for $50 to $100 it would be great to be able to have a conversation with friends without the music being so loud like a night club, it’s so unfortunate. The volume literally impacts your eardrums. The marketing strategy of having a “Sunday Party” being the excuse only makes it more disappointing since it’s intentional."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeU1HTlpBEAE",
            "text": "Best place for food and music in the Bronx. Excellent service. Great vibe."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxZ3YySEx3EAE",
            "text": "Bring back the old wings"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdmVrdHJORFF5YlY5V00zTmtaRmswY3psMk9FRRAB",
            "text": "My bestie and I went to eat at the Beatstro located at 135 Alexander Ave in the Bronx. It was an experience that I would recommend for anyone to go eat, listen to music, and drink.  The atmosphere was awesome. Puerto Rico and People of Color are well welcomed and pleasant. Customer services is one of the best I experience. It is a must place to go to and have a genuine good time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSFJGbHlhSFpFZVRSUmJFSk9aREJaZHpOQ1kwRRAB",
            "text": "Food was good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdU1rWkxNME42WDBONmVqZFBkRFkxVmt0UFgzYxAB",
            "text": "Went on father's day 👍 Great food and great atmosphere. Awesome service!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOR0hzTjdHbTlPNjBnRRAB",
            "text": "I went for my birthday for brunch today. I had such an amazing time!!!.. Food was great...got the bottomless Sangria and they just kept pouring and pouring!!!....music was great!!!...vibes were amazing!!... I will be back!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNRDlsWkx2emVUcGF3EAE",
            "text": "It was OK, I had the fried chicken. Definitely set up for some loud music and partying. Not why I was there though. Staff was attentive."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLZm45OTMxNjZ2THpBRRAB",
            "text": "With the boss here in my face. They still can’t get  the order together correctly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd2ZyWHJ3RRAB",
            "text": "We celebrated a birthday. They were very accommodating for our large party! The vibe was a vibe! The food was okay and unlimited Mimosa/Sangria, she kept them coming! Most of all it’s a great place to celebrate!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLTdtZGt3RRAB",
            "text": "Great place for group dining.  Friendly, good service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLWV5SnF3RRAB",
            "text": "Rating: ★★★☆☆ (3 stars)\n\nI had a mixed experience at this restaurant, primarily due to some food issues and less-than-stellar service.\n\nWe were seated promptly and had ample time to review the menu. However, the service quickly became overwhelming. The waitstaff frequently approached us, almost rushing us, and came over right as we finished our last bites to ask if we wanted the check. It felt like they were anticipating a large table and wanted us to clear out. Considering that a large group beside us was moved to the bar and staff were rapidly rearranging tables around us, I’m unsure why we were seated just 30 minutes before their arrival when there were plenty of other available tables.\n\nRegarding the food, we both ordered the NUEVAyol drink, which was decent but not worth the $17 price tag. The chicken and waffles were enjoyable, although the chicken itself was unseasoned; only the breading had flavor, and unfortunately, some parts of it were burnt. The steak and eggs, however, were disappointing. I ordered the steak medium-rare, but it arrived well done, with crispy edges and essentially folded in half from overcooking.\n\nAdditionally, I was disappointed to see an automatic 18% gratuity added to our bill for just two people. I understand this might be standard for larger parties, but it felt excessive in this case. I certainly wouldn’t have tipped $15 for the rushed service we received.\n\nOn a positive note, the atmosphere was delightful. A live DJ played Hip Hop tracks, and the decor featured nice art along with a faux speaker wall, which contributed to a vibrant vibe!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvem9DQWFBEAE",
            "text": "The food was great!!! The cheese steak and burger were amazing! I want to go again just for that alone. Drinks were delicious. DJ was great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbS1pWVNnEAE",
            "text": "I had the pleasure of being served by the beautiful and incredibly charming Rachel, who took the time to walk us through the entire experience and let us know what to expect. My brunch date and I went with the chicken and waffles, along with a side of mac and cheese—everything was phenomenal! The music, the drinks, the service, and the overall atmosphere were all on point. Rachel even shared the days they host special events that she thought I’d be into, which was super thoughtful. I’m definitely coming back for another round of bottomless mimosas and sangria. Great vibes all around!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcEpPZjh3RRAB",
            "text": "The food is not what it used to be, far from it. Whatever we ordered was pretty much uncooked, with minimal seasoning and just bad. So sad to see the quality of this once awesome place go down like this. Service and music were good, but after the last two experiences of bad food, we're not going back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMkp6Y2N3EAE",
            "text": "Yooooo a must brunch spot  food people an  service is phenomena a time was hadl"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN3Z5NEN3EAE",
            "text": "Loved the hip hop vibe and music. Great drinks and food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3al95NDVBRRAB",
            "text": "The food was amazing, and Rachel made the experience even better definitely recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdk42cnN3RRAB",
            "text": "Bree she was a great serve she very professional in her work.... Thank you 💕💕💕💕"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRLU5yRE13EAE",
            "text": "This place was amazing. Music litt, service amazing, and met so many wonderful ladies uplifting each other. 10 out of 10. Our waitress Rachel was amazing. She made sure we were feeling our drink and she was a vibe!!! Come here. Don’t cheat yourself!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRa0pyTXVRRRAB",
            "text": "Change of menu terrible. Drinks weren’t worth 80 dollars for 4 drinks. Waitress not attentive to customers. Food was like a fast food place. Never will go again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbHF1UzFnRRAB",
            "text": "Food was great, service not soo much. I watched who I assume was the manager kick two tables out and then came to mine and told me my time was up. First of all I waited over 30 mins to be seated, I was never told there was a seating limit, yes a drink time limit. So when the 90 mins was over she told me she accommodated my group but our time was up and we had to leave. We weren’t even done with our drinks. I will never return. And I’d strongly advise others to avoid the embarrassment."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBZ08tMkZREAE",
            "text": "Good vibes, drinks and music but the food isn't that good"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBN016YlhREAE",
            "text": "Amazing service!! Great food! Great atmosphere!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfX042dFlREAE",
            "text": "The atmosphere was inviting, and the food was absolutely fantastic."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmajRYMlZREAE",
            "text": "Food is amazing.  Music is always good.  Must have the sangria"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNmUyajdRRRAB",
            "text": "Just a little overpriced"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaWZpaVJ3EAE",
            "text": "Fall back to the beginning of hip-hop with murals of b boys and break dancers . Fun open dj booth style kitchen so you can observe your food being prepared. friendly staff.everyine just wants to chill and have a great time.  Why you are  there have  a nut cracker or a blackout ...Great Vibes"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmM0lITW5BRRAB",
            "text": "Beatsro, I can't say enough about this restaurant lounge.  The atmosphere, the music, everything was amazing. I praised this spot for days to everyone I spoke to. My sisters and I had a surprise birthday brunch celebration for our other sister on  Sunday, 12/29/2024. The staff was very helpful and accommodating.  The food was delicious, I love you can watch the chefs preparing your food. The drinks were good and strong.\nIt's family friendly my 17 years old and 2 years old nieces attended. They had a great time. The menu had something for everyone and I'm a pescatarian. I recommend you go with your family, friends or date night. You shouldn't be disappointed."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcnZlb2RREAE",
            "text": "this horroble the food was just soooo nasty and my food took 2hours to come im never coming back and dont go here"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2czYtbVRBEAE",
            "text": "So my cousins and I came here to have a holiday cousins brunch. The vibe was great, music was great! The drinks were ok. I had 2 issues.\n\nFirst the food was NOT good at all. The kale caesar was very disappointing, the kale had not been massaged properly at all and the salad just lacked favor. The deviled eggs tasted like straight yellow mustard. The Mac and cheese was just ok. I got chicken and waffles and the chicken had 0 seasonings. My cousin got the steak and eggs and ordered the steak well done, it was burnt to a crisp.\n\nThen when our bill came we paid a deposit of $150 for 12 people but we ended up coming with 9 people and they didn’t apply our deposit to the bill. The manager claimed they could have used the 3 extra seats so that’s why the deposit wasn’t applied. This made no sense to me and I have dined at some pretty high end restaurants and this has never happened.\n\nIt was a fun time being out with family but I would never come here again due to the bad food and lack of customer service pertaining to the bill. (Our waitress was great otherwise)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2czRuUUx3EAE",
            "text": "If you’re a large party and have to pay the deposit, I would skip this place. Our reservation changed by 2 people and they kept our deposit which is annoying but I guess that’s why you sign up for when you put down a deposit. Food came out cold or burnt, which we sent back and they replaced no problem. The music is too loud to hear the person next you. Over all, I don’t think the quality of the food was worth the price point. Our server was nice though and accommodating but the bathroom area smelled terrible and unclean which is not acceptable for a restaurant."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpMmVUd3JRRRAB",
            "text": "MY daughter order a take out order for me of the Boogie Down Burger. The bun on the burger were burnt beyond recognition and the burger was hard to chew their was no cheddar cheese or beastro sauce the only thing you did get right was I asked for no pickles. This was my first and last time eating at your establishment you did not make a great first impression  on me I would not recommend this place to anyone sorry I am strong believer in first impressions"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdnFpYWVREAE",
            "text": "Food is unbelievably delicious! The Mac n cheese is arguably the best I've ever had. No draft or bottle beer and no common/typical beers. I've been here a few times at night and it's been a little loud with the music but it's good music to me so that helps. During the warm months they have some outdoor seating which is also nice. Cool spot to check out if you're in this part of the Bronx!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcHBMSnNRRRAB",
            "text": "The atmosphere is great. However, the food needs to be work. Ordered steak and eggs and despite the steak being. Like 3oz max, it was extremely salty and came out sliced up. You could also tell the steak was not good quality beef. The eggs came out overcooked and everything is garnished with green onion slices."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbEs2M1p3EAE",
            "text": "Great food and friendly service in an authenticity hip environment. Check it out."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbV9hSHd3RRAB",
            "text": "Have to Make Reservations Early, It Opens at 11:30 A.M. Someone  Small Great to bring Friends and Family Members"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzazlHVWhnRRAB",
            "text": "Food, drinks and music was all great! Definitely be back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcmYyLW1nRRAB",
            "text": "The atmosphere is super cool and food even better. Services is a bit slow but I didn't mind it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMGZPU1ZREAE",
            "text": "My wife had a cheeseburger and fries. I had chicken fingers and fries. Chicken fingers wasn't the best had better. The cheeseburger was out of this world. I love it, and drinks are really good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNnVpXzlnRRAB",
            "text": "If you are a hip hop head you need to visit this place asap."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYekxqdkN3EAE",
            "text": "This is the place I've had my eyes on for quite some time and today, I am pleased to annouce that I've finally arrived.\n\nI will begin with saying that I was plesantly greeted by a nice young lady who sat me at a table.  Upon walking in, the music was 💯💯.  Comfortable volume and I knew all the true, old-skool rap that was played.  Loved the decor and the restaurant was clean and neat. When I walked in and left,  it was a total of 4 more people there.  I had no problem at all with that!  Maybe because it was Thursday.🤷🏽‍♀️  The bathroom was large and tidy & it had soap.  I love to see washrooms, water closets, loos, bathrooms with SOAP!  I forgot the name of the a different young lady that took my order but she was sweet.   Service and atmosphere was ⭐⭐⭐⭐⭐\n\nNow for 2 stars: I had the Coconut Shrimp and the Oxtail Croquettes-pics below. Much to my chagrin, both appetizers lacked flavour; just blah or bland. I HATE wasting food, so I ate the shrimp which came with the dipping sauce, but I couldn't finish the Oxtail Croquettes.  I hadn't eaten most of the day just so that I can have room for Beatstro's.  I had ordered the Fried Red Snapper with fried rice, but by the time the fish arrived, I couldn't eat it and packed it up to take home.  I had a forkful of the fish and the fried rice, which seemed promising.  I'll see what is tastes like tomorrow.  The drinks were bland too. 🤦🏽‍♀️ I wish I would've had a better experience, but atleast I had the experience either way."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubllUcDlnRRAB",
            "text": "Okay… so lets start with the good.. the atmosphere is great! Very cute! The music was a vibe and its a great aesthetic.\n\nNot so great… the service was kinda meh. There was 3 of us and we ordered the bottomless mimosas and sangria.. but idk if it was because one of us spoke at the time of ordering but the server assumed that it was just one glass of each.. so he brought one glass of sangria and one glass of mimosa? Idk. But the drinks were alright too. I’ve had better.\n\nNow to the just not good.. the food. Looking at the picture, it looks alright.. but the steak was definitely well done when i ordered medium. The other steaks were supposed to be medium rare and they were definitely medium well. The sunny side up eggs were fried to a crisp around the edges but the egg whites were still clear. Didn’t even touch them. The potatoes were decent! Also got the mac and cheese and it had zero flavor..\n\nI don’t know what was up and how this place has a 4.3 right now but yeah no.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudlBmSzVRRRAB",
            "text": "First off walking into this place was dope and had great vibes. Ordered my food and while waiting I decided to order a drink which was extremely great. I patiently waited about 25 minutes before the food came out. Got my order walked out and drove home. As I got home opened my tray I noticed right away the undercooked pernil (roast pork) with Slimy rice I was in shock. No way I was going to drive another half hour in traffic to get something else. Pernil looked as it was boiled in water and not roasted. The rice was undercooked as well as the semi solid chopped carrots and beans. Definitely not what I expected from this gorgeous place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURILWVfNDVnRRAB",
            "text": "Celebrated my son-in love 40th birthday on Sunday! What an awesome time we had! The food was delicious! The ambience was off the chain! The service was excellent! Can’t wait for my next big celebration! It will definitely be at Beastros! My guests was equally impressed! Beautiful!👍🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMGJ6bDBnRRAB",
            "text": "I just happened to be in the area and wanted some chicken and waffles. Let me tell you, this place is my top 3 favorite chicken and waffles! It took so much self control to not order 3 more. And the staff are super cool and welcoming. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MV96VFRBEAE",
            "text": "I've heard so much about this restaurant. I dined here on a weekday after 8pm. It wasn't crowded. The ambiance was chill, other than the boisterous lady at the bar who appeared to be in intoxicated.\n\nUpon entering the waitress gave us the option of a bar seat or table. We selected a table, but it was too cold where the tables are (in the back of the restaurant). So we elected to sit at the bar. The decor very impressive!! Service was great. The bartender was very attentive. She also was great when ordering, she was able to give us a few good selections on the menu. The food wasn't as impressive as the decor. The food was OK. I would definitely dine here again to try other selections on the menu. Give them a try!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcE5IeU5BEAE",
            "text": "This is a great place for music! The DJ is awesome! The reason I gave it 4 stars is because, you cannot have a conversation or hear your waitstaff. The food is good. Personally I like my collard greens simmered and tender. These were undercooked. Catfish was good. Wings were crispy and delicious. Rib’s were good. Sangria was great! Overall it is an experience if it’s your first time. We had the preset menu for our group of 8.\nI’m sure this place would be great later in the evening! The DJ knows how to mix it up!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGcXJ2YktnEAE",
            "text": "It was ok. The food was good, the service not so much. Our waitress rarely came to see us after taking our order. Automatic 18% gratuity. Also, the music is so loud. Makes you feel like you're at a club instead of a restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dThtZEVnEAE",
            "text": "First time here and it was awesome. The food was great the waitress was nice and on point with giving us a refill of our water when it was low. The  method man drink was nice and smooth the pernil rice and beans were very tasty the Mac and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXOGZDOC13RRAB",
            "text": "I had this spot on my radar for a while and couldn't wait to try it. I made reservations for 1:30 and when we arrived they sat us after about 10 minutes or so. The music was blazing and it was good. Devin was our server and he was good and he was attentive. We started with the bottomless mimosas and sangria and they were good. For my entrée I got the chicken and waffles and my friend got the steak and eggs and mac and cheese. When the food came out it looked great. I dug in and the chicken was very good but the waffles were cold so I didn't eat that. They comped it because of that which was very nice. The bill includes tip fyi. I really enjoyed my time here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSanZmNm9RRRAB",
            "text": "I absolutely love this place!!!!! Our server Kai was amazing & the rest of the staff. The food is always fantastic and great vibes. Love the artwork the music is so loud but I have been here before and understand that is the vibe and still come!!! I'm an old lady so I prep before for the loud music. Not for children this place is beautiful the decor is top notch drinks are amazing... Method Man and Virgo are my favs."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoenNULV9RRRAB",
            "text": "Very nice place. Food was good music was great. Good vibes the whole time. The lady sitting in front when you first walk in was amazing to us. We came in late with no reservations and she sat us down right away. We had brunch and our glasses were never empty. Had a great time there. Brunch lasted until almost 9 o'clock that night🤣👍🥂🎉🍹"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcEtYNzV3RRAB",
            "text": "Went here for my bday brunch. It was pretty tasty! The vibes were great, and we loved the decor and artwork. There was only 1 girl working as host and server, though. It was not her fault. She was great. Hope she gets some brunchtime help more often!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweHJYSEp3EAE",
            "text": "Enjoyed the block/ street party to Celebrate 50 years of hip hop, which finished promptly at 8pm. My party of 4 decided to have dinner and we were amazed by the taste of our meals. We ordered 2 Vera Fried chicken,  2 lobster mac n cheese, and a catfish dinner. Drinks were strong. Overall, we enjoyed the vibe and experience. The only thing I would say is that if you're automatically adding 18% gratuity, then your staff needs to go above and beyond to provide top-class service and attention. In my opinion,  service could have been much better for a $35.00 automatic tip. In summary,  I recommend trying Beatstro."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNDdELTdRRRAB",
            "text": "We celebrated my Sun's 21st 🎂 🥳 🎉 🎈birthday.   It was his first time, him and his girlfriend Gigi and also my husband's first time too.  We had a good time. The food was good, and the atmosphere was good drinks a little weak. He was happy so I was happy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUaDc3Qi13RRAB",
            "text": "The music keeps you bopping but is really loud, so be prepared. The food was good. Chicken was crispy but a little past golden brown. The wait for the food was long. The service is top notch."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJLTdxY0V3EAE",
            "text": "Dropped by on a Saturday night with no reservations.( I suggest you make reservations if you are a part of 4+). We were seated after a small wait. Great atmosphere and design of the restaurant. Music is great. Food is good nice presentation…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvX3UzYWRBEAE",
            "text": "Great place for Sunday Brunch. It is noy s huge place. You may have to wait for a table, or you can sit at the bar and eat.The DJ on set was on fire. He blended his songs well. Great job! As for the food, you can pay $19.99 for Unlimited Sangria, or Mimosas for an hour 1.5 hours or pay $12 per glass. If you want to get turned up, come here. If you want someplace quiet, go elsewhere. The music is loud, and more for a party crowd, not a romantic date. The Shrimp & Grits was amazing. The Chicken & Waffles are also a very good choice. I wonder what the dinner menu is like. Very nice spot!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMGM2TTBRRRAB",
            "text": "I absolutely love this place! I love the vibe, the music, the service, and most importantly the food. We went for brunch last time and it was just as expected. Their fried chicken has to be some of the best I’ve had at restaurants, the French toast is to die for, and the churrasco was cooked perfectly.  I highly recommend Beatstro"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdk1tY1VREAE",
            "text": "🍽 French toast -\n🍽 Mac n cheese\n🍽 deviled eggs\n\nThe decor was cool and the dj played old school. I would’ve loved to see more brunch options though. But the food ordered was good and this is a great addition to the area"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNXZhWjBBRRAB",
            "text": "My daughter and I stopped in to grab some chicken, it wasn’t a disappointment. We loved it so much we tried the shrimp and grits. Which was amazing as well. Wonderful service great food! Highly recommend! I’ll be back soon!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3dk1laFh3EAE",
            "text": "This Restaurant has not been open long but the place was impressive for my first visit, especially if your one who appreciates the Hip-Hop and Bronx culture. I visited on a week day as a party of two, late afternoon. Wasn't busy. Upon entering, you are greeted by the hostess like usual in what seems to resemble a retro vinyl music shop then the hostess walks you through curtains towards the dining area. The place is not that big or is it too small, has a bar and lounge area upon entry, an open kitchen for customers to see or take notice, and the main dining area in the back. The Restaurant feels spacious, comfortable, and the ambience is enjoyable. The Restaurant's decor is nice and classy, but with a touch of Bronx and Hip-Hop culture spread out on walls like pictures of old school Hip-Hop artists and other iconic figures, grafatti, and Hip-Hop music playing through out the place but playing at a decent volume where you can still hear yourself converse with others. The service is great, our waitress was wonderful, very informative, and pleasant. The food and Drinks.... well.. Their food meñu is small, their prices are fair, they have Happy Hour, but the food was OK....just ok. I'm willing to make another visit and try other dishes in hopes I can change this review into a five star but overall...I'd recommend this Restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdjhQZUhREAE",
            "text": "Such a fun time!!!\n\nVibe is amazing and the food is just as great. Prices aren’t bad either. Try the sangria. We ordered a pitcher for the table and we all enjoyed.\n\nBeware if you sit in the back area it gets LOUD, but if the drinks are flowing and you’re ready to have a good time, it’s so much fun!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMHJ2eFpREAE",
            "text": "So I took my SO to Brunch for her birthday here. At first, I was put off. They want you to scan the code for the menu. I have an android and really refuse to download an app just to do this. So I asked for a menu. Keep in mind it took a minute for anyone to understand that we were waiting FOR a menu, for me to even ask. I'm Gen X, so we can be anti tech sometimes. Scanning for menus is a no no for me. But the staff couldn't locate the \"paper\" menus, so I downloaded an app to scan. They forgot to mention there was shotty coverage in the spot, but have wifi available. (Ugh) So I'm waiting a dinosaur's lifetime to download the menu, without wifi access. At this point I'm Han-gry. But then my wonderful server offered endless mimosas, and I relaxed and found my happy place. They found outdated, beta menus, and we ordered. The Food Was Amazing.......My SO had the steak and eggs. I had the Cajun-but-non-Cajun dish called Locrio. I also ordered the Josafina appetizer. It was tart, sweet, and had a little spicy kick. Very good. Different. Over all, very good food. Pictures, graffiti art, vinyl records and music, paying homage to the hip hop/rap artists from the Bronx and beyond. It's a casual ambiance, with contemporary yet classical flare. The cook station is enclosed with glass, and centrally located, so you can watch then work. I really enjoyed this place. Our server, (whom had an air of more-than-just-a-server vibe) (please forgive me, I meant to note his name, and didn't) was forgiving of my initial attitude and was quite attentive. This is a hidden gem in the south Bronx. You MUST visit!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNNV9xaVlBEAE",
            "text": "The decoration from the beginning noon until the final book is gorgeous.  I love the lighting, decor, and concept.  The music makes such an easy going vibe.  This is a great hang out spot and probably brunch spot.  It’s also kid friendly."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZMUxLWU1BEAE",
            "text": "Super cool spot in the South Bronx, a true hidden gem. The decor was on point, which celebrated hip hop in a very hip and classy way. Went on a Tuesday night and was surprised at how the place had a decent sized crowd for a late Tuesday.\n\nThe staff was attentive and friendly. The food was delicious and flavorful. The drinks were good and strong. The only negative would be the expensive price tag for both food and drinks. Either way though, it was still worth it in my eyes."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJaFlPT1RREAE",
            "text": "This was my third visit here. Ambience is romantic, chic and of course an homage to Old Hip Hop. The menu can be better. The Red Tap/top drink is good. I had churrasco steak....five small pieces w/ 3 yucca fries,🤔🤔🤔. The place can…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDakx6OWVREAE",
            "text": "Ahhhhhh one of thee only actual hip hop restaurants in town and local.i have been waiting to go and the experience was worth the wait. They also have happy hour and of course they have margaritas. All the way down to the chicken soup was worth it. They were able to accommodate especially during covid."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNZ3VmZXVBRRAB",
            "text": "From the minute you walk into the door this restaurant is an experience that I personally loved. The servers were so welcoming and on top of everything. The food was delicious no one was able to actually finish their food, because we were…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dHVDZDRnRRAB",
            "text": "Only reason  giving a 4 is because I had to dine outside so not sure how the atmosphere is inside. Website doesn't state need a reservation to dine in\nBomb sangria is a must try especially if u like red wine\nMango Margarita was good it was served on the rocks\nChicken sandwich was tasty Chicken was moist bun was soft with the bacon great combo\nFried catfish was seasoned just right, it's served with lettuce on top so if u like it crispy remove the fresh lettuce asap .\nFries was homemade style hot and fresh with the course salt .\nNow the Rotisserie Chicken with the sauce that comes on the side a MUST TRY  with the lemon mashed potatoes and the Mac and cheese. Yes lemon mashed potatoes and man are the good with the creamy Mac and cheese you can't go wrong.\nIf you have the opportunity, YES stop and dine 😀"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJdDk3VzdRRRAB",
            "text": "Hip Hop is Alive and Well at Beatstro in the Bronx!! Located near the 3rd Avenue Bridge in Mott Haven, You arrive at what appears to be an unassuming record shop. Once your seats are ready, staff whisk you away behind a black velvet curtain to a haven of Hip Hop beats and contemporary Latin Eats! Walking into the Lounge/ Restaurant the vibe is laid back and chill. There is a live DJ spinning Hip Hop classics and the smell of the Caribbean cuisine is emanating from the exposed kitchen. The walls are filled with images of Hip Hop Legends and cool graf art work. The food was great! I had the Jerk Pork Ribs with Ghost Pepper Plantains for  starters. The drink list was on point and all Hip Hop themed. The only thing I didn't get to see was the dessert list! Beatstro is a great place to hang with friends for dinner. Just make sure to reserve your seats on their website because it stays busy. I had a great time for a Friday night and you will too!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxXzVHUmFBEAE",
            "text": "I thoroughly enjoyed my experience here. My apologies for not remembering the name of my server. She was great. She was way cool and gave us plenty of time to get our order together properly.\nMy food, was bomb 💣! I ordered the \"Crispy Chicken Sandwich. \" it come loaded with pickles, cheddar and bacon. I hope the pics do justice. To drink I had Gin and Juice. A very tasty mint and mango  drink. Not too strong but not a waste of the $17 I paid for it. My wife is not much of a drinker and she finished hers and enjoyed it. Oh, and she had the Salmon with Lemon Mashed Potatoes. (not pictured)\nThe environment was cool. Kinda clubby, if you will. Dim lights cool music and pictures of some of the greatest rappers of all time hanging on the walls. They even had the G.U.R.U. which was a nice touch.\nOverall,  I had a dope time . The prices are decent. One of the few places I have ever been where my drink  cost more than my food.  Lol. Regardless,  if you find yourself in the BX, give this place a try.  The vibe is peace, the food is delicious and the customer service is very good. 5 stars."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrdVpHVHZnRRAB",
            "text": "Lovely bar in the heart of southern Bronx. The food was really nice. I ate the shrimp fried rice and beans, sunny eggs and kimchi slaw accompanied with Beatstro sauce. The customer service was awesome and the lady that attended to me was…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaDhtNWRnEAE",
            "text": "Had an amazing time on Saturday night. Two different live DJ’s with a great variety of music! Finally a hip hop cafe in the Bronx! Very nice atmosphere… service was great, also nice to see the manager walking around making sure everything was okay. The food was amazing. Never had lobster Mac this good… I am an event planner for a very very well known retailer through out the world and I eat at many restaurant's and travel all over  and this is one of the best lobster mac and cheese I have ever had. The wings were also cooked so perfectly and the seasoning was a thai flavored sauce. Absolutely amazing . Also, one of the only places that can make a top shelf Long Island ice tea. You’d think wow how can someone get that wrong… 🥴🥴 you’d be surprised how many bad ones I’ve had. It was a little pricey (the drink) but completely worth every penny."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNnFTMkJBEAE",
            "text": "My family and and I came here for my daughter’s 18th birthday for the first time. The music wa so very  loud so I had to yell out our order to the waitress; who was sweet but seemed like she couldn’t handle more than one table at a time. When our  cake was brought out they just placed the cake on the table and walked away. No singing or nothing. I found that quite odd but okay. The d.j gave a shout out so that was cool. I wish this place had better hospitality from the front door all the way in. Besides that the food was soooo delicious!!! I will be eating here again for sure. The pernil was to die for and so was the Mac n cheese. The rice n beans with egg was sooo delicious too!! I had not one complaint on the food. I’m a foody and this spot is definitely it!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRd0lpOUp3EAE",
            "text": "As an avid fan of Hip Hop I loved this! Fun night out with great tunes playing, equisite food, and savoring drinks. Everything was delicious. I was loving the decor, plus the vibes and will definitely return soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqN29DX3dnRRAB",
            "text": "Went to celebrate my sisters birthday, service starting from the host to our server was amazing, very inviting and attentive. Food was delicious and so were the margaritas(especially the mango flavored one). I had the yuca fries 👌🏽 the lobster Mac and cheese 👌🏽 and the pernil with rice 👌🏽 a little pricey and gratuity is included in the bill,just fyi. Over all great experience, definitely going again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJN1B2MzJnRRAB",
            "text": "Great food!  Dope ambience.  And remember, if you there for brunch. You're not going to be able to have polite conversation. The music is part of the experience.  You will be treated to club level beats!  No baby changing table\n:(\nBut all good.  If you're a pro, you can change the baby quickly in the booth off to the side."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNFltTHFBRRAB",
            "text": "Finally was able to patron this establishment. The food was alright, the art was nice to look at. The vibes are probably popping on the weekend but we showed up on a quiet week night. The kitchen is in the middle of the restaurant which was an interesting choice to me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMamFXbHZnRRAB",
            "text": "The atmosphere and the staff were really nice. Our server was extremely sweet. I will definitely go back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXanUtZnpRRRAB",
            "text": "Food is delicious. Atmosphere is cool. The music was on point. The Live DJ played a mixture of the hottest old and new. It definitely is a great spot to visit. The next great Hotspot in the Boogie Down Bronx."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdXFDS0lnEAE",
            "text": "Came with friends on a Saturday for dinner. The service was not desirable. The waitress was not present at all. When we would order an item only one person would get to order and she walked away. This happened multiple times.\n\nThe sangria was just fine ok. The food was just ok. The best dish was the shrimp and grits.\n\nWhat was great was the DJ, the music and the hostess. Additionally once dinner was done we moved to the bar. The bartender and other patrons made our visit so much better. The bouncer provided excellent service and was friendly go figure.\n\nNeedless to say I have been wanting to try this restaurant for a while as I heard so many good things. Maybe I need to come for the brunch and my experience will be better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNm9tUWFREAE",
            "text": "The speakeasy really sorprise me, will never expect a bar on that music store. Nice atmosphere and drinks. We tried gin and juice and anotherone. Both where amazing, have to come back for more, it wasn't pack on a Saturday night around 12, but it looks 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROd2JlWTVnRRAB",
            "text": "It's such a low key happy hour spot and so much more. The food is delicious and well seasoned. The drinks especially the Margaritas were made just right! I love the coconut shrimp! Try them! The hostess with the mostess positive vibes was Kai! same initial as Kay! My sister and I enjoyed her smile and professionalism. Great place. Can't wait to return when it's warmer outside. IT ends up being the only restaurant open on that block after a while. The DJ is fiya so I see why. Nice crowd of people just having a good time to food and music."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHMmNucENnEAE",
            "text": "The vibes, the waitress, everything about this place was great! Its aesthetic represents the Bronx in so many ways and the food was amazing. My friend and I had the mofonguitos as an appetizer and, while it had a bit of a kick, it was a perfect blend of seasoning and flavor. We then proceeded to having mac and cheese. I had the chicken and bacon mac and my friend had the lobster mac. Both were creamy and delicious! For those who don't like fishy pasta, the lobster mac wasn't fishy and it was actually creamier than the chicken and bacon mac. We had the chocolate mousse for dessert and it was a light dessert. If you don't like too much chocolate then I recommend eating it with someone who does. The center of the mousse has fudge which got overwhelming for me (I like lighter chocolates) but my friend LOVED it. The mousse was a dark chocolate mousse so it wasn't an overbearing sweet taste. Regardless, it was really good! Don't get me started on our waitress - Jasmine was a GEM. If you have an option, request her. She is honest, has a sweet personality, and tends to you well. She made our experience even better. I'll definitely be coming back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXX2MtVE1nEAE",
            "text": "This is the joint! The food was delicious and served swiftly. The staff was nice. The drinks (we had sangria) were really tasty. I had the shrimp and grits. My friend had the steak and eggs. The vibe is nice. When we went it was a nice crowd. Be sure to make reservations. You only have 90 minutes at a table and the place isn't huge. But I will definitely visit again."
        }
    ],
    "reviews_count": 87
}