{
    "name": "Halal Sauced Up",
    "place_id": "ChIJKV9iZi71wokRNc5wgal2Mvo",
    "grid": "BX1",
    "address": "337 E 138th St, Bronx, NY 10454, USA",
    "rating": 4.5,
    "user_ratings_total": 58,
    "phone_number": "(347) 269-5968",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psb1NsQnVPVE54VDFselZqZGlWSFJOYWtWeFpYYxAB",
            "text": "This place never misses! The service is always friendly and fast, making every visit a great experience. The food? Absolutely top-tier. The fish is consistently crispy and fresh — you can taste the quality in every bite.\n\nWhat really sets them apart is the variety, especially the sauces for the chicken. No one does it like them. My personal favorite is the sweet and tangy — it's the perfect balance of flavor that keeps me coming back.\n\nWhether you're in the mood for a gyro, shrimp, crispy fish, a wrap, a salad, or just a milkshake or frosty to top things off, they’ve got you covered. Everything I’ve tried has been excellent, and I’ve tried a lot — I eat here once a week!\n\nHighly recommended for anyone who loves flavorful food, great service, and plenty of options. -Erica P"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNGQxbzRSQzAyV21VdFlqbHJVV1pRUWtoSlZsRRAB",
            "text": "Manager was amazing. Good customer service and great food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVmNYTjVhakJGZG1WaVJISndZVFE1ZDJOU1NFRRAB",
            "text": "This is too expensive store.i order just one single chicken sandwich(no drink,no fries)that’s price is $11+😲🤭…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORGNHeFlhVkZZVTJWT2JGQkhVRGxEYkdOclgxRRAB",
            "text": "Very perfect and delicious food and fast service respectful and mannerfull employes friendly employees i recommend everyone one to come here and get some special"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdFgwdHphbGR2WDFKNFdWcExRelJKWWtScFkxRRAB",
            "text": "I just ordered the 6 pc. Traditional Wing Combo and it was fire!!!! The sauced wings and seasoned fries were and always are really really good here!!!\nGreat neighborhood spot for late-night eats!!! 10/10 Highly Recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVGFsOWtXRmhsTldkRFl6UTRiekJNTFdsMFVGRRAB",
            "text": "The food was incredibly underwhelming. The meat lacked flavor, and it's clear they don't season the chicken at all. It should have been marinated for at least 30 minutes to an hour before frying, but instead, it was EXTRA DRY, overcooked, and drenched in a sauce that tasted like it came straight from a bottle. I spent over $100, and honestly, it wasn’t even close to being worth it. I have a hard time believing these reviews are from anyone who knows good food. Very disappointing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCT01TMHRTVzlzWms5UUxVb3haMDF6Tm1WNlZGRRAB",
            "text": "I've been there at least 9 times already and it's always been a positive experience. The employees are respectful and easy to converse with. The place is clean and the food is always good and fresh"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZnQxUHJtbUthZ0lnEAE",
            "text": "Not a bad spot! I ordered the mixed platter, and it was very good. The only downside is the price, but I’ll definitely be coming back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQX2FpdlRmNjRXRXRRRRAB",
            "text": "I've been living in the area for over a year and hands down, they have the best halal in town. I get the chicken and rice combo at least once a week lol. They are always so friendly and accommodatable. Thanks for the great food Sauced Up !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJaUNrLWF3cEt2bm1nRRAB",
            "text": "Gave me and my husband spoiled old tres leches cake"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJMkgxdFd1bU82WjlnRRAB",
            "text": "I love the fish !!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRODVDS1ZREAE",
            "text": "If you are using a credit card check your receipt and get a receipt.  They are overcharging for food. At first it was one dollar (chicken over rice $11 and change, now it's $14 and change) now it's up to three dollars. I will never purchase anything from them again! Buyer beware and ALWAYS get a receipt! If it continues they won't be around for long because of the stupid greed."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcGJYaDVRRRAB",
            "text": "Came from Miami to visit someone and stubled upon this spot. Ordered to go and walked home in 30 degree weather and the food was still hot, fresh and crispy 👍🏽 I had the ten piece shrimp, tartar sauce was fire! worth the walk lol"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYX2VuOWNREAE",
            "text": "Best spot on the block definitely worth it customer service is through the roof 🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaXZySlBnEAE",
            "text": "No delivery service only through food app"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN09ERmxRRRAB",
            "text": "Haven’t been there in person but wow I love to order their food. Everything is good. There is nothing I’ve tasted that wasn’t amazing. So yummy! Waiting on an order as I type this."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuZ01YVE1REAE",
            "text": "excellent cooking, do not regret trying this place out for the first time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeTVPWENREAE",
            "text": "I went during non peak hours. The Cashier was very attentive and helped my pre teens order when they were too shy to speak up. He made us all very comfortable and the food only took 10-15 mins to cook. Everything was fresh and the portions were huge. I’m actually upset that I’m full off of 1 piece of fish and some fries. Well seasoned, just know I’ve unlocked a new level of big backery."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIM2JHUXBBRRAB",
            "text": "Nice place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIM2I3TWFnEAE",
            "text": "Best food in the Bronx!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbmJ6ZmFBEAE",
            "text": "I walked in to find loud Mexican music playing and no one at the counter. I called out to see if anyone from the back could take my order. When the wide-body, tall staff member finally emerged, she looked visibly annoyed. I offered to come back later if she was busy, but ended up placing my order, albeit with some regret. Since I had already paid, I had to wait. She told me it would be ready in 10 minutes, repeating it twice, which felt like she wanted me to wait outside. While observing the kitchen, I saw that the lamb used was the low-quality frozen kind. Given the prices, I expected better freshness. When I thanked her for my food, she didn’t respond with a “you’re welcome.” I wouldn't recommend this place; it seems like they’re bringing subpar food into the Bronx that wouldn’t be accepted in their own community. Don’t believe the positive reviews, it’s either staff, friends or family members of the owner, everyone has a google account. I won’t be coming back (Sauced up and Hala BBQ is the same owner)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dDhqTGhRRRAB",
            "text": "I used to love ordering from here, I only eat seafood today will def be my last. I order jumbo shrimp …. They gave me tiny shrimps … not what I ordered they’re just going down hill for the seafood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3N3RYSlVnEAE",
            "text": "Walking in there and looking at the menu board for the first time, one might make the mistake of thinking that food seems slightly overpriced. But then, you get the food, and you take your first bite, and you realize you were wrong. The food here is infact, terribly overpriced. I mean honestly, the food was so bland that even the English would complain about it. Portion wasn’t terrible though."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiXzRTQ0dREAE",
            "text": "The food is outstanding. Not really a dine in place or neighborhood. Lamb+chicken combo/wings/chicken&waffles havent left anything to be desired other than a larger appetite. Extremely generous portions. Staff is friendly and the place is clean. Extensive menu for such a small spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaWNYRWF3EAE",
            "text": "Love it, the food was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid3FLaEFREAE",
            "text": "Food was great and customer service was excellent.. I will be going back for more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyXzRpN053EAE",
            "text": "This would have to be the best spot in the bronx\n\nFood is awalys made fresh to order if your ever around this spot you must go there before leaving nyc or the bronx"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMWFPbFlnEAE",
            "text": "This is the best halal spot ever! I’ve tried so many different things on the menu, and I haven’t found anything I didn’t like. The diversity, quality and portions are just right."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6X2NlMGh3RRAB",
            "text": "Excellent customer service, staff always knows my order as soon as I walk in without me saying a word! Food is A1 and always freshly prepared can’t get that no where else"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6NktEMzBBRRAB",
            "text": "Amazing food!! Fries over the chicken and rice is a game changer. Sauces really are the star of the show here though!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURqMjVZbxAB",
            "text": "STRONGLY RECOMMED THIS PLACE TO SPEND YOUR LUNCH TIME. I am obsessed with the delicious sauce and food, and personally love the green sauce which is really fresh and sour."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcHVlXzNBRRAB",
            "text": "Good food and people, clean environment 👍🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeGNXSXNBRRAB",
            "text": "Great restaurant.  Loved the food. Large portion size and a good price. Excellent customer service too. I recommend and will eat here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbElpd2Z3EAE",
            "text": "I always call them a hidden gem. The food is always fresh and good 👍🏿 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5XzZuWHhnRRAB",
            "text": "Great place!  Very nice management and employees,nice portions and delicious food.  Quick service.  Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5ek0ybjZnRRAB",
            "text": "This place is saucy come check them out! Finger licking good"
        }
    ],
    "reviews_count": 36
}