{
    "name": "Royal Cafe Restaurant & Bar",
    "place_id": "ChIJ2wZTzx71wokR44AqC4DoNso",
    "grid": "BX1",
    "address": "514 E 138th St, Bronx, NY 10454, USA",
    "rating": 3.5,
    "user_ratings_total": 25,
    "phone_number": "(347) 270-2077",
    "reviews": [
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeWVGY3pMWEZTU3pneVNtUnFXR1ZHU1hSWFNVRRAB",
            "text": "Excelente servicio y comida 🤩"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUWVFWkZTMmRsVUhWNU4xaEliak54VHpONFVXYxAB",
            "text": "Banging used to go to a restaurant that cooked like that but they closed so now I found my new spot love it keep it up"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMVNYRnNNR2xHYW5GYVRsOVpUbXBGWjJGdVpIYxAB",
            "text": "La comida al parecer meten a la olla y la sacan sin preparar bien, todo crudo no vale la pena desperdiciar el dinero en este lugar , aparte que te cobran de mas\n\nEl servicio de la chica que atiende pésimo e visto como se comporta con las personas y menosprecia a repartidores, no empacan bien los productos cuando pides por aplicación, en vez de estar pintándose toda fea ridícula debe ponerse hacer eso\n\nEl ambiente no es cómodo porque las personas tienen que pasar rosando las mesas cuando estás consumiendo y muchos defectos más le daría un -5"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKclZ6WlJVM1JVUzFCbGRTMVNSREptVW5KcFJGRRAB",
            "text": "The food is delicious 👍🏼"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPcVozOS1aOTdTSzZBRRAB",
            "text": "Not worth it for the price and I see im not only one to say it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJemZhZzdnRRAB",
            "text": "It was good but way too overpriced.\nEdit- I just seen the menu on the google photos and they overcharged me by $17.\nAsk for a receipt if you plan on eating here"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdUt2Wlp3EAE",
            "text": "Service is always great and the food fresh and tasteful.  The staff are amazing and welcoming as well."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJc2RPenlnRRAB",
            "text": "Never again"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiazVUWmVREAE",
            "text": "I am one to not do things like this but I have to air this out...\nMy fiancé had wanted to try this place out since it was newly renovated and thought \"Why not?\"\n3 bites into her food and she bites into a SCREW. I don't know if this was intentional or accidental but either way, UNACCEPTABLE I grew up in this neighborhood and this has NEVER ever happened to me.\nRoyal Cafe Restaurant, a \"sorry\" does not fix the damages that were caused and relieve us from our anger. A refund does not fix it either."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaVpmWEZBEAE",
            "text": "Me and my son love this place the staff is very nice! It’s such a family oriented place the food is great and I love that they have many healthy options 138th street has been needing this ♥️ get the chicken soup!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOHRXSzRnRRAB",
            "text": "No te dan un buen servicio cuidado te cobran de mas  en la factura los tax no te lo dan en una factura que no es legible  por la ciudad y te cobran de mas productos que dicen incluidos y después te lo cobran a parte por que se niega a entregar factura  pars que no verifiques los valores\nThey don't give you a good service care they overcharge you in the invoice the tax do not give it to you in an invoice that is not legible by the city and they charge you for more products that they say included and then they charge you part because they refuse to deliver invoices so that you do not verify the values"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibXRYaGl3RRAB",
            "text": "Their doors were locked at 7:15 AM, no consistency with the stated 6:30 AM schedule.  The cooks stayed back doing their thing in the kitchen.  No response from them when I called via cell phone.  They should state a true Sunday schedule, no way are they starting at 6:30 AM.   There is no early breakfast in this establishment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyM3FmWEtnEAE",
            "text": "It was a delivery. The peppers and onion wasn't cut at all. Big chunk and so the potatoes. Very disgusting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMazhuZkhBEAE",
            "text": "0 stars! The other reviews have to be lying. I got a french toast platter and pancake platter. The pancakes had a funny taste and the French toast barely had flavor. The eggs were watery and not scrambled like we asked. It was more like an omelette. The home fries had no flavor either. I was very disappointed I didn’t even finish my food smh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUOXZ2c1d3EAE",
            "text": "If I could give them 10 stars I would!! Hands down THE BEST breafast spot. They sell lunch/ diner too for the triple wammy. The host is such a sweet and charming woman. A slice of heaven in the bronx ✨️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWLTdqdWNBEAE",
            "text": "I have been ordering from this neighborhood restaurant and trying different all the time. Everything on point so far. From smoothies to salads to dinner and breakfast"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsa2F6TUZREAE",
            "text": "This place is my new go to. So far everything I've ordered taste amazing and the service is 10/10. Love this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMi1fRUxBEAE",
            "text": "Got some breakfast sandwiches and a waffle with fresh fruit a couple of weeks ago and absolutely loved it! Keep up the good work!"
        }
    ],
    "reviews_count": 18
}