{
    "name": "Maisonetta",
    "place_id": "ChIJ6ZxdNlX1wokRtDoCPt_Iy4I",
    "grid": "BX1",
    "address": "141 Lincoln Ave, Bronx, NY 10454, USA",
    "rating": 4.5,
    "user_ratings_total": 302,
    "phone_number": "(347) 297-4607",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0elNEQnJlVUkxVUVONFJqQlFTMUpTTUVGMlRrRRAB",
            "text": "The place is unassuming, but the food was outstanding. Small but cozy and very welcoming vibe. Staff was very attentive and kind.  The tortilla soup was the best I've ever had.  Stuffed poblano was full of flavor and so well done."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNM2NrNVBiMkZDTnpBdFgwd3dhV2xGV1ZkdVRuYxAB",
            "text": "Great food & service - the shrimp scampi was amazing! I will definitely come back"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSU2QycFJhR2RFT1VGTmRESlRSVEJHWkhWb1gxRRAB",
            "text": "Deliciosa comida 😋  excelente servicio y buen ambiente. Volveré con mi esposo y mis hijos."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tab016aGhVSGRXV1Vod1NrMUpNV0Z1U2pWMFdYYxAB",
            "text": "Honestly, it was a perfect spot for my daughter and I. Great for date, friends or a quick bite. The food was amazing. You know it is when local customers tell you what to have on the menu. Our server -Christian  was superb."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJdFoyazBWV1ZGUmxWTmF5MTFNVTV5YjJwc00wRRAB",
            "text": "Zero stars for Erica our server today on 8/29, I’ve been coming to Maisonetta for years and each time  felt like a community welcoming and inviting but not today, i never felt the way I did today. Erica  never made eye contact, never checked on me or my  son, but was attentive to the table across from us literally2 feet aways.  Her service came across as rude racist and biased, and I couldn’t even order a second drink because she never returned or checked on our table i had to walk to the bar to get my check.  Maisonetta is better than this — please train your staff and let Erica know there’s no place for this type of mindset and behavior in the Bronx."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaNWEydHhPR2N4U0ZKbUxWTkVUVlpYYVdKTFMwRRAB",
            "text": "The pulpo asado is a must a little spice to it but amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQ1gxcEhka3h5TXpRd01YSkhTVm80UVZweldFRRAB",
            "text": "It was earlier on a Thursday. Just check out this spot . Totally coming back good vibes and energy … THOSE HOME FRIES! Was amazing  ( well seasoned) 👀👀👀🫡.. also had those drinks they slap lol, 😂 the first one was calm which I appreciate. Shot out to the BX they really have some good spot ! Will not sleep on them any more . If you around there PLEASE PULL UP AND SHOW LOVE. Forgot my waiter name but she had circle glasses and was super nice 🫡👏👏👏"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Q1QyZHFTVkpaTldwRWRWZGFMWEZGU0V3emVIYxAB",
            "text": "Good drinks and lunch/dinner spot. We went on a quiet date so i think it affected service but it was good!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dklpZ253RRAB",
            "text": "Very good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMVNsTkdUMnM0VDJsU1Z6UkZkbFZWYTFWQmQyYxAB",
            "text": "Excellent meal. You have the option of order a la carte or ordering a 3-course menu The restaurant is quaint and on the smaller side, so I recommend making reservations for a busier night This is the place to go if you want to try classic food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0M2JYSlFNMjVHVVhNeU5FSkZRakpuT1dOTFozYxAB",
            "text": "Super cute vibe and really good food! Nice staff but service a little slow."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKcWJVUlVia05ZZUVGS1NWTnVjM2xSY0hZdFUwRRAB",
            "text": "Took a while to make my corn on the cob, and it wasn’t very tasty"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OXBqbGl3RRAB",
            "text": "Good happy hour menu, good service. Worth checking it out"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKbXp5ZkRHMXRyNHpRRRAB",
            "text": "The food and service are great. However the music playlist is so bad. The early 2000s pop is not the vibe for this environment"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQckxrSmVJMGM3dlhBEAE",
            "text": "It sucks to be making this review because Maisonetta easily became one of my favorite restaurants since the first time I tried it. I had dinner there last night and I ordered shrimp tacos, something I had before and enjoyed. This time I did not like it. I didn’t tell the waiter nor plan on telling the waiter that I wasn’t satisfied with the tacos because they weren’t terrible just not as good as the first time. My mother ordered the surf and turf special that they had on the menu as a Mother’s Day item. I asked her to taste her shrimp and with one bite I could taste that the shrimp was spoiled. She had one before me and said it tasted fine. As she went on to eat the next shrimp she said it didn’t taste like it was good as well. We let the waiter know and they basically assumed we were lying. The waiter brought the raw shrimp in the container out to our table and he also brought the chef out to speak to us and tell us that they are a small business and it isn’t fair because we ate all the shrimps except one. ( we did not, the shrimps were in the napkin and I tried to show the chef and he was upset and walked away without even looking) the chef refused to give any compensation or even an apology. As the chef walked away the table next to us stopped him and told him that their shrimp tasted funny as well. They still insisted it was nothing wrong with the shrimp and ignored our concerns. As someone who has frequented that establishment I am sad to say that I will not be returning. That is not how you treat paying customers! The waiter took a lemonade off of our bill as compensation but after being accused of lying and told that what we were saying didn’t make sense, because I ate two shrimp tacos and all the shrimps came from the same place, that deed didn’t seem genuine and the damage was already done. No apology, just accusations. By the way they acted, I’m sure they went on to serve those shrimps to other people."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNUE40X3JpeUtTQVFnEAE",
            "text": "This hidden gem in The Bronx is simply fuori dal comune — truly outstanding! I had the garlic mussels, and mamma mia, they were incredibly fresh. It’s rare to find such high-quality seafood around here, but this place delivers with excellence.\n\nMy wife ordered the steak and egg quesadilla, and let me tell you — it was worth every penny. So flavorful, so rich — it made her Mother’s Day truly unforgettable. I also tried the shrimp omelet, which easily earned an A+. You can taste the care and love in every bite — fresh, high-quality ingredients and a true explosion of flavor in your mouth. Our five years old got an Horchata and was sooo good!\n\nWhat made the experience even more special was the complimentary glass of champagne for my wife. That little gesture made her feel like a queen. The servers were sweet, attentive, and full of warmth — come una grande famiglia. A big shoutout to the sweet manager who personally came to our table to make sure everything was perfect. That’s going the extra mile — and we noticed.\n\nEvery table got a champagne toast, which created such a festive and loving vibe. And let’s not forget the cocktails — you can never go wrong with their signature Frida, but David surprised us with a custom drink that was una bomba!\n\nIf you’re looking for flavor, care, and unforgettable service, this is the place. From the first bite to the last sip!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZVpvS1M4cWMtajFBRRAB",
            "text": "The food was outstanding. You would never expect to find this gem, a reminder not to judge a book by it's cover. You'd pay 6x-8x if you go 40-50 blocks south."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPYXZsTUtxd0pqNUNnEAE",
            "text": "I rarely write negative reviews, but our Mother’s Day brunch at Maisonetta left us feeling scammed and incredibly disappointed. What was meant to be a special family celebration turned into a frustrating and overpriced experience.\n\nWe ordered a steak and egg quesadilla that had no listed price on the menu—only to be shocked when the bill came and it was $35. For that price, you'd expect at least a side or two, but it came with absolutely nothing: no home fries, no rice and beans, no salad—just three small pieces, with barely one piece of steak in the entire dish.\n\nTo make matters worse, the restaurant had advertised a complimentary glass of champagne for mothers, but none was ever offered or served. It felt like a dishonest gimmick just to get people in the door.\n\nThe drinks didn’t help the experience either. The coffee tasted old, and the horchata, which had no alcohol, was a jaw-dropping $12. That’s more than most cocktails, and for a non-alcoholic drink, it’s just absurd.\n\nOverall, Maisonetta felt like a textbook example of style over substance—flashy promotions and high prices masking a disappointing experience. We left feeling taken advantage of, not celebrated. I would not recommend this place, especially for special occasions."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJYmxwYk9aNHJmdlJBEAE",
            "text": "Seafood and burger are bomb, tacos and service are alright. Great seafood in the Bronx but we were served the wrong food with the wrong toppings, and, after notifying the waiter, nothing was done about it. Completely understand the restaurant was at capacity that night but this some Bronx type shit.\n\nAll in all, the seafood we got was fresh, the burger was delicious and cooked perfectly, the tacos were messed in the order but I wouldn’t recommend them regardless due to the flour tortilla. This is one of my top 3 spots in the south BX"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdXFERW1RRRAB",
            "text": "We really liked the place! Nice food, good service (David was so nice!). They even made a vegan option for me, the avocado toast with home fries were delicious. I really recommend eating here 😊"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX2RuMWd3RRAB",
            "text": "The food was average to good Mexican food, but it very much felt like the staff did not know the menu or the wine list very well. It was an interesting vibe. I would go there again if someone invited me, but I wouldn’t go out of my way to go there."
        },
        {
            "date": "6달 전",
            "language": "zh-Hant",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNWZEam5BRRAB",
            "text": "食物還可以，但不斷催促仍要等足一小時才上菜，並且侍應完全沒有歉意。"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcFk2YTZ3RRAB",
            "text": "We left empty stomach after a hour of waiting."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcHNUTi1nRRAB",
            "text": "Best in The Bronx, Mexican food with a special flare"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMczV5cmN3EAE",
            "text": "Omg that margarita was everything (tasty and strong)! And I’m from Texas so that says ALOT! The tacos were good. The atmosphere was good and the service was as well. Only here 2 days but I want to go back before we leave! Def recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbDZ1ZExnEAE",
            "text": "Terrible wait times. Came in for a pick up at 11:15 that was suppose to be ready 11:20. Had to wait in the restaurant 35 minutes for it to be ready at 11:55 (it’s a med rare burger fwiw).  There’s only 5 other people in the restaurant and a table of two complained about the wait times while in there too. Food is also over priced for what it is. I would avoid. There’s a lot better food in the area with out the terrible service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OUlEZmNBEAE",
            "text": "Loved the drinks and the food. The steak was great and so were the chimichangas. The cilantro salsa was fantastic"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbHNxQmNREAE",
            "text": "A very quaint restaurant in a bustling part of the Mott Haven neighborhood! A great place to stop for Mexican versions of some classic dishes- like the Mexican chorizo burger that I tried! While not the most amazingggg restaurant I've ever tried, it's a really solid spot if you're in the area. Extra points for their excellent service as well!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneW9qNXFnRRAB",
            "text": "We had an amazing experience at Maisonetta French Mex! Our group of 10 was seated comfortably, and from start to finish, the service was excellent.\n\nFor appetizers, we ordered Guacamole, Calamari, and Elotes, and each dish was absolutely delicious. The guacamole was fresh and well-seasoned, the calamari was perfectly crispy, and the elotes had the perfect balance of flavors.\n\nFor our main courses, we enjoyed a variety of dishes, including the Bowl Burritos, Al Pastor Tacos, Shrimp Tacos, the Mexican Burger, and the Salmon with Mashed Potatoes. Each dish was flavorful and well-prepared. The tacos were packed with fresh ingredients, the Mexican burger was juicy and satisfying, and the salmon was cooked to perfection with creamy mashed potatoes on the side.\n\nThe lively atmosphere made it a great spot for a group gathering, and the blend of French and Mexican flavors truly stood out. We all had a fantastic time and would definitely return to try more from the menu. Highly recommend Maisonetta for anyone looking for a great dining experience!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa002UzNnRRAB",
            "text": "Came here on a Sunday for brunch. It was empty because of an upcoming snow shower but eventually got busy around 2pm. Our server, David, was lovely and very attentive. I enjoyed the crème brûlée pancakes and cocktail (the Frida). I got 2 large pancakes and they were very filling. I took off a star because I feel like the food prices are a bit high. For example, their online menu says you’ll get 4 pancakes for $21. But I actually received 2. That doesn’t bother me, but $21 for 2 large pancakes was not ideal. I’ve paid less for equal quality pancakes at similar restaurants across the city. I didn’t complain because I’m down to support The Bronx but I think it’s worth considering. Overall though, I had a delightful time and would go back if I was in the area."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmeHBqdEdBEAE",
            "text": "Great food my fav was the mejillones al mojito"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOWRhaTRRRRAB",
            "text": "Went in for lunch and ordered the Bistec Norteno and the soup of the day. The soup was Zucchini and Yellow pepper which was the highlight of my meal.\n\nThe steak was overcooked and served well done. Not sure if that’s how they normally serve it as I wasn’t asked how I like my steak and my fault for not saying anything but decided to see what they would do. If the steak wasn’t cooked well done in the kitchen the very hot cast iron plate it was served on definitely overcooked the steak and made it dry and tough to chew. The fried cheese and the chorizo definitely helped but not enough to overlook a well done steak.\n\nWould probably go back as it may have been an off day but will definitely order something other than steak.\n\nOverall 3.8 for the main course. 4.2 for the soup of the day."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmLWJfNHFnRRAB",
            "text": "Charming cozy restaurant with great drinks, food, and service. We were visiting from out of town, but if we lived locally, we would become regulars."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dWZEc3lBRRAB",
            "text": "Such a gem of a restaurant! Food is authentic and so good. Service was fantastic. Cute place, just busy enough that you can still hear the conversation at your own table. I highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dWVERFFBEAE",
            "text": "Best food I've had in a while I highly recommend coming here. truly incredible and the guacamole is impeccable"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MmItUEdBEAE",
            "text": "I don’t know how to tell you that this food was the best food I’ve had in a very long time without underestimating how good this dining experience actually was. I had a blast, the environment was great, the waiter was very nice and accommodating and THE FOOD! Please please please spend your money here, the guacamole was delicious and I personally can vouch for the paella! Thank you!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MV9yS253RRAB",
            "text": "The food is fresh, staff is friendly, and the atmosphere is chill and relaxed. There's no loud music at brunch so you can have a conversation."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQOExEcENnEAE",
            "text": "I waited 40 minutes for my food and I had to ask the waiter for it twice .Never again will I go back ."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbnVMa2N3EAE",
            "text": "Great service, cute place wasn't too busy for breakfast. Was looking forward to a steak option they were out had to settle for sausage, not a fan of potatoes in general"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYanBfbklnEAE",
            "text": "I went here last Friday to eat lunch and it was amazing. I asked the waitress what she likes to usually order because I didn’t know what to get on the menu and she said to get the entree of the Pollo Asado and it didn’t disappoint. I loved the fried cheese that was on top and the yellow rice it came with. The chicken was cooked great and it as juicy as well, you could taste the smokiness of the meat. It was seasoned well, a bit too salty to be honest, but it was good nonetheless. I also ordered the guava colada mocktail and it was good but it was a little too sweet so I had to add more water to thin it out and make it more balanced. Very good portions and so yummy! Will come back. Also the decorations of the place were so vibrant and beautiful. The plantains were also sweet and it paired great with the cheese."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcHJpRXl3RRAB",
            "text": "Ordered chicken fajita and received wrong item. Called to inform them as I was hungry and planned to keep the meal that came. Person on the phone said he'd let the owners know then called back and was rude. After repeatedly telling him that I did NOT want a refund or new meal, just wanted to bring error to their attention. He blamed me for his error and insisted he \"never makes mistakes.\" With such rudeness, I'll gladly order elsewhere. This person is very dishonest and it,s a shame for what was a good restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuLWEzMEVBEAE",
            "text": "Went at 11:10AM for a group of 5 and the service was super slow. We didn’t get our food until literally 12PM. The food itself was bland, no taste, barely any seasoning and half of my girls had stomach aches right after. The price is ridiculously high for slow service and below mid-tasting food."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubVp6WkRREAE",
            "text": "Great place. Delicious food (very tasty meat), super friendly and attentive staff, great atmosphere and music. They also gave us free tortillas. We had the American tacos and the carnitas plate. Service time is very slow though. Took us 30+ mins to receive our food in an empty restaurant. Almost an hour when we ate during a full house. Aside from that, highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbmZIcUFREAE",
            "text": "First time coming for dinner time. It was really calm and fast service. Went on a Wednesday. Wish there were more options of appetizers and food. But so far I enjoyed the dessert and calamari."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMmJuRDh3RRAB",
            "text": "Maisonetta in the Bronx serves up an exceptional omelet Florentine that truly stands out. The dish is a delightful combination of fresh, vibrant spinach and creamy, tangy feta cheese, all enveloped in a perfectly cooked, fluffy omelet. The spinach is sautéed just enough to retain its texture and flavor, providing a fresh, earthy contrast to the rich, savory feta. Each bite offers a harmonious blend of textures and flavors—light and airy eggs meet the slight crispness of spinach and the smooth, salty richness of feta.\n\nWhat really sets this omelet apart is the balance between the ingredients. The feta melts just enough to coat the spinach and eggs, creating a creamy consistency that enhances the overall experience without overpowering the palate. It’s a simple yet elegant dish that exemplifies how a few high-quality ingredients can come together to create something truly memorable.\n\nPaired with Maisonetta’s perfectly roasted potatoes and a slice of crusty bread, this omelet Florentine makes for a satisfying and delicious meal that leaves a lasting impression. If you’re in the Bronx and looking for a hearty, flavorful breakfast or brunch option, this dish is definitely worth trying."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOVBISC1RRRAB",
            "text": "I was looking for restaurants to support in the Bronx and came across this one based on the reviews but, sadly unless they get more staff I will not be returning!\n\nThere was one guy taking the orders, working the bar, and bringing the food out that deeply affected the wait time. I wanted another drink and dessert but, I decided to leave as the place was getting busy and I didn’t want to wait any longer.\n\nThe villa drink is awesome! The shrimp and chicken tacos are banging and so is the calamari."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiLTZ2Nm9nRRAB",
            "text": "The food was delicious.  Very fresh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiek5tV29nRRAB",
            "text": "Ordered a salad with chicken $24 left $5 tip took over 15 min dry chicken on top of kale to make dressing was not good\nnot going back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOU1UMHZRRRAB",
            "text": "The shop is nicely decorated, I ordered breakfast, and it was very good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaTkybXd3RRAB",
            "text": "I went here tonight, got the calamari and the Carne Asada tacos. Everything was delicious, and the staff was very attentive. Definitely will come back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMLU9Yb2NnEAE",
            "text": "The restaurant had a great atmosphere, cozy vibes. The customer service was outstanding, it’s definitely a hidden gem in South Bronx. The food was EXCELLENT! I had the steak, pork chop and they are cooked perfectly. Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNm9xY0NREAE",
            "text": "I have ordered delivery from Maisonetta multiple times and it’s always delicious. Today I had the pleasure of dining at the restaurant. It’s an adorable place and the waitstaff is super kind and attentive. Our food was absolutely amazing, we had the steak and scallops and couldn’t believe how good they were. The drinks were also delicious and strong. 10/10 would go again and recommend to all my friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxOU5mVWF3EAE",
            "text": "I came here with my family . We are from Texas . The waitress was phenomenal. The service was amazing . I ordered whatever my waitress recommended. And it was simply the best huevos rancheros I’ve ever had ( well their take on it ) my girl ordered the chorizo plate . And my kids had chocolate chip pancakes . The food was so yummy ! Was a little pricey but I believe worth every penny ."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNUp1b2Z3EAE",
            "text": "Came here for Valentine's day. The place is small, but its a nice space. When I entered I was not really greeted by any of the employees. I was disapointed because I came during happy hour time and there was no happy hour that day because it was valentine's day. There was a young man who first came to our table but honestly he lacked professionalism and service. He never came back to us again, then eventually this lady was our server. It took a while for us to get our food and our waiter to check in with us.\nThe place was also nicely decorated. To order, I got 4 drinks in total of classic margaritas with added flavor of hibiscus, and mango. It was pretty good. I ordered 2 of the churrasco Al carbon, it came with mash potatoes and a side of garlic spinach. The food was really good as well. For dessert I got 1 order of churros with ice cream and it was delicious also. The bill came out to $168. I found this to be just a tad bit pricey. The good thing is that tip is not included automatically which I appreciate because some restaurants do that now with a party less than 5-6 which I absolutely hate. Im not sure if I would come back because service is ALWAYS SLOW."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNGFqeGF3EAE",
            "text": "I love this place! The food and drinks are great! My server David never fails to provide phenomenal service! He always knows what I want, he’s super friendly, and very attentive. Truly an amazing soul. Maisonetta is definitely my go to spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4ODZxNkdBEAE",
            "text": "Such a wonderful restaurant for fresh eats.\nEverything was incredibly delicious and full of flavor. We had the escargot and would eat it a million times over !! Sooo good and savory !!\nSuper cute place adorned with ivy and the staff is really friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNTl6ZEt3EAE",
            "text": "I was here for dinner. It is a nice and cosy restaurant that has a welcoming vibe. The service was also amazing. The calamari was very heavy on the batter, however the enchiladas were packed with flavour and were very filling. They were also good portion sizes for the price. Overall a very good dining experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaUtYNEZ3EAE",
            "text": "From the cocktail menu I had the Villa -which surprised me with it’s roasted pineapples and honey/pineapple infusion that balanced a mezcal base. The mussels were great-I especially liked the sauce which was light but flavorful. The fries were super light and crisp - I loved them!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M2NhaFNREAE",
            "text": "Amazing menu, great food, perfect brunch spot. Server could be a little more attentive, and music was a bit loud. But all in all, great place, will be going back soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMzUtYzl3RRAB",
            "text": "I love this place. I come often. Income for lunch, Dinner, Celebrations, work events and work meetings.\nThe staff is always kind and on point. They’re very knowledgeable about what they serve. And the music is always great!\nThe prices for the quality of food is amazing.\nOh… try their spicy Margarita.\nMy favorite spot in Port Morris HANDS DOWN!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5enVuT0xREAE",
            "text": "The place was great, as well as the food. Service was good, only downside.. I ordered 2 rounds of Don Julio shots. Each on a separate check and tipped gwnerously. The second round of shots, the bartender (or waiter), poured an extra shot. When delivered to the table, they asked if we wanted the shot. Well, sure...so I thought. The gentlemen explained he had to charge me. I declined.  There was no need for another shot as we ordered a round of drinks with our food, as well. Other than that little awkward moment, the place was great. Grilled octopus was good, mac n cheese creamy and cheesy, and tuna tostados, really good.  One friend had the muscles, and she raved about them.  My other friend had the chilaquiles, and she said it tasted like mom's.  Overall, highly recommend. (FRIDA drink shown in photo....delicious!)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZ016bGlBRRAB",
            "text": "Hands down my favorite place to take myself out to for solo or small group lunch dates. Every time I've gone to Maisonetta I've experienced exceptional food and service. The ambiance here is also nice and they normally play Latin music. During my last two visits, Angel has been my waiter and he is amazing. He is kind, funny and patient! I hope this place stays open for a long time and becomes a staple for the locals in this neighborhood and Bronx. I would highly recommend checking it out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dnNHYWNREAE",
            "text": "The food was good a bit expensive. The desert was great and the drinks. The burrito de carnita  was delicious right amount of flavor. The waiter was friendly and knew the menu well and gave good recommendations."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwM1liNGl3RRAB",
            "text": "They just opened for breakfast (5 am!). The neighborhood doesn’t have a diner / cafe-style breakfast place so this is perfect.\n\nThe prices are great for what you get. I normally get a bacon, egg and cheese on a roll at the deli so I ordered it here… best BE&C in the neighborhood!\n\nDinner and happy hour are also good. The service can be excellent and other times slow (depending on who’s working) so make sure to flag down your server if needed."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdTR6S3VRRRAB",
            "text": "CUSTOMER SERVICE WAS PHENOMENAL!!!   I went with a party of 10 and we had a blast.  They accommodated our sitting with no problem and we’re attentive without being annoying.\nThis is a refreshing French- Mex style of restaurant that is filled with many tasty options and great happy hour deals. (Margarita $6,  flavored margaritas $7, red sangria $5, corona $5).  I had the hibiscus Margarita and was a refreshing and absolutely the right way to cool off on a hot day.  We all shared the nachos which was smothered in cheese, beans, jalapeños and just the right amount of guacamole and sour cream. Lastly, I got lucky and was able to try the steer corn which definitely confirmed my return to the restaurant.  The price was fair for the large party and happy hour prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROMk4tbE13EAE",
            "text": "I was not originally going to leave a review of how much worse the food has gotten over time but now that the restaurant is littering the streets of their neighbors with their menus I’ve changed my mind (see images).\n\nThe food has progressively gotten worse as time goes on. If you order a burrito then I hope you are a fan of onions because you are going to get a healthy dose of slimy onion jam.\n\nThis place went from being a phenomenal French-Mex fusion with amazing steak frites to below average, nothing restaurant that has no identity in its menu. All of a sudden they are serving diner food?  With other good restaurants in area popping up, there are now better options that aren’t littering our streets."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNEx5T3p3RRAB",
            "text": "Nice spot in the cut. French Mexican cuisine every single thing ive had thus far is delicious! Salmon and Shrimp Tacos are awesome the Shrimp quesadilla  are also amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCc3BPR3hRRRAB",
            "text": "Beautiful intimate mexican spot. Out of the way but the area is developing. Had the steak tacos with guacamole and it didn’t disappoint. Cant wait to come back to try the entree menu"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpMUtydEhBEAE",
            "text": "Always ask for the specials! You won’t ever regret the ceviche special. The Salmon was my go-to until the menu updated a few months ago. Now, my favorite entree is the Chilean Sea Bass. It’s like…melt-in-your mouth good! And then the churros for dessert to top it off is a must."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2NklleUJ3EAE",
            "text": "Great new spot in the South Bronx. I came on a Sunday for brunch, but looking forward to taste the dinner menu. The food was delicious, great presentation and generous portions. The Chilaquiles had a little hint of spice, good for those that are not used to spicy food. The Maisonetta Sandwich was also very tasty and the beef was cooked perfectly. The service was courteous, but as all restaurants in covid times, it was a bit too slow, so plan ahead and come with extra time. It is worth it."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdi1xNG53RRAB",
            "text": "Long wait for your meal, but worth it once it arrives. Update : Mother's day 2022: Server Caesar the best host and problem solver. He's on point with everything!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNGV5ZDR3RRAB",
            "text": "One of my favorite happy hour/brunch spots. David is absolutely amazing, always providing exceptional service and suggesting the best items on the menu. Love his energy!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbzZ5cjBnRRAB",
            "text": "Had the breakfast burrito on a rainy Saturday. Really good, and very filling. The bartender was very attentive and service was good. Hibiscus iced tea was DELICIOUS"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbmNPVG1nRRAB",
            "text": "Ordered Appetizers: Asparagus potato soup, Elote, Ceviche & Guacamole and chips. The soup was smooth, thick, hearty & savory. Ceviche had the entire ocean in the dish and was an overload of citrus paradise for the palette. The Elote was tasty but was on the smaller side then what you find from a food street vendor. The Guacamole with chips was okay and not something I'd need to try again.  ENTRÉES: Wild king salmon fajitas with flour tortillas and the Churrasco with Garlic mashed potatoes. Both were tasty and great portions. The veggies in the fajita were not over cooked AMEN! Food had amazing flavor and was far from bland or greasey. DRINKS: I did the rounds of flavored margaritas for happy hour. I preferred the Tamarind, Hibiscus and Passionfruit in that order.  Upon checkout the server gave a round on the house,  which was called the Mexican Mule. I usually don't like drinks mixed with mezcal but this one hit the mark. It was superbly blended and balanced.  I can't wait for it to be offered on the menu!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbXBLQ3lBRRAB",
            "text": "The food was expensive but good. These were some things I observed. The paella was missing the octopus. If you have all the details on the menu listed, I expect it. Nor was it told to us that it would be excluded and the price was being adjusted or mentioned that it'll be substituted with something else. There was no filet mignon. My husband ordered the steak frites instead with the fingerling potatoes but received just roasted potatoes. We didn't make a big fuss, but let us know. The inside looked, respectfully, terrible. It looks like they just picked up dumpster items for furniture. This place needs tender love and care. Someone needs to invest in the way it looks. The server...its really hard to understand him. No drive, just present. The way he prounces things is unclear. He doesn't represent your brand well at all."
        }
    ],
    "reviews_count": 75
}