{
    "name": "Charlies Bar & Kitchen",
    "place_id": "ChIJrSNA6N31wokR8rOP6iXD4RA",
    "grid": "BX1",
    "address": "112 Lincoln Ave, Bronx, NY 10454, USA",
    "rating": 4.3,
    "user_ratings_total": 1088,
    "phone_number": "(718) 684-2338",
    "reviews": [
        {
            "date": "12시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCT00yVnBabE5mUkhZeWQxQkVhMUppZEZGRVdsRRAB",
            "text": "No more. Their food and customer service has been on the decline for some time now, and their prices have gotten higher.  High prices for low quality? No."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kc1psZHJYMUpMZFhGVE5GTldiMHh0WDNGb2JtYxAB",
            "text": "Charlie's Bar + Kitchen is a beautiful restaurant with a western menu. They offer an array of handcrafted cocktails in a rustic yet contemporary setting with eclectic art pieces. Overall, the service and food is good. It's a great edition to The Bronx and what the eating scene has to offer. Check their website or socials for happy hours and live performances. It's a great spot for a Saturday with a small group of friends in the mood for comfort food and fun."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQ2FqbHdUVFpDY2t4cGVrdE9lVFV0ZFROTFVWRRAB",
            "text": "no utensils on togo.... music is trash"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReWJuZGtVMkY0UkRWVlJVRnhTVU5VWW1acWIyYxAB",
            "text": "Historical building."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeldIaEphMlpSZVdweVF6QTFZMm95UldvMFkwRRAB",
            "text": "Food was delicious, staff was attentive and friendly. Affordable family dinner!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMVZtRk1jekYzY21WVWRVNUVhVEZyYVdvNE1FRRAB",
            "text": "The food used to be very good but I tried to return and was very dismayed and have a question for the restaurant, why have beloved items been removed from the menu? My son and I used to come for the live music and the fried chicken sandwich on a Sunday, it was our mommy and son date time, I am really disappointed that now I have returned to the area this menu item along with others are no longer there…will the fried chicken sandwich ever return\nI am truly disheartened"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUlRraENjbmRZUlVrMGJtVnFUa2RHZDFKek9XYxAB",
            "text": "Great bar type food! Cool atmosphere and laid back but nice. Good table service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTGIzUm1SMnRJZGpSRFozSjNPVWRzT1U5M1NHYxAB",
            "text": "Take a bit to get a drink but its fun with friends there to hang out and socialize."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOYVpWSnhTVXBIVGxwT2NYcFphWEZrYmxkSU1HYxAB",
            "text": "One of the most disappointing dining experiences I’ve ever had.\n\nI used to love this restaurant for its open-kitchen concept—but what I witnessed on my last visit completely destroyed my trust.\n\nWhile my friend and I sat facing the kitchen, we ordered affogato for dessert. The chef mistakenly put the ice cream in a to-go container, and when the waitress corrected him, he shockingly grabbed the scoops with his bare hands, stuffed them into a glass, then licked his fingers and wiped them on a towel—without ever washing his hands.\n\nWe immediately canceled our order, and the waitress admitted this wasn’t the first time there had been an issue with that chef. Even worse, there was no manager or owner present, and although the waitress promised to share my number with the owner, nobody ever followed up.\n\nThis was more than a mistake—it was a blatant disregard for food safety and customer care. For a restaurant that prides itself on an open kitchen, what I saw was unacceptable. Until management takes food safety seriously and addresses issues like this, I cannot recommend this place to anyone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOV1ZsOHphWFJ5ZVVKSU5rcDFVR3Q2ZEhCRVdYYxAB",
            "text": "I was not planning to go back to this restaurant because a month ago in a Monday night   we had a poor experience drinks were awful and service was slow and restaurant was empty.But my fiance wanted to give it another try so we walking Friday night and our waitress was so nice she offer us a cocktail special that my fionce love it and she is very picky! I order something with mezcal and  Ratchel my waitress told me that the bartender loves mezcal and that he will surprise me and he really did was so refreshing  something I never try before and we are being around all the bars around that area but that night was special we order two rounds but we will come back for more food was delicious as well overall a great night and will definitely recommend this restaurant but I think Friday is the day to go we regret not asking for the bartenders name that evening but hope he gets to see this review . Thank you Ratchel ! Thank you Charlie's Bar and Kitchen and please thank the bartender of Friday night evening the cocktails were amazing and the special Tiramisu was delicious my fionce is the one who made me do this review thanks again. We will be back ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRk5uaEpNWFZ5TVc1ZmNXTkhiMEZ1VkdKbFlrRRAB",
            "text": "This place was horrible. They tried stuffing 5 adults and a child in a 4 person table. They seemed annoyed when we asked for a larger table. We asked about one of the specials and waitress couldn't explain the dish. We all ordered at the same time... one guest didn't get the salad that CAME with his meal. 45 mins later we had to flagdown a waitress, that told us that she wasn't our waitress and she would find ours, to get refills on drinks (that never came) and status on our food. They told us that \"there are large parties that are backing up the kitchen\". Waitress then showed up with SOMEONE ELSES FOOD. When we finally received our food... it was all cold, like it had been sitting there for a while. We did eat the food because we were STARVING. The bar waitress offered to \"take the salad\" off the bill...HOW IT WAS INCLUDED WITH THE MEAL. We paid and left. We will NOT go back. Horrible service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VVpHbFhUR2hRVjBkZlZXeFJia3RmZW5FeFExRRAB",
            "text": "I did not find anything special about this place food was OK drinks were just OK service it was a little dirty. Staff was very friendly"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210aE1IVmxhbmQzWWw4emRsWnVlVXR3ZDI5V1prRRAB",
            "text": "Great bartender , bad atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4R1NGRTFkazlYVWpscU5VRnVkVTE2WWs1NWVrRRAB",
            "text": "No A/C. A lot of mixed messages that were unclear. Came for a qtpoc event, and the menu was reduced to 5 items than what was online / here, even my Bruschetta was supposed to have sprinkled meat on it, and it wasn’t, and I asked for a non alcoholic drink, and he was trying to flood me with alcohol. They try to pressure you to get a food / drink combo for $40 rather than allowing us to buy individually. Drinks start at $12, over average. Gender neutral bathrooms, accessible entrance ramp, but lack of transparency."
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSFV6TmtOM2h2U0ZrMVNWSjZYMEpyTm1KRWJWRRAB",
            "text": "Très bien"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMVZFVkllakpxTVMxRU9FSnFVMGhXVEZwbmRsRRAB",
            "text": "First time here and the waiter came to take our order and then said give me a moment to get my pad. We waited over 15 minutes and he returned, only to take the order of a couple that came in after us. He then came to our table and we asked…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NVdFbGFaVWxtV0dsQ2RqQlJNakk1YzFWVVEyYxAB",
            "text": "Charlie’s Bar & Kitchen is a beautiful spot, stylish but comfortable, with a real sense of character. The staff was excellent: friendly, attentive, and genuinely welcoming. I had a BLT, which was solid and hit the spot. The cocktails were well-made and clearly crafted with care. It’s the kind of place that feels like a local favorite and a destination at the same time. Definitely planning to come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRk4wWTJkekZqTFdOR2JIcGpVemxETFhOSU5FRRAB",
            "text": "I love this place. The vibes are immaculate, the events are great, the staff is ALWAYS very friendly and attentive and the food is so good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5allqQklRMVV3Y1VkWFJHTkhWM0JuV0dFeVJuYxAB",
            "text": "Came in tonight with some friends. Although the food was amazing our waiter was not very attentive. Not once did he come back to ask if we needed anything, I had to go to the bar to replenish out waters myself. We asked for ranch dressing for our wings and he never brought it. My friends said he is always like that and they don't understand how he is still there."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxS2JWOXdiREkwYTAxM1pIZFRXa1pEUWpGWldWRRAB",
            "text": "I love the fish tacos here!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNFZXaFBkakl0UzFSa1pqY3ROSGxpUldSbmVVRRAB",
            "text": "Chicken was super greasy and didn’t taste good at all. Fries were stale and not cooked.."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVM2QwY3lNMHhyYnpVMGFWSmhSRko0Y2xsVFptYxAB",
            "text": "Such a quote neighborhood spot with a great rustic ambiance. Definitely great for a brunch for first date."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMU56RjJNVXBuVlRKeGFIcDNOV2s0WjBkNk9GRRAB",
            "text": "Great fish and chips nice selection of drinks. You can tell the chef knows what he is doing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQloxRnlhV05LVWtwR1dUUlJWbWxYYjFobWRYYxAB",
            "text": "The food was delicious, and the drinks were perfect. I enjoyed the live band and will definitely visit again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWGR6UkVhazlzTVhCSlJWWmtia1ZKTlVoVmJGRRAB",
            "text": "This spot has some good lentil soup if you’re feeling a lil’ under the weather. Waited a lil’ while to receive it to go, however, but the atmosphere’s chill and the person who served me was nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYTIzb3l1cnNudWxBRRAB",
            "text": "So good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMblF4ZkR0dHFEVUVBEAE",
            "text": "Delicious food & great staff. I visited with my friends. We had bruschetta, fish tacos, truffle  fries and drinks. Kyle, our server was so nice, respectful and attentive. Food was very fresh. A must try !!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYmcxOXp6eDdXa0dnEAE",
            "text": "I had a fantastic experience at this restaurant, thanks to the exceptional service from Edwin and Anthony. They were both incredibly attentive, friendly, and professional throughout our visit. Their knowledge of the menu and thoughtful recommendations made the meal even more enjoyable. The location is also perfect—great ambiance and easy to find. Highly recommend this spot, and a big thank you to Edwin and Anthony for making it such a memorable dining experience!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMRE4wYlNCenNDcGJREAE",
            "text": "All the servers are amazing"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0OS1UNWlRRRAB",
            "text": "Good for a happy hour evening"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcmFwY1N0c0w3Q0V3EAE",
            "text": "Appetizers are great and the drinks are strong"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnd3V2cS13RRAB",
            "text": "(7 years ago) Been here before. I love Charlies...the food, atmosphere, the waiters and waitresses. Ah yes, and the drinks. Very nice spot, be it brunch or dinner.\n\nMay 17, 2025:\nI haven't been at Charlie's in years, but the last visit was very good. I totally enjoyed the food. Not this time however. I have chicken and waffles. The chicken had absolutely no flavor, as though the chef didn't season it. It was also chewy. The waffles were very heavy. They were not light, fluffy, or palatable. I had to work hard using a knife and fork. The drinks were...drinkable. I had an Amaretto Sour. I would rate a 3.5 out of 10.\n\nAs for the service, Diamond, our server, was onAs for the service, Diamond, our server, was on point! Nice, friendly, accommodating. She waited on us, not like it was her job, but she cared if we needed or wanted anything.\n\nThe ambiance was cool. I do love that the kitchen is open and very visible.Food makes a BIG difference when dining. If you have a bad waiter you can ignore and or not tip them, but when the food is extremely lacking, ignoring it is impossible since you're spending your money. I don't see myself going back honestly not even for the drinks."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLXZUbFl3EAE",
            "text": "Upon entry the hostess was not friendly warm or inviting. No smiles, no can I help you, the whole delivery was off…💔 ain’t even give me chance to want the food…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMTgtNHRRRRAB",
            "text": "The food was mediocre and overpriced. The place was very noisy and crowded. The waitresses could have used more help, they were very nice and professional. It was over 40+ yrs I been in this neighborhood which is now surrounded by many restaurants and condominiums not far from the third avenue bridge. The place was at one time called Piano Factory, which till this day it is still called. We waited over an hour to have our food served."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOOC1yRHZBRRAB",
            "text": "Kiki and staff are always accommodating & food is amazing!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnZyYXVBRRAB",
            "text": "This restaurant is awesome. Chill vibes if you come on a Thursday. Drinks are strong in a good way. All I need is Mezcal and that will make it another chef's kiss."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcnBxUGJREAE",
            "text": "Honestly I never right reviews but Charlie's is so great the bar tender makes the best drinks in the bronx!! The waiter is great! I also love that it gives a family vibe! Definitely coming back."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNHRDQi1RRRAB",
            "text": "It's a quaint spot and I thoroughly enjoyed my time there. I attended a pre- mother's evening event , featuring Keith \"The Captain\" Gamble and the Nu Gypsies band and I was very entertained. The food is very good, the drinks colorful and the ambience is very comforting. 🥰🥂"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaVo3X1l3EAE",
            "text": "First time at Charlies Bar & Grill. It was some family @ friends celebrating a birthday. It was a perfect place the food was great and the drinks were fantastic. The service was professional and friendly!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3c3JiTUlBEAE",
            "text": "Came here last night with my old mates, atmosphere was great! Samson was awesome with great service. We had a bunch of food but the one that stood out was the linguini."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaEtuSElREAE",
            "text": "Came here years ago and had a blast. Moved back into the neighborhood last year and love the food as a takeout spot. Shoutout my boy Sampson for the great service - my husband came here recently and you took care of him.\n\nfinally came back myself tonight on a date night and the food and wine did not disappoint! So happy to have a great local spot w good vibes. a must visit if you’re in the area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRLU1UeEZREAE",
            "text": "⭐⭐⭐⭐⭐\nFantastic Food, Great Vibes & Top-Tier Service!\n\nCharlie’s Bar and Kitchen is an absolute gem! From the moment you walk in, the atmosphere is warm, inviting, and full of good energy. The food is incredible—every dish is packed with flavor and perfectly cooked. The drinks? Top-notch, expertly crafted, and always on point.\n\nThe service was outstanding—friendly, attentive, and made us feel right at home. Whether you’re here for a casual dinner, drinks with friends, or a night out, Charlie’s delivers on all fronts. Definitely a must-visit spot, and I’ll be coming back for more! Highly recommend! 🍽️🍹🔥\n\n#CharliesBarAndKitchen #5StarExperience #GreatFoodGreatVibes #MustVisitSpot #FoodieApproved"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRczdXZ2l3RRAB",
            "text": "Me and my spouse went to this establishment as our first time being that it was close by in the neighborhood and being that we always past by and wanted to have dinner soon so today was that day and we were having a good time the food was okay but the Brussels sprouts was the star of the show as we were eating my girlfriend was sitting on opposite side and saw a rat run by which ruined the experience overall the establishment is beautiful but wouldn’t go back because of that thank you for your time have a great rest of the evening."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnODRpcDlRRRAB",
            "text": "I went to Charlie’s for burgers and beer with my boyfriend, and we had a great time! The burgers were absolutely delicious, and the sweet potato fries were just as good. The ambience was really nice—perfect for a casual but quality dining experience. It’s a great gem in Mott Haven for anyone looking for a solid burger spot. Definitely worth a visit!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncnB6cmtBRRAB",
            "text": "I had my wedding and a small reception at Charlie’s this weekend and can’t say enough great things about the staff. They made this day so seamless and special."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneXJ2eDJBRRAB",
            "text": "the ambiance was great!\ni came out to celebrate with my man for valentine’s day. Our server david was excellent. we had champagne and a night to remember. Wonderful service.food was exquisite"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBellqcTFnRRAB",
            "text": "Went for brunch but but after 2:50 the brunch drinks are not flowing anymore. Luckily our server was cool....but besides that food was good"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNU9hZWRnEAE",
            "text": "Personally, I’ve been here twice with a friend and I do love coming here. The employees are very friendly and hospitable. The food is a tad salty, but it’s bar food 🤷🏻‍♀️. The Mac and Cheese is always my personal go to."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa3RURnpBRRAB",
            "text": "Try another spot\nService sucks food is worse."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfenAzRjF3RRAB",
            "text": "Charlie’s was fantastic when they first opened—definitely a 5-star experience across the board. However, since reopening for indoor dining after the pandemic, things have changed. The menu is more limited, and the service has declined. The waitstaff often forgets to check on tables, spend too much time chatting at the bar, and seem easily distracted, making it difficult to request anything or even get your check. The food quality isn’t as impressive as it used to be, though I will say their hummus and pita remain consistently delicious."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bTVubFh3EAE",
            "text": "Just ordered takeout from Charlie’s, and I have to say, I’m very disappointed. I’m not sure if there’s been a change in ownership, but the food quality has dropped significantly. I ordered Charlie’s Chicken Burger and fried chicken—both used to be my favorites.\n\nPreviously, the burger came with coleslaw, an egg, and deliciously seasoned chicken. This time, the chicken burger was burnt, tasted awful, and looked like cafeteria food. It was honestly the worst chicken burger I’ve ever had. The fried chicken was also severely burnt and had a terrible taste.\n\nTo make things worse, the food was overpriced. The only reason I didn’t return it was that I didn’t see how bad it was until I got home. This experience was extremely disappointing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMXVqdG53RRAB",
            "text": "Visited the little restaurant out of pure curiosity. I passed it a few time on my way to the city but have not stopped in until now. Overall the experience was a pleasant one. The space was warm and welcoming and setting intimate and relaxed. The food was well prepared and the presentations masterfully done. The drinks however were very high on the alcohol side, which diminished the taste. The servers were were professional but scarce. Anther body would have helped. Also the wait time for the food was a bit long. However like I said the place definitely had potential, just needs a bit of refining."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoajltanBnRRAB",
            "text": "Sunday brunch wife and I. So we always drive pass on way into Manhattan an heard so much good things about , we decided to check it out. We was not disappointed it was all good. Place was small cozy. Food excellent.  Staff nice and accommodating attentive. Wife and the EGGS BENEDICT/SALMON, I had 3 ingredients omelet bacon,onions and mushrooms. Both taste and presentation excellent.  Here's where I mean accommodating, wife wanted a small side order of the BISCUITS &GRAVY not a full order like sampler side. They hooked up just that. Let tell you that B&G was the bomb.  We also had the flowing Mimosas and Bellinis and shots of tequila 🤪.  Ooh also met a very nice couple. Oh also found out that the live music is on Thursdays , will check this out and be back for brunch again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldHBPSlBnEAE",
            "text": "One of my top 5 favorites meals is chicken and waffles. Hands down this was the best I have ever had and I have lost count at this point. The brussel sprouts are amazing. The ambiance is great. Definitely brunch again!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBOEoyYVJnEAE",
            "text": "Amazing experience! The waitress was exceptional. On point and made sure all our needs were catered to. Got our orders correct and served fast. Love the music and the live music... The food was amazing! Highly recommend place...."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNaWJYSWpnRRAB",
            "text": "Had a great experience for brunch. It was very calm for Saturday time. I got the fish tacos. They were very yummy but very small. I got a side of fries that help to add on for the meal. A decent bottomless brunch for $19 for 1.5 hours. The…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbW9iNXNBRRAB",
            "text": "Bad on parking. You have to ride around for a while to find a spot. Vaccinated cards are required. The service isn't that great. They are very slow in there, and not attentive at all. The drinks are good. Spill The Tea is a good choice to…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4djlQeW93RRAB",
            "text": "Came here after a Sunday afternoon walk around the neighborhood. Food and drinks were good. We grabbed a little of everything just to try it out and it didn’t disappoint. Everyone was friendly and we loved the ambience and vibe they had going. Would definitely return ❤️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMWJtY3FRRRAB",
            "text": "Lively restaurant with a nice selection of beer. Food was adequate (only issue with the time and quality) but overall taste was good. They provide live band for the customers but personally thought it might be too loud for the space. Felt like most experience was slow, but overall not bad place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvaGZtQmRBEAE",
            "text": "This was my second time here. I came to celebrate me and my friends birthday. We made it In time for brunch. I love the atmosphere, the people are nice the service was great and the food was awesome. I love their chicken and waffles. The…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMjlubDFBRRAB",
            "text": "The decor of the restaurant was a nice mix of industrial chic.  The place a bit small and when it gets crowded, you feel packed in.  The wait staff was very friendly, attentive, and helpful with menu recommendations.  The food came out…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMHRxZHRBRRAB",
            "text": "Kiki and Nikki and the rest of the staff were so kind, fun and gracious. We came in around 1:30p and stayed until 7p. Very unusual for us but we were having such a good time. The food was delicious but what made it great was the staff. My friends went back last night for the live music and I plan on visiting in the near future."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNdTUtWXRBRRAB",
            "text": "I went there for a dinner date with my husband and everyone was nice. They close the kitchen early . They let us order something before closing.the food was delicious. But the drinks wasn’t that good they change it but it still was not good…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMjR6R2lRRRAB",
            "text": "Since we started going here a couple of years ago have always like the look of the place and the food. Very tasty french fries and the fish tacos right portion that you want to order something else. Great place.\nIt's now March 2022. Still a great place to celebrate life and friends. Please do drop by. Music on Saturdays. Check out March 12th. Enjoy!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVN19EOHlnRRAB",
            "text": "I had a wonderful experience. There was live music, which was excellent. The staff was upbeat. Depending on your seating, you can see the food preparation. I had the mussels appetizer and chicken entree with 3 drinks. My buddy vegetables tacos and asparagus with a glass of Prosecco."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaUtIdWtRRRAB",
            "text": "Probably some of the best servers I've ever experienced\nThe food was decent and the atmosphere was okay but our waitress was really exceptional"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3LXQyQlFnEAE",
            "text": "Food was great, service was good, awesome environment and even live music on a Sunday Brunch, how cool is that. Highly recommend!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5cU9hamJnEAE",
            "text": "Went here for the first time for my date and LOVED IT COMPLETELY. The food was amazing and very fancy. The waitress was very polite and helpful. I believe that I would be coming back next week.\n\nIf you are looking for a cozy spot right here in the BX, then Charlies is the place to go. The music is awesome and the staff is great. Had the cocktail and it was delectable. Food taste amazing and their menu is very versatile. A perfect spot for you and some friends, a date and even a family dinner...whatever it is...Charlies is the place to go if you are in the area.\n\nFYI...There wine selection is great."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNWZ5V2lnRRAB",
            "text": "Alright, let me share the whole truth about Charlie's! I love the food and look forward to eating here everytime. News12 did a segment on how great the fried chicken was and how much of a hidden gem the place is. I had to go!!! Literally,  I visited the following week in celebration of my son's pre-k graduation.  We had an amazing waiter, great food, and a pretty cozy space to ourselves. The \"Charlie's Fried Chicken\" is absolute perfection. In that it is boneless pieces of light and dark chicken friend and drizzled with honey and hot sauce.  Ughhhh, I prefer to dip because I'm a dipper. If you're into alcoholic concoctions,  try the Champagne Charlie. It is like nothing you've ever tasted. Refreshing and served ice cold in a Champagne glass.....so  you have the fancy holding of a glass effect. What else have I tried and enjoyed? The mac n cheese, rosemary fries, spinach dip, sweet corn, pulled pork Sandwich, fish tacos, and mashed potatoes. Delish. But beware of the automatic gratuity added to the bill no matter what size your party is."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnZ0xMVmlnRRAB",
            "text": "This is a Bronx gem. I barely find places worth going to in this borough. I love their set up. All of the staff are very friendly. Our waitress was always available if we had any questions or if our water was low.\n\nI had chicken and waffle but on the menu it is called fried chicken Benny. It was “ok” the waffle was really good but I felt like the chicken could have been seasoned a little better. It probably would have taste better if I had the sausage gravy on it but being that I dont eat pork and they don’t substitute anything for it I asked for them to take it off.\n\nMy boyfriend had the burger and fries. I kept picking from his plate because the fries was seasoned perfectly and cooked just right. He said those was the best fries he ever had.\n\nThe bathroom was clean. And I love the fact they had the cooks right in the middle of the restaurant. So we could smell everything they were making in the kitchen when we walked in. Music was great as well.\n\nWhen we were just about to leave out, a band started playing. I wish we could have came a little later because they sound great for the 30 seconds I got to listen too. I will defiantly come back soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoc2IzY3hBRRAB",
            "text": "I got the chicken burger and it was delicious. Very flavourful best chicken sandwich I've had in a while. Not a huge beer selection and mix drinks were okay. Great vibes absolutely delicious food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJMk5qWDdRRRAB",
            "text": "I loved this restaurant.  It was conveniently located in front of Bronx Native the store, which had an event.  My boyfriend and I decided to grab a drink to see if the crowd would clear out.  It turned out to have an amazing French onion…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdU15aWpBRRAB",
            "text": "Nice milieu and pleasant décor. Attentive waiters and delicious food. Occasionally attractive local medical staff come for dinner and drainks, so the eye candy's free even if a certain doctor's already accounted for!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVLTRiNG9nRRAB",
            "text": "John our server was awesome many thanks. Customer service very outstanding. Bruch out of this world! Price of food definitely fair A+++ valid spot right here!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2X1pQWjBnRRAB",
            "text": "This place is friendly and the food is amazing. The portions are huge and the drinks are   honest . I wish I could take it home. The staff are very attentive and never too far away. They have indoor seating…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdnA3blZBEAE",
            "text": "The food was really good. The ginger drink was not but that’s fine, the food is the main reason we went.\n\nThe service was strange. It almost felt like that was part of a role play the restaurant may be known for that I’m not aware of. The staff was working hard, interrupting my date to try and be funny to make me buy more drinks. It was funny at first, then it was exhausting… I was tryna spend time w her… not say “No I don’t want another drink” as we are eating all the time. We asked for another sauce for the sweet potato fries and it never came but I was charged. Minor mistake, people make mistakes.. but after I refused to buy more drinks, it felt like on purpose.\n\nWhen the check came, the proposed highest tip was circled boldly.  I didn’t like that at all. Don’t tell me how much you want, cause then you not gonna get as much as I wanted to give."
        }
    ],
    "reviews_count": 76
}