{
    "name": "Lechonera La Piraña",
    "place_id": "ChIJEe_u1LD1wokROGwc-ZKWQhE",
    "grid": "BX1",
    "address": "766 E 152nd St, Bronx, NY 10455, USA",
    "rating": 4.5,
    "user_ratings_total": 607,
    "phone_number": null,
    "reviews": [
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Q1RuWnBTVzFFY25Oek5EZEdkazlvTUhJeFgxRRAB",
            "text": "I saw this on Instagram and had to visit since I originally came from this neighborhood. I gave it a 3 for food just because I never had the chance to taste anything other than the pork since it all ran out.\nHere's my disappointment.  I arrived at 1:30 and was on line for 5 hours only to finally make it to the front, and he ran out of everything.\nHe had 2 more pieces of pork cooking and said they'd be ready in 1 more hour, so I waited. That took 2 additional hours,  so in total, I waited 7 hours to only receive pork.\nHe charged me 20.00 which I thought was unfair due to the fact that it wasn't a full serving because he had to spread it with the others left on line and also no other food sides were available because he ran out of everything.\nI feel after waiting so many hours we should've been given the small portion of pork for 10.00, since, as I mentioned, it was a very small serving.\nOn the positive note, Angel is super cool, funny, charismatic, and full of energy. I don't know how he does it all all day by himself.\nThe pork skin was excellent and crispy, and the garlic sauce had my breath smelling  like garlic for days. It was delicious. It was an experience to be around my people, but I will not go back. it's too long of a wait. I left by 8 pm with my little foam container of pork."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NdE9UUk1SRVZTYzNnemRqZEtibXN6Wm1VNWFsRRAB",
            "text": "It’s outdoor, the chef takes his time with every customer, giving samples, taking pictures, laughing.  We waited 2 hours and it was worth it."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sM2VGZFBVMFY0YzBWWE1XcHJMVWx0ZDB4UWRHYxAB",
            "text": "Wonderful services and great guy god bless you 🙏"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUWFHRnZaMWxCUXpjeVpGQXRiWFJaYmpJMlkzYxAB",
            "text": "One of the best dining experiences I've had. So good!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WGVXUjNNbDlYUmpOUldYWkVZMjFVYW1SRFQyYxAB",
            "text": "Lechonera La Piraña is incredible! The lechon is crispy, juicy, and packed with flavor — easily some of the best in the city. The portions are huge, the sides are delicious, and everything tastes homemade. The vibe is chill and full of good energy, and the people are super friendly. Real deal Puerto Rican food that never disappoints"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNWNrY3lVWHB3ZUZaRGVsaGpSMGc0U0VWcFExRRAB",
            "text": "I waited for a long time to eat there...came from FAR away just to try out his PR cuisine.  The smell in the air upon arrival was awesome, the environment was fun of which the 3 hour wait in line favorable. However, the food was below standards...the pork (pernil) was flavorless and dry.  The arroz con gandulez was hard....I won't go back again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMlMwaEpNbVpGVHkxMk0wTTNlSEZPTkVsTlduYxAB",
            "text": "Great atmosphere, got there and the smell in air was organically bueno! Waiting on the line was awesome with the small little live music (salsa) The portion were small and price was high...$25 for a lil bit of arroz con gandules, a few chunks of pork, 2x2 piece of pork skin yummy flavor tho, one entire bland green banana and a minuscule portion of octopus salad...the Mojito was the bestest part .. of which was much need to make the dry pieces edible....Love loved everything else.. vibe was on point 😄"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRFpEZHZjbGxyY0Y5bVN6UnFXVFZpUnpoTVpuYxAB",
            "text": "Authentic, Old School, Boricua food.  There was a little line but nothing crazy.  I always stop by whenever I'm in the area 🇵🇷"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNDltaHVRRRAB",
            "text": "My grandfather had a lechonera in Salinas Puerto Rico. and this food  brought me back to those days  .this is hands down is number one lechon in NYC .anything this humble giant caring proud Puerto Rican man touches turns to gold. I had a bit of everything and it was delicious .que DIOS simpre me los bendiga .your ok pirana bendicion"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMk1qTlZibGw2VGpCUGJ6WmpaMncxY2toVU5rRRAB",
            "text": "I stood on the line from 2:30-5:45 and this is what I got for 20.00 not worth the 20.00 no rice left no bananas left nothing left but pencil and it was not worth 20.00 I will never go again not worth it. Not to mention the potion was horrible ."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWR1dFZERZak5rWnpZelpXUlZSR1UzWXpWMGFXYxAB",
            "text": "Saludos lamentablemente no pierdan su tiempo al ir ahí dure 3 horas y media en la fila tremendo bagamundo ese hombre habla demasiado es antijienico y para terminar después d todo ese tiempo en la fila se terminó todo y nos dejos a muchos más ahí en la fila para nada hubieron persona adelante k yo k tenían mas d 3 horas y no vale la pena para nada ir a ese lugar no pierdan su tiempo y es muy antijienico hasta con las manos agarra el arroz y el cerdo ni se diga y con cada cliente habla mucho y para colmo después d tanta espera desir que se le terminó todo y uno se le aserca y dise k esperen k hay para todo tremendo abusador cero d cero en todo le doy"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeV91SVVREAE",
            "text": "Love the lechón with arroz con gandules.\nGot to go back for more."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKck1tMWxabFJCTkVaNU9GUmliVEk0TURaTVowRRAB",
            "text": "The entire concept works wonderfully. Our full order featured fresh ingredients, good taste and expert preparation. The restaurant's appearance will impress you. The workers' approach to guests is flawless. This place showed real skill, I'll be back soon."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0MmNuaXZnRRAB",
            "text": "They don’t wear gloves, they touch the money and the food with the same hands.\nThe rice was burnt. Pretty sure the city 311 wrote them a summons.\nOven that cooks the pernil is done outside on the sidewalk where rodents and insects share the oven."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeExtZjBBRRAB",
            "text": "Really disgusting over the years even lost trailer due to sanitary reasons come here if u like cigs cause thats what the rice taste like"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSFNGbHlTSGhUYjE5dFdIZEZjRU16WkVsQ1oyYxAB",
            "text": "where are u located now"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toYVpVWlZVVFZEU0ZKWVJqSTNSMjFaTVhKTFJVRRAB",
            "text": "It was a beautiful Saturday, so I decided to trek up to the Bronx to finally try the much-hyped Lechonera La Piraña—and OMG, I can’t believe it’s taken me this long. Yes, be prepared to wait. I showed up at 12:30 and there was already a line. Service started around 1pm and it does move slow. But it’s definitely worth it. Once it’s your turn, the very friendly chef is just so much fun—chatty and giving you tastes as he prepares your meal. And it is a serious meal. He packed so much pork, crackling, octopus, shrimp, and rice into the box it about put me into a food coma. But it was good—the pork super tender, the crackling some of the crispiest I’ve had. All the seafood was fresh and delicious, and the rice super flavorful. Not the healthiest of meals, but such a great weekend outing for a flavor-packed lunch. I’ll be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeFQwaG9UV1pRYkZscmRsbzNOMWhSYVRWUldYYxAB",
            "text": "Food was very tasty,service was find. About the atmosphere too much nasty words and they can refer that is been boricua' cause that is Not true."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSVZESmFUWFpEYUZaS1R6TnpabVpKTm5KSk5tYxAB",
            "text": "Muy delicioso es comer ai muy rico el pernil los vacaitos bueno todo en General es bueno barato y sabroso"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taT1dVVnlRbmhtZEdoRFFteFFRamRWWTJwQ1dtYxAB",
            "text": "Let’s just say when you’re here, you’re familia ! 10/10 experience . Owner is in this just for the love of the game tbh . We went after a Yankees game so they were just wrapping up. I can only imagine what the foods like when I get there first thing in the morning . Shoutout to the owner"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBelUyVmlNRFkwV1dGd1ZuZE9WVFZKUTA5dGNVRRAB",
            "text": "The owner has a new truck now. Very friendly. Gives you a taste test....and of course is delicious.\nHe also has a truck in Aguadilla,P.R....\nSo, let's support small business owners."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5eldVRkZSbE52WW1vM2FsWldPRUp3WmpkbmRIYxAB",
            "text": "Good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbGVqVXllUzFUZEVzeVVVczJUMUZMVDB4MlFtYxAB",
            "text": "One of the best Saturday afternoons i have spent in the city in some time.  This person and the party that surrounds him as he cooks is a cultural experience.  The food is great too. If you like street food and street food culture, I highly recommend this place. Bring beers and chairs, and be prepared to wait."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Jd05ETjRSSE5MVlU1SmRHSTBXbTVSWnpoaFgwRRAB",
            "text": "Amazing vibes I felt like I was back on in Puerto Rico"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaU1NYQmhWalUxWkdjeVVHbFRja05WVHpSZmNHYxAB",
            "text": "The guy is great but I was extremely disappointed with the lechon and arroz con gandules. Too pricey for what it was. The two stars that I gave were for the octopus and shrimp that were good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcmtxZG5NdkxtTG5BRRAB",
            "text": "Best pork you can get"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMM0l4NmpONHNQUGpnRRAB",
            "text": "This is a hidden gem in the Bronx. The authentic flavors of Piraña's lechón are amazing. It's always a fun and good place to get Puerto Rican food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKSGV0YUdaak15OHRBRRAB",
            "text": "Great food and atmosphere 🇵🇷"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveGJtVGZ3EAE",
            "text": "I only gave it 4 stars because it was 3pm and he ran out of rice, and the plate was kind of expensive.  Meat, shrimp and octopus salad. For $30. With no rice. Now service and atmosphere was great. One other thing the famous trailer was not there, only 2 tents. Got home and had to make some rice. Besides that the food was good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc3JHWElREAE",
            "text": "Wow!!!! As this food truck has been around for many years. I haven’t had it in a while. Let me tell you he ain’t miss a beat.The Pernil is cooked to perfection and the fixings are perfect. If you ever wanna taste your authentic Puerto Rican food come on down to see La Pirana."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMzhERm1RRRAB",
            "text": "My husband & I (Doris) sttubed there today @ 3 pm& the  line was long but how is it that you only have 2 pernils available?  By the time it was our turn, pernils finished & pernils were going to be ready at 5pm.  Waste of time & drive from afar.  Never will  cone again to the South Bronx."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOV96Mk53EAE",
            "text": "El mejor lechón asado sin ninguna duda, el sabor es delicioso y hecho con mucho amor, este señor tiene un corazón tan grande y noble, alegre, fue un placer ir por allá hoy. Primera pero no la última vez, muchas bendiciones y abundancia."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMDR1VWVREAE",
            "text": "Today was a wet day and the street atmosphere was poor but Angel’s lechon and rice for $20 and having Angel serve you fresh hot crispy skin with garlic with fat side melting in your mouth is something delightful"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcGFuTHNRRRAB",
            "text": "Muy lento el servicio..no esta bien organizado..se hace una línea larga por el servicio lento necesita mejorar..y estar más organizado.."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNktqT3hnRRAB",
            "text": "Muchos besos I literally felt like I was home in P.R. So gracious and upbeat a person like him is one of a kind and genuine. May he have a bountiful life that is well deserved from the pernil to the rice so juicy and fresh you can beat this food. Please keep this place alive you won't regret it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZ0xxUEx3EAE",
            "text": "Very kool experience  and good food delishes  prok love it... the\nChef was amusing and funny  and generous...."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcmF5WExBEAE",
            "text": "Great crowd and Aviance, but it took too long to get up ahead of the line. Only one person serving and cutting the food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNU9ISzZBRRAB",
            "text": "It’s an experience for sure, he has a warm personality. He’s a one man show that takes 2hr waits. I don’t recommend coming after 1hr of opening, he runs out of sides, so I can’t say much about the food. I paid $20 for just 2/3 box of lechon, was it worth it? No, but I dunno the full plate."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3enJELS1nRRAB",
            "text": "Met the Guy, friendly and inspirational!  Check him out sometime."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3Mm9YQk53EAE",
            "text": "Riquísima la comida y un servicio d buena calidad en comida puertorriqueña y el precio económico"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NktXWlZnEAE",
            "text": "\"Lechonera La Piraña\"🗽🇵🇷 1️⃣of the🔝Lechon spots in NYC with a authentic home Puerto Rican🇵🇷 style taste that you can't get anywhere but here & on the Island❕️🏝Angel welcomes everyone & show great hospitality to all & hooks everyone 🆙️ As long as there's food left, which usually runs out around 4pm. But be ready to wait at least a hour which is worth the wait. I got the \"Lechon y Arroz con gandules y camarones\".🏝🐷🍛🍲🍚🍴🍤🦐🐙🧅🧄🥃🐸👍🏽🗽🇵🇷"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdUpib3V3RRAB",
            "text": "I had a wonderful time, the patrons waiting with me to be served were a delight, conversations were flowing naturally like if we knew each other for years.  The food is wonderful and fulfilling, you can feed two people with one meal.  May God continue to bless this man and his mission."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ2R1LW1BRRAB",
            "text": "In all honesty, the food was a little bland. There was drinking and smoking + cross contamination..\nBut some of this could be because the city took away the truck, otherwise it was okay."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURna3VDZGp3RRAB",
            "text": "I purchased 2 shrimp tacos and when I got home to eat it I was totally disgusted by it. When I bit into it I felt something wasn't right, it was crunchy when I opened the taco I saw that the shrimp had the skin and tails on it. My mother started to throw up, when she saw it"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNna2NLbkx3EAE",
            "text": "Best pernil in the area."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdGFYRmhRRRAB",
            "text": "The Best Pork in Town......"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcWNtMFh3EAE",
            "text": "Best authentic Rice and Lechon Since My grandma passed away and uncle from Puerto Rico the smell and aroma that comes out of that place screams authentic Puerto Rican food brought tears to my eyes and joy. There’s no more Puerto Rican food places in the Bronx and this is the last of the Mohicans we have to protect and support this business. I absolutely will always come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyd2FqT2lRRRAB",
            "text": "We showed up around 11:30am and we were one of the first people in line. There was no octopus that day but there was shrimp. The pork was so good. The skin is super crispy. People call the garlic sauce “God Sauce” for a reason."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOE1ILVJREAE",
            "text": "I waited for 2 hours it was a great time sitting there with locals nice warm morning I expected the pork to taste better a little hard the seasoning was not what I thought it would be . the rice was good but I had a great time won't go again happy I went and got it out of the way he cooks the pork on the sidewalk if you have not gone you should go give your feedback"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbXZMSUJ3EAE",
            "text": "Everyone is raving about this spot. As you can see, the lines are ridiculous even coming 1 hr. This is what the lines look like. This is an experience. authentic to the fullest the owner and master mind behind this food truck is awesome, very outgoing and hilarious. The food is good but not the best and that's ok. I was here for the experience, so I'll give 4 stars for the overall score."
        },
        {
            "date": "1년 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeElIdWp3RRAB",
            "text": "The man the legend….Piraña is echt een topper. Supersfeertje daar rond deze foodtruck met locals, klanten van heinde en ver, en muziek. De gastheer is supergezellig, laat iedereen proeven en serveert heerlijk puertoricaans eten. We hadden rijst met lechon, garnalen en inktvis ceviche.🔥🔥🔥 legend spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dWE3dzlnRRAB",
            "text": "We came in 1230, maybe 10th in line, but got out with our food at 130. Papi likes to offer you a bite of the plate so you know what you're getting, and he'll happily take a photo with you. As of August 25, 2024, a plate with all the fixings and meats of the day costs 30 a platter. Sooooo worth it. Will come again"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbHZ2ZVlREAE",
            "text": "Vale la pena en viaje de Massachusetts para desgustar de esta delicia de lechón, todo muy rico, El arroz con gandules, los guineos, la mariscada y ese cuerito de lechón galleta galleta😋avemariaaaa Guavate en la casa se los recomiendo 100%."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIb3Rhc21RRRAB",
            "text": "It's delicious and authentic. I didnt love waiting for 2 hours but the lechon is good and you get a lot."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcGRES1Z3EAE",
            "text": "I cannot tell you how much of a dream it was to meet him. We got there mad late with like 10 minutes left and he said I don't turn people away who traveled to see me and eat. We turned on our cell phone lights and he fed us like kings. We talked about Puerto Rico, about family,  he gave advice to my daughter on what to do for work. It literally was all a dream. Oh yes, the food was amazing. We tasted it all. This guy was so humble, omg. He got a fan for life."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNExENFFBEAE",
            "text": "The best pork skin!! Very crunchy. La Piraña (the Owner) is very attentive person, very friendly. I recommend you to come early before 12:30 pm so you can do your line early. The location of the La Lechonera La Piraña is at 152nd St at the corner of Wales Ave in the Bronx. By train take the 2 until Jackson Ave and walk one block east at 152nd St."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNVlHMWF3EAE",
            "text": "Very good Lechonera, flavor is one of the best. Wait time was about an hour as owner is the cook, server and cashier all in one. Lots of characters while we waited outside. Owner is very friendly and pricing is fair for what you get. Be aware that the trailer where he serves is old and not the neatest and he doesn’t wear gloves while serving and taking your cash, but if that doesn’t bother you, then it’s worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwei1xQm5RRRAB",
            "text": "First time today 8/12/23. Got there by 11:30am becuz I was told there's a long line once opened. Get there & while he was open it was closed to the public as Justice Sonia Sotomayor was inside eating. Once she left around 12:30pm, did the line move. It is definitely an experience. It's a small food cart that you climb onto a small area where about 4 or 5 people can be there at a time. Once it's your turn, \"Piraña\" as he is called takes your lechon (roasted pork) order & he uses a large knife to cut the pieces out. Lound bangs and I ordered my lechon with arroz con gandules (rice w pigeon peas). The lechon skin is crispy & crunchy, the pernil is super juicy and tender. The rice has that boricua taste. Amazing experience. You can't eat there, it's all to go. Highly recommend going there and go early. See the pictures."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCa05mb1J3EAE",
            "text": "First things first:\n\nYes, the food is absolutely lip-smacking delicious. It’s most of what I’ve thought about over the last 24 hours, wishing I could go get more.\n\nBut beyond being an incredible chef, the owner, Angel, is a truly hospitable man and has created an amazing community experience around his food. I met several wonderful people in line, there’s music, there’s people laughing, and when you get inside his truck, it feels like he individually invited you over to share a fresh, homemade meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtX1l1MWF3EAE",
            "text": "This was an amazing experience delicious and such a humble man piraña. We traveled all the way from Baja California we loved it He even feeds people for free the people who aren’t so fortunate enough to have a meal daily. 2021 Christmas trip"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdVlhUWdRRRAB",
            "text": "Hacia tiempo deseaba ir\nMe senti super feliz una vibra puertoriquena la guagua\nMe emociono mucho ver el eslogan jibaro puertoriqueno el  de la Pava\nLe pedi de favor un retrato y aqui esta\nWepa ame que mientras estabamos era tan atento a todos\nBest Lechon in the Bronx NYC"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLeHI2eXp3RRAB",
            "text": "A great example of authentic Puerto Rican street food. If you're a germaphobe or aren't vaccinated for COVID, this place probably isn't for you, but otherwise, this is the closest you can get to the best lechon without actually flying to the island. The skin is unbelievably crunchy and the meat is tender and falls apart in the mouth. The octopus salad is also flavorful and well seasoned.\n\nAngel is energetic and friendly as usual, and is always happy to have a chat and pose with his trademark machete."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cU9EYmVnEAE",
            "text": "i give this place 5 stars for everything. this is the best lechon outside of puerto rico. this is an experience. make sure you get piraña a heineken from across the street. the big one. they have lechon, arroz con gandules and ensalada de pulpo (octopus salad). the lines can be long but it’s worth the wait!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxeC1lVWxBRRAB",
            "text": "Angel is very friendly. The pork was melt in your mouth delicious and moist! Food was flavorful. Agree with other poster that if concern for cleanliness then this probably is not the best place. The wait was about 2 hours. Cost for the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPOGVMNGdnRRAB",
            "text": "The pork is incredible, definitely worth going for that alone.\n\nIt's also clearly such an important focal point for people. The line had people.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcXNXb3R3RRAB",
            "text": "Say what you will about the place, guy who owns this spot smokes inside and the place looks like dump but this is LEGIT Puerto Rican food. My boyfriend and I been to many places in NYC and nothing compares to his food. I will def come back here ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbU96Ui13RRAB",
            "text": "The best Puerto Rican food in the BX. Everything he has is delish. Not one item on the menu will disappoint you."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1bktfeFJREAE",
            "text": "Angel is slinging some of NYC's best street food out of his trailer in the Bronx.  Chowed down on mouth watering lechon asado, enselada de pulpo, and camaron criollo.  Sadly I missed out on the mofongo.  Grab a Modelo tall boy across the street, and get on line and enjoy the music and vibe while you wait for the line to snake towards roast pork mecca."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzb01DZGRBEAE",
            "text": "El que busca Lechon en NYC venga a 152St.Whales Ave.. SABROSO!!"
        }
    ],
    "reviews_count": 69
}