{
    "name": "Villano Pizza",
    "place_id": "ChIJ47vz7mb1wokRVocImEd45qA",
    "grid": "BX1",
    "address": "226 Willis Ave, Bronx, NY 10454, USA",
    "rating": 4.5,
    "user_ratings_total": 67,
    "phone_number": "(917) 473-7928",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTGNHdEtiVlZqZDNwMFJUSmlZMlJCV2tZeFlWRRAB",
            "text": "I haven't been in New York for probably 10 years and l used to have pizza almost every week., then l moved to Florida (isn't definitely the same taste)\nBack for vacation l ended up in this modest and great place., and OMG the flavor comes back and at the same time beautiful memories., thank you guys .,\nThanks for sharing your flavors"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRU5tRjFkRzQxYld4U1YxOVliV05OTWtocmVsRRAB",
            "text": "very amazing customer service, pizza always hot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWUxYQTRhMHc0VmxObk5EQldablphWjNSTmVYYxAB",
            "text": "Great customer service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pka2JVUnFTbWhDU0RVNWNHMW9jRTQyYTA4dFZsRRAB",
            "text": "Beautiful pizza I love all the Spider-Man on the wall I love being with my friends here it’s very nice and special to me"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWk1WZEJVRzVZWVV4dlRucG1hV2w2Ym5remNWRRAB",
            "text": "Beautiful place lovely environment I love the spider man on the wall it’s very beautiful and reminds me of my childhood i love the sausage and pepperoni slice I order it everyday good hang out spot and very generous people"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNFYwVmhZbEZRWTNwdVlVWjBSRTV4YTFWVGNFRRAB",
            "text": "The food is good but it just missing a little moisture the garlic knots are small and dry the buffalo pizza need more buffalo sauce"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbVVqZGlZazFJVG5WWU0wUXdkMFp6UnpCNlFYYxAB",
            "text": "Cheese baked to the tray not my garlic nots. Slices could use more sauce and substance.\nOverall pretty cool. Juts a lot of lack of care for the food. !!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsd1dYRjFXVzlHZFhWQlpGUmxTRk5CYm1wMFdsRRAB",
            "text": "All across, the board a good meal. A hidden gem, they have a bbq pizza that’s really a treat. Their other slices are really appetizing as well. Just had a ranch chicken bake slice that really hit. Genuinely good people, and honest service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN0lfM3V3RRAB",
            "text": "I ordered some food here for dinner, and this was my first time ordering from them.  The food was really good, and the service was great.  I ordered a dish with spaghetti, and I got a call back letting me know there was no spaghetti and got to choose an alternative.  The delivery was fast and easy, def going to be a regular spot for me, good to know I have a good Italian spot in the neighborhood."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bDQySFR3EAE",
            "text": "Loved the pizza and the service"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndjZPUUtBEAE",
            "text": "Muy bueno recomendando"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfd3JQQXJ3RRAB",
            "text": "-10 stars"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQOHZPSU1BEAE",
            "text": "Villano Pizza is a great loving community pizza spot since they care about the community. Instead of throwing away good food at the end of the day, they help the community and eliminate food waste by offering the food at the end of the day at very affordable cost ♥. This helps us low income families have food to eat. Thus they are also helping the environment by this. They are doing a sustainable action. Thank you Villano Pizza for your love, care, and heart for community♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYd196T3l3RRAB",
            "text": "I can't eat the food, it's making me feel sick. It smells and tastes old, like pizza that's been sitting out all day, stale oil and the salad is swimming in dressing. The smell of the oil alone makes me nauseous. The owner couldn't say what kind of oil was used. Money wasted."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicTduWFJREAE",
            "text": "Don't order online. They'll lose your order completely and you'll have to call your credit card company to cancel the transaction."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeklHbl9BRRAB",
            "text": "Beyond the outstanding food, the service at Villano Pizza is impeccable. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydU5MTW5nRRAB",
            "text": "Best pizza we ever bought.  Worth the wait and value. Thank you for an enjoyable dinner"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dXEzMl9nRRAB",
            "text": "This is the First pizza place we went to in NYC and it did not fail! We wanted authentic and not something super popular but also really good. This could be the best pizza we have ever had. It’s atmosphere is what you think when you think nyc and your not from nyc. The menu is huge and the prices are really fair. Garlic knots were amazing! Pepperoni slices Amazing, thin and deep = Amazing!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6M092NW9nRRAB",
            "text": "Fresh, local, authentic meets quick-casual bite. Everything is prepared daily and the quality is there in every bite. My go-to is the alfredo, but there's a huge menu and some things change out/in. Prices are moderate and worth the quality. Arturo is welcoming and a family-man to all, this is one of the most consistently respectable pizza spots in terms of cleanliness, service, anything Villanos, I highly recommend!\n\nFresco, local, auténtico y un bocado rápido y casual. Todo se prepara a diario y la calidad está ahí en cada bocado. Mi go-to es el alfredo, pero hay un menú enorme y algunas cosas cambian. Los precios son moderados y valen la pena la calidad. Arturo es acogedor y un hombre de familia para todos, este es uno de los lugares de pizza más respetables en términos de limpieza, servicio, cualquier cosa Villanos, ¡lo recomiendo encarecidamente!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqc2FXelpnEAE",
            "text": "Next time , please make sure the cheese is ON the food… not stuck to the aluminum. Especially when the customer is paying extra for it. None of the cheese got on the garlic knots. I live too far to have gone back for you to fix it, do better next time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdlpMRDlnRRAB",
            "text": "Great Service and Great quality Pizza. 😋"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENFlxTHdnRRAB",
            "text": "Yo esperaba algo mejor esta pizzeria  pero la pizza llegó 2 hora después aparte llego frías sin sabor ni nada.  DUEÑOS TOMEN NOTA EN ESO  eso q somos paisanos de guerrero"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeVliYk9nEAE",
            "text": "Best pizza in the Bronx hands down!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcU12bWtnRRAB",
            "text": "This is the quintessential New York Slice. It's probably the best \"neighborhood slice place\" slice I've had.\n\nThin, perfect char, big, and well balanced and flavorful ingredients that aren't too greasy. Sauce has some tang. Reasonable price. If that sounds like your type of slice, don't miss this place, it may be the best slice you've had all year. I know I know, but trust me.\n\nThe cheese slice and margherita were both exceptional.\n\nWhatever you're doing, keep it up!\n\n(sorry not sorry for the pic, took a bite and knew I had to leave a review)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dl9HSEtnEAE",
            "text": "A Little Slice of New York Perfection - Villano Pizza\n\nFrom the bustling street corners of the Bronx, a culinary gem emerges, capturing the essence of the city within its perfectly charred crusts and delectable toppings – Villano Pizza stands as a testament to the timeless art of pizza-making.\n\nAs I took my first bite, the experience transcended mere dining; it was a journey through flavor and tradition.\n\nThe pizza at Villano's is nothing short of a masterpiece. Each slice is a harmonious blend of a unique texture that dances on the palate, with a seasoning that sings of old-world finesse and the vibrancy of the city that never sleeps. The crust, oh the crust! It's a delightful paradox of crispy yet tender, a golden foundation to the fresco of ingredients it supports.\n\nThe sauce and cheese find unity in their balance, neither overpowering the other. The rich, zesty tomato sauce complements the heavenly melt of top-quality cheese, creating what can only be described as a quintessential New York pizza - bold, honest, and unapologetically delicious.\n\nSupporting Villano Pizza isn't just about savoring their work of edible art; it's about celebrating a local business that pours its heart into every pie. The passion of the chefs is evident in each slice, and it's clear they're not just making pizza; they're crafting memories.\n\nI've had the pleasure of enjoying pizza in the quaint pizzerias of Rome, where the dish is a culinary religion. I can say with conviction that Villano's pizza stands tall among the titans of Italy. It's a slice of New York that can proudly hold its own on the global stage.\n\nTo the chefs, I extend my highest praise: you've captured the soul of New York in each bite, and I can hardly wait to return for another taste of perfection.\n\nVillano's is not just a pizza; it's a New Yorker's pizza, and it's utterly sublime!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5OWVxYjN3RRAB",
            "text": "Moved to SoBro in August and only recently found this pizza. All I can say is, FINALLY!! Such a good pizza!!! I tried 2 square pies and both were fantastic. I loved the upside down spicy pepperoni and I’ll absolutely be ordering again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eVBfaHJBRRAB",
            "text": "Crispy pizza , always made fresh!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdjRpdzVnRRAB",
            "text": "This is the best pizzeria in the area, great service , you could dine in or take out, they also deliver ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0M051dlpREAE",
            "text": "No question...if you live by 138th s.t. there pizza is excellent compared to others,and they are very old school and so friendly and safe.. the very best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0N0x6TGd3RRAB",
            "text": "The slices are fresh. The perfect thin crust every time I order.  Family owned a plus!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dHUyaVJBEAE",
            "text": "Un buen lugar para ir a cenar con la familia"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNk9LcERnEAE",
            "text": "Super friendly pizzeria and the food is amazing!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MGR1bmVBEAE",
            "text": "Literally the best pizza place ever I come here everyday!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMFl6NDhBRRAB",
            "text": "If you’re looking for a nice, thin and crispy pizza place, this is it!!! I stopped by here to check out the pizza not expecting much but this pizza is honestly one of the best I have had in the area.\n\nIt is definitely a family owned business and I love it because everyone creates a great experience. Will definitely be back to try other things on their menu!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadHZPdlRBEAE",
            "text": "Hands down the best pizza and wings in a Mott Haven! The customer service was amazing,  and the space was very clean when I dined in  I love their buffalo wings."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacHJYYy1nRRAB",
            "text": "Great customer service and impeccable food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaZ2JXZTJRRRAB",
            "text": "Literally eat from here EVERYDAY.. The shrimp and broccoli personal pie is IMMACULATE.. Family owned and everybody’s friendly.. Best pizza in NYC"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad3MzM21RRRAB",
            "text": "100% Recomendando la mejor pizza del bronx villano pizza 🍕"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwM1BPa0hREAE",
            "text": "La comida muy buena excelente servicio y las pastas deliciosas no se diga de las pizzas vengan y prueben o pidan delivery  agan sus conclusiones"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKai1IVFp3EAE",
            "text": "Pizzas delicioso espacialmente la del pepperoni"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdHJySFBnEAE",
            "text": "Every time I go to NYC I look forward on trying different pizzas places l, and the pepperoni pizza from here was ine of the best I have had in The Bronx in a long time. So if you are in the area and want good pizza, I recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKN2MzU1dBEAE",
            "text": "WOW!\nThis has to be the best pizza in the Bronx.\nJust walked out with a pizza pie and it was top notch 😁 the friendly lady in front too my order and it came nice an hot .\nDefinitely come in and get a slice 🍕\nI will definitely come and order again and try some of there other menú items"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKM29HVE5REAE",
            "text": "The customer service was great but the pizza is well not that good. Hawaiin slice was horrid!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcXBIZDFRRRAB",
            "text": "Very good pizza, especially the Sicilian and good value."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKek9uM0NREAE",
            "text": "Ordered cuz they were the only place open late while stayin at Opera House Hotel. To my surprise - despite employees not able to communicate as well as I’d hope- got EVERYTHING right, included oregano, garlic powder, parm, paper plates , - pizza was fantastic, wings were amazing , great quality, value, keep up good work guys"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Xzc3MVVREAE",
            "text": "Buenisimo comi el salchicha en jiro sandwich y pepperoni pizza de lo mejor"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSa3JuallREAE",
            "text": "First time and we love it!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSa29xeGZBEAE",
            "text": "My son’s friend Jonathan recommended this place and the pepperoni pizza was amazing. Thank you Villano keep up the great work 👏🏽👏🏽👏🏽👏🏽…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoZ01hLVJ3EAE",
            "text": "This lasagna includes a delicious combination of meat, spinach, broccoli, and mushrooms. The spinach and broccoli provide a delightful texture, while the mushrooms add a savory flavor.\n\nThe layers of pasta are cooked to perfection and the cheese is melted and bubbly. The sauce is a rich and flavorful tomato sauce that you can only get at Villano Pizza. Get your garlic knots, you’ll understand when you dip them into that sauce\n\nThe lasagna is finished off with cheese for an extra layer of flavor. This lasagna is sure to be a hit with everyone who tries it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNXJhRVpBEAE",
            "text": "Pasta is very good. Friendly workers."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCaktuTFhREAE",
            "text": "Que delicia de pizza y comida!"
        }
    ],
    "reviews_count": 51
}