{
    "name": "Mexicocina Mezcaleria",
    "place_id": "ChIJySFE9rn1wokRPae7M19QEVY",
    "grid": "BX1",
    "address": "503 Jackson Ave, Bronx, NY 10455, USA",
    "rating": 4.2,
    "user_ratings_total": 804,
    "phone_number": "(347) 498-1055",
    "reviews": [
        {
            "date": "수정일: 5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjbVpPcUZnEAE",
            "text": "Love this place the flavors they create I have not been to another place that can match if.  Plus they change the look of the restaurant frequently I go at least twice a month. The staff is always nice and friendly"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWFVUaDBjbWd5UjNkd1dIbHNkM0EwVms5V1pIYxAB",
            "text": "Disgusting. No flavor no seasoning very nasty and cold it didn’t taste like nachos and didn’t look like it it was dog food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbGMwOTNUVVpKT0dSR1QxWm5SMWsxUTFKbE0xRRAB",
            "text": "the best mexican restaurant in nyc !!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSVJubExXVzlCY1hOc1JHODFUblprY0VkM1ZsRRAB",
            "text": "When I ordered chicken soup it wasn’t cooked properly the chicken was still pink. I also ordered 3 chicken tacos and I asked for sour cream and all of a sudden the old man wants to have an attitude saying I didn’t ask for sour cream. I was with my group of friends and they all heard me say sour cream. The tacos were cooked with cheese and so tasteless and dry. The tacos didn’t even come with cilantro and onions. He charged me 35$ but the total should have been 25$. Please just go to other Mexican food places it’s really not that good here"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVldWVjVNbGQ0YmxkNlJ6azFZbUp0VkU5c05VRRAB",
            "text": "Ordené el caldo de res por Uber Eats, solo para escupir las primera y última cucharada del caldo para encontrarme con un gusano muerto.\nSinceramente desagradable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGU2FVeFViRFJrZW10RE4xTkhVVVpMWTBVeFEwRRAB",
            "text": "Perfect location to taste Mexican ambience with great fajitas!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSlJWQnpPVm8zU0V4a2JVbzNSVmR4WlRGUVRWRRAB",
            "text": "First time ordering from this place.  Ordered mini quesadillas birria, which I thought they had mistaken for birria tacos, they had the smallest strings of cheese. For the milanesa Torta, the bread was stale and barely any meat. The rice was dry and flavorless. My kid couldn’t eat the huarache (which I only ordered with only beans and cheese.)  you could barely see the cheese sprinkle it on top.The only “okay” food was the French fries. It seemed like they were running out of ingredients when they took my order. Will not recommend this place."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaFYxcG9YMVpaU1VSS1NVOXJTVXRqWlhsNGIyYxAB",
            "text": "Fuimos hoy a comer a mexicococina por primera vez y quedé encantada , todo fue muy Rico y las porciones son super buenas y los sabores. Hasta ahora ha sido la mejor comida mexicana que he cómido en NY ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTk5tVkNiMmhMWms1UmVVUjJNV2Q2YldRelVXYxAB",
            "text": "The host/ waiter was very attentive. He also significantly modified a dish for my boyfriend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRVFYUm5ZM2hTYVRBM2IzRnBSVWhJYzFGNFEyYxAB",
            "text": "I went here yesterday and ordered the chips and guacamole, 3 birria tacos, and a horchata. The guacamole was perfectly seasoned and would say it’s a good size for a party of 2-4 people to share. The horchata was sweet & refreshing during…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTWJrVnpVMlZLYVhwV2JHbEhTbE13WTA1NVFtYxAB",
            "text": "I can't believe I had not been here before. Like why?!!! Their Birria tacos are the best I've had in the Bronx, hands down. The guacamole was fresh, which is a must for a good Mexican restaurant. Our server was awesome, putting us on to some really good Resposado Tequila. Almost all the tables were taken, and I know why. I can't wait to go back and try their flautas, and sopes"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aZlNFcG5aREE1WkhscVNVSk9Na1F5WVZSeVJIYxAB",
            "text": "Nasty attitude by the waiter…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOSE9sSk9jazlleDFRRRAB",
            "text": "I found these guys through MealDeals.app and I was glad I tried them out! Amazing Mexican food and drinks! Highly recommend if you are ever in the Bronx."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLYXhxb2Y3OHBxc2NREAE",
            "text": "I have ordered from here COUNTLESS times through uber eats. Today, I decided to order directly through their website and after an hour of waiting my order was suddenly canceled by this resturant. The DELIVERY was supposed to be through doordash after I ordered almost $100 worth of food so I was notified to call the resturant which I did. I called and they claimed to not have had an order from me and they told me to call doordash which I did but since the order wasn’t through doordash only the delivery they had no trace of the order. I called the resturant back and they refused to give a refund although the order had been canceled BY them.\n\nTerrible customer service; hands down the worst I’ve ever seen in my life to refuse to give a customer money back for something they never received. Will never and I mean NEVER give them a dime again after this.\n\nIf I could give 0 stars, I would."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNRHlsWkM2dXBpYWNREAE",
            "text": "Pedi para llevar y estaba muy bueno, lo recomiendo 👌🏼"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJMkxtZkNpbTUyZS1RRRAB",
            "text": "Hay de todo"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOTDd6dkRraHJiN0JnEAE",
            "text": "Super Authentic! From the food to the decor. Everything was perfect."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQSGd2SWJOaE55ZWVREAE",
            "text": "We live in the neighborhood and liked the neighborhood vibe there.  Food is good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLTQ2V0pnEAE",
            "text": "Expensive and they add the tip themselves without telling you."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cmZmeVJBEAE",
            "text": "Walked\nIn here the man in there at the register has a very bad attitude he doesn’t know how to speak to paying customers had I known before ordering I would have never gave this place my time or money!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3enB2VWV3EAE",
            "text": "Customer service Excellent. Food was delicious definitely recommend 👌"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRel9YT3dRRRAB",
            "text": "Best tacos in the South Bronx!!!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHOXZmOVJnEAE",
            "text": "We dined in the food is good the drinks are ok. But once the Waterbug joined our dinner, I was done!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMFpqeXRRRRAB",
            "text": "Tacos, burritos and enchiladas are amazing! The taste is so authentic. Food is always freshly made and tastes amazing! Do not hesitate to order"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbjVpZkJ3EAE",
            "text": "Its was last day of restaurant week.  My only 2 complaints is the steak Asado  and pest control.      It was overcooked, almost like the cook forgot about it.  I killed water bug crawling on the wall , saw it after the meal.   If I saw it at the beginning,  I would have walked out.    Have no tolerance for the latter complaint."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2Ni12eVV3EAE",
            "text": "I've never been to the restaurant for dine-in, I've been ordering for delivery via ubereats & the food is always delicious 🤤 Love the guac always fresh. My son's favorites are the birria tacos & flautas 🔥"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNXB2TmdBRRAB",
            "text": "Love this spot. Food and the drinks are always on point!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndTc2RUt3EAE",
            "text": "Very cozy! Their tortas are absolutely delicious."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbzVxdzdBRRAB",
            "text": "Excelente comida"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmd1lmOUlREAE",
            "text": "Our go to place always! From the drinks, food and atmosphere absolutely love it!!!! 😍"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfell5Z3dBRRAB",
            "text": "Muy bueno"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eXM2cGZBEAE",
            "text": "Todo muy rico,el queso fundido 10/10 el molcajete super recomendado y también el agua de horchata riquisima y mi favorita el agua de limon. Definitivamente regresare ."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Mk5qTFNREAE",
            "text": "Mexicocina is a hidden gem serving up some of the most authentic Mexican cuisine I've ever tasted. Their tacos are simply divine – the tortillas are handmade to perfection, and the fillings are bursting with flavor. Whether you're a seasoned taco connoisseur or a newcomer to Mexican food, you'll be blown away by the quality and authenticity of their dishes.\nAnd let's not forget the drinks! Their mezcal selection is impressive, and their mixologists know how to craft a cocktail that will transport you straight to Mexico.\nIf you're looking for a truly memorable dining experience, Mexicocina is the place to be."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYa0liOXpRRRAB",
            "text": "Just ordered the Birria Nachos at first they tasted good but then it was just way too much meat and we realized they didn’t provide any pico de gallo like the description said. It tastes good but the meat melted all the chips which also they didn’t provide enough chips. The horchata came in a soup container instead of a cup which was inconvenient since we ordered to go. Overall we spent $29 with a side of guacamole and felt like it wasn’t worth it! $29 with the meat just thrown in the container and not enough chips to eat the meat with and without pico de gallo was a big turn off"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURILWJMNEJBEAE",
            "text": "Ordered delivery and sadly didn’t get 2/3 of my order… no coke and got beef tacos with side of black beans instead of birria tacos with soup. Not worth the hassle."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbE5qb3pnRRAB",
            "text": "They caused us food poisoning and we will never 👎🏽 purchase from them again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcEk3ZU9BEAE",
            "text": "I wouldn't eat in as they clearly want to save money on AC but the food is good.  Honestly one of the better take out spots in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ejY3U1NBEAE",
            "text": "They have gotten so expensive"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dEstTGxRRRAB",
            "text": "Allergies can be very serious, even life threatening. A friend of mine ordered a burrito requesting clearly that no seafood be included in the meal. What happens when she eats it — she ends up finding a random shrimp. People can die from anaphylactic shock when they are unknowingly exposed to allergy triggers.\nThis review is not about the quality of the food, or the atmosphere or the customer service. However, when an allergy is reported, you never know how severe the allergy can be, it should be taken seriously when preparing a customer’s food so the person doesn’t end up having to go to a hospital or dying over even a tiny piece of shrimp. I hope that the cooks and owners of this establishment will do better with respect to allergies."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyXzVtNzFBRRAB",
            "text": "Eran mis tacos favoritos de birria siempre muy ricos, pero hoy fue lo peor que pedí sin sabor los tacos y hasta con un cabello, el consomé nada que ver cómo el de antes talvez cambiaron de cocinero o no se que pasó. Pero échenle ganas en el sabor que ya no es el mismo. Hasta la persona que contesta el teléfono con mala actitud de verdad que pésimo servicio.  👎🏽"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydDdDMUN3EAE",
            "text": "Pedí tacos de virria la verdad son una porque..... no tenían ni sabor ni nada de sal muy malos tacos los peores que he comido no valen la pena los 17 dolares por 3 tacos los bote a la basura son horribles"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybDdpME9BEAE",
            "text": "I haven’t had food poisoning in YEARS!!!! We have ordered from this place several times but after last night never again!! I looked past all of that tiny bones left in my food. But the crippling cramps from food poisoning almost landed me…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyM05id3VnRRAB",
            "text": "Great experience! I wanted to taste a Michelin star restaurants and I did just that.  I would definitely go back!"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaVp5Y3J3RRAB",
            "text": "Excellent si vous voulez sortir un peu des sentiers battus.\nUn quartier assez pauvre mais des gens tellement attachant.\nUn petit parc à coté vous permettra de vous promenez.\nCertain individus peuvent paraitre louche au premier abord mais vous êtes en Amérique dans un quartier un peu profond alors prudence tout de même, restez humble"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnejVHZmRREAE",
            "text": "It was so hot 🔥  inside 😫  I couldn't enjoy my food 😩.  The food was good. I took it home"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeThmQWl3RRAB",
            "text": "Horrible phone order service. \"Call back in 2 minutes!\" Is what I was told then was hung up on."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUOWNycEVnEAE",
            "text": "I have been a customer here for years and this is the BEST Mexican restaurant in all of the Bronx!\nCarnita nachos are my go-to and try the margaritas or Mezcalitas!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeWFLZFNBEAE",
            "text": "terrible service; terrible food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbHVmWTZBRRAB",
            "text": "Cute casual spot. Came here twice for lunch - food was really good both times. Service depends on who is there but wasn’t too bad. Only bad thing was that the drinks we ordered actually cost a little more than what they had listed on their menu but will def continue to come here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMDlMVl93RRAB",
            "text": "Amazing fresh tacos with friendly service. I had the bistec, lengua and barbacoa tacos and they were all delicious! Highly recommend if you’re looking for some good Mexican food in the Bronx"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdTk3RWxnRRAB",
            "text": "Second time visiting this place and this experience was better. I’ve had the steak nachos both times and it was TOP TIER. I ordered the cecina flautas and it was better than most.\nThe burrito was prepared excellently, specify that you don’t want it cut in half. It takes away from the whole experience.\nOverall, 10/10 * chefs kiss*"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLekxXazlBRRAB",
            "text": "Be forewarned that the place is super small, but I think it’s worth it if you want good drinks. The server is actually the one preparing the drinks and he does a great job managing both the customers and the bar. The food can be a little better in terms of flavor, but overall it’s a good date spot."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbi1yc0RBEAE",
            "text": "Decent tacos. Very friendly staff. The meat tacos we're a little dry, though the dip provided with the chips made for some delicious eating. The serving  sizes are generous."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJOVlueWxBRRAB",
            "text": "Can’t believe this hidden gem in the Bronx!\nDelicious huge portions and very fairly priced.\nThe ambience is very authentic and the service is very friendly!\nIt’s been on my mind since and I will definitely go back once I’m around the area."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncUxfWHFBRRAB",
            "text": "I really liked this place. Friendly bilingual staff, a great and varied menu, and a welcoming atmosphere. The al pastor tacos were yummy but a little dry and not the best I’ve had. The dessert options were pretty good, with the flan and…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5aTh5OWxBRRAB",
            "text": "Great customer service with delicious food , small place but sometimes it’s were you find the best tasting food."
        },
        {
            "date": "수정일: 3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5a0tldWVBEAE",
            "text": "These Birria Tacos were amazing! I’ve been wanting to try this for so long and I finally had the ability to and I’m more than impressed on the presentation and taste :) You have the ability to tell them what you want and don’t want as well! If you can also see in the pictures I provided,The Orange sauce is basically a sweet sauce that reduces the spice a little bit after you dipped your taco in the Birria soup. Would definitely recommend to those who are looking for good Birria Tacos! Mexicocina is amazing :)\n\n(Translated in Spanish)\nLos Tacos de Birria fueron increíbles! He estado queriendo probar esto durante tanto tiempo y finalmente tuve la habilidad y estoy más que impresionado en la presentación y el sabor :) Usted tiene la capacidad de decirles lo que usted quiere y no quiere también! Si también puede ver en las fotos que he proporcionado,La salsa naranja es básicamente una salsa dulce que reduce la especia un poco después de sumergir su taco en la sopa Birria. Sin duda recomendaría a aquellos que buscan buenos Birria Tacos! Mexicocina es increíble :)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxLTZTRlRnEAE",
            "text": "Started out great We got our chips fast, the food took forever and the waiter was checked out of reality, nice atmosphere with charming decorations intimate space although the music was a bit overbearing. Server was discriminatory to us cuz we had a coupon, which made us feel very uncomfortable."
        },
        {
            "date": "수정일: 8년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRX09HTWpRRRAB",
            "text": "Es un excelente lugar muy rica la comida y excelente personal de trabajo, se los recomiendo yo vivo en Brooklyn vale la pena viajar 1 hora para disfrutar de este buen ambiente familiar."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURreS02b0JnEAE",
            "text": "Love Mexicosina, food is always great staff is very friendly. Great mole and Taco selection! Deserts are also delectable 💕Amazing owner makes you feel at home!…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpMl83ZDhRRRAB",
            "text": "Viva Mexicocina!  Traditional with excellent options.  Burritos, mole, huaraches, tamales.  Lots of vegetarian and meat options.  Horchatas and agua frescas!  Dios Mio! I'm in heaven.\n\nThe traditional decor is so vibrant, fun and inviting.  Love it here.\nI'll be back!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5aHNhSlhBEAE",
            "text": "I never had a bad experience with this restaurant but today it was just unacceptable. I order nachos and I told them I wanted no Frijoles and jalapeños I wanted everything else that comes with the nachos. They said fine it will be 45 minutes, it came after 1 hour and half. After I received it it was cold and it didn’t had no pico de gallo. I call them because I wasn’t waiting for my food to be like that. I ask them what happen with the other ingredients of the food, he said the pico de gallo comes with jalapeños. I was like you didn’t tell me that when I ordered it. Like he should’ve explained that to me when I was making the order. It came late, cold and wrong. It was pricey and I didn’t even finish it was such a bad experience. I have never written a review ever before, but this experience is a NO for me. Sadly this will be my last time ordering from Mexicocina."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHMEtUUnp3RRAB",
            "text": "I ordered here through ubereats for lunch. Online there is not option to order birria tostadas , only birria tacos with birria soup. I called the restaurant to inquire about instead of tacos getting tostadas with the birria soup. I spoke with the manager and  was told to put Tostadas not tacos in the notes. Not once was I informed of a surcharge or anything like that. Upon delivery there was no consume ( birria soup) I called the restaurant and this is when the manager ( the same man I originally spoke to told me about surcharges and things of that nature. This makes no sense because 1. He could have told me this during out first phone conversation 2. If i ordered wings with fries and got boneless wings instead, my order would still come with the fries, not matter this type of substitution. In no way was this manager apologetic just argumentative. He also hung up on me, and when I immediately  called back he said he did not hang up but there was another call which he never said \"one moment I have another call\" he simply hung up on me because he was wrong. Had he notified me of any surcharges I would have been happy to pay them in order to receive what I was ordering correctly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNHRfTFFnEAE",
            "text": "Reading the reviews, I think maybe you shouldn’t do takeout/delivery. Eating in here was a real treat. GREAT margaritas and very good tostadas and quesadillas."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNVBPdWhnRRAB",
            "text": "Es triste decirlo, pero este restaurante no es el mismo.\n\ncuando los joven estan en el frente siempre me muestran mal genio.,\n\ncon los clientes y escuche gritarle alos trabajadores\nMuy grosero y nunca da las ordenes como debe ser hasta el precio varia\n\nCobra extra por todo\nMe da pena por los demás pero no lo veo bien loq están haciendo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNnBmY1NnEAE",
            "text": "We love this place! The staff are so wonderful and accommodating. We like to pop in for breakfast too. Great coffee and chilaquiles. We order from there too but the ambiance is great so we prefer to go in person. The margaritas are great and strong too."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcllEQUF3EAE",
            "text": "Buen lugar, buen ambiente y muy buena atención. Bebidas 🍸👍🏻, aperitivos 👍🏻…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNTVhR3d3RRAB",
            "text": "Authentic and amazing service.  Food so good I forgot to take a photo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcVl6dkZ3EAE",
            "text": "Excellent tacos and guac! Need to come go back to try the rest of the menu. We ordered delivery so can't say much about the restaurant and service itself. The fish tacos only had a few tiny pieces of fish, that's the only negative. We'll be back."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURONHNTNlJ3EAE",
            "text": "La Comida Está Bien Y todo pero muy poquito para 18$ también en Ubereats dice que viene con Ensalada y no mandaron ensalada 😶"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOOWVMa2F3EAE",
            "text": "Amazing authentic Mexican restaurant in the Bronx"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeklxMHF3RRAB",
            "text": "Their food is real good but their Customer Service on how they treat and talk to their customers, SUCKS. Their service on how they serve and how long they take to serve their customers, SUCKS. They are always LATE on delivering and having the food ready for me to pickup. Mind you, I order hours ahead of time!!!. The old guy(Owner) is very RUDE.\nI stopped ordering for a while. I said let me give them another chance. NOPE! Same service. No Bueno!!! They need to value their customers, All customers. Starting with the owner!!!! We are keeping you in business buddy. Appreciate it!!!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNE03QVRnEAE",
            "text": "Staff was very friendly and accommodating.  They made sure we were satisfied with our meal, and checked on us frequently.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4c09HYVlREAE",
            "text": "My daughter and I love going here for our Friday night dates. Perfect to go kick back and unwind while enjoying great drinks and food.  The waitress always remembers us ♥️ Highly recommend the Parcha Margaritas"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGNmRIMnNnRRAB",
            "text": "Super good food. One of the few of the best and main mexican food places I order from in the area. The rare times I’ve had an issue with my order and I’ve called they have been nice, friendly and understanding and remedy the issue."
        }
    ],
    "reviews_count": 75
}