{
    "name": "Sobro Garden",
    "place_id": "ChIJRRenBdj1wokRDi8_4gjD-bs",
    "grid": "BX1",
    "address": "26 Bruckner Blvd, Bronx, NY 10454, USA",
    "rating": 4.3,
    "user_ratings_total": 166,
    "phone_number": "(917) 398-3400",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sS1JVTjRNVFJrYTBob1gwaG5lRVJYU3pCQlEwRRAB",
            "text": "The hostess who goes by “Nana” was unprofessional and dismissive. The interaction left a bad impression, and it seemed other customers were uncomfortable too. Management should consider better customer-service training and hire new people asap."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbE9WaDVWbk5oTFRBNFpsWm1VbTFuT1hoSmNXYxAB",
            "text": "Came here a few days ago for drinks and the experience was wonderful. I had never had a guanabana frozen margarita before and it was delicious and so was the food. The bartender Shalamar was attentive and helpful when I didn’t know what to choose because they had so many options that I had never tried before, so I would highly recommend this place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTVVHRTBZbnB3U1dwNE0xOUNaa2xMVGtseVpYYxAB",
            "text": "This is a fun place for a party! Drinks are on point and the DJ was absolute fire. I didn’t eat when I was there, so I can’t attest to the food, but the service was fast and friendly!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odFZtdzBWMlJWVXpsemQweElMVGw2Um5wUVFWRRAB",
            "text": "A awesome atmosphere! The music and food was incredible!! Good times!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NWQxYzJNMGRHZDJOWWFEWkZNMFJYUW1zeVVGRRAB",
            "text": "Never been to this restaurant, but was driving by and was suprised that logo is exactly similar to Turkish football club called GalataSaray, even the colors are same lol"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNVdHRlZVRGxxVUVreWNsVk9iVzh6TUVkYWRGRRAB",
            "text": "Attended a bridal shower. Food and service was a 10 plus"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbVNrOUZUWE5TYlRkbUxVcE1Oa05uTkZGMFMyYxAB",
            "text": "I’d give Sobro 5 stars every single time! I'm truly a regular here, and I haven’t found any place that does Puerto Rican food quite like they do. The wait times are short, the drinks are excellent, and the staff is always super friendly. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUlJrRTFNVWxtZW14bVREZElTbWRETWxSNlIwRRAB",
            "text": "Shalimar is fantastic !!! My 1st time at SoBro Garden, it’s nice to see good places coming to this up and coming neighborhood. Shalimar is the best bartender, with the best personality ever !!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4T1UxZFJaMk5SY0ZsRE1WSlBaMEphWXpKSlUyYxAB",
            "text": "Nana, our waitress, truly made my fiancé's birthday dinner unforgettable! The food, service, and atmosphere were all top-notch, and it's clear that the staff genuinely care about making every guest feel special ❤️ Wavy baby birthday"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scFJWRXRUMXBqT1drMk9FTllja0kzTjNaWVJYYxAB",
            "text": "Every time I go to Sobro I have such a great time music is good, there is a great vibe always. Nalene was my server she mentioned her top favorite drinks she also recommended the steak and shrimp with shrimp fried rice. The steak skewers appetizers along with the garlic tostones perfect bite to grab. Her hospitality matched the vibe. I am a return customer I always feel like i  get vip time at Sobro while I’m here.\nNaelen is the best server"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bGFUQkNXVWhFUzJ0WlN6ZHZibGhZV2tjMVUyYxAB",
            "text": "Food and drinks are delicious! They’re very accommodating, considering we didn’t have a reservation. What i will say is pay attention to your check. Our server added the gratuity to our bill automatically, when we asked to double check if it was included she acted like she didn’t notice and said she was going to “take it off” .. but the bill ended up being the same amount? They’re slick, watch the servers. The manager was very attentive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNVJFZDVSbWhvVW1ndFNGTlBXbWh1VVhGcmJFRRAB",
            "text": "When I came to the spot I was a little confused where it was but when I opened the door and moved the curtains.. it was definitely a nice surprise. The decoration and atmosphere felt so alive. We tried the appetizers and had the classics for the entree, it was so tasteful. The meats were well seasoned and tender. I would definitely come back. What I did hope for was a space for dancing because the music was so good. I found myself dancing in my chair."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUVdEVldVR2d0WVZKUU1qbHBjbXRZWW10eFpuYxAB",
            "text": "Suhaily was so great. Helped me with all my needs . She answered every question and was so polite I love her and will be back because of her ❤️❤️❤️❤️🫶🏾🫶🏾\n\nKwame was also so helpful and polite. Bringing good southern hospitality .\n\nJunito was so dope with his encouragement and dope energy.\n\n10/10 would recommend. My birthday was beautiful"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dWNWOHhORkJJY1RkRldFbDZNR3N6V2toRWFXYxAB",
            "text": "It’s always a pleasure to have Joanna as our server. We came back just because of her. She’s honestly the best waitress in this place. Food is good but her service is amazing thank you again"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWVFsWm1abGRvZVd4c05tdEZlbXRJT0Vwd1pGRRAB",
            "text": "Nice place for large gatherings and the manager and wait staff are amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZemJVWmZaMlpuY0hCRVoydEtWV05XU1dkcGFHYxAB",
            "text": "The food and vibes are great here! I came in for cocktails either my friends and we had several dishes while we catcher up."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRldVSklVbXhSY2tkNlJWRm5PRU41TjJSSlowRRAB",
            "text": "The experience was amazing! The food, atmosphere, drinks and service was remarkable. The manager Kwame was like meeting family we had lots of laughs joked all night, he made sure everyone was taken care of. Food was delectable! we had the pork chops w/rice beans and sea bass cooked to perfection with buttery homemade mashed potatoes. The atmosphere was a vibe they have a large tv at the bar great for sports and even have a photo booth to capture the  awesome night. We also had dessert now I'll tell you I'm not a fan of flan nor tres leches but babbyyy!! I'll definitely order it again they had me at the first bite. thanks for the wonderful time we had a blast will return again soon"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWlFtWTVWSGRKTm1rNWIwNWhNMUpDVmxGcWMxRRAB",
            "text": "The food... NASTY. Severely lacking flavor. You can get 10x better at caridad or el valle"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dFkwcHJjekZxZGtWcFgyVktUVXhwYzJJMGNGRRAB",
            "text": "Very cute ambiance and the bartender Celeste is such a delight!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQlZqVXdVa2x2TlhkTVlYVTJYMHhWTFhKcFdFRRAB",
            "text": "We celebrated my mom’s 76 bday here. When I tell she had such an amazing time. The service was amazing. They catered to her every need. The had great photo spots. The music was great and her request they played Bad Bunny for her. The food and drinks were good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TGVVNDJhR1JYYWs1VmJsbHJUVTVMVEdsNlJWRRAB",
            "text": "My boyfriend and I came here tonight and I can’t say enough about our experience this evening! The pernil was 10/10 & our server Leti was 12/10, she was so sweet and welcoming to us, also the atmosphere was on point (great DJ) We are from out of town, very very happy we came across this restaurant 😌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSYU56WmljbkF5VVY4emRHWkRTMmw2ZURVMmVYYxAB",
            "text": "Great food! Atmosphere is a whole vibe. Dancers and all. Great decor for pictures."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NWNVOTNPV3hmUjFKd2NtaHhkV3hLVEZjMloyYxAB",
            "text": "The vibe was great along with the food and drinks. Everything was on point. Live dj playing good music. One of the best places i have been in awhile."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213ek5XMVJWRlp2ZHpndE5ERnZWMEpqY3pGU01GRRAB",
            "text": "I had a such a great experience at sobro garden. The bartender Nayeli recommend the skirt steak skewers and the pernil . It was amazing . She also made me a really good cocktail that was tropical and delicious.She made sure I had everything I needed The server Nalene was also amazing . She came over just to check on me and also made some good recommendations. Will definitely be coming back with my family . Thank you so much for the great service and great food ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRk5ITnBTMFpoYVhSR1dsbGhaamhLYkVWMVVHYxAB",
            "text": "I was there to celebrate my daughter's 21. This is the 2nd time I'm here. The Manager is aces. The reservation hostes was great. My waiter was in top of her game. Very good service. Also big shout to the buss boys..definitely will return.\nThe D.J. WAS GOOD BUT TAKED A LITTLE TOO MUCH AND SHOULD OF PLAYED SOME LATIN MUSIC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rd1ZHeExiMjUwUzJwbFFYcDJiM28zUjBObGRXYxAB",
            "text": "The food took forever to arrive, the owner was highly intoxicated, and the hostess was unprofessional. Other male staff at the restaurant were handsy, flirtatious, and down right creepy towards my friends and I. We will not be back. They allow old men to creep on young girls at this place with no repercussions. There were also roaches outside before walking in"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWk1rTjVhelpzVmw5eVJXaDJVVkJyWTBka2RFRRAB",
            "text": "Food is 6/10, Vibes & Drinks 10/10.\nMy partner had the seafood paella - not good (3/10)\nI had the wings (8/10) & Pernil (7/10)\nThis is a spot you come to for a vibe & apps. The entrees are large but not quality eats."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMk9EUlRkVEpCYUd0WFlUZDRPRWxqVXkxVFNIYxAB",
            "text": "We were a party of 3. I ordered the burger, which was pretty good - tasted of real beef, not those low quality frozen patties that some places serve. The other two steak meals were good as well, though the portion was pretty small. The restaurant is very cute and the music was great, so I really enjoyed the atmosphere. HOWEVER, my low rating is due to deceptive practices when it came to the bill. Our waitress, whose name I cannot recall, but was a brown skinned, female, about 5’4, with short brown hair, noted us down as a party of 4 - which requires a mandatory gratuity of 20%. Then when asked about the charge, lied and said that was not a tip but a table charge. This is all discredited by the menu, which clearly states that the gratuity is added to parties of 4+, by the receipt which lists us as 4, and the fact that the check up pad listed any extra tips as “+7%” - the low range due to the fact that we already paid a gratuity. I wouldn’t discourage anyone from going because I enjoyed my meal and the atmosphere, but I would place VERY close attention to what the wait staff is doing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BM1lUaENMWFJ1VmpsT1dXbFlXVFJCZUVGc01HYxAB",
            "text": "I have been to this location twice and each time, let me tell you the time we had. The ambience in this is dope. It was my first time having an espresso martini and i ended up having 3. It was delicious. The food was incredible. Definitely will be coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUFNGWjNTemxIVkRsQ2NsZFNOekl5TUhWMVJVRRAB",
            "text": "Great Service, Nice Mixed Music. Cool Dancers. Thank You to Jonathan For The Hospitality."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cmQwNUdUR00zUnkxUmQxRTVURWxhY1hKa2MzYxAB",
            "text": "Great food, great vibes and music. Drinks are delicious too! Definitely head here for a fun night or brunch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBelZsZHJXbG95UzNwR09YQmlSMDV5ZEY5dU5IYxAB",
            "text": "Absolutely loved this place! The food was a perfect 10/10, and my drink was expertly made. Service was outstanding, thanks to our very attentive server. The atmosphere, with its great energy and decor, truly made it a vibe. I'll definitely be returning! 🇵🇷 Wepa"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaGNrdGxlbWhsUWpGc1ozWnRiak52YURselZtYxAB",
            "text": "This place will blow you away in decor, ambiance and atmosphere! Extremely nondescript from the outside but when you open those doors and pull away the curtains you will be transported into a beautiful garden like restaurant. Eye candy abounds. It is dark so you need your eye to adjust but that just sets the tone. Went with my wife and brother. Had reservations but it wasn't crowded around 2pm on a Sunday. The menu is a little iPad so finding what you want was not an issue. The drinks were good. My only complaint was the appetizer arriving the same time as entrees. However our server took the 'L' on that one and apologized for not being on top of things. Appreciate the honesty. Take a date or better yet do a 'Coldplay' scenario cause no one will actually see you it's so dark! Between Beatstro, Charlie's and Sobro Gardens, the South Bronx is stepping its culinary game. Highly recommended"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeVR6bGZWekpNV1ZOS01ITXpVbnBVZEhkTmJsRRAB",
            "text": "⭐⭐⭐⭐⭐\n\nSoBro Garden is an absolute gem! The food is delicious, the staff is incredibly friendly, and the atmosphere is just right. The music playlist adds a great vibe—it's lively but not too loud, so I could still have a conversation with my wife without shouting.\n\nWhat really stood out was the service. The waiters were attentive without being pushy—no one rushed us to order or pay, and our drinks were refilled without even having to ask. That level of thoughtfulness is rare these days.\n\nOverall, an amazing experience. Highly recommend it, and we’ll definitely be coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSYU9DMDBaV0V0YVRneVIySXpiVkI1WjFkVlZsRRAB",
            "text": "The place to be if you looking for a good time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSFowMHhhMkYyTURsMmVISnZVRUV0TlZRdGFFRRAB",
            "text": "The server was very attentive and friendly"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRlpFVnFhVkpHTlRWT2MyMHlPWFJLZURkbUxXYxAB",
            "text": "Ask for Yami. She’s dope and gives great suggestions."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OT1YyaFpVMmxRWW5CQmVVZzJVRmhYU2pkcVMzYxAB",
            "text": "From the moment we walked into Sobro Garden, everything was simply amazing. The ambience was warm, vibrant, and welcoming — the perfect setting for a memorable meal. The hospitality was top-notch, and the service was impeccable from start to finish.\n\nSpecial shoutout to Carlos, our waiter, who was attentive, kind, and truly made us feel like VIPs. Kwame, the manager, was equally outstanding — his presence, professionalism, and care for guests did not go unnoticed.\n\nNow let’s talk about the food — absolutely delicious! Everything was beautifully presented, rich in flavor, and generously portioned. Each plate was easily two servings, and even the to-go containers were sturdy and thoughtfully packed. You can tell they care about quality in every detail. And for the level of service and food, the prices were more than fair.\n\nI give Sobro Garden 10 stars across the board — for ambience, service, food, value, and most of all, the people who made the experience unforgettable. I can’t wait to go back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcVgwRXRhM1JWYmxWT1oxZHhMVm81VGpGbGVsRRAB",
            "text": "Joanna was amazing she kept checking on us and always on point! Thank you Joanna."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdmJqWTNZbXMwZWtWRmFIZHFUV3hKZDBOQmFXYxAB",
            "text": "DRINKS 10/10 FROOD 10/10 SERVICE 10/10 JOANNA (jOjO) IS THE BEST I will be back just cause of her  🤗🤪"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSWRFcGlTMG8yTUVOMlFubDVkVE5pVGtab2JVRRAB",
            "text": "Amazing service and good I will definitely come back again went for a birthday party"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NFh6UllZV2RZTlY4NGIxcGlkVFJSYVRacWJWRRAB",
            "text": "Great place service is slow at times but the food and drinks worth it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reGVFbE5VVlp5YUdrMGREbG9UazlCZDBNM2NGRRAB",
            "text": "This was a cute little spot.  Loved the decor and cocktails.  Great good choices too."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMmF5MDJURGR2VEVkU09FeHhTMnhtWm1abWVtYxAB",
            "text": "This place is absolutely delightful. The meal was the size of my head. I had the pulled pork and it was heavenly. I'm obsessed with how cute this place is and the service is top-tier. Take my money. I'm sold."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbmJuZE9TM2N6V0VvdE5IZzBXVzVvZVZaZk5XYxAB",
            "text": "Went here for fathers and had a time ! The ambience and the vibe was amazing on top of the food taking long because it came out fresh the appetizers did save the day !! When it came to our serve Ariel she was very attentive and her energy was spot on and made our experience very memorable! Thank you Sobro and Ariel for making the fathers feel really appreciated on top of your other guess ! Will be coming back for my birthday 🫶🏽"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS1JndGY5bFlQR3BnRRAB",
            "text": "Super happy with my waitress Joanna’s service and the food was also excellent, considering Father’s Day. Definitely will return."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNU1Y1Slc5bVlxT2JnEAE",
            "text": "We had an amazing full experience! Food, drinks and vibes! With the most amazing server, Joanna! (Hope I spelled it right). My very picky parents especially enjoyed it. So great for Puerto Rican’s to have a place that feels like home here in the Bronx."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRmVURnVOMjh5VDB4bWVFNXdVVXhaVEhOdFNtYxAB",
            "text": "The place is really cute decorated well gives restaurant club vibes like most places these days. Music is good some days there’s a DJ very much club energy with food. The people were good energy the staff is kind. I couldn’t stop asking myself about the one large chair at each table but it was there lol. The food was pretty good this is not a cheap spot plates range from 20-30 appetizers are fairly priced. The drinks are $18-25 each fairly sized wasn’t too large fairly good. You will end up spending a good amount so be prepared. Not sure about happy hour but overall good spot. Last thing I think the plates could’ve been more serving size especially since it’s the Bronx but they’re more fine dining route lol oh and I do like the birthday song they sing it’s pretty good energy they shout you out good for large parties"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLdXcxXy1oaWY2YVl3EAE",
            "text": "I actually had a great time yesterday at this location, the food was good, drinks were ok not great, now what I didn’t like was that my server which she’s lucky I forgot her name smh she added an extra $43 for a party of 5 smh and it was only 2 of us, had my man not look thru the receipt on their lil computer thing they have to pay with, she would’ve gotten over on us, I guess she thought we was drunk so she tried to smh that’s not cool at all. So if y’all thinking about going there just make sure y’all go thru that receipt smh"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbXN5WldzNzRpdUhREAE",
            "text": "My friends and I went on 6/7/25 to celebrate a birthday. We were a party of 15. We were greeted at the door by the hostess and seated immediately. The decors is very beautiful. The music was very versatile & the dj really entertained us. Our appetizers came out and we nibbled off of everyone’s plate ( the fish was delectable) because we wanted to taste it all!! The entrees all came out at the same time! Portions were great & the food was made perfectly! My lychee martin was so smooth! I only have great things to say! The service was delightful and they made you feel special! Thank you for everything we will be back soon🩷"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNM0ktYzZ3aEtLRFZBEAE",
            "text": "Omg !!! What an amazing place !!! I had the best time ever! Excellent music with a great variety nice mixed crowd of all ages. I had the best frozen drink of my life and let’s not even get into the food. Every bite was perfect !!! The wings were perfect perfection nice and crispy. I loved the special house salad that had berries and light dressing so fresh and they have valet parking, which is amazing for New York. !!! This is an excellent place to go with some friends for a girls night out or guys night lol or even a fun date spot. They have huge screens that were playing sports and they even had some dancers come out on top of the bar it was so much fun. I can’t wait to go back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbG95NENBEAE",
            "text": "Man, some real highs and lows with this spot!\n\nTalking through the highs first- I really have to shout out my waitress and the service overall! She was attentive and gave so many helpful suggestions on food and drinks. A truly bubbly personality which made me excited to check out the food. Another highlight was the restaurant in general. I'm always hype to try out a new neighborhood spot and it was encouraging to see this place fairly full on a random weeknight. And lastly, the drinks! I caught the tail end of happy hour and tried the frozen sangria margarita. So delicious and a unique take on two classics!\n\nAnd now for the lows- unfortunately I found my meal to be a bit disappointing. For the table we ordered beef skewers which came with a side of mash potatos. For mains I ordered the oxtail meal while my friend ordered steak and eggs which also came with fries and plantains. Unfortunately I found all three parts of our meal to be lacking flavor. Our steak skewers came out sitting in a pool of bloody juices and the rice that came alongside my oxtails were undercooked. I'm hoping we just happened to catch this place on an off night! I love seeing the businesses in this community thrive so I'm excited to give this place another go sometime soon!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM0p2ak1REAE",
            "text": "First, let's start with the server Yrma. She was absolutely one of the best servers I've had and beautiful might I add. I go to eat at different restaurants often but this one by far is one of the best places. The drinks are absolutely delicious and the food is incredible. I TRULY RECOMMEND for those looking for a great Spanish restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuc083bW5RRRAB",
            "text": "Definitely make a point to come through this new spot in the South Bronx on Bruckner. The atmosphere is unique and a different vibe from the other equally unique nearby spots. The staff are very pleasant, have great recommendations, and are the right amount of attentive. (Shout out to Angel!)\n\nOpen late with a great setting and a giant screen for the game, debate, slideshow, etc. Music on point for a Saturday night.\n\nThe drinks of our choice were spot on. We shared the Shrimp Skewers and Catfish Fingers and then had the Paella and Steak & Onions. Highly recommend all four. The Shrimp Skewers were served atop a \"just right\" cooked carrot, string bean, zucchini medley and had stellar flavor. As someone who finds catfish \"hit or miss\" -- I'd have it again! We didn't have enough room to finish the very generously portioned mains and were not upset about it.\n\nLooking forward to coming back and excited to see what they offer when they roll out brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuX01YTEJnEAE",
            "text": "Wow! I am so happy they opened a place like this in my neighborhood. So far my favorite spot now. The drinks are amazing and the food is delicious!!! I loved that I can stop by with my little daughter to get a drink for myself and a good appetizer for her. Is a family friendly restaurant. They have great service! I just love it! I wish they can have a salsa night!!!!! We need it around here ❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMYVV5TXV3bnNqd0hnEAE",
            "text": "Went yesterday 05/17/2025 with my husband. Arrived at about 8-ish and was told we could wait at the bar for a table. Took a while for the bartender to even acknowledge us. I ordered a guava martini and it was so watery. My husband ordered a bad bunnytini and it was ok. We noticed we still were not being sat at a table and when I noticed another group of 2 who came in after us was sat down before us, I told the hostess we were still waiting and she basically had forgotten about us. She told me we “looked so comfortable” she thought we wanted to stay at the bar. She didn’t even ask us before sitting other people down. We were finally seated and ordered our drinks and food. We were then asked to move to accommodate a larger party after we were already settled. I had pernil with moro de guandules and my husband had oxtails with white rice and beans. My plate tasted better than his. The waitress hardly passed by and it was difficult for me to get her attention to order another drink. At the time of paying, we noticed we were charged an extra $22 for a large party and we were only a party of 2. I told the waitress and she told me it was because we were sitting at a table of 4 (so if you decide to come and are a party of 4, you will be considered a large party and charged an extra $22). She did remove it but only after I told her about it. Would I come back? Probably not, but the food was good so I would probably just order the food to go."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRa2MyWi1RRRAB",
            "text": "The food is good, drinks are decent. I’ve been here twice. First time I sat at a table and the service was great. Second time I sat at the bar and the service was not so great. The bartender seemed bothered and we had to flag her down every time we needed something. She didn’t greet us when we arrived and every time we called her over she seemed upset. We had to ask the bar back for water, napkins, drinks, to go containers and also the temp of my steak since the bartender walked off without letting me finish my order. The music and ambience is also great. They have a Photo Booth which is pretty cool."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPR0l0YmpLbmNlb1ZBEAE",
            "text": "Perfect Graduation Celebration!\n\nWe recently celebrated a graduation with a party of 10 at this amazing restaurant, and it was absolutely perfect from start to finish! The food was phenomenal fresh, flavorful, and beautifully presented. Every dish we ordered was a hit, from the appetizers to the desserts.\n\nThe atmosphere was warm, welcoming, and just the right mix of upscale and relaxed, perfect for a special occasion like this.\n\nBut what truly made the experience unforgettable was the customer service. The staff went above and beyond to make us feel welcome and taken care of. They were attentive without being intrusive, accommodating of all our needs, and incredibly kind.\n\nEveryone in our group left happy, full, and raving about how wonderful everything was. If you're looking for the perfect place to host a special gathering, I can’t recommend this place highly enough. A flawless experience all around!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJT1l0N25rM2JHQW93RRAB",
            "text": "When we first arrived, the place was beautiful, and we were excited to dine there. The food was decent, and I really enjoyed my drink. Unfortunately, what ruined the experience—and the reason we won’t be returning—was the hospitality.\n\nAfter we asked for takeout containers for our leftovers, we were still sitting and enjoying our drinks and conversation. That’s when the manager came and stood right next to our table, giving the waiter clear instructions about what to do once we left. It was so blatant and awkward that it completely disrupted our conversation. Moments later, a different waitress came over to ask if we were done with our drinks—which we weren’t.\n\nUp until that point, we were having a great time. But that uncomfortable interaction left a sour taste and made us feel unwelcome, as if we were being rushed out. For a bill that totaled over $200, that kind of treatment was especially disappointing."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbUltY2NREAE",
            "text": "Over all , The food is the same as all his other restaurants. Nothing different. I honestly feel for the amount of each plate. Tortillas w/salsa or bread should be placed on the table after sitting with a glass of water Or asked if you would like a glass of water. We sat on a lower top table So that alone took away Happy hour for us. But it was obvious we were getting served happy hour drinks for double the price. Over all the food was decent place very photo prop service was OK Not a place I’ll visit again not unless someone else is paying lol"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzXzRQZ1VnEAE",
            "text": "I NEED The Bronx to come out and support this restaurant. The taste of the food here HITS!\nWhere do I start? The Mojo de Ajo (garlic in oil with other flavors), it was EXACTLY the taste I wanted. It tasted just like my grandmothers. The Arroz con Gandules, just like my step-mothers, flavorful and light. The Pernil....just heavenly. Seasoned really, really well. In my opinion this meal was best complimented with Tostones just because, why not HAHAHA The atmosphere was amazing. The set up and the lights really made this a nice date night atmosphere. It also has a great hangout atmosphere to chill with friends. It's a very chill, mellow vibe. Our waitress, Nayeli, was so attentive. She always came by exactly when we needed something. It was as if she was reading our mind. We felt personal attention and appreciated every moment. Even the owner themself came over to our table, introduced themself, and had us try a special dish that was not on the menu. The desert did not make it home HAHA. Ohh and the drinks were amazing. Please get the Wepa. It will have you scream WEEEEPPPPPAAAAAA This place will be visited by my husband and I for our next date night, and with my friends for happy hour/girls night."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNDlqUmt3RRAB",
            "text": "It's an amazing, mature sexy spot.  They are great for setting a mood and for private parties.\nI had my dad's repass there, and they were the best to me and my family.\nThey also have shows there."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLSDRqdmV5LTVtLU13EAE",
            "text": "I'm born and raised in the BX and Puerto Rican very excited to come here. Food was ok, there are barely any vegetarian or vegan options the veggies are frozen or canned not fresh. So the food was ok. I had the veggie empanada and veggie fried rice it felt like I was eating the same thing. The Chipotle mayo was just mayo nothing Chipotle about it. Then the Knicks games was on I asked 2 managers and called the brothers owner over and he ignored me, I was asking for the music to continue to play low during the game and they wouldn't accommodate me. Saying I'm one table of many then I told one manager the other tables around me felt the same way and they said yea still they would shut the music off during the Game. No one needs to hear the commentary, Pl are drinking and wanna vibe to the music. The drinks are good better than the food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMM0MxLVd3NjdxXzBBRRAB",
            "text": "We went for my homegirls bday last night ; she had made reservations 2 weeks prior , when we get there they had a hard time trying to accommodate us just because the parties that BOOKED after us were larger so i guess the were given priority , first red flag. Next they have 2 “pre-fix”menus one is $55 , the other that contains seafood is $65 , your whole entire table has to decide on which menu to eat from , you cannot have one or 2 pp order from the $55 menu & the rest from the $65 which i find stupid , second red flag. The DJ ONLY places hip hop and r&b , he would only play one bad bunny song then go back to english music , isnt this a “puerto rican” spot ? Me & my friends were highly disappointed , 3 red flag. When ur bill comes you will be charged a “LARGE GROUP FEE” it was 5 of us & the fee was $101 on top of our bill + taxes. The server had the nerves to look disappointed cus she only got $10 after they charged us an addt $100 for being a “big group” , 4th red flag. We were the FIRST bday “group” to get there & the last to get sang happy bday to & brought their cake too besides the fact that the DJ got my friends name wrong when he did the bday shout out. Im not quite sure how these ppl are still in business , i do not recommend. It is super wack , super boring & PRICEY. Def not worth the $650.00 bill."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOHJ2RktnEAE",
            "text": "It was busy the drinks took a little while to be served. But everything was great even the waitress. Definitely coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJdmJ6cldjeEp6b3dBRRAB",
            "text": "Made a reservation online and got no confirmation that it was made or was ever contacted regarding any delays. Arrived to the restaurant and as soon as you walked in there were many people waiting to be seated. No hostess nearby waited 10…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbE03bFR3EAE",
            "text": "Amazing experience. I had the Fried Pork Chops with Rice and Beans and Tostones and let me tell you. The fried pork chops were one of the best I’ve ever had!! The atmosphere was an experience with high energy. The drinks were the best. The staff were top notch and the attention to detail was elite. I will definitely come back here! Great Experience overall!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMWR2YzZRRRAB",
            "text": "I loved the atmosphere at this venue! The staff was attentive. The food and drinks were delicious."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeWNHZWtBRRAB",
            "text": "Da ill nana and Yami were amazing servers, they made me feel welcome upon arrival. They were super attentive and great conversationalist! If you check out Sobro Garden see them, they also work behind the bar! Great time and vibe!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYjJwdVhEajYyamVnEAE",
            "text": "Great place we will come back. We loved it"
        }
    ],
    "reviews_count": 70
}