{
    "name": "Hudson Smokehouse",
    "place_id": "ChIJyUPhf0b1wokR44CxoVEzKPA",
    "grid": "BX1",
    "address": "37 Bruckner Blvd, Bronx, NY 10454, USA",
    "rating": 4.2,
    "user_ratings_total": 678,
    "phone_number": "(718) 872-7742",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQ1lXUkRORVV0YURkbFh5MUdSMFZIVGtRMk1HYxAB",
            "text": "Stumbled upon this place on our way to volunteering for the nyc marathon. Extensive menu with some great choices. Love love love smoked/fried wings"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TFJXWlBNVGg2ZVRFeGQxa3pUMUY1Ym5GTFRVRRAB",
            "text": "MY FAVORITE RESTAURANT IN THE BRONX HANDS DOWN. Baby… them Brussel sprouts is to Die for ! That pork belly (succulent) That Brisket (AMAZING) That mac n Cheese has the perfect creaminess to it . That cornbread,  I promise you someone granny back there with that Recipe ! 😋 Atmosphere cozy and welcoming 10/10 !  What are you waiting for? You mind as well  come experience this for yourself . It’s unbelievable."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNE1GSnBabDlMUzFCR2RtUjJkVWt6Y0Roa1VVRRAB",
            "text": "Tastes like unseasoned people are playing in the kitchen. The pulled pork had no taste. The barbeque sauce was sweet and bland. The slaw was dry. The green beans were fresh and the bacon was a nice addition as no other seasonongs were used. The macaroni and cheese was decent but not baked as I'd expect from a smokehouse. The banana pudding was ok but strangely devoid of bananas. The deep fried pb&j was disappointing. I didn't know what to expect but I didn't enjoy the strong taste of the oil. To be fair, I've never had a deep fried pb&j so my distaste may be a matter of preference and not the fault of poor preparation.\n\nIn short, I wasn't expecting a lot and somehow still got less than I expected."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsb05rMWxhak5UV0VWa1lUZG5XblZQWW1kUFQyYxAB",
            "text": "Good service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSUxXdExRVEZ1YldGMVluTjNXVU5PVEV4cU4wRRAB",
            "text": "This is my favorite barbecue ive had, and yes ive been to Texas and have had my fair share of BBQ the quality, the consistency. They dont miss, me and my girlfriend order this frequently. I highly recommend it to everybody, they will not disappoint."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKYVNuRnNRV0pRYkdveFptVjBhV1ZuZFU1UGNGRRAB",
            "text": "Brisket was dry pork belly was not that bad but it should be better I don't think I will be returning since I spent $40 and it was below  standard fette sau or mables I'd my standard."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCelJUbHRPR0V6T0hsUE1qZEVWblJLVldNMGExRRAB",
            "text": "The food was mediocre and the portions are small for the money. I went during Happy Hour and the vibe was ok but nothing memoriable. It just happens to be the nearest smokehouse in the area. The neighborhood is mixed now so instead of adding tons of flavor, it feels like the cooks are being modest and it tastes like grilled meat without or little seasoning. I would definitely go off of this block and about a half to 1 mile in either directions for some good flavorful food- Harlem or 1/2 mile either direction. Thank me later."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUE1pMXZWMUYwUVU5RE1VaDVhRzVqZUV3MlRIYxAB",
            "text": "Great place. Love the all wood decor. Love the wings and ribs too"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVmMzSjJSMGRyYmxoNmIwZHFXVWhXVm05VE1YYxAB",
            "text": "The NASTIEST & MOST TASTELESS food I’ve ever had. I regret paying for food and not enjoying it. We had to spit out food into a napkin and threw it all away. Near $60 with tip. I don’t believe in wasting food either. And even the server mentioned the fired a cook and the new girl they hired, people have been complaining how the food taste. She was kind but I wish she warned us ahead of time. I literally wouldnt even give this “food” to someone in desperate need of a meal. That’s how HORRIBLE it is. I don’t know what kind of Gentrified “southern/comfort food” this is but if you are desperate to come here, bring some seasoning with you and say a prayer. PS notice how this restaurant is usually always empty. It’s for a reason."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMFNreHdabHBoYW14Vlp5MWpUVEJ1TVdSWmRVRRAB",
            "text": "I came here for brunch recently it’s $19.99 including a mimosa which I thought was a great deal at first but the burger and fries I had were terrible and burger overly cheesey no lettuce or tomato added or anything didn’t taste good...the fries tasted over heated and stale not good and the presentation was below average..not sure how an establishment can mess up a burger and fries.. it was really bad and not appetizing at all..they need to re evaluate their brunch menu and maybe they shouldn’t offer one if they can’t get it right..The atmosphere also didnt feel inviting"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdFExcDVPVzR0ZEVWWlRHdDFObUZLWjJGaE5VRRAB",
            "text": "Great lunch special deals. Love the smoked wings with classic buffalo sauce. Flavor is great but sometimes they come out a little dry. Still very tasty overall."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wb1JtNDVSRU54TTJ3eFVuVkhSa2RFWWkwelMwRRAB",
            "text": "A bit pricey but food is delicious and excellent customer service"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNFdreHVRbVp0YVcxQ2NWQXhTazkwYmtWM2MxRRAB",
            "text": "La comida no es mala pero tengan cuidado pedi un vaso plástico para la soda y tenia una  cucaracha adentro del vaso. Creo que el local debe de tener más cuidado. Automáticamente deje de comer.\n\nThe food isn't bad, but be careful. I ordered a plastic cup for my soda, and it had a cockroach inside. I think the place needs to be more careful. I automatically stopped eating."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWmQwTm9VMWhyUTBwd056TmFRM2h1UWt4VWIzYxAB",
            "text": "Moving my daughter from Texas into an apartment near by. This place is legit!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcmMxTk9WbGx3WjBKblJXVlpiblZFWm01NWMyYxAB",
            "text": "Hudson Smokehouse did not disappoint! The chicken sandwich was amazing—perfectly seasoned and juicy. The brisket was packed with flavor, and the beer selection hit the spot. On top of that, the service was great—friendly, fast, and welcoming. Definitely a spot worth coming back to!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnNE1GcHNlWEpSU0VsaFRWVndlVmhYTmpkYVVWRRAB",
            "text": "I stopped in for a quick lunch\nTried the rib combo for lunch\nReally enjoyed their ribs\nGood flavor on the dry rub .\nRibs cooked perfectly, falling off the bone good .\nCornbread was good\nBeans were tasty as well\nAbundance of sauce selection\nFull bar ,good service ,good bbq\nNot much more you can ask for\nI'll stop back again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjeWRGRkxhRFI0T0ZWeFIyc3lSRjlvYmpWQmNIYxAB",
            "text": "The food is really good, smoke house burger is a must try! Thr corn bread is OMG! OVER ALL THIS IS GOOD FOOD!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GdVgyMTVSMjltVVRSaFdqTnhXRmxyUkZoU2RWRRAB",
            "text": "Food is horrible and ridiculously overpriced! Do not recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MWVsZGtZMHcwVkhwb2RGSlNYekk0VUZWdlFuYxAB",
            "text": "To be honest with you, the food was below average. The ribs were dry but seasoned pretty good, and the brisket was not smoked at all. There was no smoke ring or a\nsmoke flavor whatsoever. The chicken was ehh, very dry as well but decent seasoning. The baked beans had way too much going on and you really couldn't get the taste or real baked beans. The Mac n cheese had no cheese it was more like a little cheese sauce mixed in noodles, very bland. The cornbread was super mushy and the flavor was ok, i ended up throwing away half of my portion.   I've been BBQing for a very long time and I was expecting much more from this place especially with its name \"smokehouse\" the $60 i spent there was definitely not worth it. Fyi there was a roach crawling on the floor aswell"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdmJWb3dTV3B1VG5oWmR6bDNNR2RETlVKdFdGRRAB",
            "text": "This BBQ and sides was the worst I ever had.   The Mac and cheese had powder cheese.  The coleslaw dry and the meat was tastelessness.   $115 down the drain."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keWVrTTBaV0ZuWm5aVFdVUkxNSGxsU0Zsd2RFRRAB",
            "text": "10/10 for the Hudson Smokehouse!!\n\nWe had an amazing dinner here! Ordered the Jalapeño Cheddar Sausage (perfect snap with gooey cheese and just the right spicy kick), Full Rack Ribs (fall-off-the-bone tender with that sticky-sweet glaze we’re still dreaming about), the Turkey Sandwich (smoky, juicy, and fresh), and the Smokehouse Burger, my personal favorite! That juicy beef patty with melted cheese, crispy bacon, and smoky BBQ sauce was pure perfection.\n\nEvery bite was balanced and cooked flawlessly. Even my picky kids cleaned their plates. For meat lovers, this place is worth every penny. Can’t wait to come back!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNmE3dmVnEAE",
            "text": "Food is consistently delicious. Great knowledgeable staff"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUGNuVnBRbVJyV2pFNVkwSnJNV0p6VkRWalFWRRAB",
            "text": "1️⃣ of the best BBQ smokehouse in the Bronx. Everything I had tried was so good & cooked well. I recommend❕️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMLW5vNWZacXV5Ym9BRRAB",
            "text": "Good bbq hidden in the Bronx. Go for the green beans and bacon!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQYkN2ZlhKMmVEVTJnRRAB",
            "text": "Nice afterwork spot.  The food was hot and fresh. Loved the steak fries and burger. Service was quick and prompt. They brought our food to the table and to go bags"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOWGkzTkR6cl9fRkdREAE",
            "text": "Can’t wait to come back again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPT2tvNWZfM3Z1YWNBEAE",
            "text": "Definitely a go-to in this neighborhood! Great food and friendly staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VONmM0YmZvbkxlQlZnEAE",
            "text": "It feels like an old restaurant that's really popular in an old town it feels nice, the food is also amazing I recommend it for anyone that enjoys bbqa"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKaTFuZENpc3RpUkdREAE",
            "text": "Amazing BBQ in Mott Haven.   The turkey sandwich is amazing perfectly juicy and flavorful.  The service is casual but always friendly and helpful."
        },
        {
            "date": "5달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKTDhvdlBkdFl1OWdRRRAB",
            "text": "Typisch amerikanisches BBQ, sehr lecker, zarte Ribs und mega Smokehouse 🍔 mit Pulled Pork und Bacon. Lecker! 🫶\nSehr authentisch & empfehlenswert!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNUHBxLS1wdnFXdUhBEAE",
            "text": "Wonderful place to have some great BBQ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcTQ4cVdQLXQ3UzVRRRAB",
            "text": "Best pork belly burnt ends!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJamotc2p4N1pMRjF3RRAB",
            "text": "Walked around this new upgraded neighbourhood since 09:45. Tongue dripping for this bar b que food. Mr. Ken the bartender is amazing! You have got to see this new age beer fill thing."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ3R1U2hRRRAB",
            "text": "Place is nice and clean. Good atmosphere. Staff was friendly. Food was really good. Check this place out if you're in the area.i feel it’s worth a trip here"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa1pMUzZBRRAB",
            "text": "food is garbage"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dUtQN0dREAE",
            "text": "The rack of ribs very good mac and cheese not so good the greens are okay"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURROWYtN09REAE",
            "text": "My friend and I went here for lunch yesterday.\nHe had some ribs, green beans, and fries.\nI had a smash burger and fries.\n\nThe food was tasty, and the service was fast. Be aware that you're paying premium prices, but the food justifies the cost.\n\nOVERALL: I RECOMMEND THIS RESTAURANT"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNmRfVHNnRRAB",
            "text": "Brisket was very fatty and pork was hard as hell!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMXVxOUlnEAE",
            "text": "Im from Alabama and it makes me think of home when I walk in. Food is good - alabama sauce could be more authentic but overall all food is on point! Fries are a bit different and really nicely seasoned. Staff also was kind enough to remind me to call in orders to save money rather using uber eats for pick up."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBaWV5ZXNBRRAB",
            "text": "The food used to be really good here clearly they changed the chefs bc the Mac and cheese was so bad this time and forget the rice and the ugliest French fries!! What a waste of money the meat was over cooked so dry!! I loved this place but the last two times have been horrible so I won’t be going back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbHFmQlBREAE",
            "text": "The rib tips and rice box for $10 is the best value. Huge!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMXR1aUJ3EAE",
            "text": "Only smoke house in the bronx and trust the burgers are so good here"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNThXUUpnEAE",
            "text": "The Hudson Smokehouse food was good.  It was the first time I had been there.  I ordered the cookout, which came with 3 meats , 2 sides, and cornbread. The pastrami was so good and juicy, jalapeno cheddar sausage was good. I didn't like the ribblets too much. The pieces I had were hard. The cornbread was very sweet. It had honey in it. The potato salad was tasty but was made with a lot of mustard. We had a great time and would go back. The only thing I didn't like was that you had to go to the counter to order your food.  I guess that's how it's done at Smokehouses. Next time, I will be getting the brisket and pastrami with the cucumbers salad or creamy potatoes, and the prices are not bad at all. The cookout runs you about 39.00 + tax dollars. Sides about $5.75 + tax. I just recommended Hudson Smokehouse to a co-worker, and she's going with friends today after work."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dWJDTkpREAE",
            "text": "The ribs need to be more tender and more season it was dry\nThe potato salad need some relish\nThe chicken need some season\nCole slaw need more sauce and finely chopped\n100% good corn bread\nBeans 100% good\n100% good bbq sauce\nOverall the food was good\nI didn't see beef ribs in the menu"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NXRxTUhBEAE",
            "text": "So I love barbecue food. The meat was love to my mouth.  Really loved the pork ribs the most . Chicken was good but next level when you add sauce . Th brisket was tender but not flavorful. Now let's to the sides .being a chef myself the potato salad was dry and not my type. The mac and cheese I was not  creamy or cheesy .Collards wret ok ."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aHUyMlF3EAE",
            "text": "My new manager held a “meet the team/holiday” dinner here. The staff are fantastic and the owner was onsite to assist the staff. The food was delicious and I highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NTY2Z1RBEAE",
            "text": "Very disappointed in the food now. Ribs and Brisket were okay however, the BBQ sauce makes a big difference and helped bring out the taste and I actually like my barbecue meats without sauce. I had no choice but to use it. The sides were horrible. Rice(tasteless) Mac and cheese(terrible) using rotini noodles might have seem like a great idea but it’s a big no for me personally. Brussels sprouts(all was there was the burnt honey glazed shavings of the sprout) cornbread(terrible) omg the Potato salad all imma say big pass. I used to love Hudson Smokehouse 2 years ago what happened guys???"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOHJ6Q19BRRAB",
            "text": "Great food. Good staff and owner is a very cool guy. One of my favorite spots in the neighborhood"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeHFqWHF3RRAB",
            "text": "Best bbq food I have ever had highly recommend"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzc29LZ1BREAE",
            "text": "Absolutely fantastic. It wonderful to eat chili on a cold day. With beer and brisket, it was one of the best bbq spots i have had in New York City"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbFl1YzZnRRAB",
            "text": "This was our first time at this restaurant.\nI really hope that the quality of the meat remains the same, because it was delicious. My daughter wanted to try a lot of different sides, but I only tried the creamy coleslaw. The fries were great. Most smokehouses don’t have great sides as was the case with this one. I tried the mac and cheese and collards and they weren’t good. My rating is about the meat. My daughter and son-in-law said the drinks were strong! I got the half burger half brisket! Whoa…it was amazing! I could only eat half! The beef ribs are superb. I will definitely return! ❤️ Perfectly cooked great tasting and seasoned meat!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwek15Z2N3EAE",
            "text": "The atmosphere was very cozy. The people working that day was amazing. First trip to this BBQ joint and not the last. The food was very tasty, seasoned just right, the BBQ sauce was vinegar base but I didn't mind it. I prefer ketchup base. The aroma is intoxicating BBQ heaven."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENk8zWnFRRRAB",
            "text": "I went to Hudson Smokehouse tonight and was sadly a bit disappointed with the food. My partner and I ordered the 3 meat weekend special with rib tips, wings, and brisket, and a side of collard greens, Mac and cheese, and cornbread. All of the meat was on the dry end and the sides were almost inedible. The Mac and cheese tasted very artificial and almost had a plastic after taste while the collard greens were better but definitely lacking depth of flavor. The one redeeming part of our meal was the cornbread. Truly 10/10! We also ordered drinks (the passion fruit sangria and mango margarita) and both were good and decently well-balanced. Hospitality and atmosphere were also great!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHdXVyS3Z3RRAB",
            "text": "There is only 1 reason I didn't give this location  5 stars .....and here it is....... Parking.\nThe parking is curbside and subject to NYC D.O.T parking rules and regulations. The owner  counters  the issue by offering curbside  pick and delivery.The service is friendly and fast. I had the pulled pork sandwich and the Brisket sandwich with fries. Let start with\nthe  fries...delicious,\nthe pulled pork..... delicious.....\nAnd finally.\nthe Brisket...... delicious.\nThe prices are very reasonable. I would definitely recommend that if you are looking for a really good meal that will satisfy your taste and your budget... you should certainly check this place out.I will definitely be eating here often."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURielo3TEl3EAE",
            "text": "Seems that some people that wrote 1-3 Star reviews brought their own side of stupid. In my 56 years I’ve eaten a lot of BBQ from my native NYC, New Orleans, Texas, and even Portland to name a few. Such an easy jaunt from uptown and you’re in the South Bronx, if you got to travel more it’s worth the trek. My buddy and I are big guys 6’3 and 6’6 and we placed an order to match. We started with a 1/2 pound of brisket as an appetizer, it was moist and tender. Next we ordered a Full Rack of Ribs between us that was lovingly demolished. Along with that we got full sides, the Cheesy Potatoes, String Beans with Bacon, Collard Greens, and Cornbread. Everything was delicious, my only disappoint was I didn’t have a 2nd stomach. The Smokehouse lager was great to wash it all down, along with a couple of Iron Smoke Whiskeys neat. The owner Kenny and his staff were great fun, they enjoyed our lustful eating a joyful spirits. We talked a lot about how the establishment came to be, there isn’t a doubt in my mind about returning soon. Must say my buddy and I are looking forward to eating our way through the entire menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKM3Z2RllnEAE",
            "text": "My friends picked this up for dinner and it was my first time for my bf and I. We liked their ribs but we def. didn’t like their Mac & cheese. Totally didn’t taste like baked Mac & Cheese! I was told that their burgers and henny wings are pretty good and their drinks are strong! Overall we liked their food! I would def. like to try a burger and wings from here along with a drink the next time I order!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiajczcHhRRRAB",
            "text": "I came there for lunch. nothing special about the place and service. there were 3 people at the bar already and their cups were empty even though they had food. It looked like the staff didn’t care if they wanted to drink. It was like that with me also. I will say the Iced tea was strong and flavorful not overly sweet.\n\ni ordered 1/2 pound brisket that was stringy and kind of lean. I felt like they were kind of like “here is your food”. no attempt to upsell or even sell.  they had a sports show on all channels. that guy on tv seemed more interested in capturing my attention.\nin hindsight I should have went home and just had a tuna salad and watch the boys.\n\npeople were there a young lady was being lively. but staff I do not know. maybe it was me.\nI went to the bodega next door and bought an hagen daz ice cream bar the guy there seemed more hospitable even offered me a knapkin."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeE9xOEJBEAE",
            "text": "The Hudson Smoke House is a hidden gem. All the food is amazing. The place has a great atmosphere and is always clean. The staff is great and takes really good care of you making everyone feel like regulars. Bar is always well stocked and the game is always on"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNTl5NV9BRRAB",
            "text": "My favorite part was the Piña Colada, it might look nasty and sloppy but after i stirred it, it was delicious. The wings, burnt ends and fries were mediocre, i’ll probably never come back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXX1lhSjFnRRAB",
            "text": "Looking for a nice low key place with good food? Then look no further, Hudson’s smoke house is the place. The staff was inviting, the food was well seasoned and cooked to perfection. I was thoroughly impressed by this place, the smell of seasoned smoked meat as you I walked through the doors was absolutely mouth watering and the food did not disappoint."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNTh6c2RREAE",
            "text": "I was here for dinner. It was a great atmosphere in the restaurant, the food all was on, everyone had a few drinks and it has a nice vibe. The food was quick to come out and was reasonably priced. The Mac n cheese was very average and there was a lack of a smoke flavour within my meat. Overall an average experience."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDcGN1LW93RRAB",
            "text": "Best BBQ spot in town! My new favorite spot to stop when I'm in the Bronx. Amazing food and a wonderful staff. I'm a truck driver and live 3.5 hours away in Lancaster,Pa. I will be bringing the family up here to eat this BBQ!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLM3R6TUtBEAE",
            "text": "Hudson Smokehouse has great brisket! Love the coleslaw,beans, turkey,and probably the best mojito I've had since being in the Dominican Republic. The staff is great as well! Knowledgeable, courteous,and professional! Have, and WILL CONTINUE to, recommend this place.\n\nLast time I went I had the Half pound smash burger and fries,with creamy Cole slaw."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMzZpcW5nRRAB",
            "text": "Brunt ends!!!!! One bite of this delicious meat and you will be hooked!! I'm planning to go to Texas soon and I have researched so many BBQ locations and haven't came across any with Burnt ends, hats off to the Owner and the staff for making Quality BBQ everyday.\nPro tip - get a Bun on the side (it's pillow soft) place a couple pieces of burnt ends in it add there Cole slaw and let it rain BBQ sauce all over, one bite  and you will be hooked just like me!! Ohh and they also have the coldest IPA 🍺 to wash everything down."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib2NlbEpBEAE",
            "text": "Second favorite place after Dino BBQ! Hope they bring a location to the north Bronx. Highly recommend the brisket and cheesy potatoes. And the cornbread is A+. It got smoky so don’t wear anything you’d care about smelling like bbq for the rest of the day."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKN2VHLU13EAE",
            "text": "Ask for the secret menu, deep fried peanut butter and jelly sandwich with added brisket or pork belly burnt ends….. it is simply amazing; life changing. Nice owner, friendly service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhbW9HVm13RRAB",
            "text": "I’m a bit disappointed in the Mac and cheese. Had no flavor. Smoked rub henny wings definitely will order this again and the cornbread it was more of a pound cake had some type of glaze which in my opinion no longer was a cornbread. It was…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4OGJLa3RBRRAB",
            "text": "This food was delicious. We actually placed an order for home delivery. The pastrami sandwich was delicious as well as the French fries (some yummy seasoning, I shared fries). My mother also enjoyed the creamy coleslaw. Only reason I didn’t…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNob2RfN0xnEAE",
            "text": "This is a great place.  The ribs fall off the bone! The corn bread is so good. I loved it definitely will be back. Forgot to take pics s, so.e food is gone !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbW8zOU53EAE",
            "text": "The place was nice but you had to order your food at the front and it's brought to your table which was different for me. Their wings are really good ESPECIALLY their HENNY wings! I wasn't to crazy about their sides except the cornbread and their bbq sauce was some of the best I had👍🏾 💯"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeS03bm1RRRAB",
            "text": "Umm $18 for a regular grilled chicken sandwich and $18 for a burger  I thought it was a good deal thinking that it would come with French fries. No fries just the sandwich. The chicken has no flavor and the burger is overcooked."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeHFlT0pBEAE",
            "text": "Great service and wonderful BBQ.\n\nWe got brisket, ribs, pulled pork, Mac and cheese, vinegar coleslaw, baked beans, and the deep-fried PBJ.\n\nLet me just say: everything was delicious.  If I had to point out my favorites, I would say the pulled pork, brisket, and the fried PBJ.\n\nTo add to this, the brisket came with a piece of burnt ends which was amazing and will be something I order next time I go.\n\nIf I had to choose a weakness I’d say the baked beans lacked a little flavor and the coleslaw could’ve used more vinegar. Good nonetheless."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwc2V2Y1h3EAE",
            "text": "Food is flavorless no salt no nothing😭 I could get a better meal at a deli than here for cheaper and enjoy it 10 times more. This place is for people who have never had barbecue in their life. Flies every where I’m battling while eating. The only reason my plate looks eaten is cause I don’t wanna waste my money😭😭"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHN01fQTVnRRAB",
            "text": "Favorite spot to go for a quick meal and drinks 🙌🏼\nI wouldn’t recommend the Mac and cheese but the collard greens are sooo good! The table sauces go perfect with your meat choice. 2 frozen margaritas in and I’ll be a little drunk 😂 ! Great location as well.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeXVQMlV3EAE",
            "text": "Great place, who would know that NYC has good BBQ !\nPulled pork sandwich with generous serving of pork, great coleslaw (very vinegary) which I like and good fire roasted corn."
        }
    ],
    "reviews_count": 75
}