{
    "name": "El Rincón Boricua",
    "place_id": "ChIJAWZ1-Jz1wokRqD_ub3QV8A0",
    "grid": "BX1",
    "address": "622 Melrose Ave, Bronx, NY 10455, USA",
    "rating": 4.1,
    "user_ratings_total": 32,
    "phone_number": "(718) 483-8355",
    "reviews": [
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMm9PVlJBEAE",
            "text": "I went for lunch got two lunches white rice, beans with baked chicken also yellow rice mixed with pernil and pernil, yuca and guineo alcapurrias it was delicious. They have their own homemade mayo ketchup sauce and mojito. Everything here taste homemade and fresh I can't wait to go back. In the Bronx it's difficult to find good Puerto Rican food like this."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wc1NHeHpMVUZ2YVZRNGN6RlNSRlJ6V0RJMlZVRRAB",
            "text": "Un pedacito de Puerto Rico aquí mismo. La comida tiene ese sabor auténtico de nuestras abuelitas, cada plato lleno de cariño y tradición. El trato es igual de especial, como estar en la sala de tu abuela conversando con familia y vecinos. Somos de NJ y sin duda vamos a volver. ¡100% recomendado!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsc05rUkVkak5NWkhRMWJsbEdSRFZTYjJkUWMzYxAB",
            "text": "Comi alcapurrias, muy ricas. Tenia tiempo q no comia. El bacalaito muy malo me lo dieron quemado. Las mollejas von guineitos no estaban tan buenas pq tenian mucho vinagre y usualmente no se comen tan acidas. No probe el arroz ni habichuelas guisadas ni carne. Pero cuando lo haga lo añadire aki."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWk5VOXdOVmh3V2tWT1pFazRUMGRWTjFwdlFsRRAB",
            "text": "Food was edible but it was lacking quality"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLbXo4TUxhdXZfSkJBEAE",
            "text": "Ordered alcapurias from there for the first time, the meat inside was half raw. They were very greasy, soggy and tasteless."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLUV2SW40eWFHN2V3EAE",
            "text": "What can I say I wish I had hours to say so much. From the warm welcoming from the staff to the best service of food the portions are more then you can ask for and so affordable. You can tell they cook with love the food hits home when I first came I cried after tasting the food because I haven't had a real meal in years and my mom passed from alzheimerz in 2023 the food brought back so many memories of my mom's cooking. The owners the staff are so nice and respectful made me feel at home food so good my toddler loved it. Once again all at an affordable price I definitely recommend them spread the word because this needs go world wide I just want to say thank you ,thank you so much now I know where to go when I miss my mom and when I want to feel like I'm home ❤️ I mean it from the heart from Jaycee"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOREJ3b21vXzRicUN3EAE",
            "text": "They make delicious sweet plantain canoe."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNva2N2MTVnRRAB",
            "text": "Excelente servicio"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMWFyZllnEAE",
            "text": "The food taste bad, smells like it’s old and reused."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdXVfeXdBRRAB",
            "text": "The dinner is delicious, very good. The service is excellent, very kind and attentive. 💯 Recommended ❤️❤️"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNDc2T09nEAE",
            "text": "Puerto Rican food on the block!  I have to be honest! they have delicious food but they might need to be graded to make sure food isn't old . they seem clean and hygienic! and food is 👍 good"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbHZUN01nEAE",
            "text": "Arroz desabrio Alcapurrias crudas y saladas\nChicharron  sinpartir suave el cuero no ponen nu un pedaso de Limon,\nPastel duro y frio."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMFo3ZWtBRRAB",
            "text": "Best food in the Bronx !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMU11aVRBEAE",
            "text": "Excellent food and great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibXE3X1JREAE",
            "text": "this is such a cute restaurant. my partner and i love their food. great people! awesome food, feels like i’m eating my family’s. they definitely take care of their people. highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNDZ2OUp3EAE",
            "text": "Love it Love it delicious OMG I will be going again"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eG9QV1Z3EAE",
            "text": "Me gustó el mofongo, como el de PR, riquisímo y suave, no duro. Los sorullitos de maiz, me hubiésen gustado más si la masa hubiése estado más suave.  Les recomiendo si pueden mejorar, el servicio de delivery, pero para el restaurante recientemente haber abierto, lo recomiendo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5Z0pMUTFnRRAB",
            "text": "I stopped by after work and eat dinner, the food was good, the servers were nice, the restaurant was clean. And their prices are competitive. Will definitely come again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cTkzYXhBRRAB",
            "text": "We were a party of 8, they made us feel very special on arrival and although it's a small spot they put some tables together and even served us some treats prior to ordering. I was surprised on how good the food is. All Spanish spots everywhere have the same bland beans, but here you can tell they give it some home love. They were great! Portion size was great and prices were also very reasonable. They even played great music. Felt like I was at a relatives home, not a restaurant. So refreshing,Can't go wrong here! We're all coming back:) next time I'll take some pics."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkb3ZlaThBRRAB",
            "text": "I’ve had various dishes and really enjoy the delicious foods.\nDecent size portions, good flavors, well seasoned, good location, recommendable place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdDZyMW1RRRAB",
            "text": "If I can rate this place a 0 I would my coworkers and I ordered from this place during our lunch time we remembered the man giving out menus we saw the reasonable prices and thought, we would give it try. I ordered a chicken wrap which contains breaded chicken cutlet mozzarella cheese it came  with shredded pieces of rotisserie chicken that contained bones inside and it had a different kind of cheese tons of sauce and barley even meat instead of calling to let us know that there weren't any chicken cutlets they made that decision on their own.  We called to fix the problem and they allowed us to reorder and send the food back, so we decided to get steak tacos. the tacos were the absolute worse I ever tried. flavors, presentation everything was horrible I hope I don't get food poisoning. rotten sour cream disgusting green sauce I would never go here or order from here again 0/10!!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdnB6SGxRRRAB",
            "text": "Food was.         overcooked at 1130 am.. the taste was okay. Will not be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcHNLc0x3EAE",
            "text": "Super taste I got my best roast pork in the neighborhood!!"
        }
    ],
    "reviews_count": 23
}