{
    "name": "Ruinas de Copán & Bar",
    "place_id": "ChIJxU_sN8b1wokRxf2XpZt9vrg",
    "grid": "BX1",
    "address": "483 Brook Ave, Bronx, NY 10455, USA",
    "rating": 3.9,
    "user_ratings_total": 371,
    "phone_number": "(718) 585-6473",
    "reviews": [
        {
            "date": "2주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eWFuQkZXSEJLVDB0V1drdFJVWGRrTWxacE5FRRAB",
            "text": "Fue un asco pedi un pollo con Tajada y las tajadas estaban crudas el pollo nada mas era pellejo un asco me siento tan mal que puedan vender la comida tan desagradable no pude comer nada  y fue primera vez que pido pollo de este lugar tan bien"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscVJqZDNkazlOTnpOcmIwb3hYMEZCVVhsek4zYxAB",
            "text": "Went early this afternoon to order food and as I’m waiting me and my partner finds a big each crawling on the tables and walls disgusting left right away"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnemYyT2RREAE",
            "text": "Good baliadas I give them credit"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N0pudkd3EAE",
            "text": "Pésimo servicio ,comida desabrida y sin sabor ,pedi un juego de tamarindo estaba horrible y no me lo quisieron cambiar🤮😔"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbTViMjdnRRAB",
            "text": "Faith Temple Apostolic Church"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNnEyNGNREAE",
            "text": "No tiene autentidad en la comida hondureña"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREM3RmamNnEAE",
            "text": "Yo no volvi este lugar desde que la dueña le pregunté que costaban unas cemitas no las compré y siempre me las cobro asen 4 años 5 dólares m cobro y no las pedí sólo pregunté el precio la llame le reclame y me dijo cuando vuelvas t los…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbjlDTVhnEAE",
            "text": "I honestly hate to do this, but I am just over this place and the way they deal with there customers. Food was cold, they over charged me from the price of the menu. They did my order wrong, and this isn't the first time no matter how much you tell them how you want your food. They still get wrong.After they over charged me. My bill was almost $100. I go to pay with my debit card, they don't advice me that I will be charged extra for using my card, because they are to cheap to pay the merchant fees. The owner,it's like it's enough that I just spent this money for cold food, and nothing came at once. She still is throwing down my throat, to buy chica from her.This place is ridiculous. It's unfortunate how they just lost another customer.I politely ask for the food to go, and and an order. They literally made packages every damn thing together and created one big mess,sauce and all! I don't recommend this place. Oh, did I mention that the owner(MARICRUZ)will harass you with buying her chica."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkd00yUGVnEAE",
            "text": "Pakistani wedding ceremony Royal Albert palace in New Jersey"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObXItaUhREAE",
            "text": "Brawl stars"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcjdYOHpnRRAB",
            "text": "No again comida fea y carísima un pollo con tajadas a 24$ carne 22$ 2 sodas 63$ dos personas . Nos asaltaron sin arma hahaha"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsOWJielZ3EAE",
            "text": "Too many guys just hanging outside couldn’t enjoy my food"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaeC1xOGt3RRAB",
            "text": "No me gustó, nada parecido a la comida hondureña y caro 🥲"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwXzR6OXh3RRAB",
            "text": "Una vez fui con mi familia y pedi pollo con tajadas y lo que no me gustó es que el pollo sabia a pezcado como que frieron el pollo con el mismo aceite del pezcado eso no me gustó ni a mi ni a mi familia."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLVBMLWl3RRAB",
            "text": "Super Nice!!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocDVmMVJBEAE",
            "text": "Delicioso"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocmJybHJ3RRAB",
            "text": "Muy chévere sero rasisno"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobHFxeXJ3RRAB",
            "text": "He probado comida hondureña, pero estos platos son una verdadera delicia 😋 con gusto volveremos ✨"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodkppODB3RRAB",
            "text": "Good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMzczWVZREAE",
            "text": "Went for dinner on a Saturday evening and the place was turned upside down. Tables and chairs were everywhere and on top of each other. Pupusas and baleadas were OK. Neighborhood is very sketchy ... Beware"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCNHNMUEhnEAE",
            "text": "The conch meat soup is delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtN1p5OFpREAE",
            "text": "Good service ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcllPTVBREAE",
            "text": "Great time"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNk5LTTRRRRAB",
            "text": "Yes yes yes. This is a family of culture food dance music and love"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNTUyWlV3EAE",
            "text": "💙💙💙…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlamRyWG5nRRAB",
            "text": "I LIKE the food here, but I came on a Sunday night and ordered their rice and beans and they gave me old rice. I'm Hispanic and I didn't even have to try the rice to know just by looking at it you knew it'd been reheated a few times."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1LWVfY293RRAB",
            "text": "Buen servicio"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dU5DWUlnEAE",
            "text": "The food is outstanding."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bC1YeGtBRRAB",
            "text": "We were looking for some Honduran food when staying in the Bronx which is how we found this spot.\n\nMy husband and I shared:\n- Pupusas Mixta\n- Baleada huevo con Chorizo\n- Pollo Frito al Estilo Hondureño\n\nThe Pupusas and Baleada were both fantastic. We got delivery and the Pollo Frito was kind of soggy. I'd love to try it fresh in the restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeE9pT3hnRRAB",
            "text": "Ok"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdHJUTFZnEAE",
            "text": "Ok"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvby1EMERBEAE",
            "text": "HONDURAS 🇭🇳\nEat the World NYC review:\nCome on the right Saturday night to Ruinas de Copán and you might walk into a performance by famous Honduran Garifuna band Bodoma, playing into the wee hours of the morning. Come a little earlier on that Saturday, after the lunch rush, and you might see the woman running the dining room also catering to her children, feeding the baby and letting an older son hook up a video console to one of the flat screens.\n\nFrom breakfast in the morning until the early morning of the next day, this Mott Haven restaurant goes through quite a bit of change and caters to the needs of just about everyone. Besides Hondurans and Garifuna people (groups that have a lot of overlap), the restaurant has the entire neighborhood in mind and does offer other meals, but the focal points of the menu have a distinctly Honduran feel to them. The two photos on each side of the name on the restaurant's awning might best describe what is inside, the flag of Honduras, and a bucket of beers.\n\nI was here for the flag and in that respect, the food. The antojito most synonymous with Honduras is certainly the baleada ($3). Here the fluffy tortilla steals the show as it should, the savory beans, cheese, and cream inside play backup. These beauties have an eating culture very similar to what tacos have in México, find them sold by vendors on the street, out of front windows in restaurants, or sit down for them at lunch and dinner."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDMVk2dGlnRRAB",
            "text": "FRESH FOOD, GREAT CUSTOMER SERVICE! ALWAYS CLEAN, AND YOU WON'T BE DISAPPOINTED AT THE PRICES ! AFFORDABLE !"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXN3VmaVJnEAE",
            "text": "Estuvimos investigando donde servían las mejores baleadas y Pollo sucio (platos típicos Hondureños), pero la presentación pobre, not so tasty, mal costumer service, el tiempo de espera fue apropiado para la orden. La ambientación del lugar asusta, definitivamente no es un lugar para visitar en familia. Nuestra orden fue: 3 baleadas, 3 Pupusas y una orden de pollo frito."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXaWFxM3lRRRAB",
            "text": "They serves are really bad I beth here same 3pm is. For pollo chuco is all ready 3:30pm  I'm still waiting for the for ether they higher new cook he very very slow to serve the times is was fast but now is no good not a happy customer next time 6 vecinos the fast in service....."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aXZuUkFREAE",
            "text": "This is a Honduran spot that'sin Mott Haven! Named after a municipality in the western part of Honduras that borders Guatemala, Ruinas de Copan is a Honduran delight that can be found in the Mott Haven neighborhood of the South Bronx. The menu at this homely restaurant is HUGE; I couldn't believe how large the selection of dishes was! Since we were on a food crawl, we just got one dish, so we shared the sopa de mondongo, or the mondongo soup, along with a freshly pureed passion fruit juice. Sopa de mondongo is a soup made from diced tripe that is super slow cooked for hours, along with various vegetables. Here, you can see we have some yucca, carrots, onions, and potato. The soup definitely tasted like it was simmered for hours on end, with a really deep, chickeny, porky flavor, and the pork was just fall off the bone. The tripe was also extremely tender, and it was clear that it was well cleaned and prepared. The passion fruit was also extremely refreshing and tart. We requested that they not add sugar to it, so if you don't want sugar, make sure to tell them no sugar! Service was really fast and friendly, plus they have indoor as well as outdoor seating."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2eGVxaDRBRRAB",
            "text": "Pupusas were nasty. Had chunks of meat in them. They gave us some weird salad which was way too salty and no traditional red sauce. I ended up throwing the food away."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MHRtdXJnRRAB",
            "text": "Service was very slow considering it was practically empty. Food was basic Central American dished, mainly from Honduras. On the pricey side. There are 2 pool tables in the back. The bar looks big but I didnt pay attention to the variety of liquors."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhMXJXY0dBEAE",
            "text": "Top notch, real life Honduran food. My son had Mondongo. And I did not. But he loved it! I had a taco and beans and that was adventurous enough for me."
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZcjZ6aDdRRRAB",
            "text": "Yo soy catracho y andaba de visita en NYC vine con mi novia para darle a probar baleadas pero muy mal el ambiente. Parece más bar que restaurante con la música muy alta. También se tardaron demasiado en darnos la comida. La área dónde está ubicado también es mala muy peligroso."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzeFpMa0VREAE",
            "text": "This is the best Honduran place I have found in NYC. The menu includes all the Catracho staples. The baleadas are amazing and for me the ultimate comfort food. You can also buy rosquillas, cemitas, zambos and gusta as! The service is also great!"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDa2N6R1FnEAE",
            "text": "Lo visité y compré para llevar pero desde que llegue la atención horrible... La señora que esta encargada o no sé si es la dueña pero la verdad que ofende su manera de hablar y tomar la orden... Pero me aguanté pues queriamos comer comida…"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJcjgzOWVBEAE",
            "text": "Malo el ambiente solo musica africana punta eso es anti cuko\nLos menu tienen un precio y te cobran otro mucho monóxido de carbono por las jukas que fuman alli cuando uno sale de alli le arden los ojos x L monoxido"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwMHVDTnJ3RRAB",
            "text": "Para hacer 2 baliadas y una orden de pupusa se tardan 35 minutos y todavia preguntaba y no estaba lista personal muy lento maricruz deberias de contratar personal serio y con capasida porque son lentos mejor 6 vecinos"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3c2Y3akh3EAE",
            "text": "Arrived at 8 because originally it said here in Google that they opened at 8. They were closed. Went on their Facebook page & saw that they said they opened at 9. Waited till 9 the business was still closed. Waited again till 9:30 AM they…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBOWNUcHJBRRAB",
            "text": "Seems more like a banquet hall but is actually a Hondurian restaurant . Great beef baleadas or if you just want to have a few beers.…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcXVqcmh3RRAB",
            "text": "La comida es muy buena, todo lo que he logrado consumir me ha gustado mucho, pero el local no es atractivo, pera tan buena comida."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4dFphT0hBEAE",
            "text": "This place is extremely rude! I called to place an order and after they took my address the lady hung when I was ready to pay and pretended she didn’t understand what I was saying after fully repeating my address to me. Overall told me I couldn’t place an order because she “didn’t speak english”."
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvdU9mXzhnRRAB",
            "text": "La comida es buena, el ambiente es un desastre créen que todos tienen los mismos gustos, no es un lugar al que pueden ir con toda la familia a comer. Otra cosa la vieja chuca cobra de más. Insulta la inteligencia de las personas."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDeGM2Tkp3EAE",
            "text": "Best Honduran food around! Service was also great and prices were very affordable. A mist go again spot...loved the Horchata!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtM0x2c09REAE",
            "text": "Buenas baleadas y comidad hondureña eh ido par de veces con compañeros despues del trabajo puede jugar billiard mientras esperas por tu comidad"
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcnNxY2xBRRAB",
            "text": "Pues la verdad me encantó porque la comida tiene un toque y un sabor auténtico hondureño la tensión fue exelente"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0NDZycUZnEAE",
            "text": "Good food got to try it. So tasty and different from other restaurants I recommend eating here."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLdHRyMEZREAE",
            "text": "Muy buena comida, su sabor increíble y desde mi punto de vista tienen la mejor limonada en ny"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdjR6clR3EAE",
            "text": "I had so much fun the people treat you with respect and they have patience, I loves the food"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdU1LYUp3EAE",
            "text": "Very nice ambiance and environment the food was delicious definitely a place I'll visits again......"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwX2JQVW13RRAB",
            "text": "Great place. Baleadas son buenisimas. Estaba vacio. Bueno un lunes q mas se espera. La comida es buena. Lo recomiendo"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwb3Rxc2FREAE",
            "text": "ehhh , 6 vecinos is better. Here the fried beans in the baleadas have no taste at all. nasty"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLbk1pS1NBEAE",
            "text": "really good food people are really nice here u should go and try it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxX3FtSHBRRRAB",
            "text": "Delicious, great Central American food!!!\nSo tasty & affordable 😩🙏🏼…"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4LXZXQmxBRRAB",
            "text": "La mejor comida hondureńa en el bronx, lo mejor de lo mejor, pedi una sopa marinera deliciosa, buena atencion, lo recomiendo, no dejen de visitarlo..."
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVN2VYQjdnRRAB",
            "text": "Muy mal,  los dueños cobran lo que se les da la gana y no se rigen por los precios de la carta pésimo servicio"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXOUl5ZVBnEAE",
            "text": "I had a good sopa de marisco, great taste. Ñ"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNd1lPMFRBEAE",
            "text": "Horrible la comida no está buena y las pupusas sin sabor, cobran caro y este lugar no sirve"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvME1fNFlBEAE",
            "text": "I went for lunch and didnt get fresh white rice... ehhh it could be worse."
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDcGFfVG1RRRAB",
            "text": "Este restaurant es horrible. Comida basuraaaa y cara son ladrones."
        }
    ],
    "reviews_count": 66
}