{
    "name": "Milk Burger",
    "place_id": "ChIJQctPo-n1wokRPDPYTdjxlf4",
    "grid": "BX1",
    "address": "148 Bruckner Blvd, Bronx, NY 10454, USA",
    "rating": 4.4,
    "user_ratings_total": 833,
    "phone_number": null,
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMmFEUlBjbVUzWVZrelprbGtOVlpwWjNkWE9YYxAB",
            "text": "Great food. Amazing service. Staff very friendly and courteous. One restroom. Street parking."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbXVxUmVREAE",
            "text": "I loved their falafel burger. And it’s back on the menu! Fries are great, too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRVlWVlBkSFZHV0djME1HWjFlSGhDVVROdlYwRRAB",
            "text": "I'll keep it short, if you want a BAD ASS burger please try a milk burger! It's that good.  Worth every single dollar!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNVFUSmhaMHRhWjNWdmQwUkdObFpRTlZSSFRrRRAB",
            "text": "Way too expensive for the location"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dVkxOW5aa1ZOYXpJMmVuTlFlVU52UkZNNU1rRRAB",
            "text": "I went and sat inside at a comfortable back of the restaurant table. I plugged in my Macbook placed my Bronx Burger meal with sweet potato fries and a vanilla  milkshake and the star of my meal the double angus burger with cheese, lettuce and tomatoes, onions and dripping garlic aioli. I took my time and enjoyed my delicious burger each bite each taste each sip very slowly as my stomach said Welcome to Milk Burger Bronx."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrNVJVUnhTek5XUldFd1JHNU5OR3d4ZFhsZlUxRRAB",
            "text": "The most expensive burgers I ever had,\nTo little and expensive the fries to salty\nNever ever,again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psM2FFNWhXQzFTTVdKcFlsODVRVk5DZGpSeGNWRRAB",
            "text": "This place is garbage and overpriced straight trash"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRFFsUnVlVFpmZDJSTFlXRnpORUp2VWpsYVZsRRAB",
            "text": "The food here is ok. It gives me off version of  shake shack. The burgers had no flavor. The establishment was nice but the bathroom was trash. They definitely need to clean it and mop all the floors. Overall it was nice to try but there was no wow factor about the food. We had French fries and those were basic crinkle cut fries.  They are over priced for the non seasoned small patties they offer. My son’s father enjoyed the shake."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sV1V6UnBTa0ZEVlZWdlRtZHdSbDlXV0c5cVJFRRAB",
            "text": "Ellis thank you for a wonderful experience. It was great to share a burger and milk shake and the service and food quality was brilliant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRGQxazJXR1I0UjNsa1dHVkhibVUwZDBoSVZWRRAB",
            "text": "The service I had was terrible. I had waited 45 minutes for my food just for it to come out cold and mid. When I complained about it the staff ignored me and did nothing to accommodate the lackluster burger I was served. I would never recommend this to anyone and if I could leave negative stars I would. I’m never coming back here and don’t suggest you try this place if you were considering it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRk5YUm9TMngzVGtkMmFFTldZVXBrWkhsdVYwRRAB",
            "text": "This was a horrible place to try on what I thought would be a wonderful meal. The food was nasty, very small portions, the burger tasted like plastic and there was a very long wait. The fries seemed to be frozen/reheated fries gotten from a bag. The photos on their social media are definitely misleading, I would not recommend this place and encourage you to skip this."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oS0xYcDNaRGt5VjI5ck5FbG9jMFJsWWxjMmMwRRAB",
            "text": "good burger but when you order there's no option to order your burger without onions so I haven't been in months"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ka1p6RndhRVZoWmtGRExXZENhbVZHZEZwMFRrRRAB",
            "text": "One of the all-time best..."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VFZESXliRzR5Umw5V1FtTmFTWGxEYVhKc2NFRRAB",
            "text": "The burgers was amazing, the alcohol drinks was terrible we sent it back. Dont have a sign in bold  letters saying the best henny colada and it taste like water"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMSG41TWI2X3EtZVBBEAE",
            "text": "One of the best burger spots in all of nyc. Fresh ingredients and great customer service. You could tell the quality of the burger by the looks imagine the taste. This is not your regular burger spot. Must try when you’re in nyc."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcnVyXzNKcGFUeVFBEAE",
            "text": "You cant go wrong with the double cheeseburger from here. They’re delicious but they are a little pricey"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMSEs5cGlCbTd1akZnEAE",
            "text": "Sunny side up egg was rubbery and cooked all the way through. Burger had been absolutely hammered and was over seasoned and leathery. I was the only person there and it took almost half an hour to get it. Avoid."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYmlsNWF4bzdXek9BEAE",
            "text": "Love the food! Will definitely go back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQQ09pbzZub2FHN3lnRRAB",
            "text": "My bf & I waited for over FORTY minutes for 2 (tiny bite size) smash burgers with an order of cheese fries and sweet potato fries… idk where to start. For starters, there was only 3 people waiting for their food on a Friday night. The burgers were smaller than the burgers they feed kids in school. Very small, almost no flavor. The patty was so smashed it was see-through thin. The fries? You could taste were so stale and frozen from weeks ago.  The cheese on the fries was super artificial and it was a slight layer that barely was sufficient. To make it even worse, after waiting 40 minutes, our food was brought to us wrapped in aluminum to-go even though we ordered to dine in. Honestly, this is the worst “smashed burger” I’ve ever had."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMHBTck9REAE",
            "text": "super good food and the staff were super nice!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOU4yaGN3EAE",
            "text": "Cardwin was amazing. I’ll definitely come back, he helped me pretty much try everything in the restaurant. Thank you !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOUoyVUF3EAE",
            "text": "Amazing burgers. Beef, fish, falafel, all of them."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMFppWjRBRRAB",
            "text": "Burger was tasty.\n\nAll 2 bites of it. Did I mention they are the size of a White Castle slider? You won't leave this place full.\n\nWings were meh. Over fried and warm. Wings should be hot. You can tell they make a large batch early and let it sit around all day.\n\n3 burgers, 3 drinks, and some wings.  $120 dollars.\nI looked out the window again to make sure I was on 138th and not Billionaires Row."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3b011bndBRRAB",
            "text": "Food was amazing and great customer service. We sat in ate talked and the owner Eric was very polite and helpful he came over and had conversation, everything was just Amazing and warming we’ll definitely be back!!!."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b0kzQkZnEAE",
            "text": "Super super nice ! Good fresh food , service great !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM1B1MlVnEAE",
            "text": "The food is absolutely super fresh! So delicious!! The Fresh Mint Lemonade is to die for!! The owner is a sweet sweet guy! Support MILK BURGER!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM05qcGt3RRAB",
            "text": "Amazing and delicious place with great service!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReE1UZlJBEAE",
            "text": "Shout out to the owner and his team. Great customer service and a very clean Atmosphere!  This place is for the win 🏆"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRd01PTDFBRRAB",
            "text": "The food was amazing the 10-15min wait is worth it. I've had many burger this was is a 10/10 nothing else like it in the city trust me. The drinks are also amazing and the service is also amazing"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnME5qRnp3RRAB",
            "text": "Ordered a cheeseburger with lemon pepper wings, order arrived wrong. Two items, simple!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdFAzWWF3EAE",
            "text": "Ill never come to this restaurant. Over priced and had missing items from my bag. On top of that people steal the orders when delivered. Last time I'll ever come here. 2 burgers fries onion rings 2 sodas and 2 margaritas 100 dollars....not worth it. Owner is nice but this is highway robbery.\nPs update: burger was trash...salty as hell ...never buying anything from here!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbFktSDZnRRAB",
            "text": "THEY HAVE THE BEST LEMON PEPPER WINGS IN THE BRONX PERIOD ‼️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOUtXdVhnEAE",
            "text": "Great smash burger, tasty fish sandwich. Fresh ingredients. Just dont expect \"fast food\" speed."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMExiOElBEAE",
            "text": "Dining at Milk Burger was a pleasant experience. The kitchen and front staff look like they enjoy working there and the manager was polite and helpful. It was good seeing the manager helping out his staff while checking in on the customers. The burgers were of great quality and we will be returning soon! Keep up the pleasant hospitality!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdGUyZnd3RRAB",
            "text": "Burger, fries, drinks all fire. Mango margarita was great. They even have veg options."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdGRuTTV3RRAB",
            "text": "I enjoyed everything including the service\n!! I got the milkburger with egg ,cheese fries, & teriyaki wings & a strawberry margarita!! The food & drink was 10/10"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdGRtSUNBEAE",
            "text": "The hospitality is exceptional, and the food is amazing! Freshly squeezed fruit infused in the frozen margaritas which are also a hit! I found my new around the way burger joint! Delicious"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURma1llWUlnEAE",
            "text": "its aight"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREajVtTkhREAE",
            "text": "Super pricey but worth it. Probably on come here for a date or special occasion."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmek1feHhRRRAB",
            "text": "The damm food is unbelievable love it music is nice and the Henry coadas is  crazy this MILK BURGER GOT MY VOTE ALL YEAR. !!!!!!!!!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmekxlUm93RRAB",
            "text": "Best Burgers in the BX"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2Mlk2bXd3RRAB",
            "text": "Burger is freshly made, hot, and well seasoned. Margarita,  blackberry is definitely worth a try . Restaurante is small and very clean, just a little chilling."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OE5tbmN3EAE",
            "text": "Amazing burgers, and amazing milkshakes! Love this place so much. The fires are also fire!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbmVLSU93EAE",
            "text": "If I could give ZERO stars I would.\n\nI was just stopping in to pick up a simple order tonight that should have been ready for pick up (ONE Cheeseburger).\n\nNow after waiting 12-15 mins I get confused as to what’s the hold up (Only one other customer in there at the time waiting on his order as well).\n\nSo I politely asked the person running the front register about the duration of my order and dude decided to tell me that your order comes out whenever it comes out. To top it off immediately as I just walk out due to the excessive wait he takes it upon himself to say something smart under his breath.\n\nExtremely unprofessional, Will never pickup from this place ever again.\n\nSeriously disappointing for a restaurant in a up and coming neighborhood. Very sad"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbHNISUV3EAE",
            "text": "While out riding around I found this nice little hideaway Burger spot. It is a small and cozy place with wood accents all over. Not very busy and the staff is super helpful,friendly and kind. I tried the Milk Burger after all that is the name of this place. It was made very well and also got the sweet potato fries, (cajun seasoning gives it the extra spice). It didn’t take to long after I ordered, only 3 people on staff when I visited. Even though everything is charged separate, and there is no combos, it was still worth the price from the experience and the atmosphere in this place. I would tell everyone I know to check it out and support them. I’m thankful I found this place and will be back again soon."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzak5hbi13RRAB",
            "text": "Food was good I love strawberry shake"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeVpuU013EAE",
            "text": "Amazing atmosphere!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeWFua29BRRAB",
            "text": "Excellent service, Great food"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzd1pPUGx3RRAB",
            "text": "Margarita's = Great\n\nBurgers = 7/10 (lack flavor) I tried the new garlic burger, but honestly, it didn’t stand out much from a regular one. The garlic flavor just wasn’t noticeable.\n\nSweet potato Fries =10/10\nCrinkle Fries 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdTV6MkFREAE",
            "text": "Little retro restaurant,burgers made from scratch..the el barrio burger was one of the best that I ever try"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid2M2YlRREAE",
            "text": "Passed this place a couple of times on my way into the city, so I decided to give it a go. For a placed that boast it has the best Hennessy Colada in NY, I found it lacking. The drinks were poorly made. Either too sugary or overly saturated with alcohol, no balance. The idea is sound and I loved the restaurant’s concept, however it is not living up to its potential. The wings tasted like the frozen ones you get from the supermarket, and the sauces were horrible. The burgers were ok, but nothing to rave about. While the lay out and atmosphere was like a food truck vibe and the restaurant was cluttered with what appeared to be food stock items. The staff were very personable and professional. As stated it’s a solid concept, but needs much work to be taken seriously as a restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidDVfNWZBEAE",
            "text": "Amazing place! burgers are perfect, wings are perfect, customer service is perfect, alcohol is perfect. Everything is perfect! Please come here you won’t regret it! God Bless the owner Eric and everybody that works at Milky Burger!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoeXVHemh3RRAB",
            "text": "3.5/5 - not bad… also not the best burger I ever had (though my younger sister said it “was fire”).\nComparatively speaking I thought it was alright. Was expecting to be wow’d away… however, I was underwhelmed.\n\nOrdered a bacon cheeseburger with a side of cheese fries. The manager Eric was nice enough to give me a side of fresh jalapeños for added spice. Their sirachia aioli was unique, and elevated the bland taste of my burger. The fries were ehhh.. also, their packaging of this for take away was miserable. They wrapped it in aluminum foil which was quite ghetto.\n\nOverall, I’m glad I tried it. Would be open to going back, but I don’t see myself craving a burger from here anytime soon."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBZ1pQbUd3EAE",
            "text": "Wonderful spot with consistent food experience.  Food is a bit more than you’d usually pay and quantity is not as much but the it tastes great. You’ll experience a calm chill vibe here and they also got alcohol for those type of nights.   Also they have the best milkshakes in the Bronx."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURid1BYMERREAE",
            "text": "Walked in for takeout. Casual spot, dive bar like. Service was smooth and the guy at the cash register was friendly. I got the cheeseburger and added bacon. It was delicious and juicy. Perfectly cooked. I will be back soon."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwMWJiZUV3EAE",
            "text": "Oh, this place is going to become a regular place for my burger craving days ahead. My girlfriend and I took a quick Sunday morning trip out to Milk Burger and it was definitely worth the trip! Highly recommend this spot if you have a…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3bmNiZTJBRRAB",
            "text": "Nice hidden gem in the Bronx. The mushroom burger was cooked to perfection and the sweet potato fries were cooked with a light crisp and full of flavor. Staff is very welcoming and warm. We also tried the hot wings and fries. Compared to upper west side of the city the prices are very reasonable. Definitely going back again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwOFBtNzNBRRAB",
            "text": "My friends and I got the chicken sandwich, turkey burger, and milk burger. They were all great. Don’t be fooled by the size, they very meaty. The beef burger was absolutely delicious. It was seasoned to perfection and the beef tasted fresh.…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNktERkh3EAE",
            "text": "Nice little burger spot!! I had the double Milk burger and it did not disappoint. The burgers are not anything to crazy they're just good burgers done right, the Milk sauce is on the other hand...really good. They also offer a bunch of locally brewed beer, which is always a plus. Burgers and beers do go hand and hand!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOUwzOXpRRRAB",
            "text": "I tried Milk Burger today for the first time and it tasted really good. I had the smash burger and it had a good mesh of different flavors. The fries was crispy and complimented the burger. Would definitely come back."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMExMcXpRRRAB",
            "text": "10/10 one of The Best Burger Joints in New York. You'll be hard pressed to find a spot that's juicier, tastier, and more flavorful than here.\n\nAlso their cleanliness is immaculate.\n\nCustomer service is also on point."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhLTRXeTRRRRAB",
            "text": "Quality burger in NYC, which is surprisingly rare compared to other cities. The Milk Burger had a great sauce and was complimented by the onion rings and sweet potato fries."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1N3NLRGlRRRAB",
            "text": "I am a lover of burgers and was looking for a nice place and an amazing burger. This place definitely accomplished that! The burger was so tasty and fresh. The fries were perfectly salted and crispy! The fresh lemonade was delicious! It’s…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURna3Y2cGpBRRAB",
            "text": "It's small but the food is really good, but if your not into a-la-carte keep it movin'.  and prices are decent.  Oh yeah, if you want a quick yummy burger and a beer to wash it down then go.  It is far off the beaten path though."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNXJ5VHJBRRAB",
            "text": "Too good!!! Fish sandwich was crispy and flavorful. Burger delicious as well!! We also enjoyed the seasoning on the spicy fries. Frozen strawberry lemonade is a must. Not too sweet and the perfect amount of ice. An easy bike ride from the city. We will be back asap."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlOEllNkpREAE",
            "text": "This place was small, cozy and inviting. Everything I had was quite delicious. Went early afternoon and it was not packed at All. The fries were crunchy and tasty, the burger was delicious as well as the frozen strawberry lemonade. I would recommend."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdHFyX3V3RRAB",
            "text": "Pretty neat stop that I happened to stroll in when I was on the go with a friend of mine. Didn’t buy any food but I did get the adult lemonade which didn’t absolutely nothing for me but I guess I should he’s expected that and just gotten a beer instead."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNdWZpeldREAE",
            "text": "Excellent burger place, small & cozy in the heart of Bronx at Port Morris. Staff is extremely friendly, sweet potato fries are amazing and you must try their adult milkshakes made with liquor!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXbnZpMGRREAE",
            "text": "One of the best turkey burgers I’ve ever had! Incredibly well seasoned, large portions, decent price. The Henny-colados and shakes looked really good but i was too stuffed to get anything else! Atmosphere & decor was very relaxed."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeHVlUHJ3RRAB",
            "text": "I was walking by and the look of the place was reassuring. Very nice interior and menu with mostly beef burgers but there is one Portobello burger for vegetarians. I ordered Turkey burger which was very good. There is also a bar with all kinds of drinks.Bronx brewery was prominently represented"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVeThDSHlRRRAB",
            "text": "This place has a very clean, calm, eccentric vibe with great food quality and taste. The staff members are very friendly and attentive to your specific needs."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRaFBxQmdBRRAB",
            "text": "Now that's what I call a bite!! love the vibe here, very hip and modern, with excellent options that you dont regularly find at your regular fast food place.\n\nI got the truffle fries, and milk burger with an egg, prices are a little more than I expected, but worth every cent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsenNUMGZ3EAE",
            "text": "Burger was delicious and onion rings were really good, but $6 for 5 onion rings is a little excessive and the wings were good but not as good as I'd expect for $2 a wing. Their ranch is bomb though"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtb1BtendBRRAB",
            "text": "Love this place. Little hidden gem. Barrio burger was bomb! And the spicy Cajun fries were amazing. Def will come here again… I almost forgot how good the margarita was!! 🤙🏽🤙🏽🤙🏽\n\nThe little gummy burger they add def gave me a nostalgic feeling of been a kid 😂🤙🏽"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMweC1PT0d3EAE",
            "text": "The milkshakes are the truth! The burger was solid I got the el barrio. The spicy fries were ok, but the sweet potato fries are great. But what really makes the place is the very personal staff. Ms. Cat is super awesome👍👍👍👍👍. This is a hidden food jem in the bronx.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVbE9Lajh3RRAB",
            "text": "Great local restaurant. The team has always been super pleasant and are always trying to evolve their offerings to please diners! The first time I visited, the kitchen team offered all of the diners in the restaurants a trial of falafel that they were considering adding to the menu (it was delicious!). When I went in July 2019, I tried a different burger, which was also great, and experienced the same hospitality. The (maybe manager?) heard me mention “beer” to my partner, and started citing all of the beer selections he/they had just added, included a lot of local stuff like KCBC and Bronx Brewery, and one of my summer favorites: Montauk Watermelon ale (who doesn’t love a montauk watermelon?).\n\nI tried the goat cheese burger and the burger with the fried egg, which I added onions to. They were so yummy! Oddly enough, because I am generally against American cheese, the classic milk burger that my partner ordered twice was a strong contender for favorite both times! Try them all if you can. Also, the sweet potato fries are dope. Ask for the signature milk sauce on the side ;)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdU92NFd3EAE",
            "text": "Milk Burger on Bruckner Blvd in the Bronx brings back fond memories from when I first discovered this spot in Manhattan. I was sad to see it leave its original location, but I'm thrilled that it’s found a new home in the Bronx, still serving up the delicious burgers that made it a favorite.\n\nOne of the highlights on the menu is the burger topped with a fried egg and a big, crispy onion ring. This burger is a flavor explosion—juicy, perfectly seasoned beef with the richness of the fried egg adding a creamy touch. The onion ring is massive and crunchy, providing a satisfying contrast to the tender patty. Every bite is a reminder of why I loved this place so much back in its Manhattan days.\n\nThe crispy French fries that come with the burger are just as good as I remember. They’re golden, crunchy on the outside, and soft on the inside, seasoned to perfection. They make the perfect sidekick to the main event.\n\nThe atmosphere at the new Bronx location is laid-back and inviting, and while it’s different from the Manhattan vibe, it has its own charm. The service is quick and friendly, ensuring that you get your food hot and fresh, just like before.\n\nWhile I miss having Milk Burger in Manhattan, I’m glad it’s still around and thriving in the Bronx. If you’re in the area, it’s definitely worth a visit for a taste of those classic burgers that made it famous. is the owner still own the black motorcycle?"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzcXRQSDRBRRAB",
            "text": "I love freaking milk burger. Honestly there burgers are better than shake shack. The cheeseburger is juicy and filling, so is the Turkey burger. They do need to add more vegetarian options."
        }
    ],
    "reviews_count": 78
}