{
    "name": "Porto Salvo",
    "place_id": "ChIJx-zorsr1wokR5a-0j2bBtPI",
    "grid": "BX1",
    "address": "424 E 161st St, Bronx, NY 10451, USA",
    "rating": 4.6,
    "user_ratings_total": 859,
    "phone_number": "(929) 376-7866",
    "reviews": [
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNZ19YRXZnRRAB",
            "text": "Still excellent all around...9+years and running.\n\nNow Roman style pizza, too- thin, crispy crust and top notch toppings (including real mozzarella...not the fake stuff everyone else serves around the area) is a delicious addition; great at the bar or as a main."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSlRsRk5OMDFrVmtkelFXbG5UVUpyUm1aVVpYYxAB",
            "text": "Great ambience. Delicious food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRVRXd3hNakJJYm5oUVJ6Uk5aMHRQU0dWbGRHYxAB",
            "text": "Fantastic service.\nFood was on point.\nSmall quant patio."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTVUyWk9jR0p0TTBaamFFZHZMWFkxUjA0MWQxRRAB",
            "text": "I’ve gotten delivery twice from this restaurant and it’s been fabulous both times. The food is delivered quickly and it’s very hot and it travels well. I highly recommend it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWM1ltaHZMWEEwWVd0RVMwSldia3hNZWs0MGFYYxAB",
            "text": "10/14 bartender Pedro was great! Very friendly and the drinks are really good, I got the PortoRosso"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Z09ucUxnEAE",
            "text": "Love this place. Cozy and the staff is friendly.  Drinks and food are great. Bartender always friendly ."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWblp6WTBRMjltWHpGM1pFRkpkbWhXU0dWd1JHYxAB",
            "text": "Very accommodating staff, quick with your order paired with a great atmosphere. Outdoor seating is very pleasant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcVJXZElkWEEzYUU5MFZVSnNlVkp0ZFRsMGJVRRAB",
            "text": "Great amazing bar attenders"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdmJFeHdWMDVYY0dGVllVbGlXV3RmTmtwa09FRRAB",
            "text": "Amazing staff amazing food !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseFdFRnNlV0pYU1VoeldsbzVaMjR6VTJ0a1VYYxAB",
            "text": "Best place to go! amazing drinks amazing bartenders, you will leave satisfied! The bread is amazing and the drinks are to die for"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MmNEZzFTRTlKYTNCQ1ltazNSRUZJVVhWc1gwRRAB",
            "text": "I had a great time at Porto Salvo, my server Claudia,  was incredibly friendly. The bruschetta and prosciutto was great. We had the short ribs and risotto along with the cavatelli and sausage. So good! Will be returning!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkelpUZGZhbFZKUVdGQ2F6RnNTV3ROVUd4U1MzYxAB",
            "text": "Ameeeeee la pasta de este lugar. MUY RECOMENDABLE LINGUINE CAMBERI. Gracias por la experiencia🥰"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cGMybFJUMlJ3YXpBM1kyMXVlRTh0VEdsV1pHYxAB",
            "text": "Excelente recomendado, un rinconcito maravilloso en el Bronx les recomiendo las pastas 😍\nY el amigo Pedro un 100 búsquenlo para que les oriente con las comiditas y tragos."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swd1pUUTBMVXhoVFc1bFduQmlOVGgyYWsxS2FuYxAB",
            "text": "Everyone at Porto Salvo  is super amicable, attentive, and happy to serve you. The food is impressive and full of flavor. They pay attention to detail and make sure that you’re satisfied with your meal. Over the last few months they have made some improvements to make the restaurant feel more welcoming and trendy. I appreciate that in a business. It shows that they care.\nBest spritz in town HANDS DOWN. I felt like I was back in Rome! And I’m a big fan of their pizzas. So light and crunchy. Can’t wait to go back! 😊"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVVFXZDVNazFQVG5Wc1VpMWhWVXB0VVhSSE4zYxAB",
            "text": "Great food and amazing service. Short Walk from Yankee Stadium"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUlpFUkJNekJKVUhSRE0yNVpXRGxaVXpCTmRHYxAB",
            "text": "First and foremost, I’d like to highlight the excellent service. Our server, Tanesha, was both friendly and professional, and she truly elevated our dining experience.\n\nThe food was also outstanding. It was seasoned perfectly, with just the right balance of flavor.\n\nI would definitely come back and highly recommend this place to anyone looking for a great meal and service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treVVGZDBOSFZRUmxSdVFtVlNOMlV0TWxCblYwRRAB",
            "text": "I’m very satisfied with the service received from Tanisha and Pedro. The food was delicious and they gave us free tequila shot!! Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WU2JVSkZVMUZEU21sb2VIRnFURjlpWTJod1RXYxAB",
            "text": "Tanisha and pedro were amazing overall, great service and food. Looking forward to coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdGFHRjFSazVIWkRrd01HdDFZVEZVUVVwV1RVRRAB",
            "text": "The food is delicious, the service is amazing and the atmosphere is sexy. I love Porto Salvo! Thank you Maribel for your service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200M1FtVllNV016TUU5dmFXMUJUVXhzVmt4T09WRRAB",
            "text": "Food was delicious and the prices were decent. Really good service!!!\nThanks Claudia!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVFZWRnFkRTluVjBKUWFWcDRObHB1WVUxNWNsRRAB",
            "text": "I so badly wanted to like this place. To have a spot in my neighborhood that I could walked to. Walked in to a pretty dead day - one person at the bar (who worked there), tables more empty than full. Ordered a drink, asked for a water. Got drink, no water, no biggie. Asked again. Ordered, the zucchini flowers - had come to get the octopus carpaccio but didn't see it on the menu. Asked for water again. Drink was good, got served \"complimentary\" bread with dip. Dip was good, bread was fine. Waited longer than I felt I should have for the zucchini flowers but enjoyed the bread & was hoping that meant they were fresh. Appetizer came out - asked for water for the fourth time and finally got it. Zucchini flowers were hot but not burn your tongue hot. However, way over stuffed and thick breading that left the flower lost. So they were bad zucchini flowers but decent fried cheese. Except I didn't want to pay $21 for fried cheese. Music was too loud. It was hot inside. Didn't finish the appetizer - asked for a box. And when I went to pay there was an automatic 18% gratuity. For a single person with one drink and one appetizer at the bar. $45 for one drink and one app and a bartender that had to be asked for water 4 times. Going to go ahead and say that bread cost the 18% gratuity because there's no reason to be charging that for a bar guest and it shouldn't be done without warning"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seU9VWXRUelpMU0VnM09YbGpSekozZUdKcU1GRRAB",
            "text": "Excellent place for dinner\nThe cocktails are marvellous\nVery friendly staff\nWant to visit again and again !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NM1NuRlVSSEUxV1hNd2VITmZNbHBYTlVGa1kyYxAB",
            "text": "Love the pizza,  carpaccio, was a bit quiet but was there Monday afternoon - definitely be back when I’m in NYC"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMWFHNXBjWEZ6YVdGQlRFdE9ValpDTUZKbFltYxAB",
            "text": "Everything was lovely. Tanisha was quite attentive and we enjoyed everything."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMFpFdHdTRzVPWlhWWlozWXhPREpmUkVOMmJFRRAB",
            "text": "So good! My friend loves the butternut squash. I love their steak, wine & oysters. The pizza was pretty good too! They also have happy hour deals."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keGMyVTNXVGhNZVZSNlgxTmZVMDF3V1ZGVmRrRRAB",
            "text": "Love this place, such a great atmosphere!"
        },
        {
            "date": "2달 전",
            "language": "sv",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaFdXbDBVeko0WkMxNU4xQnhNRUkyWVdkMVRtYxAB",
            "text": "Perfekt!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZaDRDU2FREAE",
            "text": "The best restaurant in the South Bronx."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OcVRWaDBRMFJWVDFOZlNYUTFSa1U1TjBkWGFtYxAB",
            "text": "I stopped here with a buddy to get food around 1pm. The menu was for brunch but we wanted something more hardy. The manager I believe, if not owner, gave us the dinner menu very eager to keep us to stay and make sure we were happy. The food was amazing. Grilled shrimp and octopus over a bed of amazing hummus. The bread served with ricotta whipped crème and olive oil. That spread alone was amazing. The short rib plate was insane, melting off bone and the pasta unbelievable. Had a skirt steak as well and the potatoes served in small portions were crisp and flavored with garlic. We definitely over ate and had to pack to-go. We ended with the strongest coffee I ever had, and yes it was good too. Honestly we expected to pay more than the bill was so we tipped them good. I’m now re heating the left overs. Highly recommend if you love your tastebuds. Great environment. Very caring staff. You will thank him and then me. Your welcome."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVGJqbHJSMkZUZFhVMloyWnZWVFJsTkZSNU5tYxAB",
            "text": "Five years later, and there still great!!! Took my ladies for brunch and, as always, great!!! Food, service and atmosphere!!! The manager tonight deserves a rise!!! Amazing service!!! The desserts were perfect portions and temptress. We had italian pentacota with the raspberry and their Carmel  ice cream!! Absolutely recommend!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWE4zTnFOMnhXYURNMVlWbHNVbVkyT1hCRFdXYxAB",
            "text": "I visited during my lunch break with my coworkers and the amazing bartender and waitress were so attentive and helpful. Food was great, would definitely go back for more lunch dates or as a date night."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1V1IyTndOVnB4YkY5S2NucE1ibTFpTW5KSE1sRRAB",
            "text": "Went here for lunch on a Weds. no wait for a table it was pretty empty. The oysters were good that was the tastiest thing we had. The Ceaser salad was good as well. The octopus was good but it was a very small portion for the price. Only one piece. The crab cake wasn’t tasty and was overpriced and the salmon tartar wasn’t the best either. It needed like plantain chips or pita or something to go with it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aGFuTkdZWGhzYldKblRFMUZWRlZyV25ORGNsRRAB",
            "text": "Stephany and Luis were the GREATEST experience Bartenders ever. Not only did they make sure my food was fantastic, my drinks were cold and that we were just having a great time. . The pizza was fantastic, but in reality we came here for the atmosphere and both Stephanie and Luis made it a five star/6 star experience"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWllXbFpSWEpsU2twVVMwNWpVMVpRZWxoTFNrRRAB",
            "text": "Great place to grab a quick bite before the Yankees game. Was delicious!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNldEbExTMU5rUlZCMU5HOU1lSGRzYkRoVk9VRRAB",
            "text": "The food is delicious, the service is amazing and the atmosphere is sexy. I love Porto Salvo! Thank you Maribel for your service ☺️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTWFrTkVOVlZHYVdreWVVZENkR3R6V1hKdGRGRRAB",
            "text": "I came here for a quiet Friday night. I sat at the bar and waited 20 minutes for the menu. The bartender was talking to some girls, and I barely managed to get his attention. I ordered drinks, and they were the worst I've ever had this restaurant. They took forever to bring them, and the food too. I waited almost an hour. The bartender, Pedro, tried to compensate me with a shot. I didn't say anything; I just paid and  walked away and thanked him. The service was terrible, and they still charged me 18%.\nI wanted to try the Sunday morning brunch , but the service was terrible again. The bartenders seemed new they had to go to the kitchen to ask the chef about the ingredients The girl bartending drinks were awful I ordered one, and it smelled awful, rotten. She spent most of the time talking, apparently to her, I think, friends. I had to go get my own utensils and napkin. They didn't even bring me water so I had to ask for it. I asked if they had any drinks One was a Bloody Mary and the other was made with grapefruit, and they didn't have any, so why were they on the menu? The food was very decent The most disgusting thing was watching my bartender sneeze and wipe her nose with a napkin. And she didn't wash her hands or wear gloves when she picked up the lemons mid-service. Very disgusting. And I thought the outfit was super indecent, showing half of her buttocks. I didn't feel comfortable, and she took a couple of shots with her friends. What a shame, unprofessional. I was very disappointed with this place. It's completely lost its essence. It used to be a a gem a good place to meet people Now I don't know what to say I hope things change, but I won't be back. It was a very bad experience twice in a row. The level of the drinks and service I had in mind dropped considerably. How would I recommend someone to something like what I saw or was treated? Mmm no!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oaU1HTkdia2hLZDNWbmJFUjFUVXhEYlhKaU1YYxAB",
            "text": "I come to this place at least once a year for the past few years. This last visit was disappointing. Someone in my group had a dairy allergy. They stressed this to the waiter. They ordered a pasta dish with veal Bolognese sauce, it was not supposed to have cheese based on the menu description. The waiter confirmed it did not have cheese. Stress was placed on the dairy allergy and we were assured there would be no issues. The pasta came out and one bite in, the cheese was detected. Picking up the noodles you could then see the little cheese strings that are characteristic of Parmesan. (The lighting in the place is nice and soft so it wasn't detected when the plate first came out and after discussing it with the waiter we didn't think anything of it.) The waiter came over and assured us there was no cheese until we showed him the cheese strings. He apologized and replaced it. Came back from the kitchen and said there was a miscommunication. Asked me if there was a dairy allergy, which I kindly told him \"yes sir, the same allergy that was discussed a few times before the dish was ordered.\" Though the food was replaced, the experience was not great. Food allergies are something to be a little more careful about. I Don't think I'll be bringing people with food intolerances here. It was embarrassing as I assured them this place was my hidden gem. They are usually great. I still recommend this place, but not if you have food allergies. As they weren't as careful as they should have been and if my guest had listened to the waiter they would have continued to consume cheese. I don't blame him. He didn't make the food. Anyway, try this place if you don't have allergies. Otherwise, consider somewhere else."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcGEyMU5aR0ptYkZoZmVrOU1hR05SY1c5T1VVRRAB",
            "text": "The food was great! The atmosphere was great! The service was great! We all had a great time, definitely recommend this place! It was eight of us sitting outside, and it was really nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WQmMzZFRYMFl0VldKNmRqZE9TMmRhWTBoSk4xRRAB",
            "text": "I went in to have lunch and the vibe was off the hook. I enjoyed my meal and the service was excellent. Nastassia and Stefany were very professional. They knew their job and did their job the way a person in their profession should do. I would definitely recommend this spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWVIxQXdkMUIxWTI5TVNHdG1NVlZYYkRBMWFWRRAB",
            "text": "I've known this place for a long time. I don't go often, but I liked stopping by every now and then, though I definitely don't think I'll go back I wanted to stop by on a Wednesday and enjoy the evening but the service was very slow I had to ask for my water pitcher several times, and in the end they brought me a dirty one that I think had mold on it. I don't know how to explain it The waitress had a very bad temper I didn't like her attitude at all I felt rushed the waitresses were passing by every 10 minutes and asking me questions I didn't feel comfortable as I had only come to enjoy the place and the atmosphere made me think they wanted to move me from my seat or something when I ordered my food, I asked what they recommended, and I didn't like the rude response \"There's the menu, you should read it\" the lights were almost off so I couldn't read it properly. The food was always very appetizing, but the service left a lot to be desired. I didn't say anything to the waitress, as her attitude only disappointed me maybe they were busy, but I didn't deserve that treatment"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNdE5sSkRkV3hMU0hwbFdHOUpSRlZSWTNaSVJGRRAB",
            "text": "Primera vez que voy a este restaurante, para ser la primera vez, la comida estuvo bastante bien y las chicas que atienden muy amables."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRGRVUkNWbFZKWm05NWNFWnVYM1V6WjBadWFHYxAB",
            "text": "I had a good experience and enjoyed my dinner. Food and service was really good."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLbU81YkhyNUxPR0V3EAE",
            "text": "Pedi Eggplant past, y lo que me fue un plato lleno de queso con poca carne, poca verenjena. tenia uan expectativa diferente. Pero ya lo descarto de mi lista"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbTg1NHlob1ozVlNREAE",
            "text": "Fantastic! Pedro gracias por su maravilloso servicio!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKalR1S1Rvb19qZmlRRRAB",
            "text": "Pedro gave us great service! Excellent drinks and excellent service. Will come back to try more food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZllwSXJvbVBfdEN3EAE",
            "text": "With my favorite bartender at my favorite spot, Porto Salvo! Take a trip to a small beach town restaurant in Italy without leaving the city. Ask Marco to prepare their refreshing summer drink, \"The Altemar,\" dedicated to me."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKYm9oYUxBN01LS3R3RRAB",
            "text": "The food was good, I had a zucchini chip appetizer and the branzino and veggie special they had for the day. The drinks were no good. I had a mango mojito, could have went without it honestly. My friend had a coconut mojito and it tasted like milk and soda. The waiters were attentive, but it made us feel rushed. We expressed that we wanted to eat before drinking and our waiter came to the table three times before the appetizers came out asking if we were ready to order drinks. And then another time after the appetizers arrived. We finally ordered drinks when the main course arrived and were extremely underwhelmed by the drinks. Another waiter came to our table and began to remove our plates once we received our drinks and we had to stop her because we weren’t even half way done with our meal.\n\nThe ambience of the restaurant is very cute and intimate. I would have returned for a date, but I was just so thrown off by how fast they were trying to get us out of there. There were three tables in the dining room, including us so we weren’t sure what the urgency was about."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLeUE1dFBROXFhRlF3EAE",
            "text": "Love this place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLVGg0LVNreGRfS1BREAE",
            "text": "I love this place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJTHp5dVBPaGRldTh3RRAB",
            "text": "I love this Joint, would def come back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMm9xdmJBEAE",
            "text": "We had something not on the menu, it was a lobster pasta with shrimp and it was delicious. The atmosphere is great, they have upbeat music and dimmed lights that make a romantic/ homie feeling.\nOur server was Pedro and he was amazing! 10/10."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnd3BUdElnEAE",
            "text": "So if your looking for \"American\" Italian then your in the wrong place. This is real traditional Italian food and is fabulous . I been here three times and each time I've like it more and more . I tried the small plates and the large plates…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIejZtc25nRRAB",
            "text": "Five FIERCE stars.  The location has wonderful outdoor seating.  It would be a little tricky inside seating over 6 people together inside due to the shape.  The drink variety was impressive and delicious, but not nearly as good as the dish we all had,"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxc0p6N2J3EAE",
            "text": "I ordered the mushrooms risotto with short ribs. It was good! Service was very good. My friend ordered pistachio pesto orichetta with broccoli rabe. She didn't like it, I though it was good. And the peasent bread with fresh mozzarella and basil was delicious."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dzQzNjlRRRAB",
            "text": "Excellent gem in the neighborhood. I stopped by one day on my way home from work, had a delicious meal in really comfortable, stylish, and relaxing surroundings.   I immediately came back the next day with my husband.\n\nThe food is excellent.   I've been about 5 or 6 times by now and haven't had anything less than superb.  The prices for portions and quality are a great deal.  In addition, the service is impeccable.  Friendly and professional.\n\nHighly recommend this place for a pleasant evening meal and drinks in the Bronx at the end of a long day.  Hoping to try their brunch this weekend!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNWRDM21RRRAB",
            "text": "Where should I begin...ok let’s start from the beginning.\nMy sister told me she saw this place on her way home(bus) so she google it and told me it had great reviews( I’m super picky with food) so she wanted to try it out and so we went there on a Saturday afternoon and started with appetizer bruschetta with mushroom, cheese and truffle oil that was divine! The we of course order drinks and then the main course! That salmon was soooooo delicious! And my sisters pasta was great! I loved the desserts...Over all I am soo glad that she found that place because it my new favorite place!\nI will strongly recommend this amazing restaurant because the food  was delicious and the people that work there were just so friendly and I love the whole experience!\nI went back...took my sisters on a “Sister date night” and they loved it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdFoybFF3EAE",
            "text": "I love this place absolutely beautiful and warming. The people there is just amazing, the food was delicious on its point. And  atmosphere was great. We enjoyed the whole thing together excellent service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdWJTeHJRRRAB",
            "text": "My boyfriend and I love trying new restaurants. This was the best meal we’ve had this year. The service was excellent. The presentation was beautiful and the food was delicious. We will definitely be coming back!!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MWZxM3pRRRAB",
            "text": "Discover this place by accident when our regular Italian place had closed up due to the pandemic!   We were able to get quick lunch time reservations during the week and enjoyed wonderful appetizers, including grilled octopus…. and up and the lollipop pork chops over risotto were delicious!   A small but eclectic assortment of assortment of Italian and and mediterranean fish and pasta dishes filled their menu."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOGZDamx3RRAB",
            "text": "Hidden place in the Bronx!!\nGreat food!! Grilled Octopus delicious !!!\nMarco and Pedro provided  great service and explained the menu. Come visit them they won’t disappoint."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBaHEyTkZnEAE",
            "text": "My husband and I came here after work to enjoy an amazing 80-degree summer day. We ordered drinks and sat outside under the umbrella in front. It was a great experience from beginning to end. I highly recommend and look forward to trying their brunch."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjc015ald3EAE",
            "text": "My first time at this Italian Restaurant and everything went great! The place from the outside looks inviting and calls your attention. Its a bit small inside with a Nautical theme, dim lights, and a intimate setting but this is great for dates or just a couple of drinks afterwork during their happy hours. As soon as you walk in you'll notice the bar on the left surrounded by Tables and seats. The place wasn't that packed at the time I went, so things where comfortable. Its clean, organize, and nicely decorated. Our waitress was so nice and had plenty of patience with us as we had a bit of a difficult time understand some parts of the Meñu. Dishes have Italian titles on the Meñu, I found that some dishes are difficult to pronounce but theres also a brief description under each dish title. Other than that which is really no big deal, the food wait time was fair and the food and drinks itself where delicious. I couldn't ask for better service. Be advised this Restaurant does not have customer parking, they do accept credit cards and debit cards for payments, and the prices for food and drinks are fair. Great experience here, I would definitely comeback. 👍 Thank you and Enjoy."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdk5HR093EAE",
            "text": "TL;DR:\nThe food was very well worth every penny, the bartender was excellent as well. The service is what is lacking here.\n\nFirst night in New York we decided to get some food as we had just got off a three hour flight. We lifted to Porto Salvo as the reviews and food sounded amazing, and believe me we were not wrong. The food was delicious abd drinks were a treat, the only downside was the wait. I'm not sure but maybe they were understaffed but it took close to an hour from ordering our drinks to bring out the food and the butternut squash ravioli came out lukewarm at best. We asked for it to be heated back up which took another 20 minutes.\n\nI would definitely recommend this to a friend or go back again as the food was the star of the place - as it should be."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaXZfeTZBRRAB",
            "text": "Excelente servicio del chico de mesero y la comida  y el postre estuvo excelente, felicitaciones a la cocinera Verónica y su compañero en la cocina hicieron un trabajo estupendo, deseo volver pronto con mi pareja y  disfrutar otra vez una rica pasta ."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNF9YMF9RRRAB",
            "text": "Really good food. Cozy space,  good prices. Good drinks. I tried their mojito de coco and passionfruit and it was really good the same with their sangria. Is a nice place to go and get out of the routine.  They have out  seating in the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtM3BUNkVnEAE",
            "text": "Great ambiance and cozy setting that transports you as you enjoy all the delicious food. From the fried calamari w shrimp to our main dishes of skirt steak & roasted potatoes (so succulent no steak sauce was needed) to my partner's short…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM3VfNVBnEAE",
            "text": "It's a bit of a schlepp from Yankee Stadium. Next time I'll take Citi bike n reduce the commute time by 90%\nFood was really good though folks.  A bit pricey for this neck of the woods where I wouldn't wanna be too late into the night,\nbut the parpadelle with lamb ragu was delicious.  I can get oysters in Greenpoint for $1 ea. Don't need to pay $3+ ea here.\nBothered me the specials didn't have prices noted. and the happy hour prices for beer weren't very happy.  Polite, sweet staff and nice customers."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXMzhHRWhBRRAB",
            "text": "Super cute spot for a couple of well made cocktails, some delicious pasta, the very good burger, glass or two of wine, tiramisu, BRUNCH, etc., and the company is always the best. Very friendly place, both staff and customers! This is…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyM2E2U1lnEAE",
            "text": "I absolutely loved this place, the bartenders are amazing and very friendly, great customer service. The drinks were amazing as well and food did not disappoint at all."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMWJTNEpBEAE",
            "text": "For appetizer  pear and arugula salad. The Salmone al Pomodoro delish,\nTagliata alla Fiorentina, manifeson\nTo top it off for dessert Pannacotta, fresh cream flan. Mixed berry sauce, 😋 Yummy!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNnBQYUZ3EAE",
            "text": "Love the warm, welcoming vibe and atmosphere here. The welcome bread with dip was a cute touch and more exciting than just bread and regular butter. I was very happy with the mains- we ordered the whole branzino and ribeye steak- very good, well presented and tasty! Fish was juicy and enjoyed the sliced garlic pieces inside and lemon slices. Loved the sides that accompanied all our dishes such as the grilled marinated bell peppers and asparagus, mashed potatoes and we subbed some arugula and tomato.\n\nOnly thing we ordered that was misleading was the tuna carpaccio. Although it was still good, I would not call it a carpaccio. I would name it a seared, sesame crusted ahi tuna, because it was definitely seared and not raw.\n\nAll in all, had a nice night here thanks!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDanFqQzdRRRAB",
            "text": "Good service. The waiter was very attentive but not over bearing. The quality of the food is top notch. Awesome presentation as well. Will definitely be back here for another brunch."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRb1BDS1BBEAE",
            "text": "What a refreshing change to my neighborhood! The staff was amazing and attentive. The bread and ricotta roasted peppers was truly out the box; both my wife and I were really impressed with Porto Salvo since we both are foodies!  Food was…"
        }
    ],
    "reviews_count": 73
}