{
    "name": "La Isla Cuchifrito (149th Street, BX)",
    "place_id": "ChIJB56guc_1wokR1Wq_wcjuPiE",
    "grid": "BX1",
    "address": "276 E 149th St, Bronx, NY 10451, USA",
    "rating": 4.1,
    "user_ratings_total": 500,
    "phone_number": "(929) 246-1591",
    "reviews": [
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNHJxclNREAE",
            "text": "True place to eat ; love ot"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWkxVaExTVloyTW5aalJsOVVZVTUwY0hvdE5HYxAB",
            "text": "Excellent! Visited from upstate Ny and they were so amazing to me and the family. My daughter loved their food and loved their potatoes in their stew chicken  and they made my daughter feel special by giving her extra while eating and to take home . Felt like I was with family.  Great food great everything don’t let the negative reviews keep you away,  I Will be back !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKck1FZG9OME53UlRCNmEzWkZTRzVEUkV4SGFFRRAB",
            "text": "Food is good but since the pandemic the hours of operation are not correct."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOSG5zUEdsdnJXd0ZREAE",
            "text": "This is by far one of the best restaurants the food is so delicious 😎"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPblR0NXpiLU1yaFhREAE",
            "text": "Good food but keep in mind they’re hours are not up to date wasted my time coming here at 9 Pm and they wasn’t even open smh!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNnNTbFBBEAE",
            "text": "Anyone who says bad of this place should not judge in public before speaking in private.\nAnyone who judges thinks they know better, thinks they are better at doing things, and think they are God.\n\nOn the actual topic:\nThis place is better than most. Price is reasonable, many times during lunch hours there is a long line that testifies to the restaurant's worth, and the food is great!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJazlMVXpnRRAB",
            "text": "This is not an authentic Puerto Rican spot, same as most so called “Puerto Rican” spots these days in Harlem and The Bronx, no staff here is Puerto Rican, this stopped being Puerto Rican a long time ago, the food is typical Dominican undercooked or overcooked food, try at your own risk"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCemQtaFBnEAE",
            "text": "I have written positive reviews of this restaurant. Until now. I believe La Isla Cuchifrito is under new ownership. The alcapurrias are tastles, and so is the pork. The morcillas are a letdown. And prizes are ridiculously. Shame"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cnR5cmxnRRAB",
            "text": "They close earlier not at midnight."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncnZiSzdnRRAB",
            "text": "Do not continue mixing. The rice from 1 day ago with today's smells bad. Please😔😷…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMzRlUEhREAE",
            "text": "That attitude is horrible correct that"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNnMzZlZBEAE",
            "text": "I’m very disappointed in these people!!! I ordered an alcapurria, I realized it didn’t taste fresh at all and I ended up throwing it out. Throughout the rest of my day, I was not feeling well, I couldn’t eat at all and I was feeling super…"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfelpTS1ZBEAE",
            "text": "Un sitio bien chulo para comprar un almuerzo rapido y con sabor Latino. Siempre paso por mi pedazo de morcillas, bacalaitos, pernil con arrogant habichuelas. Desde el Portero que te Deja entrar con su hoseo de buscarse su pejeta hasta las damas que no importa lo ocupada que esten te dan esos minutos de attention. Es bien nuestro"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfalpYd2N3EAE",
            "text": "Relleno, empanada oh and the alcapuria was cold .\nAlcapuria arena tastes like they manipulated the batter to stretch it . The lady was sweet however if i come to a cuchifrito i don’t expect my empanada to be heated up in a microwave"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1NnAyMVpREAE",
            "text": "Old school cuchifrito delicious food it's been here as long as I can remember I eat yucca, salami, onions & eggs with tamarind juice for breakfast here on the regular. It's like going to Abuela's kitchen table"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aE1qX2lnRRAB",
            "text": "Ufff,,,muy rica la comida,,pedí sancocho y está super ricoo"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dUpxZnRnRRAB",
            "text": "They are closed what happened to them"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuZ2RhYnBRRRAB",
            "text": "I bought an order of tres golpes and when I got home the mangu had too much salt. I was not able to eat it. I threw up and I had to wash my mouth. I had to throw away my breakfast. Disappointed."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvODVXNVBBEAE",
            "text": "The food is changing for the worst 😫 and they close at 6pm. Smh!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3el9MclJREAE",
            "text": "Walked in no greeting, waited a few minutes no one assisted me, i then sat at the counter two elder spanish woman working behind the counter assumed that since I was black I didn't understand spanish and said she's going to wait there and proceeded to not speak to me. This felt like a racial attack, very rude staff, I will never be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMc0tXV25BRRAB",
            "text": "Look no further! A plate of tasty rice and beans for 4 dollars"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6em82Mkt3EAE",
            "text": "I haven’t been here in years but I tell y’all one thing for sure and two things for certain. This is thee best Chuchifrito in the entire state of NY #HandsDown"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MElMQ3VRRRAB",
            "text": "Doesn’t look clean and it’s rundown and the food on the steam trays looks dry and not appetizing.  I walked in and out! Compounded by derelicts by the door asking for food and money.  Not a good place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNXFmNmtRRRAB",
            "text": "They are nice and hard working people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdTdMZkRBEAE",
            "text": "Today was the first and last time I will be eating from this establishment.   I ordered  2 Alcapurria's and they tasted delicious until I almost choked on a twig that was cooked into the Alcapurria! I've got a picture of it! Sad and disappointing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdTZqQ2dRRRAB",
            "text": "Good latin food, unfortunately they have the same exact food every day. And sometimes is so crowded."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqb0s3NkFREAE",
            "text": "Food is good and you need cash to pay. Everybody is nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENzRqWnl3RRAB",
            "text": "This is a one and done🙁…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREblpmV0tnEAE",
            "text": "Me encanta la sopa de mondongo en fin todo lo que se encuentra en el menú es excelente."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdjdDbmt3RRAB",
            "text": "Muy 😋😋😋😋😋🤤😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcTdmU3VRRRAB",
            "text": "Food was nothing to be desired. The empanadas were old, fried too hard. Asked for beef, not sure what it was, but it wasn't beef. Tasted like the smell of canned cat food. The potato balls were bland, no flavor at all. Complete waste of money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MGViWG53RRAB",
            "text": "Buy two rotisserie chickens cause one isn’t enough. It’s that good."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxektEMGNnEAE",
            "text": "Excelente, el arroz con habichuela y pollo, una cosa de otro planeta, delicioso."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeEt5dkdBEAE",
            "text": "Been coming to this restaurant since i was a kid 15 years  ago the food since the pandemic has not been the same . Once they stop making oxtails on Thursday and Saturday something happened here and its just not the same"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWbEpXOUtREAE",
            "text": "Yellow rice is good. Maduros taste like yucca. Roasted chicken has absolutely no flavor."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMGJHUk5nEAE",
            "text": "Food is always on point...Best Morcillas in the Bronx!! ....yuummmy.."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbnUyaFp3EAE",
            "text": "La última vez compramos un mondongo que casi no tenía patitas ni viandas y sabía solo a vinagre. Fue la primera vez. Pues siempre como ahí e y todo es muy bueno. No sé que pasó esa vez."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1bVpmQXp3RRAB",
            "text": "All the food I ordered was not good!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMXJ2cWl3RRAB",
            "text": "Excelente sándwich de pernil y el café delicioso recomendado"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOE1pZzNnRRAB",
            "text": "Food is always fresh.  I've tasted other places, by far this is one of the best places to get rotisserie chicken and potatoes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab01fU013EAE",
            "text": "Only cash :("
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURwX2ZOOBAB",
            "text": "Great tasting food pricing reasonable"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcE9hMFJBEAE",
            "text": "Very nice staff, didn't get to eat here, but hopefully I'll change that next time I'm in the Bronx."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwa0k2Nmx3RRAB",
            "text": "La comida es muy rica pero la actitud de las personas q trabajan  ahí, fatal ni ganas de volver, no es ni primera vez que ya me dejaron claro su forma de atender es de lo peor…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcU1XZHVBRRAB",
            "text": "Food is disgusting"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobV92NFJnEAE",
            "text": "The cuchifritos were cold. I cannot recommend any right now."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobVlqbE1REAE",
            "text": "They gave me food poisoning for 5 days f this place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCb0xINHZRRRAB",
            "text": "Very bland , tasteless...no real flavor ..not even the lemonade had no flavor ..I got the beef stew ..jus tasted like water, beef and rice"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCczZ6am9RRRAB",
            "text": "I was actually disappointed after driving thirty minutes to this cuchifrito. I had hoped to grabbed a tasty quick bite to eat while doing a long drive but feed my son and invite my boyfriend to try new foods he never had before. I spent almost $50 on empanadas, relleno de papa, alcapurrias and chicharrón. The food was stale, wasn’t warm and I expected more flavor, it tasted bland. Also my boyfriend bit into a piece of bone that was in the empanada. The relleno de papa barely had meat. The lady seemed impatient and bothered. I don’t normally leave reviews but I know the food could have been better. I’ve had food there once before dining in and the food was good. I would say maybe enjoy the food while dining in."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCME9hTV9BRRAB",
            "text": "It's ok.... But the service needs to be better... The atmosphere is dull and lack character overall... Inhope they can fix this problem..."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVcE9mWDlRRRAB",
            "text": "Great Latin Puerto Rican and American food. Located on East 149th near Lincoln Hospital and CVS, long lines most of time. The pig is their pleasure from the ears   to the feet , including the stomach ( chittlings ) Yes!. The fried pork is…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrdGZ5eGxBRRAB",
            "text": "This place use to be so good but now the food Is so bland I wish the old chef would come back. This is suppose to be stew chicken with white rice. Looks so nasty taste  mediocre"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNXAyRzRnRRAB",
            "text": "If you are looking for authentic Latin food this restaurant is the place to be. Looks can be deceiving because the area is an eye sore and its a little hole in the wall so order your food and take  it with you. When you get home or at work…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzaS1QRDNBRRAB",
            "text": "One of the best Spanish restaurants in the Bronx (my opinion).  The food is excellent (I had the roast chicken beans and rice last time i visited; the roast pork is good as well).  Great hours (they stay open late). Clean.  Would definitely recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpbi0ydDFRRRAB",
            "text": "It's cash only. They are not making sure people are distanced while in there. Way too many people inside, all right next to each other. I waited outside until a few left. I got a beef pastelito and the crust was hard as hell. I couldn't…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhc3Y2U3lRRRAB",
            "text": "Delicious food at a decent price! Cash only, a little bit of a wait but worth it. I had arroz con gandules with pernil lunch special with mojito on top. Hubby had the rice, beans and chicken breast lunch special. They also have tropical drinks like tamarindo, coco, parcha and etc."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZZ3JuZWl3RRAB",
            "text": "Its nasty. Food sits out all day n night. I had a empanada and the chicken was spoiled n smelled bad. I got sick from the black sausage. N yesterday found glass in my food. Theey lucky they got one star. I didnt want to give them any."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0dDlHNFNBEAE",
            "text": "Classic whole in the wall spot in the Bronx. Just enough space for 5 to 8 people to eat at the counter top bar while everyone else forms the line to order out. Knowing some Spanish is a must, but you can always point to what you want. I…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNva1luek5BEAE",
            "text": "Packed, with a line outside... For a reason. I haven't had the opportunity to taste the Cuchifrito Cuisine like this in a long time. The prices were impressively moderate compared with other Hispanic cuisine restaurants. For $3, I had a huge alcapurria and a bacalaito with hot sauce. I didn't have anymore room."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJdzRYallREAE",
            "text": "24 hour Puerto Rican fast food in the Bronx!\n\nFound this super genuine hole in the wall (literally) Puerto Rican hot spot. This place is on and popping and they have fresh food coming out at all times. Small little spot, gets packed, order to go or stay in and dine on the little bar area (sits like 8 people).\n\nThe food was good (for fast-food-ish), staff was so nice and accommodating. My only concern is not sure how up to health code this place is. Don’t mean to bash it because the ladies that work here really stole my heart they’re such nice people. However, I don’t want to know what happens behind the scenes since the place is very questionable. Like I said, food is delicious and very very cheap. We ordered enough food for two people and drink for only $10! This included rice, beans, sweet plantains, tostones and passion fruit medium size drink. Everything was delicious.\n\nThis little spot is right by the hospital so this food is definitely worth it if you feel like eating like home away from home. Open 24 hours. Alcapurrias, mofongo, mondongo, arroz con habichuelas and much more!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVX2ViY0Z3EAE",
            "text": "The service and food were outstanding. My mom ordered stew beef, white rice and red beans. The meat was very tender and flavorful.🍽 I also ordered a cup of coffee and that too was delicious!☕…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNmVfbjF3RRAB",
            "text": "Oh my goodness.  The food was divine. People were so kind and very polite. Made us feel very comfortable.  The atmosphere was family welcomed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtb3RXWUdnEAE",
            "text": "COCKROACHES underneath the hot soup equipment!! I came here on 10/29/2022 at about 8 p:m I ordered a arrroz con pernil y modongo soup. As the lady poured the soup into the plastic container I noticed a cockroach walk on the floor underneath the hot soup holder.  I pointed it  out to her but the roach scattered back underneath.  Within the next minute I saw about 8 roaches of different shapes and sizes.  I would have given them a pass if it was 1 roach but 8 roaches!!  If you have to eat here look underneath the soup holder on the floor if you still see roaches that means they have not gotten their act together.."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NUpiZ2p3RRAB",
            "text": "I have been coming to this cuchifrito for almost 5 years now. I love their stew beef. They are good when you come and a regular. They will have your food and plate ready by time you come in."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDc0tManhBRRAB",
            "text": "I'm sorry to say but the chi ken pastelillos are very nasty. The chicken meat tasted very sour. The rellenos de papas was old and the alcapurrias wasnt like I expected to be! I was very disappointed! I would never step foot in this place again..👎😤…"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNjllZExREAE",
            "text": "This place have been serving up great food for years. Its small and no restroom. But, many other fast food places in the area if need be. Never disappoints."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJcjhLV0lREAE",
            "text": "Fantastico! La Isla in East Harlem is my favorite cuchifito aka Latino Soul Food. I discovered  this location while visiting a friend who is a patient at Lincoln Hospital in the Bronx. The hospital's cafeteria was closed so I ventured out in search of a bite to eat for my friend.  Que magnifico at East 149th Street and Morris Avenue I discovered this new La Isla location...well, new to me. Wow! How lucky could I be? They had all my favorites at extremely affordable prices with huge portions. Nothing beats La Isla anywhere in the 5 boroughs. It's not upscale in terms of layout and decor, but it's upscale in terms of hospitality, delicious food and excellent customer service. I would've given 5 stars but my meal was a little too salty. Nonetheless a great place to eat...it's a 24/7 operation with $4 lunch specials.Buen Provecho!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBb3FqNC1RRRAB",
            "text": "This place is very down to earth. It's by no means elegant or fancy. The food is moderately priced. The quality of the food is excellent. It's authentic Puerto Rican cuisine."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRenFuaU9nEAE",
            "text": "Going to a play nearby and searched for any Puerto Rican restaurant and came across it. Loved the food. Service is fast considering how busy it gets. Only negative is a wait for either take out or seating when the person in front of you is…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdV9ueHBnRRAB",
            "text": "Very busy at lunchtime! But 100% worth the weight. Cuchifritos and mofongo to truly warm the soul. Highly recommend if you are a fan of pork!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZaTZEQXpnRRAB",
            "text": "I would recommend this hole in the wall type  Restaurant , is affordable and good clean food ,soup Is never oily and the flavors are true to the culture with the seasonings the plates are pretty hefty  and is what i.remembered eating as a child or something that I would cook in my kitchen ."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVNXZiRkJ3EAE",
            "text": "Place is very small. Food is inexpensive. Staff COULD BE a little more attentive and courteous but service was relatively quick. Food was mediocre."
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzLXJYNVlBEAE",
            "text": "La comida buena pero hay una mujer que atiende que tiene su pelo  pintado rubio al pomo que es bien arrogante se cree la dueña de alli  me grito porque le estaba pagando con unas monedas dise que ella no recive  que  se cree ella no es la…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVLU12LS1BRRAB",
            "text": "I love they food I always get the chicken amd white rice and beans this last time she was a little stingy with the beans but otherwise great filling meal not expensive I love the garlic sauce make sure you add that on your food my fav Spanish restaurant in the neighborhood"
        }
    ],
    "reviews_count": 74
}