{
    "name": "Pio Pio 4",
    "place_id": "ChIJYRGEQcD1wokRw2dpEZ6sc24",
    "grid": "BX1",
    "address": "264 Cypress Ave, Bronx, NY 10454, USA",
    "rating": 4.2,
    "user_ratings_total": 1943,
    "phone_number": "(718) 401-3300",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNE5uTnNNM1pyZUdGcVQzWmFaVXAzTm0wM1VHYxAB",
            "text": "The food is not good the Jalea was tasteless and the chicken was not well cooked and overly seasoned\nHowever the server was really nice and attentive and the atmosphere was great"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUFZXTlBZMEZVU1dweVprUjFlbmhUZDBoYU9XYxAB",
            "text": "Food was excellent, ceviche mixo was delicious. It was very fresh and served Marvin was extremely attentive and friendly."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvd2QycGxkR2RIVmpNNVRtdHpSeTFEVXpGR2NVRRAB",
            "text": "It’s rare to find such consistent quality. Every item on the menu is a winner. A wonderful experience overall."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5QlRWZEZSekprUzFKeGNFUTVVMmhWWnpGV1ZGRRAB",
            "text": "Food was delicious"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MlMxZGhURWRNYW1JNFlqTnRaRUYwVlZWdlRHYxAB",
            "text": "Amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUlZuVm1TM2Q2YlRKU2EyWmpWRTVmYW01ZlNrRRAB",
            "text": "Great hospitality the food is amazing I would go again. W Pio Pio in the chat."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdWNGOVRWMHRyYVRaS09UaFlhakpCV1RCTlNrRRAB",
            "text": "Chicken was expensive and super salty. Staff always expect tip when it should be the owner paying them their wage. If i order take out im not tipping!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSU0xcHZiV0l0U0hWQ1JtZGhjR04zUlMxQlIzYxAB",
            "text": "This was a great restaurant. Our group was pleased with everything that we ordered. The service was also very professional. Their appetizers were delicious. Their drinks were tasty. The steak was cooked just right. I would definitely recommend this place when you are in the Bronx area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RNGNsVnVkRUYxUWtWclpsQkJRelZEYlhoQ1gzYxAB",
            "text": "This is my favorite Pollo a la brasa, the chicken is flavorful and juicy. I recommend the Matador combo which brings a bit of everything. The sangria will have you feeling nice by round two. Recommend for lunch and a date or family time as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aS1pWZG5aR0o2YkVodWFISmhNM05aT0VsdFNVRRAB",
            "text": "I’ve never had this experience before—I have a service animal with proper paper work. The “security” man would not let us in to the restaurant without a paper version of his service paperwork. I’ve been to restaurants across the city as well as across the country and have NEVER needed physical documentation other than my digital copy of my service letter as well as my letter from my medical provider. I will never come to this restaurant again with this type of discrimination."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWFZWaEpkbnB5UzJKbU5HVm9RMlJzY1RSRmEyYxAB",
            "text": "Would not let me in the restaurant even though there were people in it eating."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5aXEzQkFnEAE",
            "text": "Overpriced.  A family combo is 74 plus tax.  Nearby the average family combo is 30 dollars for the same items.  Not sure why people continue to spend here.  Not anymore.  Overpriced and over rated."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjM1N6SnZORlJaTkc1emVIbHhVM3B5WjJRelJWRRAB",
            "text": "I just ordered take out… this place is fantastic.\n\nThe chicken and maduros were so good…blown away. 🙌…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NVpXODViemgxV0U1TWR6WkJRVFp0T0RRd1lXYxAB",
            "text": "Food is great but expensive..\n$27.00 for rice and beans is ridiculous\n(and those were side orders)"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRFVuQXlaa1JPUzNCd1p6aExUVVo1TXpCcmRtYxAB",
            "text": "No me gustó, empezando por el papel que le ponen a la mesa, no merece mantel el cliente...mejor dejen la mesa vacía, los platos que pedí, nada que ver con la reseña del menú, perdí mi tiempo, mi dinero y la oportunidad de comer algo accesible y agradar a mi pareja....pedí lomo, 35 dólares, recibí carne de res, con arroz blanco, ajíes y un gravi (ese plato no merecía ni por muchos la mitad) y el ceviche, ni diré la reseña....de bebida, sangría...oh la sangría, si una vez fue sangría, debió ser hace semanas, y aún la mantenían en el congelador...no, no recomiendo para nada este lugar, fuí porque ya había visitado el pio pio de Manhattan y la pasé bien, pero en el pio pio 4, me dejaron saber claramente, que estoy en el Bronx"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtb3UtM2Z3EAE",
            "text": "It was ok but I think it could be better."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S1gyMVRabWhGVWs1dmNWb3pjVTU2ZFdwclVFRRAB",
            "text": "Desagradable la jalea mixta es un asco no engañen que impotencia"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJak5DblBBEAE",
            "text": "Food: 5 | Service: 5 | Atmosphere: 4\n\nSeating type: open area seating. They do have a separate dining areas upstairs. This place would be great for a crowd\n\nVegetarian options: they have vegetarian options\n\nDietary restrictions: the staff is very accommodating\n\nParking space: no designated parking\n\nParking options: Street Parking only\n\nWheelchair accessibility: the restaurant is wheelchair accessible\n\nThis place is nice and clean. Staff is friendly and patient. The music is loud enough to enjoy and still have an engaging conversation with other diners. They are serving quality food with good sized portions at fair prices. Stop in if you're in the area"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dWJVbHRaMVEzVG5RdE9IQndkblV5YkRGNWJYYxAB",
            "text": "My previos visit to this restaurant was great, but haven't been there for years. The Menu has changed, no menu for family or  for two tree people.\nThe gravy of my lomo Saltado was salty, and made the rest of my food salty as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKekk5LTdxNXAyYy1nRRAB",
            "text": "Love the food.  It never disappoints. The service is also always amazing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQNzkzclBPNGNhM1pBEAE",
            "text": "I recently dined at  Pio Pio 4, a cozy Peruvian spot that completely blew us away. From the moment we walked in, the warm, inviting atmosphere greeted us.\n\nThe chicken was what stood out the most.  They gave an ample amount of food and checked  in on us periodically .\n\nIf you're looking to explore authentic Peruvian cuisine with bold flavors and heartwarming hospitality, this place is a must-visit. I’ll definitely be coming back for more! Our server Marvin took very good care of us!"
        },
        {
            "date": "5달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJNjU5dnVrc18yZ3p3RRAB",
            "text": "Excelente comida e atendimento impecável, super recomendo!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKam9pYWJ5OUtuYXpRRRAB",
            "text": "expensive food but tasty"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKLUVfSXloLU5iaGVnEAE",
            "text": "Muy buen lugar para comer la atención es  rápida para ir en familia lejos de todo ruido o molestia lo recomiendo al 100%"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaFo2YmRBEAE",
            "text": "Good customer service\nFood was filled with flavor\nGood portion amount"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNTZDR0VBEAE",
            "text": "A great spot for a family gathering.  Food and service was amazing!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJemZualRREAE",
            "text": "The Maduros were all stuck together and mostly uncooked. Chicken ice cold but was replaced."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNk9fNVlREAE",
            "text": "We had the rotisserie chicken, chofan rice and sweet plantains, every came out fresh, and  the taste was amazing!!! We will  be back soon."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNEp2aTBBRRAB",
            "text": "After spending $200 dollars and im done eating i go outside to have the secruity tell me is policy to not smoke a cigarette in front of the restaurant after i spend my money in this restaurant. Food was amazing but the service was horrible ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ejVpV1J3EAE",
            "text": "Great family restaurant. Limited options on the menu but the options are tasty. We had the baked chicken lunch special with rice and beans and the steak with peppers white rice and French fries. The chicken is so good. Much tastier than the Lechoneras. But I wish they had some garlic sauce. The steak was really good. Definitely had lots a grill flavor which came through really nice. They have their own house wine which was good. Overall great spot would definitely come back even though they forgot to give me my bottle of water with my chicken lunch special."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OE0yaEp3EAE",
            "text": "Once I got here, I got seated right away and a waiter took my order. The restaurant looks clean and organized. The food came out fresh and hot. Got sangrias for dinner to drink and filet mignon steak was great."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MDRUcUNREAE",
            "text": "128$ order and simply cannot follow special instructions. I ordered directly through them and called them and was basically told not their problem. Like honestly how hard is it to read the ticket printed out in the kitchen!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNFpyNktREAE",
            "text": "Abundant food at a fair price, space is small, fast and great service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXM2UFFnEAE",
            "text": "Overpriced. Not many options."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBaVpHWDdnRRAB",
            "text": "Chicken too much  money"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaW82aXl3RRAB",
            "text": "-The lomo saltado, made with filet mignon, is a delight!\nSome dishes are overrated, watch out for that.\n\n-Ell lomo saltado,  hecho con filet mignon es una delicia!!\nAlgunos platos están sobrevalorados, ojo con eso."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfa0pXZ0VBEAE",
            "text": "I been coming here for long time. Today i make a delivery to take out and I asked the lady I want enough huancayina sauce.. when I get home it wasn’t enough sauce.. it was very dry I even call and speak to Jose.. bottom of this will never come back in this location again"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNnFXNGFREAE",
            "text": "Fui a comer el pollo a la brasa y no me gustó la salsa de ají (verde ) debería ser la verdadera salsa de ají de pollería como en Perú que es con ají amarillo huacatay y demás pero parece la salsa q hacen los mexicanos la verde y no me gustó"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aWRfUnZnRRAB",
            "text": "I have to admit for a catered event the beans were kinda watery . The lomo had more of everything but steak. The Pollo top notch the avocado salad amazing. The chofan is like woo The best ever.  The atmosphere chill inside.  The area .outside not so much."
        },
        {
            "date": "수정일: 10달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5LXJLMFFBEAE",
            "text": "😀…"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQemRpRnFBRRAB",
            "text": "La comida ya no tiene el rico sabor por el que lo frecuentaba, la salsa del pollo no sabe a nada, subio demasido sus precios,  pero no la  vale pena pegar por ello, no volvere a ir , quede decepcionada!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOHMzaGt3RRAB",
            "text": "I haven't visited Pio Pio in 9 years. I finally returned to NYC and couldn't wait to visit. Of course the prices have more than doubled but the food was not as good and the Sangria was not good at all. That used to be my favorite sangria. I left disappointed."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQZzlfbXlBRRAB",
            "text": "Smallest chicken i ever seen and dry.  They lost their touch"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNWJTUVpnEAE",
            "text": "Ceviche mixo was horrible the taste was like the limes were going bad, and they still used them\nto make it worst the taste of the rotten limes and cilantro was off so I did not…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeTZpbzdRRRAB",
            "text": "I ordered the lunch special. Chicken and beans were too salty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaWY2QkdnEAE",
            "text": "The waiters were nice and friendly. The food was awesome! It  was my first time ever eating at the restaurant. I think the UFT had did a reservation for 20 + people as a holiday dinner treat for all of our hard work throughout the school year! I plan on bringing my family there to eat one day there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcmVlMjBBRRAB",
            "text": "Our table had been waiting for a while to get service and we were a big group. They were not busy and had staff standing around. When we did finally get service and ordered our food for some of our party came cold. The lomo I ordered tasted about average. I have much better Peruvian food and for cheaper prices. Do not plan to return again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxaGR1bWlBRRAB",
            "text": "The food is good, So I won't gripe about some of the weaker dishes like the Calamares Fritos, which more likely than not will be served over-cooked.\n\nThe service is where the Pio Pio experience can get spotty; Dining in during the lunch shift means you're likely to get newer servers and service that can range from fine to frustrating.\n\nI do still recommend, but be wary of time of day if you're dining in."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrMVlUd2FREAE",
            "text": "This place was great!!! Staff was super friendly and food was amazing. We got the Matador combo and shared family style. We also got the orange juice. The rotisserie chicken and rice and beans stole the show. We also got the plantains and it was yummy:)"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dWF2eTNnRRAB",
            "text": "Food is super delicious! Everything on the menu is good. Drinks are amazing and strong here too. Waiters are nice and very quick. Even when the place is packed, things run very smoothly."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOXRETHFnRRAB",
            "text": "I love the tasty chicken at this place. I travel from Mount Vernon to pick up their chicken before I get home. It's always so tasty along with the rice and beans it's the perfect dinner. The place is cute and the vibe is cool but I'm usually on the run. The manager is cool. Stop by if you can."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1d3JhNlRBEAE",
            "text": "This is a once a month sit down meal. Matador Combo in the video. Peruvian Rotisserie Chicken, Salchipapa, Yellow Rice & Beans , Avocado Salad, Drizzled w/ Aji Verde green sauce on everything. Pio Pio is my out of town guess favorite Bronx Spot !!\nSo in the Month of April 2024 I am back and since it was a self mission I just did a half of that good Peruvian Chicken with the Aji Verde green sauce."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpN29PcldBEAE",
            "text": "Servers are nice and friendly but did not know that soy sauce can be added to peruvian fried rice,, they should hire Peruvians so they can serve staff better with knowledge, Also, the lomo saltado did not have any taste, try having a peruvian cook.i asked the staff and no one from peru was there."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpMVp2SXpnRRAB",
            "text": "Great lunch special $12.50\n1/4 chicken with salad, 1 side, soda. The chicken is very tender. Other items I like are the Empanadas, Avocado salad, or Cebiche. The Jalea (fried mixed seafood) platter is good for 2 or 3 people."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXOW9QSHZRRRAB",
            "text": "Limited menu but taste is amazing. This is the first one I've been to in the Bronx. I got the family style meal and it was more than enough food for me and my family of 4. We did have to order 2 extra orders  of rice and beans to have enough for all of us because they only serve it with a single serving or maybe a light portion between two people.location is cozy and they checked us all to see if we're all vaccinated."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrX3VIaTJBRRAB",
            "text": "Best  Rotisserie chicken  I have had in long time!! I was there close to closing time and the food was all fresh and delicious!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa003VnF3RRAB",
            "text": "In the past, I have noticed little things in the kitchen, but never enough to write a review but today when I went to go order to go, I was extremely disappointed with the kitchen staff. One of the kitchen workers dropped all of the metal “to go” trays all over the kitchen floor and even some going into the garbage. When I noticed that he was not throwing the trays out and actually putting them back for food to be served on, I went to take a photo and his other coworker tried to block the picture.\n\nJust know that if you ever order here to go, those trays have bacteria all over them and you can potentially get sick since they placed them back for food to be served on. It’s extremely disappointing, the lack of concern that this restaurant Has for the customers health."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd3ZYeUxnEAE",
            "text": "Humble Peruvian eats in New York City, we went to the Bronx location there appears to be about 10?  .\nAnyway,\nQuick and efficient service. Fair portions. Nice service. Juicy chicken and crispy plantains and a nice set of side selections. Great spot for a casual weeknight dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwN0lPN3lnRRAB",
            "text": "Food taste good just very very small portion of rice. Rice is cheap. I understand things are up but rice is cheap. This was my 34$ lunch today. Maybe half full on the 7” plate. Steak was pretty good tho."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNmRfZlNREAE",
            "text": "I enjoyed my meal at Pio Pio.  The sangria and the food were absolutely delicious.   The service was great.  The atmosphere was really nice. I would call this a hidden gem and definitely worth a visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z0tuWnh3RRAB",
            "text": "Lunch specials run until 4pm and there are great deals. Salsa Verde is amazing. A lot of food for the value. This was quarter chicken lunch specials, an order of salchi papa and tostones."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZNTVDOW9nRRAB",
            "text": "Amazing food. Possibly the best food I've ever had in my life. Peruvian cuisine is superior to almost (if not) all food. And the way they made it here was perfect. We had great service and it was delivered quickly. Also, the pricing seemed fair."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRejkycXZRRRAB",
            "text": "I have been going to the original Pio Pio located in Queens for over 10 years. I am a Bronx native so when they opened a Bronx location i was very happy. Tbe food is always good as well as the service. It's a small restaurant so there may be a wait, but to me its always worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMGUzc3dRRRAB",
            "text": "Ordered rice n beans fried plantains and avocado. Well the meal was not what I expected. The rice was a little bit old and hard. (The bottom of the pot portion of rice). Way more rice was given than beans. The fried plantains was also old and fried very dark and very greasy. Last but not least...the 7.00 small portion of avocado was not fresh or fit to eat at all. I wouldn't even give it to my dog if I had one. Like...what do people that work in the kitchen think? Do they think they can just give u something they wouldn't eat themselves? I will never order from this place again. I took a \"eat at ur own risk\" with the plantain and rice n beans bcos of hunger knowing it wasn't appetizing and bcos I'm at work with limited choices. I'm vegan and never thought the simple meal I ordered would be a fail. I'll never do that again."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3ME1MR2hBRRAB",
            "text": "I always get chicken, saffron rice and red beans! Don't forget the green sauce (a little spicy)! Food is great! You can call your order in.. or sit in.. Service is always on point! AND... they have wine that you can also take to go!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlLWRDTFV3EAE",
            "text": "the food was so good. we tried Lomo saltado and a lunch menu, the chicken was so delicious.. I order a pitcher of sangria, it was good, a little strong but it was great. I had a good time.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNUxQNkdREAE",
            "text": "Food was very delicious, came out in a matter of minutes, our server was very attentive & kind. 2nd time trying Peruvian food and it hit the spot. Thank you Pio Pio."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcEtMUzZRRRAB",
            "text": "A local favorite, they do not disappoint. Great prices even post-pandemic. The shrimp in garlic sauce with yellow rice was delicious! Great flan too."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNeWUzVFZ3EAE",
            "text": "I really would give it 3.5 stars.  Sangria was on point!!  Calamari and Tostones were a bit bland but hubby enjoyed his shrimp dish very much!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNzduWkN3EAE",
            "text": "Absolutely delicious. Everything we ate was amazing"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrdGJlZXR3RRAB",
            "text": "Wonderful food and polite service. Had the papa a la huancaína and the matador which is enough food to feed a family and so good. Sangria was beautiful but too strong for my liking. Frozen sorbets are delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcDVIY1RREAE",
            "text": "Food here is delicious-!!!  especially if you want some real ceviche, great customer service too. Bathroom clean too that’s always a plus🫶🏼"
        }
    ],
    "reviews_count": 72
}