{
    "name": "iNine Bistro",
    "place_id": "ChIJwSbhU1j1wokR15Mc9bFPbuI",
    "grid": "BX1",
    "address": "53 Bruckner Blvd, Bronx, NY 10454, USA",
    "rating": 4.3,
    "user_ratings_total": 361,
    "phone_number": "(929) 265-9682",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUU4wbzROVkI1Y1c1YU5sZzVUbFkzYnpSUE5XYxAB",
            "text": "The reviews scared me... but the food is delicious here and the service is great. I think I got the sweet chili wings and the Rasta pasta !"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NlJubFRURzVsZWpOMVpEQktNSG94YTNZNFYwRRAB",
            "text": "Yeah never again gratuity at 20% is crazy knowing the workers not gone give the best service...\nFood is MID I ordered jerk wings n fries my lady ordered chicken n waffles n one of our daughter order burger and fries and our other daughter didn't want nothing but she had some of the waffles by the way she's 8 and said they were very dry also didn't taste like vanilla.\nThe jerk wings were good but the fries were hard but they're shoestring fries what could you expect\nThe chicken with the waffles were mid tasted like NOTHING! I swear to godddd\nWe also ordered two drinks mango margaritas and they were WEAK don't believe the lies of these other reviewers as a mixologist they use the LOWEST quality tequila for margaritas bar code is HORRIBLE didn't even taste the tequila\n3 of us ordered 150$ for 2 drinks 6 pieces of jerk wings n fries, chicken n waffles, and burger & fries OUTRAGEOUS NEVER AGAIN‼️\n\n&& I'm still hungryyyyyy after spending $150 in this economy"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGc05YWjRjVkpUWWtNdGNqTlRaREZqV0dOTFduYxAB",
            "text": "Very expensive on the weekends.  I would advise that you come when they have specials.  A whiskey was 37 dollars.  Pre-game people.  I would only come back on their specials night."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTVdGZFZlR3RPWTFoc2JIUlJaakZMVERSMlRFRRAB",
            "text": "Went to the Bronx to visit this spot and try their dishes and the vibes here along with the food and atmosphere is dope.\n\nFriendly staff. Customer service is epic. The food will blow you away and just an all round amazing environment."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeVlVOU9lbE5hWDFoeVZuRTJPSGd0V1VOWVJYYxAB",
            "text": "The things I have to say about this place .  ! Where do I begin??\n1) I walked in, the bar reaked of mildew smell. I had to put cologne on to bear the smell.\n2) Came in during happy hour. But was never informed what the happy hour drinks or menu was... so paid full price of $19 for a long island iced tea which would've been like 9 bucks at Applebee's!\n3) The staff never returned to check on me and if everything was well... horrible service, especially if I have to flag you down.\n4) The food was great however! I ordered the rasta pasta with salmon (a bit spicy). Nevertheless it was great and that's the only thing they got 5 stars on.\nAs a single man, this was not the spot to mix and mingle with other locals as the patronage is very low during the week."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeFNYaFZlRzR0UlZkdmNESk5lWE0wV1RkTWNXYxAB",
            "text": "So I've been here twice. Both times I got food to go and waited with a drink. I got the Salmon burger both times and it is DAMN GOOD! They do not take the cheap route and and buy frozen salmon patties, often loaded with filler and excessive peppers. They make the patties themselves with love and seasoning. The second visit I placed a pickup order. When I arrived they were running a bit behind and also did not have the patties. HOWEVER  their manager (forgot her name but she was tall lean and had beautiful chocolate skin) said they would provide me with fresh fillets and gave me a free cocktail while I waited (you can have it to go if you like). As a black woman I love supporting black owned businesses. I do not expect perfection, and mistakes happen but it's HOW the staff responds that counts, and their response was IMMACULATE. Everything you'd expect. I always tell people to come here whether it's to go, or for happy hour. Great food. Strong drinks and wonderful staff!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oV01VaENOa1ZqTmt0V00wWjVSbU5rYVU5M2JXYxAB",
            "text": "Their customer service was excellent from start to finish, making my friends and I feel really welcomed and well taken care of. The food was great overall, although I was a bit bummed that their steak was sold out since I was really looking forward to it. However, that didn’t take away from the amazing flavors and quality of the dishes I did get to try. The DJ was absolutely incredible, creating an energetic and fun atmosphere throughout the night. The ambiance was super creative and had such a unique vibe that really sets Inine Bistro apart. One of my favorite spots was definitely the Aso Garden in the back—it’s a beautiful and relaxing area that adds so much to the overall experience. Honestly, this place is a definite must-visit and I’m already looking forward to going back again soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeFZIVjRNeTFFYm05ZmRpMW9OblJRUlU0M1pFRRAB",
            "text": "We just stopped in to see what was on the menu and decided to stay for dinner. Everything was delicious and the wait staff was friendly and accommodating. Our only concern was that one of the patrons was furnished a hookah and the smoke was definitely not enjoyable. One of our party has severe asthma."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GeU56SkpSVVJLUzJZek0zSXliak5oWTBsVFIwRRAB",
            "text": "I found out about this spot from a review on tik tok and I am glad I did\nMyself and two friends went to check it out on Saturday. The atmosphere, food, drinks and customer service was great. We are looking forward to returning and twlling others about the spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNGN6VlNRM1YyVG1sdWRsOHRaVUp1U1RoRlozYxAB",
            "text": "Wednesday night is my favorite night to go in. $1 wings. Which are the best dry rub in the city. The peanut and lemon pepper were delicious. The mai thai and mango lemon drop drinks awesome sauce. The shrimp tempura were huge and flavorful.  Also the best i ever had. Good lobster roll. The fufu was devine and the ox tail with cabbage and coconut rice outstanding.  Goid bread pudding and Tres Leche. The karyoke was do fun. Great music and crowd."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WelJEaFFjeTFOU1Rkak5WUnRVakpTWW5SVFEyYxAB",
            "text": "Just wow. The employees here took such great care of me and my family. Thank you so much for your help and understanding."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocE4yUm1ablk1VFUxSVMxUllaVk5pUTBwRldGRRAB",
            "text": "Took a while to order our meals. Waiter and waitress were nice when they were available to take our order. Food was good, but not for the price. The wings were 6 for $15. A little expensive versus a place like wing stop 6 wings fries and a soda for $12. At the end, it took a long time to even leave since no staff member had a pen for me to sign my receipt."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkT00xVldOa0k0YkZCcmMyWTRlVEJ0VVY5MFRWRRAB",
            "text": "When we arrived, the welcome was inviting and warm, however we waited very long to have our order taken. We observed others who arrived after us getting their order taken. It was discouraging after the that reception.\nThe food was good but service for us was not."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTGRYa3dNSGh0VVRkcVJuSkNhVWxTVURWUFgwRRAB",
            "text": "Well made margaritas!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcWFubDZlR3BIWkRFd2VYZExiRzh0VGtSdVprRRAB",
            "text": "I don’t know if they didn’t have enough staff at the time or they just wasn’t attentive. Upon arrival no one greeted my group, we stood standing by the entrance for about 7 minutes until we decided to approach a staff member, the staff finally sat us and gave up menus. It took my group about 10/15 minutes to decide what we wanted, we again had to call over a staff member so we can order, then staff decided to tell us that they’re not serving food until 5pm (it was only 3pm) so we were there for a little over 20 mins for them to tell us that is crazy"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUGVVZFJiRTFHTldzdE1YaHRha2R1Yldkb1ZGRRAB",
            "text": "One of the best restaurant, came here from NC for my birthday and had a blast. Great Oysters and the wings are bomb! Ali , Trevor and the staff were wonderful❤️ Definitely will come again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjdE9FWnNSbkJHZDJkeldHMTJUV1JTZURoaGNrRRAB",
            "text": "Wowsa! Such an amazing atmosphere, the food was incredible, the staff was exceptional. Ate here our first night in the Bronx and we were more than impressed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCd2ExZDZSbmR5TmxkRE4wVlNkRFJYTTFKc2FIYxAB",
            "text": "I’ve been coming here for over 3 years with my husband and the service have always been impeccable. It’s an upgrade every time we come back !"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLSHFtZmpHaTlTVGJnEAE",
            "text": "This spot is a regular for me. I have been going here since 2022. Amazing place, food, and excellent customer services. Shout out my favorite server Ali and manager Teresa. Amazing folks. Always come back because of them!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOVHhzZnliNFlpc1dnEAE",
            "text": "Inine Bistro is definitely my new favorite restaurant\nInine has the best Happy Hour Monday-Friday 3-7 PM and Wednesday’s You Have to check out Inine’s Karaoke.\nInine Restaurant is a whole vibe. When you visit you have to check out The Garden. As soon as a walked through the Garden Door I was greeted with such a beautiful atmosphere. The scenery, the artwork, there’s a stage and even a huge screen to watch your favorite game. The service was great and Saratoga Water was served on the walk in 👌🏾✨✨.\nThe drinks were perfection and\nThe food is absolutely delicious ✨✨.\nHere’s What I Had\nDrinks :\nNephew Punch\nMargarita\n\nFood :\nInternational Chicken Wings (Hennessy BBQ) Super Yummy 🤤\n\nFisherman Lobster Roll 🦞 (Very Delicious You Have To Get This)\n\nIsland Oxtails ( Cooked To Perfection and they have me extra gravy ) ✨✨\n\nLollipop Lamb Chop Maquis Style\n(One of My Favorites ✨✨)\n\nQueens Bread Pudding ( Fit For a Queen ) 👑 the perfect dessert.\nThis is definitely a restaurant you have to visit this summer. It’s perfect for every occasion , they offer a great Brunch and Dinner Menu and the vibes are so fun."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMUFduOFNhOXFHMWlRRRAB",
            "text": "Such a great vibe! I stopped by yesterday and was so impressed from the moment we walked in, the energy was just right. I ordered the goat and jollof rice, and the food was so good. Perfectly seasoned and full of flavor. Our server was attentive, and I really loved the backyard setup with the DJ it created such a chill, welcoming atmosphere. I’ll definitely be back!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzbnVULXNRRRAB",
            "text": "So yesterday I had my annual galentine's brunch at INine bistro and it was AMAZING!!!  They catered to my every need and paid attention to detail which I appreciated.   They even made personalized menus which was a nice touch without me asking.  The service was  impeccable!!  The food and drinks were all on point!  Thanks to the manager, Derril for all his hard work.  The DJ had us rocking and all of my guests were pleased.  Will definitely be back soon.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOUFRfWWJSdll1Q3BBRRAB",
            "text": "Wow , nice place\nExcellent food 😋\nThe manager is very helpful and very professional.\nGreat music 🎶"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJakM2ZFhCZ0pmZ29nRRAB",
            "text": "My kids took me here for Mother’s Day and it was nice atmosphere was nice the staff was great the food was good plus the DJ was great nice place to go just to get out the house"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMLVRzOHI0MGJUUG9RRRAB",
            "text": "I went for a work party, and I enjoyed myself. The music was all vibes, the food was delicious and the drinks were heavenly!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYWl4Y2ZPc18tWFp3EAE",
            "text": "Good happy hour deal!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOdmwwLTNCeUpmbE1BEAE",
            "text": "The food is great however they need to hire more people. They are always short staffed and extremely slow with the service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOLTZsNm1BdWJHbDl3RRAB",
            "text": "I came here with my friends for happy hour the drinks the customer service the vibe the energy  was super amazing will definitely be making this one of my regular spots …….. sincerely the happy hour queen ❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJTEh3S3Zhb292YlZ3EAE",
            "text": "Running out of pint glasses and wine glasses at 10pm on a Thursday is crazy.\n\nNot telling us till almost 25 min after we placed our order is even crazier.\n\nThanks for the free water. Was looking forward to the wings and exploring the rest of the menu, but the timeliness turned us off and made us feel like and afterthought that wasted our time.\n\nShould have just walked to Harlem, but felt compelled to support our Mott Haven neighborhood.\n\nThe garden looks great and very instagram worthy, just a shame it isn’t editable. Maybe invest in staff attentiveness training and cups instead of social media and vibes. Because we would have waited provided our drinks came out timely. The kitchen could have been backed up, but a beer and a glass of wine only require a pour, if you have cups. Even a plastic backup option till the dishwasher catches up?\n\nI’m pissed and still hungry."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOMlcxN1NUaHEtSWN3EAE",
            "text": "They had one waitress for the whole back yard area. The waiter took bought out the wrong drinks. It took me over an hour to get my check"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb3J1WDZ3RRAB",
            "text": "So I heard good things about the establishment...job reserved it for happy hour...waited 30 mins for first drink (rum punch)...decided to order food ..sliders (wanted lamb, but they didn't have, so got chicken)...it's Friday at 3:30PM...why no lamb...anyway, I then order wings...they come 20 mins later...and the next drink doesn't...worker says something like they're backed up and there's nothing he can do. Okay...I ask should I just order directly from bar.. he's like sure you can, as he bringing drinks out to a larger party...sigh...disappointed...mozzarella cheese stick had no cheese 😕"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM2ZpQzFRRRAB",
            "text": "Me, my mom, and my boyfriend stopped here to grab something to eat. We weren’t aware it was still brunch which was not an issue. We ordered two orders of wings, sweet potato fries, steak & eggs, and two lemon drops. The food was meh. I had the steak and eggs which came with onions and mushrooms. It was 80% onions and 20% steak. The steak had a small amount of flavor, the eggs had zero flavor and neither did the potatoes. The lemon drops we ordered had to be the worse lemon drop I have ever had. Then to top it all off, the service was horrible. It took them well over 10 mins before coming to our table, somewhat understandable as it was packed. We ate the food and sat for more than 30 mins waiting for a bill. It was so long we got up and went up towards the bar in order to try to get the bill. The man at the bar then said oh no the girl will bring the bill. It took her 20 mins before the bill was brought to the table. Based off this experience, I definitely will not be back. Slow service, subpar food and everyone is packed on top of each other like sardines."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdHRhdE9BEAE",
            "text": "It's definitely a must go to spot. Whether it's your birthday, date night, or a solo getaway. They don't miss from service, food, drinks and atmosphere. Music is always good. The owner seems to always be on site. Their new bartender Chris was attentive recommended drinks and checked in. I'll see them again soon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbjRiS1BnEAE",
            "text": "Sunday brunch. Nice place, very nice staff but very very slow service. Food & drinks took so long to come out. Perhaps more hands in the kitchen & bar is necessary. Food was just okay, expected better."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdmNURkZnEAE",
            "text": "My new favorite spot. I had fish taco and lamb sliders. Delicious everything. Nice, cozy spot, with great seating in the back. Its a Nigerian-infused restaurant."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvN2EyUmp3RRAB",
            "text": "My experience here was beautiful for my first time beinging since it was renamed and done over. How they redid the outside back area is beautiful. It was a bit cold, but after u get then drinks in you (rum punch 👊🏾), the cold was a thing of the pass. Thank you for the invite tonight."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOGFqN0hnEAE",
            "text": "I’d definitely come back for the food and drinks! I had the oxtails—so good, I almost licked the plate. And that Culture Clash drink? A vibe all on its own."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc2IzZ0tBEAE",
            "text": "I visited on April 15, 2025, and enjoyed an open mic event, which was interesting, though I wasn't entirely sure what to expect. I ordered food for dining in, but several items I wanted were unavailable, and the menu options were quite limited. They did not have the fufu with egusi, the Rasta pasta, or another dish I can't recall. Since it was my second time there and I encountered the same issue, I assume those items are not part of the menu.\nI ended up ordering a beef taco, which I rated 5/10, grilled jerk shrimp at 7.5/10, Montego Bay jerk lime at 5/10, and truffle fries at 4/10 due to them not being crispy enough. The cranberry juice was disappointing at 2/10 as it tasted watered down. The Nigerian jollof rice and goat stew also received a score of 5/10; there were only three bones with minimal meat and a lot of fat, which made it difficult to enjoy. A 20% service charge and sales tax were added to the bill. Overall, the service was fine, and my server was friendly, which is why I would rate the experience with three stars."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcHZpR1BBEAE",
            "text": "My new Favorite place, Black Excellence in Abundance!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdGM2Z25RRRAB",
            "text": "The food was fresh. The wait time was less than 10 minutes. The waiter cleared the table quickly.  The buffalo wings and skinny fries were delicious 😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdUpyWXlnRRAB",
            "text": "Malcolm was attentive. Hookah young man had them bussing and the female host was on her game fixing any issue I had.. I'll be back for that Jolof rice. Great spot"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJb0tEWlFBEAE",
            "text": "Super ambiance et avec des prix vraiment abordable."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3a3BQZm53RRAB",
            "text": "I had excellent service tonight!! And food and drinks were delicious… ok I have to change my review, I came in today and the service!? Non existent and we was at the bar .. the drinks were juice. The wings however were good but not good enough for me to come back.. they messed up with the drinks for me"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bDZfNTdRRRAB",
            "text": "My very first time, but differently, not the last.. The first person to greet us was 2D and Cappuccino. The staff, atmosphere, food, and drinks are fantastic ....."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NnJtWUt3EAE",
            "text": "Has fantastic food is pricy for the area. Substitutions (ie switching say fries for rice or a potato should be something considered even for a slight uncharge) is the reason a star was removed. Back space is ample, and drinks are good. Would return if I'm in the area"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3clktcHpnRRAB",
            "text": "I went here last week for a meet up with a women’s empower group. Though I think the place is very cute (decir and vibe), it was not a great selection for a dining experience where we were meant to connect and network. I didn’t mind how loud the music was when they did a birthday turnip for a young lady celebrating with her party, but as a general rule, I dislike super loud music when I’m eating.\n\nWe could tell the staff was overwhelmed with how packed it was since the service was slow and subpar. The servers were kind and respectful, but I asked 3 times for water and definitely left there with no water. The food came out sporadically which was understandable since our group arrived and ordered sporadically. But my whole order was in the first order placed. I got my first  appetizer and drink with the first batch of good but didn’t get my second appetizer till another 2 orders worth of food came in.\n\nThe food was decent, but the lamb sliders were way too overcooked for me since I like my lamb and beef medium rare or medium the most cooked. The flavor and spicy sauce were good. My second drink was the rum punch which I should’ve gotten instead of the glass of wine I hit first. It’s literally all alcohol which I normally don’t like and prefer a well balanced drink unless I’m doing bourbon or cognac neat. It wasn’t the best tasting drink, but it’ll get you where you want to go.\n\nThe only major gripe I have with this place is the sign out front. Nit only is it instructed by the awning on the side that says the name, the name is so small in the corner. The other side if sign shows all the cool things inside, but since the bane of the place isn’t on there, I walked past the place back and forth 3 times before finally seen the small name on the sign. One more pass, and I was walking straight back to my car and driving home.\n\nAnyway, I drive past this place twice a week on my way home from the Bronx and will definitely visit again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbjZPcWNBEAE",
            "text": "I decided to get dinner at this Caribbean restaurant. When I arrived I found parking on the street. I walked in, and the place was live. I was greeted and brought to the back. The music was bumping. I ordered with nice servers Coumba and Ali and they were great! I ordered:\n\nVodka Martini\nRed wine\nBahama's Trip Jumbo Crab Cake\nLagos Suya Peanut Wings\nOxtail\nRed Snapper\nBrownie\n\nThe food was good and my favorite was the wings! I had a really good experience at this restaurant!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMDZiSlpnEAE",
            "text": "Love it here! The employees and patrons are all a Vibe. Wednesday is the best for my  vibe. Check them out!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnX3B1MnVRRRAB",
            "text": "Everything was a 10/10 thank you Malcom for the hospitality will definitely come back !!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnenBHZ0tnEAE",
            "text": "Very good bar food- I had the lamb sliders with fries , the back space is very chilly so wear a sweater. The place is beautiful"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNWVLTHlnRRAB",
            "text": "Found this spot while visiting a family friend in the South Bronx. Overall, there is a lot of potential in this little spot. The layout could be improved to maximize the space and the floors could do with a bit of updating. The drinks were perfectly blended, the staff were accommodating, attentive, and friendly. The food was on point and the portions were well worth the money. All in all this spot is worth a visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzME92MkR3EAE",
            "text": "I came here a few days ago and I have no bad comments. The service was on point everyone made us feel welcomed and comfortable.\nThey had a DJ there a she was playing all of the jams non stop..\nThe FOOD!!! on point. The pictures ont do it justice.. nothing that my friends and I ordered disappointed. I didnt get a chance to take a pic of the crab cake but it was amazing."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneXBqZ0dREAE",
            "text": "I Went for the music and hookah. The BBQ steak and eggs wasn’t it. Would not recommend. the waffle and wings is actually tenders… that was kind of burnt. The drinks was ok"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbGMtRl9BRRAB",
            "text": "International Nine has been on my list of places to try for some time now.\n\nBack in May, plans were made to grab dinner and catch up, @ another location. When I arrived and they were closed, I was in search for a backup and I remembered my list.\n\nLate afternoon/early evening I was lucky enough to find a non-metered spot across the street. We entered and was seated immediately, as the place was pretty empty at first.\n\nI ordered the Nephew Punch (the first of 2) to start along with a couple of apps- Vegetable Patties & Firecracker Gulf Shrimp Tempura. The punch was tasty and the patties and shrimp tempura were nice starters. In addition I ordered the Grilled Jerk Shrimp Taco & Grilled Paprika Chicken Taco to try prior to my entrée of the Kingston Caesar Salad w/ Jerk Salmon. My dinning companion ordered the Kingston Caesar Salad w/ Jerk Shrimp. Of course by the time my salad came out I was full. Both tacos were delicious and flavorful but the most memorable star was the jerk salmon, I had to try it before I packed it to-go. Light, flaky, juicy with a well balance of both sweet and spicy flavor components. The croutons also had a slight sweet coconut flavor which was a nice added touch.\n\nThe dining area itself is not that big, but they made great decor decisions with international clocks and hand painted murals. Even though the dinning space is small they do have a seated bar as well as outdoor space in the back. As the night proceeded foot track increased, for the event that was held in the back space.\n\nThe food was great and the staff was pleasant, however at times the services was very spotty even though it was not busy. We were the only ones dining initially. Also I was little put off because we were seated by a table occupied by someone with authority and a definite managerial position (based on his interaction with staff and the laptop) who had his shoes off and did not deem it appropriate to put them on after we were seated or when our service started. It was a bad impression to say the least.\n\nOverall I enjoyed my food and I am happy I was able to give them a try. I will return but I will make sure it's around the same time (early). With a small dinning space and slow service I can only imagine when they are busy.\n\nJust A Note:\n\nThe Jerk Salmon was amazing!\n\nWe ordered an extra piece to take home with our salads that we couldn't even attempt to eat because we were already too full."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMlA3LXFnRRAB",
            "text": "Our first time visiting Inine Bistro in NYC and the vibes and food did not disappoint.\n\nThe staff were super friendly and accommodating, my hubby and I felt like family.\n\nI ordered from the breakfast menu, and had their famous waffles and chicken was peaches, man it was finger licking good. My hubby had the oxtail and white rice along with their signature mimosas.\n\nI would definitely recommend this spot to any of our friends. 10 out of 10!!!\n\n😊Also, the two lovely ladies at the front, saw me fit to be in a very well put together promo for Inine bistro and I had so much fun doing it, what an experience 🙌🏽@Djsudiepop on IG if you want to view it!!!😂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudUl2Y1dBEAE",
            "text": "An updated review wow! The owner reached out and DID NOT hesitate to make it right!!!!!! I am so grateful that there really are owners out there who truly believe in valuing their customers. A time was really had. Everyone was extremely nice and did not hesitate to make it right. Thank you for everything from the sincerity of me. I can not wait to come back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMya3EySlZBEAE",
            "text": "Food and staff lovely! Tasty big plates, brunch with strong bottomless mimosas, sangria and 2 fire DJ’s! The music was flowing, the outside was cozy, this is the new Brunch spot! Love it here. Also black owned. That’s a BONUS!!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNE9HSWx3RRAB",
            "text": "I wish I could give them more stars because they are black owned. However, my experience wasn’t what I expected after reading the reviews online. One, I don’t think all the food is made to order. The menu is way too diverse for it. Two, My cocktail looked pretty but didn’t taste good. Three, They forgot our order so we ended up getting our food at least 30-40 mins after ordering it. They were nice enough to discount our meal without us having to ask because I was starting to get upset but managed to maintain my composure. Also I didn’t receive the flavored wings I ordered but the ones I did get tasted fine. Overall they might be new but they have a lot of work to do to provide a better service. I believe the restaurant would serve way better as a hookah lounge. It’s a very small restaurant with enough seats for maybe 40 ppl the most. But I saw online they have outdoor seating so maybe it gets better in the warmer weather."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxN00yQUtREAE",
            "text": "Everything about this place was absolutely satisfying. The atmosphere is perfect for an outing with friends or even a date. The colors of the restaurant marry very well( rich deep colors).  The back garden is enclosed and cute. The waiter,…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlemFPTWl3RRAB",
            "text": "Sistha's On The Go.....experienced another great place in the cut.  The Inine Bistro is a great place to go, chill and have a good time.  The next time we'll go and sit out back.  I would have gave the food 5stars but I was shorted on the oxtails in the brunch meal. Music was a good mixture and the staff was great.  It's a black owned business that needs to be   given credit for its establishment. We had a great time and will see you again.  I'll let my friends know of another place to go eat and enjoy the atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwZ1ozd1NnEAE",
            "text": "This place have the best food and drinks! I had the goat stew with jollof rice and a side of plantain. Really tasty you can tell they took their time cooking that. I also enjoyed the cheese cake for my dessert 9/10 not big on sweets but it was so good!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNd3AyazhBRRAB",
            "text": "Amazing amazing restaurant! The best chicken and waffles I've ever had! Please try the sambal twist. It is absolutely delightful with mouth watering searing chicken, fluffy waffle texture, and a delicious curry as the perfect drizzle to…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDaTUyZTZnRRAB",
            "text": "Second visit to this Mott Haven spot. They expanded and now have an outdoor patio with lounge like seating.\nEverything we've tried has been good!\nThey have a descent selection of beer on tap and house cocktails. Different brunch menu and attentive good service.\n\nOne of the few places in the city that adds the gratuity to the check no matter how many people.  Review your check carefully because they will add the gratuity (20%) to the check and charge you tax on the gratuity as if it were part of the subtotal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bF9iNmFBEAE",
            "text": "We hosted a large family function at the restaurant over the weekend. The staff was so kind, patience and helpful! The food was hot & fresh! I can’t not stress how overwhelming a large party can be, but the staff handled it well! And, the DJ rocked! We had a ball!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMnBuRHVnRRAB",
            "text": "We had our family brunch at the bistro and I must say it was such a fantastic idea. Firstly the hospitality is unparalleled . We were greeted by the hostess and the waiters in the most distinguished way - genuine smiles are hard to come by these days. The layout and environment was chic. Felt like an oasis in the city.  Let me get to food shall we. The crab cake was an appetizer and it was bursting with flavors of light turmeric and other spices. It’s not your typical crab cake 😉 Sauce was exquisite . I’m drooling just thinking about it. The mimosas and sangrias hit the spot for us all.\nThe chicken and waffles was a crowd favorite. Soft , lightly breaded tenders with the right amount of crunch. The chicken was seasoned to perfection. Waffles were perfect. 👍🏾\nAnother favorite was the salmon burger . It was my favorite meal. The fresh coleslaw and mouthwatering sauce tantalized my taste buds.\nOh and there’s more but my stomach couldn’t handle anymore.  Please go and experience the iNine bistro you will experience the best mouthwatering meals tucked in an oasis."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaM3NfdEp3EAE",
            "text": "I really wanted to give this place a chance . The  food and the aesthetic  made me choose this place.   I came here on a Sunday night a little bit after 6 . They were only allowed to sell  from the brunch menu way after brunch hours.    I was kind of disappointed and I definitely wanted to try out their jollof rice and red snapper from the dinner menu.  So I settled for the chicken and waffles.   They were very quick with  the orange juice that  I ordered but it tasted like it was spoiled . They took a long time with the food .  The chicken  that I ordered didn’t have any salt or any other seasonings on it . The other person that I with ordered cranberry juice and they took a long time with that order even way  after they got their food.  Luckily I wasn’t charged for the cranberry juice . They didn’t give out napkins with the order or the drinks . The waiters and waitresses were very nice and I didn’t want to constantly bug them for little things like napkins.  On a good note The sweet potatoes fries were delicious.I  really like the theme of the restaurant the back yard area  is sooo nice to look at.  It gives off a chill vibe with the music and the sports on the projector . The bathroom was nice and clean and well stocked up . The only problem in the back yard is that the outdoor furniture was  kind of uncomfortable to sit on . It doesn’t give u enough room to stretch out ur legs. This place has sooo much potential but it definitely needs tweaking with the food and service ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2azRIaW1RRRAB",
            "text": "I wanted to give this place more stars but it had its pros and cons. Pros- selection of indoor or outdoor seating, music was pretty good and I enjoyed the chicken and waffle. Con- food took over an hour to come out, we didn’t feel the waitress checked in on us and it wasn’t even that packed, when our meal was brought out I ended up asking for plastic utensils because ours was not cleaned and one of our meals could’ve used some more seasoning on the meat. Also I’m not sure if it’s because of covid but that bill was pretty high for the service. Overall had the chance to experience a restaurant in the neighborhood."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpOHVPNHd3RRAB",
            "text": "Food was amazing...choas to the chef! Great service, drink and atmosphere. During a pandemic there was still physical distancing taking place with safe seating arrangements inside and outside. Will be back sooner then later."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbW9pMDFRRRAB",
            "text": "Brunch was delicious! Very cute place, love the esthetic, AND Black owned! <3\n\nThe place inside is very nice, exposed brick one side, mural on the opposite wall. Seating comfortable, space is small but not tight, patio double size. Their Oso Garden/Patio really nice.\n\nWe had the Korean BBQ Steak & Eggs with home fries and their iNine classic Burger & Fries. Raspberry Mimosa was very good. Minor miss with food because I found a small hair in eggs but they replaced the whole meal. Very respectful and helpful!\n\nWhy I took star off:\nNice photo op wall but felt weird taking a pic since it’s between to tables that had patrons, didn’t want to disturb them. Although music was great, it was too loud that we could hardly hear each other at 3pm(it shouldn’t be that loud, it’s not a club!) Service was a bit slow, the actual wait staff were great, bus boys were smoking hookah in between helping patrons out, and the guy we think was the manager was too busy doing his own smoking and drinking sangria to check on the very few people that were there. I don’t want people checking on me every minute but felt that for the lack of patrons, attention to the few of us there could be better. Now today was a HOT day so Maybe that’s why. There were fans all over the patio but we had to request one to face us since everyone else had one except where we were sat. It kept us semi cool, at least we weren’t sweating crazy. I think they can do better to keep the space cooler, in my opinion.\n\nOverall nice place, good food and drinks!\nWould love to reserve the outdoor space for an event one day!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzX3N2Vzd3RRAB",
            "text": "I went for Lunch the place has a nice vibe to it.  The staff was very personable and friendly and the food was very tasty.  I really loved the Chicken and Waffles, the chicken was infused with a Thai Curry Sauce and the waffle was made with…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpMC16Rkl3EAE",
            "text": "My 3rd time to this bistro. Vibes, ambience and lighting is very chill. The food was awesome. I had a sangria &  burger my first time; b4 covid struck [Feb]. I've been there two more times since,,, October and November 2020. This most recent time I had the chicken skewers on a bed of spinach and vegetables. I also had a side of African jollof rice. It all was exceptionally good. I had 2 pineapple mojitos. The Latin bartender was on point. They used soda water,,, just like its supposed to be made.\n\nOk,  here's my gripe.  The [1st time] I was there in February and employee was very sick but for some reason she still showed up to work, the bistro should've sent her home with pay. Smh [2nd time] manager took a while finding my credit card, wound up charging another couples meal on my card in October. My visit on November Friday the 13th, my issue this 3rd time was i told them to close out my bill, i went to bathroom, came back. My stuff and drink were moved to the side, they had seated someone else where I was sitting. Don't get me wrong, my 2nd mojito was half full, I was done and would not drink anything I left unattended that's a no-no for Men or Woman. Still they should've waited till I got back before they moved my items. I'm knocking Y'all cause I want you to get this right !!! 3 times and I had issues because of some minor sloppily handled reasons. Nonetheless,  the food is damn good the drinks are tasty and the vibes are kool. Get it right Y'all !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseUtUUjBRRRAB",
            "text": "When I first walked in the smell kinda threw me off so they offered us a spot in the back which was outside but the made it indoors.  It was a but cold at 1st but the food, ambiance and service made up for it. Brunch was amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNFlmdldREAE",
            "text": "Food was amazing, staff was attentive, Ali was a great waiter very friendly and welcoming. The drinks were also great I suggest the nephew punch. I will def be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdjZ5ZHZRRRAB",
            "text": "Visited Inine today and I was pleased with the service. The servers were really attentive and knowledgeable. I had the steak and eggs my husband had the shrimp and waffles and my son had the chicken and waffles. They both enjoyed their meals a lot. Drinks were also good. Definitely will go back. Would like to experience them in the summer time. Great outdoor space."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxcTZ6VmlRRRAB",
            "text": "It was very nice chill location food was decent the music  was on point but they did take a very longg time to bringing out my 6 chicken wings when I order it to go .. soo that was kinda a set back but I will visit  again.. ❤❤❤❤"
        }
    ],
    "reviews_count": 75
}