{
    "name": "Jin Ramen Upper West Side",
    "place_id": "ChIJc71Q34VYwokRARHW9df6Zgs",
    "grid": "MN7",
    "address": "462 Amsterdam Ave, New York, NY 10024, USA",
    "rating": 4.4,
    "user_ratings_total": 1659,
    "phone_number": "(646) 657-0755",
    "reviews": [
        {
            "date": "5시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMk4xOWtlSHBtVTFOR015MTNYMHB5WVZWb2QzYxAB",
            "text": "Service 10/10 & food 20/20"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWWNUUmxUM2hVV0hCQ1dTMWhkazh0V1Zwb1FXYxAB",
            "text": "Best ramen I've ever tasted"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTlFWQkhaVGR2WkZKRU56bFlkbE5oV1hGRVZFRRAB",
            "text": "Food was not great. The poached egg was barely poached and it looked raw. I was going to let it be but my partner asked the server if I could get a soft boiled egg instead since it was too raw. The server said that they don’t do substitute for any of their dishes.\n\nI feel like I understand but also I don’t because, again, the poached egg was basically raw, the egg whites didn’t even fully cook at the edges before they placed it onto my bowl. When I cut into it, that’s what it looked like in the picture (the brown is pork fat).\n\nWe also asked for hot water since it was very cold outside and they said they didn’t serve that. Only green tea or water without ice."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abWFIcENVRVJJU2sxMFZucExaWGN3WmxaWVJIYxAB",
            "text": "ramen here is delicious"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQlEweGFXamwwU0hwRVRIbHVZbmhJYW5VNGNHYxAB",
            "text": "Food pretty mediocre"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psblF6RndkVEZXT1ZGNU1sbHZTVTFGUjI0MlkxRRAB",
            "text": "Wow! Best Ramen I’ve had in the city! Fast service, extensive menu, and delicious! Try everything over and over!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkd1RETkVVbXd4WjFSWU9XcGxPR1pzVmpaU1QzYxAB",
            "text": "For authentic ramen- this is not the spot. The tonkotsu was thin with very little depth of flavor. Katsu and Kara-age was similarly lacking- dry and breading overcooked."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNGVHTnBZWHB0Wlc4d1JVMTZUMEZUVG5aS05VRRAB",
            "text": "A very good, genuine, simple ramen here. From the moment you step in, it feels that Jin Ramen 🍜 knows what they Do Best. We ordered the SPICY TONKOTSU , MISO RAMEN and the KURO SHIO  Ramen. The noodles were perfect done, the spicy tonkotsu was delicious and full of flavors, not spicy 🌶️ enough, I added extra spice, the miso ramen was spicy as it should and was interesting and very good, as the kuro ramen 🍜 which was the star 🌟 with the shishito peppers. 🌶️ as someone who loves spicy ramen and going around the globe to try Ramen, this place stands taller than Tonchin and Ivan, and other places in Manhattan. Thank you 😊🍜🪬♥️ Jin Ramen\n\nMISO RAMEN\nCurly noodle. Soybean based flavors, served with bean sprouts, bok choy, chicken sausage, chopped chashu, *pork seasoned soft-boiled egg, leeks, corn, and finished w/scallions, nori, and sesame seeds  **Spicy**\n\nSPICY TONKOTSU\nPork bone stock. Thin noodle. Pork broth with full flavor creamy texture cooked for hours on end. Topped with chashu (braised pork belly), pork seasoned soft boiled egg, bamboo shoots, fresh scallions, nori, and sesame seeds\n\nKURO SHIO\nLight, salt based chicken broth infused w/ yuzu and togorashi. Served with kara-age, poached egg, and shishito peppers. Topped with shredded scallions, sesame seeds, nori, and black garlic. Straight Noodles. **Spicy**"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kV2RHeGFjbkJ5VTJwak9IcGFTRk51ZG1sNFVGRRAB",
            "text": "A lot of good choices here. The cold soba noodles are good as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oME4zRk1ORFZ5YVU1WldETnNVelV0ZW5kcmFtYxAB",
            "text": "Saved by Jim Ramen! After 14hrs of travelling and w/6hrs time difference we were absolutely beat when we fell in the doors at the 5pm opening hour. Top service with great recommendations had food and drinks to the table in short order - gyoza, pork belly bao buns, sukiyaki don and a massive bowl of edamame hit spot. Highly recommended!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNllubDNhRFJYU0RoVk16SXRPRUp5ZGpGVE4yYxAB",
            "text": "This is... fine. I went here because it's hard to find places in my city that are open after 9:30. They didn't search the Chasu cutlet, and it was quite small. Better can be had for the same $20, but sadly not at night. Overall, a serviceable bowl of ramen."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbGEyRTVjMWxtZURJeFYweEljbUpEU2sxdWVGRRAB",
            "text": "I’m not sure why this place has 5 stars. The ramen is average at best, there are far better ramen spots in New York. For the area I suppose it’s good in a pinch but I would rather take the train downtown and go to danbo or misoya which are far superior imo"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twU2EzSTVSRXBTZUd0ellqazVRMHR2VlhrdGMyYxAB",
            "text": "Pretty tasty, but I thought the tonkotsu broth could have been a bit richer!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWalVWOUNUM2h0VjFWd2RUaFliekZETnpSTFlVRRAB",
            "text": "Tasty! Very flavorful"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUVprUnFiVXR1T0Y5aVNHTlBaMFJ3Vm1ZeWJsRRAB",
            "text": "Great atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaamJVdzFkME50U1U4d2J5MTZaWHBOVjNaNGJFRRAB",
            "text": "Cozy uptown ramen spot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVVJuZExabGt5VW5sdVV6UlFValpwVkVoMFRXYxAB",
            "text": "Jar was such a nice and attentive server which made our experience really great. The food also also amazing too with really great happy hour deals on drinks."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaFFWZEdjREJNYVZWNmRYcExWbmMzVG04emVGRRAB",
            "text": "Always a pleasure to dine at Jin!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJdGNGWkxkMDB3T0dwdFpEbFpiM1ZhWTFCdWJYYxAB",
            "text": "The food was absolutely to die for! The Tonkatsu and Kakuni were delicious! The pork belly on the Kakuni was juicy and sweet, and just melt right in my mouth, while the broth was sweet and filling, and the egg just exploded adding the yolk with the broth, adding to the flavor! The noodles for both were sublime! Absolutely above par! I’ve had real Ramen before, but this just BLEW me away!\n\nThe waiters and waitresses were super kind and considerate, and didn’t rush me on anything! One of the waters offered advice on how to eat the pork belly in the Ramen, which I didn’t even think of. They were all super nice and friendly and they made the visit really worthwhile.\n\nThe atmosphere here was beautiful too! It looked like I was really in Japan! The little decor and signs were very pretty to look at! The Hiragana, Katakana and Kanji on the menu was a very nice addition to just regular English, and as someone who is learning Japanese for high school credit, it’s nice to be able to read the symbols and characters and be able to understand it! The photos on the wall of the chef made me really eager to try the food and see what it’s all about!\n\nOverall, this is the best place to get the highest quality Japanese food in New York!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NFRsODFSWGxMWDIxb2JqaFpNbTFWYVhKa1ZsRRAB",
            "text": "I was becoming a regular here due to its location convenience and decent ramen offerings. This place is not cheap - you will be spending $30 per person - but decent enough for you to come again for ramen crave. Unfortunately, the service here is terrible. Not sure what the service instruction is from the management entails, but the waiters here are not only lazy, but very arrogant and unpleasant. I've caught them multiple times hanging around the kitchen area chit-chatting among themselves when there are customers waiting to place an order; when I asked one of the ingredients of the dish to be replaced (for example, more cucumber instead of zucchini) - this request was very rudely received with roll of an eye saying it will be an \"Extra\". I mean come on - just replacing 4 thinly sliced zucchinis for additional sliced cucumbers - this incur an extra charge? To add to an insult, I've caught the waiters talking shit about my request behind the bars. They've clearly knew that I was not happy with the service. I normally give out 18 - 25% tip depending on occasion, time, and service, but I gave them 15% as a tip for pure courtesy. I would have given 0. (also when did 20% tip become a norm? restaurants need to stop putting 20% as the very first default option on those electronic reader). When the waiters saw my 15% tip - they were clearly disgruntled - no thanking, no apology or whatsoever. She clearly looked upset - showing lots of emotions.\n\nIt is unfortunate. This was my 5th trip to this restaurant just this month, but my 5th will be my very last. I really hope that the management will take note of this, and revamp its service protocol - if there is one."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeFpqWlROVWRLTkZkTFN5MDRaemhMTTIxZlNWRRAB",
            "text": "Im usually very careful about reviewing places unless I really feel the need to, but let me tell you my experience. My family and I decided to try this spot recommended by a friend knowing they close by 10pm so we rushed after work to make it on time.. Our experience was awful, not because of the food but because of the service .We got there about 35 min before closing, we were still under the schedule advertise. As soon as we walk in we ask “are you still open ? server answer “yes we are open if you know what you want “  then he emphasize I can sit you if you eat in 15min . Glad we deny the service and walk away, that kind of service was unacceptable and we will never come back ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NGVFNVpOMDV0YmxwR1dEQnhYM0JZWVZGUFZFRRAB",
            "text": "They had a lot of options which was interesting. Also their menu had pictures which is a plus. We got the Kuro Tonkotsu ramen and the chicken Nanban appetizer. The ramen had a unique, rich flavor that really stood out. Overall would recommend this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMWQzbElYekJwWjBGbk4wVmpkazh4TkZwbFoyYxAB",
            "text": "Mediocre ramen at best. Soup is lukewarm. Thai tea is packaged in soup containers 🤷🏻‍♀️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Mk4zQkZkMlJZUlhwaWFYRm9RakI2WmpkdE0zYxAB",
            "text": "Extremely bad experience. They charged my card twice and refused to reverse the transaction."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWk4xbHFlVWQxTTBSUVduSlpVR2RmTW5oMWVGRRAB",
            "text": "Visited on a Friday night and the ramen was delicious! The Shoyu broth was flavorful and the house noodles had a nice soft texture. The atmosphere was comfortable and welcoming- definitely recommend a visit!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXOElyVnlRRRAB",
            "text": "I saw on Jin Ramen’s Instagram that they launched a new New York-inspired ramen, so I decided to stop by and give it a try  and I’m glad I did! It’s something totally different and exciting for a ramen shop. I really liked the creativity behind it  definitely thinking outside the box.\n\nThe broth has a rich umami flavor, with grilled chicken and shiitake mushrooms that make it feel like you’re eating a taco in ramen form, thanks to the salsa verde broth. They also recommended pairing it with the Snow Angel Nigori Sake  it has a cute bottle and went really well with the spiciness of the ramen.\n\nHighly recommend if you’re looking to try something new and unique!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOZlJnclNNM3ZTYVZ3EAE",
            "text": "decent ramen noddles, we are party of six and ordered signature dishes from the menu. The textures of noddles are great, I assume they are hand-made"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOcmZpdGVCeDQzYVpBEAE",
            "text": "Great no frills Ramen place.  My favorite in NYC and really reasonably priced"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKUGZ3N1N5akx1U1ZnEAE",
            "text": "I loved this place. Service was good. The ramen was delicious. Nice vibe, good music playing. Super recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKLXU2Y0xOM18zWDd3RRAB",
            "text": "Horrible service very rude staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOVEhqOURXNl8telVBEAE",
            "text": "One of the most polite and nice people you would ever meet. The food was great and price was fair."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc011cVh3EAE",
            "text": "I’m so sad to make this review because I’ve eaten here before, but after ordering some food for takeout not too long ago, I ended up getting sick from the food. I don’t know if anything was raw and it was my mistake for not checking, but I’ve feeling the effects ever since."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNjdEdkVBEAE",
            "text": "They used to be 5 stars but then it seems they changed the management or chef or both and it all went downhill from there. All the clientele used to be people who looked like they were ramen connoisseurs and now it’s all people who look like they’re trying ramen for the first time ever. Trader Joes of ramen."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdlpuYjdRRRAB",
            "text": "Better than I remember and awesome shrimp ramen special… cool tunes, rich broth, handmade noodles."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMFp1T0xBEAE",
            "text": "Amazing broth, and a charming atmosphere. I definitely recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMFp1c1NBEAE",
            "text": "Wonderful food lively atmosphere, welcoming staff server attentive.\nWill definitely come back and they had vegetarian options do as someone with food allergies I was able to find something to eat."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMGF1bjF3RRAB",
            "text": "Great food, service, and atmosphere. This will be one of my new favorite ramen spots in NY. They have vegetarian and vegan options available"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MV9TcFRnEAE",
            "text": "I had to dry Ramen with beef. It was divine.!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MlllSmlBRRAB",
            "text": "Absolute best ramen in nyc !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3N3NQMmJnEAE",
            "text": "My 8 year old hated the ramen. It was very bland according to her, and the noodles tasted “like slugs”."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eUlPMXhBRRAB",
            "text": "Amazing restaurant. I am a true NYer born and raised. And recently I moved to South Jersey. I travel 2 1/2 hours by train just to eat here. I get the kimchi ramen and add my favorites. Delectable food. I couldn't say anything more. I highly recommend dining here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNFpxYjZRRRAB",
            "text": "Love to come here after work during the week. It’s quiet and you get to enjoy the best bowl of ramen."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM0t6ZkhBEAE",
            "text": "Great"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4djgyeWhRRRAB",
            "text": "love it!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndHVMMC1nRRAB",
            "text": "Had a really great time at Jin Ramen on the Upper West Side! The atmosphere was warm and inviting, perfect for catching up with a friend. The food? Absolutely delicious—rich, flavorful ramen with perfectly balanced broth and toppings. Every dish we tried was spot on. Whether you’re a ramen lover or just looking for a cozy spot with amazing food, this place is a must-visit. Definitely coming back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdl9ERlFnEAE",
            "text": "Very frustrated with this restaurant that I actually enjoy when I do get to dine, but their customer service is a mess. Their hours of operation are listed where they close at 10pm, so why did I arrive at 9:20pm to find a “Closed” sign on…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMDRmQTlnRRAB",
            "text": "Great place, very cozy, delicious food, polite staff. Definitely recommend to visit:)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfZ3VyQlpREAE",
            "text": "I can’t imagine a better meal for a frigid January day! Spicy Tonkotsu ramen was absolutely perfect! Don’t forget the $14 sake flight special. Jin Ramen is among one of the pleasures of living in this neighborhood!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfa0tXWU9REAE",
            "text": "Crowded table setup, not-so-tasty ramen, subpar services. Anyone can open a ramen shop, but good ones are rare."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaTh2QXVRRRAB",
            "text": "Hand made delicious noodles with a couple of vegan options"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobTRuSWlnRRAB",
            "text": "So bad…\n한젓가락씩 먹고 다 버렸어요… 비싼데 맛도 없음\n딜리버리 왔는데 다식어서 차갑고 kuro tonkotsu ramen soup 위에 기름이 유전 터진줄…\n암튼 56불 날렸네"
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnaGNhd3Z3RRAB",
            "text": "매운 돈코츠 라멘 먹었는데.  차슈는 냄새나고 면 자체가 맛이 없네요. 그냥 오랜만에 매콤한 음식 먹은데서 만족"
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNXNlMVJREAE",
            "text": "너무 맛없다.\n돈코츠 라멘 너무 ..짜다.\n라멘 전문점이 맞나싶다"
        },
        {
            "date": "수정일: 8년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBaTk3My1nRRAB",
            "text": "맛있었지만 면 불어서 조금 아쉬웠어요."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ1ptdnZnRRAB",
            "text": "who doesn’t love a bowl of ramen as the weather starts to get colder? stopped by and ordered a spicy tonkotsu ramen ($20) and sake ikura don ($25) to share. the ramen was extremely flavorful and the noodles were bouncy and firm. the salmon and ikura in the don were quite fresh, but the rice was unfortunately way too soggy (not quite sure what happened there). i guess it would make sense that you should be having ramen at a place with ramen in its name. service was quick and friendly and loved the wine on display. will definitely visit again soon!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bGF5UGp3RRAB",
            "text": "Good ramen spot that can get pretty busy at times. I got their Tonkotsu Ramen and it had good chewy noodles and a hearty broth. The service was a little short-handed and were busy so got our Sake Flight midway through our meal unfortunately. Nonetheless, a good comfort ramen spot but service can be improved."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkaHVEZndRRRAB",
            "text": "Very accommodating for a baby (10 month old). I highly recommend chair was readily available. The food was a bit Salty, but you can request no salt in meal. Staff moved with urgency and food came out rather quickly for a busy Tuesday Night. Would return. Pork buns were excellent and my son loved the edamame the I thoroughly peeled for him."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbHZ5bG9BRRAB",
            "text": "Get the salmon tartare as your app. I could eat 5 orders of these, easily. You’re welcome.\n\nAll the ramen are mid. Albeit some are very creative. The broth isn’t as rich as I’d prefer and alway just falls short of… damn that’s good. That said, they never disappoint, they just never wow. The noodles are also mid.\n\nService is always friendly and efficient.\n\nPortion to $: 4/5\nDate spot: lunch maybe, dinner no.\n\nAll this said, it’s the best ramen north of 79th Street. So far."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeDV1Ty1BRRAB",
            "text": "Pretty authentic flavors for the Nanban. Yam fries and the Chicken Nanban is good. Cozy and friendly atmosphere and warm soup is a good place to relax and soothe your stomach after a long day walk at the museum ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcVlUT1NBEAE",
            "text": "We’ve been here a few times and have enjoyed it every time. Delicious casual spot on the UWS with quality ramen. The service is very quick and good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidDVfRHJnRRAB",
            "text": "The complimentary yuzu iced tea was a refreshing way to start lunch. The pork buns (3 for $11 plus tax) had melt-in-your-mouth Chashu pork. The Kakuni ramen is their take on Filipino flavors, with the broth and braised pork belly reminiscent of adobo. At $21, though, Jin is more expensive than many ramen shops in the city."
        },
        {
            "date": "수정일: 4년 전",
            "language": "ja",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTdDQ2MEFREAE",
            "text": "日本人受けするラーメンではない…ナルトラーメンの方が美味しいですが、けど悪くはない。\nアウトドアダイニングのほったて小屋がしっかりとした作りで4席程、店員さんも感じ良く、子連れで自然史博物館の帰りなんかに温まれる場所だと思います。\n隣の席のアメリカ人らしき男性は、こんなに美味しいラーメン食べたことない！と絶賛されてました。"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodTlUQjF3RRAB",
            "text": "I had the chance to visit a Japanese ramen restaurant with my wife in New York City, and I must say it was a satisfying experience. This eatery offers a cozy atmosphere, making it a great spot to unwind and savor a piping hot bowl of authentic ramen.\n\nThe menu presented a diverse selection of ramen dishes, featuring various broths and toppings that cater to a wide range of preferences. The ingredients used were fresh, and the flavors were well-balanced, creating a delicious and comforting meal.\n\nRamen arrived at the table quickly, allowing me to enjoy it at its peak temperature and taste.\n\nThe eatery's casual vibe and communal seating encouraged a sense of camaraderie among the diners, making the overall experience even more enjoyable. Whether you're a seasoned ramen lover or new to this Japanese culinary delight, this ramen restaurant in New York City is definitely worth checking out. It's the perfect spot for a flavorful and satisfying meal that will leave you craving more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeF9uTVBBEAE",
            "text": "I really don’t understand Ramen. I’ve had it all over the country and still don’t get it.  A giant bowl of soup with noodles and I totally don’t get the egg either.  I always wonder where the yolk went and yes, I know it’s in the soup.  I had a spicy ramen and since I really don’t like noodles, I have to admit the soup part was very good.  The lemonade was excellent and a very welcome surprise since it was complimentary and perfect on a very hot day.  Service was good and friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkOGItdnlnRRAB",
            "text": "A perfect ramen with lots of choices, too! The volcano spicy ramen is really spicy, but you can order the chilli paste on the side.\n\nThe vegetarian ramen is also really succulent, and comes in different broth flavors. Unfortunately, you can order a non-meat egg (the egg they serve is boiled in pork broth).\n\nOverall, definitely a ramen shop to come back to!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURia3N1WjR3RRAB",
            "text": "I recently dined at Jin Ramen and unfortunately had a disappointing experience. I ordered the spicy tonkotsu soup, a Japanese eggs Benedict, and fried rice. Upon entering the restaurant, I wasn’t greeted warmly, and the hostess seemed irritated.\n\nWhile I enjoyed the fried rice, the other items fell short. I do not recommend the shishito peppers; they were overly oily and lacked flavor. I also ordered ramen soup to go, but instead of receiving the ramen, I got only a half cup of broth with no noodles or other ingredients. This was incredibly frustrating.\n\nAdditionally, the customer service I received was unsatisfactory. After reaching out to management via email, I did not receive a response, and I’m still waiting for a refund. The packaging for my fried rice was poorly done, resulting in a mess that made me have to throw much of it away.\n\nI felt rushed throughout my meal and was handed the bill before being asked about drinks. As a person of color, I found the treatment I received rather concerning, and I was made to feel uncomfortable.\n\nOverall, I do not recommend this location based on my experience, and I will not be returning."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHMHQ3SkpBEAE",
            "text": "Some very good, genuine ramen here. I also was a fan of their buns, green beans, and japanese soda. The spicy tonkotsu was good but not very spicy, so good thing they provide extra spice on the side at tables. The ramen was great but doesn't stand above a couple of my other favorite Manhattan ramen spots: Tonchin and Ivan. However there is a wide variety of ramen offered here that I don't see at many other places which is nice. Also I love the atmosphere here! I'll be back to try their different ramen variations for sure."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpcy02VnRRRRAB",
            "text": "My son loves their teriyaki chicken Don, but the carrots and broccoli was too hard for him. The Tonkotsu noodle bowl was good. The price is really good considering their location in the upper west side. They showed some videos about their food and restaurant while we were sitting inside, and that’s good to look at while we were waiting. We will try more of their dishes.\nMake sure to put your name down in the device outside of the front door to get in the wait list. The people there were very nice.\nTo-go order was good too. I did ordered the pork Katsu twice, but they were too dry and tough for me. The Chicken Kara-Age was great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbEpfb2FnEAE",
            "text": "Great ambiance for a cold Saturday night. A lot of options in the menu. I ordered the Tonkotsu Ramen and even though it was good, I believe it needs a little bit of work to find the flavor. Noodles were tasty and great choice on appetizers. Most of the food were a little bit salty but still great. Only got 2 small slices of pork on my ramen which was disappointing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHX3FQb213RRAB",
            "text": "Definitely the best ramen place in the US so far. As a foodie I enjoyed this place so much. All the ramens I tried were amazing. The volcano, tonkotsu and another which I don't remember the name were amazing. The flavors are so diverse, strong and delicate at the same time. You can really enjoy every aspect of it. I would definitely go back and recommend. Worth every penny, which you don't have to spend a lot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5X2JqWWFREAE",
            "text": "The kakuni ramen was reminiscent of an adobo pork that I'm used at home albeit with the noodles taking the place of the rice.\n\nThe place is a little more expensive than other ramen restaurants than I've been to but it is conveniently located near public transportation and the Museum of Natural History."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodHBYeGlBRRAB",
            "text": "Absolutely the best Ramen! Perfect day for hot delicious ramen bowls with so many options and huge portions. Great service in a comfortable environment. We had lunch on an extremely cold day. Afterwards we were able to endure the cold weather outside with full bellies and completely satisfied. So good!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3NE5uXzBBRRAB",
            "text": "Excellent food & generous portions!\nCame for lunch and had the Chicken Gyoza Dumpling appetizer, Kimchi Ramen, Sukiyaki Don Beef Brisket Rice Bowl and a pitcher of Sapporo. All of the food was fantastic - I recommend stopping here if you’re looking for a great meal."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDeGJEbmlRRRAB",
            "text": "So so good!\nI did not have to wait for one of the outdoor tables. I got the volcanic pork ramen option (I forget the real name!), the spiciest one available. Tbh if the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlb2VmdzZ3RRAB",
            "text": "Visited here on a Sunday evening and was surprised that it wasn’t busier! Had a really enjoyable experience, we weren’t rushed at all. Probably some of the best Tonkotsu ramen I’ve had. Very flavorful broth, and ordered some spicy sesame oil on the side to top my dish. Can’t wait to come back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeDgySVVnEAE",
            "text": "Never been to Japan but being in Shanghai for many years and this place does have authentic flavors. Service is courteous and friendly being the first one there. Cozy atmosphere and light jazz music playing in the background sets the atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeUotMjJ3RRAB",
            "text": "Tasty pork buns and flavorful broth. The egg yolk was sweet. Pepper was a tolerable spice level. Good contrasting flavors!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCeGUtUUtnEAE",
            "text": "Went here for Saturday dinner it was very busy, they don't take reservations but we got a table in about 20 mins once we put our names in the queue. For the table ordered chicken nanban buns, these were too good. Crunchy on the outside and juicy on inside. Full flavor loaded. Tried kimchi ramen with ground chicken, the quantity was huge. It's a small and cozy space but food is delicious."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdWNyc0lREAE",
            "text": "I’ve been searching for the best ramen spot in NY and Jin Ramen really lives up to the hype! The food is good and the service from the staff is even better.\n\nIt’s rare I find myself thinking the food was heightened by the service of the staff but at Jin Ramen it was true. I was open to suggestions, the waitress told me what was good, what was better, what was popular to most guests, and what her favorites were. She recommended we change our order on one thing and directed us to other items she believed we would enjoy more. Well, the food was all delicious and the experience is what will keep us coming back for more.\n\nJin Ramen is a homerun. Couldn’t recommend it enough!! Is it worth going all the way to the UWS for....? Yes yes yes!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzenVHZm9RRRAB",
            "text": "I had a great night at Jin Ramen. The staff were friendly and helped me the choices. I had the Kimchi Ramen and chicken dumplings. All them were excellent. I would recommend this place if you are a fan of Asian food. Thanks guys and keep up the good work!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxdjdYVHBRRRAB",
            "text": "Frozen lychee sake was good. The spicy tofu dan dan was good but not spectacular. Everything was basically as expected quality and taste wise and slightly inattentive service. But no reason not to go back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNFNTR2cUhnEAE",
            "text": "Outstanding ramen spot just as good as mainland Japan. Great quality and friendly service. I love the outdoor seating so I can watch the day go by while enjoying my ramen. They also have a very good selection of Japanese imported beer which you should definitely try."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHMy1xRF9nRRAB",
            "text": "Wanted ramen while in NYC. This place had great reviews, and while at lunch at another restaurant, this place was recommended by people. We stopped here for lunch before the airport. The staff was very helpful with explaining the options. We ordered the pork bao buns for an appetizer and two ramens for lunch. Both of our choices were very tasty, the spicy Tonkotsu and the Kakuni. The spicy Tonkosu was just the right amount of spice, while the Kakuni was not spicy."
        }
    ],
    "reviews_count": 83
}