{
    "name": "Bustan",
    "place_id": "ChIJk_8RzIVYwokR99bOICh18j8",
    "grid": "MN7",
    "address": "487 Amsterdam Ave, New York, NY 10024, USA",
    "rating": 4.5,
    "user_ratings_total": 731,
    "phone_number": "(212) 595-5050",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReWVWWnNUbVp5WjJsd1drUTNXVVEyUlRWUE5VRRAB",
            "text": "Delicious falafel, hummus and other things. Highly recommended."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMmIyaFhaRjlIYzFoWldqaFVaR3h4YzNsVlowRRAB",
            "text": "Lovely restaurant providing really flavorful Israeli and North African food. One of the few places that serves a moist falafel, the food is very attentive to bursting flavors that make you want to eat one more bite. That's a hallmark of actual, careful, well-made Mediterranean food.\n\nI came here for the Moroccan fish and was not disappointed. The fish is very moist with a sauce that is really flavorful. THe tomatoes and the tahini really worked well together to provide a creamy, sweet, acidic sauce.\n\nI also recommend heavily the labneh. Get the labneh, it is so creamy and tangy. Love love love. Goes with either bread; I think they're both fantastic.\n\nPortion-wise understand that this is Mediterranean. They are big portions. Honestly for a couple I'd split a first, a second, and a third and call it a dinner.\n\nHighly highly highly recommend, lovely place, will go back for date nights or as default answers for what to eat for dinner. Walk-ins seem to be supported really well; there were no available reservations but half the tables were available."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRWNVVkpVM1ZPUjFSbGRtZGZRbVZDUWtobE1IYxAB",
            "text": "We celebrated a birthday last Sunday. I'll start by saying that the service was excellent. Other than that, prices are outrages. They are charging $9 for a tiny plate of humus, in the size of table spoon!!!. In addition, they are charging for every pita which is just wrong. We ended up paying $310 for 5 guests when non of us ordered a main course. Middle Eastern hospitality is known for the large portion dishes and generous hospitality and in Bustan, they totally missed it. Will not got there again."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcFkyZG5ZbE00ZEdkcllucDFNMk5FY1U5VFZXYxAB",
            "text": "An excellent dining experience. Highly recommend!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMVZqQjROV0Z6Tkd4WFNHUXdVMEZQWW5CMVEzYxAB",
            "text": "Food was definitely interesting. Sat outside in the patio for brunch.  Had a good overall dining experience. Would come back here."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMFNGVTBhVE0xY3paWGMzSTBPVlI0YUZFdFQxRRAB",
            "text": "Great food and service. They have indoor and outdoor area. Highly recommended."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQmVrUXdUa2h0ZGxWRU5XTnJXWFJvVWxORVZYYxAB",
            "text": "My mom and I came here for dinner recently and we had a marvelous time. From the moment we walked in, everything was simply calming, pleasant, and delicious. All the dishes are presented beautifully, and the favors are outstanding.The range of things to select on the menu is so much fun, and you can mix and match a variety of small, medium, and large dishes.The food is great no matter what your diet is, and they can cater almost any dish to meet your needs (vegan, vegetarian, gluten free, etc.). I can't really name my favorite dish, because everything was so good. The desserts tasted delicious as well. Danny the manager was incredibly lovely, as was our server George. This is a really great neighborhood gem, and I highly recommend that you stop in for some truly flavorful, delicious food and a lovely environment!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1blEzVjVSek5SZHpCcVltdHdUR2RoU1Zwa1IyYxAB",
            "text": "Ridiculously overpriced for what you get. Hummus and pita served separately. Order of hummus is maybe three spoonfuls? Ridiculous.\n\nSchnitzel was tasty. Moroccan fish (pictured) had maybe three pieces of fish inside, with the dough around the bowl completely raw on the inside (what’s the point?)\n\nSkip here. Try Frena in HK."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbFQzcERkek5IY1ZwMlgzTnZWRTluUVVsbVRXYxAB",
            "text": "Great place.. Loved the dorade fish.. Burrata is also very good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxc2JUaG5Ramh6U20xRmNXVm1NM052UkhVeFNuYxAB",
            "text": "Amazing place to eat with a group bigger than 3 ! Shareable plates - all exceptional flavor and texture! Taboon oven finishes every dish with smoke and crispiness. Definite must tries are the Taboon bread, Za’atar pita, spicy feta, 700 degree cabbage,  and Moroccan fish. But you truly cannot go wrong with anything on the menu… enjoy !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUGVFZzVXWGxHTWt0blUyUTRWeTFDVlUxeGVXYxAB",
            "text": "The meals provide satisfaction, the staff provides assistance, and prices provide accessibility. The employees provided nice service. Bustan succeeds with both style and service quality. All foods served satisfied our expectations. Experiencing this spot should be a priority."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OYWJFbFBPVEY0YUd0RlEzTk5iakp0ZERGTVFYYxAB",
            "text": "Great food - fresh and hot! Danny and Nikolai were wonderful. Thanks for a lovely time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odFQxTkRkVEE1WWtjNWEwY3lVWGhIY21aaVJXYxAB",
            "text": "Excellent food, drinks, service and ambiance. Highly recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aU1RGOTBWa05IWVU1bE1WcDNjRTV4ZDNSa1ltYxAB",
            "text": "Even their large plate was small. Good quality."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVFoybFFZV3MxTnpJeFltaDRaVzVXZVdGR1QwRRAB",
            "text": "They had some good vegetarian options and their pitas were really good.  They also served very good falafels and hummus.. The spicy feta dip was excellent.   Overall the food was above average but not something I'm dying to have again.\n\nDidn't love the servers as they were a bit too yappy and it was okay at first but then it started to get annoying.  I would say there are better Mediterranean options in the city with better service and ambience for the same price.\n\nAtmosphere was pretty average.  Nothing great and nothing terrible.  It’s not a place to take a good photo."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdFJYUXliSFIwUVMxUVdtaFJibmxOUTBwVVRHYxAB",
            "text": "5 ⭐️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNek4wNVdabXAzWlZoalNFUjFTMnBRUmxkaFRFRRAB",
            "text": "The portions are very small and very expensive but they taste good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TlUzazJjaTFMVlZKWmREUmFZVVJTU0ZZeWFGRRAB",
            "text": "Mind blowing food! Did not have a single dish that failed to impress. The cabbage is out of this world, so is the mushroom dish."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVelpIQkNaQzFOU0V0c1ltRTRkbVYxWTJsS1dWRRAB",
            "text": "Best"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbVpqTm1PR0p5WTFBMVdWTXdWRVJmTlVGbVRsRRAB",
            "text": "Once again, Bustan did not disappoint. For the second time, I flew to NYC from Chicago and gathered a bunch of my friends for dinner there. They were so accommodating, and Gregory offered amazing service! We pretty much ordered everything on the menu—fish, lamb, salads, several vegetarian dishes, etc. Even the bread is top-notch. I’m recommending you to everyone. I will be back, again and again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMVdtVXdVVUpQTVdoR01WcFNibWQyUmxkUk5VRRAB",
            "text": "The food there was good. I often see people in the neighborhood hanging out there. It’s a good vibrant restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTFUwOXhXbXd4WkZVeFRuQm9lbkJJZFRoRWJtYxAB",
            "text": "Truly the rudest host I’ve ever met in my time in NYC. Walked out solely because of him. Would avoid if you like good service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWFltbEpNMjlJVUZWUGNWOW5abGxsVkdwMVJsRRAB",
            "text": "Good food, weak AC"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdFNsSlhWM2xsVjI1SVVGOVBaRkZPTTJSRExWRRAB",
            "text": "Bustan is one of my favorite restaurants on the UWS. The food is PHENOMENAL. The Israeli salad, the humus, the tahini, the falafel (truly different than most falafel)-all outstanding. The Kebab Halabi (hard to describe-but it's ground lamb kabobs with roasted/grilled veggies, served in a baked bread dome) is just beyond. I get it every time I go to Bustan. Atmosphere is sexy and fun. Highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYnBuNi1LMzZ6WGtnRRAB",
            "text": "We did my daughters bridal shower at Bustan yesterday. It was also her 30th birthday. It was fantastic- the food, the service, the environment. I cannot say enough about how wonderful each and every one of the staff was to us. My 65th is this year and I may need to do it there as well!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKbnkyckd1NHEycWtBRRAB",
            "text": "Absolutely delicious!\nThe food is fantastic - fresh and full of vibrant flavors. The oven-baked whole dorada with oven-baked potatoes and a dollop of sour cream is heavenly gorgeous - one of the best fish dishes one can get in NYC. The taboon-roasted carrots, cauliflower and taboon bread are also fantastic. It’s a true UWS gem - regularly on our takeout ordering list.\n\nThey also used to have probably the best grilled octopus in NYC but it has got replaced by smoked trout which is also delicious but the octopus was truly outstanding."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJTHItc3FNd2FIcnZBRRAB",
            "text": "Extraordinary food , service & ambience. Great value\nWhat else can you ask for"
        },
        {
            "date": "5달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYTRqb3VWcS1hTTJnRRAB",
            "text": "מעולה, יחס מצוין\nשרות 10\nמהיר יעיל וטעים מאד\nמומלץ בחום"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPNlg1Ymp6cHMyTWtBRRAB",
            "text": "Excellent spot"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPcjZvTzZsb0x2WGd3RRAB",
            "text": "Delicious food, good cocktails, and friendly servers. Lotsssss of vegetarian options available and all very good!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLVDFyWS1pNnNEcVBREAE",
            "text": "Food was really top notch. Mezze-style middle eastern. Ordered pretty much the whole vegetarian appetizers. Lots of fresh herbs. Complimentary flavors. The fresh bread with zaatar was top notch.\n\nThe prices for the alcohol - also \"top\", as in super expensive. Dinner was $40/pp which is pricey, given we had no alcohol."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYk5xWnp6MHR6ZUlBEAE",
            "text": "Our favorite UWS. Our regular order is the Israeli salad with Chicken Musakahn added, Schnitzel, hummos and the taboon bread(!). Tried half the menu. All SO good."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaExDdDJBRRAB",
            "text": "This place had a very nice atmosphere, I loved the food quality and presentation. I loved the lamb, how they served it how the service people were nice and tentative! The chicken was also nice.\nThe only thing that I didn't like was the food portion, they called it a large dish but it was barely enough for one person, we weren't full after sharing two dishes between three people, but it was really delicious.\nAlso make sure to make reservations, this place is very busy!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQSFk2N3Fub2QyUkxREAE",
            "text": "Nikolai is a wonderful bartender and makes fabulous cocktails."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNUlpZVZnEAE",
            "text": "The food here is always excellent—one of my go-to spots to bring guests. But today the host was incredibly rude. The moment we walked in, he gave a judgemental stare. When we asked about the happy hour menu, he didn’t bother to grab one. When we said we were ready to be seated, he ignored us again. Eventually, he acknowledged us, but still didn’t show us to any seats, just nodded and kept staring away... we ended up seating ourselves. It was so weird.\n\nThe entire interaction felt intentionally dismissive, not just the product of a \"bad day\". I haven't felt that horrible after a service interaction in a long time. I’ve brought my sister this time and planned to bring my mom next week, but after this, I won't anymore."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbjVYVUdnEAE",
            "text": "Very good Middle Eastern food!  The spicy feta is. unique and very good.  The Taboon breads are all made fresh and served warm.  The taboon Dorade is highly recommended by my party. The dips and veggies are very tasty.  The Israeli salad has terrific flavors. The staff is wonderful and very service-oriented.  The back patio is a plus."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNzUzLW9RRRAB",
            "text": "I can't recommend this place to anyone; if they want to stay in business, they seriously need to consider hiring more personable individuals who understand the importance of greeting customers with a friendly demeanor. A warm smile and a genuine welcome can make all the difference in creating a positive dining experience!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJXzh1YkdREAE",
            "text": "food here is incredibly good! we were sat in their back garden which was very cozy. we had heard great things about this place and it definitely lived up to its hype. highly recommend trying out this restaurant!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOTVuZ3F3RRAB",
            "text": "My family and I spontaneously dropped into Bustan for dinner without knowing the amazing experience ahead of us. We loved the food, service, and overall vibe. We were subsequently inspired to host a significant birthday dinner with 12 guests, and we continue to be big champions of Bustan! Adriana, the events manager, was incredible. She was so responsive and efficient and made the planning easy. The entire meal was perfect - fantastic service (thank you, Lindsay, and team) and delicious food. Our guests were delighted, and the birthday celebration will be a longstanding, treasured memory. Thank you, Bustan!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eHI3bDh3RRAB",
            "text": "Don't hesitate, GO! The food was well beyond my expectations. I can't wait to go back again and again to eat my way through the menu. Not to mention the Persian Lemonade was such a treat!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ak15TkdnEAE",
            "text": "Our most recent visit to Bustan was our third and we felt compelled to write based on their kindness and service.  We had dinner reservations at an Italian restaurant a few streets away and when we entered the vibe was off.  We decided to leave and come to Bustan.  With no reservations they were able to sit us in the garden room, checked to make sure we were comfortable, asked about the lighting, always had our waters filled and of course the food was delicious.  Hats off Bustan, you saved our evening and we already knew we loved it at Bustan, now we are even stronger believers!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdHVIejlRRRAB",
            "text": "This restaurant exceeded our expectations. The eclectic interior was charming, and the food was flavorful, beautifully presented, and served in generous portions. Though the place was crowded and loud, it created a cheerful atmosphere. Our server was attentive and provided excellent service. We'll definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbkp6ZU5BEAE",
            "text": "Delicious Mediterranean food. Great for sharing and solo meals."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbU1PSTB3RRAB",
            "text": "Delicious"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnN2JtNlNREAE",
            "text": "Great neighbourhood spot - food was fabulous, and extremely well priced."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndWF1dEJnEAE",
            "text": "I ordered delivery to my home.  The delivery was prompt and the food delicious!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNGFxT2lRRRAB",
            "text": "DO NOT COME HERE!\n\nThe server was nice & the food was fine, but the host was incredibly rude and made a comment that offended my wife. Maybe it was because he smelled like alcohol and was visibly intoxicated, but that does not excuse it. I will not be coming back!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXZDMnpRRRAB",
            "text": "Danny and Louis   Are amazing and had a Amazing time"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcWFtUVBnEAE",
            "text": "We had a fabulous dining experience .  Delicious food, attentive staff and beautiful atmosphere.   And Danny our maitre d was superb.  I recommend this restaurant to anyone wanting a wonderful dining adventure."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdC12dHh3RRAB",
            "text": "Bustan is one of our favorite restaurants for a nice dinner out and for showing the UWS off to family and friends. We recently went for a birthday dinner and ordered a mix of vegetarian appetizers and shared the couscous as a main. Everything was delicious, and the bread and artichokes were standouts, but the real treat was the lovely host (Danny!) who comped us several desserts when he found out we were there to celebrate. We will definitely choose Bustan again for special meals in the future. Thanks Danny and the entire staff at Bustan for making our evening so lovely!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdTUzQ3J3RRAB",
            "text": "Everything about this place is just right! The decor and atmosphere, the service, and the menu, which offers a variety of things to meet a variety of needs. The only thing that took a little effort was finding items on the menu that are nondairy (it seems like lots of things have dairy in them one way or another). My companion and I really enjoyed the appetizers and entrées we ordered (mine was a fish dish made under a dome of bread) and after going to Bustan several times, I can confidently say that it is consistently excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOHU3ZjNBRRAB",
            "text": "Highly recommend making a reservation! It was very busy here on a Tuesday night. Firstly, the restaurant and the atmosphere are wonderful. The portions were reasonable. Everything tasted extremely fresh and came out hot. The spicy feta with the house made taboon bread is a must. The menu has so many tasty things, I can’t wait to come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNE5qeEJnEAE",
            "text": "If you're looking for an outstanding Mediterranean dining experience in Manhattan, look no further than the best Mediterranean restaurant in the city. From the moment you walk in, the exceptional service sets the tone for an unforgettable meal. The staff is attentive, knowledgeable, and genuinely friendly, ensuring that every need is met promptly and graciously. As for the food, it is nothing short of phenomenal. Each dish bursts with vibrant flavors and is prepared with the utmost care and authenticity. The freshness of the ingredients and the skillful blending of spices create a symphony of tastes that is simply unparalleled. Whether you're a connoisseur of Mediterranean cuisine or new to its delights, this restaurant offers a dining experience that is both exquisite and memorable. I'm not exaggerating when I say that it was the best flavor I've ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MTVIaTF3RRAB",
            "text": "My first time trying israeli food, I would say it’s pretty similar to other mediterranean food. We ordered the spicy feta, roasted eggplant, pita bread and the lamb kebab. The pita bread was pretty unique as it was well seasoned & super flavorful. My fav menu was the lamb kebab which was very unique covered with some sort of dough on top."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKXzhDbFpnEAE",
            "text": "First time at this Israeli / mediterranean restaurant and had a great time. It's a family style sharing restaurant with small, medium and large plates. All the food is great. The hummus was really good and so was the Israeli salad. Very recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKc2JucWd3RRAB",
            "text": "Great Mediterranean food. We came here many times and the quality is always there. The falafel is amazing! Hummus with taboon bread is great too. Love their Israeli salad, too. Schnitzel is delicious but only good for dine in. Take out will be a bit dry. Service is never disappointing!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCeHZUVzZnRRAB",
            "text": "Made reservation well ahead for an anniversary meal. They did a great job correcting the situation when initially we were not given a good table—cramped, near a busy staff door, very uncomfortable high-back chairs. But we asked for a better table and were accommodated quickly with an excellent table in a quieter spot, one of the best tables, very near the front door. Very good service throughout the evening. Server was helpful with our questions about some of the dishes. We had a mix of specials and regular menu items. Can recommend Chicken Musakhan (Taboon Bread, Tahini, Amba, etc) & Baked chocolate mousse w/ ice cream w/ crushed almonds in it. (The textured of both were wonderful. I’d go back just for that dessert!) The popular Kebab Halabi (comes in a baked bread dome...lamb onion, tomato, tahini, pistachios etc) was a just OK. The bread dome was definitely rather watery. Their tahini was lovely. All in all, definitely a recommended restaurant!"
        },
        {
            "date": "1년 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubXRDSDJRRRAB",
            "text": "开始上来的面包挺好吃的，有特色。那个鼓起来的饼很好玩，会有人帮忙用刀划开，然后饼下面是点的吃的，比如鱼和蔬菜等等。甜品挺不错的，那个毛绒绒的里面是冰激凌，吃起来像是中国的龙须酥。"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdm9laExBEAE",
            "text": "The food was delicious! We got the falafel, pita, hummus, spicy feta, and Moroccan fish. Would definitely come back for the food. Some of ghee most tasty Mediterranean food I. NY. The portions were a bit small. We got the chocolate cake for dessert. I would recommend skipping the desert - didn’t taste homemade."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzXzZPeURnEAE",
            "text": "Good food with a few vegetarian options. My dish was actually vegan and it was very fresh, good tasting. My two fellow diners had meat and fish and were very happy with their choices. All of us said we would return, I'd just need to discuss options with the waitstaff to modify dishes to be vegetarian, which I'm sure they would do."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtN2RxTU93EAE",
            "text": "The place is cute, has a nice ambience, lively but not very loud. It's perfect to have a dinner for 2 or a big group if needed.\n\nThe service is attentive, friendly and polite but a little bit slow (nothing that will detract from the nice experience, just come with time to enjoy and relax)\n\nI ordered a variety of menu items and all were delicious and the presentation is very nice but when you see the prices just now the portion sizes are very small and are meant to be shared so you'll have to order a lot if you're hungry and want a substantial meal.\n\nYou definitely don't want to sleep on the pita and taboon bread (thank me later!)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5c2FyR0tBEAE",
            "text": "Highlight: tuna crudo. This dish has got everything. A little sweet (thanks to the orange segments), a little nutty (pistachio), a little salty, a little sour (lime), and a lot fishy! 5 ⭐\n\nThe hummus was reasonable. The my grandma's homemade couscous was underwhelming, barely any flavor, barely enough broth. Really not worth $27.\n\nFinally, I disliked the tahini dip. I can't remember the last time I had tahini, but I probably will not have it again.\n\nIn summary:\nTuna crudo: 5 ⭐\nHummus: 4 ⭐\nTaboon bread: 4 ⭐\nMy grandma's homemade couscous: 3 ⭐\nTahini: 2 ⭐\n\nAverage would be ~3.5 ⭐, but I was happy enough with the tuna crudo to round up to 4 ⭐."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5N29YMUVBEAE",
            "text": "We walked in on a Saturday evening, and they were able to accommodate our party of two, but I would strongly recommend making reservations. The food was so delicious and authentic it brought me back to time I’ve spent on the Mediterranean. We had the hummus (strong tahini flavor, very smooth) and spicy feta (literally shocked my brain into recalling memories in Greece) along with super fresh, hot, and oily pita. For the main, we shared cauliflower over lebneh, tomatoes, and garlic, along with chicken schnitzel. Ended with baklava, vanilla ice cream with crushed pistachios and espresso. I would go here a thousand more times. Nice wine and beer selection with Israeli options."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoN2JUcjV3RRAB",
            "text": "We came here for date night and I don't think my husband could've found a more perfect spot.\n\nAmbiance: Gorgeous and elegant. The bar area is also very nice and appealing to sit at.\n\nService: The manager, the waitress, and all staff were so nice and thoughtful. Fairly quick to get to you even though it was busy.\n\nFood: EXCELLENT. As a vegetarian, I really enjoyed the number of options on the menu and they all sounded delicious. The Indian Tahini ended up being one of our favorite dips and the falafel was well seasoned and crispy. Must try the Taboon bread, it's fresh and hot and perfectly seasoned. We also got the Israeli salad which definitely did not disappoint. The Malabi dessert was fresh, sweet, and a perfect ending to the entire meal.\n\nOverall I'd say this was a great experience and I would definitely come back and bring friends.\n\nInstagram Handle: @TheShahLALand"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNnFXSXRRRRAB",
            "text": "We were in the area and stopped in for early dinner. What a great find! Everything was absolutely fresh and delicious. Staff was friendly. Atmosphere was nice. We will definitely return for more."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscXJMS1l3EAE",
            "text": "Very nice place for some authentic Israeli cuisine.\n\nWe had a group of 16 and they were able to accommodate us.\n\nSmall plates:\nTahini, very dense and nice.\nLabneh, how bad can it be?\nHummus, great as usual, but not wow.\nTzatzik, fresh and dilly and cucumbery.\n\nPita is thin and stretchy and puffy and soft.\nTaboos is crispy and savory with more oil content.\n\nMedium plates:\nCauliflower, not so crunchy but does have a charr. Quiet bland in seasoning.\n\nArtichoke, one of today’s specialty, better seasoning than the cauliflower in my tastes. Only hearts were presented and very soft and nice.\n\nCrudo, cannot remember a thing so I guess so so.\n\nBurrata, the beet salad underneath is AMAZING. It is so contrary to my intuition as it is not sweet but aromatic. The seasonings is mastery.\n\nHummus bowl, just larger version of hummus.\n\nIsraeli salad, very very nice mix and refreshing. Should supplement with any bread, meaty dish ordered.\n\nLarger plate:\nMoroccan fish, lovely domed top with crispy flaky texture and with a bit of scallion flavor. The fish fillets are tender but not mushy. Lovely and warm and comforting during winter with tomato, tahini, and chickpeas.\n\nLamb kebab, very very lamby, if you know what I mean. If you are not eating lamb, then you shouldn’t order it. Otherwise, nice seasoning and great aromatic flavor profile.\n\nChicken musakhan, very very nice and crispy chicken. Imagine chicken from crispy chicken sandwich but without the buns. A bit on the drier side, with salad and a pita underneath topped with hummus.\n\nDessert:\n\nMalabi, chewy coconut flake with crushed pistachios on top of rose water coconut pudding that tastes creamy but the rose water can be a bit overpowering and makes the dish taste fake.\n\nIn general, would come again for their fish and chicken."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMVlqem9nRRAB",
            "text": "I’m still thinking about the taboon bread. It was pure magic - it’s like a pillowy soft sourdough that’s hollow in the center and super thin and crispy on the outside. And the falafel was even more crispy I heard it from across the table. We ordered nothing but mezze, and still left happy and full."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldzZfSVRnEAE",
            "text": "I love everything about this restaurant. The setting, staff, good, drink! Every single dish we had was delicious and the drink wasn't too sweet. The staff were super friendly too and didn't rush you to leave when you are finished. I can't wait to go back."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBeHJXd3VRRRAB",
            "text": "I've gone to this place twice and had a great time both occasions.\n\nAppetizer- Spicy feta, hummus and pita bread is a must.\n\nDrink-  The Blueberry bourbon cocktail was fantastic.\n\nEntree- The salmon was mouth watering. I'm not a big fan of lamb but I hear this place has one of the best in the upper west side.\n\nDessert- Doughnuts are delicious, the taste is not overwhelmingly sweet.\n\nIf you have a chance to come here, make it happen.\nThey have outdoor seating, the ambiance is one of a distant country."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNrMm9YOU1REAE",
            "text": "It’s our third time here. Food is always good. Katy, the new waiter is such a sweetheart! Love hummus here, also the bread, the branzino is good, lamb is presented inside a freshly baked bread, oh and the chocolate dessert was soooo yummm.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4ODl1ajRBRRAB",
            "text": "Bustan knows how to serve some great Mediterranean dishes. So many great flavors and so many choices. We stopped in here last week and the food and the service was so good we can’t wait to go back.  Mediterranean did with an exotic flair.  Perfect UWS local restaurant.  I can’t wait to go back!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMTh1eTRnRRAB",
            "text": "Bustan is a lively Mediterranean restaurant in the UWS. The food is hands-down some of the best food in the area! It’s absolutely astounding. I find the staff lovely. I enjoyed the food so much I asked to be a part of the team!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrbF9PSkR3EAE",
            "text": "Delicious mediterranean food with adorable outdoor seating. They make the bread in house so it comes out steaming hot and delicious. The humus and their signature lamb dish were heavenly. My partner doesn't usually like lamb and even he enjoyed it. We very much enjoyed our meal and will definitely be back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGelpMMTV3RRAB",
            "text": "I’ve been to Bustan twice and I had a great experience each time. I really like Mediterranean food and Bustan is a great place to taste them, especially Israel food. My favorites are roasted cabbage, roasted cauliflower, falafel and meatballs. You should also try labneh and Israel salad for starter."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaXR5QlJnEAE",
            "text": "Insanely good food! We were served at the bar by Nikolai who was super knowledgeable and helpful. The eggplant carpaccio was a highlight of the meal but everything was delicious!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbHJDQXNRRRAB",
            "text": "Probably the best Mediterranean and Israeli food I had in Nyc!! Amazing fresh baked breads and hummus. So many great vegetarian options! Falafel, Roasted Cabbage and Eggplant carpacio were delicious! What a great place!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVMHRQR0pREAE",
            "text": "We had amazing dining experience here! Great cocktails and drinks during happy hour, delicious and fresh Mediterranean food! Excellent service, would recommend to all!!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2NDczSzJRRRAB",
            "text": "One of our favorite restaurants in the area. Kebab Halabi and chicken Musakhan are both delicious. Also, the cauliflower appetizer is great. They also brought us a complimentary \"Indian tahini\" dip, which we loved. Drinks are also nice, we especially loved the \"Persian lemonade\". Service is also great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1a2ZhcWd3RRAB",
            "text": "The food is absolutely delicious, super fresh & authentic. I had great, friendly service seated at the bar. Tastefully decorated but the atmosphere is super loud when full."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMWV2Z2ZBEAE",
            "text": "This is my favorite restaurant on the upper west side. Full bar and incredible menu. You must get the bread for your meal and to-go.\n\nIndoor dining is well lit and not too loud, and there is an outdoor lovely garden for dining. Just do it and go here!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTMDZxSlJREAE",
            "text": "Amazing!! The service is so excellent that it made me feel that was not in NYC for a moment! Service is outstanding 2 Michelin stars. Sorry - I’m a true New Yorker and I know that we have less than reasonable manners. Patio is charming,…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZaTdud3ZnRRAB",
            "text": "1. The blonde hostess was super friendly and cute.\n\n2. Sit outside. It’s amazing out back.\n\n3. The food is very, very good. No complaints.\n\n4. Have many desserts.\n\n5. They have Whistle Pig 10 year. Try it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtclppV1ZREAE",
            "text": "I always walk past this restaurant on my work commute and couldn't wait to try, and it didn't disappoint. Service was amazing polite fast the food was amazing and came quickly and the staff made you feel like a million bucks. When I told them it was my birthday they gave me a complimentary passion fruit sorbet I will definitely be going back"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxNG9YVjl3RRAB",
            "text": "It feels like home. The staff is generous and sweet plus the dishes don’t disappoint. I felt more and more satisfied with each bite. How is that possible bustan ? The level of freshness and thoughtfulness of design makes each dish complete. We ordered:\n-hummus: I loved they served a herbed oil and chick pea chunks on top. Their house bread is delicious and made to order\n-baked fish- in a clay pot with chick peas and tahini, this was amazing.\n-baked chicken served on bread: the tenderness 🙌 it was def marinated with lots of love\n-baked sweet potatoes- comes with seasme seeds on top and of course, baked to perfection.\n\nThe level of execution with each dish is top notch. They know what they are doing. Will be back."
        }
    ],
    "reviews_count": 84
}