{
    "name": "Bellini",
    "place_id": "ChIJq7ZME4VYwokRtSnXR1qnafg",
    "grid": "MN7",
    "address": "483 Columbus Ave, New York, NY 10024, USA",
    "rating": 4.6,
    "user_ratings_total": 620,
    "phone_number": "(212) 724-4615",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWb1MyUlZOSFF6Um5STGExSmZWRzkyVm1KQlNrRRAB",
            "text": "This place was phenomenal!!!!!!!!\n\nMy boyfriend and I went to the global citizens festival yesterday and decided to do something close by for dinner which is how we decided on Bellini, and oh my I am so glad we did!!!!!!! This was hands down the best Italian food I’ve had outside of my family’s home. The sauce and meatballs were to die for as well as the mussels marinara 10/10 !!!! We will be returning to try more on the menu we were truly impressed and are still thinking of the food the next day it was THAT GOOD! I highly recommend and the service was even better !!!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214d09HTnpNRU00VmtKZlQwNWpiRTAyU2swNVZVRRAB",
            "text": "Went here yesterday for my beloved friend's wedding celebration and the food was fire. I loved the ravioli prosciutto and the steak. The servers and staff are so accommodating. Won't have second thoughts coming back here should I be in the area."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbVFtaENhbTR3V0VwQlRtUnNSVk5VU2tKV2NsRRAB",
            "text": "We got take out here before Shakespeare in the Park. I ordered the Sicilian meatballs and a Caesar salad. My partner ordered a beet salad and goat cheese and fungi bruschetta. Most of the food was disappointing. My Caesar was listed to have Parmesan reggiano, anchovies, croutons. What I got was Romain lettuce with powdered cheese and croutons. The dressing was not a Caesar dressing but some type of mustard based dressing. The meatballs were small but tasty. The beet salad was not dressed nor did it come with a dressing on the side. The bruschetta was fine but would not order again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbE5VZEVjMDFtVlRCeVR6WjRTRWhUY0UxVmQwRRAB",
            "text": "This place is really really good! We tried it on a Sunday afternoon for a late lunch, the service was so attentive, food was absolutely delicious, loved the romantic, intimate atmosphere, and the oldies music. This place would make the best date night spot. We ordered from the specials menu and were not disappointed, prosciutto ravioli and luck porcini parpadelle. Delicious!!!  Shout out to Elvis for the great service!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVVNGVlVka0ZQYVVGcGVHNWZORFl5UjNWM1FuYxAB",
            "text": "We came for lunch and loveeeed it!!! The food was so good 😍 Elvis our waiter was really nice and welcoming. I highly recommend the tomato soup and the white sangria. Probably all the pastas will be a win.\nI’ll be back!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMFJGaFlaakpSTkZoclZXd3hjV05PWkhwNlUyYxAB",
            "text": "The food was awful and the waiter was super rude.\nOnly plus is that it came fast"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5V1gwdzBRbUowZG5waVJtdFNha2t4WlVkc1QyYxAB",
            "text": "This is hands down some of the best food I have ever had, regardless of cuisine. I had the lamb chops. Also ordered was the Penne Alla Vodka, Shrimp Pesto, and the Spaghetti Meatballs. Everything including the texture of the pasta, the flavor of the sauces, the smokiness on the vegetables, was absolute heaven.\n\nIts a small cozy space and was extremely clean. My only small complaint is the overhead music was a tad too loud.\n\nOur server was phenomenal and never missed a beat.\n\nPlease do yourself a favor if you are looking for a fantastic meal and go here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taS2ExWnZMWFUzTkd0aVRXNTJhMG94VlhJdGIxRRAB",
            "text": "I had a great time with my date. The rain gave the time there extra ambiance. Love the simulated lit candles on the tables. Very inviting place to enter. The service and food was great\nI had a personal margarita pizza that was done well. I would have gotten another one if I wasn't concerned about my girlish figure. Lovey place and definitely will return!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MlREaFdiREpVZWxWVmNHdGxTVzlpUkd4RlJFRRAB",
            "text": "The food was salty and average. Had the Alfredo pasta and the butternut squash ravioli - we couldn’t finish either plate. It was just not good.\nThe appetizer, fritto mixto, was actually pretty good. The “Bellini” was uninspiring. I will not be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTGJIbGpTMmh0TkdZeFUybDRhVFpZVVhNNFdVRRAB",
            "text": "Cute place. Cozy and great service. We order carbonara, chicken tenders and fries for the kids and pizza, and everything was delicious! Service was fast and great. Amazing choice for after going to American natural history museum."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNWNGWmpWR1Y1WVhKSWFrSkJjbU5SVlVkMlYxRRAB",
            "text": "Food, service and everything else was pretty good. The price is slightly high for quantity of food and the amount of given bred is pretty little"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RmFFWkdXSFZPV2kxQ1JFZERRVzFxTlhScU9VRRAB",
            "text": "Best pizza. Love the staff and atmosphere."
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKME9YQlRaamM0U1d0R1dHVm9kM000TW5oM1dsRRAB",
            "text": "Ristorante italiano dove abbiamo mangiato molto bene a prezzi ragionevoli. consigliato vicino al museo di storia naturale."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRWVGQXhZVll5UkdOR1FYTnhhRlIwVDJFekxYYxAB",
            "text": "Ordered meatballs for take out and was disappointed in the size and value.  They were the size of a golf ball, 3 for $17.  Overpriced."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTU5tczRjMmhRT1ZwTVYyZHdaVUpGUlZoelZFRRAB",
            "text": "The Margarita Napoletana was genuinely the best pizza I’ve ever had in my life, shared some with the table and they also agreed it was very good, had them eyeing my meal! Everyone else also had fantastic meals, hard recommend."
        },
        {
            "date": "3달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNFpVdHBOV05rU1haUlpubDNVMnd3WW5adVlWRRAB",
            "text": "中央公園附近的地道義大利菜\n\n逛完中央公園，見附近有條街道有幾家義大利菜，就過來搵食。\n\nBellini 門面不大， 門口只有四張台子，狹長的室內用餐區以紅磚牆裝飾，So Italian .\n\n打開餐牌，發現餐廳主打pasta ， 而且是新鮮即製的，立刻叫了兩份，以及一份Risotto 头盘。 想不到其美味仿佛把我带回了意大利！\n\n菜品：\n1） Risotto Porcini\n我一般不爱点Risotto, 一般餐厅要不Cheese 放得太多腻人，要不米太硬吸收sauce不够，但这家餐厅粒粒米吸飽了Sauce , 软硬度正好👍👍\n\n2）Pappardelle Duck Porcini\nPappardelle 配上慢煮鴨肉，一流！\n\n3） Garganelli Spicy Vodka\n第一次吃这种pasta , 淡淡的辣味十分惹味。\n\n3）Tiramisu\n层次分明的口感，不太甜。👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaU4wMUROM1E1UWxkQmJFRk1WSFJFVGxZelowRRAB",
            "text": "Checked all the boxes. Amazing food, service, and atmosphere. Prices were reasonable too. Would highly recommend if you're looking for traditional Italian cuisine with an upscale vibe."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psamMyMXJjMkZMWWxkaGJFaDVabmx1V0ROaE9IYxAB",
            "text": "The course was amazing. The service was attentive and friendly. The deserts, coffee, and wine were a very nice touch."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVU5EVjBZMFpLUzBGM2RGaEpPRTQzVFRBNFdWRRAB",
            "text": "Very nice place and tasty food❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwc1RERnZaMDFrWjBRelNuTk9USFJWUVVSWVYyYxAB",
            "text": "Overall, awesome experience. This is the place to go if you want good Italian food, cheese, sticks weren’t hand breaded but still were awesome. Food dessert anything you want awesome service good atmosphere awesome this is the best place to come in New York."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQcVN5WTJUclBMdGZ3EAE",
            "text": "Food was delicious and portion was generous. Our server was attentive & friendly; quickly attending to what we need. My wine had something black inside and even before flagging to server, he noticed and came over to see what is wrong and replace new glass right away. The restaurant also offers cute small detail such as pasta display and outdoor seating that allow people watch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJel96T0tId1lLbXdnRRAB",
            "text": "There are so many great Italian places in this neighborhood, so skip Bellini. A few years ago I came and remembered I had a decent experience so I decided to come back recently. Sadly even though items were brought out \"as they were ready\" the mussels and steamed broccoli were delivered cold and our other items just tasted bland. We ended up just paying and leaving without eating much to which the server replied \"oh, looks like you ordered too much\" and when we explained our dissatisfaction with the food he just said \"oh, ok\" and went about his way. Needless to say, we will not be returning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPT1ZuSi0yLUtuNEFnEAE",
            "text": "The pasta tasted fresh and was cooked to perfection, but the dish itself lacked flavor. As nice as they were, I’d skip this place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOXVEXzhnRRAB",
            "text": "Excellent in all counts. We will go back for sure."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aUllQVpREAE",
            "text": "DELISH!!! Super cute, true Italian getaway. White cloth upscale elegance. And the FOOD! Omg - the BEST pasta we have had in a while. I got the rigatoni bolognese (10/10) my son the got spaghetti robonesca with meatballs (10/10 and best meatballs ever!!) and my daughter got the chicken Alfredo (10/10) so so so so good and fresh. We also got the calamari on ong soooo good! I wish I lived here so I can go back time and time again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdUl6YUN3EAE",
            "text": "Good service not great food. Very disappointing experience and not worth the price.  The meatball meat was grisly and the mozzarella at the center was not melted  although the sauce tasted good..Carbonara pasta was tasteless and likely  reheated because it was oily, not creamy as it should be. The. Chicken Milanese was too deeply fried and was super thin and hard.  We were really hoping for a better experience given the other ratings."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRczYtS25RRRAB",
            "text": "After seeing the 4.6 rating, we booked a table and were looking forward to it.  My husband ordered the chicken parmesan and it was really good.  I ordered lasagne.... and it was not good.  There was nothing between the layers of noodles except a little bit of hamburger and nothing else.  It was basically layered lasagne noodles sitting in sauce in the bottom of the dish.  Very disappointing"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnXzZqMmNREAE",
            "text": "Best Italian food in town ❤️"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnZ3VUck53EAE",
            "text": "Brilliant restaurant and lovely food. Great service as well. Would definitely recommend."
        },
        {
            "date": "8달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneTRfejhRRRAB",
            "text": "Это изумительно уютное и семейное место… Паста невероятно вкусная… вообще еда очень вкусная. Официант почтенных лет посоветовал прекрасное вино… десерты тирамису и шоколадный кейк были - просто восторг!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbC1PbEh3EAE",
            "text": "First time at Bellini with a family group. The food and appetizers were all delicious! The sangria was the best I’ve had in years!"
        },
        {
            "date": "10달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdG9UZEd3EAE",
            "text": "Da comida, ao serviço, a atmosfera… tudo tudo ótimo\nRestaurante pequeno com comida italiana perfeita"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2LVl1Y3pBRRAB",
            "text": "Absolutely loved eating here! Pasta was made from scratch and cooked to perfection. The ambiance was just what was needed. Gabrielle and her husband (very good looking couple) exhibited outstanding customer service. Highly recommend this restaurant"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aThYeVVnEAE",
            "text": "We were cold and tired and stopped at Bellini with our three-year-old. The atmosphere was warm, the service was attentive, and the food was perfect. We shared the crispy Brussels sprouts, inside out meatballs, a Margherita pizza, and ravioli prosciutto alla boscaiolo. My wife had a glass of sangria. Each dish was delicious, as was the sangria. This meal was a highlight of our time in the city."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2anJuTjFnRRAB",
            "text": "Cute and cozy little restaurant! Waiter was so attentive and sweet."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dlB6N2lnRRAB",
            "text": "Bellini is a perfect choice for those looking to enjoy delicious Italian cuisine near Lincoln Center, whether you’re heading to a performance or just looking for a great meal in a cozy, intimate setting."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeXR6LWxBRRAB",
            "text": "Stopped by with our daughters. Food was delicious with unique tastes. We had the Spaghetti with Meatballs and butternut squash Ravioli- both were perfect."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbWFHZEpREAE",
            "text": "I went there and ordered the ortolana pizza, I asked the person to put onions instead of the eggplant because I had aleargy, after waiting for 30 minutes I receive a pizza with carrots on it and then I asked to replace it and I was in super hurry I took a parcel of the replacement pizza with onion, but they spoiled that too, it had too much salt , black pepper and it ruined my taste. I was really upset by the pizza. I don't think this place is worth it. other than that ambience and atmosphere was good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdzhPcC1BRRAB",
            "text": "Stopped by here after a visit to the nearby Natural History Museum.  Food was good quality and the server was very friendly and helpful. Restaurant wasn’t very busy so we got our food and drinks fairly promptly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMDl1RkZnEAE",
            "text": "We were in the area after a long walk in Central Park, and Bellini hit the spot.\n\nIt wasn’t super busy and service was quick, which was nice.\n\nThe food was tasty and definitely above average for an Italian restaurant. My pesto spinach ravioli was flavorful and not too heavy.\n\nOverall, solid restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaWVQcVBnEAE",
            "text": "This place is a little quite spot with such a nice atmosphere and the food is so good from the apps to main course perfect little date night spot"
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOXI2R2NnEAE",
            "text": "Uma agradável surpresa. Italiano com ótima comida, massas ao dente e super bem preparadas, com molho incríveis. Atendimento cordial, excelente. Sobremesas enormes e muito saborosas (dá para dividir 1 em para duas pessoas).\nVale a refeição preços ok (padrão NY e compatíveis com a entrega)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYckptOUVnEAE",
            "text": "Great food! I loved Rigatoni a la Norma, and my friend loved the Prosciutto Ravioli."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcWRTSXNRRRAB",
            "text": "Good place, the service was great and they prepare all very fast.\nI recommend it!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINUpXY1FnEAE",
            "text": "Todo muy bueno , la atención del camarero muy buena . RECOMIENDO ENTRAR 😁"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ajVtdVFBEAE",
            "text": "Nous avons découvert ce lieu part hasard, ce fut une surprise et nous avons été étonné part la place. Le service fut super et la cuisine excellant. Je le recommande x1000."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dzdXSjFnRRAB",
            "text": "I had an amazing experience at Bellini. The ravioli pesto was perfectly cooked with a rich, flavourful sauce, and the spicy vodka with shrimp had just the right amount of heat. Both dishes were outstanding, and the service was top-notch. Highly recommend—I’ll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cG91MVp3EAE",
            "text": "I went to this place on Friday night. there was no server, no waiter, only a very rude old man came out and asked me very angrily like he had no idea why I was here. Excuse me? I went to a restaurant. If you were closed just tell me, you didn’t have to be that rude. You know what, never mind! there are many good restaurants in this area. I don’t have to go to a restaurant where customers are treated like this."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyalllWHdnRRAB",
            "text": "Beautiful atmosphere, good bang for your buck"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNmFiMWRnEAE",
            "text": "Dont go! I had really high hopes for this place. The reviews were good. When we arrived, our table was not't set up after the previous guests. The waitress sat us down anyway. We didn't think much of it and figured they would bring napkins and utensils soon. I proceeded to order a glass of prosecco, which arrived spilling from the glass and wetting the table cloth.\nAgain, we are not a couple that complaints, and we continued our conversation. When the food finally arrived, we had to ask for utensils, napkins and black pepper. Our table was still bare about 20 minutes after we sat. I began eating and as my boyfriend took his first bite, he found a hair in his plate. We immediately requested the waitress and my boyfriend showed her the hair trapped within the sauced pasta. We were very disappointed at the lack of respect abd consideration. We were not offered an apology, noone came from management to speak to us. The waitress offered something else from the menu. I couldn't continue eating either. The one dish was removed from the bill, however,  the poor service, lack of consideration,  unprepared table, and my barely touched plate warranted for a no bill resolution. As the educated people at we are, we didn't fuss. We paid what was presented and left. Will not ever be coming back!"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dV9DVUdBEAE",
            "text": "약간 짜다\n노력하는 모습이 보기좋다.\n포크를 두번 떨어트렷는데\n소리와 함께 새것이 도착함"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eG9Pc3h3RRAB",
            "text": "The shrimp Sicilian pesto spaghetti was nice. The shrimp on their own was just a tad salty, but of course when eaten with the homemade spaghetti, they were delicious. The bread was also good. 4 ⭐ overall for food.\n\nSlightly disappointed with the 15 minutes wait past the expected pickup time accepted during the online order. When I came by at the pickup time, they asked to see the order confirmation, as if they were not aware of it. So, I suspected then it took them 15 minutes to prepare it. This was exactly 9pm on a Saturday, and there was only one table with maybe 6 guests, and the restaurant was otherwise empty, so the 15 minutes wait was disappointing. 3 ⭐\n\nNevertheless I give 4 ⭐ overall because I was satisfied with the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdzZHNHl3RRAB",
            "text": "Our first lunch in NY was in Bellini restaurant and it was amazing! We had their homemade pasta which is a real treat. I had pasta with chicken and rosemary, and husband had some pasta with duck, don't remember the names, but everything was sooo tasty. Big recommendations for this nice restaurant and regards to the very polite waiter from Greece!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4c0tTbDZ3RRAB",
            "text": "Great food. Inside-out meatballs is creative and cheese inside is good. The wild-mushrooms sauce on ravioli have rich flavors and meat inside make this dish not greasy. Bread in beginning is soft and have great wheat scents. Service and music taste also good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5a3FiNm1BRRAB",
            "text": "We had a special on the menu so not sure what it was.  But it was great. Had calamari as an appetizer. They brought us some bread. It was good portions and the food was good. The service was great and we went at like 4 o’clock so it wasn’t super busy but I think it’s deceiving there’s a lot more space in the back.\noverall we enjoyed it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeDhMQU9nEAE",
            "text": "The service and ambiance is absolutely amazing. Very friendly and polite staff. We ordered a few platters to get a variety.  We ordered the Red Sangria. It was sweet so I’d suggest something different if you don’t like sweet drinks. We have been waiting thus far about 20 minutes for our food. And it was absolutely delicious. I will be back soon. And if you’re in the neighborhood you should experience Bellini also."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNWMtX2JREAE",
            "text": "Had the fried calamari as appetizer. It was delicious. I ordered the linguine Vongole, my wife ordered penne with vodka sauce and my daughter ordered the margarita pizza with parsley and olive oil. They were all delicious. My only complaint was that the portion for  my linguine was a little small for me. In the end it didn't matter, my daughter only ate half her pizza and my wife ate two third of her penne. I ate the rest. We topped it off with coffee and tiramisu for dessert. I left the restaurant stuffed and very satisfied."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOGFtMlR3EAE",
            "text": "cozy little Italian restaurant. we came here for happy hour. we ordered fried calamari and beets salad . good quality food and ambient environment"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbl9pYjR3RRAB",
            "text": "Very hard to get any attention in clearing the table, bringing cheese, etc. or generally attending to our needs in a well-paced manner. Too bad, because the food is excellent. We must just have been sitting at the wrong table."
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSel9Qay1BRRAB",
            "text": "Super ambiance, chanson de crooner en fond. Service top.\nNous avons mangé une assiette bruschetta excellente et très fraîches, une pizza à tomber et des gnocchi au gorgonzola parfait aussi.\nLe meilleur restaurant italien que nous ayons fait."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbmF6ZXdnRRAB",
            "text": "The food is outstanding. I had a Duck special, I can’t remember the exact name but it was amazing. It takes a lot to catch me off guard, but this food made me feel like I was back in Italy. The service was great, the waitresses were very attentive. A table nearby spilled their wine, the staff quickly changed out the table cloth & gave them another glass of wine. Pricing was decent for the amount of food you get. 10/10 recommend, would definitely come back here again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaHBIZU1BEAE",
            "text": "Delicious Italian food.  Pastas are house made and are fantastic.  Truly you cannot go wrong with their pasta dishes.\n\nService was great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCcy1qTlFnEAE",
            "text": "Bellini is a great place to come for a date night dinner. It's a beautiful restaurant that has amazing pasta and pizzas. We ordered their Linguini Vongole - this Pasta was so tasty, you get fresh baby clams, and a nice amount of garlic, and the white wine wasn't too overpowering, and nicely garnished with parsley and olive oil! it was perfect. As for their Cavateli Carbonara, it was super cheesy in a good way. Very filling but worth it. Now for their Pizzas, we ordered the Margherita Pizza and Prosciutto Pizza to go. The pizza was refresh with a thin crust and had nice char to it."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMjV5T2tRRRAB",
            "text": "Situado cerca de central park, restaurante con platos italianos hechos con mucho gusto. La decoración del restaurante es preciosa y cálida, luz de ambiente. La atención es profesional, son muy agradables. Muy recomendable"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnODRLOWN3EAE",
            "text": "Started good with the beet salad... got real average from there. Margarita pizza was essentially a cheese pizza (see photo).  The other dish... underwhelming so I forgot the name was average. There are so many other options for restaurants…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwc3ZEcHB3RRAB",
            "text": "Cozy and intimate restaurant serving fresh and flavorful Italian food. One star off because I did not like that my sangria had no fresh fruits."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3ME4yZjlBRRAB",
            "text": "My wife, mother and I were in the area and they wanted to go to a different restaurant across the street. This place caught my eye and I walked over to see the menu. The menu looked great and a gentleman came outside to ask if I wanted to taste anything. He was very nice and not pushy at all. He explained that they make their pasta from scratch each morning. He asked questions about my appetite and my tastes and recommended three dishes. My wife and mother came over and we sat down. We ordered the Bruscette Funghi; bruschetta with goat cheese, mushrooms and caramelized onions. It was the best bruschetta I’ve ever had. I ordered the Toscana salad; cubed cucumber and plum tomatoes with onion oregano and olive oil. A bit different but it was delicious! I went with the gnocchi for my meal and it was unlike any gnocchi I’ve had. It literally melts in your mouth. Highly recommended and underrated restaurant!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPcVlhSlpBEAE",
            "text": "My 2 children and I stumbled upon this gem and the food was absolutely delish. My 7yo tends to be picky…as you can see he enjoyed is chicken parm. The chicken Marsala and spaghetti and meatballs was also amazing dishes! Oh my those mozzarella balls will be on our taste buds for days to come!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaHM3QjFBRRAB",
            "text": "Great family run restaurant. The fresh bread, pizza and pasta are fantastic! Definitely recommend this spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCZ1pxYnl3RRAB",
            "text": "Loved, loved, loved the food, ambiance, service and selection!  We all loved our food!!!!  Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbWJpTnR3RRAB",
            "text": "Amazing service. Patio setup outside was really elegant. The Shrimp Sicilian Pesto is 10/10!! Can't wait to visit the city again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcXRqLUxnEAE",
            "text": "A bit expensive, but the gnocchi was really good and so was the Ceasar salad. Great service."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDeGRPNGJnEAE",
            "text": "My husband and I had a lovey dinner at Bellini. We had never been here before but have walked passed many times and always say, “we need to try this place.” First impressions, friendly hostess and nice subtle music playing. The menu has something for everyone, vegetarian, fish, pastas, meats, appetizers and entrees. It was tough deciding what to order, as everything sounded tasty. My husband had the CAVATELI CARBONARA with pancetta. It was melt in your mouth delicious. I selected one their “favorite plates” - PENNE ALLA VODKA. The sauce was so creamy and tasted amazing. Very fresh pasta.  I added grilled shrimp, which were done perfectly. Our waiter was personable, friendly, attentive and funny. We really enjoyed our evening at Bellini.  We will certainly be back!\nAs for that bizarre one star review below with false information, patrons were allowed to use the restroom and the staff was pleasant in directing where to find it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dWVtV3lRRRAB",
            "text": "AMAZING food! We chose Bellini on a last-minute whim and I'm so glad we did. If you want authentic Italian in a wonderful setting at a price that won't have your head spinning, choose Bellini. We ate in their \"street\" section (which I now love about NYC, by the way) and it was perfect. Service...just as outstanding as the food!"
        }
    ],
    "reviews_count": 74
}