{
    "name": "Tasca NYC",
    "place_id": "ChIJg-QDdKFZwokRumpX4_PxJuU",
    "grid": "MN7",
    "address": "505 Columbus Ave, New York, NY 10024, USA",
    "rating": 4.7,
    "user_ratings_total": 388,
    "phone_number": "(212) 362-2211",
    "reviews": [
        {
            "date": "수정일: 2일 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlb1l5VDdRRRAB",
            "text": "Excelente atendimento. Pratos bem servidos e saborosos (pedi Vieiras de entrada e depois camarões e a sobremesa \"3 Leches\"). Possui dois ambientes: o da entrada e o do subsolo, onde fiquei. Alguns garçons falam espanhol, o que é interessante quando nosso inglês trava. Haha."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JM2JUVlZZemRPWmpGamRFcGlhazF5Y0VSdVJYYxAB",
            "text": "Rodrigo was wonderful! Service was great and the food was amazing"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKM1UwdHdhM05zV1U5Q1pEUTJjM2xUYkRVd1NGRRAB",
            "text": "Our new favorite spot on the UWS — hands down one of the most impressive dining experiences in NYC. Everything from the first bite to dessert felt intentional, balanced, and elevated.\n\nWe started with croquettas, octopus, and empanadas — all flawless. The croquettas were crisp and rich without being heavy, the empanadas perfectly golden with sauces that actually added something, and the octopus was tender with just the right char.\n\nFor mains, we went with two specials: a filet mignon topped with wild mushrooms in a silky sauce, and a halibut over a delicate leek base. Both were exceptional — beautifully cooked, full of depth, and plated like art.\n\nDessert sealed it: the cheesecake was unreal — light, creamy, and paired with sorbet and fruit that made it feel fresh instead of heavy.\n\nWhat really sets Tasca apart is the service. Rodrigo made us feel like regulars from the moment we sat down — warm, attentive, and clearly proud of what they do here.\n\nTasca is the rare restaurant that nails both the food and the feeling. It’s upscale without being pretentious, and every dish has a point of view. Easily a top-tier spot in the city"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNFgwRjBNR1UyZDBoalVGVndWa2c1Y0dKMVpWRRAB",
            "text": "Tasca NYC – Review\n\n✅ Pros:\n- Authentic Spanish and Portuguese flavors\n- Cozy, inviting atmosphere\n- Great tapas and well-crafted cocktails\n- Friendly and attentive service\n\n⚠️ Cons:\n- Can get busy during peak hours\n- Prices slightly on the higher side\n\n🎯 Summary:\nTasca NYC offers a warm, flavorful experience with delicious tapas and drinks, perfect for a casual night out or small gatherings. Ideal if you love Iberian cuisine and a lively vibe."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swdGRHVXhSRFIyZW5sclIycHBjMjQyUVRkV04wRRAB",
            "text": "Excellent Spanish and Mediterranean food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcFMxTTNVV1psZVhwbFJ6WlFaRU5vYUdkalkwRRAB",
            "text": "The food is superb. The service is friendly and warm. The vibe is energetic. If you like duck, this is the place! Deliciously complex sweet spiced (not hot spice) and lightly fruity.  Cooked perfectly to the recommended medium rare. Equally delicious were the lamb chops, and the\nsea bass. The mixed seafood was a tad salty for me, but still quite tasty for others in our party."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbVV6UjRiM1ZUU0V0NE1FaGhSSFJqY2xaQlgwRRAB",
            "text": "Great lively atmosphere over the top polite cheerful staff. We had amazing small plates to share for 2 people: octopus special, steamed kale, scallops and amazing sliced jamón( ham)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5b2RHOXhaV3RrWVRSNFRGaDFZVkpKY21WMmNtYxAB",
            "text": "The Rib eye Steak amazing, with tostones. The drinks we didn't like it. The vibe is good, the waitres are nice too. Music low and nice you can talk without yelling. I really enjoy it. I will come back again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaYVdEZHpWRlppT0doTlIwTlRXVU5KYUdOc1JFRRAB",
            "text": "Absolutely marvelous dinner, the food and service exceeded all expectations. We spent a week eating our way across Manhattan and this was decidedly our favorite meal of the trip. After finishing a Michelin*** meal (which was phenomenal!) my partner and I both agreed we'd have rather gone back to Tasca. The effort put into the experience was obvious and well appreciated. We'll be back every time we visit NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMFoySnZVVWxaU0VKSFZ6WnRUMU5qWmtSaVNuYxAB",
            "text": "I’ve been twice. Food and service are excellent. This time…there was a very noisy table nearby. Seems to be friends of the manager/owner. Really impacted the experience. Maybe it was just bad luck this time. Will try it again…it’s that good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcGRFSklWMmhLUjJSU05WTm1lbUl3TTFGRFFuYxAB",
            "text": "We married at city hall on Monday and planned a dinner at Tasca post ceremony. Justin was so kind in helping us be seated in a lovely comfortable booth and confirm that our photographer could take photos of us at the table and Rodrigo provided incredible service and vibes. The food was lovely and atmosphere incredible. Thank you so much!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMFZFUmxNWEp3Y1V0MlJFNWpPWFJpUm1aRlpsRRAB",
            "text": "From the neighborhood and stopped by for late night tapas. Rodrigo is your guy. Best octopus and empanadas in the city. Highly recommend and will be coming back to check out flamingo night."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUlozbG5WWGhsZDJoVVJrWk1kV05UUzFGcWFsRRAB",
            "text": "It is always a great experience at Tasca. Me and my colleagues dined here today and we had an exceptional dinner and cocktails. We had the sangria which was fresh and delicious. For the appetizer(s), we had the croquettes and chincharron. All were delicious and fresh. For my entree I went with the skirt steak, medium rare, and it was cooked wonderfully. It came on top of a bed of yuca fries which were also great. This is my second time here, the first being on NYE with some friends. Tasca always proves to be amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsV1gyNHdVa3BJYWpaaU5sTlZXWGxLYTNSV2VIYxAB",
            "text": "An AMAZING restaurant! From the drinks, to the service, to the aesthetic, the music, and the food. We had the empanadas, grilled octopus 6oz, croquetas de maduros as our starters and they were all very delicious! Our entrees were the Magret de Pato and Chuleta de cordero! Such amazing plates and combinations. Can truly say we had licked our plates!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MlFWOXJVbk5CYVdVemMxb3Rka2htYWtOblpGRRAB",
            "text": "This place is such a wonderful place to bring groups for a nice and fancy dinner. The atmosphere is beautiful with some really creative decorations, the bar is huge with a hefty selection, the service was top notch, and the food was amazing.\n\nWe went for Restaurant Week and got their prix fixed menu which normally feels so limited but they had some great options. Everything we ordered came out relatively fast and everything was delicious. The drinks were refined and well balanced which I will always appreciate.\n\nThe server was super helpful and really gave us a great experience. His recommendations were perfect. It felt like he knew exactly what I would like. I would definitely recommend this place for anyone looking for a great meal at a very comfortable and welcoming restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FdFFrZzJZazlvUTI1aU1tTnBlVkpuVFc5bWEzYxAB",
            "text": "Amazing food. Rodrigo with the excellent service. Will be back soon"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQ2NFZ3habXM0WjJKdmVVTmtkVTloYVRSM05rRRAB",
            "text": "Tasca NYC creates food that satisfies at a deeper level. Workers elevate this restaurant to exceptional status. Their food offers better value than high-priced places. Love the vibe here. Most visitors enjoy Tasca NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWR2VsQlJkbWhpT1c0M09XTm5WVGhQWVRoTFZsRRAB",
            "text": "This place showed true skill. Workers here show exceptional warmth while meeting all needs. Their menu tastes great and deserves your time. Each part here contributes to excellence. This restaurant deserves the highest rating possible."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SGFuTkRUVFphU0RSb1ZHTjNWWE0wZVhOaFdIYxAB",
            "text": "Este lugar me encantó , la comida es deliciosa, el servicio es super amable , son muy educados y amables!! Me encantó mucho y claro que volvería a ir 🥰 lo recomiendo al 100% gracias!!!🥰💕❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRk1ISnRkbFpIV1VaNlgxRk1Wazk2V0VOUFlVRRAB",
            "text": "Way OVERPRICED. food didn’t command the price.  $300 for what?   Octopus was salty and steak was cold\n\nService was nice but, big deal.  Price way out of line.  Other nice places for better cost."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVFh6RXpRbGxZUlZGSWJuWTBiR3AxZVdWUGNYYxAB",
            "text": "Loved everything about this restaurant.   Great food,  service,  and decor."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kblF6TlBkbE0zY2pOdVJraENjemhWU2xWc2JrRRAB",
            "text": "We love this place so much we had our son's post-wedding dinner here.  The food is great and Jay and his family are fantastic hosts."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRFNIWjVPRlJ5TUVScGNUaDZPVEp4YnpBeGJHYxAB",
            "text": "Rodrigo was an amazing server- excellent recommendations and amenable interactions. The food was amazing- plantain croquettes, grilled octopus, churrasco, truffle and flan. The churrasco was tender and juicy. Cooked to perfection. Food was delicious!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTlpVVk1lbUZ4YURGallVMXVOR3hHWlhGSVJGRRAB",
            "text": "Muy buenas atención y la comida excelente. Gracias a George y Cruz por sus atenciones."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SaFlVRlBhRk5QVnkxWVdUaG1iR2g2YkhKRmRHYxAB",
            "text": "Superb scrumptious Spanish sustenance served with style.\n(But the 3leches lacking a lil leche)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNVozaGZXbUZZZVhGUFNtUnVkMVY2VVVKQk4wRRAB",
            "text": "Amazing fusion eatery with a mix of different Latin flavours! The steak is amazing! Craft Cocktails, Flan, and the shrimp with mushrooms. Finger looking good! Absolutely one of the best restaurants for Restaurant Week in NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCU1MwSjNOV1o0ZVdKcVQwSnFVbmxXVTBaS1JrRRAB",
            "text": "Truly a wonderful tapas restaurant, perfect for a date night or special celebration! We had a variety of small plates, including the vieras (scallops), the polpo (octopus) special, the setas y gambas (shrimp and mushrooms), and the coca de setas (flatbread with beans and vegetables). Everything was absolutely delicious, especially the octopus! Also, Rodrigo, our server, was extremely attentive, had amazing recommendations, and made our night extra special! 10/10 in all categories!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbFdVOVBSVk5pTVY5RFprNXlWa013Vm1KQ04zYxAB",
            "text": "Tasca is the perfect date night spot! So wonderful from the food to the atmosphere, this place has it all. Special shoutout to Rodrigo. In addition to his excellent service, his suggestions of the Pulpo a La Parilla and the Flan De Caramelo just took the whole meal to another level! 10’s 10’s 10’s across the board"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTWVsbHJVamh3ZUZCS1kwbFlTVkJOVmxCS2NHYxAB",
            "text": "Amazing place. The food was incredible, specially the shrimps!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sd1dVUndRazlPTkVwSkxXTkVTa0pGYUhrdFQxRRAB",
            "text": "Reviewing 2 meals, one on Saturday and the other one Tuesday evening. Our server George could not have ben more Patient and helpful... as was his Assistant Cruz. There was no rush and we enjoyed a Great Time with a Great Meal.  Sitting out front on Tuesday evening was incredible (the perfect weather certainly helped) - but we will be going again and again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSlJrMVpNRXBvWVRoQ01GSXhjSHA2ZEZkamNVRRAB",
            "text": "I’ve been here like 5 times already and couldn’t be more happy. Food is good. Had George as my server and he has been super nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Nd2VqaHZVSE5oT0VwQk4yRTRTVVpwVmxoME5VRRAB",
            "text": "Croquetas de maduro and the churrasco steak were insanely good. The restaurant week deal was very good for the portion sizes and left completely satisfied for an nyc dinner. Loved the service/wait staff and the interior atmosphere. Would love to come back for their flamenco night"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRmVEZGxVRzR0Y0hCRlgwZEhTRkZyZWtSNVUyYxAB",
            "text": "Wife and I had dinner at Tasca 7pm Sat. We sat at the bar 👍\nHostess was great, vibe inside was classy yet cultured and the bartender (didn't get his name but husky fellow, been there 4 weeks) was the best server/tapster...knows his food and drink with a passion. Sangria was excellent. Had grilled Octopus (very unique, delicious prep) with an insanely good skirt steak (possibly best ever had).  Wife had seafood mix that came with an outstanding rice bowl with a scallop. Just a great all-around and different"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGd1VsSklPVWsxU21zM1ZHbEdSamhEYlZWdk5GRRAB",
            "text": "Very impressed by the service and food at this spot.  The paella for 2 was authentic and delicious.  The flan for dessert topped it all off.  Excellent!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeUxTMUJkMGs1TWxNMVExODVSa2R2VnpsdGIwRRAB",
            "text": "Really fun latin place with a good seafood menu. Service was good, vibe was good, food was good. Total hit"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcU4wYzVNM0phTFhOV1VWRXRlbXRFTmpOblVYYxAB",
            "text": "Just celebrated my birthday with 7 of my dearest and had a blast! The vibes are great and the food delicious. They make the best mocktails to order not in pre-prepared over sugared jugs that have sat around for hours, they provided excellent service our server was named Ashley and it was her last day after 2 1/2 yrs there and off to grad school. Highly recommend this spot for groups! It’s got a flare and it’s fun!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMlNrcFpVRUkxWmpkNU5tdDZSV2hzUWxCVVFsRRAB",
            "text": "Amazing brunch experience, delicious food and bottomless sangria, perfect for a Sunday brunch! Friendly staff as well."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sM1lUTmhOWEZqZFVKS1dGazVibUpPVUdoWVMxRRAB",
            "text": "Good menu and really good staff highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcU5HWlhhSFZOYW5velZEWjRNalZ1Vkcxd1QxRRAB",
            "text": "Good option for authentic Spanish cuisine. Well decorated with lively atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201U1pHOTJVMWh3ZVcwMlIwaEJiVUZXTkhnMlVrRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\n\nWe celebrated our anniversary at Tasca NYC last night and had a wonderful experience! The service was fast, friendly, and made us feel special throughout the evening.\n\nWe started with the grilled octopus—perfectly cooked and full of flavor—followed by the paella for two. While it was a touch on the salty side, the portion was generous and we really enjoyed it. For dessert, we had the passion fruit cheesecake, which was light, tangy, and a great way to end the meal.\n\nA lovely surprise was the complimentary digestif offered with dessert to help us celebrate—such a thoughtful touch!\n\nOverall, a fantastic dinner and memorable anniversary evening. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTVdXSjBVR0pxZDA4eFJXRnpXV3R3U2pOVWNFRRAB",
            "text": "Spectacular meal and experience with our family visiting from out of town. I asked for the corner booth because of the special occasion and they were able to accommodate us. One of our party was a vegetarian and could eat very well with the wide variety of small plates. The signature cocktails were very good… Green Smoke was one of our parties‘s favorites who’s  a fan of Mezcal. We had a very good Rioja from their extensive wine list. I enjoyed an halibut special—good portion size and delicious sauce. Our server Rodrigo was very personable and brought us a special drink at the end of our celebration. Highly recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYjV4YWl1b3VlMEVBEAE",
            "text": "This is one of the very best restaurants on the upper west side.  Great food, ambiance, the service given by Rodrigo was outstanding.   Thank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMRFE5ZlR1NEpTYVNBEAE",
            "text": "The meals were wonderful. Very well executed and flavorful. What stood out was they let the primary ingredient be the star of the show. The sauces were great but didn’t over-power. We had the scallop appetizer which was good - fairly standard. The sea bass entree was very well executed. Crispy skin, perfectly cooked and amazing sauce. Rack of lamb was lovely with a mild sauce that paired well and let the lamb shine. The yuca soufflé was an incredible surprise with a Tempranillo reduction that put it over the top.\nService from Rodrigo was on point.\nAll the yum, none of the pretention. Loved it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VObWc4cnVlM3J4ThAB",
            "text": "Had the octopus, the croquette and the paella. The octopus and the paella were great. A really good size of octopus for a starter just the right amount of char. The paella is enough for two to share and all the seafood is done really well. Worth the price for the paella a really good spot for seafood."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKT1JyYy1WdUxUN25BRRAB",
            "text": "Great!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNU91SURREAE",
            "text": "Consistently fab and worthwhile, from menu classics to seasonal additions and an amazing staff. Always love bringing out of towners here!"
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMk1MejBRRRAB",
            "text": "Nette Atmosphäre. Gutes Preis- Leistungsverhältnis"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOXJEc0F3EAE",
            "text": "Paella is phenomenal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcXUyTkNREAE",
            "text": "Must go. It was perfect.  Customer service was amazing!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbzVLaWlBRRAB",
            "text": "An absolute gem on the Upper West Side!\nTasca is a beautiful space—elegant yet welcoming, with stunning bird-themed lighting that adds such a unique charm. Our waiter was knowledgeable, attentive, and brought great energy to the night. The location couldn’t be better—perfect for a post-dinner stroll along Central Park.\n\nNow the food—wow. We started with the empanadas, and they were perfectly flaky with rich, flavorful fillings (the chicken and beef were both standouts). The seafood paella was beautifully executed, but the dish that stole the show was the pork loin—juicy, bold, and bursting with Puerto Rican flavor. A memorable meal from start to finish."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeUp6X0pREAE",
            "text": "Fabulous food experience in UWS. Both of duck meat dish and seafood dish were amazing and so flavorful. Berry sauce on duck meat dish was intriguing.\n\nWhat was so unexpected was how good the rice side dish that came together with seafood menu was. Honestly speaking, it wasn’t A+ for its appearance personally and rather looked too simple and mushy. But it turned out to have perfect savory taste with whatever seasoning going in there, and I can actually eat that everyday, as someone Korean whose DNA is based on rice.\n\nI also loved Cigar City IPA from here; well balanced hoppy taste with slight hint of fruity flavor, a perfect kind for me.\n\nAbsolutely gonna come back and try their Paella which I couldn’t dare to order in my first visit cause of my other plan afterward.\n\n스페인 음식점으로 추정하는? UWS 맛집입니다. 오리고기 메뉴와 해산물 메뉴를 먹어봤는데 둘 다 그 단짠의 맛 정도와 밸런스가 매우 마음에 들었습니다. 다만 오리고기의 경우 고기 밑에 호박샐러드? 의 질감을 가진? 잘 모르겠는 녀석이 있는데 블루치즈에 살짝 버무린 듯한 감이 있어서 불호이신 분도 있을 것 같습니다."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcW9pQW5RRRAB",
            "text": "A lovely dinner. Tasty Spanish dishes, great paella. I enjoyed the red wine duck, absolutely delicious.\nService was attentive. Restroom was clean. Isn’t a place of extraordinary food, but by all means good enough. Fond memories of a dinner"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMGZEVTZ3RRAB",
            "text": "Went on NYE for a pre celebration dinner and the food was amazing, good portion and presentation, as well as the taste. My party  ordered the empanadas, croquetas and ibérico as appetizers and everything was so good. We tried the Tempranillo Marques de Murrieta and it turned out to be just perfect.\nAs for the entrees the duck had just the right amount of sweet, the zarzuela was amazing, I can only imagine what their paella is like, and the filet mignon was just the right amount and wonderful presentation. And for dessert the cheesecake, so good.\nThe service was excellent from the moment we stepped in. Our server answered all of our  questions, checked on us, even helped us with putting on our coats, wished I remember his name.\nAt last we decided to stay longer so we sat at the bar, the bartenders were very friendly and the drinks really good.\n100% one of the gems of UWS."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcEs3ejFBRRAB",
            "text": "Incredible drinks and Spanish-Caribbean fusion food! Every single dish we ordered was flavorful and i can’t wait to come back and try more of the menu. Rodrigo and the rest of the staff were so attentive and provided excellent service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuX183WkdREAE",
            "text": "We can not say enough great things about Tasca.  For an hour and a half we felt like we weren’t even in Manhattan, but in a Spanish Caribbean resort restaurant.  The entire place is so tastefully decorated and the ambience is so warm and welcoming.\n\nJose was our server and was an absolute joy and he’s also quite the comedian (but no really he’s a real one) .  His recommendations were spot on and we couldn’t be happier with the IMPECCABLE service he provided us.\n\nWith that said, ALL the staff is extremely attentive and these people are great at what they do .\n\nRodrigo was also extremely friendly and helpful as well, and the general manager is beyond professional.\n\nNow the food/drinks :\n\nDrinks: vodka lemonade and a fruit mock tail:excellent\n\nAppetizer: veggie empanadas, CRISP AND YUMMY.  Dipping sauces were incredible and create so much depth of flavor\n\nMains: churrasco with chimichurri and octopus entree (it was a special). The octopus was tender and unctuous and The churrasco was a PERFECT medium rare and MELTED in your mouth .  The yuca fries were ON POINT\n\ndessert:\n\nCoconut tres leche was scrumptious and the trufa (chocolate truffle) with raspberry sauce were the perfect finish to our wonderful evening\n\nTo sum it up: the service is UNMATCHED, everything is packed full of flavor, and the prices are beyond affordable .  Less than $200 for all three courses for 2 people .  Get yourself to Tasca for the perfect date night or any occasion.  They’re really incredible , and just a few short blocks from 81st museum of natural history station.\n\nThank you Tasca!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcy1UdWRnEAE",
            "text": "Everything from the cocktails to the dessert was so full of flavor! Great presentation and the food was amazing. Hard to pick a favorite but the croquets were such a compliment of flavors I would have to order them again to start. Cocktails were a highlight as well. We will be back for sure!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NHNLck5REAE",
            "text": "I had such a great experience celebrating a friend’s birthday here. The ambiance is great for a celebration or date night. Our waiter was fantastic and suggested that their octopus (not pictured) was the best in the city; he did NOT lie. I…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcXY2Ty1nRRAB",
            "text": "This is true Spanish cuisine. The highlight for me was the pulpo, many times places don’t properly know how to season octopus as less is more and it doesn’t hold onto seasoning very well. They found a way though. It was prepared very well and complemented by the potatoes too. My friend also enjoyed his meal, good sangria as well!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OVAzdkd3EAE",
            "text": "I had two bad mussels. They smelled bad when brought out and there was too little sauce. The pork shoulder was very tender but not very flavorful. Chicken empanadas were a little bland too. All in all, this food was pretty good and filling, but  not a standout."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbTc3OHFnRRAB",
            "text": "Very authentic Spanish restaurant with a wonderful vibe and great service. First course was a flatbread mushroom pizza-like dish that was very tasty. The seafood main was excellent, as was the duck, along with some nice Spanish rice.  There was originality in each dish, for example the duck was on top of a plaintain and cheese thing that was different and excellent. Wine choices were slightly disappointing.\n\nWent back for the risotto, which was extremely generous, with lots of goodies including 3 large pieces of chicken. Had a bit too much salt though."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdXRtekF3EAE",
            "text": "Food was great and really well seasoned. The croquetas , paella , yucas fritas , and the passion fruit cheesecake were top tier. The ambience is great, and our server Ashley was awesome 🙏🏽."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqX19ER3BnRRAB",
            "text": "Food was amazing. Every bite was delicious and flavorful I will honestly come back for years to come just from this one experience.\nGabriel our waiter was the best part of our meal. He was attentive and charming and honestly just all around lovely. I would recommend coming in and asking for him.\nThe sangria was delicious too. It’s 100000% worth it to come here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMjhlZ2hRRRAB",
            "text": "This is the second time that I come to have lunch at this spot. The food is amazing, super tasty, good portions and excellent presentation. The waiters are super attentive and the inside is beautiful. Definitely coming back!."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNONlpqejdBRRAB",
            "text": "Exquisite,  delicious, and superb service!! All the plates had a delightful taste.  Prepared to perfection.  None of the plates will disappoint you.  You can tell that the kitchen staff prepares everything with love.  Great date night!! Thank you, Tasca, for a night to remember."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxM1pQQldBEAE",
            "text": "Everything was fabulous, the food, the cocktails, the ambience and the service.  I can't think of one thing I'd even nitpick about.  It didn't surprise me that the owners used to own Don Pedro's which closed a number of years ago.  I was a regular there and was so sad when it closed because that used to be one of my favorites.\n\nWill definitely return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMFozUzJRRRAB",
            "text": "Fantastic is what I would use to describe this restaurant.\n\nThe recommended wine and specials were not disappointing at all. I really enjoyed myself with my family and felt very comfortable with the Caribbean Latin mixed with the style of Spain itself.\n\nEverything was beyond satisfying and just a wonderful time to enjoy~"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxd1o3X1JREAE",
            "text": "This was one of my favorite dining out experiences in NYC. The atmosphere is great, the food was excellent, and the service was attentive. The tapas style was great for our large group. Our cocktails were all very good, I got a spicy margarita which could’ve had a bit more of a kick but was great nonetheless. The highlights of the meal were the octopus/pulpo and the paella. One of the best paellas I’ve ever had, including in Spain! Only thing I would skip is the churrasco. Highly recommend this spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMGIyeUd3EAE",
            "text": "Great recommendations from our waiter Justin. Enjoyed the octopus, pork and ham.\nNice cozy atmosphere. Will definitely come.back again!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLTlxZVp3EAE",
            "text": "What a wonderful dining experience! From the moment we walked in, the ambiance was warm and inviting. The staff was attentive and friendly without being overbearing, and the food—absolutely delicious. Every dish was thoughtfully prepared and beautifully presented. You can tell they use quality ingredients and take pride in their menu. Whether you’re out for a casual meal or a special occasion, this spot is a gem. Highly recommend and definitely coming back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2cTZPcUZ3EAE",
            "text": "Incredibly well-designed space that is perfect for a date! Their drink menu is robust and their food is perfect for splitting and sharing. My date and I split the empanadas and they were delicious and Tasty. One of the managers, Jay, was…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dHQyWmpRRRAB",
            "text": "Organized a retirement dinner in the Wine Room and could not be happier. From the start, coordinating with Tasca was effortless, Norisa was so responsive and helpful in planning. The food was delicious, guests specifically loved the pork. Service was top notch."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdFBybWtBRRAB",
            "text": "Excellent experience. I don’t usually do google review but I would love to write a paragraph for Tasca. Cozy atmosphere and very warm staffs, excellent service and absolutely exceptional food. We had octopus and scallop for the starters and the paella was the best I’ve ever had. They also have cheesecake to die for. I just can’t wait to come back again."
        }
    ],
    "reviews_count": 72
}