{
    "name": "Nice Matin",
    "place_id": "ChIJ5YYLvYhYwokReZvaF93xmFw",
    "grid": "MN7",
    "address": "201 W 79th St, New York, NY 10024, USA",
    "rating": 4.5,
    "user_ratings_total": 1920,
    "phone_number": "(212) 873-6423",
    "reviews": [
        {
            "date": "수정일: 6시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvak1yektREAE",
            "text": "Excellent as always. Loved the special cod. Risotto was among the best I’ve had. Great service"
        },
        {
            "date": "6시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WV1JuSkRjM2xGTmpCUVFWcG5lakpHZFhaR2QxRRAB",
            "text": "Lively. Quality venue."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdFdtMHhiWEp6YW5aSGJXMHdWRzVTYldzM1FrRRAB",
            "text": "The hostess broke the back glass of my phone after I asked her to charge it. She didn’t come and tell me instead left it at the stand with a note that said “Found on floor”. Super annoying."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcmExTnNibTFXTFhWMVQxSllWMUpwVDBOVlpIYxAB",
            "text": "The best steak I’ve ever had. Really impressive wine card. Overall great experience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdFVVeE1hR2MzTmxSR1oydHVUM1pQVGxGWFJsRRAB",
            "text": "My husband and I were there on Sunday evening for my birthday. The atmosphere was beautiful. We watched the city lights wink on as the warm glow of the restaurant remained, the food was perfectly delicious. Our server Caitlin couldn’t have been lovelier. She was helpful, not pushy but efficient. She was there when we had further questions about a food allergy. She produced a seat cushion ( I had needed), and a surprise dessert with candle, not ordered. It is a fond memory. We will go back many times."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWclRWTmtkek5zTFdkamJuUTVaMGQyVUROb1QwRRAB",
            "text": "My husband Myself and my seven-year-old grandson had a wonderful dinner try the homemade pasta dishes they were delicious. Our waitress Amanda took great care of us and was delightful!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeFkwUkdaakkxT0RCbmQwMXFhVFJEV201SFlYYxAB",
            "text": "Enrique was so attentive and had such great recommendations. Fantastic food, wonderful atmosphere. Incredible decoration."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WFdITkZOM3BzUzJsRFgxcFdRWE5ITFRJNWFVRRAB",
            "text": "My favorite place to visit when I want a comfortable atmosphere, warm service and good food!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNMlNVTjVaRTFFUkhBNE9VNVNPRlpsWlVnNFkwRRAB",
            "text": "Food and service was excellent.  Our waitress, Amanda, was amazing. Highly recommend this restaurant.  Espresso martini was the best I have ever had."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUU1ISTNabFphZDJrd1pYbFZOa1pwUnpSeFNVRRAB",
            "text": "Fabulous experience . Staff was very nice and food was excellent . Atmosphere was also great . Wallie the sommelier was very impressive and knowledgeable. Amanda was our waitress and was very sweet and efficient. Thank you"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRlJEVmpaazEwTm5kUGRFcEVYMDFRYjNJMVMwRRAB",
            "text": "Nothing compared to 2024 time in terms of food, service and cleanliness of restrooms. The place is transformed into a mediocre chain restaurant. Not the same classic atmosphere of lavishness. Very disappointing experience after having a very good times here"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVlptcHBkM0J6ZGxoWGIwaFFPVWhwVms5Q2JGRRAB",
            "text": "Amanda was fantastic!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTldWZDVZMGxSZVRKRlQyd3lRaTFzUVZodU9XYxAB",
            "text": "Great service, excellent food,huge wine list, delicious cocktails."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUlgwRXRSMWQwVWpkSVEwRm9ObTFQWWpaa1pHYxAB",
            "text": "Visited this French restaurant after watching an off Broadway show. We walked in and was promptly seated. We ordered many appetizers WITH ENTREE  and desert. Foodserver Enrique and Amanda were very attentive. The sommelier was informative and guided us to a great wine that night. Overall had a great experience."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paU1kxZDNla3hYVVMxZlpISjVVWG96Wm5KbFRYYxAB",
            "text": "Great food and exceptional service. Bright, airy surroundings."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WQ1dGRldhakI2UTJZM1prbHNNamRvY0RWUlpIYxAB",
            "text": "Survived 20+years as a local staple in the UWS restaurant scene for a reason. Average age of clientele 65+. So hope the next gen see the quality."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twV2MwdE9Va1V5VEVFMVNtMHlNMGRyWVVveVJFRRAB",
            "text": "After a visit to the museum we were starving and planned to subway back to mid-town.  Stumbled upon Nice Matin and managed to squeeze in with out a booking by the bar.  Was treated a fantastic service by our barman and the food was nothing short of devine - the truffle burger and chocolate souffle are a must."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeFZUSTNMVnBKWVhVMFJ6RklXbVZ3WjNKa1ZsRRAB",
            "text": "Dined here solo and they gave me a lovely little table. Very reasonably priced. Excellent, friendly service by Amanda! Lovely atmosphere. I had the avocado omelet and it was wonderful. I’ll definitely be back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xseVJ6ZHNaV050VEVsSlEyTnFjbVZSTjNONE1FRRAB",
            "text": "Stopped for a cocktail and snack. Our server Amanda was awesome. Food and drink were great."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkb1pGcGljRWc0YTIwelNFRmZhV0Z5UlVGUmJWRRAB",
            "text": "Amanda was an excellent server last night (10-13-25). The attentiveness & professionalism was 5 star! The food was excellent, and everyone in our party had a great time; especially our 92 year old friend!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dmEyVllhbTVUYjFsdk9VdFBRVmw2WjNVeGNIYxAB",
            "text": "Amanda was great!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNWFYVm1RemhyVjFkbVZUQklZVFp5VEZBMVRXYxAB",
            "text": "Christians service was outstanding. Just outstanding. He is definitely an asset to your wonderful establishment"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OcUxVNXVjRXBRY1d4bldVaERjekJNVm1oVlowRRAB",
            "text": "Food was good. Don't like different waiters coming by every few minutes."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMk56aE9MVnBOVW14aVVHVlFTVWxaWDNwTlVIYxAB",
            "text": "I come here every time when visiting NYC. It’s been a lunch and dinner staple for decades. The food is fresh, reflective of the seasons and the last time, the steak frites was perfectly executed. Amanda was exceptional, friendly and attentive. Always a reason to return here. Thank you."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bFJFVk1MVkY1Um01MWRuVjRPQzFmUzBFd01uYxAB",
            "text": "Amanda is awesome"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaFNrNUNlSFpwT0VGeWExcERSVFpIY2pCZldYYxAB",
            "text": "Amazing food and service!!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dmJGTkdjbGRZVmxKRE1GVkthbFp3T0VGMVFsRRAB",
            "text": "We ordered the French toast and the avocado omelette. Both were very good. French toast wasn’t too sweet, it was just right. Omelette was delicious. Portions were bigger than expected so that was a plus. Hot coffee was good, we asked for honey on the side to sweeten it up as they don’t have any syrups."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeFpWSm1iM1ZwTkdkbmVXbzFOelZXWXpsVFNtYxAB",
            "text": "James and Tess were so great, thank you!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQ1drZDJZVE5oV1dKdVpWVnJkRXd0ZUZSalkzYxAB",
            "text": "Outdoor dining! Really pleasant server, Amanda and family friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMllXeG1NRXhPTFRWYVlsRllhamxqTVdnME1IYxAB",
            "text": "Nice for brunch outside. Very good food. As restaurants go, the waiter/waitress takes the order and a helper brings the food. The helper was a nice woman trying hard but apparently was not given all the instructions on what we ordered. Then the waitress comes at the middle and end of the meal and asks if everything was ok. It wasn't because they didn't keep track and handed it off. But what are you supposed to say in front of your friends? Guess what, we were not asked about our meal in honesty...but to hype the tip that you are embarrassed to not reduce in front of your friends. No tax on tips is a good idea...not that most was actually collected. How about no tips if you have been taxed? Who loses? The diners, the restaurant due to lack of repeat business, and the waitress due to smaller, but alas not much smaller tips. I'm sure they'll love reading this."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRk5HcFVYelpRZFZNMVNtMURkMmRKWmpCSGFXYxAB",
            "text": "Many thanks to Gable Amanda & the hostess for being sensitive kind knowledgeable & warm. Also for seating us in a cozy spot. Top marks to the Manhattan maker & the chef for the free apps tower & our steaks! 🌟"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQ2FWcERVa3BVU2s5RE9XZFlTbGxJZW5ST2QxRRAB",
            "text": "Had a great experience. Food was solid, French and safe. Everything I ordered was good. Server Kevin kicked ass! Thank you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWlJIUm5ZMnhLWW0xd1kwZzVPSFozVEZSSWJWRRAB",
            "text": "Amanda is the best!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwQ1VFcGtiVmxsZUZrelQyRlhRM0JXT1RCR1VtYxAB",
            "text": "Amanda was the best!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214M1ZFRTRMVUZwZEhGbGMyZ3phbGhWUVRGNFUwRRAB",
            "text": "Had a very nice brunch today. Our server Amanda was lovely and professional. Food was excellent."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201QmNFOWxUMUpGUTJac2JFdEtiMHB1Ymw4NVdsRRAB",
            "text": "Muy ricas y gran variedad de pizzas"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZd2VsaFhOR2t4UWpSdE5rWlZTblJQUjNKbVNtYxAB",
            "text": "A reviewer a month ago, praise the three tiered tray for Apervo. When my friend and I were there, we got one flat plate of nuts, hummus, olives, and one stale pretzel. A man at the bar next to us got a plate to himself. I remember a better experience and I’ve been sending people to the restaurant for that three tiered plate for some time. I should’ve checked it out for myself. We did ask for a second plate. Perhaps we should’ve gone there last month to preserve memories. perhaps the restaurant used to promise too much"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taamFXNWFUME50VDJGRWNteENWRlJEWXpod1YzYxAB",
            "text": "Love this neighborhood staple."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdWNVUkZXbTFYVDFkd2FsWmFTMjlIV21ad1JsRRAB",
            "text": "started out with a cocktail which was excellent and then a wonderful dinner of mussels.  Our server, Amanda was excellent.  It was just the right amount of attention.  She was extremely professional and friendly.  I will definitely be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTGMwWnpha2d3VTNOT1VGY3hUamRaUVdJM1puYxAB",
            "text": "We loved this place. Went there with friends who consider it their regular neighborhood spot and we now understand why.\nTheir food is delicious:I had potato leek soup and my husband had arugula salad and they were both delicious. Our friends had tuna tartar and loved it. For main course my husband enjoyed his pork shank and the three of us had branzino. Every dish was perfectly prepared with fresh veggies and very tasty herbs. We wILL will be going back there next time we are in NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcE0wNDJWRmRuU1dOR2RDMDJNVWd3ZG5ZNGFWRRAB",
            "text": "The food was delicious and  Daniel our server was fantastic!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYU1HaDVRWEpXTm5KSU5tVmlhMVZoU0hoaWRIYxAB",
            "text": "Been a few times with groups. Lovely service and nice atmosphere - consistently, painfully mediocre food. Really surprising that it remains so successful considering the plethora of better options for similar cuisine. But of course the company and service account for a lot. Just don’t go because you’re craving great Nicoise cuisine - it is not."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTFUyOURZMGR2YkdaTmNuZzJWekpZZDFSdk9VRRAB",
            "text": "A great place to sit, in or out. Food is good and service is excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaE5XZGlTRXRqV1RCUmVVdEdjak5YWkV4M01IYxAB",
            "text": "Ordered a Oktoberfest special for take out, chicken bratwurst, was supposed to come with sauerkraut, roasted potatoes and horseradish mustard. They forgot everything except the sauerkraut, very disappointing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eVUxVkxWRGgzTlZCZlMxWk9UMFZoWjFsaE5XYxAB",
            "text": "Amanda was excellent. She is engaging and gave great recommendations. We truly enjoyed our experience. Thank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBdFRWOUNTbTFKVEhWS01GbHhlRE5hVFU5eFRXYxAB",
            "text": "Exactly what I expected for a bustling French cafe.  Excellent food & service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVlh6RkxjRGR4V2xKWVIwMHRhMEpOZFcxa2IxRRAB",
            "text": "We went with high expectations and they were clearly meet and exceeded, eggplant fabulous, meatballs excellent, steak perfect and the service on point, and knowing they have the best wine cellar we treated ourselves to a bottle of Cheval des Andes 2010 that did not disappoint, will definitely be going back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadFN6RktSazB5Y1ZsVVpWVlFUbmhxZWs5dFJVRRAB",
            "text": "Another lovely dinner at Nice Matin, this time as a party of 7 in their cramped but semi-private corner round table. A by noisy as always but the restaurant was full.\nAmanda took excellent care of us, got all the orders right and was attentive when we needed her without hovering.\nSome of the dishes were a bit more salty than usual - fine for me but our guests noticed and commented."
        },
        {
            "date": "1달 전",
            "language": "lv",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWFVFeFNRVlpNYmtSYU9WQnpNRTlOZWt0d2NFRRAB",
            "text": "Mums, 5 cilvēku ģimenei, ierādīja galdu aiz kases aparātiem un pie wc/virtuves durvīm. 2 cilvēki sēdēja uz krēsliem un 3 cilvēki dīvānā. Sēdēt dīvānā un ēst maltīti bija ļoti neērti. Traucēja arī ļoti dzīvā darbinieku kustība, kāds darbojās pie kases aparātiem, kāds devās uz/no virtuves, kāds devās uz/no wc. Tas viss traucēja izbaudīt mierīgu atmosfēru, kas bija viens no nāciena mērķiem. Viesmīle varēja piedāvāt, citas daudz labākas vietas. Ēdiens bija garšīgs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbFkxOHljMDVJVW1SdWFXazFaVU5wTWpablQwRRAB",
            "text": "Breakfast was fabulous. I am gluten free and when ordering my meal Patricia immediately let me know what I could and could not safely eat. She immediately let me know there was cross-contamination with their potatoes and offered for more of another side instead. The food arrived quickly and my coffee cup was never empty! This restaurant is a hidden gem."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzM3VHak93EAE",
            "text": "예상보다 괜찮은 가격. 양이 있는 음식을 시켜야 적다고 불평하지 않는다. 참치 샐러드. 연어 스크램블 애그, 샌드위치의 경우 양이 괜찮은 편이었다."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0aVp6OHFnRRAB",
            "text": "돈이 아까운 음식점..\n맛은 그저 그렇고..\n서비스는 너무 안좋고...\n계산하는데만 10분 걸렸네요\n접시치우고는 빌지를 안줘요"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVN3ZiOGdBRRAB",
            "text": "조식 할인쿠폰 줘서 갔는데 그냥 그럼"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GYVEyaGFhbXBQWjBWSk5ESnRRbEpvZWs1aFYzYxAB",
            "text": "We celebrated our 32nd wedding anniversary at Nice Matin on a rainy evening, and it couldn’t have been more perfect. From the moment we arrived, the atmosphere was warm and welcoming. Caitlin’s genuine personality and thoughtful service made the evening feel extra special.\n\nThe cocktails were crafted to perfection—balanced, creative, and a perfect start to the night. Each dish was beautifully presented and every bite was delicious, showing both care and artistry in the kitchen.\n\nThank you to the team at Nice Matin for giving us such a memorable celebration. We’ll cherish this evening and look forward to returning soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVFNVSmpNMnBsYm10blpYSkNOVWx5ZFZrM1VXYxAB",
            "text": "Didn't even realize they are part of restaurant week, but the options were great. And the red eye bourbon is a die for. Totally enjoyed all we had. Our server Mikayla was efficient and present."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScmMyRTRaRWgwTnpaUWFGaGhPREJhWlhkQlZrRRAB",
            "text": "We had a perfect experience at Nice Matin this weekend. It was our first time having eaten there and didn't know what to expect. The entire staff was so friendly, but especially our server Gable! You know how when you are kind of extra, and the server internally rolls their eyes and tries not to treat you like you are a bother? This was not the case, and I am kind of extra! The food and multiple beverages were perfect, the service was perfect, and the decor is super fun deco style. I can't leave enough!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeFZGQnJiRFYzUWs1RlJ6QkZha2cwT1RCbmJtYxAB",
            "text": "The family had a pleasant time at this attractive French restaurant. Several of the family members started out by drinking espresso martinis. I was told that they were wonderful. The rest of us started out with the fava bean hummus and the chickpea fries. Both of which were quickly consumed. For our main dishes the family split between having paillard de poulet and steak frites. All I can say is that the chicken folks and the steak contigent were both satiated. Nonetheless, I had to try the apple tart and was not disappointed. We also noticed that Steve Schirripa aka Bobby  \"Bacala\" Baccalieri of the HBO show The Sopranos was in attendance. The staff and service were exemplary. The restaurant also had nice outdoor seating."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPLWN0ZGlxNDVtUU5REAE",
            "text": "Atmosphere upscale yet relaxed. Our server, Fatima, was gracious, helpful and efficient. There is outside seating and I recommend sitting on 79th side rather than Amsterdam. Inside is cozy. Food was delicious and the menu is varied and creative."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMWVGODJXVkJTTVZKaFRuWlFWbkJVWW1wWmFVRRAB",
            "text": "Nice cafe on the Upper west side. Good place for a breakfast.\nCame here on a Sunday morning- service is great, king and prompt.\nThe food was ok - breakfast potatoes were amazing, but eggs Benedict a bit flat, and lacked a punch.\nAtmosphere was great - with “good noise” around, where you can have a conversation, but feel the human hustle and bustle of families and couples enjoying each others company.\nCome here for a lovely and lively breakfast"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaa2J6TkNZWEoxYXpoVFVEZ3hSbFI0TFUxa05uYxAB",
            "text": "What a fantastic experience at this French restaurant on the UWS! It's a go-to spot for those seeking a proper meal around 3 PM, offering a much-needed option when many kitchens are closed. The vibrant, airy, and cozy retro decor sets such a welcoming scene.\nDon't miss their excellent happy hour from 3-5 PM, where a cocktail comes with a complimentary snack – my Americano Spritz was the perfect refreshing choice. My grilled chicken was absolutely delightful: wonderfully juicy, tender, and quite generous in portion size, served with a crisp salad.\nBeyond the delicious food and drinks, the attentive and friendly staff truly elevate the entire dining experience. It's clear why this place is so popular, and I'll definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wd1pXVnpNMjFoTnpsZmFVVnRXV3d6ZFVSTlVtYxAB",
            "text": "This place is lovely. I stayed at the Lucerne Hotel next door and stopped in for dinner on a Monday night. The restaurant was nearly full, has a nice vibe. Sat at the bar and enjoyed a delicious cocktail along with an escargot appetizer and branzino for dinner. So delicious!! Highly recommended!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bk5uaEtiRE5PZFZWNVpuQjROVE5qWkVoRFZVRRAB",
            "text": "While Nice Matin doesn't have a happy hour, per say, ith has Apero.   With regular priced drinks, you get a tower of free appetizers.   The gin and tonic I had was wonderful!  Perfect for a warm day walking around.  Also, they are dog friendly!   The waiters were very nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veExWbDNaVkJUTlRkcGFuQmFTVVp0VFV0MVZFRRAB",
            "text": "Great experience! I’ve walked by so many times and decided to come in to try finally and I’ve had such a pleasant experience. Patricia was attentive and gave us great recommendations. Food was exceptional. Will definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKemJFbzJOMHRXTjBaSmVXb3dWalJxTUZBdGFIYxAB",
            "text": "Beautiful space in a great location. Comfortable and stylish seating. More space than you get in a lot of UWS places.\n\nBreakfast food was perfectly acceptable, maybe a slight step up from what you’d expect from a hotel restaurant, but it didn’t blow me away or anything. Your taste may vary of course.\n\nLess expensive than I’d anticipated."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dVVWUm5URGxsZG5SRlMxcFFXWFJXVWtnM1kxRRAB",
            "text": "It's a beautiful summers day in New York but you're missing some European cafe culture... look no further!\n\nNice Matin has an excellent breakfast and lunch menu- I had the humus with a glass of rose to enjoy the sun. The terrace curves around the corner of the beautiful Hotel Lucerne building it is attached to.\n\nI look forward to returning!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdE5uZDJabnBtVVZsVlIxQjVRVVEwU2xnNVZYYxAB",
            "text": "Nice Matin is a fine French oriented café & restaurant, with a nice selection of appetizers & entrées. The service is very good. The servers Mikayla & Daniel were terrific. And the orange juice is the best anywhere.\n\nToday I had occasion to have another fine meal at Nice Matin -- this time lunch.  I started with the tuna tartare.  The tuna was very fresh and appropriately chopped.  The sauces with which it was infused and paired were well-balanced & zesty.  Two constructive criticisms: the ponzu marinate/infusion could be bolder.  Second, it could use some crunch to it.  For my main course, I had the burger with fries.  I passed on the truffle aioli & had the fries with neither salt and nor seasoning.  An order of \"no seasoning\" seems to flummox even very good restaurants; nevertheless, in this case, the excellent and ebullient server, Gable, got the order correct and it arrived as ordered.  Overall a good burger with good fries.  A meal the inimitable Clark G. himself would have enjoyed greatly."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndnNMSGhRRRAB",
            "text": "Both Tess and Byron were great! Excellent place, food, and drinks!\n\nNice Matin, a French-inspired brasserie on the Upper West Side, has been a neighborhood staple for over two decades, blending the charm of the French Riviera with Manhattan’s vibrant energy. Located at 201 W 79th St, the restaurant’s bright, airy interior—adorned with Niçoise artwork, intricate chandeliers, and colorful accents in yellow, red, and lime green—evokes a sunny, Provençal vibe. The spacious dining room, with its high ceilings and comfortable seating, feels both elegant and relaxed, making it a versatile spot for breakfast, brunch, lunch, or dinner. Outdoor seating along Amsterdam Avenue adds a lively people-watching element, especially during warm months, though some find the indoor ambiance more refined than the sidewalk setup."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVFNuVnBiSFpwWjI1eGJVdGxhRkp6ZGpObldtYxAB",
            "text": "We had breakfast and it was perfect. Our server, Daniel, was fantastic. My sunny side up with crisp bottom eggs were exactly how I love them. Beautiful room. Just a joy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYS13cDJqcU1xTlh3EAE",
            "text": "I magically ended up at this place in between lunchtime and dinnertime which turned out to be happy hour! I had a really wonderful Lillet Rosé Spritz which came with a small plate of free appetizers! I sat at the bar and  Fernando the bartender was wonderful to talk to … highly recommend the whole experience …"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNVJrSkxja0Z2WkRsc1JXZHRhR1V0TUU1blNHYxAB",
            "text": "Great for brunch, lunch or delicious dinner. Pleasant atmosphere, efficient service. Well-executed fare. An excellent option on the UWS."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNVZuUTFZekJOT1U5VlNWQkJiMVkzYkRGVlNuYxAB",
            "text": "I went for the prefix menu for NYC restaurant week. The burrata salad was extremely well balanced with no hint of bitterness from the arugula. The roast pork barely needed a knife as it was so tender. My server Mikayla offered prompt service with a smile while making a solid recommendation for a wine pairing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWb1kxZGZhM0ZTUmxWV1VtbEthRGg2VWtkMlRHYxAB",
            "text": "Came here for a pre-show dinner with my daughter. I thoroughly enjoyed the immediate drop in my cortisol level. Just off the hustle and bustle of 79th, I wasn’t prepared for such an atmospheric change! The dining room is open and airy but not too big- just right for dinner conversation. Our food was delicious (wide variety from which to choose) and I especially enjoyed my drink! But our server, Gable, was the icing on the cake. She set the tone from her first hello and took care of us at every step. A restaurant for travelers and regulars in the know!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdWVHN1hREAE",
            "text": "Our dinner was divine! I could have been in France. We were not rushed. Food was exquisite in presentation and taste!\nTiming in between courses luxurious.\nWe had salad - Verte and endive, the Steak Frites and the pan fried chicken with gnocchi and Swiss chard. Superb!!!!!! I give it a 10+.\nPlus our waitress Fatima was friendly, attentive and informative."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3a2R2UWtnRRAB",
            "text": "Nice Matin is a beautiful restaurant. The avocado omelette was seasoned perfectly, a delicate and delicious flavor. The toast and even the jelly were top notch. My server Amanda, lovely and graceful, went out of her way to answer my questions and deliver me exactly what I requested, even during a busy time. What a breakfast treat!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSllYazNVbDlwVVZGaVZ6QTNlUzFrVFhaSVZYYxAB",
            "text": "One of the best salmons I’ve ever had, but hands down the worst burrata. Unfortunately, I paid for it — no one asked if I liked it. The bartender seemed too busy, basically just threw the burrata at me and asked if I was done. The plate was full — I had only taken one bite. Cool place, but bad service. Skip the burrata, especially if you’re Italian or know what real burrata is supposed to taste like."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQV1d3TEtmbmVLd2ZnEAE",
            "text": "What a great experience! Got dinner and cocktails on the patio and Amanda gave exceptional service. Her recommendations and menu knowledge were on point. The tuna tartare was delish!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeWRrZFJRbEJVYWtsa1NrZDBVblJCVlhCcWFXYxAB",
            "text": "Absolutely perfect. Beautiful environment and decor combined with excellent food and service. We particularly appreciated the soft lighting and acoustics that were so conducive to relaxing conversation. Service was an unusual combination of friendly and helpful yet discreet. Definitely going back and if I lived here I’d be a regular."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdE5FZEtNVlppWVcxaFYwVktlRjkzYVVoU1NHYxAB",
            "text": "Great recommendations from our server at Nice Matin. Drinks and food were excellent. Loved the arugula salad, escargot, and sole."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taa1puUTNVV0pMWDFwMmQycG9hbTlCWmpGQk9VRRAB",
            "text": "Three of us had a very nice meal at this comfortable, relaxed restaurant with sort of an art deco styling. The menu is more of French Bistro style rather than continental cuisine. I had steak frites, a delicious New York strip with bernaise sauce on the side.  My companions both loved their duck confit. The chocolate soufflé for dessert was split among us (we were satiated!) and it was especially delicious and only $14.  It would be a delicious dessert for one or two people.\nThe wine list is extensive. I found a reasonably priced French red wine from Cahors that was absolutely delicious and served at perfect seller temperature.  Sommelier was very helpful. The wait staff (Amanda) was attentive yet laid back.   I really liked this place!  The entrées were  $30- $35, and my steak about $42– not a cheap meal, but worth it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMFVWWTJTVEJPVmtreGIxY3dTM0JNVVZWMWVYYxAB",
            "text": "Nice Matin consistently provides delicious French fare in a cozy atmosphere. Our server Amanda is delightful - making sure we have all we need without being overbearing. Nice Matin is one of our absolute favorites on the Upper West Side!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKdWhnTGV6c0xmLWt3RRAB",
            "text": "My cousin and I treated our dads to a father’s dinner here at Nice Matin, per my dad’s request and we had an amazing time. We were warmly welcomed in by the host (not sure of her name but she was extremely helpful, she had a blonde ponytail) and then were guided to our table to meet with our server Caitlyn. Caitlyn was very kind and gave really good wine recommendations as I was looking for something on the sweeter side. The whole family decided to have the truffle burger, we all added bacon and they were delicious. My burger was medium well but i did find the ends were a little charred, no biggie I still enjoyed. We all agreed that we would return. The dads loved the celebratory crème brûlée."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRc2JUNXlnRRAB",
            "text": "My friend and I spontaneously , miraculously, got tickets for Joy Behar’s show. It was fantastic! Our stay at the hotel was lovely and we ate our departure meal at Nice Matin outside our hotel. The food was great . However our time was uniquely enhanced by our lovely, helpful, funny, exemplary waitress Stephanie!! That lady is a dynamo !!! She can multitask like we have rarely seen;  helping her customers, engaging them and helping other servers when asked ! Stephanie was a gift to us and is a treasure to Nice Matin !!\nWe definitely plan to see her again!! Jill and Pattie"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SYVpuUkpWREpST0RKT01IVjRVR2RUVkRkQmFuYxAB",
            "text": "Beautiful place. The outdoor seating is super nice. Mikayla provided us with a n exceptional service. 100% recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeWRWUlhWWFk0YVU1ZlZ6bDVWREI2WDFad1dWRRAB",
            "text": "Highly recommend Nice Matin; probably our favorite restaurant in New York City.  On Friday, June 27, 2025, we had a delicious dinner with very fresh ingredients - one of us ordered the seafood spaghetti and one of us ordered the braised chicken.  For dessert, we talked with our server, Vanessa, and she recommended the cheese.  She was right - the cheese plate was perfect blend of flavors and fresh fruit (apple and pear slices), walnuts, honey, small toasted bread rounds, and a nutty cheese.\nI ordered the basil lemonade, with dinner and it was STELLAR!\nBreakfast here is also excellent; my favorite choices are the Berry Bowl, the Grapefruit Slices, and the Homemade Granola.\nI highly recommend this restaurant for quality food with amazing flavors, excellent customer service, and a nice atmosphere."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeXV2MGNnEAE",
            "text": "i came by for dinner today - my reservation was at 7 but they were able to seat me a few minutes early.\n\nattentive service even though I was eating alone. fresh bread (it came with butter AND olive oil, very cute and went well with the Provençal theme) and good food! definitely a welcome little taste of France.\n\nthank you! nothing but the best to say."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbVNEUXhPQzFoT0VaYWNXZFRZa3RXVG0xaWQxRRAB",
            "text": "Another superb meal at Nice Matin! For eight years, this has been our go-to for deftly prepared food that’s inventive but not fussy and always very good.  A neighborhood place for a special occasion, a little romance, or dinner with your mom and a friend. Service is impeccable and personable, and Caitlin, our server, made it seem effortless. Nice Matin never disappoints!"
        }
    ],
    "reviews_count": 86
}