{
    "name": "Pappardella",
    "place_id": "ChIJN2DMVolYwokRZ3RY3IbatuA",
    "grid": "MN7",
    "address": "316 Columbus Ave, New York, NY 10023, USA",
    "rating": 4.2,
    "user_ratings_total": 1530,
    "phone_number": "(212) 595-7996",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRVluRm5SV3c1YlU0MGNHdHZVMmw2VTFWcWNrRRAB",
            "text": "Highly recommended, with an excellent and abundant selection of gluten-free options!"
        },
        {
            "date": "4일 전",
            "language": "sv",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSWExZGxWMDA1UlMxelRpMHhYMU5SWWxRd1VHYxAB",
            "text": "Trevlig klassisk italienare. Underbar mat, lugn avslappnad miljö och bra service."
        },
        {
            "date": "4일 전",
            "language": "it",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUloyZFFNMVUwYjFSQlZFTnhhRlZJYmpaU2EzYxAB",
            "text": "Cibo nella norma, servizio celere, la ragazza è stata di parola, e ci ha tenuto il tavolo....locale caratteristico."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMk9VTnpSRE5FTkdkRlpVMHRVVzVQYjBaaVlXYxAB",
            "text": "The food is outstanding. I had pappardele buttera and recommend it. My friend had spaghetti with meatballs and they loved it. The service (usually good) was mixed. The busser was excellent, fast and friendly. The server was having a bad day, though. Unfriendly, only came to check on us after we flagged him down from across the room to get a drink that had been ordered twice."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVVVWcEpjRjh0VmxwelUxbHNRemhuZWpKS2RFRRAB",
            "text": "Nasty hostess with a bad attitude isn’t how you want to start.  Her service was a zero or my service rating would be higher.\nNot a good way to start but got past that.\n\nFood was great.  Our server Lena was excellent bringing service up to a 3 from a 1*.\nFood was delicious and very reasonably priced.  Lena recommended the lasagna and it was really good.\n\nCocktails and alcohol a bit expensive ($22 for cocktail & $18 for a glass of house wine) so with each person having a cocktail and a glass of wine and sharing just 1 appetizer for the table and no dessert or coffee it was $100 per person.  It’s NYC so not so bad.\n\nWe will be back and hopefully won’t see that hostess."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Mk1Xc3laREZXVjJOblR5MUdSbXBrYjNGTFlWRRAB",
            "text": "Excellent lunch. Attentive staff"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZdFZFdGxOMngwT0VGb2JqQTJiMEZ0UWxGRWVVRRAB",
            "text": "I had an incredible dining experience at Pappardella! From the moment I walked in, the atmosphere felt warm and authentic — cozy lighting, friendly staff, and that classic Italian charm."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R1ZFUlZWV3RxZVZwc1UySlZPRnByTFdWeE1HYxAB",
            "text": "My favorite place to go prior to a beacon show. The dirty martini is a standout and all of the pastas are amazing. Staff is always fantastic."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUk5HbEZTemRFVEVodFFtNVhkMmczZEZjM2FtYxAB",
            "text": "Since I moved from Vienna /Austria to New York a few years ago -  Pappardella is one of my favorite Italian Restaurants in New York. Great Food, nice ambience and a very friendly staff. Marion, the manager and hostess is caring, welcoming, and very professionell.\nAfter trying all the delicious dishes. My preferred pasta dish is ‚Pappardelle Buttera.‘ A real delight. I am happy to recommend this Restaurant."
        },
        {
            "date": "3주 전",
            "language": "it",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNelZrUnNVWFZFVmtOdFZFTTRMVWhDWjNaMVpFRRAB",
            "text": "Da italiano non posso accettare che mi venga servita una pinza e venduta come pizza , capisco l’adattarsi al posto ma se vi vendete come ristorante italiano dovete almeno rispettare l’idea. La pasta e fagioli presa come fuori menù era più un minestrone che altro , patate al forno buone , e pure buono , prezzi in linea con New York , i camerieri cordiali e veloci , un po’ troppo freddo in sala."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWE0xSkZWVkF0VTB4YVRWcG1RVkZPWkVKbmFYYxAB",
            "text": "Very nice place, friendly people, pleasant atmosphere and very tasty food. Fast delivery so it's a pleasant experience. Highly recommended."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTmRHTjNMVkUzTUhZNU1tOXJUM1puZUUxeGRWRRAB",
            "text": "We were served and ate within half an hour so if you’re looking for convenience and a more fancy Italian experience, this is a decent place.\n\nBut for the price, you can get better pasta. It was by no means bad, but have had much better for the same price and while I always appreciate free bread, the bread had clearly been out for a bit.\n\nYou could do worse and you could also do better."
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQ1IwcGllalJDWTNodlMybE5PRE5TWHpKYU1XYxAB",
            "text": "Personalmente no me gustó . No es un lugar malo es solo mi opinión."
        },
        {
            "date": "1달 전",
            "language": "iw",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNVdEZFFPVTFLWm5CRlgzWlNhblExZEd0VVMwRRAB",
            "text": "האוכל טעים, אווירה ניויורקית,\nלוקח זמן עד הגשת/קבלת ההזמנה."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRN3JMQ3VRRRAB",
            "text": "Wonderful food, great service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMUxUQkdUVGt0U1hwR05saEVhSGN3V1RGTk9GRRAB",
            "text": "Take out"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VM1RuUjRSVUpDV1hkZk4wNHphWGRrYlZOMU5HYxAB",
            "text": "Pesto gnocchi was delicious , good sized portions too"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeWJqVm5OV3BzY3pSSFNsUnpla04yYlVkcFFWRRAB",
            "text": "Pedimos el carpaccio, los raviolis de langosta y orechietti con pesto y brócoli, de postre los canollis y el tiramisú. Estaba todo espectacular. La pasta increíble y las salsas también, los postres caseros una delicia y el ambiente…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oZldEaEdMUzFEY0VVeWJ6QmtjbHBWVFVoRGMxRRAB",
            "text": "Great little upper west side place. I went here on the weekend and a farmers market was blocking off the street. Was able to find a table right away, went here because the Dakota wasn't open yet and was pleasantly surprised. Had drinks outside and it was great. Wines by the glass room amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwelVVMUtNbWd3TUMxU2VqUkVPV3BVYjBFdFgyYxAB",
            "text": "Nice restaurant,  the menu offers authentic Italian dishes,  it's freshly prepared and tasty. Portions could be a little more generous."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZOW9PNFNnEAE",
            "text": "Fantastic Italian restaurant. Excellent food, their marinara sauce is the best. Staff is so friendly and helpful. Only drawback is low ceiling, so when crowded, it's a bit hard to hear your conversation. Highly recommend this place, best Italian on the UWS 👍"
        },
        {
            "date": "1달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQ01qTTRUVEZ3ZURoVmEwaFJWV0ZPVUZBMldWRRAB",
            "text": "Prawdziwa włoska uczta! Sympatyczna obsługa, lazania jak we Florencji – delikatna i aromatyczna, rozpływa się w ustach. Do tego kieliszek dobrego wina i można poczuć się jak w małej trattorii w sercu Toskanii. A jeszcze lepiej smakuje tutaj, w Nowym Jorku! Gorąco polecam!"
        },
        {
            "date": "1달 전",
            "language": "no",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKYVJXUjRjRlJ2YTJKeGJuUm1jMmhOYkZwd1ZFRRAB",
            "text": "Et veldig tradisjonelt italiensk restaurant, med veldig god mat. Hyggelig betjening."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabUt2OWhRRRAB",
            "text": "This was an amazing experience. I have had a hard time finding a good carbonara in America and this place positively surprised me. The dry white wine the waiter indicated was a perfect combination with the pasta."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psR2VYSlZYMjVmVVVoRlVrMTBZbFkxVW5oaVVGRRAB",
            "text": "Some of the best pizza I’ve ever had. The taste and portion size were perfect. And the service is amazing as well. The prices are pretty fair and I’d say it’s worth it. Definitely recommend you go here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaa2RtZEdkMUF6YlRoUVN6TTRVMWR5UVhCU1pHYxAB",
            "text": "Looking for a great meal before your show at the Beacon Theatre?  This restaurant is for you!  We made a reservation through OpenTable with no problem and they had it waiting for us. Side salads as appetizers house vinaigrette was quite good but the Caesar was also elevated. Salmon was ordered medium rare and came out perfect. The sauce on the Bolognese was outstanding. Tiramisu was very light - and very good. Service was on point even though we sat outside. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oT1RtMHlRMEZ2TkhOaU5qSllUSGhQUVdaNE1uYxAB",
            "text": "I've had a wonderful experience at Pappardelle Restaurant. They were able to tend to our diet preferences and were flexible. They made us feel welcomed and relaxed. We also saw the couple next to us got their salad split and we thought it was really cute. 10/10 experience, thank you!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRk0wTmpaVmt0VFRkSmFscGhVWFpxUTI5RGJXYxAB",
            "text": "Cute spot. Very cozy. Terrific service and delicious food!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMlpVMDNlRUZyY1RVdFpqSk9TVW8zY0VkWVExRRAB",
            "text": "Pasta, garlic bread and chicken parm sandwich is really good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTVRXYzJUVEZzTUc5eWVtOVRUR1oxUVhSd0xYYxAB",
            "text": "The corn pasta changed my life. Tears in my eyes writing this….."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNGVEQlNheTEyVUhCT1VHUlhZMHhtWjFwRVZYYxAB",
            "text": "**this issue was mediated and an updated review has been posted!!**\n\nThe food was great — I got the bolognese and my friend got the lasagna and we started off the dinner with the meatball appetizer. The food was great, the issue was the service. It was extremely unprofessional. I waited about 20 minutes to get serviced, meanwhile the table right next to me was getting serviced even though I had gotten there a good 10 minutes before they did. By the time I was offered a drink by the waitress, who didn’t introduce themselves or greet me and only asked “did you want something to drink?”, the couple next to me had already been receiving their appetizers. When the other half of my party arrived, a different waiter took over and only addressed the person I was with and didn’t speak to me directly. It felt disrespectful to say the least. We weren’t properly checked up on over the course of our meal, and it’s difficult when you’re seeing the people next to you be treated with a different level of service and care. To top it off, I was excited about the dessert and it was a main reason for me coming tonight. When we were looking through the menu, a different waitress came by and rushed us to choose with an attitude. We decided we had enough, and asked for the check. It was my first time at this establishment, and I’ve never been treated this way at any restaurant before. I had high hopes due to the reviews and me being a foodie, extremely disappointing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SU2RHRkdTMkZ2VGpGS1l6UkxjMUpVV0VrMExXYxAB",
            "text": "Classic old school Italian that can not be replicated, see the owner sit and enjoy his cigarettes outside, you can tell the only thing that has pushed this restaurant is his love and passion, nothing else. This is true New York italian experience, and an institution."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pObFh6TTBWa2xyYUZJMlIzWjRRMHBOY1hWdk5FRRAB",
            "text": "Great eggplant parm and chicken parm.  Zabaglione for desert was refreshing and light. Overall a great experience which will definitely be repeated!  The only suggestion would be to update the ambiance music to some selections that don’t include over-played Sinatra.  Other than that everything was great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTU0xTkthMFJqWkRSUlRFUkVibTFRVEc5VFlrRRAB",
            "text": "The pappardella pasta with fungi wad amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aVVYaDBZa2R5Ym13elMzcHROMDFCWDNaNmExRRAB",
            "text": "This place is great. Consistently great food and service, I figured it was time to say so officially."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMWNrSmFPSFJFU1RGRU1FbGhhakZSZFV0cGNrRRAB",
            "text": "The most delicious italian food in the city! Not only is the food to die for, but the staff is so sweet! If anyone is considering coming here, I definitely recommend that you do."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbE0yeDZhbFJZY25aSVgyOHdNak5QZGpSS2VtYxAB",
            "text": "Good food good experience should definitely give it a try"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VU1VNUVUVFpxZWpWQ1IybElRbFpxZERWMmRYYxAB",
            "text": "Excellent food and service! I will go back for sure when in NY."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21reE5FcHJWRUo1ZW05NFRsSnVka1kzYTJKYVJHYxAB",
            "text": "Just a short walk from the museum, Pappardella is a charming Italian spot with both indoor and outdoor seating. The space is warm and inviting, but what truly made our visit special was the hostess. She was incredibly kind and attentive, even when my little nephew became cranky - She brought over crayons to help keep him entertained — a small gesture that made a big difference.\n\nWe split a Margherita Pizza as an appetizer. it was a delicious start to the meal, light and flavorful.\nFor the main course we ordered two dishes that we split between 3 people; Pappardelle Buttera – Rich and comforting with sweet and spicy sausage, sweet green peas, and a sage-infused vodka sauce. And the Gnocchi Pomodoro o Pesto – served with basil pesto sauce green beans.\n\nBoth desserts we ordered were excellent! The Torta di Cioccolato – A warm, flourless chocolate cake served with hazelnut gelato and caramel sauce. And my favorite, the Tiramisu della Casa – Classic and well-executed, with layers of espresso-soaked ladyfingers and airy mascarpone. Not overly sweet, just right.\n\nThe food was fresh and full of flavor, and the service was thoughtful and warm. Whether you're with family or just looking for a quiet corner to enjoy good Italian food, Pappardella is worth the stop."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMWJFeHVRamhpZWsxR01HTmFjR0ZrYkd4TFNrRRAB",
            "text": "The Ricotta di Bufalla was incredible and is a must order. One of the most delicious things I've ever tasted. The white truffle honey makes it perfect."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMlZVY3dTVEZhWTBjMk1HSjVUVTVsU0ZaS2RuYxAB",
            "text": "Honestly can’t believe this place is packed with reservations. The pizza was beyond greasy, and honestly not that great. The fettuccine Alfredo was mid. Noodles are good and soft, but the Alfredo was a total disappointment. Not much flavor at all. Very bland. Overall, a nice staff, but horrible food for the price."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNFNWbFpTVlZqT1hsdWIwaFNia1prTWpKQ09HYxAB",
            "text": "Great italian classics with a good selection of rotating specials.  The atmosphere is delightful both inside and out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxV2RHUkZiblY2TFdkMlUzUm1lbEU1WWxCbVRGRRAB",
            "text": "The pappardelle tartufo were heavenly, the pizza was very nice, the salad was too sad (specially considering it’s price). I’d go over and over again and only order pasta❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ka1VVZFJSMHhUU1dkak5rVTVWM0JETFZWVlNYYxAB",
            "text": "Pappardella was exactly the right place to be on Saturday for a late leisurely lunch.  Every thing we ordered was delicious and reasonably priced for this neighborhood and great location.  We ordered the margherita pizza, pappardelle funghi e tartufo, orecchiette baresi, insalata cesare, spaghetti polpette, flourless chocolate cake and tiramisu.   Great wine selection, too.\n\nOn top of all that goodness, service was gracious from start to finish:\n1)We were a party of 5, 1 local and 4 out of towners.   We arrived with only 4 out of 5 of our party, one of whom was running very late but we were seated at our table anyways.  Not every NYC restaurant will do this, btw, so this was very appreciated.\n2)We lingered over the three courses of our meal for several hours.  There was no move, overt or subtle, to try to shoo us away.    The staff truly understand “La dolce vita” in the pace of the meal\n3)Friendliness of our server and maitre’d -  just delightful, kind, and welcoming people, who are very knowledgeable about the menu, and helpful with suggestions"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMlZrYzFVRWxTVDNGSlVtNUNPRUZJZVZnM2VuYxAB",
            "text": "Brushectta was not crispy wich make the bread soggy the tomatoes was a little tired\nPizza crust was not flavored and the middle was also soggy\nPerpaddella mushroom pasta was good my gf think it was amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMGMzazJXWEptYkU4dFdWazNORmR0WHpabE1GRRAB",
            "text": "Except a lot of noise from small children, this was a uniqe experience in a busy City.\nThe pizza is some of the best I have ever tasted, and the prize makes it payable and affordable by almost everyone. And the pasta too was good - but could have been more taste to it. But in total, I surely recommend this place!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcmFsSTRjMDR4V2pGV1RITnBVa2g1WjFwT1ZFRRAB",
            "text": "Enjoyed the endless amount of gluten free options for me and my mom while the other table enjoyed their non gluten free options and had a blast! Service is always incredible- have been back multiple times."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUWFGaHlNVlV0YkVnNWNESnhVWEkwWVZWRFlsRRAB",
            "text": "Terrible customer service. Rally waiter with black long greasy hair was fairly rude to the group in front of me, and then proceeded to ignore me for 10 mins as I was stood by the entrance. No hello, no how are you, no will be with you shortly, just ignored me. Kept coming to the door and moving past me. I cancelled my reservation on the spot and left. People with no reservations were getting better service. Frankly the place looks old, overrated and nothing like a proper Italian place, and I’d know given I lived and live in and  next to the border of Italy"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214blNteGFVWEEzU0RCQ2JGUldUR0pqZDNORVRrRRAB",
            "text": "Great service and very good local italian food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMlNrNXdWVEJtV1hBeWNVZHNVRUoyVUVoWmVrRRAB",
            "text": "My favourite restaurant in NYC, period. Have been here more times than I care to remember, and have loved each visit more than the last. The food is top notch, at a great price, and Ed and the team are phenomenal professionally, but also simply great people. As a recent New Yorker, they have made me feel at home here, and for that, I’m very grateful. I look forward to making many more wonderful memories at this special place :)"
        },
        {
            "date": "6달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ3ZQVUlREAE",
            "text": "음식이 맛있는 레스토랑~\n가성비도 좋지만 맛이 일품!\n분위기는 활기 넘치는 가족적 분위기^^\n동네 맛집이지만 관광객들께도 추천!\n다만 사람들이 항상 많기 때문에 음식을 먹기까지 대기하는 시간이 긴 편이라는 것은  참조!(맛보면 긴 시간 기다린 것도 보상됨 ㅎ)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdmUta2dnRRAB",
            "text": "We visited for the first time and had a great experience. Since we had our furry friend with us, we opted to sit outside, which was a pleasant choice. The inside had a cozy ambiance with a charming old-fashioned vibe, making it feel warm and inviting. We ordered the veal cutlet, which was incredibly tasty—perfectly marinated and full of flavor. Whether you're looking for a relaxed outdoor dining experience or a cozy indoor atmosphere, this spot is definitely worth checking out!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN2UzN3BRRRAB",
            "text": "I visited Pappardelle restaurant to celebrate my daughter's birthday, and we had a truly delightful experience. The restaurant has a charming ambiance, with tasteful decor that exudes warmth and elegance, making it a perfect spot for special occasions. Although it’s a small establishment, it is exceptionally well-organized and comfortable, allowing for a cozy dining experience.\n\nThe service was outstanding; we arrived 30 minutes early for our reservation, and to our pleasant surprise, we were seated immediately without any hassle. Our waitress was not only friendly but also knowledgeable about the menu, providing excellent recommendations that enhanced our meal.\n\nThe food was a highlight of the evening—each dish was beautifully presented and bursting with flavor. We particularly enjoyed the homemade pasta and the rich sauces that accompanied our entrees.\n\nOverall, I would definitely return to Pappardelle restaurant for future celebrations or simply to enjoy a great meal. I highly recommend it to anyone searching for a wonderful dining experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNemMyczFSMlpOYlcxRFZFaHlXbWg2T0dGalpIYxAB",
            "text": "We arrived around 12:30 PM on a Monday without a reservation and were seated right away. Service was pleasant—attentive without being overly friendly. We started with the Caprino salad, which was absolutely delicious, and the appetizer bread was a nice touch. For our entree, we shared the malfaldine bolognese—the sauce was rich and flavorful. Splitting both the salad and the pasta made for the perfect lunch. Overall, a satisfying meal in a relaxed setting."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfODUzM25nRRAB",
            "text": "The atmosphere is homey and very cozy. The food was good, but the garlic bread we got was not to my liking. The garlic flavor was very mild and the bread was cold, so it would not be an appetizer that we would recommend! I liked my pasta, I got the vegan pasta with mushrooms, it was sensational and I highly recommend it!"
        },
        {
            "date": "10달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdl9MU21nRRAB",
            "text": "Siamo andati qui per una festa di compleanno, e sono davvero felice che abbiamo scelto questo posto spettacolare! La mia ragazza (che è diventato una ventunenne questa notte magica) era così incantata dal cibo, dall’atmosfera, e dai bagni qui. DEVI MANGIARE QUI. IMMEDIATAMENTE. TI ASPETTERÒ LI. INFATTI, STO LI ADESSO. VAI. VAI. VAI."
        },
        {
            "date": "3달 전",
            "language": "no",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUFdqTllObk5PYWpsRE1ucEhWak01VVVGc2JtYxAB",
            "text": "Fikk den beste pepperoni pizzaen jeg noen har smakt, helt fantastisk god. Bare synd den ikke var større 😎 resten av gruppa bestilte forskjellige pasta retter. De var også gode på smak. Så veldig bra rett og slett, det eneste som manglet var at Jerry Seinfeld ikke dukket opp. Han spiser her av og til sies det."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dDhicWd3RRAB",
            "text": "Magnífica experiencia! Todo lo que pedimos estaba riquísimo, los platos excelentemente elaborados y sabores bien definidos. La sangría estaba súper rica y muy recomendable pedirla. Como curiosidad, hacen sangría con vino blanco pero nosotros pedimos de vino tinto. El servicio muy amable y súper rápido. Sin duda, un restaurante que merece la pena para disfrutar de rica comida italiana!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeW9ySGNBEAE",
            "text": "I had a lovely evening here, the staff was very attentive and friendly. I ordered from their gluten free menu and everything was delicious. I had the garlic bread, the veal with marsala sauce and mushrooms, and sorbetto (Lemon, Raspberry and Mango) for dessert. The portions were very generous and they happily packaged the rest to take home. The mango sorbetto in particular was the perfect way to end a rich and perfectly balanced meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacmQ2RXd3RRAB",
            "text": "We have eaten many times at Pappardella on the Upper West Side over the years for both lunch and dinner. This is an outstanding neighborhood Italian restaurant. The food and service have always been great, and we love the rustic feel of this establishment. Pappardella's sauce is the highlight of their amazing menu. We highly recommend it here!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMbWhrZFc5bTZ5VTV3RRAB",
            "text": "The food was good. I would recommend. I got the insalata mista (mixed greens) with dressing on the side. They gave me a very generous amount of greens. The dressing was a basalmic on the side; their house dressing. It was opaque so it wasn't just oil/vinegar and spices. It had a distinct flavor. A little went a long way.\nI also had pasta bolognese. It was ok. I've tried many bolognese sauces- this one didn't have a lot of meat. It needed more meat for the protein and to live up to the true definition of pasta bolognese. But it didn't taste bad. Unfortunately, for me, I think I would only get it again if  i wasn't in the mood for the other dishes.\nThis restaurant has been around for a very long time... at least 20 years... so just because i didn't like the food i tried doesn't mean you wouldn't. It's also convenient because it is near the Natural History Museum and the New York Historical Society Museum.\nThe staff were polite and it was clean and pretty inside. It was like a little vacation from NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEc3VXdGJREAE",
            "text": "The mozzarella caprese was delicious 😋 but thanks in large part to the sweet and sour balsamic reduction, which also went very well with the bread! 5⭐\n\nThe linguine vongole was also good -- especially the clams and the sauce -- but I probably would have liked less from pasta. So overall 4⭐.\n\nNevertheless I will go with 5⭐ for food.\n\nA 2pm lunch on a Saturday when it was raining cats and dogs outside. It felt cozy, inducing feelings of comfort and safety, sheltering from the incessant torrents."
        },
        {
            "date": "수정일: 3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKMkFzTGlzbTREd1VREAE",
            "text": "Todo perfecto\nHaces de cuenta que estas en Italia\nLos platos muy muy buenos.\nY la atención excelente.\nY el lemonchello que hacen es excelente."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGV2MxaFVWM0ZzUTA0eWNrY3daWHBtZUZwaGEzYxAB",
            "text": "Unfortunately, the service at this restaurant was very disappointing. Our assigned waiter was rude, especially when we asked for water — not once, but twice. I eventually had to get up and go to the bar myself to request water for my children, which is unacceptable. I also had to ask for bread two separate times before it was brought to the table.\n\nWhile the menu was appealing and the food was of good quality and flavor, the poor service overshadowed the experience. I hope management addresses this, as no guest should have to chase down basic service like water and bread."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOaG8yMmhnRRAB",
            "text": "Wow wow wow\n\nCame here for Christmas Eve and everything was superb. From the appetizers, to the entrees, to the cocktail and wine, and the service!  All meals were fantastic but the rack of the lamb and flatbread stole the show.  I wish we saved room to try their desserts.\n\nThis is a must try in the UWS!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cWNUWkpBEAE",
            "text": "I came here post a Central Park wedding and let me say I was not dissatisfied nor disappointed.  The appetizers were spot on and of various types to snack upon. The sangria was a refreshing light white variety that cooled down a warm setting. The sea bass special was paired with a crisp Chardonnay that complimented the entire meal. The manager came out to bring a champagne cocktail special along with a lovely dessert. The grappa paired with a double espresso was a lovely ending to a great dinner. The staff here went above and beyond to accommodate a special celebration…the manager was an absolute gentleman! Well worth more than five stars allotted!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdk5IazJWMFZQUkU0MmVGRjBPQzAyVTNwbGVGRRAB",
            "text": "If you like good quality Italian food at a reasonable price, this is the place. We had a great experience and the staff were superb. The espresso martinis are also very good. Thanks Ed and team for a great meal, I’ll definitely be back when I’m next in town."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKLTRfS0RnEAE",
            "text": "WOW. A totally wonderful Italian restaurant in the UWS.  Walking into Pappardella, was like stepping into an old Italian establishment in “The Old Country”. Relaxed ambiance, good old-world feeling.  A great professional service and amazing food.\n\nEverything I had from the pasta to the Lamb chops was perfect.  Totally loved that place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M19UTVB3EAE",
            "text": "The food was pretty good!\nWe ordered pizzas (heads up they are flat breads and the waiter made sure we knew) also fried burrata and many other things, everything was delicious.\nNo on the cheaper side, but great for a date night!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwai1XYmp3RRAB",
            "text": "Amazing Italian restaurant in the Upper West Side!  The staff is so warm and accommodating, from start to finish.  The caipirinha cocktail was perfect, and I have to say,  the Chicken Parmigiana was probably the best I have had in my life - and I have had that dish many, many times in restaurants all over the US.  This is my new favorite Italian place in NYC!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dFpuMC1nRRAB",
            "text": "@pappardellanyc is an institution! Everything we ordered tasted homemade and super fresh. The owner will treat you like family and the restaurant is super romantic. Perfect spot for dinner after a day at the @natural_history_museum or @centralparknyc. I couldn’t stop raving about the pappardelle funghi e tartufo and the Pappardella Paloma Cocktail. Insta: @thehungrysw\n\n🌀Pappardella’s giant meat ball\n🌀Pan fried buratta\n🌀Pappardelle funghi e tartufo\n🌀Vitello al parmigiana\n🌀Bistecca di manzo"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eXNLcVFBEAE",
            "text": "Had a very nice dinner here.  Service and ambience is very nice.  Dining inside is comfortable and cozy.  Food was good.  Traditional Italian.  Chicken Parm was well made with a nice sauce and Frutti  De mare was excellent and packed with lobster, clams, mussels, and squid on top of fresh pasta.  Topped off with a nice glass of red, it was a nice evening."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbk16SkVUbWs0WjB4UFVYcHRZM2hmWkVWU2RsRRAB",
            "text": "This restaurant needs more staff especially for the rush hour. One waitress for the whole restaurant is not acceptable. From the beginning of the service, we got seated right away but was forgotten for fifteen minutes. The point were they attended three tables after us and had to wait an hour for our food to arrive. The food was great but then to wait thirty minutes for them to attend our check was not acceptable. For the future, please have more staff and have a better system of attending parties to the time they arrived."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeGF5bVBnEAE",
            "text": "Absolutely wonderful Italian food. I was so happy to have Italian food after a long time. I don't frequent Italian restaurants a lot because I have to eat gluten free pasta, but they had it! I was very pleased. My dish was fabulous and my…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ob2FXMHRRMU5wT1VRNVltMTNkMFU0VXpaTlFsRRAB",
            "text": "Kind, attentive service, three different people checking in on us. Lovely table setting, excellent food, very Italian. Didn't bat an eye when we ordered less than full meals."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbVAtRlZBEAE",
            "text": "Had an omelet off of their brunch menu and Italian sausage on the side and it was amazing!!! Chicken parm was awesome- and they have a gluten free menu!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN05PN2JnEAE",
            "text": "The food was delicious!  I ordered the short rib special..it was otherworldly & a generous portion..food went home!  I ordered their House cocktail and it was yummy!  Service was great, the prices reasonable, & the atmosphere was lovely."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcGRmMlNBEAE",
            "text": "Great Italian Food!\nFood was amazing and excellent service, the restaurant has a great ambiance.\n\nWe had Calamari was delicious, Tiramisu was outstanding, they are Vegan friendly.\n\nHighly recommended to anybody who visits New York."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SFRWWmFhMnR0TWxkbVFqRlpZVVl6ZFhabU4xRRAB",
            "text": "Pappardella is everything you could want in an Italian dining experience and is one of those places we just keep coming back to. The atmosphere is warm and inviting, the food is delicious and always fresh and flavorful, and the service makes you feel right at home. Their tiramisu is my favorite - the best way to finish a good Italian meal!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaVpLOFdREAE",
            "text": "Noticed this place on several occasions and had always wanted to try. Made a reservation for 12:30 on a Saturday with OpenTable without issue. Arrived ~5 minutes early and was seated both friendly and promptly.\n\nShortly after seating we were asked for our beverage choices and all filled within minutes. Table bread also was promptly delivered but not expected which went well with the olive oil of which was accented by rosemary.\n\nPortion sizes were tasty and plentiful. For us, we chose the Funghi Pizza, which had a dash of truffle oil and assorted mushrooms, fluffy crust similar to a flatbread.  The Pollo al Parmagiano was also served with a nice portion of spaghetti. The chicken was lightly breaded (nice!) and the pasta was slightly firm with a nice tomato sauce.\n\nWe enjoyed our experience from the service to the noise level and the inside ambiance of an older building tastefully decorated with paintings and picture of Italy but not in a kitschy kind of way.\n\n5-7 minute walk of the American Natural History Museum and worth a visit."
        }
    ],
    "reviews_count": 80
}