{
    "name": "Parm Upper West Side",
    "place_id": "ChIJOcB1BotYwokRDAfplGJHyTM",
    "grid": "MN7",
    "address": "235 Columbus Ave, New York, NY 10023, USA",
    "rating": 4.2,
    "user_ratings_total": 1674,
    "phone_number": "(212) 776-4921",
    "reviews": [
        {
            "date": "수정일: 14시간 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWGIzUnNaRlJXVEU5V2JuaE5Wekp3U1VrMFRVRRAB",
            "text": "I love Parm. I’ve been coming to the UWS location ever since it opened and have been countless times, but my most recent visit left such a sour taste in my mouth.\n\nThe food is great, the service is (usually) so nice and I like the atmosphere, but at my most recent visit, my friends and I did not receive good service. Our waitress was just so rude all night and kept ignoring our table. It was my friend’s birthday dinner, and there were a few other birthdays happening that night and all the employees would put on party hats and sing for the person. We asked our waitress if we can have that done for our birthday girl as we had cake & candles, and she said no and didn’t give us a reason which was just so awkward for us. Her and the other employees kept huddling together and hanging out and ignoring customers on a very busy friday night. I never had complaints over the many times I’ve been here but this night was so disappointing 😭"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNFNXeFRVV0o2UW5GTGREQm9hbVJrUVRZd2JWRRAB",
            "text": "Had a reservation for 3 on Saturday night. Host repeatedly told us it would only be a 5 minute wait because they were \"cleaning off our table\" After waiting for over an hour for our table, we left and decided our time would be better spent at a restaurant that actually valued their customers."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkblJsZHpjakJsWnpjM05tRkthekJWY0ZwSVVFRRAB",
            "text": "Was sat fifty minutes late for my reservation. After an hour of eating, we were given to-go boxes and the check and told we had to leave because \"other reservations are waiting\". Whats the point of an all-you-can-eat pasta deal if you get kicked out when you are still eating??????? scam of a restaurant"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ZmMzWm1VM3BYZURkNlMydFBabGRNVm1veWJHYxAB",
            "text": "If you are planning on dining in, I would suggest arriving 45 minutes late to your reservation. If you come on time, you will be forced to wait outside for up to an hour. Food was really good but not worth the hassle. Parm should consider doing delivery only since they clearly cannot handle a dine-in service."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobmNqWjJRVTVyVGtkc2JrNXJVVTFJTFMxMVgyYxAB",
            "text": "Good pasta here and Caesar salad.\n\nSecond serving for an all-you-can-eat pasta will take 10-15 mins and can only be ordered once first serving is completely done.\n\nThe “blanket” of mozzarella for the meatball parm were actually a thin slice; don’t get fooled by the misleading menu. Don’t order this for the cheese.\n\nHappy hour is limited to the just the bar and a few high tables."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TVQwdGtRMmRhTnpGb1QzRmxUMU16WmxKQmVsRRAB",
            "text": "Seamless order never came, tried to call but couldn’t find a human"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pock5HWlZZVWRQY0dsSVEyNVlkbVpNUWtkRllYYxAB",
            "text": "Best eggplant parm in the city"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM2FrMVFaSEpxVDJkU1pUbGlNbUkzTW5sbGJrRRAB",
            "text": "SO GOOD!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbE9HeGliVGRaUkRWb01qQmFRV2N3YmxKMlluYxAB",
            "text": "Loved the chicken parm sandwich!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTGVrTndSRlYwVVMxS1QzWnJSR0poY1MxaFdFRRAB",
            "text": "Awesome food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMGRVOW1ZbE5yTjJ0eFYxRTRlbEpzV25wRE5WRRAB",
            "text": "Food is great, the customer service Needs improvement!! Weren’t informed about promotions, and the wait period is long."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVlpFRXlkbVJwTlZCRGRWVkNYMlZCVEZwTVMwRRAB",
            "text": "The bartender puts his dirty fingers into every drink after he touched the cleaning rag. Disgusting. Hello department!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SalVtZGxTMVpyVGtjeGEzZGZRVTlSZDBGZlRHYxAB",
            "text": "We ordered penne scampi and chicken rigatoni which were amazing."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVd09FSnVlRlpLWWkxblpHNTVTSE4wVkdoR1ZuYxAB",
            "text": "Good food. Good service. Sat at the bar for a quick bite before a show at the Beacon. Had a chick parm on a roll and side of rotini (and a beer).\n\nBar tender clued me in that the rotini comes in same sauce as their famous rigatoni. So i got to try both their signatures with out having too much or wasting anything.\n\nNext time i would get the chix parm hero, tho."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbGMweFFSWGhYWmxBM2NreHlOMlYzVG1SamNWRRAB",
            "text": "Had a very enjoyable dinner here! The food is good, and the service was quick. It was easy to get a table for an affordable dinner on the UWS"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSFZHZE9lSHBFZEhGallWcG1NMEpPZFhoaFVXYxAB",
            "text": "Meatballs were still pink! This is the second time and food was under cooked and staff got sick. Please do better"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaVMwcEtlRlZIYVROMWIwSlZhek5zYkRGNFZWRRAB",
            "text": "Great venue, marvelous time here, delicious food, good for families."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aU1GUXRWRWxKV0hscmJUYzNWWFJKT1ZWdmQzYxAB",
            "text": "Parm on the Upper West Side is a terrific spot for classic comfort food, especially for the chicken Parmesan pasta. The chicken parm is served hot and crispy with rich sauce and gooey cheese, making it a standout dish. Portion sizes are very generous, so come hungry or be ready for leftovers! Desserts like warm brownies and famous cannolis offer the perfect sweet finish, and the drink menu has a solid selection of decent cocktails—including crowd-pleasers like the Negroni and spicy margarita—which are great to pair with their hearty mains.\n\nThe welcoming indoor ambience is bright, clean, and lively, making it ideal for anything from a casual dinner to a family outing. As Parm tends to get busy, reservations are highly recommended to guarantee a spot, especially on weekends. For those seeking satisfying Italian-American classics and a bustling, cheery vibe."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMWIyb3RhakJIWm05UFpVbFFlVXRRVVhWYVZYYxAB",
            "text": "Todo muy rico"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R09VTkVXRnB2YWxCZlJWZHVaVWxKTFhCWmRFRRAB",
            "text": "The food was edible but not particularly tasty. We were seated in a crowded part of the restaurant and we asked to be moved. The main courses came as we were eating our appetizers and we were given our check before we were done."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205elpqZHRiVk0wVEhSdWNYQnNNMEl0TURRMWRWRRAB",
            "text": "Food was good,service was good I enjoyed myself"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWlUwSm5URnB1TTNkVk5pMDVRa05IYldreGRrRRAB",
            "text": "Food was wonderful and the vibes are amazing! One of the best pieces in NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tselZIY3hTRmQ0UkRoWGRqWkpRbTExVjB0Q1JtYxAB",
            "text": "Maybe take out is really different but Thai chicken parm had no soul. The cheese wasn’t fully melted, or even tasty, the sauce was lackluster, the chicken was overcooked and tastes like it came out of the freezer."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xob2NGbFNhekZaZFhCTGVGQlFXbEpYVjFkUFZHYxAB",
            "text": "The only reason this is two starts is because of the food. I sat at the bar as a single diner.  The bartender was beyond rude and ignored me most of my time there.  I had to interrupt his texting to ask for a drink.   Then had to interrupt for my order.   He never checked in on how food was (garlic bread was a burned and dripping butter).  I would have ordered an after dinner drink and dessert but he ignored me for a good 15 minutes before asking if I was finished.      Food was good but can find better elsewhere.   I had chicken parm.   The pasta was the best part.   The mozzarella was hard and chewy on top of the chicken and the breading wasn’t stuck to the bottom of the breast.   Overall a disappointing Saturday night dinner"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSU5IQXpUeTFEZDJvM01EVTBOa3BVUkhKSWNHYxAB",
            "text": "got the chicken parm and an espresso martini. the martini was really good and quite strong, chicken parm was quite tasty as well. quite a loud atmosphere so we had to speak louder than we would normally but it was only a minor inconvenience. love the style of the decor, very nice very cute. would recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUmEycE5ObGxsWW5Nd1lrRnZWWE40VERSUGNHYxAB",
            "text": "I love the spicy rigatoni, the  meatballs appetizer is soft and tastes like homemade --  and those garlic bread knots you’ll daydream about!  Parm nails the marinara sauce without feeling heavy. Friendly service, lively room, and portions perfect for sharing. A quick, satisfying West Side go-to."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMVN6ZFRlVkpGYzI1VVozUkxWV2x1ZG5WamVWRRAB",
            "text": "It’s a cheaper Italian place then the other restaurants around, but sometimes cheap isn’t always better. I ordered eggplant parm which tasted good but looked like fertilizer. Their portions are out of wack for an Italian restaurant, my wife paid 16$ for a pasta dish and it was a good size, then there was my dish which was overloaded with food for 18$ something. Just really weird portions and vibe, felt the whole experience was off."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVlZGOVBiMlZVWlRNMGMzaG1WREZFVlVKM1QyYxAB",
            "text": "super friendly for kids, dogs and whoever love eating good pasta!!\nloved it\ndefinitely will come back\nservice was amazing, and the pasta and salad were fresh and tasty !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbVlrUllTa0ZrVDBGVU5FaDRZMEpxYUd3elFWRRAB",
            "text": "Parm UWS has officially ruined every other Italian spot for me — nothing compares. The chicken parm was absolute perfection: crispy, cheesy, saucy in all the right ways. The rigatoni vodka? Silky, rich, and downright addictive. Even the garlic bread felt like it deserved its own standing ovation.\n\nBut what truly made the night unforgettable were Julia and Crystal. These two were hands down the best servers I’ve ever had anywhere. Julia made sure every detail was perfect before I even thought to ask, and Crystal brought the kind of energy that made the whole meal even more enjoyable. Their attention, warmth, and genuine care turned an already fantastic dinner into an experience I’ll be talking about for a long time.\n\nAnd to round it all out, I really appreciated the friendly host staff who set the tone right from the start"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeGEwaFFZVTF4Y1VRMlJrdHVNbXhSWW1wWFRuYxAB",
            "text": "Love this place !  I took chicken Parmesan platter to go because I was in a rush. The hostess Logan was so nice ! . Everybody is super nice.the staff is super friendly I had the opportunity to meet the manager  Freda  who put this all together it was like the old New York City. Everybody was nice and friendly. Just come check out this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTVJYQnNRVVpQVTBzeFoyUkVZVkUwVmw5M1NYYxAB",
            "text": "Crystal was extremely attentive and hospitable! She gave great suggestions and knew what we needed before we did! Our food was delicious we got the scampi and the meatball plate. Will definitely be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNE9XVkNaMWhTYTJONmQyMU5ZekJVZVhSaldGRRAB",
            "text": "Nothing special. Below average vodka rigatoni with minimal vodka sauce. Super disappointing and over priced!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWVVWQnpRMnR1WW1WclFra3RNV3hJUjJsWldtYxAB",
            "text": "The food is great and the staff is very friendly and helpfull. I recommend the meatball parm, spaghetti with meatballs, pizza knots and the Brooklyn lager."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1blNVTjVNekJXV1RCcWJISm1Wek5pVEZsSk1rRRAB",
            "text": "The food was amazing, and the staff was very nice and attentive!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NVRXOWpXRFIyV1ROT0xXZFNURmRPYWxJMFNHYxAB",
            "text": "well, first of all, i mean no distespect as at least one person there was motivated in doing their job. this star is for you\n\ngot this place as a recommendation from youtube. not sure how someone can recommend it.\n\nambiente: was more diner like, not like an italian (?) style restaurant.\nthe food: well, you never serve this kind of salat (only romana with bread crumbs as big as half a toast) in a real italian restaurant.\nthe pasta was more like from supermarket.\nyou can enjoy it, but afterwards you will spend some happy time on the can.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUU1uazBYM1ZoUWpSUVNWTnZaREZLYTBadk5XYxAB",
            "text": "One of the best Italian spots in NYC and SO affordable. It’s a Sister restaurant to Carbone and I feel like the food is still the same quality, if not better. 100% recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaVJWVllkMlp3YUY5QlJtOWlMVk5RVmxreFExRRAB",
            "text": "I always love their happy hour, and  the Rigatoni Carbone is consistent and delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNU5GQkNkRWxCY21Kc2FFWm5ka0p2Y0hWa1pWRRAB",
            "text": "Salty meat sauce. Room temp and old lettuce Caesar salad not even tossed. Unimpressive."
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JelpVNUVXV3RhY0VjMFJGbGlWMlkyZUVWclVFRRAB",
            "text": "Un mauvaise restaurant les personages de ce restaurant n'ont aucun respect envers les personnes surtout les délivreurs"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bVVYUlphekp5WnpCbFZsZGlUMFkyUWpSblRtYxAB",
            "text": "I come here often and it's always a pleasant experience, food comes fast, staff is nice and they always give my daughter crayons. The pizza knots are amazing, my two year old always have the Bolognese fusili, it's really tasty. I highly recommend this place for parents!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcFNVZGFiM05tVldkMFNtSXhiblJFU1hoQ2NIYxAB",
            "text": "Amazing food! The ravioli stuffed with ricotta and sage is unforgettable. Wine list has affordable gems—the Montepulciano pairs perfectly with their ragu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZd1FqRmFOVGszZWxsWlNtTnRjMTlMVWtWcFNrRRAB",
            "text": "So far everything I've tried is delicious!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM09WZEZiVk5XVW1wb1QzTmZVa1ZrYVdod2EzYxAB",
            "text": "Very disappointed. I ordered meatballs parm with spicy rotini. I asked how many meatballs it came with, they said 3. I asked the size, they said decent. I asked is it possible to Double up on the meatballs and how much they would be, they said $5. I said ok with that price they must not be big at all. It took about 10 minutes, everything must be premade. When i opened my bag to eat my food i see 3 meatballs and a white cup. In the cup was a singular meat ball. Not Double at all. On top of it all the food was warm not hot and the cheese was hard. Not worth the money at all.  I called them but just got an “i am sorry, it was a mistake” but not a “lets fix it” or anything. I will not order here again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MlNUaFdRbTk1TTNSUFRGSnhiekkyZVU1dVEzYxAB",
            "text": "Was excited to try this place because they are owned by the same people as carbone apparently…\nMozzarella appetizer  did not seem fresh.. garlic bread came out burnt and did not really taste garlicky..Caesar salad was nothing out of the ordinary and lacked dressing. The spicy rigatoni was just okay. I will say the meatballs and the chicken parm were good. Our servers were very good and the staff in general all seemed great"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWVRHYzJYM2gwZUhGU2IxQlZSM0JZYXpCak0xRRAB",
            "text": "Booked a reservation at 715pm showed up 5-10 minutes after that said no table was availibale and that there were three groups ahead of us. Just walked out"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwb1FsRkpRMmxCVmw5Q2JGbDRVVVp5VFhoa04xRRAB",
            "text": "Pasta was ok. Ordered the bolognese, and it was super overcooked. Wait staff was fine, kind of unprofessional. Insanely loud and we couldn’t hear ourselves think. Would maybe come back to try it one more time, but honestly not worth the money - much better Italian places in the city at same price point"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTFRHcERlVTlqZVVORk5YQkJhakZRTlRscVdVRRAB",
            "text": "Our family of six had a fun, relaxing lunch after visiting museums.\n\nThis was a short walk from Central Park and the American Museum of Natural History. The service as really good and all my family loved what they got.  We had kids spaghetti, Italian sandwich, baked ziti, shrimp scampi as well as a special dish for the day.  All was good and the service was really good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MGEzWnNRVlprTjA0MVYzVlBUbkpyVjJKbU1VRRAB",
            "text": "The food was so bad."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcldtTlRZbE0zVmxZMlVYQm1TRU5NVjNkWU5tYxAB",
            "text": "Excellent spot for both lunch and dinner."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205S09EaEdOVVZUVERGeGQxTjFlVUZyYmpRMFMxRRAB",
            "text": "I have to say this before I forget. I went yesterday for my daughter’s birthday. The staff heard me say her name once, and they included it in her Birthday song. That was on point.\nThe decor speaks of old kitchens and of a grandmas or in this case a nona, might have her home feel, one can’t help but take a deep breath and let your worries slip away.\nEvery freaking Staff member was amazing.\nWe were seamlessly ushered in by an inviting young lady with stylishly cropped hair. (Loved it!) She was a positive force tower upon entering the establishment.\n\nJane our initial greeter was sweet and attentive. A soothing presence. Took care of us immediately.\n\nJoel, was hands down, the best. He’s got a great head of beautiful hair and a personality to match that sets you at complete ease.\nHe took care of us like we were family. He checked in, foresaw any challenges, and handled them with a precision that was flawless.\nThe buss men removed plates before i blinked. Like magic. Our group was a little bit behind schedule, but we were not rushed, in any way.\nIn fact, they were extremely understanding. Which in today’s times is just so dope.\nThe pièce de résistance, Their manager Frieda. Her spirit was so warm, and so inviting. Imagine going on a ship where the captain is at peace. With all the energy of different sounds and around us, She brought the calm. That means our experience was at peace.\nShe literally floated from corner to corner, i never heard her speak, until we were face to face. She was a the best host welcoming you into her most cherished home. I am coming back to be in that energy.\n\nAnd OMG The food…\nI ate so much they had to roll me\nout. The Mozzarella sticks were breaded to perfection, The chocolate martini was absolutely delicious and expertly made. And the pink vodka sauce made me buy two orders.\n\nMy advice, Only go to this restaurant with this Staff if you want to be taken care of and treated with expert care.\n\nGreat night. Thank you. From our family to yours."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvNHFQMThBRRAB",
            "text": "슾하겥히앤밑흐볼은 절대 시키지 마세요...\n와 무슨 소금으로 면 만든줄... 펜네슼앰퓌는 맛은 괜찮았지망 21불 주고 머글 맛은 아늼"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNnI2T0x5b3IzVUtnEAE",
            "text": "Late night Sunday supper with the girls on my first trip to NYC. We tried 3 different entrees plus the arugula salad and pizza poppers. The food was amazing, perfectly seasoned and the pasta cooked just right. We had excellent and fast service, and a warm chill relaxed vibe we needed after a busy visit of the city"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWE4yUnlNVEpUTjNSWFNHdFhSbUV0WlRrek5WRRAB",
            "text": "Amazing food spot we happened to stumble across! My personal favorite was chicken parm and penne scampi. Don't forget about the garlic bread! It's crispy (but not exceedingly) and has such great flavor!\nIt can get pretty loud as the place was busy as expected for being the weekend but were able to be seated right away. Our server made great food and drink recommendations. Portions were generous and at a great price, can't beat that"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd09fajhnRRAB",
            "text": "My friends and I came here for dinner and although it was quite busy, the service was excellent. We were seated quickly, and our waiter checked in with us within a reasonable time. While we waited to place our order, I noticed a staff member attending to the table next to us to make their table sturdy since it was shaky, which showed how observant and attentive the staff is.\n\nFor our appetizer, we ordered the pizza knots, which I highly recommend, they were delicious! However, I ordered the Rigatoni Carbone as my main dish and was a bit disappointed. The rigatoni was cooked al dente — firm and chewy — which I understand is traditional, but I am used to getting soft and mushy pasta when I order pasta and I personally prefer it that way. I wish the menu had mentioned that the pasta would be served al dente so I could have requested it to be cooked differently.\n\nOverall, aside from the pasta texture, the experience was great. I suggest the restaurant indicate how their pasta is prepared on the menu to help customers tailor their order to their preferences."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treGNGTTRZVmxrU21vdFNrYzFNVGRsVDFaQ2VtYxAB",
            "text": "Went to Parm with my daughter after a friend recommended it. Unfortunately, it didn’t live up to expectations. The deluxe garlic bread was dry and bland, and the mozzarella sticks tasted like frozen ones from the grocery store. I had the eggplant parm with rigatoni — it was just okay. My daughter got the spicy rigatoni with grilled chicken, but it was way too garlicky and the chicken was dry. Also, the place was very noisy, which made it hard to enjoy our meal. Overall, I’d rate it 7/10 — not the worst, but I wouldn’t go out of my way to go back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRHZ0YXZCcUlqdXNBRRAB",
            "text": "Absolutely delicious food! Perfectly located near Central Park, it’s an ideal spot for lunch or dinner after a day of walking, biking, or relaxing. The staff was incredibly friendly and attentive, making the experience even better. Highly recommend this gem for a fantastic meal in a great location!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvX3YyaUJ3EAE",
            "text": "I really hate having to give this place 3 stars when I really wanted to give it 5.\nHere’s my experience and why it deserves a 3.\nIt first begun when I arrived and I tried to use the restroom. After 9 minutes of waiting for the only two individual restrooms of the restaurant, I saw that it was an employee who had been occupying it for that long. It’s crazy. Me and other customers in line were furious.\nService was very pleasant as the waitress had no problem with us making any changes to the dishes on the menu which was amazing. The meatballs and the chicken parm with the vodka rigatoni was perfection.\nThe problem was the dessert and here is where another star was knocked down. First of all, they didn’t have coffee. I get it if an Asian restaurant doesn’t have coffee but come on, an Italian one doesn’t? Really?\nLastly, we asked the waitress to recommend us the top ordered dessert. That’s when she recommended the s’mores ice cream cake and so we ordered it.\nLook, I’m not going to lie and say the cake was disgusting, because it was not. But it’s just not the level of cake I expect from a place like this. That cake tasted like cheap, bad quality, ice cream that has been stored in a freezer for months before being served. If this was the best selling dessert then I say that Parm should really focus on pastas and nothing else.\nReally left disappointed after that and ruined my experience a lot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWGMwVm1UelJETWxkWFp6Qk9TMmRZVlVkRU5GRRAB",
            "text": "It's one of the Italian restaurants in New York City.\nAlthough they don't serves Pizza,  but their pasta is nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNnJ5ZjlnRRAB",
            "text": "The garlic bread is a MUST! I love how crispy it is and showered with sesame seeds! It's best eaten with ricotta and marinara sauce. The baked ziti was also delicious but not mind blowing.  Their pasta with Vodka sauce is top tier! Chicken Parm was decent"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzanBEN25BRRAB",
            "text": "After the nyc marathon, we visited parm. The atmosphere was great and the servers were GREAT. they were so kind and charismatic. Can’t go wrong with service. For food, we ordered the garlic bread (not the deluxe version), fried zucchini, mozzarella sticks, calamari, and the chicken Parm.\n\nThe garlic bread was so crisp and light and not too garlicky Although that wouldn’t hurt. Eating it with the marinara sauce was even better.\nFried zucchini was a MUST. I WOULD 100% get it again. This crisp was perfect, not watery at all as that’s normally a concern for fried vegetables. With the sour cream dip, it was perfect.\nCalamari was good but nothing out of ordinary. Just classic good calamari.\nMozzarella sticks aren’t my favorite, my gf prefers them but these ones didn’t feel special at all. No cheese pull, just stick of cheese in breading. It’s ok.\nThe chicken Parm. The chicken was not dry and with the sauce it was so good. The pasta was fine but the chicken was good for what I ordered.\nI would recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYndrcDM2eDlET0lBEAE",
            "text": "Had an amazing chicken parm sandwich! The rest of my group raved about their meals too. Fast and friendly service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyOWNLRWZ3EAE",
            "text": "Good food. They were out of eggplants, so many dishes were not available. The Rigatoni dish was a smaller portion.\nThe place is very noisy and makes it hard to have a conversation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUc2NqUml3RRAB",
            "text": "Amazing all around. The spicy rigatoni was my favorite, but everything was delicious. The spaghetti and meatballs were a close second! The caesar salad is supposedly the same as Carbone, just better price."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmem9TUjVRRRAB",
            "text": "Food was delicious! Appetizers, we did the calamari and fried zucchini. Both were great. Entrees, we did the Chicken Parm and Eggplant Parm. I am soooo glad I got the eggplant! It was probably one of the best I’ve had. Strong basil flavor, lasagna stacked style. Try it!! Bummed that happy hour was bar-only…. I didn’t know that prior to coming or maybe would have went somewhere else. They really pushed for us to sit at bar (party of 2 so I get it) but we didn’t want to do that. Regardless, we had a nice meal and would come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNjhLd2JnEAE",
            "text": "We recently dined at Parm restaurant in NYC, and I would give it a solid 3 stars.\n\nThe highlight of the meal was definitely their famous shrimp pasta. The flavors were okay,  I found it a bit heavy on the butter, which made me feel queasy, sick to my stomach right away, full and uncomfortable all day the day after.\n\nOn the positive side, my boyfriend and I did enjoy their chicken parm sandwich. It was tasty and satisfying, even though we felt it was just average compared to other similar dishes we've tried elsewhere.\n\nThe garlic bread, unfortunately, was a bit underwhelming. The promised of garlic bread is to make the taste of garlic noticeable and that was far from what we were offered.\n\nOne thing I can't complain about is the ambiance. The restaurant has a cute and comfortable atmosphere, making it a pleasant place to dine and friendly customer service.\n\nOverall, Parm offers a decent dining experience, couples and big group but there are some aspects of the food that could use improvement. If you're looking for a cozy spot with some decent dishes, it's worth a visit, but don't expect to be blown away."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwc1B2dW1nRRAB",
            "text": "Food is good but very rich (too creamy)\nThe service is average and so is the atmosphere\nA bit on the expensive side for this class of restaurant.  Chicken Parma is the highlight…. But the chicken batter a bit greasy.  Next time I will try something else… away from buttery / creamy dishes"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOMTRfRi13RRAB",
            "text": "The flavors are great! I feel like the sandwich ingredients could’ve been fresher, felt like the cutlet had been sitting out for a bit. But it was tasty. The fries were delicious. The vibe is great. The prices are affordable and the portions are solid."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaXVqWmdRRRAB",
            "text": "Wow! I’m thrilled I had a chance to try Parm and enjoyed a delicious meal with friendly service.\n\nI ordered the Chicken Caprese on a roll with a side of garlic fries . The fresh basil and mozzarella wee the highlight of this dish, taking the flavor of the chicken to the next level, and with a little spicy mayo it was perfection. My new favorite.\n\nThe drinks were a bit on the pricey side at $15 for a small cocktail. I would pass and just get the amazing food next time.\n\nOverall, a great experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNnVHNXd3RRAB",
            "text": "It seems like a crowded place that is bustling and lively with a lot of good food options but to me I think the food was a bit lacking the chicken palm which would have been the highlight of the show here was a bit on the dry and tough side and was I found quite lacking.\n\nThe sitting outdoors was wonderful and you felt like you were really insert in New York and I would recommend this if you want to have a bit of a lively please sitting inside was however seem very noisy and chaotic the music was playing a bit too loud and might not be conducive for conversations and meet ups.\n\nThe pasta on the other hand I definitely would recommend because the sauce was creamy tangy with Tomatoey goodness.\n\nThe garlic bread was also equally as delicious and crispy. The sesame seeds on top also a good crunch and added a nice texture to the bread.\n\nFound the service somewhat disappointing because it did take a while for us to flag down the weather and we didn’t feel like the food to quite a while to get served even though it wasn’t as crowded as we thought it would have been at the peak period ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdjZhZkp3EAE",
            "text": "Parm is a very kids friendly Italian restaurant. I heard good things about Parm from many parents, and we enjoyed our visit there on a cold Saturday afternoon before heading to a movie. They offered a reasonably priced kids menu with good portion sizes. The salad and meatballs pasta dishes were delicious. Highly recommend Parm for families."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3a0o3YnR3RRAB",
            "text": "Rigatoni carbone and penne scampi was tasty with a relatively decent sized portion. Garlic bread and pizza knots were a go to appetizer that didn’t disappoint. Cannolis weren’t that good, would try a different dessert instead."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMHJfcTVRRRAB",
            "text": "Alors qu'elle surprise !!! On cherchait une bonne adresse au retour du Musée d'histoire naturelle c'était parfait. Les plats supers bons, la serveuse au top, pas d'attente, ambiance très sympa, prix abordables. Même des options vege ! Aujourd'hui c'était le jour des \"Pasta\" alors on a eu une réduction ! Je recommande pour de la cuisine excellente et réconfort."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdlpYUnZRRRAB",
            "text": "This place came recommended by family in town, and what a great recommendation! Lots of seating but not too loud, extremely friendly and attentive service, and best of all, great food.\n\nWe started with fresh house mozzarella and prosciutto. Both were delicious, served finished with olive oil. I had my choice of IPAs (great local draft list), and picked the sweetest on the server's recommendation.\n\nThe kids meals looked great, both my kids had chicken and fries - the chicken was a breaded cutlet sliced up and the fries were thin, crispy and delicious.\n\nI had the chicken parm, with that same house mozz melted on top of the 3 pieces, and it came with a side of pasta for which I chose the rigatoni with vodka sauce (which was recommended by the server). I have nothing bad to say about that chicken parm, but wow, the rigatoni in vodka sauce was a dream. Buttery and silky with some onion in the sauce, I could just order a plate of that next time.\n\nOn vacation, these casual family friendly places with great food and service are a dream. I'd come again, but I'd have to come hungry given the rich food and big portions!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcUxDcWF3EAE",
            "text": "Undeniably the most powerful and chic restaurant on this planet. This food is filled with spices, passion, and saucy love. You walk in with your shoulders, back, and head slouched over like a baby sloth and you leave out with more gusto than a Popeye after he shotgunned a can of spinach. If I could get an internship here I would. The prices are fair and the vibes do not scare. Sell your car and give them the cash in exchange for food. Trust me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5eklUUDdnRRAB",
            "text": "I thought the food here was amazing. We got the pizza rolls as an appetizer which were hot, fresh, and delicious. The fusilli bolognese was phenomenal. The sauce was very rich and creamy and the cheese that came atop it complemented the flavors perfectly. The interior of the restaurant has a lot of natural light because of skylights which is rather unusual for NYC restaurants. Overall 10/10 experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEME5PLWZnEAE",
            "text": "Nice Italian Restaurant, if you looking for pastas and sandwiches this is the place. Food is delicious, the pasta is fresh and cooked perfectly. You need to get the garlic bread and they have a deal, appetizers and drinks half the price all day. Highly Recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWbllDQm5nRRAB",
            "text": "This is basically like a New York City version of Olive Garden. I had the chicken Parm, which came with Fili pasta and a tasty sauce. We shared the Caesar salad to start, tasty, but I think $17 is a bit much. This place is quite large and has a very phonetic interior, loud with lots of movement. The chicken Parm was not the best I’ve ever had but I was pretty hungry and it hit the spot, the pasta and sauce was also nice. One thing I would say is they need to figure out the front of the house a little better because we had a reservation and the two hostesses seemed rather overwhelmed with checking people in and getting them seated. It seemed that there were some walk-ins that got seated before us …And we were not seated until about 15 minutes after our reservation time, that shouldn’t happen. The serving staff is working very hard to keep things moving, I’m not sure if I would try this location again during prime time but I might give them another chance at a different location in town."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsci0zUkJnEAE",
            "text": "I visited this location on a Saturday night and it was extremely busy. We had a reservation but still had to wait a few extra minutes. The restaurant itself was somewhat dated and it was very loud. The good news was that the food was very delicious. We started with the pizza rolls and caesar salad which we enjoyed. For our mains we had the meatball parm which was tasty and came with spicy rigatoni pasta. We also had the rigatoni carbone which was very good. The prices were reasonable and the food was served quickly."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNGJueUZBEAE",
            "text": "Parm is my favorite underrated happy hour spot! love the mozzarella sticks and rigatoni carbone. They are very quick with getting food out."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmelpPd2h3RRAB",
            "text": "Such a great spot for authentic Italian food,felt as if you were at Nona’s house with the aesthetics felt so cozy + comfy and our waitress was lovely"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKdkRvSWowcDdhSU13EAE",
            "text": "The service was amazing, it was my second time having dinner here and I always feel taken care of. The space feels warm and cozy. Great to go with family or friends for a casual, chill meal. The drinks were strong and the food was good. I've tried several dishes from the menu and everything was delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREdktpdUhnEAE",
            "text": "We ordered from this Italian/American restaurant and the food came well presented. The portions were fairly generous and the taste was good. An alternative when you feel like eating Mediterranean food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlM3BUdlBBEAE",
            "text": "Came to this Pizzeria restaurant with family and friends. We had a party of 6 adults and 2 boys to celebrate one of their birthday party. This is one of his favorite places to pick up his dinner after school to eat at home.\n\nFood was good, a 4 start rating for me. So was the restaurants decor as well. The staff was helpful and did what's expected from your server. So all around everything was a 4 star rating.\n\nI didn't agree with the fact that the business manager charges $5 per person to slice and cut your cake. If you bring a cake from outside the restaurant charges you. Yet in the end our server told us he spoke with his manager and convinced him not to change the $5 per person. I mean we already was spending over $30+ per person for the evening already, for a total of over $250 I'm sure and that's not including tip. Main reason for giving 4 star rating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOcjQzbHN3RRAB",
            "text": "We had lunch here and ordered two of their platters, both with spicy rotini (absolutely delicious, same vodka sauce as Carbone). We tried the meatballs (which are made of veal, pork and beef) and the eggplant, and both were incredible. The eggplant really surprised us, and the tomato sauce that it comes with was really tasty too. The meatballs were also really good, perhaps a tiny bit dry, but nothing that couldn’t be solved with the tomato sauce. Our server was amazing and there wasn’t many people, so it was nice. Overall a pretty good experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMEtTQzF3RRAB",
            "text": "The food was beyond delicious. A friend recommended this to me a mere 30 minutes beforehand, yet we were still seated and served right away. We were never left waiting either, as the personnel always seemed astutely aware of our wants and needs at any given time.\nWe ordered the Mozarella sticks and the garlic bread for starters, and the Penne Scampi, the Eggplant Parm and the Meatball Parm for the main course. Every single one of them were delicious. An immaculate balance of taste, texture and looks created a dish that I myself could only describe as perfect.\nThe prices were on point as well, with our total bill (family of four) not even eclipsing the 200$ mark.\nThis restaurant is an absolute must for anyone and everyone in the area, whether you’re a tourist simply passing by (like us) or a local who’s been living here for years.\n\nFive stars."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbHJ2a3VnRRAB",
            "text": "Highlight of the meal to me was the garlic bread cause i love sesame seeds.\nMy girl likes the mozzarella sticks the most.\nService was attentive but just ok. Decor had a diner feel, there was two bathrooms.\n\nPastas had good sauce and cooked just right, to me.  al dente.\nAerol spritz were ok. Wine was good.\nSide Salad were just ok, sammich i recommend getting the hero instead of the roll(cause more sesame)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkczVUMXZ3RRAB",
            "text": "Had the best lunch here. Our bellies were happy and full! Can’t wait to visit again, may try other locations. This one is cozy, staff was friendly, and in a convenient spot located near a lot things if you’re a tourist like me."
        }
    ],
    "reviews_count": 87
}