{
    "name": "TESSA",
    "place_id": "ChIJr6LJHIlYwokR1nUYpYgH7Uc",
    "grid": "MN7",
    "address": "349 Amsterdam Ave, New York, NY 10024, USA",
    "rating": 4.4,
    "user_ratings_total": 962,
    "phone_number": "(212) 390-1974",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ob2FuUktPRTFJUVVKSFYyeGtTbk4yTWtzeFNWRRAB",
            "text": "One of my favorite restaurants in NYC. Love the smaller plate option. Great drinks and service."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNGJVOUNXVlUyUTI1QlZuTmFSek5uWTFWb1UyYxAB",
            "text": "Excellent restaurant and service by Annalisa. The branzino was among the best I've ever had. Terrific buratta and hummus as appetizers. Great wine list!\nWill definitely return!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdFpIbHpZMVpSVkUxNFdUTnBlRkJXY214dE5sRRAB",
            "text": "Usually busy. I’ve sat at the bar mostly, a couple times at a table. I prefer the bar. Sal and the woman bartender are awesome! I like their cabs and the garden martini. The cauliflower app is so good. I love their bread rolls. The happy hour has food and drink specials. I’ve been many times, it’s a neighborhood favorite."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQ1Ywb3pabWhQZEZkR1QwbFBVVlZDVDNsTFJtYxAB",
            "text": "We had a wedding event here in June and it was PERFECT. The staff was incredible - so on top of everything - our guests always had a drink in their hand and the food service was seamless. Highly recommend this restaurant for brunch, dinner, or for your next big event!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21selMyVXRYMDF6T1U5NVpGSnlkRTlaY0RBeGVsRRAB",
            "text": "Nice restaurant close to Beacon theater. Enjoyed the food. Keep it up."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMlgzTjNhV1ZrZVU5bU9FbHhObWMzYldSaE1IYxAB",
            "text": "Nice place, the food was good. The people were excellent, very nice, friendly, attentive without being overbearing, professional."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWlUwcG1UbWhRU2s5UFpGQlNWVXBFWW1aUFdXYxAB",
            "text": "The Pasta was CRAZY"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNFRVMXBOelZsYTBGV1NYVkNjVVJGUkVOWU1IYxAB",
            "text": "Wonderful meal, attentive staff/ service with great cocktails!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTk9VOWFRWGxNTTFWNFNuSTNWVmRVTjNsQmJsRRAB",
            "text": "Excelente servicio, con cocina mediterránea servidos en forma generosa y en un ambiente muy agradable.\nGracias!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORmVFWklUVFV3V0dOVGFVWm1OVVp3YzNNemVYYxAB",
            "text": "Got here late, our waiter Ray was super friendly and accommodating.  Great atmosphere, food was excellent!  Thank you!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNVVucEdiak5UY21GeFExZ3dUbTVMTmpsME5WRRAB",
            "text": "Extremely mid operation. Customer service was nonexistent. Hardly a hello, the appetizer came out on a narrow slate rock? No such thing as plates here, at least for the apps. Very strange atmosphere. No hi how are you, can I tell you about the menu or our specials…barely a greeting as I walked in. The food tasted fine for whatever that means but I couldn’t close my check fast enough."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bExVdzBhWEJ6TldZMWFYQnFkVVZ3YjBWWE1YYxAB",
            "text": "The food was pretty bad and I don't plan to ever go back.  I ordered a watermelon and mango salad to start, and the watermelon was overripe (already translucent) and the mango was totally unripe, each chunk as hard as a rock. I couldn't finish the salad. Then I had branzino, which was edible but not especially enjoyable. The broccoli rabe it was served with was overpoweringly flavored with garlic and I couldn't finish it, although I love vegetables and love garlic!  My husband didn't enjoy his food either.  It was very loud where we were seated, although some parts of the restaurant might have been quieter. There was at least no music adding to the noise, which I appreciated.  The service was terrific and the space is pleasant. If the food had been good, I'd be happy to go back and hope for a quieter table."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSWQxRnZObk4xTjJJMFVqWjNhblJxYjBGV1JXYxAB",
            "text": "Everything on point."
        },
        {
            "date": "3달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SV1duUkhPWGRLYVhGMWEwWmtZMVpaVVRKS1VVRRAB",
            "text": "Local com comida deliciosa. Vale a pena conhecer."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSelVIbzNNR0pOYzJ0WGNtZFZNM1pJZUhOVmFXYxAB",
            "text": "The happy hour is amazing with $5 craft beer drafts. Very good selection too"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sS1IzaHJkM1JQTVU5S01uRk1Ta1ZMZVc5SE1FRRAB",
            "text": "I almost don't want to write a review for the best brunch on the upper west side but it was so good that I feel guilty not letting people know just how amazing Tessa's brunch is....HANDS DOWN - For all the right reasons: food quality, preparation, ingredients, service, menu choices, make Tessa the unequivocal leader in brunch options in the neighborhood.\nI will be going there for dinner this week!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVU1sSjFkVU53YkROeU9EQnljMnhpVFVaV1RsRRAB",
            "text": "I will serve you as quickly and efficiently as possible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNU5TMDNkRTl6Tm1SRVUxaE5SREZ6TjFCMmJtYxAB",
            "text": "Great service & great food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWT09ITmlURGRKUlZjNFlVSlRiSGREWTBOTWIzYxAB",
            "text": "Came in for some drinks and apps.\n\nLet me start with saying that the service here is EXCELLENT. Attentive, fast and efficient.\n\nThe food also comes out very quickly. It's quite impressive.\n\nOnto the food itself - a bit of a mixed bag unfortunately. Octopus was a bit overcooked and springy but well seasoned. The dips were underwhelming (probably some of the worst hummus I've ever had) as was the cauliflower app where the sauce was too flat.\n\nMay need to come back for dinner to see if the mains are stronger."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MlpYUm5RVkozVkdKWmJFODJRVFZCVDBsT1YwRRAB",
            "text": "Lovely place with beautiful food and yummy taste 😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trdFoxZGtOa2RFVHpVelRHTklWMHhETFRsVlJXYxAB",
            "text": "We had an early dinner here on a Saturday with a reservation, but there were plenty of open tables. The space has a cool ambiance but a bit on the darker side.\n\nThe service was mostly attentive throughout the meal, and the pacing between courses felt just right. Presentation across the board was excellent. Every dish came out looking like there was thought put into them. The standout for me was the cacio e pepe. Super rich flavor, and the foam layering the sauce on both sides was a nice touch.\n\nWe also had the octopus appetizer, which was really well-cooked and flavorful.\n\nPrices are definitely on the higher side, but there’s clearly thought behind everything from the visuals to the taste.\n\nThe bathrooms are clean. There’s one upstairs and three downstairs."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdWVtWllRVlZTWkVsRFRISTBObUZzTlRaTFkwRRAB",
            "text": "OMG. It is unethical to let people in during severe weather alert and serve them without telling your customers THERE IS NO AC. No fans and after complaining there was no compensation for any of our food or drinks. I love Tessa but that is unacceptable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNmRVZHlkMEpaWDB0VlVVMW9OSEYyV25adWNGRRAB",
            "text": "We were in NY on vacation and had been eating out 2-3 meals a day for a week when it was time for our reservation at Tessa, so we had a lot to compare it to. Food was fine, service was inattentive (no offer of additional drinks or refilling our glasses; no asking how everything was; no clearing empty plates), atmosphere was cool in terms of look but the acoustics in the restaurant made it incredibly and uncomfortably loud. It was too difficult to talk with my dining mate and right away we both remarked at the noise. Metal on the ceiling throughout the restaurant I think was a contributing factor. It made me just want to get out of there. Would not return and wouldn’t recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOelZqbFhkelpRUlVkdU5WcE5iVzFCZVV0TWEyYxAB",
            "text": "The food was good, I really appreciated the complimentary bread and butter! Our server was very friendly too. Downsides were that the eggplant rigatoni wasn't very flavorful, and it was SO LOUD inside. I almost couldn't really hear my partner over the noise. We didn't have a reservation and could be seated immediately, which was really nice. I liked the decor."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdnl3X0tWOHJTVWdnRRAB",
            "text": "We went as a party of four with a 5:30 pm reservation (prior to a show at the Beacon Theater).  We were seated promptly. The drinks were amazing. The gazpacho was well seasoned. The pasta dishes were well done. The servers were professional and attentive and gave honest recommendations regarding food and drink choices when asked.  We were not rushed but did not linger as we had a show following. I am looking forward to returning and I definitely recommend this restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQU0YtSXpqb2YyTnpnRRAB",
            "text": "Food was average.  Service slower than average.  They got our simple order modification wrong and forgot to bring our sides."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNeVVnZlBCZ042OUt3EAE",
            "text": "Our group of 9 friends had dinner here. We had a great table, fabulous service,  great food and drinks. The blood orange martini was perfect.The fresh pasta was excellent. Love the availability of smaller portions. We will definitely be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOR0xqby05Z29fUzNBRRAB",
            "text": "I am completely shocked by the way we were just treated by the manager at Tessa located on Amsterdam Avenue. Patrick came over to our table abruptly and announced that we had paid the bill already and they needed our table. We were shocked by his sudden and loud approach. We told him that we would get moving. We then asked another employee his name and they informed us that it was Patrick the manager. Even more shocking was that this behavior was from a manager - a role model and leader for all other staff members and a person who really represents the establishment. Patrick then came over to our table again and initially tried to defend himself and said that he did not mean to be aggressive and it was a misunderstanding. When my friend responded to him he simply got louder and more aggressive. As a woman in New York City, I felt extremely uncomfortable and intimidated. I have never seen anyone in the service industry respond to customers like this before in my life - especially in such a nice and respected neighborhood establishment. I understand that dealing with people all day every day is difficult, but that is no excuse to treat customers in such a hostile and honestly such a rude way. Quite honestly living in New York, my entire life, I am shocked to see this type of behavior. It simply is just not what I'm used to at all and one that I wouldn't expect. This is the service industry. I am also in the service industry and understand how hard and frustrating it can be. But at the end of the day it's just unprofessional. He would have never approached a man the way he approached us."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNmZzYlNQX3RxRlRBEAE",
            "text": "My wife and I had a wonderful dinner here prior to a show at the nearby Beacon Theater.  Service was prompt, friendly, and attentive.  The food was delicious, we had the cauliflower appetizer, risotto and gnocchi dishes with a side of brussels sprouts, and cappuccino to finish the meal.  The interior was nice with old brick walls and subdued lighting.  It was a bit noisy, but not too bad considering they were packed.  Highly recommended!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJR002b0RKazg3bmFnEAE",
            "text": "I’ve been coming here for years. It’s always great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLVlmNmpnRRAB",
            "text": "Great food; bad acoustics."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeU42UVd3EAE",
            "text": "The foam past is very interesting. Noodle texture is very solid, sauce is rich. But it was a bit salty.\nBeet Salad was good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbkpHYTd3RRAB",
            "text": "The sound levels in this place are astronomical! With no soft surfaces anywhere to help absorb sound, it is impossible to hold a decent conversation, and everyone is talking (yelling, even screaming) at the top of their lungs. Even one of the service people rolled their eyes when we mentioned how loud it was. They should get 'hazard pay' for what this kind of sound level is doing to their hearing. What should have been a special event, even with the excellent food, was completely ruined. Too bad."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncDlYbV9RRRAB",
            "text": "Came tonight (Thursday around 7pm) and got seated and greeted immediately despite it being a full house. We received complimentary bread and butter and a cheerful staff from the host stand to the waiter to busboy. I ordered the pear salad and WOW. Incredible!! Blood orange martinis sent me to a summertime oasis-absolutely fantastic. Brussel sprouts were shared and so delicious too. My friend ordered the burger and devoured it. The ambiance is so nice-romantic yet chic. Classic NYC. I can’t wait to return and try more from the menu!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnemRMMVdBEAE",
            "text": "Awesome place, food was fantastic and the place super"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbnRQNW5BRRAB",
            "text": "Don't dine here as a solo diner or else you'll be ignored. Food was below mediocre but the service was the real kicker. I sat down to enjoy a solo dinner before a show at the Beacon. I had a reservation for one for weeks. I was ignored entirely. The couple who sat next to me was greeted with a smile and asked if it was their first time there. Their waiter was like have you been helped? I replied no and he got me my drink. My waitress took my order but did not check on me for the rest of the night. I had to ask the person who clears the table to give me my check. My waitress didn't come to take my check although she passed my me several times while I was making eye contact. I needed to use the bathroom so I did and as soon as I entered the restaurant called and said I left my card.\n\nNewsflash. It's 2025 and people can and should be able to eat alone. I plan on taking this further than this review as discrimination against someone for their status as a diner is illegal."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncXR5R1VBEAE",
            "text": "Stepping into Tessa, you're immediately struck by the wonderful ambiance – The flavorful Meatball is an absolute must-try. If you are keen on healthier starter, I recommend “house dips” which come with 3  dips; garlic hummus, whipped ricotta, spinach-artichoke, with veggie sticks. And if you're looking for a satisfying main, don't miss the juicy and flavorful pork chop – cooked to perfection! You can tell the ingredients are fresh and carefully chosen, and the dishes are prepared with obvious care. I'm already looking forward to my next visit."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCOHJXalpnEAE",
            "text": "Food: 4.9\nVibes: 4.8\nService: 5\nOverall: 4.9\n\nEverything was so delicious. I will definitely come back here. Came w a friend Saturday night around 7pm. It was packed but we had a reservation. Service was really excellent and our server was really good w the recommendations. GET THE PICKLE MARTINI!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaUl2UUtBEAE",
            "text": "Tuna tartare was great, fresh and full of flavor. Fried cauliflower was crispy and delicious. Drinks were spot on."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MThYVS1RRRAB",
            "text": "가격 대비 맛이 약해요!"
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMTZyTWFREAE",
            "text": "별로임"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eEpxQmRREAE",
            "text": "Enjoyed the food and atmosphere. It does get really hard to hear even though there isn’t music blasting. The pork chop was good but I wish the eggplant rigatoni had more eggplant in it. I thought it only had tomatoes at first. I got the small plate which is good for a single serving, I think the large would be great for sharing.\n\nFor dessert we got the baked Alaska and it was delicious! Wish we had more room to try out the other desserts. Server was super nice and friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIM1pxYm5nRRAB",
            "text": "Had a forgettable dinner at this place. The service was awful. The servers (more than one came at the table) kept rushing us. I understand we’re not in Europe and we’re in nyc and people rush through dinner, but this was just awful. The food was so so. My friend had the shrimp pasta which she didn’t really enjoy. The gazpacho was bland. The thing that was decent were the rosemary fries. The Aperol spritz was good. We had asked three different servers for bread and olive oil on the side and it never came. The space was small and felt claustrophobic. Left quite disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydjYtM0tBEAE",
            "text": "Former chef, and I would say possibly best salmon dish I've had in a restaurant.  Most enjoyed meal I've had in NYC.  My wife had the duck. It was also very well prepared and flavourful... Obviously, I had to steal a couple bites... good cocktails too.  Just writing this review is making me want to go back. If you want a beautiful restaurant with great ambience and isn't a tourist trap....hit this place up."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5N3RHWll3EAE",
            "text": "The avocado toast, which was the main reason I was here, to try it, was underwhelming. Very basic. Nothing stands out in terms of flavor or presentation. For the avocado toast I will give 3 ⭐ for \"it's ok.\" I won't review the granola and fruits because they are just things you can put together, no skills or artistry required.\n\nI have to admit other dishes from other reviews look quite good (at least on photos), so perhaps I'll come here again -- just not for the avocado toast.\n\nThe vibe and service were nice overall. 4 ⭐."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5c191ZWRBEAE",
            "text": "I cannot state enough just how delicious the food is here !!! Soooooooooo good !! Everything was full of soo much flavor and the steak had to have been one of the best cooked steaks I’ve ever had perfect temp and seasoning.\nIt’s pretty inside and perfect to go for a date night the ambiance is nice. Definitely recommend this place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbm9lU3Z3RRAB",
            "text": "Went there for a Saturday brunch with Friends.\nMany little things happened which made me pick a three stars for this location.\nStarting with the seating, it was little crowded, the tables could've been arranged differently. The chair where metal not quite comfortable for a long seating.\nService was on the slow side, claiming that they are busy with few parties happening ( there was only one). One drink order took 30 minutes and it was wrong drink. They did cancel few drink items from the final bill as an apology which was appropriated.\nThe food quality was over all bland. My friends had eggs which came cold, my burger was ok, nothing special.\nStaff and friendly, the place has exposed brick decor and cozy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNla3FhWjdRRRAB",
            "text": "Great ambience and atmosphere.  Beautiful restaurant that makes you feel like you're in a wine cellar.  Romantic vibes.  Inside and outside dining avaliable.\nThe waitress was great and very informative. Attentive staff.\nLoved the watermelon salad. Loved the Cacho E Pepe.\nI wasn't a fan of the espresso martini,  the risotto was alright,  no my favorite either.\n\nReservation recommended.  Overall Highly recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbWRUenhnRRAB",
            "text": "Overall the place has a nice classy feel to it for brunch and the service was great. The drinks were good but the food lacked seasoning.\nWe got the steak and shakshuka, both were plain but The bread was fresh.\nI will probably not visit again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNjZIcVdnEAE",
            "text": "Exceptional food and service! Came for a quick dinner and ended up spending 4 hours here.\n\nWe had the Cauli Fritto (👏), the beet salad (superb), the shrimp scampi pasta.  And the best….. the mini-donuts with coffee sauce! Yum! 10/10 chefs kiss!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaE9fU3NBRRAB",
            "text": "The bolognese is AMAZING! I love that you can get 2 different sizes of the pastas depending on if you are sharing. Sitting at the bar was perfect as a solo diner. The bartenders were very attentive and nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMM05LbTVRRRAB",
            "text": "Delicious...server unfamiliar with the menu. Good wine list. I have eaten here twice. Both times, I was very pleased. Gorgeous cocktail & mocktail options."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OXJUcmhnRRAB",
            "text": "Terrific Mediterranean food at TESSA! We really enjoyed our meal and the service at this Upper West Side restaurant. Knew nothing about it when we went in the pandemic. But were happy with everything from the burrata appetizer to multiple desserts. Can’t wait to return."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadnBQSUlnEAE",
            "text": "Place was cute, the old was delicious and staff was friendly and attentive.  Overall, no complaints.  The bar even made me a drink that was on last seasons menu."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRai1TSU5nEAE",
            "text": "Great and unique brunch options. Lovely atmosphere and has a space in the back for a large group. I've also had dinner here which was good but felt over priced for what we received."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxcnRhYWd3RRAB",
            "text": "UPDATE: I came back here today and they still had the branzino and OMG I am glad I did. The dish was exquisite. The mango mojito is still sinfully delicious and service was excellent. Also the rnb and soul music selection played in the background is so relaxing.\n\nReview from 10 months ago (3 stars rating):  Relatively flavorful food, delicious mojito and excellent service. The bronzino is very popular and they ran out of it by the time I ordered. I was not too happy about that. I picked some salmon instead and it was fresh and relatively flavorful. The chocolate tart was too decadent for my taste."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbm9lcTh3RRAB",
            "text": "Food was delicious and amazing quality! Met the general manager and he gave us top-notch service on what was a tough day originally~ Certainly will be back to this establishment soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCXy1tZk93EAE",
            "text": "Looking for a great Mediterranean bronzino and delicious salads try Tessa! Delicious fresh and moist bronzino served with fingerling potatoes and a cauliflower mash. Also try the Pear Arugula Salad. Fantastic. Don’t forget to pair the tasting with a nice glass of the Montepulciano. Enjoy! 🍷"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNWJPckVBEAE",
            "text": "This restaurant is a great memory to me and my husband because we made the first time in here. 😍\n\nThe food is amazing. The pasta is so delicious. Also loved the ambience and the rustic style of this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkXzRMWWJnEAE",
            "text": "Amazing tuna tartare\nGreat steaks and pastas\nStick with wine over mixed drinks ! They always come out a bit “off”"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaklleGdnRRAB",
            "text": "Nice upscale bar/restaurant with a few TVs at the bar and a quieter traditional restaurant area in back.  Great salads, and surprisingly outstanding pasta (try the cacio e pepe its awesome)."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5ejRMcUJBEAE",
            "text": "I was way too excited to try this place because of their combination of French, Mediterranean, Italian menu, but I felt like overall flavors were good but they were not anything memorable (cacio e pepe, cauliflower, scallops, chicken). The…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6eWJidU1BEAE",
            "text": "the cacio e pepe ($18 + tax for appetizer serving) is well-reviewed, and rightfully so. tessa's menu feels intentional, and the service is very quick.\n\ni have tried many cacio e pepes, but tessa's has to be near the top of the list. its \"fancy\" features weren't there for the sake of it; that much is obvious. the basil crunch and parmesan foam were creative and genuinely added something. anything cheesy with breadcrumbs is good, and the basil made it even better. the parmesan foam had a broth texture that made the carb dish feel light. the plating was stunning. it's a must-try!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycElTZW5nRRAB",
            "text": "What a pleasant surprise:\nDecor: 5 stars, cozy and roustic.\nService 5 stars: Jess (I think) was incredibly kind, smile all the time, knowledgable and professional\nFood 5 stars: fresh and tasty\n\nAnd it was surprisingly inexpensive !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMklHampBRRAB",
            "text": "Cacio e Pepe is one of the best dishes I've EVER had.  We were able to have small plates of several dishes.  All of the food was very good; however, the Cacio e Pepe is can't miss!!  Enjoy!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNF9LYjlnRRAB",
            "text": "One of my absolute favorites on the UWS for happy hour, and meeting friends for drinks.  Sometimes we just stop in for a nice evening glass of wine. They close at 11 and all-day Monday.  Happy hour is Tuesday - Friday 11-6.\n\nTessa, owned by the same people that own Asset this location is on Amsterdam. Same cool vibe, same cool ambiance, and same great food and drinks.\n\nTruffle fries are to die for. Bursting with Flavor and topped with fresh parmesan.\n\nThe octopus was fabulous, so moist and tender.\n\nGreen Mussels are cooked in a cilantro, tomato garlic, and white wine sauce with a touch of coconut milk.\n\nI hear weekend brunch is very good too. Just a cool local place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcW9TU1Z3EAE",
            "text": "August 18, 2023 at 12:30 pm. My server whom i called my love/lovey cause i completely forgot the name was absolutely amazing 🫶 even our busser that served us our waters was amazing!!\n\nWe had a reservation here for my friends wedding they took good care of us! Even gave us a vase for the bouquet 💐\n\nLoved my cacio penne (completely forgot how to spell that) and fell in love with burratta!\n\nOverall experience here was 11/10 ☺️\n\nNote: their strawberry mimosas are fire."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNU1XQnp3RRAB",
            "text": "Recommend making reservations because we came here on Saturday night for dinner and it was crowded. Because this restaurant is amazing. Service is fast and the staff is so friendly. Great UWS restaurant where locals dine and good to bring friends or go for date night. The dinner was kind of pricey but delicious delicious!"
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd2FybFBREAE",
            "text": "Pedimos bebidas, as bebidas não alcoólicas são fantásticas (provei duas a easy pessy e mais uma), o blood Mary estava divino.\nA entrada era frango mas veio em forma de hambúrguer, achei diferente e não gostei pois no cardápio não deixava claro que seria hambúrguer, mas estava muito saboroso.\nPedimos risoto de alcachofra (sensacional) e o ny steak com purê de batata (divino).\nO atendimento do pessoal do bar é extraordinariamente bom, já o holster é grosso e antipático, o mesmo vale para o garçom, mas o pessoal que serve a mesa, abastece água e limpa são sensacionais ...  latinos são muito mais calorosos.\nO holster + garçom dava a entender que estavam fazendo um favor de nós atender 🤨🤡.\n\nÓtimo som ambiente e lugar para um TEA (tirando os dois seres mencionado acima)."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5M01fZTJ3RRAB",
            "text": "Tessa was so amazing, food was delish, Rose was ice cold and dessert was the icing on the cake. I highly recommend this place for dinner with friends or your love interest. It was safe, tables were protected by distance and dividers between…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMmVPX1FREAE",
            "text": "6 stars if possible.  Beautiful & understated in both the ambience & the food. Bronzino no bones; Subtle zest, fennel, broccoli raabe, fingerlings.  Perfect size, perfect blend of flavour.  Other parties inquired about ingredients and…"
        }
    ],
    "reviews_count": 71
}