{
    "name": "Tatiana by Kwame Onwuachi",
    "place_id": "ChIJxy0SM0xZwokR5vC0f4wVlP0",
    "grid": "MN7",
    "address": "10 Lincoln Center Plaza, New York, NY 10023, USA",
    "rating": 4.3,
    "user_ratings_total": 755,
    "phone_number": "(212) 875-5222",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUlpuVmhlR1JWVDBsQ1MzVlVOVXRCU2xvd1JsRRAB",
            "text": "Awesome experience.\nRestaurant has great vibes, great music, staff and really cool location in Union Square.\nThe Pastrami is unreal. Curry Goat Patties, cornbread w/curry butter and the mushrooms were awesome as well."
        },
        {
            "date": "2주 전",
            "language": "hr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcFR6TktOMUExVEZvNU56aHJaMnhNUkdwbWNrRRAB",
            "text": "Jaki i fenomenalni ukusi su ostali dubok trag na mene"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkZmMyZE1VRWw1TlVWRmFIVk9Na05qTVU0MU0zYxAB",
            "text": "While the restaurant is aesthetically pleasing, the service was quite average at best. We had a late reservation which should not have been allowed so close to the time that the kitchen was scheduled to close.  We were celebrating a birthday and felt very rushed.  We also could not order everything we wanted because \"they already started to break down the kitchen\" and this was especially frustrating.  Some is the sharing plates were delicious and others were not good at all. I would chance a follow on visit for an earlier reservation and perhaps midweek."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdFVERllhRmxUV1cxbGJITXlPRU4zWWxsb1dVRRAB",
            "text": "great service friendly and knowledgeable staff and very accommodating. Great place for special event the food is eclectic and delicious! Get their riff on pastrami ruben and all the appys!  The Jamaican patties were just out of this world. It's an original take on Caribbean cuisine that's sophisticated and elegant the chef really has mad skills! highly recommend"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaVNHcDZURk5EVFhkYWR6SlhXSE4zV25jNVMwRRAB",
            "text": "I had THE best time at Tatiana! Everyone who worked there was attentive and kind, especially  Neo who was helping us. He knew exactly how to provide suggestions from the small plates to the large plates, he was an entire vibe! The food…from the complimentary glass of champagne to the rum cake…WOW! We ordered the dumplings, the oxtail and crab Rangoon, the shawarma chicken (juiciest chicken ever! And the lamb basmati rice, WOW!), the Oxtail with rice and peas is a must! For dessert we ordered the bodega brownie and the rum cake. I can’t remember the names of the dishes but I will remember the experience and joy my senses experienced. What a wonderful time! I HIGHLY recommend going to Tatiana’s! Also, I read some reviews saying it’s overpriced, I wouldn’t say that. You’re getting high quality food with carefully selected ingredients to design an experience."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSFRGazRWbkZITUZodVdWZEpjbkpWZDJGaGJVRRAB",
            "text": "I was very disappointed in the treatment I received when I expressed an issue with the charge on my credit card. I  made an attempt to call the establishment and it routes to a voice recording.  I had to travel all the way to Manhattan from Brooklyn.  I didn't receive an apology for the inconvenience. I had an early flight the next morning, and instead of nearly being home,  I was  inconvenienced by an employee's lack of diligence.   My friend send me a photo of her receipt and my amount is different. It wasn't until we were comparing charges I noticed the error. I was dismissed and just given a card without an apology when I showed the manager the incorrect charge, saying nothing could be done on her end. I have attached photos as proof! Do not leave without double checking the charges!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQ2QxWnhZVkJXY1hGT2IwUnBVV0pTYkZCWU9YYxAB",
            "text": "When I'm home in the DMV, I'm hooked on Dógon, but in NYC baby, it's Tatiana! That Fried Branzino is SOMETHING SPECIAL! As you may know, Tatiani's is one of the hardest restaurants to get a reservation, but I encourage you to shoot your shot and make it your business to try to get there!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OelNsTkhNRk5FYzBaVU0zVmljMjVCYzFGV1RYYxAB",
            "text": "The food was excellent from beginning to end. We went on a Friday night & the place was full with people waiting. When you go, be sure you make reservations. The girl at the front was awesome and she got us sitted. Well worth the wait & trip there."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bVR6TTVTVEYzYjBkNVdYRlJkbVJvTjNOaFpVRRAB",
            "text": "I went to Tatiana during my birthday trip to New York, and honestly, it ended up being one of the best dining experiences I’ve ever had! We showed up on a Saturday around 3:50 with no reservation, and there was already a line forming. By 4:30, the staff came out with complimentary tea for everyone waiting, which I thought was such a thoughtful touch.\n\nRight at 5:00, the doors opened and we were able to choose between sitting outside or at the bar we went with the bar, and I’m so glad we did! The energy was perfect great music, good vibes, and the friendliest staff you could ask for. Everyone was so polite, warm, and genuinely happy to be there.\n\nWe ordered the lamb ribs, pastrami, oxtails, and curry goat empanadas. Let me tell you the lamb ribs were the best thing I’ve ever eaten in my life. I’m still thinking about them days later! The empanadas and oxtails were also full of flavor and perfectly cooked. The pastrami was just okay to me, but everything else completely made up for it. Since it was my birthday, they surprised us with a complimentary dessert a brownie, powdered doughnut, and ice cream and it was the sweetest ending to an amazing meal.\n\nBetween the food, atmosphere, music, and incredible staff, I couldn’t have asked for a better experience. If you’re ever in NYC, Tatiana is a must. I’d rate it 10/10 highly recommend!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUlJrSnVUVkJsVm05clF6Sm1iMjQwTUhCeE5VRRAB",
            "text": "I was finally able to get into this restaurant and I was underwhelmed. I couldn't get a reservation online so I got there at 4:30 with the hopes of getting a seat at the bar. However, when I got there there were already 30 people ahead of me. We didnt end up eating until 7.\n\nWe had the crab and oxtail ragoon and the goat patties for starters. They were good. We then had the branzino with the peas and rice. Peas and rice was delicious. Fish was good but just ok. We ordered the wagyu short ribs which is what I really came here for. One bite and it was the absolute saltiest food I have ever had. We could not eat it so we sent it back. Fir desert we had the rum cake which was also very underwhelming.\n\nWhen I go to a restaurant like this I like to be wowed. I was not. The meal is just ok. Not worth the wait.\n\nThe good - our waiter Christian was great. The side car drink amazing. I am hoping that Kwame's restaurant in DC called Dogon is better. Stay tuned."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tac1F6ZzFXVGhaTjBneWJsSkdXbVZ1ZVRZdFpWRRAB",
            "text": "Tough Review to write, I have been to Tatiana, 4 times.  I have another review where I give it a 5, but my latest trip was very poor.\n\nService was terrible - I had a friend who brought a 5 year old and when we sat down, we asked for french fries as soon as possible just to keep the kid entertained.  The fries took ONE HOUR. In fact we received the Piri Piri Salad prior to the fries. Also the fries were scorching hot so obviously were put in well after I requested.\n\nThe general indifference on the waiter the entire night was disappointing she did \"apologize\" a couple of times about the slow service, but it was not very sincere.\n\nShe also forgot our crab rangoon and had to put that in later as she was clearning our appetizer plates, and we had still not gotten the dumpling or crab rangoon.\n\nThe dinner was so long (mind you 1hr to just get the fries) that my entire table of 5 (minus me) had to leave around 10, given we started the rez at 7:45pm.  They could not even stay for dessert.\n\nI was given a 10 dollar goodwill discount taken off my 500+ bill which in some ways was insulting, but it was just covering the fries, kinda underscored the epic diaster of the service.\n\nTo top it off after I finished the bodedga special, the hostess came over and basically asked me if she could get the table back.  I died, laughing so hard saying how terrible my service was and now i can't even finish my dessert was literally the icing on the cake.\n\nThankfully the hostess (short hair, very nice) was devasted said she should have asked how the service was and apologized and asked if I wanted a redo and would help out with another resy.  At least she had emotion and care, and actually expressed concern, vs my waiter who was quite terrible and ruined the entire dinner.\n\nIt is going to be very difficult to get be back at the restaurant and its sad because the food is good, and the vibe is good, but bad service in NYC its not taken lightly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdlYyWjFkekpSYkhjMk5GQkNlak56ZEUxUVIzYxAB",
            "text": "Curry goat patties 👌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeFJFOWhUVm94WkZCbmRFTjBZMGRXUnpKNVZXYxAB",
            "text": "So disappointing.   It did not in any way live up to the hype.  The service was great and knowledgeable, but the food and drinks were just fine.  Nothing was stand out.  We had the hamachi, rangoon, papaya salad, pastrami, chicken and brownie.  There were perfectly fine, but not memorable, something I would want again or recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScWRUWllSV1V3UTI5c1VUaEtWVWt4UTA1bE1tYxAB",
            "text": "This place creates speechless customers. Their workers deliver outstanding performance. The setting creates natural calmness. Both the dishes and service approach were outstanding. Part of me wants to keep the crowds away."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oZllrdGFUVGRLUkU0M2FVUlRjVUp6VlhCQ2QyYxAB",
            "text": "The food was absolutely delicious, full of flavor, and served fresh. The service was excellent friendly, attentive, and made us feel right at home. The atmosphere was a whole vibe , the music was great and the space felt so cozy and welcoming. I’ll definitely be coming back and recommending it to everyone!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSFNGcDRNemR2VjBKaE9FNVZSVE5JVFZkUWJrRRAB",
            "text": "The staff is very professional and responsive Jafar is the best in the City"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTWRtWXpTMjF5TWpOeWR6SnNYMXB6VkdWblRuYxAB",
            "text": "The food is just ok.  Nothing special!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkaGRrTk5OREpoTUdZM05FZEdOV2RZUkc5emMxRRAB",
            "text": "100 dollars for some damn oxtail and rice and peas … outta you damn mind sym"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVmFXaE1iMmhSWXpOMWVFaHpMV0o2TlRkbVFWRRAB",
            "text": "I waited a year to eat here and wanted to love it so bad, but the food wasn’t very memorable. Maybe it’s cuz I’m Caribbean and expected a little bit more flavor wise and was hoping they would reimagine some staple dishes, but it was all very standard to me.The oxtail was way too sweet, the rum cake was also grossly sweet, and the Drinks were unimaginative for the price. (20$-25$)\nThe service, however, was top notch. I haven’t experienced customer service like that in LOOOONNNGGG time. They have an excellent staff that went above and beyond! They were the best part of the meal! They‘re the main reason I gave an extra star tbh. This is a great place for ppl who aren’t familiar with this cuisine, or picky eaters who only eat this kind of cuisine and want a fancy night out. Unfortunately, I could probably get food like this in my neighborhood with more flavor and for a fraction of the price."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U2NWcHpibWczWWxwR1EwTm1YM1pxYlhreVNXYxAB",
            "text": "After trying for months to get a reservation, my daughter was able to finally get us a table on my birthday. The wait was worth it 100%. The food choices all looked so good that making a choice was difficult. The rum cake for dessert is a must! Overall, the food was excellent, the staff were friendly and courteous. The manager checked on us to make sure we were having a great experience. I'm back in the \"waiting to get another reservation\" period so my friends can also experience some good food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adExUUlhNV3hyVFVGR2NWZzFOSFkwY2pkYVMyYxAB",
            "text": "Food was bomb! Customer service was great! Curry goat patties were the best. I can honestly say I got the short rib it tasted good but I cannot justify the price of it. I personally loved the chicken a lot more. It was most tasty and perfect amount of spice. I loved this place so much I went 2x in 1 week. I didn’t like that there were no reservations but I follow the instagram page and got day of reservations both times. Oxtail was more on the sweet side if you prefer it like that then you’ll love it. I would definitely recommend this place! I don’t have a photo but get the curry goat Patties, the rangoons and chicken!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSFpuY3dNa1pKVG5CME4yRlFNazFvYmxaSWIwRRAB",
            "text": "This is our favorite special occasion dinner spot. I initially hesitated on the few vegetarian options but honestly, the take out mushrooms are what dreams are made of (even for someone that doesn’t love mushrooms) and the piri piri salad is the best salad I’ve ever had. Wish it was easier to get reservations!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NM2RHRjVMV2c0V21jeVJWVlVNVFp4VDBadFdtYxAB",
            "text": "Great unique food and flavors."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Fd0xXRlljalJZVVRKWVFtRmtaM05hTVd4WE9IYxAB",
            "text": "Had the Curried Goat Patties, Short Rib Pastrami Suya, and Bodega Special for dessert. Flavor on the patties was okay, the aioli side sauce had great flavor. I can't provide 5 stars simply because $120 for short rib wasn't spectacular. As a Texan native, it did not live up to the hype. However, still good. Cosmic brownie was nothing special, not sure why it's popular.\n\nThe support staff was great but our waitress, Teresa, was not. Did not actively check on our table and had a very passive and dismissive attitude. My sister and I were having a nice evening and she ruined it, sadly. However, the food was still overall good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaFJrZFdkMmhmYkhsQ09VNWpZbGxFTUdsdlNFRRAB",
            "text": "Each dish was superb, loved the okra, BBQ collard greens, pastrami and the lamb. Great vibes. Kudos to the chef for the unique taste of each dish."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNVdHVlFkbm8zZVhSSGFIUjVWa00yVmxWb1JWRRAB",
            "text": "Tatiana by Kwame Onwuachi is a culinary triumph. More than a meal, it is a celebration of African American culture and cuisine uniquely interpreted through the lens of New York. The food here is bold, thoughtful and reverent with each dish telling a unique story. Its more than nostalgia, but heritage and tradition reinterpreted for the modern era.\n\nThe cooking here insists that African American food belongs in the same conversation as other haute cuisine and is comfortable on the city's most competitive stage. The unique juxtaposition of Tatiana within Lincoln Center is itself a statement, with its stark style and urban cultural influence (from the Bronx to Harlem) standing alongside an institution that was synonymous with European high art such as opera and ballet.\n\nThe dishes here a refuse easy categorization and there are elements of Africa, the Caribbean and New York simultaneously fused together. Must tries include the curried goat patties (a wink to Jamaican and New York street food), dukes shrimp (a throwback to shrimp boils from deep south), wagyu pastrami (an elevated and indulgent version of a deli staple) and the cosmic brownie with powdered donut ice cream (a bodega homage).\n\nThe energy in Tatiana is equally buzzy and feels closer to a nightclub or block party than a fine dining restaurant. The playlist is immaculate, sampling R&B, Hip-Hop and rap greatest hits from the late 90s and 2000s (think TLC, Jay-Z, Neo, Destiny's Child, J.Cole) which adds to the atmosphere and performance.\n\nI will caution that the demand for Tatiana is insatiable and the kitchen and dining room operate at full capacity at all times. Reservations are still hard to come by (be prepared to book your table the second it opens on Resy) and be prepared to wait when you are there (for your table, to get drinks, to put in your order, to get your cheque, etc). Like many of New York's most in demand restaurant, there are most guests than staff which easily overwhelms the kitchen. But staff here are sincere and hardworking and try their best to stay on top. Also budget approximately $150/person with tax and tip. Make no mistake, Tatiana is still a fine dining restaurant."
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OV1dYVktSR0ZGVkdZM1RtUm5VV1JhV0RscGFFRRAB",
            "text": "Würde ich diesen Ort empfehlen? Nein. Ich habe sehr gut gegessen finde es aber überteuert sogar für New York. Nichts gegen Clubvibes aber ich möchte mich im Restaurant nicht über den Tisch hinweg anschreien müssen. Irgendein kleines Licht auf dem Tisch wäre nett gewesen,denn Essen ist auch ein \"Augenschmaus\"."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGclpETjRWR3RtU2xWak1sTlFjMDFsWTJ3M1luYxAB",
            "text": "Went into this restaurant as a walk-in. Guests standing in line with no reservations , like us, were treated nicely, and were seated indoors. We were offered a seat outdoors/ or on the high top. Even though we stayed it’s our special day, and that we are celebrating our anniversary. This is discrimination by the restaurant. You can never get a reservation through Resy. I recommend please do not go to this fancy restaurant unless you face a real reservation. The manager was totally rude and didn’t care. We left, due to the poor quality treatment we received."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQmNtNXZUM1pPU1RFdFpVTXRNak5RYlZkRE1rRRAB",
            "text": "Awesome meal and experience at Tatiana's! The curry hoat patties, branzino, oxtail, and peas and rice were absolutely delicious. The service was also impeccable. Kudos to the hostess Darnelle (sp) for a pleasant welcome and send-off and to Carla P. for her top-notch service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todVIxSXpMVXR4YTNOUFNWQTJXVTVUV0hocGRFRRAB",
            "text": "We had an amazing experience at Tatiana! It really lived up to the hype. We did not have a reservation, so we waited in line for the walk in seats, arriving at about 3:40. We would’ve explored Lincoln Center more but people were lining up so we did as well. I thought they handled the line so well. The host team lead by Darnelle were super hospitable and helped get everyone in the line seated. Our waiter Francisco was great as well and the team service structure made for a great experience. We loved the crab & oxtail wontons, cornbread, bbq greens, shrimp and the bodega brownie with the donut ice cream. Exceptional food and service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdVJtb3lOM05TU1ZCVlkwMWZWREZQY0hkSVRFRRAB",
            "text": "Horacio was a great runner he deserves to to be a server. The food was good, but overpriced and only two bathrooms.\n\nWiley. Darnelle and Miuset were helpful in the front"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSk9HVkVXSHBFUnpaa05HUk1SM1ZHWmtGQ1RHYxAB",
            "text": "I had dinner here on 8/28; the total experience was a 10/10. The service was amazing, and the food was exceptional. We ordered the Jerk Lamb Ribs, Honeynut Piri Salad, Short Rib Pastrami Suya, Oxtails, and the Bodega Special for dessert. Everything was extremely flavorable. I wish it was easier to make a reservation, but I hope to be back in the future!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5b2NtZFFXVVJWWm5kSFYySnhSREExUWpnMUxVRRAB",
            "text": "i’ve been trying to get a reservation at tatiana for about a year now. finally i gave up and just decided to show up as a walk in. i showed up on a thursday at 4pm, there was already a line but it wasn’t anything too crazy. we got seated at around 5:10 which was way better than i expected.\n\ni already knew that walk-ins got seated at the bar so i was ok with that but we got seated in an awkward spot that didn’t even have enough space to place our shareable entrees. we asked our server if we could be moved since other walk ins who were standing behind us line got better seating options (an actual table or outside patio seating). we were told no so i decided to not make a big fuss about it since i was so excited to even get a seat. my annoyance returned when the party of 2 who was sitting next to us in the awkward seating also asked to move and they were accommodated with a better seat in the patio section. it either comes down to who you ask or this restaurant just picks and chooses who to accommodate. this same server also came to refill our water cups during dinner. he reached over our dinner plates and accidentally spilled water outside of my cup which created a puddle in the already small table. he didn’t bother to wipe it up and just walked away and never came back again.\n\naside from the service being questionable, i will say that the food was really good. the oxtail is a must and the chicken shawarma was seasoned to perfection. The cod with the cornbread was also delicious. i was also impressed with how big the portions were for the large entrees.  i don’t see myself coming back because getting a reservation is too much of a fuss and the walk in process requires some planning but im glad i came and crossed it off my list."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xseVpHbEZYM0kyV0dRMVdVODBVMVpHTjFVeVMyYxAB",
            "text": "If you do just one thing—book a reservation and be ready to splurge a little. The presentation alone is worth it, but fair warning: vegan and vegetarian options are limited and come with a hefty price tag. I went with the Take-Out Mushrooms, which were bursting with flavor, and that plum sauce? Absolutely heavenly. Still, at $52, it felt a bit steep.\n\nI wish sides were more accessible. The coconut rice was delicious, but for 4 people ordering 5 small plates and 3 large plates, only receiving two small bowls felt a bit skimpy. A vegetable-forward option would have been a welcome balance to the protein-heavy menu.\n\nThat said, every bite was delicious, and I’m already looking forward to my next visit.\n\nFollow my instagram page @beyondbiteswithdes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdExYUk9TVUV5YlhwS2R6TnlTRFpmU1ZsUVJYYxAB",
            "text": "magic"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TWRrdGhWVEJFWWxGcFQyTlJZa0ZTTWpSSExXYxAB",
            "text": "We got there at 4:00 for four people and waited in line, about 5 parties in front of us! We got seated by 5:10 (opens at 5) - the patio was beautiful and weather was great! Service was prompt and drinks were 9/10 - so long story short food was pretty okay, it wasn’t mind blowing but it wasn’t bad it was like a 7/10! I would come here again but I wouldn’t wait for it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVU1XWjNXVUYxZEVwMmVIVnJaVlJDWkc5c1dYYxAB",
            "text": "Finally, after trying for over a year, I made it to Tariana. It did not disappoint. From the momenrt we waited online ( for an hour), we were greeted with sorrel drinks on line.\n\nWhen we walked in, the host asked if we’d ever dined there before. When I said no, the host said, “well, welcome home”.  The foods, the smells, the spices felt like sittimg st home in my mothers kitchen. Tbete were tastes and spices quore familar to me —- thyme, cumin, molasses, curry, Soices thst wete commonplace in my Trinidadian home as a child.  But there were other flavors. Flavors I cane to know as an adult, that extended those familar flavors — cilantro, corriander, tumetic, and more.\n\nThe staff were warm, smilimg and welxcoming. The food was out of this world. You must check out Tatiana’s. It’s no coincidence that it was named the best restaurant in New York City. Go!  Quickly!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMFRqaEpWblJGYzFGMFJFaFNlVFpJVG1ObmEzYxAB",
            "text": "Worth the hype"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOeVZqQlVkMGsyUXpGUVpIbFhiMWswVmpOU2NIYxAB",
            "text": "Last minute Resy notification for the win\n\nHaving this on my hit list for such a long time and finally able to score a reservation was a pleasant surprise.\n\nLocated in Lincoln center an upscale dining experience that leaves you wanting more but also needs room for improvement.\n\nArrived a few minutes early so we had to wait in the waiting area but was promptly seated at our reservation time.\n\nThe decoration feels somewhat of a mix between upscale & lounge. The music is really loud so if you're here for an intimate place for you to speak and have dinner with this may not be the place for you.\n\nThe drinks were mixed well & they don't skimp on alcohol.\nThe curried goat patties weee extremely delicious, packed with meat (pause) & had a ton of flavor\n\nThe eggplant was just ok, nothing really stood out about it. Lacked just a bit of flavor but overall an ok choice.\n\nThe braised oxtail were delicious, tender to the touch and had bold rich flavor.\n\nThe short Rib Suya was excellent, tender, not dry and the bread and sauce on the side complimented everything so well.\n\nThe dessert was good, a twist on child hood snacks that mimicked it very well but tasted better than the originals.\n\nThe only downside I can say is that the restaurant is VERY loud & lively & service is very slow. Waiter pops around maybe every 15-20 minutes.\n\nI would love to visit Tatiana again but maybe would keep it as a place for celebrations/ special occasions."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vemFGcEtXbGN3ZUhGTlVYQkZWR1YwWWpWamMxRRAB",
            "text": "Always delish my fav place in NY"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSk16WnpOMUp1TFY5cmNHNU5lUzAxUVRsUGEwRRAB",
            "text": "I’ve been trying to secure reservations at Tatiana for several months - no luck. On an early Saturday  afternoon I decided to try my luck as a walk in. I was the first on line and a solo diner\n\nApproximately 10 minutes before opening the restaurant gave out a complimentary hibiscus iced tea ( nice touch, refreshing & well needed after waiting over an hour outside) even though I was the first in line, I was not the first walk in to be seated. The host stated they had to seat the tables first ( people who were behind me with no reservations were seated first and I was seated 30 minutes after opening ( that’s 1.5 hours of waiting on line)\n\nA different host escorted me to the bar area for my solo dining and informed me that it had a 90 minute dining limit. The bartenders were attentive, efficient, made great suggestions and checked on me frequently.\n\nThe restaurant itself was beautiful, lovely chandeliers, clean and great music\n\nFood: I opt to start with a glass of their sparkling wine ( Albariño $22 per glass) the curried goat patties (3 patties accompanied by 2 different sauces $26) , the braised oxtail (3 large pieces of meat & a side of rice & peas $58) & the golden rum cake ( $18) with an espresso martini ($21)\n\nWas the food good? Absolutely. The patties were flavorful and the sauces complimented the goat well, the oxtail was fork tender and melted off the bone. They say the large dishes are meant for sharing but I could eat that dish & another without sharing\n\nPrice point- definitely a treat yourself restaurant especially due to the location it is in. Total bill without tip was $158 was a solo dinner\n\n10/10 would return"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMVVFZGxhbVZNVlVOTExUVk1UVlEwWW0xRWRVRRAB",
            "text": "I’ve heard mixed reviews but I loved it! The food was imaginative and delicious. The space was lush and lively and they were playing all the R&B hits from the late 90’s. Our server, Beatrice, was a gem - always ready to top off my wine and bring us little extras. Glad I finally made it in!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paM1QzTkNRV1U0VmpCZk4weG1TVzAxTFdWT1NrRRAB",
            "text": "My daughter and I decided to visit Tatiana for my daughter’s birthday 8/16 (Leos rock!). We waited for about 1 & 1/2 hours outside because we could not get a reservation. However we were determined.\n\nThe food was amazing! We had the patties, cod, jerk ribs and the wagyu with cabbage. We had the mango guava nonalcoholic drinks then Appleton rum drink- felt like I was in Jamaica with the patties. We were encouraged to have the okra- I hate okra. Short story short- I will be eating okra at Tatiana’s- maybe get recipe too lol! The service by bartender Cesar, was informative, knowledgeable and attentive. He took excellent care of us. Thank you Cesar- you’re the best!\n\nThe environment was a little like a club and I’m more of a classical or Sade dinner background kinda gal. Despite would go there again and again because the food is everything"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNldtSXhXVnBPTUZaZlRVTm5SbXBYT1c1aVUyYxAB",
            "text": "I really have no idea why this restaurant is popular … food was mediocre . Considering the price , it’s terrible.\nGOAT curry puff - I truly believe you can find better taste on food trucks\nShort rib and oxtail : well, If you’re curious about how the best cut of meat can taste awful, those are perfect dish for you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abFdVMXlUazlMUkdWMmVsTm5RWEJ6UTB4Q09WRRAB",
            "text": "I thoroughly enjoyed myself at Tatiana’s I was greeted by a friendly hostess who offered me a hibiscus beverage while I waited to be seated. The ambience was great and the music really set the tone. I would suggest ordering the curried goat patties the crust is so flaky and the meat well seasoned. Also the branzino fish is a must have. I would also like to Shout out my waiter Neo he did a great job 10/10 experience. Would definitely come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbE4zRTNRbE4wYjJWdmJFOTRXbGN6TjFCWGRIYxAB",
            "text": "was in for NYC for a book signing and it's been my mother's dream to eat here after watching Chef Kwame's docu on Netflix. Fingers were crossed for a table and the amazing hostess made it happen. Caesar, our server was incredible and I had the opp to speak to the culinary director and God bless her for the gems she shared as I am a new restaurateur. The food was a 10/10. We had the Tatiana Sidecar, curry goat empananadas, oxtail, collard greens and the oxtail and crab wontons. WOW WOW WOW! Can't wait to come back. The energy, the vibe and the playlist made for a beautiful evening that me or my mother will never ever forget."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTmFsWjBhRVZZZW14WWVIUTNaSGRMZDNGNVNtYxAB",
            "text": "I was excited to eat at your restaurant and finally had the opportunity to visit on August 9 at 9:30 PM. I shared my excitement with both the hostess and our waitress—I truly felt like a kid receiving a birthday present after all the great reviews I had read and heard from friends who have eaten here.\n\nAfter ordering my food, I was taken aback and offended by the music being played. In one of the songs, every other word was “nigger.” Growing up—and even to this day—I have been called this word by white individuals. Hearing it in what I expected to be a welcoming dining environment was painful and upsetting.\n\nI understand that some artists may choose to use the word in an attempt to reclaim or demystify it. However, as the owner of a business, I believe it is important to consider how this affects your customers. Playing music with repeated use of this word can make people think it is acceptable to call a Black person “nigger,” and it is not okay.\n\nWhat made this worse was the reaction of your staff when I shared my concern. Instead of showing understanding or empathy, they responded with a dismissive “oh well, you can leave” attitude. This lack of care for a customer’s feelings is unacceptable and deeply disappointing.\n\nI hope you take this feedback seriously—not only in reviewing your music selections, but also in training staff to respond respectfully and thoughtfully when guests share concerns. I wanted this visit to be the first of many, but the experience left me feeling hurt and unwelcome."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodGNGbzFMV2hUWVdGSGRsazBVa3BDWlhONFRWRRAB",
            "text": "Wow. What a terrible dinner decision. We came for a pre fixe dinner for a large group and the portions were ridiculously small. T\nI mean the rice portion for a party of 8 was what I would serve my toddler. Rice! How much is rice? The oxtail main had enough on the plate for a few bites/person or one oxtail piece. The second main was giant prawns and there was one for each guest. I'm not sure how one fills up on one prawn and one oxtail. For a dinner that cost about $300/person. Yikes!\n\nTo top it off, the service was clumsy and grumpy. We requested to speak with the somm. We ordered two bottles of wine based on food choices and somm recs. The first bottle the server brought out was incorrect. The second bottle we waited and waited for it, but it never arrived and no server came over during the prawns and oxtail course to inquire about it. It turns out it was just sitting on the  the serving station. After all the food was done, we asked about the second wine and they seemed astonished that no one served it. The hamachi which was an appetizer came out after dinner was complete which seemed odd and chaotic. The food was tasty, but not worth the hype or the price. We chose this over La Bernadin and feel very disappointed as Eric Rippert is my favorite chef."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25relNHZFhRVWRLT1ZWTFJHc3dZV3c1Y1RSbmNHYxAB",
            "text": "What a terrible dining experience. We came here with a large group and the somm was completely useless and out to lunch and the good was not prepared well. For nearly $350/person, we would have been better off at SO many restaurants throughout the city. Skip this restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5T2QwWTVSR1EyZFc5NWJUSjZiV1I0VkVWME4wRRAB",
            "text": "Tatiana by Kwame Onwuachi is one of the most celebrated and award-winning restaurants in New York City. Featured on lists of the best restaurants in the country, praised by The New York Times and Pete Wells, nominated for a James Beard Award — and honestly, every foodie I know dreams of getting a table here.\n\nMany of my friends have tried to book and failed. We got lucky thanks to a friend: he went to the bar, spoke with the manager, and got a tip — come at 4:00 PM, one hour before opening, stand in the walk-in line, and you might get seated. He did exactly that. I joined at 5:00, and by 5:40 we were sitting on the patio. At first, we were a bit disappointed to be outside, but it turned out to be perfect — the dining room was loud (music, conversations, dim lighting), while on the patio it was bright, calm, and quiet.\n\nThey say people often come here before a show at Lincoln Center, but we made the trip just for the food — and it was absolutely worth it. The crowd was stylish, with guests in beautiful dresses and suits — a very nice dressed-up crowd.\n\nOur waitress (wearing striking silver-framed glasses) was fantastic and guided us through the menu so well we couldn’t resist her suggestions. The star of the night was the Short Rib Pastrami — marinated for five days! Served with caraway bread, braised red cabbage, and mustard sauce — you assemble your own sandwich. The portion is large, perfect for two. At $120, it’s the most expensive dish on the menu, but worth every penny — every table seemed to order it.\n\nAs for starters — you can’t go wrong with any. We especially loved the “wontons” filled with crab and oxtail. Every dish came with its own unique spice profile: sorrel here, celery there, a twist on mustard, hot pepper, paprika… Many flavors felt exotic and warm, with clear African influences. Everything was incredibly tasty and made with top-quality ingredients.\n\nService was outstanding — the manager poured us a glass of wine to celebrate the fact that we made it in. We stayed for hours, even though the short ribs took a little longer to arrive. The space is beautifully designed down to the restrooms, which have great music and lighting.\n\nHighly recommend!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNWJIT2l3RRAB",
            "text": "예약하기 힘들지만 음식이 기대만큼 맛있었고 개성있고 멋진 분위기도 좋았습니다. 시간적으로 여유가 있는 분들이라면 한번 방문해도 좋을 것 같습니다."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OVlMUU1BEAE",
            "text": "맛있어용  조금 생소할수도있어요\n지인은 어색해 했어요"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sdk5FVkpUbkJzZEZwdE5XbDBWMnR0VEZsNlRIYxAB",
            "text": "Tatiana by Kwame Onwuachi lives up to the hype and then some. We came to celebrate a birthday and were treated to a truly memorable evening—from the surprise glasses of champagne to the polished, attentive service. The cocktails were refined and perfectly balanced, and every dish was a knockout: inventive without being gimmicky, visually stunning, and deeply flavorful. This is high-end dining rooted in culture and storytelling, with none of the pretense. The space is bold and beautifully designed, matching the energy and ambition of the menu. A must visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdGNVSlRXbTE2VUVSS1YwTXllRUUyVFVRMmRuYxAB",
            "text": "Decent food that's a bit overpriced. But atmosphere and food was fun.\n\nWe didn't have a reservation so we lined up about an hour before on a random weekday. There were already a few groups in front and the line got pretty long about 30 mins before opening. Reservations were prioritized at opening so we had to wait about 10 mins or so. We just missed the first batch at the bar but they had space on their outdoor patio.\n\nService was decent and food came out quickly. Others have mentioned, but the prices are pretty high (especially considering there have been a few price hikes in the past year with no menu changes). Our favorite was the goat curry patties and the fish. We'd definitely order both again. Pastrami was interesting but no way worth the price tag (I wish the serving size was smaller too). The side of sauce was delicious and added a good heat on everything. Dessert was okay, looked better than it tasted. Donuts were too hard and brownies were simple.\n\nWe probably won't come back but glad we visited."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJUzgtSWl1M0lHRGNBEAE",
            "text": "To answer your question, yes, Tatiana is worth the challenge of getting a reservation. It’s one of the most memorable dining experiences I’ve ever had. The food, service, sexy ambiance and incredible hospitality make this one of New York’s best restaurants. We went against most reviews and didn’t order the ox tail or pastrami. We ordered the crispy curry eggplant and oh my god … it was spectacular. Coming from someone who avoids vegetables at all costs this is high praise. Tatiana does sauces so well. We ordered the grilled shrimp and the sauce, once again, made it a lick-your-plate-clean dish. What’s hard to convey in this review is how warm the hospitality was during our visit. The hostess was so kind and wished me and my wife a happy anniversary twice. Chef Onwuachi was there and took photos with us and even sat another couple at their tables. This place is a NYC treasure."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOWFg0cWIybDRuSlF3EAE",
            "text": "Finally got a Saturday reservation after a few tries on Resy—totally worth it. Service was warm and top-notch from start to finish.\n\nMust-try: the curried goat patties. Crispy, flavorful, and the sauces (especially the mango chutney) were incredible. Lamb rib had a smoky BBQ twist I wasn’t expecting but really liked. Oxtail was super tender—rich and spicy, though a bit oily. Branzino looked great but was just okay.\n\nThe vibe is vibrant and Afro-Caribbean—great music, stylish decor, and dishes that tell a story. Pricey ($241 for two with drinks), but it felt special.\n\nGo for the food, stay for the atmosphere—and don’t skip the goat patties."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cFVXOW1hWFpsYkZCNFIxWmFNVTB3TmxRemRIYxAB",
            "text": "Wait time was around 20 minutes for us. Everything we ordered was delicious, the depth of flavors was incredible. I’d recommend everything except the chicken shawarma,not because it was bad, but because there are much better options on the menu in my opinion"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNGEyaG5VbGxaWWpWS2FHRkpkakZrVjNWQ01sRRAB",
            "text": "Very average meal, not worth the hype. It took 45 min for the first small dish to arrive which is definitely the longest I’ve waited ever in NYC. It was also extremely loud in there. I will say that the curried goat patties were great. The oxtail was gummy, and its sauce was way too sweet and thick."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJN3EzVTBnRRAB",
            "text": "Somehow snagged a 5:15pm reservation on a Wednesday, so it was an early dinner but worth it. Our waiter first checked with us if we had a show to attend - we didn’t, but this was a thoughtful touch. Two of us ordered 2 small sharing plates and 2 large plates. I think we could have done three small, 1 large as the chicken especially had a much bigger portion than expected.\n\nDefinitely get the curried goat patties. I also really liked the crispy okra. The oxtail was delicious, but surprisingly I preferred the sofrito roasted chicken. As for dessert, you know we had to do the cosmic brownie. I don’t know how they make the ice cream taste like powdered donuts… it’s a culinary feat!\n\nThe only con for me - I thought the host service lacked a bit of professionalism. We were seated at a table for two and asked to move shortly after. When I asked why, they said the table needed to be pushed together with the one next to it so that four people could sit there. The tables were never pushed together, nor was a party of four ever seated - only 2 separate parties of 2. Additionally, when we got our coats from coat check, they didn’t realize I had left a bag with them as well. I slightly had higher expectations of that service for such a highly sought-after restaurant, hence the 4 star review. The food definitely earns 5 stars though."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNVNFaHBabXR1VW1WVGIyOUZXVGhhYlhBME1IYxAB",
            "text": "Tatiana comes off as gimmicky at first. Reservations are difficult to get—constantly booked out within minutes. I managed to snag a 5 PM table by refreshing Resy exactly at noon. When we arrived, there was a massive line outside for walk-ins. Ironically, the dining room was mostly empty when we walked in, so if you can’t grab a reservation, I’d still suggest trying your luck by walking in and waiting.\n\n2 girls, 2 appetizers, 4 entrees, and dessert.\n- Curried Goat Patties: Flavorful! Solid start!\n\n- Hamachi Escovitch: Light, refreshing, and perfectly balanced with a delicious purée.\n\n- Fried Branzino: Not bad, the sauce was overly sweet for my taste. Pay $4 for Winston’s Peppa Sauce (bonnet + jalapeño). I was obsessed. It completely transformed the dish and paired so much better!\n\n- Short Rib Pastrami Suya: The holy grail—an absolute highlight of my evening. Incredibly tender, juicy, and packed with flavor. Must order! This will change your life!!! It came with coco bread, which I didn’t like.\n\n- Mom Duke’s Shrimp: Three head-on shrimp, grilled and basted in butter. Slightly overcooked, but the aroma was amazing.\n\n- Braised Oxtails: I love oxtail but the sauce was not it… however the oxtail itself was fall-off-the-bone tender.\n\n- Bodega Special: The brownie itself was just okay, but the ice cream? Amazing! Tasted exactly like a powdered sugar donut—truly mind blowing!\n\n- Rice & Peas: A bit mushy and on the sweeter side—not my favorite.\n\nOverall, the meal is definitely on the pricey side, but the service was exceptional. The server made great recommendations. Worth experiencing at least once!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMNzl2S2pGeFkzQ1BREAE",
            "text": "After over a year I finally made it to Tatiana’s NYC.  I still was not successful with getting a reservation but was able to be a guest on someone else’s reservation. WOW! As with most things there are pros and cons. Not many cons so cons first. The portions are small for the price. Also they don't bring all the food out together? Meaning all the appetizers come at different times, and all the entrees arrive at different times this is weird and inconvenient. The music was a little loud. The tables are on top of each other, you literally have to squeeze to walk by. Now the Pros: Yes the food is amazing. Giving your palate a party filled with flavor. We had a lot of food at our table everything was great. We had the pastrami, bronzino, oxtails, lamb, curry patties, salad, rice, coconut buns, donut dessert, cheesecake that looked like a brownie, and another dessert I can’t remember the name of. Also my friends had cocktails I don’t know what but they enjoyed. I only had water. The atmosphere is beautiful and up beat. The restaurant is on the smaller side. The staff is very professional and accommodating. They checked on us a lot and explained the dishes to us in detail. Over all, of course I would recommend if you can get a reservation. However, I would only return if I’m invited on someone else’s reservation again. I'm thankful I had the experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOWFleUpnEAE",
            "text": "I thought the food was amazing. It’s exactly my palate. We got the cornbread, okra, goat patties, pastrami and oxtails.\n\nThe pastrami is one of the best bites I’ve ever had as someone who loves pastrami sandwiches. Okra was outstanding.\n\nThe other dishes were great though not as perfect as the other two. The cosmic brownie desert is excellent and an absolute must. The portions are relatively large though on the pricey side.\n\nThis place is pricey but it is significantly upleveled food. Felt like a Masterchef finale 3 course meal for someone showing an NYC experience. Would 10/10 come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMk5ETlJlSGhLYjNkcFpFOU1SbVZ6U1d4MVJuYxAB",
            "text": "I already had very high expectations in anticipation of dining at Tatiana. I read Chef Kwame’s book and was not only intrigued by his unique style of cuisine but his journey to fame and what inspired his dishes. He grew up in NYC and would commonly eat food at the bodega around the corner (as any true new worker would), so most of his dishes are influenced by bodega fan favorites. We ordered the pastrami (120.00) and it was 100% worth the hype!!! I’ve never had anything more succulent and delicious. The bread was airy, buttery and dense all at the same time. We tucked the meat inside of the bread with the pickled cabbage and aioli sauce. Incredible. We ordered the goat patties which melted in your mouth, and the flakey crust of the patty gave it the perfect balance of crunch and chew. I could have ordered another plate, haha. We then ordered the cosmic brownie which was paired with a powdered sugar doughnut ice cream. In all honesty, my only gripe throughout the entire night was the brownie. It was just mid, although the ice-cream was SPOT ON. This one went viral for some reason and I am not sure why. Probably because it was a take on the classic cosmic brownie you’d eat as a child, bringing up major nostalgia. Anyways, the service was great and their cocktails were creative (although small for the price). We waited in line to put our name down and only had to wait a few hours, so we got a drink around the corner. It was a perfect outing. THANK YOU TATIANA FOR EXISTING!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbU92ZTVBRRAB",
            "text": "Tatiana absolutely lives up to the hype!! It’s definitely worth the hassle to get into, whether you manage to score a reservation or try your luck with an early walk-in.\n\nI’m still thinking about the curried goat patties and the short rib pastrami; both were out of this world good. Even the black bean hummus, which sounds so simple, was mind-blowingly delicious. My only regret was getting too full and not trying the cosmic brownie for dessert. No doubt the food is pricey here, but a great place for a special occasion.\n\nService was also excellent—attentive without being too overbearing. Highly recommend if you're looking for something special and truly unique in the city."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJX0gyUGl0cXZhTUNBEAE",
            "text": "From the moment I arrived, the hostess (I’m so sorry I didn’t catch her name) made me feel incredibly welcome and even chatted with me while I waited for my table. Her warmth set the tone for the evening.\n\nThen there was Neo—what a phenomenal employee! He took exceptional care of my table, delivering top-notch service throughout. The way he presented each dish and explained what everything was—absolutely impeccable. His recommendations were spot-on and truly enhanced the experience.\n\nTatiana’s is lucky to have such a dedicated and professional team. I’ll definitely be coming back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcmdtc09aMGFLcUt3EAE",
            "text": "5/5 for me cause the service is top notch and extremely attentive, fun to chat with, and always made sure our table is clean and cups are topped up.\n\nFood here is very solid with great ingredients and fine flavors! It’s the overall experience that does it for me! I love it and would 100% be back to Tatiana!\n\nFor walk-in, the restaurants opens at 5PM so line up at around 3:50-4PM to guarantee you will be the first batch in!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bExlOE9REAE",
            "text": "Tatiana’s in NYC is a vibe for Caribbean inspired dishes! Scored a late reservation for a group of five, including two birthday celebrations, and everything from the service to the music was on point. We were seated within minutes and taken care of all night.\n\nFood highlights:\n•\tCurried goat patties – absolutely the best dish of the night, would return just for this!\n•\tJerk lamb ribs – flavorful and juicy.\n•\tChopped cheese special – another top favorite.\n•\tMom Duke’s shrimp – big, bold flavors (but still in the shell).\n•\tFried branzino – tasty but be cautious of bones.\n•\tCornbread with honey butter – simple but delicious.\n•\tShort rib pastrami suya and bodega dessert – skips for me, but not deal breakers.\n\nIt’s lively (sometimes loud), but the energy is great. Highly recommend if you can get a reservation—perfect for a fun night out or special occasion."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQlh6UkNZM2gyYTJkNmJVRmlPR1F5VW1KVFkzYxAB",
            "text": "The curry goat empeñadas/patties were great and a little spicy... but, we ordered a drink and our server forgot about it.  The lamb jerk ribs weren't available because kitchen was out.  We ordered cosmic brownie AND cheesecake. Our server forgot about the cheesecake. We paid for it anyway and took it togo."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3c19ET1VBEAE",
            "text": "Tatiana's 100% lives up to the hype. Upon arriving the staff is friendly and ready to greet you with a warm smile. Servers were extremely attentive and personable. Curried Goat Patties stole the show out the gate. Crab Rangoon I could live without but the pastrami is definitely worth ordering. The Bodega Special with a coffee was a perfect send off to an amazing dinner. Can't wait to go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20welVrczBUbnAyU2toRVlYQnFSVWcwYWs5MlJFRRAB",
            "text": "Not very sure why this restaurant gets so much hype - it’s above average but not mind blowingly good. Stood in line at 4.45 till 5.30 to be put down for a 7.30 table. At 7.30 we still had to wait about 10 minutes to be seated. All dishes felt overpriced but especially the Wagyu skewer and the suya. Flavors were not as refined as I had hoped. Overall, this can be deprioritized in your NY restaurant chase."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaVVHOXdjMUZEVm5SM1NWRlhaek5rWTJwU2ExRRAB",
            "text": "Listennnnnn!!! I had been wanting to get into this place for foreverrrrrrr! It was worth The Hype and standing outside at 5p in line then after an hr make a reservation for 8:30 at the bar guys mit even a table lol lol It's difficult to get into this place. I loved everyone here. The staff was phenomenal. The Hostess was so adorable and the Bartenders Christian and Caesar were so warm and welcoming. Love you guys! Thanks for this culinary experience!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeFRFWnZNamQ0VjNSVFRXcEZkVEpDZW5WVlMwRRAB",
            "text": "Cesar and Talia were amazing. Talia sat us at the bar area and we met Cesar he was so attentive and customer friendly. The experience that I had there was the best I have had in a very long time. We had Goat empanadas that tasted like back in the day pastry. I will be back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSelgyZDBWa0ZOZW5aWlpFZGtPRmR2YjBwcU1rRRAB",
            "text": "My partner took me here for my Bday yesterday when I tell you everything we ordered was just Amazing delicious and so tastey our Waiter Carla was absolutely the best she knew everything in the menu and explain to us what everything was ! We order variety of dishes I highly recommend this restaurant to anyone one we sat out in the Patio beautiful weather and the atmosphere beautiful I will be coming back to taste the rest from the menu !  Thanku so much again to CARLA!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dFBtU2R3EAE",
            "text": "Mission impossible! I got Lucky w standby reservations the weekend while visiting nyc “Tatiana” was the only food spot on my to-do list & it did not disappoint. We tried curry goat patties, chopped cheese, oxtail dish, rum cake!  The patties were my fav, goat seasoned and cooked to perfection. The truffles gave the chopped cheese a really nice flavor. Now about these oxtails:  mines had more fat then I’d care for, I need my oxtail in a stew or ragu—off the bone w a hint of veggies at that price point. I dont want to clean spiced sticky sauce from under my nails for $130 a person!! The gravy was decent but very one note and the rice portion was slim considering my hubby is Jamaican and these are shareable portions. Rum cake was 10/10. Very pricey but the vibes & atmosphere along w excellent service measures up. Lower rating of my experience due to oxtail preparation—it was giving someone ran out of time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvczRDeGNnEAE",
            "text": "Top Chief Super Fan and Kwame is one of my favorite chiefs...waited on line as a walk-in #worthit!!! The food is amazing, our server Chris is a rock star, and I just love the vybe of this restaurant. The attention to detail and flavors are top-notch. Chief Kwame's contribution to the Pan African Diaspora through food is a love song to our ancestors. Can't wait to visit again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oR1gxcEpjMWxyUVhORVJ6WkZNRXgwTFRJeE4wRRAB",
            "text": "Amazing experience! Our server was Carla and she was awesome. She gave us amazing recommendations and was very knowledgeable. Our favorite items were the oxtail and crab rangoon & short rib pastrami."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbURuTzdwbDhxUHpnRRAB",
            "text": "The curry goat patties and piri piri salad will forever haunt my dreams. I sat at the bar and the bartenders guided me through the menu and made great gin cocktails and were super kind. I would like to move in here and sleep on a pillow of curry goat patties."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbWJhcVRREAE",
            "text": "I would first like to say I love Chef Kwame. I use to eat at Kith & Kin and was devastated when it closed. I was able to go to Dogōn two weeks ago and LOVED it.. simply phenomenal. So when I got reservations for Tatiana I was so excited… then we were seated. The food and service was so terrible we are convinced we went to the wrong place😭. The waitress did not speak to anything on the meal other than stating ingredients. No recommendations, no must try’s, no best rated courses, etc, she checked in on us maybe twice?. We ordered the Ragoon, Goat patties, and Wagyu. The ragoon tasted like it was either fried in old oil or burnt oil or it sat in oil too long but the shell was dense and heavy. The goat curry in the patties was good but the pastry on the outside was dry? The wagyu suya was just salty and the coco bread that came with it lacked flavor. I made it into a sandwich like suggested but one being over seasoned and the other having no season did not balance out. The highlight of my evening was the hostess (fair skinned, short black hair). She was absolutely lovely and the only reason I gave this review two stars and not one. Beyond disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNE5HYzBiRnBFWjBvM1J6VkVlVmN4VUhGd1lYYxAB",
            "text": "I just… Lord have mercy! The atmosphere is always an amazing vibe, but the food! It’s going to get somebody hurt, SERIOUSLY! Those goat patties (I would have never in a million years tried a goat) is something I dream about to this day! The crust is just… omg! We loved the oxtail & crab Rangoon and the star of the show after that is the fried Branzino! Seasoned to perfection!\n\nWe didn’t really care for the mom’s shrimp. Oxtail was fine! Oh and the cornbread is always amazing and is now served with caviar (which I have a complaint about that, please place it back on the menu and serve it alone with just the butter with more pieces because it was only (1) piece cut in half (I couldn’t believe it))."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3emJIRFhnEAE",
            "text": "Hubby and I waited in line at 4 pm and were the 1st walk-ins. I’ve been to Kwame’s Dogon in DC and think it was a wayyyy better experience. Not sure why, but the staff wasn’t as attentive at Tatiana. Wondering if it’s because we were seated at the bar, but service was a bit lackluster. After receiving appetizers, it took a while for the used plates and cutlery to be removed from our table. It’s not a huge deal but when you’re paying Michelin star prices, there is an expectation of Michelin star service. The lag in plate removal resulted in a somewhat awkward eating experience and crowded table.\n\nWhile I thought some food was really good (their black bean hummus, piri piri salad, the scallion pancake was bonkers) a lot of the food was just too salty. I’m Caribbean and my husband is African so we enjoy well seasoned food; however, this was not well seasoned, it was just too salty.\n\nThe meat inside the black bean hummus was salty, the consistency of the curry patty dough wasn’t the best, a bit oily, and the meat itself was salty. My husband ordered the mushroom scallion pancake meal and while the scallion pancake was in my opinion the best item we ate, the mushrooms themselves were too salty. I was also underwhelmed by the cosmic desert and cornbread.\n\nStark contrast to the food experience and service at Dogon DC. Everything just made sense. Nothing was overly salty, oily or excessive. I really wanted to love Tatiana; however, I can’t justify the price for the food. It’s not bad food, it’s just not that good. It’s not worth the $400 we paid for it. With more restraint, additonal attention from the staff, and lower prices we could be persuaded  to return. Is it worth all the hype? Sadly no.\n\nSincerely,\nDisappointed 😔"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOFpLOFN3EAE",
            "text": "Literally writing this review while I’m still in the restaurant. The food, drinks, and atmosphere…10s across the board! I am at Lincoln Center for a performance and happened to stumble across this restaurant. I took a seat at the bar and was immediately greeted by Pierre. He explained the menu and made suggestions based upon my preferences. Pierre can also make a mean margarita lol. If you are in the Lincoln Center area, please check this place out. I will be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdDh6VjJ3RRAB",
            "text": "Boy did I really want to enjoy this food. I was so excited after getting resys finally ! The food however was lacking i wouldn’t call this fine dining at all.\n\nThere was an oxtail bone in my rangoon, the music is too loud and honestly keeps getting louder as the night progresses.\n\nEverything is covered in sauce and is too spicy and greasy. Flavors get lost and muddled, okra is sweet for whatever reason. It’s just strange.\n\nI got the oxtail crab Rangoon, crispy okra, lamb ribs, wagyu pastrami and ganache, white chocolate dessert.\n\nTruffle chopped cheese wasn’t even on the menu nor was the curried snow crab\n\nDessert was great though, although the cosmic brownie was sold out.\n\nI wouldn’t say it’s worth the $400 i spent. Expected way better."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZTEtY1c3aUxEa3lBRRAB",
            "text": "Had a wonderful dinner here. Everything we ordered was delicious but the Short Rib Pastrami was next level. The vibe was super nice and the service was on point."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaEx5UFJnEAE",
            "text": "Tatiana: A Dining Experience Worth the Hype\n\nTatiana is the toughest reservation to get right now, and for good reason. Knowing this, I took a shot and sent a heartfelt email requesting a reservation for my 11-year-old foodie son and my retired mother as we visited NYC. To my delight, we got in—and wow, was it worth it!\n\nOur meal was AMAZING from start to finish. Every single dish we ordered was packed with flavor and beautifully executed. The okra, crab, and oxtail Rangoon was a standout, and the goat beef patties were the perfect balance of rich and savory. For our main courses, the branzino and oxtail were simply phenomenal—every bite was bursting with flavor and depth.\n\nAnd let’s talk about the zero-proof cocktails—I had the Seedlip Pineapple Daiquiri, and it was super refreshing, balanced, and complex. A must-try!\n\nBeyond the food, the service was absolutely top-notch. From the hostesses to the bartenders to the managers, the entire team made us feel welcomed and taken care of. 10/10 experience.\n\nThis was our first time dining at Tatiana, and it absolutely lived up to the hype. Incredible food, incredible service—truly a memorable night!"
        }
    ],
    "reviews_count": 84
}