{
    "name": "Salumeria Rosi",
    "place_id": "ChIJRQh4J4pYwokRFwsMuBi-Cao",
    "grid": "MN7",
    "address": "283 Amsterdam Ave, New York, NY 10023, USA",
    "rating": 4.5,
    "user_ratings_total": 979,
    "phone_number": "(212) 877-4800",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNlJXMUxla2R4YzNSWWFITnpjMnBxZEdFeE4xRRAB",
            "text": "This is by far the best restaurant I’ve ever been to.\nThe personal was kind and attentive, but not in a stressful way. The food here never disappoints, try the chocolate mousse and salami."
        },
        {
            "date": "3일 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkaFoxWmtiazFtVEZKeFpYcFVPRFpsVDBOdlIxRRAB",
            "text": "Arrêté par hasard a 22h on a ete super bien reçu. Service au top! Cuisine très bonne mais portion un peu petite."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWU56RmtOa0U0WW1kQlpXeFNObVJPYjBrNVEwRRAB",
            "text": "If you go to this restaurant and see an employee who seems nervous and unsure of what they're doing, it's because that person is on a one-day training and will never return. You should forgive them, as they're being \"trained\" by another employee who probably hasn't even been there a month and has no desire to explain to the new \"employee\" what to do. (And of course, it's understandable.) It's very awkward for the trainee to have to ask the training employee, who didn't even know they were training that day, what to do. So, you'll never see these lost souls again because they were tricked with the hope of a new job, but they'll never come back. True story"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTlRXcEtjUzF1Y2xKbU5sRllRM05CVG1SbWNWRRAB",
            "text": "Stopped by for a lunch snack and drink. Great cheese and meats. Fantastic deli"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RdGNFVXhZbHB4V1VWbFFtd3ROV0pSYmtOclVWRRAB",
            "text": "A very special place where you can taste the authenticity of every meal.\n\nThe tastes were layered in texture and complexity.\n\nOur server was super attentive and efficient. Always one step ahead."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VdFZtOXdWbDlpWDA5UVMxTmhTV3RKTkZRMlgwRRAB",
            "text": "We saw all the other tables get bread and we didn’t, then they proceeded to get two of our orders wrong and made me the wrong cocktail… not to mention the portions were really unsatisfactory. Won’t be returning."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUFdqaG5RakZPVW1KeFR6UnRSRTFOTlc1T1gxRRAB",
            "text": "I had one of the most disappointing experiences at Salumeria Rosi that I’ve ever had dining in NYC. I was looking for a spot near Beacon Theater and this topped many lists. I was so excited to try their food & made a reservation for before the show. We got a fennel salad that consisted of one wet lump of shaved fennel (no other greens), two or three slices of orange, a couple nuts and no dressing from what I could taste. We figured the salad was just a miss and looked forward to our entree. We ordered the spaghetti pomodoro, a difficult dish to mess up. The noodles were so undercooked they were difficult to cut through and the sauce tasted like someone had poured Campbell’s tomato soup over the pasta. We couldn’t eat more than a bite. The staff was very kind but I wish I had chosen elsewhere for such a special occasion. For a city with so much great Italian food, I’m disappointed we chose this restaurant for one of our only meals during a short trip."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaE5XTTJUemhTWlRsRVkwaFRWbDkwZEMxb1RFRRAB",
            "text": "Salumeria Rosi is Italian perfection. The lasagne is layers of cheesy, saucy magic, and they kept bringing bread (aka my love language). Cozy vibe, great service, and food that makes you want to say mamma mia after every bite. My new go-to Italian spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Q05WZFlYMVZNTFhSclRqZE9jR05yZEhwWmRuYxAB",
            "text": "Best Caesar Salad in town and excellent pasta specially tartufo and shrimp  and calamari special, ohhhh also the fried articholke amazing!  Service is super nice as well! Great place overall, highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMFlWRkpXSFJqWDJ0eWFqQmhYME5DUmxoaWFHYxAB",
            "text": "Salumeria is one of our favorite restaurants. The food is truly scrumptious, especially their artichokes, lamb chops and chocolate mousse (my frequent menu go-tos). The whole team is incredibly nice and service oriented. Nicole is a gem! It is a very special experience."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSVEzQlFSRzFuY210d1owVXdhbW8wUkRGdlZrRRAB",
            "text": "I had chicken scaloppine. Could not believe this place would serve me what I received. First off chicken was breaded with panko breadcrumbs and deep fried to where it was crunchy and dry. There was absolutely nothing on the chicken and cut into pieces and served with greens. Afterwards I was so mad at myself for not sending it back. I wasted my money on this dinner. Not sure what chef was thinking but that was terrible."
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dlN6WllPSGt3YzFsU1dEZFNkWFpLUlVsaVkwRRAB",
            "text": "Fried artichoke and linguine alle vongole! Mojito al Rosmarino👏🏻"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SYU4zRldPR295V0VKTGQzQmtMVTVNWVRkelEzYxAB",
            "text": "Salumeria Rosi doesn’t mess around. The lasagna is exactly what you want it to be — rich, layered, a little decadent, and somehow better with every bite. It’s the kind of dish that makes you question why you ever bothered trying to make lasagna at home.\n\nThen there’s the chocolate mousse. Unreal. Silky, deep, just the right hit of sweetness. One of those desserts you swear you’ll “just have a bite of” and then suddenly it’s gone and you’re low-key mad you didn’t order two.\n\nThis place knows what it’s doing. Cozy, simple, and just straight-up delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NVdsbGhSVEpwVEVoWmFuazRabVEyYWpOT1FWRRAB",
            "text": "Wasn't sure exactly what we were going to do for lunch, this place came highly recommended from a relative - let me tell you didn't disappoint! The food was awesome! Got the Fried Artichoke, Arancini, Mortadella & Burrata...For main course we split a lasagna which was delicious! Our waitress Allyson was an asset to this restaurant extremely helpful & extra friendly which isn't easy to find in NYC, will def be going back soon!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMU4zSjVMVFJhY1RVNFV6ZFlhVmRoTUZsQ1RtYxAB",
            "text": "This place is legit. The host Andrew is super friendly and went above and beyond just to make sure we are comfortable having 2 kids. The server is very sweet and knowledgeable, Allison. I am happy to see people in the service industry being so pleasant and making our experience pleasant as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMVlVaFBXVXBCVTBad1oxOTZVMlJDVldGUU1GRRAB",
            "text": "My husband and I stumbled on this gem of a restaurant for lunch. Service, food and atmosphere are top notch! Every member of their team was friendly, knowledgeable and engaging. They all seemed like they love where they work and made us feel so welcomed. We sat outside on a gorgeous late summer day; so happy we stopped here. We will be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcVFVMVFjRzU2UVc4M1FUSnVTMWt6TjNsc09FRRAB",
            "text": "I went to the deli / bakery. The quality of the ingredients is great but the service was bad. I ordered an iced latte and a panini with 4 ingredients. The guy steamed the milk before pouring it over the ice, so all the ice melted. Then he forgot one of the four ingredients in the panini. By the time I realized, I had already left. And the whole thing took 15 minutes, even though I was the only one in line."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeVFtdEpXbnBVUlVsRFlXbzVSbUpOYnpkblMxRRAB",
            "text": "First time there. Nice atmosphere. I ordered chicken scallopini. What I got was a cutlet deep fried with panko breadcrumbs and absolutely nothing else on it. Not sure what they were thinking but that is not how scallopini is made. Chef should rethink that preparation. My wife’s meal was good ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abVQxaHBWalF3TVRSNVRYSjJRbE5XYm10RlNWRRAB",
            "text": "Food wonderful, run like a tight ship, great service especially the waiter Mali, great affinity. Sat outside on a mid September night."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cb01qSjRhbEJRVG5SNE1UVTVhbHB4UlZCR1dHYxAB",
            "text": "So delicious 🤤 so nice place ! Best place I went in NY !!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTFkzVlNZVWs0VDBsbkxXVk9iRzF6WldOM01tYxAB",
            "text": "Maria, our server took the whole up a notch. She made sure we were well taken care of. The food was delicious and all the products were of excellent quality."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ME9HeFJlalpyTTJvNFdGUkxSMU10Tm5kTFRHYxAB",
            "text": "Very intimate spot a few tables but you get a lot of bang for your bucket here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTlRrWktSVmhwU2paVVlWVjFSRnBsZDA1WGVGRRAB",
            "text": "Great restaurant. The food is the best, you can’t go wrong. Get the cipolline balsamic onions. Evan is the best waiter!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poM2FGUjZVRFU0U2toSVJrd3RjekI2WnpoR1RYYxAB",
            "text": "Was traveling for work and wanted to dine solo al fresco without feeling weird. Found the perfect spot here. The service (shout out to Allison) was fabulous and the food was excellent. Will be back for sure!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWGFYZHJZV1ZXUkhseVNXeHNZVTVtU0RGWFdtYxAB",
            "text": "Kylee made the night.  Amazing server.  Good was amazing as well.  I will come back.  Main reason - Kylee!  Thanks.  Jim K."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOM1oyRnFWek15UzFVMFYwWmxXbTFHWjBaM1dWRRAB",
            "text": "Salumeria Rosi is one of the best Italian restaurants in NYC! The food is always tasty and the staff is really friendly. Everything is made fresh and their prosciutto is to die for!\n\nDefinitely going back soon! :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wb2VYTnBOamx2VXpGS1pIUkdTazFpVlRSNGVrRRAB",
            "text": "Amazing place for everyone. Don’t be surprised if you see a celebrity sitting at the dining room."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dVZsbEZOVFJJV1MxTE1ESnJObkJ3VUdOWVpsRRAB",
            "text": "This place has some of the best food on the UWS.  Its tiny and inconspicuous but don't walk by, go in!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMmVsaE1ZMEpVUVhkYVlrc3lhWFU0ZUZsdGFVRRAB",
            "text": "The fried car logo fritto and the Manzo were our favorite. Maria had great recommendations and made our meal very special"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kZmRrUnFSRWQ1Y2pFMmRHNTFaMGwwVVU5eGJsRRAB",
            "text": "A lovely neighborhood spot. Maria was an extremely conscientious server."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xweE5XeHllVEpOWWt4eGIwazFVRFZSUW5aSk1tYxAB",
            "text": "Good ambience, the employees are very attentive. Very clean and the food was great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSGIxUkllbWR3VVhKeFkwNWthRVpLUVVwaU5YYxAB",
            "text": "Food and service are excellent - Allison is the best"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMWMwbENTa0Z2Tmt0MlNscHVhbUpzUVhWWlYzYxAB",
            "text": "Arianna was wonderful and welcoming for our dinner, and really the whole crew were working together like a well-oiled machine. The food was excellent, compliments to the kitchen!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toV2NtdDFVakYwWjFGNGF6UTRiME5pTkRSa05HYxAB",
            "text": "Food is good although portion size is quite small. Spaghetti with clams had tiny clams and the flavor was quite ordinary—I’ve had this dish at many Italian restaurants in the United States and in various towns in Italy. This dish here is only ordinary. The pasta is not al dente, and the olive oil didn’t taste like high-quality Italian olive oil, and the clams are just too small, and perhaps it’s lacking some garlic flavor (in Italy this dish is usually cooked with garlic and the olive oil and parsley flavors should stand out as well as the vongole). For the price they charge, I expect better. Appetizer was very good though, still portion size is quite small compared to other Italian restaurants in UWS. The puttanesca is good though a bit salty.\n\nThey have both indoor seating and sidewalk seating. Sidewalk seating is on a busy main street so you might get some strange reactions from passersby."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVWJrMWthekU0Y25aRmVYaE9SM0JIVkZwVUxVRRAB",
            "text": "Great place and very good service with Maria"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTFIwcHZURzQ1YmtkcWQwdzNUME0wV0RkdVRuYxAB",
            "text": "The food amazing, and service Maria and all the crew provided was very attentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeGNFcHBkR1YxV2kxS2JVaHZORlJRWWtkSlVYYxAB",
            "text": "Our waitress Maria is fantastic. Great service and very attentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNVYyOWxUVm95VVZoaGFVSXdhSFJEY1VoamJrRRAB",
            "text": "The best Italian on the UWS! Maria is our favorite server and really took care of us and our baby ☺️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSWNFSnZNRW8wYmpSQ1ZVRkhURGRHVGpSd2JXYxAB",
            "text": "Definitely one of our fav restaurants - we think of it as a side trip to Italy. The menu has something for everyone & we usually share plates so we can have more options. Salads are amazing esp the arugula (best lemon dressing) & Caesar.  We also love their veggie antipasti  - burrata & peaches or fried artichokes - they change seasonally so it’s there’s also something new & all delicious. We will add some prosciutto & salami.  All pastas are homemade - favs are pappadella w/ tomato  w/ , cacio & Pepe, signature meat sauce, carbonara, risottos ( pretty much all of them). We don’t always have room for main meats but also very good - lamb & pork chops are 2 favs.  Best chocolate mousse we’ve ever had.  Love the food but the staff is the best part - so welcoming and accommodating. They take to the time to remember the little things and they treat everyone like family."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFUzTkdRM1JTYTBSelZqRjJPWFJHTW1SZlEyYxAB",
            "text": "Salumeria Rosi is our most favorite stop before we go practice Jiu jitsu on UW side!\nMy daughter and I, love the atmosphere there. We get a table in no time, and that’s a huge plus since we are almost always rushing)\nI love their charcuterie board: the selection of meats and cheeses always amazes me!\nMy daughter loves their rigatoni!!!\nIt’s a perfection combo between tasty food, great vibe, and perfect service!\nNicole is the heart of the place!  she brings so much warmth, is very welcoming and her knowledge of everything is top! We love coming there!\n10/10 for best food in UW, and perfect service! Thank you!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SU2FFZHFhVWRuVFZkQlRXWTRNV1JxVEd4VFVXYxAB",
            "text": "Brought my wife here and her family for dinner. Service was excellent! Food quality was amazing and presentation is excellent we had a good time, will definitely will be back !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUVZHMWlURlpXTlcwNFQyOWxha0pqYTNGaFJGRRAB",
            "text": "Love this place ! Best Italian food I’ve had. Came here with family and the atmosphere was amazing. Highly recommend it’s a beautiful hidden gem !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWME5tcEVla3BRTUhSVFNFTkJZV3BCUzBSdGMyYxAB",
            "text": "Some of the best Italian food in the city. This is my go to spot for when friends or family come out of town. Space is amazing and food is even better!!! Order the rigatoni you won’t regret it!!’"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMFMwZGtiblpSYm5ZeFNrZE1URVowUW01NWNVRRAB",
            "text": "A real gem on the UWS with fantastic food and people who treat you like family. Andrew, the owner, clearly pours his heart into the place.  Lorenzo's dishes are superb (could live on his pastas for the rest of my life).  Nichole is truly a star who works hard to make sure you have a great experience every single time and the rest of the team follow her lead. They are a super-friendly, hard-working crew.  So lucky to have this place in the neighborhood!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcFRYZGZUMmxMWVhWNlZWQXhhbWhNUVdkb1EzYxAB",
            "text": "Salumeria Rosi is our go-to Italian Tapas restaurant on the UWS! It's the place I took my partner for our first date, it's where my 90 year old grandmother wishes to celebrate her birthday, it's where we go before we see anything at the Lincoln Center, and it's where I take my office for our holiday party! Great atmosphere, consistent food, great service and friendly staff!  Great for groups who likes to share food! The steak and caccio e pepe are two of our favorites! And their selection of wine is top notch! Been around for a long time for a reason! And hopefully will be around for a long time! Can't wait to go back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUlZXcEViV2RUZFhaWFFUZFVVeTF6ZVhoWGVWRRAB",
            "text": "If you want to have a dining experience where you virtually transcend from NYC to a quaint city in Italy, Salumeria Rosi is the place for you! The food, the atmosphere, the staff, and the clients all give you a feeling of warmth that is unparalleled by any other restaurant in the city. Being located on the UWS it is surrounded by fantastic restaurant competition which are also very good but I always circle back to SR as it is my favorites!\nWhen you see the menu and ultimately receive your food, it is evident that the owner and the chef are in sync regarding every aspect of the food. The cocktail choices are unique and delicious. The restaurant is frequented by powerbrokers, celebrities, and everybody in between. All of their customers are treated like family! Anywhere else in the city, I would feel uncomfortable eating in the street in the auxiliary areas of most restaurants. However, The owner has put forth such thought into every aspect of the restaurant, including making one of the most safe auxiliary eating structures with no compromise to ambience that I have seen.\nAdditionally, the restaurant has an outside pet friendly setting as well.\nIf you are fortunate enough to have an opportunity to get a table at Salumeria Rosi you will be impressed!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VmQwbE5helZuVFhsdmFUVTNXbEJuTkZweU1WRRAB",
            "text": "Salumeria Rosi is the best restaurant with the best food on the UWS. Nicole, the manager, keeps the place running. Which is not easy — it gets very busy! I love it there. And I always feel well taken care of. The steak is my favorite; the cheeses are exceptional. I always get the caponata. It’s the best!!! As is the chocolate mousse. It’s my favorite place to eat out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odFJHcDZRbTlqUWxSQlptOXNialI1UlRkNmJsRRAB",
            "text": "Food is fantastic, excellent service 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSlNYbDZYMlZPTjJ0aVdsYzFVbWhFWldZeWRuYxAB",
            "text": "There is no easier review to write than this one. I love Salumeria Rosi. It is the best meal out on the UWS. I'd eat there every night if I could. I celebrate special occasions there, and go for a pick me up when I need something yummy. The food is so delicious and the staff so welcoming that it feels like eating at home, but better, and without the clean up. The ambiance among patrons is very friendly, an extension of the welcoming attitude of the staff, and I have often found myself falling into conversation with folks at the next table. Now to specifics about the food: The pastas are all out of this world. My personal favorites are the Spaghetti al Pomodoro and the Campanelle al Pesto. The best pesto I've ever had -- rich, creamy, and immensely satisfying. My husband says the octopus is the best he's ever had, and he is quite the critical foodie. My daughter orders the steak .... every time we go. I'm not a meat eater, but she and my husband both swear by its quality and that it is cooked to perfection.  Me, I love the Orata (had it yet again just last night). It is perfectly prepared -- the skin is crispy and the meat is moist and flavorful. Oh, speaking of flavorful -- the mussels with a spicy red sauce ..... To back up a moment, they have many delicious starters: caponata is a favorite in our family, the artichokes in cacio e pepe, burrata with apricots, all of their soft cheeses are exceptional, dissolving in your mouth. For those who want a sampling of cured meats and cheese, you can get a charcuterie board of your own choosing. The olive oil provided with the bread is wonderfully peppery and smooth. The focaccia is fresh and delicious. Shall I go on ... .sure, why not? For dessert, the ice cream is insane -- as the talented and affable chef says, it's from Italy, the cows are happy. Yes, you can actually taste their happiness in the creaminess of the ice cream. I also love the tiramisu, and the chocolate mousse. In short, if you are in the neighborhood and haven't yet been to Salumeria Rosi, go. You'll be delighted."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGblZVaG1RbVp5ZG1ZM1luUk1WRmhQVFc5bFJIYxAB",
            "text": "My favorite Italian restaurant in all of New York shout out to the great service from Nicole"
        },
        {
            "date": "수정일: 1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSOHBybnpRRRAB",
            "text": "아주 오래전에 가서 메뉴 이름은 잘 생각이 안 나지만 분위기도 좋고 음식도 맛있었어요~"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJc3B6aUNnEAE",
            "text": "친절한 점원과 빠르게나오는 음식\n맛또한 절대로 떨어지지않는 훌륭한 식당!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSU9ISkhNMnN5UWtvNFEycE5PVE5aYmxCc0xWRRAB",
            "text": "Went to Salumeria Rosi with my handicapped Grandma. The owner/manager was super helpful and accommodating. He did a lot to make sure that my Grandma was comfortable. All of the food was outstanding, with the exception of the lamb chops which were nearly impossible to eat. It’s a typical New York City restaurant so not very spacious and I would definitely recommend making a reservation to ensure that you get a table. I would definitely come back here, I want to try everything on the menu!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsa1pEQm1TRkpXZHkxcmFVWndUMWh1TjJGbVkzYxAB",
            "text": "We’ve been searching for an authentic Italian experience outside of Italy and Salumeria Rosi fits the bill.  This place was recommended to us by complete strangers and we were not disappointed.  Really enjoyed dining outside on the patio on a beautiful day.  Great food, great vibe, and great staff.  We are not locals, but will definitely be back on our next trip to NYC."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOaWdzcl93akx2Z3FRRRAB",
            "text": "Tiny cute restaurant with nice service and good food.  The ricotta and peaches was delicious.  The peaches were sweet and the cheese was creamy and rich.  Adding some mint and nuts made for the perfect bite.  Meat and cheese platter was also very good, the meats was sliced very thin which was great, but I would have appreciated if they told us the types of cheeses we were eating (the meats were obvious). Also would have like to have known what the garnish was as I couldn’t place it, it didn’t taste strong enough to be candied ginger but it may have been.    I did ask what all of these were and was told someone would come and explain but they never did. Bread basket was a combination of toasted and fresh bread served with tasty olive oil.    When you first walk in there is a counter where they sell their meats, cheeses and salads, all looked delicious and while we were they the counter was very busy. Overall liked this restaurant and would recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRVdWZHJNbFY0YWxCZlFsUnlZVWRNYm1SdVMzYxAB",
            "text": "Best spot in the UWS hands down. Always excellent service and you can taste the love put into every authentic bite. The blue cheese martini's are a must. The pastas are fresh and appetizers are so unexpected and delicious. We have never had a bad meal. A must try-you will keep coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKNm9rNWlYcXVuclhBEAE",
            "text": "Incredible food, warm service, and a true hidden gem!\n\nSalumeria completely exceeded my expectations. From the moment we walked in, we were greeted with warmth and genuine hospitality. The ambiance is cozy yet stylish—perfect for a date night or dinner with friends.\n\nNow the food—absolutely outstanding. Every dish tasted like it came straight from a kitchen in Italy. The charcuterie board was beautifully arranged with high-quality cured meats and cheeses, and the fresh pasta was perfectly al dente and packed with flavor. Don’t skip dessert—the pistachio panna cotta is the best I’ve had in NYC.\n\nYou can tell the staff truly takes pride in what they do. Our server was not only knowledgeable about the menu, but also incredibly kind and attentive, with spot-on wine pairing suggestions that elevated the whole experience.\n\nHighly recommend if you're looking for authentic Italian cuisine in the city. I’ll definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJa3JmRlNBEAE",
            "text": "This place is a hidden gem. Such good food and service. Small place but totally worth it. We got there right after brunch hours. Seated right away. Charcuterie is the best. Pastas are simple (as in not too many ingredients)  but bursting with flavor. Their ricotta cheesecake is a perfect way to end your meal. Best meal we had in nyc on our visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKNzV0SVAxenVlYkJ3EAE",
            "text": "Solid. Fine/good. Served the exact purpose I needed while in the hood. Service v attentive.  Bread basket sub par. The sourdough v hard and crusty. Other people’s meals I saw coming out looked delicious - would be cute for a date and would come again. It’s a v compact space so maybe to be expected but the Only bug bear is one bathroom for the entire place both patrons and employees."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2akltNnNBRRAB",
            "text": "Went for my birthday. Such a beautiful restaurant and the servers were so kind and charming. The food was delicious. I thought after the antipasti id be full but finished my entire plate of lasagna with no problem. Great vibe. And I can’t wait to come again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cXJ2dkp3EAE",
            "text": "Stopped by Salumeria Rosi for coffee and desserts with the girls, and we had such a lovely time. The ambiance was charming, and everything we tried was great! We had the Torta di Ricotta cheesecake, tiramisu and the pistachio panna cotta—all of them were delicious. The coffee was also really good, and I loved the little cookie they served on the side—a nice touch!\n\nOh, and I have to mention… I was unexpectedly impressed by the sink in the restroom, haha! Definitely planning to come back for a full meal next time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucTkzNmFBEAE",
            "text": "I have travelled the world extensively over 40 years. I ate at all restaurants ranging from pop & mom’s to Michelin three stars. This is my honest review of the restaurant Salumeria Rosi in Upper West Side, NYC. Focusing on classic Italian dishes and various Italian cured meats. We had a blast enjoying all these specialties. This is also located not far from some Central Park highlights."
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adk9VOWlWVFkxT0dac2QxOVlMV2RyVkhWdGVGRRAB",
            "text": "Piacevole scoperta in quel di NY, il personale carinissimo, Allyson ci ha trattati davvero bene e ci hanno omaggiato con dei buonissimi cantucci, meravigliosi i panini preparati al momento con prodotti freschi e italiani."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKek1GZ3pXbWhsVWw4eVdTMXZNVVJOWjNReGFGRRAB",
            "text": "If you're looking for the most authentic Italian experience in New York City, look no further than Salumeria Rosi. This gem offers hands down the best Italian food I’ve had in all of NYC — from the moment you walk in, you feel transported straight to Italy.\n\nThe atmosphere is cozy yet vibrant, perfect for everything from a romantic dinner to a casual night with friends. The food? Absolutely incredible. The pastas are perfectly cooked, the cured meats are rich with flavor, and the cheeses are out of this world. You can tell everything is thoughtfully sourced and authentically Italian.\n\nBut what truly sets Salumeria Rosi apart is the exceptional service. The staff is knowledgeable, welcoming, and passionate about what they do. They make you feel like family from the moment you sit down — attentive without being intrusive, and always ready with great recommendations.\n\nIf you want real Italian food in New York, this is the place. I’ll be coming back again and again. Truly a must-visit for any food lover."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMmRWTnljbEZ0YjNoalNuaGZaMHRxUm5RMWJGRRAB",
            "text": "Salumeria Rosi is our favorite restaurant on the Upper West Side! Sitting at the bar with the view of the open kitchen is always fun but there is no bad seat. The staff are truly phenomenal -- attentive, personable and so knowledgeable about food, wine and cocktails. The lasagna is arguably the best in the city! From date nights, to brunch with the girls to big celebratory family dinners, Salumeria has delivered at every turn! We're so grateful to have found this little gem of a restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsM2JGTmxjMkZ4YjI0M2MwRjFORk10ZHpOVU5GRRAB",
            "text": "I ordered two trays of sandwiches to take to a Central Park picnic. They were absolutely delicious and ready right on time. Will be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oblkwUlVaVUowTm1GeFExZDJlWFV4WWtFM1dVRRAB",
            "text": "Salumeria is a top notch Italian restaurant in NYC. The owner and entire staff are friendly, accommodating and professional.\nAll the dishes are well prepared and plentiful.\nSome of the dishes we love are fried artichoke, charcuterie board, skirt steak, chicken mattone and the orata is the best!!\nAll pastas are home made, the best being gnocchi in their homemade sauce.\nIt is our go to restaurant !"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnak5PTjZ3RRAB",
            "text": "I’m updating my review.\n\nIn April 2023, I came to this restaurant with my husband. We ordered carbonara, carpaccio, and a few other dishes, they were delicious! The carbonara was actually the best we had ever eaten in the US It was creamy and flavorful\n\nSo, we decided to come back for the carbonara again, but we were disappointed and there’s nothing worse than paying for bad food\n\nThe appetizers were good, but I wouldn’t order them again. I think the carpaccio needs salt and lemon. I’m a sous chef, and I make carpaccio all the time… The one I had the first time was well-seasoned and flavorful.\n\nMaybe the restaurant has new cooks. I’m not sure what happened, but I noticed the food tastes different now.\n\nThe carbonara was dry, thick, and needed salt. My husband ate it all because he was hungry.\n\nThe rigatoni, the pasta wasn’t cooked properly, it was raw and hard. The sauce was way too acidic, and I couldn’t taste any meat. I couldn’t even finish it.\n\nThe service was great, the waiters were friendly and very attentive. Unfortunately, the pasta dishes really let us down."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKM2RETnZTRlJZVXpKbGIzVnBXRGw0Y21JMU9XYxAB",
            "text": "Food was incredible, best fried artichoke I’ve had since Rome! We started with meats and cheeses and then moved on to a few orders of the pastas which just blew our minds. The service was incredible from the lovely host to our lovely waitress Arianna who took care of us from start to finish leaving an even better taste in our watering mouths. Will most definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZlVrTTFhR3BOU1ZOb1JTMVBlbWR5U1RCZlVXYxAB",
            "text": "Absolutely phenomenal experience at Salumeria Rosi. From the moment we walked in, the atmosphere was warm, inviting, and authentically Italian. The food was exceptional—every dish thoughtfully prepared, bursting with flavor, and presented beautifully.\n\nWhat truly elevated the evening, however, was the service. Arianna was outstanding—attentive without being overbearing, knowledgeable about the menu, and genuinely welcoming. She made us feel right at home.\n\nTo top it off, the owner personally stopped by our table and could not have been more gracious. His kindness and hospitality set the tone for the entire restaurant. It’s rare to see such genuine care from ownership, and it left a lasting impression.\n\nSalumeria Rosi is a gem—whether you’re a local or just visiting NYC, don’t miss this place. We’ll absolutely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bWRuRnNOMUV5TjB4U1VqUm1OMHMyUzFFeVVuYxAB",
            "text": "This has been our go-to place for Italian food on the UWS for 10 years. The staff and service are incredible, and the food is outstanding. We consistently have had excellent food and service whether we’ve come on a date night or with our kids or with large groups. The food even delivers well for nights that we want to stay in. The Salumeria Rigatoni has been our #1 order for years and it is consistently delicious. We will continue to return for the food as well as some of our favorite people - Nicole, Evan and Andrew. Thanks for always taking care of us!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0d01VeFdVa1JRUjNRd05UbExhbkIyUlRGWldVRRAB",
            "text": "I wish I could say my experience at Salumeria Rosi lived up to the reputation of the food, because the kitchen truly delivers. The dishes were well prepared. Unfortunately, everything else was overshadowed by the shockingly poor service we received from our server Amila.\n\nShe was dismissive, inattentive, and kind of rude. Made us feel like an inconvenience from start to finish. She barely acknowledged us, rushed through taking the order, and for some reason was only taking to my husband, like I was invisible there, that didn’t make me feel comfortable either and very unpleasant. Then she disappeared for most of the meal. Simple requests like refilling water (which I feel shouldn’t be asked few times) or checking in were ignored, and there was zero warmth or hospitality. It’s hard to enjoy even the best food when the person serving it acts like they’d rather be anywhere else and making passes on your husband.\n\nIt’s a shame, because the kitchen clearly takes pride in what they produce, but the front-of-house service completely ruined the experience. I won’t be returning, not because of the food, but because of the way we were treated."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRdGNVRjNOSEkyYTJwNlYwMXhXVEZ0ZDJGRFFtYxAB",
            "text": "I went here for the first time on a rainy Saturday afternoon looking to grab a meal before I met up with a friend. The hostess was lovely and was able to accommodate me quickly. Unfortunately, that is where the hospitality ended. The waitress came to my table and seemed to want me to lead our conversation. Not leading me through the menu or the establishment and was rather stand offish, as if I were a nuisance to her day. While the food was phenomenal, unfortunately this is the last time that I dine here."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaTRMOHlRRRAB",
            "text": "Me and a friend went last night to celebrate a friend who lost his life 2 years ago. We sat at the bar which is very small having only 3 seats but, I loved it and preferred it over the regular seats that are pretty close. They have outdoor sitting as well.\n\nWe started with a beautiful appetizer of fried artichoke! Ummm yummy\n\nI had the Caesar salad which was very good and since I love tomatoes I asked them to add them and I loved how big and beautiful they were. My friend had the watermelon salad that I tasted and loved too and so did she.\n\nI ordered the lasagna and she had the spaghetti with clams. Both were good and I’m about to eat leftovers now.\n\nWe didn’t have dessert but, I ordered the prosciutto with fresh mozzarella and omg it was amazing! I only wish I had crackers to eat it on.\n\nThe staff was amazing and they all checked on us to make sure we were okay and enjoying everything and I wish I remembered every name but, there’s a guy that works at the bar who is a real hoot and truly entertaining! 😁\n\nI will definitely recommend this restaurant to others and will be visiting again myself.\n\nExcuse typos(sent from iPhone)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSOTdPU2pnRRAB",
            "text": "Small elegant space. The wait for 2 people around 7pm was short. Food was delicious, and the staff was very kind.\n\nThey offer small or large plates for some of their dishes, the small plates were the perfect portion for the both of us :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUFFYVldXRkk1UW10TVh6VmZWM1pQVm1aRU5HYxAB",
            "text": "Salumeria Rosi is one of our families favorite restaurants. We do date nights and family nights with the kids. It is great for any occasion. The food is delicious; we like to order lots of small plates and share.  Our go to dishes are fried artichoke, meats and cheese plate, the Salumeria Rosi pasta, the cacio e Pepe, and so many yummy desserts. You really can’t go wrong and the staff is amazing. ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTVUwNDNUa2h4UkhOblJHMW9WbHBEYW14NlRIYxAB",
            "text": "We’ve been coming here for about 8 years and have been hard pressed to find any other restaurant on the UWS that serves quality Italian pastas, antipastos, meats and cheeses… plus excellent cocktails.  We love the service staff and adore the owner, Andrew…so excited that they are opening a sister restaurant in the East Village!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5a2FYazBORTFOVlZGMWRHZHRkVUZLV2twTVJuYxAB",
            "text": "I initially stumbled in here with a group of friends and we had a lovely brunch. It has since become one of my favorite places on the UWS. I do not live close by, but i find any excuse to be in the area to have a reason to go here.\n\nNot only is the food delicious, the service is amazing. Ive had the best experiences — be it lunch or dinner, I am never disappointed. Between the mousse, the fresh burrata, the pasta - anything you could ever want is here.\n\nHighly recommend - it combines the intimacy of a regular haunt with the sophisticated of being a new up and coming restaurant!\n\nSpecial shout out to Nicole for always accommodating my family."
        }
    ],
    "reviews_count": 78
}