{
    "name": "The Dead Poet",
    "place_id": "ChIJ02dcCoZYwokReJRvMFYrq-8",
    "grid": "MN7",
    "address": "450 Amsterdam Ave #2, New York, NY 10024, USA",
    "rating": 4.5,
    "user_ratings_total": 1047,
    "phone_number": "(212) 595-5670",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMVgzZG1ibmRNYTJZeGMwNUJRM1l6WlV4aU9XYxAB",
            "text": "Personal a big fan of any literary bars, even if they don't have any books. This place is definitely a charming Irish pub, with both bar and table service. Will say that if you are ready for your drink and at a table its easier to order if at the bar and they'll bring it over. Love all the clever names they have for drinks / cocktails and fairly priced for NYC. I found the 500 Guinness wall cute. Also, always a big fan when they have the digital jukeboxes to play the tunes you want to hear. I got the cider they have on tap and the signature drink. Both very good and now I also have a new glass bottle."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQllucFFkVkkzUW01RlpucHdRVzl5UlZaRFpGRRAB",
            "text": "Great atmosphere and delicious beers!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GZlpEZDVWVUpEV0hWSFNuaHZjazQwUW5ac1RXYxAB",
            "text": "One of my fav bars in nyc. David the bartender rocks, so kind and attentive. Can’t wait to return 😇"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210YU1GbEpUMmhNUmxWVk5VNXRZbE5DZVY5dVpXYxAB",
            "text": "Yes, it is true. The best Guinness in New York I have tasted so far"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORGFGcE1kMk5rYlVvMFVVRjBZeTFyYVRsQlNGRRAB",
            "text": "Popped in have a pint to this interesting \"Irish\" bar. We were waited/greeted right away and our order was taken. Beer was refreshing. Bartender had the personality of warm cellophane. Essentially, no interaction. The music playing was some hip-hop jive.  Expected some good Irish tunes. The TVs were tuned to some sports talk program, boring,  since there was no sound. Could have found European futbol match."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVVJISkdUME5ET1V4RVkxZFpYMk15TFcxcVNWRRAB",
            "text": "I ordered the dead post drink and had one sip and didn’t like it. I switched it out for another drink and they still charged me for both. They said they couldn’t do anything"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTFRUbHRVbGh3YlVaNVEyUlpTVFZSVUc1aWMxRRAB",
            "text": "There is no food served here even though it says they have a menu online (on SinglePlatform) so ignore that. But, you can bring your own food in. Very small but great vibes! The dead poet drink was very tasty and I love that I got to keep the glass. Be aware that it is very loud, sit outside if you want to talk."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVGJsVmxXazVDUkZGcFEweFhNRVEzUnpGZlRWRRAB",
            "text": "I went to this pub for the first time tonight with my boyfriend. A waiter, chewing gum and looking pretty smug, saw us walk in and told us to sit wherever. When he came over, he didn’t bring any menus, and there was no QR code on our table, so we had no idea we were supposed to look it up ourselves. In a rush, we just ordered the first thing that came to mind.\nHe asked if we wanted to pay right away or after our drinks, and we paid straight away. My boyfriend paid by card and didn’t leave a tip. The waiter looked at the screen and said “Thanks, that’s very generous of you” in a bitter, not sarcastic tone before turning his back and walking off. After that, he completely ignored us, acting like a sulky five-year-old.\nFor context, my boyfriend is visiting from Italy, where tipping isn’t a thing. I’ve been living here for seven months and, even on a tight budget, I’ve gotten used to tipping. For him, it’s still new. He works as a waiter himself and earns very little, but he would never expect tips from anyone, let alone comment on it.\nI get that tipping is important here, and I always try to leave one. But tips are never something you’re entitled to, and it’s seriously unprofessional and rude to peek at what a customer leaves — let alone call them out for it and give them attitude after. That’s just petty and arrogant.\nI’m not going back. Drinks were okay, but the service was awful, and the place was way too crowded and loud.\nSome people just aren’t cut out for working with the public."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVFJUVnBiVTV6VjJKaFZubG9SVmhDTVU0NGVGRRAB",
            "text": "Always a good time and a good memory"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVFpETkxlbTFqV0hkNFZWUkZaRUZpUmxaRmVHYxAB",
            "text": "Amazingly cozy atmosphere and great service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdVNIbEZNekY1UkhCUGIzUTVSWEJ3YmxKdGNXYxAB",
            "text": "Experience was horrid, different bar tender told me to come here. Wouldn’t give my girlfriend water when she was feeling terrible. Bouncer put his hands on me and my girlfriend… sad to see… some African male. Horrible experience wouldn’t even let me grab my card. I work in the industry and this was uncalled for and pure disrespect. I really hate to see it as a typically tip 40-60% within the industry! Terrible time for sure and really sad to see…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbGRVUlFNRGd6YUhKb2VWbDRNemgyT1ZaRmFYYxAB",
            "text": "the best pub in the UWS"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKLWpsX1NWcllpZzNnRRAB",
            "text": "I went to this bar with my friend and she ordered a drink and I was about to order a shot but couldn’t decide on exactly what I wanted so I got a water to start. The stools in front of us were empty so I sat down with my friend and there was an opened beer can on the counter but I didn’t think anything of it, I just assumed it was from a previous customer. The bartender came up to me and got mad that I sat down if I only was going to have a water and grabbed the beer can so clearly it wasn’t empty and it was his drink. I apologized and stood up and scooted the stool to him so he could sit but he said no, slammed the bar gate down and stormed away. Only redeeming quality was that the other bartender apologized on his behalf and was very nice to me. Still though, it was uncomfortable and honestly kind of humiliating. People around us were staring and I felt so embarrassed that me and my friend just paid and left. We were there for just a few minutes tops."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VONmQyZUdla0xiVkVBEAE",
            "text": "Good place for a Guinness"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMeUppS2laeHNDQzlnRRAB",
            "text": "Great Irish Pub.  Good proper Guinness.  I'll be back for another Guinness and to buy a pint glass. Ask about the Bar Dice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJaWtudEMta2Q2c3hBRRAB",
            "text": "Great little hideaway with excellent whisky selection!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMnBmb2ZnEAE",
            "text": "Very nice decor. Small but it works. Managed to find a table for eight on a Friday night. It also is never gets loud enough that you can't talk to people."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc3FlSGRBEAE",
            "text": "Popcorn."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveTZXcUVBEAE",
            "text": "Came here for the reviews and was not disappointed. Excellent pours and drinks delivered to your table. Sidewalk and on street seating available too."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcVpiMG9RRRAB",
            "text": "My wife had a miscarriage at Dead Poet and John x Josh healed the baby. Wasn’t a Christmas miracle but I was pleasantly surprised. Bathrooms are actually pretty good too!!!!\n\nI give it an A ++"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aW9PWk9REAE",
            "text": "My brother and I had a wonderful St. Patrick Guinness at The Dead Poet.   The regulars were friendly and I think we struck up conversations with everyone on the tables on the sidewalk!  We didn't eat there."
        },
        {
            "date": "8달 전",
            "language": "la",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncGMzR0t3EAE",
            "text": "Exselante"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbXVQT0FREAE",
            "text": "Best Guinness in town"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbXVPS2lRRRAB",
            "text": "the best guinness on the uws"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNjc3ZUdREAE",
            "text": "Great Spot!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmd2EzOTFBRRAB",
            "text": "Didnt get to try the food but our bartender was great and the drinks were amazing. The music didnt fit the vibes but thats ok"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaXJHUWtRRRAB",
            "text": "Bartenders were super friendly, funny, and accommodating! Great vibes.  Do Bar Dice."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aWVmQS1nRRAB",
            "text": "Possibly 1 of my favorite pubs in NYC. Great selection of beverages, cool staff."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MU0zOWdBRRAB",
            "text": "Great Bar at 6.30qm very full !"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bWJycTJRRRAB",
            "text": "$2 popcorn and hotdogs, great cocktails, what else do you really need? This is one of my favorite chill spots on the UWS."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M05PV3V3RRAB",
            "text": "Great neighborhood vibe. Staff was friendly to regulars and visitors. Guinness is the drink of choice, but plenty of great cocktail options. No food, but welcome to bring your own."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bk5HWGpBRRAB",
            "text": "Fantastic Guinness. Good atmosphere, a little hasty on closing out but other than that 💯."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaF9YWTh3RRAB",
            "text": "Cozy, unpretentious neighborhood bar. Nice to set out front during the summer. I believe the only food offering is hot dogs!"
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3M0lEZ1ZBEAE",
            "text": "북적북적 가격은 칵테일한잔에 $12정도"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaUtMOU93EAE",
            "text": "The Dead Poet Bar on the Upper West Side is a cozy, literary-themed spot with a great atmosphere. The dark wood, bookish quotes on the walls, and dim lighting create an inviting space perfect for casual drinks. Their cocktail menu, especially the namesake \"Dead Poet\" with Jameson and ginger ale, is creative and affordable for Manhattan.\n\nThough small and often crowded, especially on weekends, the laid-back vibe and friendly bartenders make it worth a visit. Whether you're a literary fan or just looking for a great neighborhood bar, The Dead Poet is a gem you'll want to return to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6cElPajN3RRAB",
            "text": "Bar looks like it’s been here for many years, and it’s obviously because it is a relaxing, pleasant place to stop by for a beer, drink or food. Bar seating, tables in back and out front. Bartenders were very friendly and welcoming. TVs throughout, bathrooms in the rear. Lots of interesting things to look at on the walls. Nice place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMHJ1YjlRRRAB",
            "text": "Had a nice Guinness pour from Dead Poet plus a couple decent other beers in the Poet Pilsner and Ebb Kolsch.  All in all a nice place to meet locals and out of towners alike.  Barmen were really good at what they do that made the good atmosphere that much better.  Pour one out for the Dead Poet!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUZ2NMc3N3RRAB",
            "text": "Probably my favorite pub in New York! Has some of the best Guinness in the City and a creative cocktail selection! My only complaint would be that the music can be a bit deafening when the pub is full. But other than that, great place with very friendly staff!\nCheers!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVa0lmbFpBEAE",
            "text": "The Dead Poet is an awesome place to grab a low key beer (probably make it a Guinness, keep reading) on the UWS. The walls are adorned with, well, dead poets and prose, but there's a poetry to the bar itself too. An entire wall is set up…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhanVEX2ZBEAE",
            "text": "A beautiful bar in the upper west side is a great Bar just in the middle of 81 street and 82 street the have amazing beers and a good food to enjoying.\nThe place is open till 4m so you have time to have a cold beer after work that do have  a food menu so you can have food and also a beer the atmosphere is a plus is a local bar but with friendly staff after all good bar to spending some time in there"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidnFubUlnEAE",
            "text": "Really cool spot. My husband is Irish and was looking for a good pint of Guinness. Unfortunately the bartenders didn’t know how to properly pour it, but good vibes overall."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOFBlVE9REAE",
            "text": "Great Irish pub! Super cozy, great atmosphere, many TVs if you’re looking for a place to watch sports and great beer selection! If you get hungry, they have popcorns or hot dogs for $2! Definitely coming back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4Mi1ySWJREAE",
            "text": "Hands down one of the dopest spots I have walked into !! The drinks were amazing !! Bartender top Notch !! I’ll drive down from Long Island for a drink again !!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeC15QUJ3EAE",
            "text": "Really cool cocktail bar, love the decor and name of the drinks. We always wanted to come here but it would always be packed. The place is small inside as well l, but definitely worth coming here."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnaVp1WmxRRRAB",
            "text": "So nice seeing Josh back behind the bar after a 10 year hiatus, such a nice, solid person!  And as always, it is a so much fun hanging out at a true neighborhood spot!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvc195aWxRRRAB",
            "text": "Very nice bar! It’s got a kind of old school bar feel, like one I’d picture in an old movie scene with someone having a conversation with the bartender at a single old wooden bar.\n\nLots of beer selections and a nice winter cocktail selection. I preferred the drink with the peppermint candy rim - I want to say it was called “Winter is coming” or something similar.\n\nRegardless, a nice spot to stop in for beer or a cocktail depending on your preference. Nice service while we were there as well and reasonably (typically) priced.\n\n#thedeadpoet #newyork #ny #bar #cocktails #nyc"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJc3JuSFl3EAE",
            "text": "Had a quick pint in there, spent around 20 min in the place, tops. It's nice neighborhood pub, charming and cozy, the opposite of the gaudy tourist trap ones that plague Manhattan. The staff was friendly, the Guinness was cold and served correctly, and the price was OK for a pub so close to the Central Park ($6 a pint)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOU5DNUpREAE",
            "text": "Its a great place to know new people, relax and enjoy a beer or a glass of wine. I tried one of the cocktails, is was ok. The wine was delicious, i tried the cabernet."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPN2JLdkNREAE",
            "text": "We went to the Dead Poet. We drank and Dead Poet, and we got the keep the glass. The cocktail was good and they had good beer on tap. Charming little pub. Note: there is not really food here but you are allowed to bring in outside food."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNOF9xWUpnEAE",
            "text": "I've been to a good number of places in New York. Granted, a neighborhood bar is not the place where you would typically expect the most sophisticated form of hospitality. However, the service at this place is absolutely out of line. The…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcjlLcUZBEAE",
            "text": "Second time visiting, this time we came a little earlier because we were in the area and loved it so much our first visit. The drinks are really creative and everyone on the staff is always friendly, later visits are perfect for a bar…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidl96UmtnRRAB",
            "text": "Guinness was smooth and had a great pour. You CAN bring your own food!\n\nCan be packed with standing-room only at the bar. Very lively with many screens to watch the different sporting games going on.\n\nShout out to the servers who were great at checking in on how we were doing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1cUtXdnBBRRAB",
            "text": "Please see the owners response below.  My original review is still in quotes. If the barriers were placed there to cover up an oil slick good on them.  I'm keeping the original review here for others that may have seen this photo circulating online.  This was not my photo.\n\n\"Imagine having the gall to block a bike lane with your sign. Disgusting behavior from the management.\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMDdIbkpREAE",
            "text": "My favorite bar on the UWS, a great cozy pub with a solid beer selection, atmosphere, and service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbWFMS1V3EAE",
            "text": "Amazing spot!! Best bar in UWS! Kyler is a great bartender, great times here! Loved that we got hot dogs and popcorn for $2. Good prices and wonderful time"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdE9EdU9REAE",
            "text": "Great little cozy Irish bar, amazing selection of drinks, friendly staff and reasonably priced. Definitely recommend if you’re in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM29hVGFBEAE",
            "text": "Small irish bar. I wouldn’t recommend getting a cocktail just stick to the beers. Good for a date night.. not with a group of friends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNXNYa19RRRAB",
            "text": "Good local hangout for a quick post workday drink. Options nearby for food to bring in. They Pour a proper pint of Guinness."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OHRtTFFREAE",
            "text": "This is a very laid back, no hustle bustle, type of bar.  Small selection of beer on tap(like 13) but tried almost all and they are great.  They 5 oz beer flights which is great for people not normally into IPA.  The bartender is great, very informative and likes to chat.  They also have a huge selection of sours, ciders, IPAs, and other canned items."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxOXQ2VDJ3RRAB",
            "text": "I loved sitting at the bar and seeing the wide variety of liquors on the shelf. the music/ambiance was great and the cocktails were delicious. the bartenders knew the names of all regulars which was nice to see. would come back for a quick drink again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcXZLTC1nRRAB",
            "text": "Absolute small icon of a traditional Irish pub. Perfect atmosphere for a respite on the UWS. Hot dogs apparently quite good. Available all day for $2.75. And you can bring your own food if you desire."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZX05Yc1h3EAE",
            "text": "Great Irish pub style bar. The have drink specials and if you share your birthday with a famous poet your first drink is free."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMLUxDdFVBEAE",
            "text": "Cool spot. Bartender was outright standoffish I asked for a well tequila soda and charged $15. I didn't really question it tipped him. Figured he was just tired or whatever until the next party pulls up and he suddenly could offer adequate service. Just not worth repeating"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cEpHZThnRRAB",
            "text": "Best spot for a Guinness in UWS, our new favorite pub! Fun selection of music from the juke box!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMU5HMWdRRRAB",
            "text": "Came here on St Patty's day. The vibe was amazing, great bartenders. Only downside is that the bar area is not designed well. Can barely stand or walk past people in the narrow entrance. Outside patio has better seating though."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNDU2cE5BEAE",
            "text": "Nice cozy place. Normal prices. Every day special on happy hours. Good stop for a drink, ... Or 2"
        }
    ],
    "reviews_count": 66
}