{
    "name": "The Viand",
    "place_id": "ChIJL2hSIIVYwokRCSu36-UOVF0",
    "grid": "MN7",
    "address": "517 Columbus Ave, New York, NY 10024, USA",
    "rating": 4.3,
    "user_ratings_total": 760,
    "phone_number": "(212) 362-3333",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUFdrRkxiekprWlU1NlpVOHhXbnBOVjI5SlVrRRAB",
            "text": "This is a diner with service and food like none other! Brunch is AMAZING! The weekend brunch and drink specials are perfect! Nikki, Valentina, and Lisa, and of course Victor are awesome and so on top of every table. No one is left wanting. We live in the neighborhood and know all the restaurants and if you want great food, great service, and delicious drinks you should eat at Viand! Oh and I believe the manager, Nick (?) has something to do with hiring the best of the best!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKblpYZDJha001VFhkUU4waG9hSGswY0RJMFVuYxAB",
            "text": "Hate to be like this but seriously this is the  worst breakfast we’ve had in I don’t know how long. Wanting to stop at a place to have breakfast since husband and I just came from a successful meeting. The coffee we had (him a latte and me a cappuccino) were sooo watery, he had an omelette which was pretty whatever and I had the nova lox benedict eggs which I was having a really hard time to eat and ended up leaving a little less than half of it, I’m writing this review with nausea from the food. Depressing way to start the day, had to come to our go to cafeteria to get a latte to actually feel something and a mint green tea to help with the nausea :( were joking with the husband that they should change the name to No Spice :((("
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdlNuWldVSEpFZUd4TFoyTmxlR1UwVDBzeVYxRRAB",
            "text": "Lovely restaurant"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSlJGSnJSM0pmT0haVVkwaEpRMGhSZWtKUGQxRRAB",
            "text": "I came here for late lunch and it was delicious! I got a happy hour Bellini, and their chicken souvlaki. Valentina was my server and she was very sweet! It was nice and peaceful, and I will definitely be returning 🥰"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SQ1FtUnlOazAyVmpBMVVUSk5WMjk1WDBZdFRtYxAB",
            "text": "Don’t order the burrito. Worst I’ve ever had. The chicken had Italian seasoning on it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVFJVdE5SMkZOUkRaSGJHZ3RjRzlEZGtzeVExRRAB",
            "text": "We  just moved from Europe.The staff here are so nice! Good food,big portions and lots of choice. We will be back..again..  :D"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQmJVVjBkMGhHYjBoM2VHMHpPREpCTUMxRVoyYxAB",
            "text": "The food was good. Also, this place had great coffee."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kblptRldWVFZ2VTJ4blJISTVNekZYY1RWTlQyYxAB",
            "text": "If you're going to the natural History museum this is a great spot to eat with your family!\n\nMy family had a really delicious dinner here tonight! I have some very picky kids. It's rare that the adults and kids all loved their dishes! The smash burger was amazing, my husband loved the Ruben. There was a kids meal that included a drink which is rare and a nice treat. The staff was lovely, food came quickly. It was a perfect end to a museum trip."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa1FuVnRlRmhpVDJGUlkyRjZOMnRzT0hJMWJsRRAB",
            "text": "I came here hoping the turkey sandwich would be as fabulous as the one at Viand on Madison Avenue but was very disappointed. The turkey was very dry and the rye bread was stale.Oh well, I guess I’ll have to go to the UES for the better version. Location is great though and the staff was nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKa1YyTkNjRzVwTW5Kc2NVVmlhemxJWjNSZldtYxAB",
            "text": "Great staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUVUyWnJPRGhHU1MxV1RWUXpXVzVKVGpsamFuYxAB",
            "text": "A great neighborhood diner. The service for our family of 8 get together was superb. We all enjoyed our food except for the breakfast potatoes- needed seasoning but I would go again. The restaurant accommodated us well. Thank you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ1JIUkhibmhTU21GNVdrNDRhbUozY0VwVWRXYxAB",
            "text": "Good portion  and great service"
        },
        {
            "date": "수정일: 2달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJdE5WcEVSWHBrTFZwelMzaExZbUp4VjBVMWMxRRAB",
            "text": "מקום טוב ונחמד"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGd1RITXdXVmN4YTFaT1gyRnNYMTl2TlZZMk4wRRAB",
            "text": "Always extremely fast and kid friendly. The guy in front (I think his name was Jimmy) was handling a busy Sunday crowd but still managed to make everything work well."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdlpFSTVUMDlMYzJaaGRHNVlSVkYxZDBnNWNuYxAB",
            "text": "The gluten free pancakes were bad. I’d try something else tho next time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SlVWRlliamhPVFhodVVVSlVWVUZ4UmkxNVFrRRAB",
            "text": "Solid upscale diner with great service and a relaxing setting. Came here after a morning at the museum. Two thumbs up from my kiddo on the kids menu. The salmon burger was good but not great. That’s all right it was good enough. I’d try something else next time. Service was perfect."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWFN5MXNibkUwTlhWS05tcFZPRFJVYmpWRU9WRRAB",
            "text": "i'm sorry, the food is really bad lol. I have gone twice and everyone i know who has gone (4 different people) have said that their meals were also terrible. Not sure why it's rated so highly. I am not trying to be mean - maybe the chefs could try their food and tweak it a bit!\nFor reference: cold, frozen, uncooked potatoes, cold, yucky penne alla vodka, rubbery stretchy cheese in omelettes, but fine pancakes and delicious homemade jam!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdWg2TDJzX2ZPR1dBEAE",
            "text": "I ordered through postmates and my steak was made perfectly!! I will definitely be ordering from here again! The onion rings were delicious as well as my baked potato!! The way they packaged my food was great. Nothing spilled! Thank you Viand Diner!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIaW9memhRRRAB",
            "text": "* Dulce de leche french toast was refreshing & not too sweet\n* the feta was overpowering in the Greek omelette"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMRGl2Y1d5c0pXOUNREAE",
            "text": "We received excellent service from Mikki.L.\n\nI highly recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQcjdodXVNLXN6bEN3EAE",
            "text": "The person who answers the phone is VERY  rude and then the manager is ALSO very rude. I was a good customer there until I had to call and ask a question. I will never buy from them again! When you own an establishment you should be happy that people use your services and be polite. HORRIBLE"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZak02NUxBEAE",
            "text": "La pizza de pollo estaba muy rica. Los platos son muy grandes y el precio es bueno"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPcjhqZjVBRRAB",
            "text": "I will never return to this place.  After YEARS of loyalty, I was given the wrong meal (which happens all the time) and got NO apology---my boyfriend's meal was finished when my proper meal arrived.  The waitress did not apologize for messing up my order; and the manager didn't either.  NO discount or other comp offered. I wrote and called, was given an \"apology\" and told that maybe they would've given me a discount the next time I go (there is no next time).\n\nI am disgusted by how they treat longtime customers."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM2NyZXBBRRAB",
            "text": "Atención en español en cuanto nos escucharon hablar. Servicio de 10. Muy recomendable el sandwich de Pastrami. Te quedas satisfecho tras pedirlo. Precios acordes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvelB1c0xnEAE",
            "text": "Dis place is da bomb..."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvajlDOU53EAE",
            "text": "Fuimos a tomar algo y nos intentaron tomar y no cobrarnos los precios de la happy hour con bebidas y comida. Nos intentaron cobrar de más en todo, el servicio fue realmente pésimo. No lo recomendaría para nada y cuidado con los precios si sois turistas, mirad bien lo que os cobran cuando os traigan la cuenta.\nPésimo."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaS1mUVZ3EAE",
            "text": "We LOVE this place and eat there several times a week!  Every single thing on the menu is delicious and the service is always perfect!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJa3RuV2R3EAE",
            "text": "Ordered a Farmer’s Benedict: the ‘Hollandaise’ sauce was basically a flour and oil rue with color added, eggs were fully undercooked, that is, the whites were clear transparent and gooey!! Then, the hash browns were overcooked and crisp like chips and the ‘bed of vegetables’ was very greasy and just barely warm. I sent it back and got a massive attitude from the waitress, Natalie. It took over 20 minutes for my replacement order or spinach pie to arrive. When we asked about it she said it takes longer than 2 minutes to fix. Then she tried to overcharge for something we didn’t order on the check at the end. She was rude and very unfriendly. Needless to say, I won’t be returning. Just be very careful what you order there. They may be able to handle baked potatoes or even pancakes, but I wouldn’t trust them with anything else."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LTVfanl3RRAB",
            "text": "Excellent!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eGNhUWtnRRAB",
            "text": "I tried to send this via your website, but it doesn’t work.  So here it is.\n\nWhy is extra dressing on a chicken Ceasar wrap so hard to comprehend?  For $24 a…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bnZiZUhBEAE",
            "text": "Possibly the worst omelette I’ve ever had. Dry as a bone."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NE1TdVB3EAE",
            "text": "My family visited this place last year when my son participated in a track event through the weekend. We found this place by accident and thought about the great food and atmosphere for a full year. Back at Nike Nationals, we looked forward to revisiting this restaurant. Still great food! Locals would come in, know the staff by name, and leave with full bellies and smiles.\nI look forward to visiting again next year!\n\nChicken parm, smash burger, veggie panini. Delicious and large portions."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbDVhTC1RRRAB",
            "text": "Visited today, ordered classic burger, it was cooked perfect for medium.  The fries are good too, a big portion.  The service is great.  The place is cozy with cute booths."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReHU2d25RRRAB",
            "text": "Great service ! Food can improve but it does the job for the brunch menu! (Hashbrown potatoes were burned and uncooked at the same time)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX29UX0hnEAE",
            "text": "We ordered the chicken and waffles and the breakfast quesadilla. The chicken and waffles was amazing, the quesadilla was pretty okay and the service was great!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMi1HZUd3EAE",
            "text": "I love this place."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNGVlN05nEAE",
            "text": "Perfect coffee spot"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnd0tTYW53RRAB",
            "text": "Came to the restaurant thinking it should be a decent meal at decent price. The kids’ mac and cheese and French toast dishes were barely edible. My kids knew that the cheese is Velveeta cheese and the “syrup” is not real maple syrup (despite being described as such on the menu). I had the Impossible burger were bland (again made with Velveeta cheese). On top of that, the juices tasted off (apple and cranberry). All are overpriced for what they are."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBb2VmVFhBEAE",
            "text": "Nice diner. Has an interesting menu with more than the typical breakfast selections. I had the shakshouka which was delicious. Attentive service.\nIt’s pretty tight seating wise, but typical for an NYC UWS local restaurant."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbHBhR2JBEAE",
            "text": "Visited this place way back in 2022 with some colleagues, it was good !\n\nFast forward to today , suffice to say - it’s still good !\n\nTried the ‘modern’ sandwich recommended by another reviewer and it was great !\n\nThe vibe is cozy , service was great.\n\nDefinitely would recommend this diner."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NW9IZWtnRRAB",
            "text": "45 years experience making this a upscale diner. Good coffee and happy hour specials\n\nPaul and Erick in management do a great job\nKudos to Victor the bus boy Olga and Leslie\n\nJanuary 2025 update:\nChicken noodle soup with a matzoh ball on top is one of the best in the city."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOWZLUnNBRRAB",
            "text": "Was full, but the food was good a good portion and them have a good service very nice people,..."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZ2N6bWZREAE",
            "text": "Everything I hoped for. We’re over from the UK and I really wanted to find a fantastic American diner and this is it.\n\nAwesome food and service in a classic diner environment."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbnQ3NkFREAE",
            "text": "Amazing philly cheesesteak!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNUtqdW5nRRAB",
            "text": "Nice brunch on the EWS"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcU9YN09REAE",
            "text": "Mid, bland food and overpriced. Service and atmosphere were fine.\n\nTried multiple items. Huevos rancheros had no flavor. The refried beans and vegetable items tasted and felt like they came out of a pre prepped bag/can.\n\nChorizo was overcooked and dry\n\nMaybe stick to the basics here like eggs and pancakes."
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmal83OTNBRRAB",
            "text": "Super diner, on y mange très bien !! A faire les yeux fermés et je suis difficile niveau hygiène et nourriture...\nLa note de 4,3 est vraiment très basse par rapport à un autre diner fait il y a 2 jours avec une note de 4,5 vraiment pas mérité..."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmX2JxSDVRRRAB",
            "text": "I thought, okay, a diner. But it's so much more: a clean, casual, relaxed, full service restaurant with a wonderful selection of delicious food. The staff could not have been nicer. A lovely experience! I'll be back."
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeGFYZ05nEAE",
            "text": "Nous avons très bien mangé. Les frittes sont hyper bonnes."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbVo3WjVnRRAB",
            "text": "One of the rare places that doesn't overcharge for asking gluten free pancakes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbEpEaGp3RRAB",
            "text": "Spending the weekend in NYC and looked for a place to have breakfast near Central Park and to our good fortune found Viand!! Solid reviews and really deserves more than a 4.3 rating..come on folks, hype up your favorite spots… because this place a strong and steady flow of local New Yorkers for breakfast (especially families with young kids).\nMy breakfast sandwich, The Modern, was delicious! I was able to change the ciabatta bread to the brioche bun which was soft and sweet and the tomato bacon jam was out of this world, yummy. I’ll definitely add bacon to this sandwich next time. My partner got the steak and eggs, good sized steak, well seasoned, cooked to the desired temperature and the eggs they use here are huge and hearty! We don’t usually like shredded hash browns ( prefer breakfast potatoes) but their hash browns are pretty good with onions and peppers and again, well seasoned.\nAtmosphere is very nice, small but not cramped, clean, and the staff are wonderful; friendly and attentive without being overbearing and they seem to work well as a team to serve all customers. Overall this was a really great experience, slight dings for the fact that the coffee was pretty weak (and o don’t like strong coffee so that’s saying something), and the orange juice was a bit tart/bitter. But that aside we enjoyed it so much we ordered a salad and Cuban sandwich to-go for lunch later!\nAwesome food, great service… stop by!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMX2NXbUdBEAE",
            "text": "I highly recommend this establishment!  From the home orange juice to the delicious eggs Benedict.   The hollandaise sauce had just the little extra love that made it different from many others that I have had.\n\nService was kind, quick, and able to give solid recommendations.  The restaurant and restrooms were very clean!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ei1QcDJ3RRAB",
            "text": "I walk past this diner all the time and finally decided to try it. Cozy diner with cute booths. It was busy and raining when I came in the employees were very accommodating as I opted for their covered outdoor seating and changed my mind preferring indoor seating. The chicken souvlaki was a little messy to eat but delicious. The chicken pesto panini was good but it would’ve liked a tad more chicken. The fries were really good, I would go back just for them and curious about their breakfast items like their dulce de leche French toast and eggs w/ corn-beef hash"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROM3Nyb1lnEAE",
            "text": "I highly recommend this place. We went for brunch on Sunday. We were 3, and with no reservation, we waited 30 minutes. It really goes faster if you are. The portions are very large. Pancakes were tasty and one of the best breakfast sandwiches. Also, they have gluten-free pancakes and gluten-free buns or toasts."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bnRISEp3EAE",
            "text": "Hands-down, some of the best service I’ve had in the city. Our kids were treated like gold. The gluten-free Cuban sandwich was astoundingly good."
        },
        {
            "date": "11달 전",
            "language": "pt",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcmVlVzNBRRAB",
            "text": "Hambúrguer delicioso , suculento. Na medida certa. E as batatas fritas muito saborosas. Pena que o pão amoleceu rápido."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1c2JpQ2dnRRAB",
            "text": "Came here for a weekend brunch and it did NOT disappoint. Their benedicts are amazing. The eggs in purgatory was SO delicious I still think about it from time to time!! Service was great; we sat outside and it was honestly really lovely. If you're looking for a good breakfast spot that's casual yet classy, this is the one!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1MnBlcjlRRRAB",
            "text": "Great experience. The atmosphere was welcoming and the staff was friendly and helpful if we needed something. The food was delicious, and the portions were great. I would definitely come back here again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbi1fdE9REAE",
            "text": "They have almost everything we would expected in a diner for breakfast. The Texas wrap, Greek omelette with bacons, pancakes were good for the adults. The kids meals: chicken fingers with French fries, hot dog, and French toasts with soft…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdGNTSmZ3EAE",
            "text": "We were quite impressed with the food and the service at the Viand diner. Last night we had the turkey meatloaf with green beans and a sweet potato. Everything was done to perfection and very tasty. Tonight we stopped in for dessert and…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzcDRqbEpREAE",
            "text": "Liked it a lot! Honestly, was a default decision because we were running late for a concert. Turned out to be a great decision.\n\nWe told hostess we were kind of in a hurry. No problem. Seated, immediately attended. Not attitude from anyone. It's a very comfy place. Liked the layout and the decor - contemporary but very comfy the way a diner should be.\n\nFood was terrific (excellent burger), nice wine selection if you're into that, portions generous, service friendly and efficient. We liked it so much, we came back after the concert for desert."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLLXBDLXVRRRAB",
            "text": "Many of the brunch items come with orange juice and coffee, which is really generous and welcome. The food reminds me of better quality diner fare with a homeyness.\n\nThe space is a bit tight and a wee bit claustrophobia inducing. If you can get a table, opt for that no matter how nice the booths appear."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N0tIZS1BRRAB",
            "text": "Nice family diner. Great place to have a simple, functional basic breakfast . Service was fast, efficient and the lady who served us was very courteous. If you are looking for eggs, toast, omelette etc then Viand is a good option to consider"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXbnRYc0dnEAE",
            "text": "A nice cozy diner. Great place for brunch on weekends specially if you are looking for an early one. They open around 7am which is rare in the area. The shahsuka is really good. The French Toast is really large so be ready :) very friendly staff."
        },
        {
            "date": "10달 전",
            "language": "it",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dGNialZBEAE",
            "text": "Abbiamo preso i pancake con Nutella banana noci e panna porzione enorme da dividere. La cameriera molto gentile. Non sapendolo ci hanno fatto lo sconto perché abbiamo pagato cash"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbzkyNW1BRRAB",
            "text": "TRY THE SMASHED BURGER!\nI have been in this restaurant with several friends and I had the opportunity to try not just the smashed burger but also the other burgers as well as the burrito. Knowing all that I have to say that the smashed burger was the best option by far… being the other ones just okay options to go for."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacnFlS01nEAE",
            "text": "We stumbled into this restaurant and I am glad we did too. The food was HUGE and tasty. It all arrived quickly. The menu was huge with a variety of items to choose from\nI loved my gyros!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcnBxYndBRRAB",
            "text": "Really good food in a quaint dinner with friendly service. Definitely recommend the dulce de leche French toast. My friend got the tiramisu pancakes and loved them."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSektQelVnEAE",
            "text": "Food is fine and tasty. There is a 3% 'convenance' fee for credit card use! Yes, it's gonna feel like the 80s... Cash is king.... Prices are normal so the 3% feel like the place is running on tight margins. Seats outside are nothing special, as long as it's a warm day, and hard to get waiters attention so try to be seated inside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZzdfMWxRRRAB",
            "text": "The Modern is one of the best breakfast sandwiches I’ve had in years! They don’t skimp on the egg and jam, and the ciabatta bread feels freshly made. Very reasonably priced too! $20 per person for a sandwich and coffee"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNXzRtWUN3EAE",
            "text": "Great brunch spot. Was seated timely on a Saturday morning.\nExcellent kids menu. Silver dollar pancakes were super cute\nThere is an additional charge for maple syrup btw\nThe service was excellent\nEggs Benedict with salmon was good\nChicken and waffles were good too\nGood portions\nHas orange juice and apple juice\nWould recommend! Walking distance to the AMNH which is cool"
        },
        {
            "date": "2년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd2RiRXFRRRAB",
            "text": "Byliśmy tam rodzinnie ale sami dorośli żona wybrała spaghetti i klopsikami wołowymi bardzo smaczne dobrze przyprawione jedyna uwaga to wielkość klopsików fajnie jak by były mniejsze curuś zjadła sandwich z kurczakiem i sobie chwaliła a ja stek wołowy z fasolką i frytkami i bardzo polecam średnio wysmażony był naprawdę SMACZNY PECAM !!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaE95RUNREAE",
            "text": "Been to all 3 viands.\n\nThis one on columbus ave is not the best Viand.\n\nViand UES and Viand Broadway are 5 stars. Good tasty diner food.\n\nBut Viand Columbus is 4 star because service is good.\n\nSomehow eggs, sausage, breakfast items have no taste no flavor.\n\nIt's the same items but not sure why this Viand isn't good. Pancakes are ok though."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNXBqWFRBEAE",
            "text": "Visited early on a Sunday after the NYC Half Marathon, starving to say the least. Very welcoming staff, and the place is clean and tidy.\n\nOrdered the Huevos Rancheros and was quite disappointed. The quality of the ingredients seemed poor, as was the execution - no real flavor to any of the food. Service is ok and toilets are clean.\n\nIt is a relatively new place, and it's pricey for the output, but they definitely need a menu/chef overhaul if they are going to compete in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dGZfMm93RRAB",
            "text": "Très bon repas . Dîner en famille.  Bonne portion à partager. Avons mangé la salade de quinoa. Et le panini poulet au pesto. Limonade fraîche. Très bon service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMnFMMWRBEAE",
            "text": "Really great food, quick and friendly service, nice atmosphere! Our best breakfast during our 2 week US vacation!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdk5uNDB3RRAB",
            "text": "I had an unpleasant meal this afternoon.\nQuantity doesn’t mean quality in this place.\n\n1rst:The hash browns where a bunch of rough chopped potatoes nearly toasted.\n2nd: $30 tuna dish with undercooked brocoli and overcooked tuna. It was on the “chef’s specials”.\n\nThe prices could be reflected on the quality."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNy1LdFN3EAE",
            "text": "I wanted to get a seat at the bar and I was the only customer inside. There is an ample amount of outdoor seating. I ordered a cheeseburger with mozzarella. The burger was good, and I had a nice time eating the fries. Their on-tap beer…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZMVpMSkl3EAE",
            "text": "Ugh... Super disappointed. I ordered the turkey triple decker and it was the worst thing ever. There was maybe one piece of bacon and the driest turkey I’ve ever had. They didn’t think to add a dressing, had to ask for mayo and ketchup and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxb2ZXeXhnRRAB",
            "text": "The place is ok, large portions, but nothing special. A little expensive I think. I ordered eggs benedict and the bread was burnt."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPay1XS2lRRRAB",
            "text": "Best brunch place I've had in NYC! I recommend you buy off the Brunch Specials menu and you get a free drink. The Southern Eggs Benedict (exquisite and luxurious gritz) and Dulce de Leche French Toast (they don't skimp - best for a sweet tooth) are my favorites dishes! The atmosphere is lively on any Saturday or Sunday."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjMUt1MWVBEAE",
            "text": "Short Rib Gnocchi. Skip everything and go straight for the SRG. Absolutely a #WoWFactor times 100. Best Short Rib dish I've had...ever. My girlfriend's daughter recommended the place, as she lives around the block, and I was gonna go for the shrimp & scallops but when I asked the waitress which I should choose...she emphatically said, \"Definitely the short ribs!\".\n\nEverything else was on point... especially the service. Will be back."
        },
        {
            "date": "10달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2b182Y0t3EAE",
            "text": "Super leckeres Frühstück sehr guter Service einfach perfekt um in den Tag zu starten.\n\nEine absolute Empfehlung für den Urlaub"
        }
    ],
    "reviews_count": 83
}