{
    "name": "El Fish Marisqueria",
    "place_id": "ChIJs2_eoNBZwokR774H9Y29ANg",
    "grid": "MN7",
    "address": "155 Amsterdam Ave, New York, NY 10023, USA",
    "rating": 4.6,
    "user_ratings_total": 274,
    "phone_number": "(212) 874-2000",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbE4xcEhaRXRxVDB3M2NXdEpjbmRTUzBNeFUyYxAB",
            "text": "This fusion Mexican restaurant that is trying to fuse with everything - Chinese via the kung pao, German via the schnitzel, French via the truffle - is unevenly hit or miss.\n\nThe good: lobster aquachile (unique), baked clams (rich and savory), swordfish schnitzel (also unique)\n\nThe just ok: tostada ensenada (the avocado was like a brick and really needed to be chopped up), tacos de carnitas (not memorable)\n\nThe puzzling: pescado frito (why was this so sweet)\n\nAlso, this is a seafood focused restaurant so I get that red wine isn't the focus, but the red wine is weirdly super cold. Ours was cold, and the group next to us also asked why the red wine was so cold."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVFlVbFViVXMxTkRWVWNXcHFRMkpDYVVjM1VtYxAB",
            "text": "Cute all around experience. Watch their hours as they do close the kitchen to shift for dinner."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wM1VEZDVjR0ZxTW1RdFptNTJlVWczVlhSMloyYxAB",
            "text": "Delicious, amazing combinations of flavours and quality products!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWVIwNXBWbTV5V1ZSa1R6WlFRek5TVjNSYVRIYxAB",
            "text": "I’ve been here many times and the sole reason for my poor review is the male manager who usually wears a hat. All of the wait staff and bartenders have been absolutely lovely and on top of things. The food, cocktails, and atmosphere are also fantastic. The man in the hat, however, kicked us out once (despite MANY empty tables and the fact that it wasn’t even 5pm yet) because we were only ordering drinks and apps and because he was not fond of our toddler (who was not making a scene or screaming but was talking louder than he liked). A few other times he addressed us rudely even as we started leaving the child with a sitter. A few friends came with us at 8 pm the other night for cocktails and were standing at the bar. NO ONE was rowdy or inappropriate. Everyone was ordering. He was rude to them as well when they entered and directed the bar staff to hurry them out. He said it in Spanish, unaware that we could understand. Just truly ruins an excellent restaurant and clearly doesn’t care if he costs his staff money by cutting our off ordering on high mark up items."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWU5XNURiRkYwVm10bFVVSk1lRnBEV2xGcFlVRRAB",
            "text": "The restaurant accommodated our big party without hesitation and with great service. Staff members deliver service excellence equal to their dishes. I reliably prefer desserts, and these were standouts. The restaurant shows beautiful surroundings. Stop by this spot and you'll leave impressed."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcGVWSjZUVk5mYUZKUGVXUTJjbFJVUWs1a2RFRRAB",
            "text": "Love the restaurant so much!!\nVery delicious\nI like the baked clams and lobster fried rice"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTmVETlZOMjlVVTFOMVRsbHVNV3RGWm1aTVVVRRAB",
            "text": "We had dinner at El Fish Marisqueria on a Sunday and everything we ordered - except for the salmon entree - was outstanding. The salmon skewers were beautifully presented, but the cut itself felt off (too fatty, maybe salmon belly?) and didn’t harmonize with the rest of the meal.\n\nThe experience overall was very nice, though. Service is attentive, the hostess at the entrance does a fantastic job and the dining room is not only well-designed but also surprisingly quiet. Overall, it’s a well-run, elegant spot with great food and atmosphere. I’d give it 4.5 stars if Google Maps allowed it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psT01pMWxTRUpCTVhoelZVTTFVRkprYlUwMFduYxAB",
            "text": "Delicious Mexican seafood. Every dish was flavorful and had a good portion of seafood. I would recommend the Cobb Caesar and the Lobster Fideo Seco. I definitely would come back! The staff was very friendly and the restaurant itself was very cozy"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UVVVbEpXbUZZTlVkeU16ZGFMV3M1T0RCclpVRRAB",
            "text": "Went here before a show in Lincoln Center. Really great food and service. They worked within the timeframe we provided in order to make our show and was one of the best meals that I have had in a long time. Definitely recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMGJWSnFRMWRtUWt0dGN6Tlhhbms0TkdwRk1FRRAB",
            "text": "The kitchen and service teams both deserve recognition here. The servings here are massive. Their personnel were willing to adapt and provided reliable assistance. El Fish Marisqueria created an atmosphere of culinary wonder! The local scene is enhanced by this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFZXMUdjVk5XUmt0M2VtdG1XRXh3TTFvMlZHYxAB",
            "text": "The food was fresh but fairly average in flavor, and a bit pricey for what’s offered. I would highlight the little empanadas, their were quite good. The staff was friendly, though service was on the slower side, and our waiter wasn’t able to explain the specials very clearly. We also didn’t end up receiving the second bottle of sparkling water we ordered. Overall, not a bad experience, but I’m not sure I’d choose to come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTVREbHpOR1pQWTJ4SlpEQlBOVzg0WDNCcWVuYxAB",
            "text": "Elevated Mexican dishes on the upper west side. Food is a little slow to come out but the service and atmosphere are lovely. The Cob Caesar salad is very generously portioned and filled with seafood - highly recommended!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaldXOURTRGRHYUc4d2JIQjFjRzFxTnpsbFlWRRAB",
            "text": "This one is an absolute gem .  A fantastic fusion of seafood and authentic Mexican fare.  Brunch here is a treat .  On top of the star worthy food , the atmosphere and service are spectacular.  It doesn’t get any better or any more modern nyc .  Don’t miss this !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWVpFRmpiVE5rTkRGNWRVeDBUR2RJYTNCcE9GRRAB",
            "text": "Simply outstanding.  On the expensive side but is worth every $.  Service is quite attentive. Clearly staff is well trained.  We had Yucan fish chip which is fresh and flavorful. The best chip we had as they seem to be just coming out kitchen frier.  Tuna tartar was creative when they came out like taco. For main, we shared fried black bass over corn tomato-egg rice which is fried just right, seasoned just right.  The fired fish bone was justly lightly prepared and crispy, I finished all the bones! Definitely very happy an UWS restaurant that offers food with love ( which is quite rare these days IMO)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMVQwaDZZVGhOV210UU4xcE1kbEZLYkVsMGIzYxAB",
            "text": "Food and service were great.  We had the fried bass, cod, steak dish and a few appetizers, all of which were spectacular.  Servers were very attentive and friendly with our toddler (who also loved the meal)."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abVIxTnRSMFZwYVhsRmFYRndUMEpUVmxaaVdXYxAB",
            "text": "La comida perfecta, pero hay un señor Ariel que daña la imagen del restaurante. Es prepotente y mal educado. Le falta calidad humana."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMVR6RnRhRXRYY0VKVVNVODVhbk5xVWpWclpHYxAB",
            "text": "The name may sound Spanish or Mexican but the food does not always reflect that cuisine, or at least it is the five star version of that cuisine. There are so many excellent dishes at this place that it’s hard to recommend one. The tuna tacos, the grilled octopus, the Caesar salad, the fish dip, and the brunch dishes are all superb. The customer service is also excellent, as are the desserts. We continue to make this place a regular spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNU9UaG9ObXBLUWs1QmNHNXNaR3QyYlRKVk5XYxAB",
            "text": "The restaurant was chic, although the ac was not keeping up with the 96° weather. The service was fast and attentive, and the food was delicious. I would absolutely return. The salmon skewers were perfectly cooked and paired well with the rice. My friend enjoyed her branzino."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NNE5XaG5UWGhGT1ZvMlFtUXlTR3BHVjIxcVVYYxAB",
            "text": "una delicia! 10 de 10. Vuelvo y vuelvo!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdmJVVTFlWGREZFUxR1UybDBXRzkxZUVoNFNuYxAB",
            "text": "Great choice for a meal before an afternoon performance at the Lincoln Center. Everything was delicious and great service."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNweDViZXhRRRAB",
            "text": "The Mexican/Seafood theme sounded like a gimmick but they deliver the goods. I think the Langosta Ensenada (lobster with fried rice) is their best dish, but also great was the Brochetas de Salmon Kung Pao and Baked Clams, which tasted more like a delicious soup with clam and chorizo. The ostiones a las brasas (baked oysters) where also very good with a butter, charred flavor. Finally, I liked the Fideo Seco, which was sweat and creamy, sorta like an a la vodka sauce with chunks of lobster mixed in. Yum!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obmFETnBibmRxT1d4eFNqRmZialZVTUVGcFFtYxAB",
            "text": "Overall a good experience. Fideo seco was amazing! I would avoid Jalea & Tostada de Atun!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twaVRsTlNjMmwwY1U0eGNqVjNWbFJ2Ykd4aWRIYxAB",
            "text": "The food in this restaurant is pretty good. the atmosphere is pretty good, but keep in mind. You are in the upper west, so the crowd was mostly older people, but still with good vibe. Overall, at dinner, the restaurant was almost full. I wish that you would have more privacy. many tables are just 2 people, one next to the other. So you hear Everyone's conversation, so some lack of privacy, the cocktail where good the Margarita, the chef's Margarita, it was good. The mule was just okay, and the service was okay as well. Nothing too exciting. I wish they would pay more attention to our requests. Also they suggested more food than we could consume. So we had a lot of leftovers are on the table."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJd04wb3RhR3RLZWpWUWNtdGpUbDh5T1RkalZrRRAB",
            "text": "I came here to grab a quick drink after a long day of work and CESAR was just AMAZING, what a great guy, he made me the best Old Fashioned and had great conversation, the restaurant is excellent as well, recommended 100% I will absolutely come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNd05YTm5YMlpoU1doSExYTnVSbUpEY2tsS2VYYxAB",
            "text": "Incredible food and genuinely kind people. Everyone was very warm and welcoming. The service was amazing and the ambience is perfect. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkU1gzSjBZMkZ3TmxkSU1teFdVRmxGVUhVMU5FRRAB",
            "text": "An unexpected jewel on the UWS.  Exceptional service, food, atmosphere and value."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GS09UZDVTbEJSYjA4NWFscElZbmhtVUZOT1QzYxAB",
            "text": "Highly recommended,"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVVJsWjBMVFprUzFac05GVTBaSFl5U1VkQk9FRRAB",
            "text": "The atmosphere is quietly elegant, light, and feels open and airy. The noise level is low, so you can actually have a conversation. The service is flawless: no \"hovering\" by staff, but when we were ready for the next thing, a server magically appeared with just what we wanted. Unhurried, relaxed and professional. This crew takes pride in their work, and they should: it's excellent.\nWe had perfect cocktails to start. Clean, crisp flavors, simply presented. There's an expert behind the bar.\nWe skipped the tempting appetizer menu and went right into entrees. My husband had fried black bass with an asian twist; I had Bacalao with pureed artichoke, capers and savory micro greens with pickled veggies. The black bass was beautifully presented but somewhat generic in flavor. My dish was amazing; a different flavor balance in every bite, depending on what my fork found... umami flavor from the artichoke, delicate fresh cod, salty/sour notes from the capers, pickles and sharp fresh greens. It was delicious, served piping hot and beautifully plated.\nOur server suggested the dessert special, a Pavlova with fresh strawberries, hibiscus jelly and sorbet, and dried strawberries as well. We were skeptical but said \"yes\" and were glad we did... it was melt-in-your mouth and utterly divine. A generous portion to share.\nThe prices are on a par or even a little less than other fine dining places in the area. We felt we got excellent value for the cost. Location is convenient to Lincoln Center and the AMC cinemas.\nWe will be back. What a pleasant, delicious place. Recommended!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MU9VNUNiamxzYUhOYVVWaHJaa1poWldkQ1oyYxAB",
            "text": "We have patronized El Fish since opening. Spanish/asian fusion. Many flavors. Highly creative and imaginative offerings during holidays. Support staff are accommodating. The restaurant revolves around Ariel the manager who exudes energy, excitement and true understanding of food. Ariel is El Fish. Cuisine could reach 5 stars easily. El Fish is an Upper West Side gem."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FdFptSXpaRWhXUmpaU1FqVklOa1l0V0RsNllYYxAB",
            "text": "Great fajita and very professional service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KM1dWUnhSMFJ2ZEhOS1ZXMHhkMHA2UjNoRWMxRRAB",
            "text": "Lobster tacos were delightful"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRaTlqS2JREAE",
            "text": "The food here is really good.\n\nThe octopus was fantastic but the burger (brunch menu) is a MUST. It was divine...the fries did the burger justice as well.\n\nNice ambiance and good service.\n\nWe will definitely be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNdTM2Nkh0aXFLbnVBRRAB",
            "text": "Been there a few times during different days at different times and apparently the only way you get in if you have reservations or sit that bar yet over half of the tables are empty with no one coming in."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJVE91N0tHcnV6dTV3RRAB",
            "text": "Food okay but won’t come back. We found a fish tooth or something very sharp and small in the food. Very dangerous for kids. I didn’t bring this to the server immediately. Toward the end of our dinner, I showed it to the manager (I guess). He said sorry and said I should have told him earlier, which I didn’t know why does that matter. Then he left."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOckJqZlRDLThpZFFnEAE",
            "text": "More than a Mexican restaurant, is a great Latin food place on the UWS\nTotally recommended, can’t go wrong\nReasonably priced, good service and delicious food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZM083aTlBRRAB",
            "text": "On a recent visit to NYC and Lincoln Center we had dinner here at El Fish Marisqueria and were impressed with our meal.  We had Tostada Ensenada, Baked Clams (tomato based clams and chorizo baked clams - very flavorful), Fideo Seco (not a big fan of truffle but they use a light touch adding to not distracting to the dish) and Schnitzel de Pescado (my wife, skeptical about schnitzel fish, LOVED this dish and thought is original).  To give an idea of why we loved our meal, we really enjoyed the tostada and it was the favorite of the dishes. Our dessert were a real treat, as well.  The Churro Sundae was just decadent and it was like my wife discovered a love of pineapple with their Pastel de Piña.  El Fish will always be on our list of places to eat when we travel into the city."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdzRTOVV3EAE",
            "text": "Upmarket pricing, yet everything served may cause depression unless you forget that."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMnFYUTR3RRAB",
            "text": "Lovely, comfortable, dining restaurant. Great menu! Excellent service!"
        },
        {
            "date": "6달 전",
            "language": "da",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcEtqNTdnRRAB",
            "text": "Super hyggelig stemning og fantastisk mad med mange skønne smagsnuancer 😋😋"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMUwtM2hnRRAB",
            "text": "Went last night with a friend who had dined before and loved it. Got the seafood tower but had lots of issues with pieces of shells and overly briny oysters/clams. The lobster in the lobster and pumpkin soup was really overcooked and tough to chew. Everything else was good but nothing to write home about. The GM was hosting a group of what appeared to be friends at the table immediately next to us and was making a lot of misogynistic comments about partying with girls in France who got naked for him. Me and my female friend (again sitting directly next to them) were a little bit appalled. When this group of VIPs of the GM were sat we also noticed that servers started being very attentive to them but ignoring us as we tried to get the bill to pay and escape this awkward situation. Have told my friends to avoid."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NXVUdVpnEAE",
            "text": "fantastic food and a lovely staff. i highly recommend the fish dip with tortilla chips and the side of fried rice. their grilled octopus wasn’t bad either! the restaurant can be noisy (we dined in on a weekend night so perhaps it’s busier than) so if you have a bigger group it would probably make sense to sit further from the center."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OHVhZHR3RRAB",
            "text": "The reason I gave this locale 2 and not 1 stars is because of the staff. Very friendly and accommodating.\n\nOther than that, very mediocre restaurant. A questionable mix of American, Mexican and Asian (?!). Undercooked eggplant with an overly sweet glaze. NY strip with \"sea urchin butter\" (sounds interesting, but you could not tell the sea urchin gentle flavor at all). That was thrown on a bed of some cheap cheese, and a cold \"Great Value\" Walmart salsa. Sea urchin, lukewarm NT steak, cheap cheese and Walmart Salsa... You get the idea...\n\nSame cheap salsa stuff was served with the bronzini, where the tomatoes were canned tomatoes...\n\nLet alone the restaurant was out of 3 of the 4 of the sparkling wines on the menu...\n\nDefinitely not what one expects from a place where the entrees are on average 50$."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXZ1MG1RRRAB",
            "text": "Wonderful bday dinner dampened however by subpar grilled octopus that was tasteless and tough."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbDZmbUtBEAE",
            "text": "Wonderful flavours and good portions. Definitely going back. I’m officially a big fan of Mexican fine dining now. The tuna taquitos, grilled octopus, and swordfish schnitzel were amazing. Branzino with tortillas was good but the salad on top was a bit sour for my taste"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBck1iUHZRRRAB",
            "text": "The food is so delicious. I ordered fidio seco. Ohhh so greattt and yummmyy. Must to try.\n\nI ordered also the margarita and so good.\n\nThe servers are nice 😊"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNE5MOG1BRRAB",
            "text": "Made for a very nice evening in a casual atmosphere."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdkpIam93RRAB",
            "text": "El Fish Marisqueria:  The “Le Bernadin” Of High End Mexican Fusion Cuisine\n\nThank you Ariel Lacayo for another great restaurant on the upper west side!! You enter and are greeted by a wonderful hostess like Catalina.  Whether seated at the bar or a table, the experience is similar to a 3 star Michelin or NY Times reviewed restaurant.  The bartenders are expert mixologists and so friendly and outgoing if you like.  The service is impeccably choreographed.  The menu is diverse and intriguing.  The starter fish and other options are tantalizing and delicious:  I especially like the lobster bisque, baked clams, and tortilla and taco options.  Each main dish I have had is a treat and memorable: Some of my favorites are the lobster fideo (so original), lobster empanada, and the perfectly made medium rare (for me) fajitas to mention just a few.  Ending with the deserts poses a wonderful dilemma in choosing from a great and delicious selection.  The wine selection is extensive enough to cover all combinations to enhance each course.\n\nIn short, I love El Fish and have made it my second home for a great meal, especially since I live only two blocks away🙏🙏😊😊"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcnNqcjVBRRAB",
            "text": "We had a perfect meal. And frankly one of the most inventive and tasty in a while. Our server was just lovely with great recommendations. Our water glasses were never empty. Very attentive. I had the chefs margarita. Sooo good. Tuna tacos then sea bass special. Son had the pasta with truffles and seafood. Spectacular. For dessert a pineapple cake with roasted pineapple and pineapple sorbet. I’m still drooling. I absolutely cannot wait to return. This is an absolute gem."
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbTl6bC13RRAB",
            "text": "Cadre assez sympa, mais la nourriture mexicaine est plutôt américaine et assez médiocre   La meilleure chose est leur oyster bar. Surtout éviter leur “bread basket”"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2amVQX09BEAE",
            "text": "We went for weekend brunch and we were quite pleased with the great tasting, unique menu."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdGFtejlRRRAB",
            "text": "After finishing the New York marathon we arrived at this lovely restaurant. They served us very kindly. We had to sit at the bar and that was excellent. Pablo and Daniel served us, they are friendly people. We had a super delicious spicy tuna dish for dinner and the fish of the day, which was fantastic. IPA beer on tap and a Margarita. Dessert and espresso. Totally recommended. The chef is an artist, and the bartenders too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dTVidWZREAE",
            "text": "This was one of the most delicious meals I’ve had. We initially only ordered 6 oysters and quickly ordered a second round after devouring the fresh perfect bites. Really loved the lobster and clams as well. A unique Mexican - seafood fusion.\n\nService was phenomenal. I loved the interior decor and layout. Vibes were great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREZ3V6OGJ3EAE",
            "text": "I really enjoyed my time there, I would say from the hospitality level you feel compelled to stay there because it feels cozy and warm, you get to feel almost a sensual vibe on the space. I would definitely be back to have more drinks and food, in terms of food the quality is great, all the menu dishes are thoughtful, in terms of flavor I tried the Ceasar Salad, Jalen, octopus, fajitas with Strip and lobster tail, I can say that some of their mains are a bit on the bigger side, like shareable, have it in mind when you order or ask servers, Ivan was fantastic too. And the pineapple sponge cake is all a piece of art, well balanced. Still I need a bit more touch of seasoned for certain meats but overall an enjoyable stay. Be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd1llWmVBEAE",
            "text": "Good quality and flavor seafood spot. We ordered 2 appetizers and 2 entrees - all dishes were delicious. Service lagged a bit in the beginning but picked up later on and overall had pleasant experience. Adequate street parking in surrounding area (metered) and free after 7pm and all day Sunday. Unfortunately, we were too full for dessert. Ambiance was relaxing and right balance of upscaleness. Will come back here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOXFIc1N3EAE",
            "text": "We had a great dinner at this spot with our friends and family.  Lets start with the appetizers.  There was not one that came out that was not done perfect.  The portion size are decent but could be more compared to the prices for them but they did exceed expectations.  The oysters were fresh but the ones that were cooked with truffle were our favorite.  When it came time to the mains we all shared and so happy as were able to taste all the variety and great flavors of the fish and seafood.  So good we even ordered another round of entrées to share.  Do not skip the dessert and try the Flan.  There was ample amount of wait staff which was nice as there was no waiting for drinks or food.  Put this restaurant on your list of go to places."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdDl6NkJ3EAE",
            "text": "We popped in here on a whim after a show and I was pleasantly surpised! Excellent, elevated Mexican cuisine, all the dishes we had were outstanding! Great guac to start with homemade tortilla chips followed by an amazing tuna truffle…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib3JYQ09nEAE",
            "text": "I complain about the dearth of Mexican seafood restaurants, and the restaurant gods grant me my wish.\n\nEnter El Fish Marisqueria.\n\nNow, not everything we tried was great. I would skip the Lobster Aguachile. Peanut butter and yuzu sound like an interesting combination, but they're probably one of those couples that's too weird to ever work long-term...like Phoebe and Joey. So even though the lobster is plump and delicious, you're better off steering away from the strange sauce.\n\nSimilarly, the special of poached halibut was just okay. Well done, but nothing remarkable.\n\nEverything else was on point. The East Coast oysters were fresh and briny. The Ensalada de Espinaca was huge, fresh, and tasty. I don't normally rave about salads, but this one deserves all the kudos. And the Langosta Ensenada was gorgeous and perfectly seasoned with some of the best Chinese-style egg fried rice I've ever had (and I know what I'm talking about). We tacked on a side of the Fideo Seco, which was rich and creamy, and the beans, which were hearty and filling.\n\nFor sweetness sake, get the chocolate dessert. No one does chocolate better than the former Aztec cultures, and unless you have a peanut allergy, you'll lick your plate with this offering from the gods.\n\nPlant parents will love the minimalist decor accented with copious flora. I spotted monsteras, dieffenbachia, pothos, and many other household favorites.\n\nService was good, for the most part, though they got into their heads without our ever saying so that we wanted to split every dish one at a time--so dinner took much longer than expected because they literally served everything one at a time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSd3ZyV0VREAE",
            "text": "El fish takes a multitude of regional Mexican dishes and modifies them into a modern version. The presentation is fantastic. Artistic. The flavor in most of the dishes is worth exploring. Some for my taste ended up dry or not for my palette. You might light them. The decor is elegant but with good energy. The service is a type where you see your server 3-4 times tops and an army of support staff maintain your beverages filled."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NHBuVXVBRRAB",
            "text": "El fish is the best meal I’ve had in a very long time. First of all, I came last minute with my best friends, and it was totally sold out, but Ariel set us up at the oyster bar, and our seats were just fine. The food is excellent… It doesn’t matter what you get. We had 1000 appetizers and three desserts and everything was scrumptious. The cocktails and service were also wonderful. I cannot recommend this place more… There’s a regular bar, an oyster bar, and lots of tables. The tuna taquitos, and the tuna tostada for both excellent. I also love the lobster tacos and the octopus dish. There’s just too many things to try… So I’ll have to go back soon.  Also, don’t forget the desserts. We had 3!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc2Z2Z1F3EAE",
            "text": "I had the pleasure of dining here, and I can confidently say it was a delightful experience from start to finish. The oysters were incredibly fresh, setting the tone for an evening of culinary excellence. The lobster aguachile with peanut sauce was a unique and flavorful dish that left a lasting impression.\n\nThe highlight of the meal was undoubtedly the octopus—perfectly cooked and seasoned, it’s an absolute must-try. The drinks were equally impressive, with the espresso martini standing out thanks to the use of fresh espresso coffee, giving it a rich and authentic flavor.\n\nDessert was a hit with the delectable mango crepe, which provided a sweet and satisfying end to the meal. Every dish we tried was outstanding, and I would highly recommend this restaurant to anyone.\n\nHowever, the true star of our evening was our waitress, Norma. She was an absolute pleasure, attentive, and personable, ensuring that our dining experience was nothing short of perfect. Her friendly demeanor and exceptional service truly enhanced our visit. Norma is undoubtedly an asset to the restaurant and should be promoted as soon as possible.\n\nOverall, 5/5 stars and look forward to returning soon!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bkthaktBEAE",
            "text": "Incredibly good food at El Fish - the guacamole was exquisite, blue point oysters, and the pasta main, and the crab salad. Amazing. Only the flan was a disappointment. Staff slightly disorganized (3 people asked if I wanted another ginger ale), but very nice people.\n\nWent back quite a disaster - food we were told was not spicy was spicy, we ordered the steak fajitas medium rare and they came medium well, we turned off the table light repeatedly and they kept turning it back on, very disorganized mostly because there were like 5 waiters for our table.\n\nNote: everything is spicy! Most so mostly by just adding this red oil to everything."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd2F6TVlnEAE",
            "text": "I almost don’t want to leave a review because this was so delicious. Our group of five had a delicious dinner and with two Mexican guests in our party - we were impressed! Can’t wait to return. Highlights were the tuna tacos, lobster aquachile, lobster entree, grilled oysters, and grilled octopus. This might be my new favorite octopus on the UWS."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeEpQaWlBRRAB",
            "text": "Overall, a very pleasant experience and food was delicious.\nWe got there late for our reservation but the  maître d' was very nice and got us seated regardless.\nWe ordered several appetizers and main courses and shared them, and the staff made it very easy to do that. Since it was our first time we wanted to try a lot of different things.\nWe ordered the whole fish as well as the salmon skewers and different appetizers. Department Congress since we got in late for our reservation we didn't stay for dessert, we gave the table up to the next reservation, but they didn't hurry us out and they were very gracious the whole time.\nThe only problem was the salmon. And gossiping about it as a pleasant surprise we were asked how we wanted salmon cooked, and I was happy they asked because I hate when the salmon is overcooked. So we ordered it medium rare. Unfortunately, the salmon came back well done and dried out. I didn't want to delay the dinner so I ignore the problem, but it was disappointing. The rest of the meal was fantastic."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaXM3RkhBEAE",
            "text": "The food and drinks here are 5 stars. I'd make a reservation if you can as it does fill up. Tuna taquitos were excellent as were the lobster tacos. The surf and turf was absolutely delicious and would highly recommend. The margaritas were all very high quality. The chef's margarita was the favorite, but their spicy margarita was also very tasty. It's a bit pricey but I would say the food did not disappoint!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaHF1bGJ3EAE",
            "text": "Service and food are both lovely. Salmon was surprisingly flavourful. Pumpkin side dish was a bit dry, didn’t have enough sauce to compensate. Lobster aguachile was slightly overcooked but flavour was great. Don’t skip on the fish dip!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxanU3ZTV3RRAB",
            "text": "We had a very nice experience for dinner.  The service was quick, and everyone was friendly.  The food was excellent for the most part.  The \"clam chowder tortilla,\" had a few clam bits and a few tortillas. My parents werent big on the swordfish cakes that i enjoyed.  The calamari and lobster and pasta was excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuLThhNTVBRRAB",
            "text": "My wife and I went on a whim at around 7:45~ and sat on the bar (definitely make a reservation, it was packed). It was bustling and lively, but not too loud which is always a plus. We started with drinks which were great.\n\nYucatan Fish Dip - The fish dip is creamy and meaty which a great sauce. Definitely on the heavier side with the texture but I don't mind personally. Chips were warm and delicious. This is great if you wanna just sit at the bar and snack with some drinks. Would go stellar with a beer.\n\nTostada De Atun - Delicious. The raw tuna was perfect and so fresh. The black truffle salsa macha on top was a lot of umami and some spice and just delicious. My wife couldn't stop talking about it. Definitely a must have\n\nEnsalada De Espinaca - This was probably my least favorite, but that isn't really even a bad thing. We felt it was pretty acidic, which im sure the pumpkin seeds, bacon, and mushroom are supposed to help with, but maybe we just didnt mix it properly. When things were more mixed, it was really good.\n\nGrilled Octopus - Softest Octopus we ever had. Flavor was good, Takoyaki adjacent with the sauce even. The crispy sweet potato was a good contrast. This was mid range for me in terms of the whole dinner. Again, still very good.\n\nCalabaza - This was my highlight for sure. Im not sure what they do behind the scenes, but this pumpkin was absolutely, 100%, for sure, without a doubt, the best I ever had. This is the best thing I had the whole night. It was soft, super rich flavor, perfect sauces, with the sesame seeds. I will come again just for this. Please get this.\n\nLava Cake - We were pretty full by now but we had a sweet tooth. I will say its a standard lava cake. The orange ice cream was nice but not astounding. If you like chocolate then I say go for it. Not a strong recommendation considering how good the other desserts sounded though.\n\nOverall, We had a great time. We would love to come again with reservation to have a more intimate setting. The atmosphere is great and the service was good too. The bartenders were really busy and focused, but still offered some time to chat a tiny bit with us. Glad we found this on a whim. Enjoy it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1bnJXbEd3EAE",
            "text": "Fun and imaginative menu. Delicious food presented on delicate, artfully arranged plates. Nice service, relatively quiet space for Manhattan. Healthy and flavorful use of seafood, hot and cold dishes, with subtle touches of traditional Mexican spices and salsas. Delicious ceviche served in tiny hard taco shells. Loved the moist and spicy salmon skewers, swordfish filet, side veggies of pumpkin and greens. A few great veggie sides and salads to please non-pescatarians.  Nice for a date night or entertainin. Well located for Lincoln Center or AMC movie going."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCX19fNW9BRRAB",
            "text": "100% recommended. The Yucatan Fish Dip and Tacos de Carnitas de Atún were amazing. If you want a drink, the Mezcalita de Mandarina is really good. I have gone a few times now and the food continues to be as good or even better. The added new options for dessert that were amazing. Roberto and Ariel were fantastic hosts"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcExPYVh3EAE",
            "text": "I ordered the Fish Schnitzel, which was pretty good! Elote was also wonderful. Unfortunately our waiter did not check in on us throughout the service and our plates were cleared very quickly (quite literally as soon as we finished our last bites) so we felt very rushed and monitored.\nI will not return here or recommend this place to my friends as it seems other ⚪ hispanohablantes got better service from the host and staff. We did not receive a goodbye from the host as we exited. Overall a subpar birthday dinner celebration."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsX0liX1BnEAE",
            "text": "I really enjoyed my dinner at El Fish. Such a pleasant atmosphere and the food was amazing. Not too loud too, and perfect for catching up with an old friend. My favorites were the salmon skewers, baked clams and tuna tacos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkaHNmMVBBEAE",
            "text": "Delicious spot in the UWS. I came here with my family and we loved every bite. Our favorites were the lobster aguachile and the lobster tacos. Great service and beautiful restaurant"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0NVlYdEdREAE",
            "text": "A relatively new addition to the Lincoln Center area this Mexican seafood restaurant brings an original take on Mexican food with delicious appetizers and a raw bar. Good cocktail menu as well. Try the fish dip which is delicious."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaOEt5S2tBRRAB",
            "text": "Delicious, highly recommend!!! Probably the nicest mexican with seafood influence on the UWS. I can't wait to go back!!!\n\nUPDATE: I came back for dinner, and I want to try everything on the menu. They just received a Michelin 🌟 !! Absolutely well deserved. YUM"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMi1qZVRnEAE",
            "text": "Great all around.  We have been a return customer.  Not your typical run-of-the-mill Mexican food.  Good raw oyster bar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMmQyd1BBEAE",
            "text": "This is by far, the best latino restaurant on the west side. Chic but light atmosphere, great flavors, superb service and amazing cocktails. Highly recommended!"
        }
    ],
    "reviews_count": 76
}