{
    "name": "Lucciola",
    "place_id": "ChIJ__8PIoNYwokRv6K4zyzgdLs",
    "grid": "MN7",
    "address": "621 Amsterdam Ave, New York, NY 10024, USA",
    "rating": 4.8,
    "user_ratings_total": 1526,
    "phone_number": "(347) 536-1335",
    "reviews": [
        {
            "date": "19시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcFRDMXFaV3d5TUMxQ2FGZFFTemhuT0dobmFuYxAB",
            "text": "Experience the essence of Italy at Lucciola, the top Italian restaurant in town, providing more than just a meal but a genuine taste excursion. Savor Chef Michele's passion with a sophisticated 9-course tasting menu, perfectly matched with wines. It's an unforgettable culinary journey and a must-visit for any gastronome."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUFVHMHRiMmRVU1hONGRFUklTVTU2WVRCbFVXYxAB",
            "text": "We Visited my daughter and\ngranddaughters who live  in Scarsdale I ordered takeout food for seven people. It was excellent food. Congratulations. They should be in business for a long time."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVGVtMHhUV2wzYUd4dlVWVjBhV0pyV21SbU5sRRAB",
            "text": "Lucciola is a warm and welcoming Italian restaurant with amazing food and great vibes. The pasta is fresh, flavorful, and perfectly cooked, and the desserts are just as good. The staff are friendly and attentive, making every visit feel special. It’s the perfect spot for a cozy dinner or a quiet night out with delicious, authentic Italian dishes."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocldVZEVYM0kyZGxCZlVVbzNla2RYWVRWMGFuYxAB",
            "text": "I recently had dinner at this restaurant for their five-course chef’s selection. While the atmosphere and overall vibe were great — warm lighting, stylish decor, and a genuinely attentive staff — the food itself was a letdown, especially given the price.\n\nDinner for three people, each with one or two drinks, came out to about $1,000, which would have been fine if the food had been memorable. Unfortunately, each course felt more like a small appetizer than part of a thoughtfully crafted tasting menu. The dishes lacked any real flavor or creativity — not a single bite stood out or left a lasting impression.\n\nFor a meal at this price point, it was honestly shocking how completely unremarkable the food was. There wasn’t a single course that felt worthy of the cost or the setting — everything looked the part, but tasted entirely forgettable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVlFVazNibGMzV0ZCbGFXZzRaRjlEYkdoNFdFRRAB",
            "text": "This was one of the best dining experiences of our lives.\n\nMy fiancée and I were greeted warmly and were served by Phillip, who was so attentive and genuine, and took the time to learn about us and our food likes and dislikes. We chose the 7 course menu with wine pairings, and were especially impressed by the deconstructed lasagna and the risotto carbonara. Everything was paired perfectly, the food was art, the environment was cozy and unpretentious, and Phillip’s service was impeccable.\n\nThank you so much for helping us celebrate our special occasion, and we will definitely be back!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRFlWVklTamxXUjA1RWFIVkRWblJuZW5aZlNVRRAB",
            "text": "Another wonderful dining experience. The 7-course tasting menu was spot on perfectly balanced and absolutely delicious. Our server Philip took great care of us with thoughtful recommendations and warm hospitality. This was our second visit, and definitely not the last. The highlight of the night for me was the Deconstructed Lasagna with lobster and caviar truly exceptional"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGb1JtWlJUM1JMVms5U1JrOTFhV3BtUlhsM2RGRRAB",
            "text": "My husband and I had the most incredible, intimate dinner here over the weekend! We chose to do the 9 course “no menu” tasting with wine pairings and we are so happy we did it this way. After talking with our incredible server, Anelle, on what we liked/disliked, she curated an extraordinary menu for us. Every course was amazing and it was such a cool experience trying things we would never usually order for ourselves but ended up loving! The ingredients were fresh and decadent and each meal felt special. After every course we looked at each other in disbelief that the food was THAT good. Each course was also paired with such unique and delicious wines, but I will say we probably didn’t think through the fact that we would be having 9 glasses of wine lol and the pours were generous! Anelle was absolutely incredible, she somehow knew exactly what we would like after only talking to us for less than 5 minutes. The entire experience felt personal and truly catered to us and I think that was because of how warm and hospitable Anelle was. We also got to meet the head chef at the end which was such a delight, he was so appreciative of our praise and also spent most of the conversation recognizing how amazing Anelle is which we strongly agreed! Overall this was such a special and unique experience, and my husband and I cannot wait to go again next time we are in the city. The whole thing was on the pricier side so would probably reserve this for a special occasion, but it was entirely worth the cost to us! 10/10 recommend to anyone and everyone and will be back."
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNVFqZE5VRkZIUnpkSlExQmFRV0p6YjNONlpHYxAB",
            "text": "Miglior ristorante italiano a New York , esperienza unica. Ogni piatto ti riporta in Italia e alla cultura culinaria di ogni regione Italia. Prodotti di altissima qualità con dei sapori unici. La selezione dei vini da tutto il mondo è unica.\nPresentazione dei piatti e personale della sala eccellente."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNGMyOUdZVGRQYTJscWNFUnhTRXRzZFhsRVZFRRAB",
            "text": "Amazing experience definitely I'm coming back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcFJVY3hVSEUxVlRod2VVTjFaSE5qVkRod2MzYxAB",
            "text": "Truly a top notch dining experience from start to finish. Each dish was absolutely delicious and the chef took great care in each presentation. The sommelier was exceptional and him being so outgoing really elevated the experience for us. One of my favorite restaurants in NYC!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcE1rbGphazlrVEZOb2FYRklia0ZET1daWGVFRRAB",
            "text": "I wasn't entirely sure that I was going to write a review but felt the need to write one since my opinion is quite different than most of the reviews.  My daughter heard about the restaurant and wanted to go for her 30th birthday.  Here is the positive info: the place is quite welcoming and warm as well as cozy.  Plus the staff that served us were very nice.\nNow, the food: I have to say that the food was quite mixed.  While the filet course was delicious, it was INSANELY small and served with 3 potato \"specks.\"  And then there was the deconstructed lasagna.  While some may feel good about minimizing food waste (and believe me, I do!), the noodles were burnt.   And $45 per cocktail?  Really?  I have NEVER spent this type of money on dinner and my husband and I have dined at beautiful restaurants around the world.\nThe real kicker is that both my daughters left messages within a day or two of us being there as my husband was convinced that he left his very nice, very expensive ring in the bathroom.  None of the calls were returned.  My son, then took it upon himself to visit the restaurant the following week and was on his hands and knees in the bathroom looking for the ring. No ring.  Perhaps it wasn't lost there but no return call?  Really?\nI don't particularly enjoy writing negative reviews like this but felt it was important to share with others."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SU0xUaGxha2RYTkhkcmFqSmZWRFZKWkVKclNYYxAB",
            "text": "I’ve eaten here 3 times and have been blown away by the food, wine, and the generous hospitality of the staff. Every single dish is thoughtful and carefully crafted to be an exceptional experience. Anelle and Alex are delightful every step of the way making sure that you not only enjoy the food and experience, but add the personal touch that most resultants lack. Every meal I have enjoyed here has been unique and delicious. If you want a true experience you’ll never forget, this is the place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTlRtSjFVMUl5V25vMGNqSndZbVJFVUZSclpGRRAB",
            "text": "expensive food and good service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dVUyMWthRmRrUms1MVFuRlNOWFprZDJkck5FRRAB",
            "text": "This is truly my favorite restaurant in NYC. I was so excited to write this because it was honestly the best meal I’ve had since moving to New York. The service was amazing, and you're guided through the experience since it’s a no-menu tasting. The food was incredible—not your typical tiny Michelin-style portions, but made with real ingredients, generous servings, and you actually feel full afterward.\n\nThe atmosphere was stunning, with all the wine bubbles on display—so unique and creative. I’m seriously obsessed. Definitely ask for Anelle when you go!\n\nThe chef is incredibly thoughtful and creative—you can taste the passion in every dish he makes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeVdVTmpiMjlYTm5aSWNpMVFVMGhMY21sWFluYxAB",
            "text": "Found Lucciola about a year ago, and it is now my favorite restaurant. Everything from the food to the service is exceptional.\nLooking forward to the next visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeGRuUmZRM2RsZUZaNVpVaFFUekZuWTJ0T1VHYxAB",
            "text": "This place was amazing! True 5-star experience. I came here with my family and we were all amazed. Food was absolutely perfect, wine was amazing (or so I heard, I wasn’t drinking), and the waiters were so nice. Everything about the meal was perfect to a tee and I would recommend this place to anyone."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbFF6UXhRV1pTVkRKb01FdDVUM3AyWjJKSFNGRRAB",
            "text": "Very very special place !!! An experience"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcW05c2liN3RhUHVBRRAB",
            "text": "Small restaurant with intimate setting, amazing pasta and tasting menu, and incredible wine. Anelle and Alex were amazing!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJdnlfNGFBajRHYmJnEAE",
            "text": "Attention to details and love for perfect imperfections makes it unique and personal ✨"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNRFB3SkhOMmNYaV93RRAB",
            "text": "Fine dining, sure, but c’mon guys… 300 calories for $700"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLLTY1SXljNjd1dy1nRRAB",
            "text": "I don’t know why it’s so highly rated. I was still very hungry.  I see the artistry but is it worth 200% more?   Definitely not."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOekZocnZna0o3UTNBRRAB",
            "text": "We had the most immaculate dining experience and would definitely come back! As soon as you walk in you are transported to the Italia experience with the thoughtful music, the extensive wine collection and cozy vibes, you wouldn’t guess this is in the middle on new york city. Our server was incredible and described every course with passion and had extensive wine knowledge. The meal felt curated to us and artsy in a tasteful manner. Everything we ate was an experience in itself, thank you so much for a lovely evening"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdnlnOUhJel9ualpBEAE",
            "text": "Thank you, Lucciola (and Anelle specifically) for a wonderful evening. Everything was spectacular!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJeThrNTJlNkxDNEdnEAE",
            "text": "My wife and I came from out of town and wanted a memorable experience while in NYC and Lucciola didn’t disappoint. Anelle was especially knowledgeable and planned our meal based my wife’s allergies and my dietary preferences. Anelle was able to craft each plate following a conversation about our preferences. We decided on the 9 course option and enjoyed each selection. The dinner flowed smoothly and wasn’t rushed. My only complaint was that the extensive wine collection was covered in dust. That’s something I’m sure they will address in the future. My wife and I look forward to including this establishment when we return to NYC."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPWGRsNTZldmRMQmN3EAE",
            "text": "So fun! No menu is the way to go- makes the meal an entire event. Anel was great, and with a few leading questions got our preferences down to a T!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZTJ4OG1Zak1Hc2p3RRAB",
            "text": "I visited Lucciola with my sister a few months ago, and we were amazed by the food's taste and presentation. The waitress also gives a little introduction to each dish, and all the plates look colorful and delicious.\nWe loved the atmosphere. You're surrounded by different types of bottles of wine, and all the employees make you feel welcome.\n\nThis was an amazing experience. Special thanks to the chef Dario who made sure we had a unique experience. We will definitely be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLckRqcS1kZ3JLVTVnRRAB",
            "text": "Utterly wonderful! We wanted a special memory on our 30th anniversary and we certainly got that! We opted for the 7 course 'hifi' taster, where the maitre d' [Alexandra] noted our likes and dislikes and the chef came up with whatever he felt like on the night! Service was impeccable and attentive. The choice of wines exquisite. Alexandra kept a note of our dishes for posterity too.\n\nThe only criticism is that there was rather a lot of cheese sauce, which my husband isn't keen on, bit I think he was converted by the end!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNX2h1NXZzMXVyUHJnRRAB",
            "text": "the most beautiful experience. Every single course that we tasted was amazing. The atmosphere of the restaurant felt very welcoming. There were so many different textures and elements throughout our tasting.\n\nlucciola was my first Italian tasting menu and it opened my eyes up even more to the beauty and culture of Italy.\n\nThe maltagliati was my personal favorite because of the unique story behind the pasta. We learned so much more. I tasted the most well balanced tomato sauce I had in my life. Truly an unforgettable experience. Truly a remarkable dining experience. Cannot wait to go back. Highly recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJV3ItdWpaaElQNE13EAE",
            "text": "Anelle served us a beautifully curated anniversary dinner. She designed our menu from scratch after asking us questions to get to know us.\nThe restaurant is also small and romantic, great atmosphere.\nCannot wait to go back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc1lqYUhnEAE",
            "text": "Truly a 5-star experience—top-notch food, wine, and service without feeling pretentious. The whole dinner felt intimate and cosy. Annelle guided us through the menu, and really took time to ask us about our tastes and preferences for the “we cook for you” menu. She also chose our wine pairings and broadened our horizons with some choices that ended up being perfect for the dishes.\n\nSpeaking of the food—wow. I’m still dreaming of the risotto and the steak! We chose the 5 course option and left feeling satisfied. Really incredible spot that I can’t wait to visit again someday."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa3ZfNVVnEAE",
            "text": "Anelle was incredible!!!! And the food was even better!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZakxuWHBBRRAB",
            "text": "Anelle is amazing and was so knowledgeable about the menu and wine selection. Food was amazing!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcThfVURBEAE",
            "text": "Absolutely fantastic service and delectable meal! The wine pairing took it to the next level!!! Love the concept of the “No Menu” menu and the team was incredibly accommodating for each of our dietary restrictions - without compromising any bit of the experience / flavor! Highly recommend for a special experience on the upper west side."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOGF6ZWl3RRAB",
            "text": "Filip was so amazing! The food was even better! Wouldn’t change a thing about this place. Hands down the best Italian food in NY and dare I say in the whole world! Can’t wait until I come back here!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMGNIODdBRRAB",
            "text": "Truly spectacular and custom experience. Special thanks to Anelle, our server, who showed incredible attention to detail. The thought and love that this restaurant, and all of its staff, put into every moment of your experience resembles that of my experience at some of the world’s best restaurants."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcExqLWJ3EAE",
            "text": "JUST PERFECT. I came solo and had such an amazing time. The quality of the food, the wine, the ambiance and the people all together curate such a beautiful experience. I’m definitely coming again. Next time on a date with Hubby! What a gem of a find.."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNThqWEtREAE",
            "text": "Horrible and way over priced"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJci1hNWF3EAE",
            "text": "We wanted an adventure and we definitely got it here.  We chose the 9-course meal with wine pairing.  (be careful!  We didn't understand that the menu was separate from the wine pairing based on the way the menu was set up, so we had an unexpected charge that substantially increased the cost of the meal.  Our fault, so we paid it, but be sure to ask questions.)\n\nWe ate and drank whatever appeared at our table.  Of the 9 dishes and 9 wines served, we only disliked the final dessert wine and, again, it's simply preference and nothing to do with the service or food.  We wanted to try everything new!\n\nit's a tiny, 30-person space with over 5,000 wine bottles.  The Maitre'd and service team were fantastic, playful, knowledgeable, and really made the night!\n\nAlso, by the end of the night and all the wine, we did not notice the 20% gratuity tacked on the to the bill, so we left another 20% on top of that.  The service team was worth every penny and more, and it would have been nice to know that ahead of time anyway.\n\nFor my husband and I, this is likely to be a one-time experience.  We tried it.  We loved EVERYTHING about it.  And we can't wait to tell everyone we know about it.\n\nMany well-wishes to this fantastic chef and his team."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaS1lZXNRRRAB",
            "text": "Anelle is the reason why we had a spectacular dinner!! This place attention to detail was astronomical if you want to have a great night you should definitely come!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaS1peWZREAE",
            "text": "Anelle is amazing!!! Great service! The food is simply amazing! Loved every minute!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOU5xaWJ3EAE",
            "text": "We celebrated a special occasion at Lucciola this past Saturday, April 5th at 6:00 p.m. under “Michael G”.  I mention these details so the restaurant can validate the legitimacy of this review, as my G-Mail account is under a different name.  Since we spent the better part of the day on the Upper West Side in NYC, we felt Lucciola would offer us not only convenience, but a great experience.   Unfortunately, all things considered, the overall experience was far from enjoyable, so we will not be returning to Lucciola.\n\nThere were several issues that brought us to that conclusion, but it began with the hefty price tag of over $700 for the 7-course tasting menu, which we felt was very disingenuous for several reasons.  First, we were a party of two, and despite that, the restaurant, without notification, automatically tacked on a 20% gratuity to our bill.  I know from my vast dining experience that restaurants will impose a 20% gratuity for larger groups (i.e., 6 or more) so a staff that provides high quality service earns a justifiable tip.  However, to sneak that into the bill for a party of two and assume the service deserved that tip amount was very presumptuous and dishonest in my opinion.  Secondly, we ordered wine by the glass.  The hostess, Anelle, did not provide us a wine menu offering wine by the glass selections and cost, but knowing that most NYC restaurants charge $18 - $25 a glass, we had no reason to believe that Lucciola would be different.  Well, it was different, and after seeing a cost of $35 per glass for a 2019 Chianti, my drink cost in excess of $100 infuriated me, as I felt I was once again duped by the folks at Lucciola.  Lastly, Lucciola’s food portions paled in comparison to even some of the most renowned Michelin-rated restaurants I have dined at, and to say each portion of our tasting menu offered more than two bites exaggerates tremendously the reality.  Finally, the extremely drab, primarily black décor did not enhance our dining experience and made us further question why the hefty price tag.\n\nI do not like writing reviews like this, but when one pays top dollar for a dining experience and one walks away duped and unsatisfied, I feel socializing our very disappointing experience for the benefit of other potential diners makes the most sense in this situation."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OUlQTEN3EAE",
            "text": "One of the best meals we have had in the last few years! From Chef Michele to Alexandra - Maitre d’\nWho gave us an amazing and unforgettable service, this was the dinner of the year so far. Every dish was just amazing and an explosion of taste after another. A series of wow-moments!\n\nIt’s crazy we had to fly to New York to have one of the best Italian dinners in a long time (and we spend a lot of time in Italy).\n\nA must visit and besides the amazing food and the best service ever, they have the most and amazing selection of wines!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LVBQbE9REAE",
            "text": "Attentive and knowledgeable servers. The prix fix menu was delicious. They have a massive wine list. Thank you for the excellent experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MDRfYktBEAE",
            "text": "Great pastas, excellent wine selection and delicious tiramassu that two could share, but you will probably want one all for yourself."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3LWVmWFB3EAE",
            "text": "I’ve been to a lot of restaurants and tastings all over the world and lucciola is by far the best restaurant I’ve ever been to. Every dish was beautifully made. The amount of love, time and art in these carefully curated dishes is shown when you take your first bite. It was an experience. The most special part was our server Anelle. From the moment our dinner started to the end, she made the experience very special. She catered to my allergies and created dishes based off my personal preferences. I will be back. Thank you"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMWNUZlB3EAE",
            "text": "Average overpriced food. The wine pairing was the best part of this."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaVl6RFFREAE",
            "text": "Great place lovely atmosphere\nEnjoyed it ."
        },
        {
            "date": "7달 전",
            "language": "ro",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdnZ5anp3RRAB",
            "text": "💋🧸💌"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRblBiRmpBRRAB",
            "text": "My boyfriend and I went to Lucciola for a date night to celebrate his new job and absolutely loved it! We got the 7 course option - our server asked us a few questions and was able to tailor each dish to exactly what we liked! The atmosphere was super special and intimate as there are only about 8 tables in the whole restaurant. Only constructive feedback would be to have each dish be a bit bigger."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRel9QZzlRRRAB",
            "text": "The best Italian restaurant I have ever been to in New York!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmb3BIZThnRRAB",
            "text": "Lucciola offers incredible “no menu” dining. That said, it isn’t simply a hidden menu they hide from you, it’s a collaborative experience. Before dining commences they are quick to ask about dietary restrictions and preferences so they may design the perfect tasting menu based on your feedback. Alexandra offered fantastic service and made sure it was an all around excellent evening. Substantial wine collection."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2X2NXVXFnRRAB",
            "text": "Another amazing dinner and experience. The Tasting menu was amazing - 7 courses was perfect! Our server Philip was excellent and very accommodating with excellent recommendations. Our second time here and we will continue to come back! best dish was the Deconstructed Lasagna with lobster and caviar <3"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaGRUekxBEAE",
            "text": "I had a wonderful evening at Lucciola with my colleague. We had the chefs curated tasting menu which was fun, exciting and delicious. The service was also really personable. Philip and Alexandria made us feel like family. The fact that the chefs menu always different makes us want to come back and visit soon. You can taste the quality in all of the ingredients."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOTlualVREAE",
            "text": "Came for our wedding anniversary. Very intimate setting. Staff was accommodating, kind and personable. We were taken care by Anelle. She was great. Very knowledgeable. Broke down eat dish and explained the menu very well.\n\nWe had the 6 course Emilia Romagna tasting menu. The quality was great. Fresh ingredients. Very tasteful. Fair sized portions over the entire courses. Definitely an experience.\n\nHad an old fashioned with my tasting. Well done.\n\nI would recommend trying this place out for a good time and experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cU4zbFlBEAE",
            "text": "It's hard to tell you if the food or service could be better.  So exceptional in every way.  The courses were delicious and well thought out and the portion sizes perfect.  The chef is from bologna and knows his craft.  Our server Annelle (sp?)was such a terrific treat to spend the evening with.  They also have a superb wine list.  I know most people won't venture out to a high end restaurant and certainly the price makes it tough for many but if you want a really special evening it is certainly going to impress."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMGN1bS1BRRAB",
            "text": "My girlfriend and I recently enjoyed a fantastic 7-course menu tasting at Lucciola, and it was truly unforgettable! Each dish was a delightful experience, but what really made our evening special was our server, Anelle. Her exceptional service and wine pairings elevated our meal to another level. Every recommendation she made was spot on, enhancing the flavors of each course. Thank you, Anelle, for making our night so memorable! We can't wait to return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0c01yT1RREAE",
            "text": "Filip and Alexandria are absolutely fantastic! Couldn’t ask for a better team to guide my culinary experience here at Lucciola. They were very knowledgeable and passionate about the dishes they picked for our 9 course tasting menu. The food is tender, flavorful, creative, and exceptional. I would recommend this place a 100 times over! Treat your taste buds to some delicious food and great wine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdjh1U0Z3EAE",
            "text": "The meal, wine, and service were second to none.  I took my wife for our 10th wedding anniversary and we had an amazing experience.  First off, our server Anelle was extremely attentive and personable.   She was lovely to talk to and thoughtful about every part of the meal.  She really elevated our experience.  My wife has some dietary restrictions, but she helped to craft the perfect menu for her.  I had the classic tasting menu and it was truly next level.  The wine selection and the pairings they chose for us were also absolutely exceptional.  We were very impressed and hope to go back for our next special occasion."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURva3FDNjZnRRAB",
            "text": "Lucciola Restaurant in NYC is not just a dining spot; it’s a culinary destination. The moment you enter, you’re greeted by an ambiance that seamlessly blends sophistication with a welcoming warmth, setting the stage for an extraordinary experience.\n\nThe true star of Lucciola is their ‘no menu’ tasting menu - a six-course journey through exquisite Italian cuisine. Each course is a surprise, curated based on the freshest ingredients of the day and the chef’s creative inspiration. This innovative approach transformed our meal into an exciting adventure, as each dish unveiled was a delightful mystery, surpassing the last in taste and presentation.\n\nThe handmade pasta deserves a special mention. It was a showcase of authentic Italian craftsmanship, offering a taste that was both comforting and luxurious. The balance of flavors and textures in every dish was impeccable, reflecting the high caliber of the chefs.\n\nComplementing the culinary experience was the exceptionally attentive and knowledgeable staff. Their recommendations were thoughtful, enhancing our dining experience with each course. The wine selection was also noteworthy, with a range of options that perfectly paired with the various flavors of our meal.\n\nIn conclusion, Lucciola Restaurant is a treasure in NYC for anyone seeking a unique and memorable dining experience. The six-course ‘no menu’ tasting menu is a culinary delight not to be missed. It’s a place where each visit promises new flavors and lasting impressions. I’m eagerly anticipating my next visit to this wonderful gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcy1YYlJ3EAE",
            "text": "Shout out to our server, Anelle! After a few minutes of talking through what we like and don’t like, as well as our dietary restrictions, she curated a unique 6-course menu for us. We fully put our trust in her and she knocked it out of the park! Each dish was so flavorful and you can tell a lot of thought and care was put into it all. We also appreciated getting different dishes between the two of us. It is a one of a kind experience and we definitely plan to go back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dzdtclZBEAE",
            "text": "Anelle was our server and she was amazing. She paired our delicious food with the best wine. The food was some of the best I have had. The portions were perfect and the food was unbeatable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydVpEemR3EAE",
            "text": "An incredible experience filled with cullinary surprises. Trust the genius of Chef Michele to bring you unexpected tastes and creations, unique and beautiful. We came to visit all away from Switzerland and will come back very soon, can't wait!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bFlEb3pnRRAB",
            "text": "Anelle and Filip were absolutely fantastic, as was our experience at large. If you’re coming for food, you won’t be disappointed—no matter the tasting option you choose. And if you’re going for wine … you’ll be in Disneyland! It’s so fantastic, with the best neighborhood charm you’d ever ask for. Just GO. ASAP!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN0wyR053EAE",
            "text": "Amazing food & amazing service!\nThe vibes for Valentine's Day were immaculate. There are options for all and experts to help guide you through the experience that is Lucciola.  Anelle took care of us, really paying attention to feedback and her recommendations were spot-on.\n\nWe went with the Lucciola Icons - both Pinsa's were delicious, the Risotto with duck egg and truffle was amazing, and the Beef bollito was the cherry on top. The wine pairings were top-notch and only made each dish better.\n\nWill look to come back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OGNyWTFBRRAB",
            "text": "Atmosphere 4/5 is due to size of restaurant. Tables pretty close BUT we visited with guests on either side of us and had wonderful conversation. Did 6 course tasting menu with wine and everything was wow! Especially the pumpkin gnocchi w/pork and pistachio pasta with shrimp."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaW95Y0NREAE",
            "text": "Best Italian in town. Recommend the 12 courses\n\nGracious service by all staff. The manager knows you by name after one visit.\n\nAsk for wine recommendation and the wine director will always find something affordable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSb1o2eU1nEAE",
            "text": "The restaurant is a good date night spot on the UWS. The interior design is chic and upscale but the food is definitely overpriced.\n\nI’ve been to most of the upscale Italian restaurants in NYC and this one I’d vote for their vibe > the food. They have beautiful wine wall decorations with their wine picks from more than 1000 wineries worldwide. Food-wise, they do highlight a lot of high-end luxury elements such as caviar, truffles, etc. However, the portions are really small and most of the dishes are overpriced.\n\nOur servers were nice and friendly. They gave us some good recommendations on what to order and was pretty friendly throughout the whole time.\n\nOverall:\n3.5/5 food\n2/5 price\n4/5 service\n4/5 vibe"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeF9teXhnRRAB",
            "text": "- Dined in on Feb 14, 2024 for a special occasion (birthday of my ❤️).\n\n- Food was excellent. 2 people: 1 person ordered 6 courses Emilia Romagna and 1 person ordered 9 courses “No Menu”. You can mix and choose what you want for “No Menu”.  5/5 for food.\n\n- Service was great in the beginning but the speed for the food arrival was extremely slow. We literally counted between each dish and it was about 30 mins gap. Had to tell the waitress that we want the food to be faster and they improved after that. Again, very very very slow service and they yet charge 20% mandatory service fee at the end of the meal. 3/5 for service.\n\n- Atmosphere is cute/romantic. Good for date night if you want to spoil your significant other.\n\n- Spent $589 for 2 courses + 2 drinks + additional $40 charge (excluding tax) for white truffle addition."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaN19ILWRREAE",
            "text": "Anelle was amazing !  This was our first time! We were here for a birthday and allowed her to build our menu. Her patience were unmatched! Her knowledge and overall enthusiasm helped to make the experience EVERYTHING! If you want an authentic experience with great food and better memories this is the place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbllHYS1nRRAB",
            "text": "Amazing dining experience! The staff, especially Elio and Alexandra, were super friendly, knowledgeable, and attentive. They truly make you feel like you are their friends dining in their home in Italy. Very expansive wine list, beautiful presentation and delicious food. Highly recommend the mare tasting menu. We’ll definitely be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURKcTZjTxAB",
            "text": "The best dinner experience I have ever had. This is a must visit in NYC! Ask for Hulya and Alex because they are amazing! We did the Voyage tasting experience. Wine was paired perfectly to each course. Hulya was so sweet & knowledge about all the flavors. My favorite was the lasagna!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaktHeTF3RRAB",
            "text": "This was my first time going to Lucciola and it was an incredible experience. Last night I was at Lucciola with my wife and some friends. We had the 9 course meal paired with some great wines. Our server Filip provided great service. This is a great place and the food is outstanding. Best experience I’ve ever had!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqLWVfSXFRRRAB",
            "text": "Amazing!! Lucciola changed their concept and now instead of being a regular a la carte menu, the staff creates a personalized curated experience for the guests.\n\nWe ordered the “no menu” 6-course meal, Anelle was incredible, she asked us a few questions and got to know our likes, dislikes, allergies or dietary restrictions. The team then works to create a personalized menu. Ours included items like scallops, spaghetti with caviar, risotto with fois gras, duck egg and truffle, and a protein dish (wagyu steak and fatty tuna).\n\nI would definitely say that the pastas (all of them) are the signature of Lucciola.\n\nOverall it is pricey, but you get an amazing experience and delicious food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGNmVqSF9RRRAB",
            "text": "Fantastic dining experience with Anelle. So knowledgeable, personable, and clearly passionate about their job. The food was to die for and very thoughtfully curated based on our dialogue with them. Wine paired nicely but the real emphasis should be put on the quality of the meal and the service which was top notch."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhaVozT2tBRRAB",
            "text": "Great fine dining. The staff was both friendly and professional, everyone was very helpful regardless of if they were waiting you. They have a a good wine selection, I recommend anything red. I had the opportunity to try multiple plates that were all superb in taste. Everything was freshly prepared and had tons of flavors. I recommend anything I had (see photos). They are definitely on there way to obtaining Michelin status."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eTZ5WjN3RRAB",
            "text": "We had such a wonderful experience, from the food to the service! Anelle was our waitress and went above and beyond. For each course, she took the time to introduce every meal, create excitement, and make us feel taken care of. She was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSaC1yN1RnEAE",
            "text": "The tasting menu was great, phenomenon I must say, but the wine for me was a bit underwhelming or maybe the wine paired with the food isn’t just it. Service was amazing. I totally love it but won’t expect much of the wine. The cocktails glasses was beautiful, not sure if I enjoyed the cocktail or just love the glasses lol"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1dGZIN3hRRRAB",
            "text": "No an expert of fine dining, and actually came here for somewhat “just Italian food” after visiting museum in a rainy day. Anelle has done an incredible job in introducing the restaurant and right after we are convinced that we shall try the no menu 9 courses and my only requirement is to surprise me and taste good. She designed the menu and gave seasonal good and something out of the menu. Overall the food is good, wine recommendation is good (Anelle described wine in a simple and easy way to help non expert understand). The meal is fulfilling. The money worth it. Services are good and they are knowledgeable in their food and ingredients. Presentation is simple but decent. 2 hours for 9 courses and the 2 hours were really enjoyable ;) thanks! If I come back in next year vacation, I hope Anelle will still be the one to help and continues to surprise us!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWcjQyQ29nRRAB",
            "text": "Authenticity is the key to one of the best Italian meals I’ve had — in Italy or otherwise! A group dinner hosted by Italians from Italy. Thank you, Chef Michele for an incredible meal. The food, the presentation, the taste, the service, the wines all were world class in every way. Yet, the atmosphere is very home-like and simple. Nothing humble here and rightly so — just pros who know they’ve got their diners enthralled every step of the way. Grazie mille! And I must return!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCOU9TVV9RRRAB",
            "text": "Wonderful restaurant. Our server Elio helped us understand them menu and make informed choices for what is probably one of the best meals I've ever had. My wife started with one of the burrata appetizers, which she loved. We also had the caviar and Iberico appetizer. Again, amazing. The gnocchi duck dish was amazing. I think it's the best dish I've ever had. Thanks for such a wonderful meal. I wish we'd had a chance to eat here again before our trip ended. Next time in the city we'll be back for sure."
        }
    ],
    "reviews_count": 80
}