{
    "name": "La Sirène",
    "place_id": "ChIJpy_3pohYwokRzoQdVrQiv3w",
    "grid": "MN7",
    "address": "416 Amsterdam Ave, New York, NY 10024, USA",
    "rating": 4.5,
    "user_ratings_total": 420,
    "phone_number": "(917) 261-5279",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OZldsODRjR1p1YWtWcWNtOXRObkJMUlZCYVVWRRAB",
            "text": "Terrible service, there was mold on the water bottle, waiter tried to brush it off, and ended up CHANGING THE TIP AMOUNT so that we gave a 72% tip. Total scam - can't believe this place would try to steal from the customers."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaGVVZDBOVTFOVnpRNGJXTlFWMDAzY1V4VFNuYxAB",
            "text": "Really nice and romantic vibe. Good service and made me happy on my birthday with impeccable duck. Would definitely return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcExVbGlPV0p3U2pKU1IyVkZMVUpuZHpKS2JsRRAB",
            "text": "Delightful French spot that's the real deal! Great menu with dishes you don't see at other French spots in the city. Standouts were the escargots, mussels, fries, \"sensual\" ravioli and profiteroles for dessert. The mussels were maybe the best I've ever had. The staff was friendly and cool. Relaxed and fun vibe, not too loud, we could easily hear each other. Wish we'd know about this neighborhood gem sooner, but now we do and we'll be back! I'd recommend reservations."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbE9EUldXRWxJYlc4MVEyUldOMWcwYmw5aVdYYxAB",
            "text": "Great food, kind of cramped inside but still ok.  The delivery food is not nearly as good as eating in the actual restaurant"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkU1ZXMWZOVW96TmtaT05ESlRNWEZyU0VKVFdtYxAB",
            "text": "This is a legit authentic French restaurant, with very tasty dishes and an attention to details providing the best brasserie atmosphere! I always enjoy having brunch and dinner there. I would recommend trying the classic French dishes like escargots, poached eggs with foie gras, truffle and a red wine sauce or profiteroles for dessert. Glass bottle coke with ice and a lemon slice shows how simple details can enhance your restaurant experience, and La Sirène really succeeds at providing these while keeping a cozy, homey charm."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWFNYVjFlSGxGY2t0Tk1sUnRkVTlwYTBZeE1VRRAB",
            "text": "La Sirene is an upper West side favorite. The food is always spot on. The vibe is effortlessly cool.  My favorites are fish of the day (last night was a crispy black bass), Salads, pear, with melted blue cheese, french fries, and profiteroles with hot fudge. The wines are deliciously French!  If you want a reliable upper west side restaurant that goes above and beyond… you will not be disappointed with La Sirene"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTVJEQXlaRVpWVkVweVRGbzBRV2gxV0ZSblIzYxAB",
            "text": "Good taste!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORFJWaERVMHM1TVhwSWIyRnRjMGxmYW5CRFYwRRAB",
            "text": "Very good food. Service a well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUU0wTk5iMjVTTFU1T2RrUlVOekZCYUV4RmNIYxAB",
            "text": "Went for lunch. Simple delicious food. Great atmosphere and friendly staff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWFdUVTRWMFZDZFZCamFXSk1WRmRFYUVOUFpsRRAB",
            "text": "Espresso Martini - 4.5/5\nDelicious Espresso Martini, the best one yet!  Great foam.  Acidity level is perfect with a great espresso flavor.  Nice and chilled.  Smooth drinking experience.  3 beans.  Would return here to enjoy the Espresso Martini again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQ1pEZEZZVTF4V1U4MFExWkJiWHAxYVVwUWVrRRAB",
            "text": "Food\n\nSeared Hagar Steak au Poivre entree - the texture of the beef was beyond inedible. Unable to chew the beef. Beyond disgusting. Guest who ordered same, was beyond disappointed with the entree.\n\nService\n\nWait staff attendant was present in beginning of taking order, however, disappeared.\n\nInterior of restaurant\n\nNoise level  (very very loud) exceed 42 dbl. Unable to hear guests sitting directly across from self and other adjacent guest.\n\nWhen entering restaurant, the kitchen door was opened and interior of kitchen appeared beyond - filth.\n\nStrange odor in the dining area. Floor sticky.\n\nBEWARE - stay away"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SM01ucGFPV016WlRCS01IbHhUV2d4WXpseFpHYxAB",
            "text": "This place is such an unexpected delight! Found my new favorite brunch spot on the UWS. The coffee was a highlight but everything was delicious and fresh."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeGNtUnpka1JmUTI1aVZIWkxWV2xRYlVrelEzYxAB",
            "text": "The best escargot in the Manhattan! The service was also amazing especially Nino. I’ll be back again for sure!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcU1URnNTRzFrVURKTlV6VmZjV0ZPTVZCNFNWRRAB",
            "text": "Great little bistro.  Good is always delicious!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMzlsdHlPbFB5R2JBEAE",
            "text": "A favorite of mine in UWS."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChRDSUhNMG9nS0VOajY3OTZVZ3VsaRAB",
            "text": "I have to seriously advise against going here as a solo diner, like some other reviews have said. I was scouting this place out to maybe take my friends to, but I will not be going back, much less bringing them here.\n\nI went on a Saturday evening, when the place was pretty busy, and was told that the only seating available was outside, which is fine as it was a nice night by my standards. However, a couple that came after me was also seated outside initially, but then offered a table inside; I was not extended the same offer. Additionally, like other reviews have mentioned, I was not checked in with at all, despite the waiter going PAST me to speak with the couple. Apparently, it was also an issue that I was “playing on my phone”… while I was waiting for ANYONE to come over for me to to ask for the check so I could bounce.\n\nI got the gnocchi, which ended up being far greasier than I expected, so I didn’t even fully finish my meal. There are so many better restaurants in NYC to give your patronage, so skip this one if you’re a solo diner."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNelZpSjdsMTdlUGhRRRAB",
            "text": "Felt like a transported to France for a night. Everything was excellent, particularly the surprise veggie plate and French fries that come with the mains."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNSGN5dG11bnVDaXFBRRAB",
            "text": "Very very bad... Please staying at home is much better..."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZakx5YTRRRRAB",
            "text": "Great burger and moules frites"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcjQ2RmlRRRAB",
            "text": "A Charming French Bistro which is the perfect place to go for brunch. Their omelettes are perfection and come with a generous side of salad and fries."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMDlyVG9RRRAB",
            "text": "good!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJazlmR2pnRRAB",
            "text": "Absolutely delicious food!  The beet salad was outstanding and the mussels were phenomenal. Loved the atmosphere  - like eating at a bistro in Paris."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdU9uYm13RRAB",
            "text": "We came for date night, dinner before a show at the beacon.\nWe ordered oysters, cheese, lamb and Veal.\nIt was an amazing dinner. Service was outstanding. I can not wait to go back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3azliZ3JBRRAB",
            "text": "Julio the best host in this place!!!! Food and service really really good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbFB6MEdnEAE",
            "text": "Extremely Disappointed – Felt Ignored and Possibly Discriminated Against\n\nI had high expectations for this restaurant after hearing great recommendations from friends, and I was genuinely excited to finally dine here. Today is International Women’s Day, and I chose to celebrate this special occasion at this establishment. However, my experience was deeply disappointing due to the shockingly poor service—to the point where I question whether I was being deliberately ignored.\n\nWhen I arrived, I was the only Asian woman in the entire restaurant and also dining alone. From the moment I sat down, I noticed a stark difference in how I was treated compared to other guests. Not once during my meal did a server check in on me to ask if everything was okay. After finishing my main course, I sat there for 30 minutes before anyone approached me to ask if I wanted dessert or the check. During this time, I actively tried to make eye contact with passing waiters and even tried to speak up to get their attention—yet I was consistently ignored.\n\nWhen I finally received the dessert menu, the same pattern repeated itself. I waited another 15 minutes trying to get a server’s attention to place my order, only to be completely overlooked again. Meanwhile, the tables around me received constant attention—servers even stopped by empty tables to tidy up, while I sat there, completely disregarded.\n\nI cannot help but ask: Was I ignored because I am Asian? Because I am a young woman? Experiencing this kind of treatment on International Women’s Day—a day meant to celebrate and uplift women—made the situation even more disheartening. I left feeling invisible, unwelcome, and deeply disappointed.\n\nIf this restaurant values inclusivity and good service, I sincerely hope they reflect on how they treat their customers. No one should have to feel singled out or disregarded in a place that claims to provide hospitality."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdVBxUTFRRRAB",
            "text": "I'm a sucker for these old school little French places. All the classics. The duck, fries, and profiteroles were outstanding. Nice selection of wines too.\n\nThe bouillabaisse broth was a bit starchy for my taste, almost like a potato soup. You can't win them all 🤷‍♀️.\n\nStill, definitely worth a visit."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBanYyeXBBRRAB",
            "text": "We went for restaurant week lunch. The menu was good and every course was valuable. Food and drink was very delicious. A kind of chill atmosphere I like."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aV9iTG9RRRAB",
            "text": "We enjoyed ourselves when we visited La Sirène today. The atmosphere was mellow, the service was attentive (although the entrees too a while to arrive. Best of all, the food was quite tasty and reasonably priced! A+++ IMO! 🙂"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NHMtY2NREAE",
            "text": "I love French restaurants- they are so cozy.  So when I found this Upper West Side place I had to check it out.  I loved the Foie Gras and the Beef Tongue.  The chef here definitely understand how to cook and season good food- lucky me- I can't wait to return!  Oh, and the Croquembouche au Caramel dessert was so good...I had two, lol!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQOUphdUt3EAE",
            "text": "This restaurant offers authentic homemade French flavors and recipes since 2007. The signature dishes are: Hanger Steak Rossini, Escargots, French Onion Soup, Foie Gras, Rabbit, Cassoulet. Join us for a dining experience! Bon Appétit."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeUpqaWZREAE",
            "text": "Feels like you are in Paris. The offerings are great, (especially the croque madam and the tar tar)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbTVYMm1nRRAB",
            "text": "A few weeks ago, last minute-I needed to find a restaurant to host about 40 people after a movie screening in Soho.  The day before I found La Sirene and approached Marty. He was so kind and accomodating.  When we arrived the next evening, Marty was very welcoming and had given us the two main rooms of the restaurant.  The ambiance was perfect-very relaxed and inviting.  The service was fantastic-Marty and his staf were extremely attentive to all our needs.   And the food-everything was amazing! I had the Salad du Marche' and the Smashed Black Peppercorn Filet Mignon with Cream Veill Stock Sauce-absolutely delicious.  Everyone loved the food, and enjoyed the cocktails including a wonderful selection of wines.  We had planned on staying for one hour and ended up staying there for almost five!  I highly recommend La Sirene.  It's a wonderful place to dine with friends.  It is also very quaint and romantic and is perfect for a date night as well."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzck83QTV3RRAB",
            "text": "I love a good French bistro. In fact, I’m damn good at finding them and even a better person to take a recommendation from.\n\nLa Sirene has been my go to for the last 5-5 years. The dishes are authentic, no fusion or Americanized fake-o French meals, no, this is the French roots real deal.\n\nThey serve the escargot in shells! Nice touch! Though it does conflict with mopping up the butter/oil garlic juice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdkpHVzVRRRAB",
            "text": "We passed by the restaurant many times and finally decided to try it after work on a Friday night. Luckily, we had a reservation; otherwise, we would have had to wait! We ordered some appetizers and two entrees. I loved the escargot; it was very tasty and reminded me of what my host mom used to cook when I was on an exchange program in France. I ordered a pork dish that was really good, while my friend got a seafood pasta that was just okay. Overall, it was a nice dining experience!"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcGN2R3NBRRAB",
            "text": "Magnifique restaurant avec la cuisine exquise et le service attentif!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbHV6ekdBEAE",
            "text": "Perfect steak, perfect duck, perfect drinks, great service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNzZTTENBEAE",
            "text": "Impeccable service and great food ! Each dish was a treat for the senses. Can’t wait to go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaV9PTlVBEAE",
            "text": "An eminently forgettable place.  Everything was just ok.  Nothing memorable, nothing special, certainly nothing outstanding. The presentation was good, but once you taste it... Passable, that's all.\nThe service was good, prompt and attentive.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudUs2SjFRRRAB",
            "text": "This place is an absolute gem. Outstanding service, food, and hospitality across the board. We’ve tried several restaurants all over the UWS but this one is our favorite by far. Julio and the team always go out of their way to make the experience unforgettable. The ravioli in cream sauce is to die for, and the filet mignon with peppercorn sauce special was absolutely divine! 10/10 experience every time!! Also love the French onion soup and escargot. The ambience is incredible and makes you feel like you are truly eating at a Parisian restaurant. We love coming here!"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMUlPZS1RRRAB",
            "text": "super essen und gemütliche aussensitzplatz - leider nicht mehr lange, da die gesetze in new york geändert wurden und die aussenpatios der restaurants (kostenlose massnahme während der corona-pandemie) in kürze eine enorm hohe gebühr für die betreiber fällig wird"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIejdfbkRREAE",
            "text": "Excellent rabbit, steaks and more. The beet salad was great and many fine desserts. Lots of wines served by nice folks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeklqcm13RRAB",
            "text": "A Hidden gem!\nOur Favorite  French restaurant in NYC . The food and service are exceptional . They deliver on a consistent basis. Julio and Tony are the dream team wait staff and always make you feel welcome!\nA Charming setting and the fantastic food make this a most special experience.\nRecommend to all 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bklyV2tnRRAB",
            "text": "No kids friendly and not the best service. The worst thing is it only has one single restroom for all, very small and unconvenient.\nFood was ok (Onion soup was ok), but not outstanding. It doesnt worth the money. I wont be back with my family or even alone.  There are better options around better cost-value and better service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eUxIYVNBEAE",
            "text": "Must visit! Food is delicious! Service is excellent"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNllhTGxBRRAB",
            "text": "Cute little French restaurant in the UWS.  We went for brunch on a Sunday in July and sat outside.  It was very pleasant sitting out by the street with comfortable chairs and nice shade.  I had a burger with carmelized onions and Swiss cheese and it was spectacularly delicious! Moist and flavorful.   The quiche was also great.  We will be back many times, I think 😀"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiX0wybWNnEAE",
            "text": "\"Duck Confit is a game-changer. The slow-cooked duck leg is tender and juicy, and the crispy skin is addictive. Serve with garlic mashed potatoes for a decadent treat!\" - 5/5 stars"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyblAtelN3EAE",
            "text": "A business meeting at 4 on Monday, and we turned out to be the first people, I enjoy the food and the wine, but I was a bit surprised we were not offered the bread. Couldn’t make it to desert but I am sure it’s  good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyX3Z5SE5REAE",
            "text": "Very cozy place, excellent, friendly, relaxed service, and the food was delicious. Fresh bread was hot out of the oven, my duck with cherry sauce was perfectly rendered, and our goat cheese tart was beautifully bubbly on top. Also had lots of outside space."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2eDVxVkN3EAE",
            "text": "Delicious!!!\nOutstanding service!!!\nOverall price Great!!!\n\nCelebrated my loved one today and she and I had an amazing dinner. We sat inside and it was phenomenal. The staff was fast and friendly the food came out perfectly timed dish after dish. We came hungry and departed delightfully full.\n\nThe House Bordeaux was splendid highly recommended.\n\nAs you can see from my photos we had plenty to try. We did arrive late for our reservation yet they where so kinda about it. I also had requested candles on our desserts of choice and they where completely ready and aware. I cannot stress how professional and accommodating they are.\n\nI highly recommend enjoying a nights dinner here. Thank you for the wonderful experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCa2NydWZBEAE",
            "text": "Great food, service, and ambiance. Went for dinner and tried escargot for the first time. Very good if you are an adventurous eater then give it a try. Loved the ravioli, lamb, salmon, potato leek soup (it was the soup of the day) and profiteroles."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OW9HS0F3EAE",
            "text": "We really enjoyed our dinner at this place. After seeing the menu and all the healthy option they offer we decided to ask for a table indoors. The hostess kindly offered us a table right away. We ordered a few apps and one main plate to share.\nSalad de Betteraves, steak tartare, escargots and foie gras. All GF and flavorful. As a main we chose the chicken plate. It was crispy outside and nicely cooked from the inside.\nDelicious.\nThis place is already one of the safe go to options around that area. You will not go wrong.\nGood job guys"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScGRqb25nRRAB",
            "text": "Really good food! Came for brunch & highly recommend the French onion soup - easily the best French onion soup I've ever had. I loved the goat cheese tart as well - it was more filling than I had expected. Service was painfully slow, unfortunately even though they weren't super busy. Overall, I enjoyed brunch here & would come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNUs3T1RBEAE",
            "text": "Wonderful French cuisine in an intimate setting. The waiter delivered French bread and creamy butter while we waited for our menu selections. We started with the raviolis which are described as ‘Sensual little French Ravioli stuffed with Comté cheese in Truffle Cream Sauce’ - sensual my friends is the most accurate description. I could have eaten that and nothing else and been satisfied all night.  Josh chose the daily special - Beef Bourguignon which was a delightful beef stew braised in red wine. I chose the rack of lamb. The beef stew should definitely be ordered if available when you visit. This was the first time I had ever ordered lamb so keep that in mind. I ordered the lamb to be cooked medium and the majority didn’t seem to have been cooked at that temperature but overall was very flavorful. I just prefer meat cooked a little more. The meal was also served with a side dish of veggies which were simply delightful. We made reservations easily and greatly enjoyed our visit. The menu is broad and full of delicatessens so please stop by for your very own experience!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbTR1WGRREAE",
            "text": "Intimate French restaurant on the UWS for quality French dishes.\n\nThe dishes were good, though a little heavy and on the pricier side (for what you get).\n\nThe service was friendly. The place is quite small and busy, so I would recommend making a reservation if you’re interested in dining here."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5OVlUUU9BEAE",
            "text": "I really enjoyed this place once I moved from their outdoor dining to inside the restaurant. The service was very friendly and upbeat, the food came out quickly and was delicious. Inside was very charming and well spaced between diners. I…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMLU56WTFnRRAB",
            "text": "Food was good but service was extremely slow. Not enough servers for amount of people. Dessert is not impress.  Seafood linguine, hen, bass, tongue, gnocchi"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKanRLWVh3EAE",
            "text": "This is our second time having dinner here.\nThe first time was a year ago and it's awesome but this time was disappointing.\n\nWe ordered on French restaurant weeks menu.\nWe ordered French onion soup, and Fole Gras au Torchon.\n\nThe onion soup was okay, but it was a bit burnt.\n\nThen for the main;\nWe had fish and steak.\nThe fish was okay, but the yellow sauce was way too salty, not sure if it's too salty only for me or for someone else as well.\nThe steak was very nice. We liked it.\n\nBut keep it up.\nI might give it another try sooner or later, who knows."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdUtmbEhREAE",
            "text": "Beautiful and cozy French restaurant which we found out by chance as it was starting rain and it was first nice spot which google showed us. Food is amazing along with good atmosphere and friendly staff. I had french onion soup and i was happy with my decision. My friends had goat cheese tart and chicken liver salad and they liked them as well"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzdk9peENnEAE",
            "text": "Seem like so long ago. Lucky one of my friends move into this area and I get to taste some of the best French food in NYC. Btw the owner is super nice.\n\nThis spot is definitely not touristy unlike the one downtown. The crowd is neighborhood and a couple foodie. We are on a double date so we can mix in a bit. Food is best shared and we order everything family style. R\n\nI can't remember what I had as it was so long ago. I do remember the food is amazing since the master chef was there. I especially enjoy the roast veggie.\n\nGetting a table isn't that hard here."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bnZQMmtnRRAB",
            "text": "A delicious french cuisine you will enjoy in a welcoming atmosphere.\n\nI started with the backed goat cheese as an appetizer. It's been a while since I had such a wonderful, well done made goat cheese. If you enjoying cheese, you won't regret to get this.\n\nAs an entree I choose the Gnocchi Parisian. They were well cooked and had the right amount of truffle in it to support the cheese.\n\nThe atmosphere and service was all over great.\n\nIt was in total a great experience and I would come again. I would just wish there were more vegetarian options. There is nothing besides the Gnocchi and fries as an entree option."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4bU4ycEtREAE",
            "text": "We went here after the COVID-19 Phase 2 reopening of distanced outdoor seating at La Sirène for my birthday. The staff was courteous, quick, followed proper safety precautions, and the food was amazing! We have been to the SoHo location…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSOG9LRjlBRRAB",
            "text": "The food is outstanding. Good selection of wines. Great service. Price is fair.\nSoup and rabbit was delicious, lava cake was so yum! Definitely recommend this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtOWZXdlF3EAE",
            "text": "My friends and I came for restaurant week during dinner service. The food was good but definitely not the best I've eaten. I probably wouldn't revisit but they offer a solid French menu with dishes varying from ok to good. i got the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPOGZXODJBRRAB",
            "text": "Being in the area we tried La Sirène for brunch. We picked outdoor seating as it was a pleasant day and just like the whole outdoor scene.\n\nWe picked the beet salad, croque madam and a popover.\n\nThe salad was disappointing on several levels, mostly due to being overpriced and underwhelming. It was just sliced beets on a bed of lettuce, some pine nuts sprinkled around and 2 poached eggs to top it off. Not sure there was even any dressing or if there was it was so little that I didn't taste anything.\n\nThe croque madam wasn't that great either, in that it was just 4 small pieces of crusty bread topped with cheese and ham, plus 2 fried eggs on top. It was also served with a small side of fries, which were average. Had much better renditions elsewhere in the city.\n\nThe popover was good though and a rarity these days. So thumbs up to that.\n\nService was fine, but won't be back as the main dishes really need improving."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOElQZVdBEAE",
            "text": "Super happy about their food. Everything was on point, beef tartare, goat cheese tart, fries, salad... not too sweet, not too salty. Just right with a little hint of flavors👌 The only minor issue I personally had was that tables are not distant enough and a bit too crowded. It wouldnt stop me from revisiting here for quality food they provide."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5ajRMQ0hBEAE",
            "text": "Wow wow wow🤩 Somehow we were lucky enough to get a table on this gorgeous first Sunday of spring without a reservation for an impulse brunch. Both the food and service were fantastic.\n\nThe menu had too many enticing things on it, so my husband and I decided to do it in courses (bless the waiter for being cool with this, he even suggested it when we just wanted to order everything). First we had the pain perdu, aka French toast. Outstanding. It was decadent and yet the perfect amount of sweet. Crispy and yet “eggy”. Next, my husband got the croque madame and I got the French onion soup. Both were fantastic. The fries were delicious. Luckily for me, the croque was cut into 4 pieces so I grabbed one to enjoy with my soup.\n\nWe can’t wait to return for dinner. This was perfectly French: simple, yet divine.\n\nP.s. their outdoor dining set up is fantastic and felt very safe (not too sheltered or too crowded). Heaters at every table kept us comfortable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMFBXRzJBRRAB",
            "text": "We all 4 got the French onion soup and it was amazing. We got the profiteroles for desert- Mom made them leave the chocolate sauce pitcher! They did! Good experience and I liked that they had a single table above the stairs that they must have a bigger table in, definitely contained the children, great use of space, good design."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeW9lbHF3RRAB",
            "text": "one of the best French food in town. Escargot, mussels, Tournedos Rossini are recommended. not many seats so better make the reservation in advance"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNHFHN2t3RRAB",
            "text": "Everything was fabulous! Will definitely be visiting again! Went as a party of five and no one was disappointed. Must try the ravioli appetizer and escargot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMk1ueWhRRRAB",
            "text": "Food was amazing! I got crepes with Chantilly cream and fruit, and my husband got the croque monsieur. Both were delicious. I would have happily eaten a bowl of fruit with just the cream. The crepes also came with maple syrup, caramel, and raspberry jam.  Delicious!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPN2FQZ3dnRRAB",
            "text": "Lovely outdoor seating area. Had the goat cheese tart and the popover. The tart was pretty heavy, but the salad and fries cut it nicely. The popover was larger than I expected, but it was mostly empty air inside which made it much lighter, which was a pleasant surprise."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcktYbUdBEAE",
            "text": "Having walked by this restaurant for years, was so glad our friends made a reservation. This is classic bistro French cooking. No surprises, except utterly delicious food, big flavors and great service. Tables are tightly packed and the windows running with condensation, so much so you forget you are in NYC, perhaps dreaming you are in fact in Paris. Can't wait to come back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSb2NuZ19nRRAB",
            "text": "Good French.\nMoulard Duck Breast is often referred to as the \"ribeye in the sky\" because it as a meaty flavor with wonderful steak overtones. Moulard Duck is the cross between the Muscovy (male) and Pekin duck (female)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxZ0xXZW5nRRAB",
            "text": "Outside seating arranged nicely on side street rather than Amsterdam. Beautiful presentation of food. Good service. Enjoyed the meal and ambiance."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweXIzcU9REAE",
            "text": "I like this neighborhood bistro... classic dishes, decent food and prices... We all need a place like La Sirene where we can go  and have our usual... Mine? Steak tartare, lunch portion..."
        }
    ],
    "reviews_count": 75
}