{
    "name": "The Shell Seafood Kitchen & Bar",
    "place_id": "ChIJEZBYF4ZZwokRBhwHBZnsoqI",
    "grid": "MN7",
    "address": "635 Amsterdam Ave, New York, NY 10025, USA",
    "rating": 4.8,
    "user_ratings_total": 244,
    "phone_number": "(646) 669-7628",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMlVtSnFhbFpHUWxkUmJYVnJNRnAzZFVaWE1rRRAB",
            "text": "The chef does amazing job with every fish dish!\nService is superb!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcGFHa3pZV05oTjFCSWNHeEdSekJXYVV0eWVuYxAB",
            "text": "We’ve been twice now and want to keep going back! The food is phenomenal and the service is beyond the best. Definitely a place to impress family while getting a delicious meal. Their daily specials are great, too."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GU2FGWTVaekowY25Cd1NuUk1Ua1JvUjNWT1JGRRAB",
            "text": "Took my best friend for a birthday dinner and so glad we picked this spot! I had the squid ink and it was perfect. The appetizers were good, branzino special was fantastic and Caesar salad & shrimp app were also tasty. Tiramisu dessert was delicious & service was great!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsYWJteExTRlV3TURGNlVtMUJXVlZwVDFKQlUzYxAB",
            "text": "What a great surprise! Dinner at The Shell tonight was excellent from start to finish. The Caesar salad was crisp and fresh, the seared tuna beautifully done, and the pappardelle with shrimp rich and perfectly balanced. Wrapped it up with a creamy tiramisu that was just right. Great service and a warm, modern vibe -- will definitely be back."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocVZuSXhkVUZzTVhCcU1FSm1iakZwTm5oQ05GRRAB",
            "text": "Impeccable service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNFZrVmFURzlaV0cwNE4wOW1OR2cxUkU5V09XYxAB",
            "text": "The entire experience delivered surprises I didn't see coming. Workers here provided rapid service while maintaining respect. This place charges more than average. The kitchen uses fresh ingredients, good seasoning, and proper cooking methods. The staff here are genuinely helpful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dmJVMDJlV051YlcwellqSk9NMWh6UzJneU1WRRAB",
            "text": "This place is a gem. We stumbled upon it while in the neighborhood. Prix Fixe was awesome value - the salmon fillet was crispy outside and moist inside, the oysters are fresh, the jumbo shrimp pasta was creamy, and the grilled whole Bronzino was flavorful. Service is attentive but not intrusive.  Nice outdoor seating!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cd1pWZFFWMVJZYmxWV1NuVnBiVlZ4UmtONlltYxAB",
            "text": "The host never acknowledged my existence and continued to chat with their friends at the bar while I waited over 15 minutes to be seated. While one of the servers said he will be with you, he never came my way. Disappointing as wanted to try this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMGIzYzFNbmhJVFZrMFYwZDBOSFIyZHpFeGRsRRAB",
            "text": "One of the best meals I’ve had! Jorge was an excellent waiter!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VdGJXRnVNWFpZYWpodk1FNXFSeTFxU2xoMVFVRRAB",
            "text": "Amazing neighborhood spot for fresh seafood!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VmJtUldTMmQ2V1V4T1UxcG1SbGxLVlZKNk1YYxAB",
            "text": "The food was extremely mediocre. Lobster pasta was flavorless, crabcake was okay, other dishes were too spicy. The appetizers were the best part, but they were good at best. The service is great, but I'd spend your money elsewhere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMWRIa3pTVEZYVHpaYWIyb3hYMjFQYkUxWGRIYxAB",
            "text": "Nicest team with attentive service. Food is  excellent and generous. Oysters always good. Lamb, steak, risotto, pasta, all excellnt. Good cocktails and esp the happy hour. Many options to choose from and never disappoints. A+"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSVMySkdSMUYyYmpaVVlVeEJaMlZTV2tsYU5VRRAB",
            "text": "Jorge and the staff are super nice and attentive. The food is great. The atmosphere is very comfy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rM00ydzVRMkpRZW1kM1JtY3dSMWxMT0hWM2JtYxAB",
            "text": "We slept on this place for way too long. Our neighborhood now has a SOLID seafood restaurant. All of the food we ordered was fantastic. Everything was cooked perfectly, had incredible flavor, and was presented beautifully. My wife and I were so excited while eating here because it’s our new neighborhood gem."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeWEyZFphV2hqTWpSd2NWUm1TMUowZEhveVkwRRAB",
            "text": "I absolutely love this place.  The crab cake was amazing, the swordfish was amazing, the paella was amazing, the atmosphere is great, the portions are great, I could go on.  I love this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKelJYRXdWbEpmVXpCbU9WWnhURTlZUlRVMmVXYxAB",
            "text": "Love a restaurant that remembers and appreciates you.  Delicious seafood at reasonable prices.  Large outdoor patio with comfortable seating and umbrellas."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMldYUk1SM3BEY0VwYWQzZDRlVGhtZEdObGNFRRAB",
            "text": "Eating outside on a nice day felt relaxing.  Food was good.  Drinks were good too!! Service was excellent!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMlkxTktXVkp2UlZod2RtMXZiRTV2V0VsZk5IYxAB",
            "text": "I went here for NYC Restaurant Week, and the three-course, $45 deal was worth it.\nTo start, I had the oysters, and they were fresh. For my main course, I chose the salmon, which was cooked to perfection. The fish was flaky and moist. Finally, I finished with the tiramisu. It was rich and creamy, with a strong coffee flavor and just the right amount of sweetness.\n\nWe got a side order of the crab cake, which was mediocre at best."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taclEwazNPVXMyTFdvM1FubzBkRk5ETFhvM2FsRRAB",
            "text": "What a fantastic evening out.  The shell provided everything we were looking for this evening.  Fantastic food.  Gracious service. Fantastic vibe.  Everything was top notch. I had the Brazino while my wife had the salmon. Both were yummy.  Do yourself a favor and get there during restaurant week. It is an unbelievable value and you will thank yourself for doing so."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSmNrb3hVVWR6UkhwS0xXOXBPRzVuU1hSUVRrRRAB",
            "text": "The Shell is a gem on the Upper West Side, and we love being regulars! The seafood dishes are consistently fresh and flavorful, showcasing the best of Italian cuisine. The inviting atmosphere and friendly service make every visit a pleasure. Whether it's a casual dinner or a special celebration, we highly recommend dining here!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc2NFRnRhWFZ5YWt0MlkzUkRiRjg1T1V0VE1VRRAB",
            "text": "Loved everything about The Shell! Went for summer restaurant week, for the price and portions it was a fantastic deal. Every dish we tried was so delicious and well plated. Can vouch that all of the below are well worth it! Only complaint was that we felt service was a bit slow on a Tuesday, but it was also not rushed. Give it a try! Nice outdoor corner patio and cute interior as well.\n\nOysters\nMussels\nBranzino\nShrimp Pappardelle\nLobster Rav\nTiramisu"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wR05GTlVVMjUzWkZwWFQzZFNXRmxXWkhoa2JtYxAB",
            "text": "Great food and vibes, very large patio great for summer evenings"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210c1FucG5kREF5TUZkRVlsQTNWMnRJY20xaVdFRRAB",
            "text": "I came here with 3 friends and we had an amazing time. The restaurant is located on Amsterdam and 91st, with both indoor seating and a lovely terrace outside. Even though it’s on a busy street, it’s surprisingly quiet and peaceful. The outdoor space is super welcoming with some nice background music.\n\nThe owner and the waiters were absolutely fantastic super warm and friendly.\n\nWe all ordered the $55 menu of the day, which included an appetizer, main course, and dessert. For starters, we had a choice of oysters, shrimp, or calamari. I had the calamari, which were excellent, and the oysters were fresh and delicious too.\n\nFor mains, I had the lobster ravioli perfectly cooked. My friends had salmon, which was beautifully cooked and served with an amazing sauce.\n\nWe also shared two bottles of white wine, with prices starting around $70–90. Not cheap, but fair for NYC.\n\nFor dessert, we had tiramisu. All in all, a fantastic experience. The food was excellent, the service outstanding, and the atmosphere very pleasant. We ended up paying about $460 total for four people (including tip), which felt reasonable for the quality. I’ll definitely be back and will recommend it to friends!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Rd1VIbzJhQzFYTkdOWUxVbEJZMWRPWDNSb1kxRRAB",
            "text": "Great spot for fresh fish in our neighborhood, extremely welcoming staff, definitely coming back!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLV3l6WWZ4OHFISVd3EAE",
            "text": "Just moved to the area and went two weekends in a row. Fresh food and great service, good price for the quality."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcTN1NGlwOGJtOExBEAE",
            "text": "Just went here tonight and all I have to say is how great the service and food was. Definitely a gem and recommend everyone to give it a try."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRHQ2c3JNd2NxcnhRRRAB",
            "text": "Absolutely a GO! Very attentive and pleasing. We had...\n1. Lobster for 2 special.\n2. Dozen East Oysters.\n3. Sides: asparagus and truffle fries\n4. Lava cake.\n5. White wine."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLMzhqdmJLaUpxbXdBRRAB",
            "text": "Just first rate.  Fish and chips is real filets not mystery mash.  (My wife is a fish and chips enthusiast.  Not that many measure up) Oysters are wonderfully fresh, steeped in brine.  Service is quick and efficient.  We love it.\n\nUpdate:  another enjoyable visit last night. Everyone is so very nice.  But: the music was way too loud.  It noticeably diminished the otherwise very pleasant outdoor experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLaU9xNmViN2N2dFhnEAE",
            "text": "Absolutely delicious oysters. Great size and price during happy hour- $2!! The service here is very attentive. Looking forward to coming back to try some dinner items."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJV2hrTkREOHZfR3dBRRAB",
            "text": "Unbelievable dinner! The reviews are spot on.... great food, Service & atmosphere! Definitely recommend The Shell - planning to make this a regular stop on all NYC trips!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNcjJyS1BEejc3ZWJREAE",
            "text": "Everything was excellent! Would recommend to anyone and would love to go back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbzV1WnJBRRAB",
            "text": "Cute neighborhood joint in the UWS with a focus on seafood as the name implies.\n\nCame in for a quick dinner and lucked into their happy hour. The Calamari and Fish and Chips off the happy hour menu were decent (fish portion was a bit small) but the star was the seafood paella off the main menu. Absolutely delicious. Their bread is really good as well and the garlic dipping oil it comes with should be bottled up and sold (it was that good!)\n\nService is great as well."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNm9TeVhREAE",
            "text": "Service is exceptional and food always fresh"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnB6MDN3RRAB",
            "text": "I should go here more often as we always like it, the food is very good and the service is excellent.  Had fresh swordfish,  grilled calamari and shrimp. Was very happy! Paired with a pilot grigio made the perfect meal!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdE1fR1F3EAE",
            "text": "I was in NY celebrating a friend's birthday. We ate at The Shell Kitchen.  Everything about the experience was  exceptional. I ordered Papardelle & Jumbo Shrimp. This was probably the best pasta dish I've ever eaten. The pasta was cooked to perfection. Every bite was delicious.  My friend ordered the lamb chops.. Wow!  The staff from the minute we walked in until we departed were exceptional. Everyone was  attentive without\nbeing intrusive and very friendly. I can't wait to go back. Huge shout out to Jose, we really appreciate you for making that night so memorable.  The night ended with the staff singing Happy Birthday. In one word.. Wonderful"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdjdfQk9REAE",
            "text": "Went to The Shell with a few good friends who recommended it — and they nailed it. This place is a gem. The vibe is relaxed but upscale, perfect for a night out where you still want to feel comfortable. Service was spot-on: friendly, knowledgeable, and made us feel right at home.\n\nNow the food… unreal. The seafood soup was easily one of the best I’ve ever had — packed with flavor and loaded with fresh seafood. Every dish we tried was beautifully prepared and bursting with flavor. You can tell they care about what they’re serving.\n\nCan’t wait to go back. If you’re a seafood lover (or even if you’re not), this place needs to be on your list."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaWM3UHlBRRAB",
            "text": "Jose was incredible, consistent great service. Excellent tiramisu"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJck9ibXpRRRAB",
            "text": "I really like this place. Salmon and shrimp are my choice"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMk1pbDlBRRAB",
            "text": "This was our first time here and certainly not our last ! My mom and I got the prix fix dinner for $55 each where we both got 3 courses of full sized apps and entrees from a lovely selection off the menu. The service was impeccable, almost Michelin level ! Jose, our waiter was attentive and was able to fulfill our order to perfection (my mom didn’t want her salmon blackened and he was able to make that happen for her). We will for sure be back !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LWNXdW5RRRAB",
            "text": "Our Server Jose was great! Thank you so much!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NE5QTFN3EAE",
            "text": "José provided the best service. He was very attentive, friendly, and the food was amazing. We will definitely be back again , especially since our waiter made our night!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NE9PaFpnEAE",
            "text": "Jose is awesome! Made our time here very special! The Chilean sea bass was incredible!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNGVmU3RBRRAB",
            "text": "I'm not easy to impress but the food were fantastic!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdnZPUkVBEAE",
            "text": "The seafood was delicious. The device was excellent without being intrusive.I went for my birthday dinner. My dinner companions were knocked out my the lamb chops and crab cake. The home made pasta dish was amazing. Definitely my go to for seafood."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcEx6eFRBEAE",
            "text": "Truly a neighborhood staple. Worth visiting even if you’re not in the neighborhood. The service is above and beyond, especially when José is working. He is so attentive and gives some of the best customer service in the city, seriously. They make sure you’re taken care throughout the entire visit. Go ASAP!!!!! Some of the best lobster ravioli I’ve ever had."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReEpfanh3RRAB",
            "text": "The best SERVICE EVER.. . Jose is very personal and passionate about the service he provides."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnN05LSUd3EAE",
            "text": "Amazing food, every dish we had was excellent. Rare gem on the UWS!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndnJHM3l3RRAB",
            "text": "Definitely would go again. The staff was friendly and the food was good. The octopus was the star of the show! And the sea bass was cooked to perfection!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN3FhdktBEAE",
            "text": "I wish we had gotten the name of the Bartender who attended to us.  He was superb!!!.  We had a Rez but the table was too close to the door so we chose to sit at the bar.  Lucky us.  We ordered the Cesar Salad, Arugula Salad, Seafood soup and the Halibut.  I almost made the mistake of subbing the Salomon but our server insisted we would prefer the Halibut which was VERY fresh and OMG it was PERFECT.   Will DEF come back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnck91R2ZnEAE",
            "text": "Every time we’ve come here we have been blown away by the food & the service! The staff would not be more welcoming and attentive, clearly a family run local spot that pays attention to detail and ambiance. Last time we sat at the bar and had a lovely time, last night we sat at a table and Jose made us feel right at home. We’ve tried specials, and their normal menu options and everything is flavorful, fresh, and memorable. The Squid Ink pasta is some of the best I’ve had- loaded with seafood. Additionally, I loved their crab cake that was very unique. Cannot wait to come back and enjoy ❤️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNllyeEdBEAE",
            "text": "This place is very chic and cozy. The service is impeccable. Our server Jorge was very attentive.  I love that they replace your used silverware after each service. They provide this chili red pepper oil to go with bread that is very tasty. The mussels were cooked in an elegant broth with taste of garlic and spices that you could spoon to the last drop.  The oysters were sweet and fresh. The branzino was so delicious and fresh the skin was crispy and fish tender and went perfectly with the black pearl rice. The salmon was tender with  a delightful butter sauce. The chocolate lava cake was so delicious, with that perfect slight crunch on outside with melted chocolate inside. They also have a bar that looks very welcoming to enjoy a nice drink and meal. We will definitely be coming back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcm9qV0lBEAE",
            "text": "NYC restaurant week menu was really worth it. Had a great dinner with full sized dishes. Mousse cake was delightful. Beef and mussels were also good. Can’t really fault on the $45 price. Service felt a bit rushed though and the place was really noisy but it was overall a good experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMOUlXSVVREAE",
            "text": "Food 5/5\nService 10/5\nAmbience - casual 5/5\n\nOne of my favorite go-to place after my work in upper west side!\n\nDefinitely hands down the spot for the freshest oysters and killer dry martinis. The staff is super nice, and the vibe is casual. I love hitting up their happy hour from 4-6 pm every day after work. You gotta try their oysters, they're a must!\n\nLove seeing every staff here, having good conversations with my colleagues and enjoying my after work hours. Thank you for being here!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcHRUa0ZBEAE",
            "text": "The most amazing time! ✨\nThe food was so delightful, we ordered some entrees, pasta and paella, and some tiramisu for dessert, very tasty 🥘🍤🍮\nThe attention was spectacular,all the waitresses were very polite and nice, special mention to Jose, who light the night with his energy.\n\nVery recommended place for a private, nice and relax seafood-dinner in the upper west side."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqaVktSldREAE",
            "text": "I would pass by here quite a few times. Very unassuming place taking over from where the old Blockheads used to be. One day I decided to finally stop in. I was pretty hooked from that point on. It is now on my list of regular places in the neighborhood. You can't beat the Happy Hour offerings and prices. Drinks are strong and food is top notch for the price. Buzzing place, vibrant ambience and awesome staff. Very attentive and super friendly. Love their playlist also. It always has me scratching my head in wonder over the vast range of music. My favorite dishes are the oysters and truffle fries. Favorite drink is the \"That's a Spicy Cocktail\"- strong and not too sweet. Squid ink/ mixed seafood pasta was good, the mussels and the tiramisu as well. My goal is to try the entire menu! So far, not a bad dish to be had! I hope this place sticks around for a very long time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqd0puNmdRRRAB",
            "text": "This experience was quite different and a breathe of fresh air. The atmosphere ( for me ) has a smooth mellow feel to it. I will definitely come back again. The drinks ( Spicy Cocktail & Pear Dream ) were definitely good just a little too much ice. The Maine Lobster Ravioli was great!! The sauce was just right and not overpowering where you couldn’t taste the lobster. The cheesecake was complementary from the owner and delicious ( I love Cheesecake BTW ). I’m planning my next visit"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNlltUTBRRRAB",
            "text": "We came here for cocktails on a Sunday and then back the following night for paella.\n\nThe food and drinks we had were fantastic and the owner and staff are very warm and friendly. We love this place and will return again during our NYC visit if we can.\n\nThe paella was rich and delicious with an abundance of seafood. The paella special included a bottle of wine and we enjoyed the Chardonnay we ordered. The pear tart for dessert was also delicious.\n\nDuring both visits we sat outdoors on their comfortable front patio facing Amsterdam Avenue.\n\nHighly recommended!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c2ZxRXJRRRAB",
            "text": "Updated Review: I recently celebrated my special day at \"The Shell,\" and it was an amazing experience. The oysters were plump and full of flavor, and the clams were incredibly fresh. While waiting for my appetizers, the warm bread and oil were a delightful treat.\n\nThe Squid Ink Linguine with Clams, Mussels, and Calamari stole the show. The pasta was perfectly cooked, and the sauce was rich and delicious. The seafood was tender and paired perfectly with the pasta.\n\nThe service was top-notch, and the staff surprised me with a birthday song and a complimentary cake. It made the celebration even more special. I highly recommend \"The Shell\" for a great seafood dining experience.\n\nPast Review: I had the pleasure of dining at \"The Shell\", a delightful seafood restaurant that exceeded all my expectations. Having walked past it numerous times, I was already drawn to its inviting ambiance, and today, I finally decided to give it a try. From the moment I stepped inside, I knew I was in for a treat.\n\nAs I entered, the hostess warmly greeted me with a friendly smile and promptly escorted me to my seat. The atmosphere was lively yet cozy, with tasteful decor. There is outside dining as well.\n\nOnce seated, I was fortunate to have Jorge as my server, who proved to be a true gem. His attentiveness and professionalism were outstanding, and he effortlessly made me feel welcomed and well-cared for throughout my meal. He started by asking my preference for water, and I was pleasantly surprised when he brought out a tall glass bottle, ensuring that I would have plenty to drink.\n\nTo begin my culinary adventure, I opted for the happy hour menu, available from 3 to 6 pm from Tuesday to Saturday. With an array of choices, I decided to indulge in the mussels, two orders of oysters, and butterfly shrimp. Each item was priced at a reasonable $12, making it even more appealing.\n\nWhen the food arrived, I was absolutely delighted. The mussels were perfectly cooked, tender, and bathed in a flavorful broth that made every bite a delight. The oysters were incredibly fresh and served on a bed of ice, accentuating their natural brininess. As for the butterfly shrimp, they were crispy, succulent, and accompanied by a delectable dipping sauce that complemented their delicate flavors perfectly.\n\nThroughout my meal, the service remained amazing. The staff members were friendly, attentive, and knowledgeable about the menu. They were more than happy to answer any questions I had and ensured that I had everything I needed to thoroughly enjoy my dining experience.\n\nLeaving \"The Shell\", I couldn't help but feel utterly satisfied and grateful for such a remarkable culinary adventure. The combination of fantastic food, attentive service, and charming atmosphere left a lasting impression on me. I am already looking forward to my next visit, and I wholeheartedly recommend \"The Shell\" to anyone in search of an exceptional seafood dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidDdyUlBnEAE",
            "text": "Incredible dining experience! The oysters were the best I’ve had, so fresh! The Sautéed Mediterranean Branzino was terrific as well! The service and atmosphere are great, staff was very attentive and kind!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaWJteTZ3RRAB",
            "text": "Very pleasantly surprised by this spot. The food is far more refined than the space itself and the service was great. They have a great happy hour menu as well. Highly recommend the halibut and the garlic shrimp."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwd2JxQ2pRRRAB",
            "text": "We had a lovely experience dining at The Shell. The wait staff were super attentive and nice. As an appetizer, we had the octopus which was very tender. They also brought out bread with a tasty oil. For entrees we got the squid ink pasta and paella, both of which tasted very fresh. Our server was super kind and brought us a dessert for free to go along with the Irish coffee and Ruby port we ordered. Overall, we had a wonderful experience at the Shell and the food and service were great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBN0pfZWh3RRAB",
            "text": "Despite being from Belgium, a country with great mussels, the best mussels I had were here in The Shell. The quality of the food was top! And we had a great wine with our ‘restaurant week’ menu. Moreover,  the service by José was beyond expectations. If I’d live in NYC, I’d come here every week."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuakwyYWJnEAE",
            "text": "After having our meal, we were shocked the place wasn’t busier.  The service is great and the food was excellent.  The pictures don’t do it justice. Every single item was a good hit.  @bar_samyaza"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bExuUVNREAE",
            "text": "Fantastic spot for seafood.  Great Happy Hour, Pre fix menu. Nice decor.  Great outdoor space for Sping/Summertime. Cocktails are delish and great staff!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNnVyVHZ3RRAB",
            "text": "Excellent and highly recommended. The service here is top notch, so friendly, nice, professional and attentive! There is plenty of outdoor and indoor seating at the bar or in the main dining room. The restaurant is spacious and clean. The menu is broad and delicious, along with an impressive happy hour! I enjoy fresh oysters and white wine. I will be back for more. Enjoy this lovely neighborhood place!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6enNhbmhnRRAB",
            "text": "Fresh seafood, great dishes and wonderful service.  Throughly enjoyed lunch here!  In a very convenient location and there's in and outdoor seating.\nService was very nice, felt like at home.\nHighly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxb1pxaGt3RRAB",
            "text": "This has become one of our neighborhood staple restaurants! Everything I have ordered has been fantastic! We are particularly fond of the lobster salad and lobster ravioli but their daily specials always impressed and their custom cocktail menu is great!\nThey are also very accommodating and patient with our young child and he loves their mac and cheese!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z0pTX3hBRRAB",
            "text": "Great happy hour, Tues-Sat. $5 pints and equally fantastic freshly shucked oysters. The steamed mussels are delicious.  Regular hour brews are still a bargain. The Bengali IPA, pictured, is one of the best I've had. Can't get closer to an IPA than a Bengali, even if it's brewed here in the States."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbjVUQkJ3EAE",
            "text": "Little gem in the upper west. Staff is friendly, ambiance is nice, food is delicious but maybe a little overpriced. Overall a good experience and we’ll be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINks3OWxnRRAB",
            "text": "went for my anniversary, the service was great , the food was great! One of the dishes I tried were their crab cake it was amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKZ0pLeldnEAE",
            "text": "Nice place with a few octopus choices and others Spanish & tapas-style dishes plus classics. Lots of wines, folks on point taking care of you."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcXFERmlBRRAB",
            "text": "I enjoyed my post 1 day of marriage dinner and everything was excellent. Jose was very attentive and answered all of our questions and even surprised my fiance with candles on our dessert. When coming to clear the tables Chris was awesome! He made sure our water stayed fully, cleared dishes, and wiped down the table as well as gave conversation. This was my mother/grandmother in laws first time in nyc and so far this has been their favorite restaurant! We will be back! Thank you Jose and Chris!"
        }
    ],
    "reviews_count": 72
}