{
    "name": "La Caridad 72",
    "place_id": "ChIJo_O_AchZwokRW5SZhYoWjJ4",
    "grid": "MN7",
    "address": "130 W 72nd St, New York, NY 10023, USA",
    "rating": 4.8,
    "user_ratings_total": 399,
    "phone_number": "(212) 970-2838",
    "reviews": [
        {
            "date": "수정일: 6시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0a1BYRGVBEAE",
            "text": "Thrilled that it has reopened, reminiscent of the beloved spot at 78th! We had a pork chop. The cuisine has taken a fancier turn, yet every dish maintained its greatness."
        },
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVVpscGZTMGN3U0VJMGMweERlRWx0VGkxWVduYxAB",
            "text": "The food and service at La Caridad 72 are amazing! I started going to La Caridad in the mid 1980’s when it was located a few blocks away. The amazing thing is that the food and service are exactly the same. I gladly travel more than 40 miles whenever I want amazing Chinese-Latin food. The chicken chicharrones (small chicken bites), which are pictured in this review, is delicious. The ropa vieja (shredded beef) is also off the charts. If you want good food and drinks, please visit La Caridad 72. Believe me, you will go back!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWVNEUjVVM2hWWDBWMFkxQm5iWFJzUkdRd04yYxAB",
            "text": "A Cuban/Chinese place without a Cuban sandwich? Foods fine. Pretty pricey."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR1kxUk9kVTR6YTFocFVWVnRUM2RqTjJ0aVNWRRAB",
            "text": "This is a great spot we stumbled into by chance. Everyone was very nice and friendly and the food was great. Whatever you do make sure you slurp down some of the green sauce it was delicious on both the chicken and the plantains. (And mixed in with the fried rice, and as a salad dressing…)"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNFpqSmFkRmd5YlRnd2VYVkRjVnBOVmtOVmIyYxAB",
            "text": "I was looking for a place to eat with my son after trick or treating and looked up across the street on 72st between Columbus and Broadway and there was a familiar name LA Caridad. Good still great service the same! Pros. Pricier that last I went in when they were on Broadway. Con. Bust still good!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFM1ltaHhaRGN3VEd3NWNEaExSVkJGWkVadVpYYxAB",
            "text": "We’ve been to this place numerous times and I give it the full 5-star rating. They serve Cuban and Chinese fusion and I would always order their pork chop as my default and it has been consistently done: the taste and the juiciness is just perfect. My wife’s go to is their fried chicken which is also nicely done. Service wise, their staff are so friendly and they look after you."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMGNEaEpiMTltYUhsd2VqbE9lalpmWWtKV1dFRRAB",
            "text": "Exceptional service and the best sesame chicken I ever had. The spring roll had a “fall” taste with cinnamon which I loved, and the crispy chicken went very well with the avocado sauce. The service was very good."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUVZYUlFiMXBmYmxsdWNHcHJTME00WmpoUWFHYxAB",
            "text": "YouTube brought me here!! Thank you so much for your service and to the amazing server who we had the pleasure to meet years ago when he worked at La Victoria in Sunset Park Brooklyn, NY. 10/10 even I miss it very much 🫶🏼🥰🤍"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWGFWVXhWa3hMTmxRMmVVVXpWRTFHZUZGclltYxAB",
            "text": "They have delicious Cuban/ Chinese food here. The portions are large and I loved the plantains as well!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWWEycGxVRVJCWVRCQmVGbERPVVJLZEZwSmIyYxAB",
            "text": "Food was ok nothing mind blowing. Not enough flavor for Chinese and Cuban very bland. It’s ok based on the area it’s located. Fried chicken was blah the sesame chicken was good. Drinks were not strong. Place is good for take out that’s about it."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201M2NHUXlSRVpqVEdSdVkzSmhXSFppWkV0SVVtYxAB",
            "text": "Excelentes tacos. P"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MWRpMWxORFZxU1ZOa1lXWkNkbVpUU0hSRWRrRRAB",
            "text": "It's \"Cuban and Asian\" but mostly Asian. Food was good. We will be back. Owner told me I selected Asian food instead of Cuban food. We'll I like both okurr"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwek4wOTNTRXhqU0RKQ2IzcElhVzlrY3pKSGFFRRAB",
            "text": "I loved the old La Caridad at Broadway and 76th. I do not love this reincarnated version. Cross the street and go to La Dinastia for a more authentic Chino-Latino experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cWN6aEVOVVpaTVdKcFdYcGlTV1p0TkRjemVuYxAB",
            "text": "I came here 40 years ago when I moved to New York in 1986. It's true, nothing stays the same. I was disappointed to see it moved and was no longer \"Cuban \" it's just another greasy Chinese place with tasteless creole food! What happened? I guess it's the times, I expected so much more. Oh well 40 years is a long time!. Give it a try, you may like it. I didn't like the fact they didn't even speak Spanish! Or have any of the same items Cuban restaurants have. The waitress was not at all versed in anything the menue had .\nSorry-"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcGEydzFObGxmVG13d1pXTnJlWFpXVjFVeU0zYxAB",
            "text": "Once again we were  not sure where to eat.  So we said hey let's try this place . Many restaurants on 72 st.  We decided on this one. La Caridad 72.   No wait at the time we went. They were very nice seated us.  We looked at the menu , soooo many choices to pick from. It's a Cuban restaurant and Chinese. Ok menu looked good. I chose chicken wings and fried rice and salad. My partner mom chose  a noodle dish with beef. They brought us water and bread  and asked us what we wanted to drink. Our waitress very nice. Men that came over also very nice. Maybe 3 people were all attending us.  Didn't wait long for our food.  WOWWWWW , the portion that came out. Looked real good.  We were hungry, so we got down to business. It was nice and hottt and soooo good.  My plate and my moms plate was delicious. We both tasted each other's food. Looked good.  We  finished but didn't finish all of it. So we took the rest home. When I used their bathroom , it was nice and clean and smelled good. Waitress came over talked to us , she was so kind and funny. I said ,\"food was good. We couldn't finish it  all.\"  What she told us was so funny.  She said , \" mostly the the men finish it all , women don't\"  I laughed.    Thank u all we enjoyed our selves. People don't forget to write on their note pads as u walk out the door. It's right as u walk out the door but behind u. I did . Look for Sandy. Right in the middle. Enjoy. We will be back. Thank u"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUlF6WkNUREI0WW5SMWMycEVlbkJCWVdsS1kyYxAB",
            "text": "A loyal customer of La Caridad since it's original location on Broadway and 78th. Though this location is smaller quality of God and portions are the same. Best bang for your buck."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMU5VVkRNbGxYYlVoblN6Sk9kVlZNVldGU2FYYxAB",
            "text": "I am elated that I cane across this establishment.  Years ago there was a similar restaurant in my community that closed. I finally found a replacement to enjoy!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWlozZDZkVU5UV1VOMllWRTNYelZYTkVJMFpuYxAB",
            "text": "Great food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sS1RXaHVhR3RKWDJkb2IydDBSR2xYVFhoRFEyYxAB",
            "text": "10/10! Best fried chicken in the city."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeVRtaERTMnRCUjFwbVVsTnBNREJ4V25nME1GRRAB",
            "text": "Came in to try their crackling chicken. Unfortunately food wasn't good...chicken was juicy but far too salty and batter tasted a little burned (maybe oil needs to be changed)\n\nGreat portion size so good value for money but food fell flat unfortunately"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aZlpVRjZUWFpOYVVvd2JWazBTemhyT0dwdVptYxAB",
            "text": "Firstly i wanna shout out Lisa and Ana, they waited on me and my friend and that was some of the best service i ever had, not to mention the food was amazing! Definitely coming back to this place whenever im around the area!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GU1prRnlNVXhQTlVGUlgyVkRXVFV4VW1sekxYYxAB",
            "text": "If you love Puerto Rican-style Chinese food 🇵🇷, this place is a must! Delicious flavors that took me straight to the Caribbean, perfectly seasoned dishes, and friendly, knowledgeable staff. I highly recommend the fried pork chops with pork fried rice — unforgettable! They were also super attentive to my shellfish allergy, explaining every ingredient."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNVVqbHBhbkJJUTNVelNFMTVVeTF5Y21neE1uYxAB",
            "text": "This place is what they say it is.  Amazing service food and just the place to be.\nFirst time here will not be my last."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvd1dtWnVOREZvTkc4d1gwZGxUVjlDWkdaVlZsRRAB",
            "text": "What a great combo. So glad they relocated to this convenient spot on 72nd street. Chinese shrimp and broccoli, with yellow saffron rice, AND black beans! Yeah, buddy! The wait staff curated the ecclectic background music, lending another twist to the fusion aesthetic."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MldXRnZZMEZmUzNKU2RHbEdiMEp3TjNCbVgwRRAB",
            "text": "Muy buena comida"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkS1lsSm9kR3hKVDFFM1NHMW9aMDUwVEdRd05XYxAB",
            "text": "Nothing special but you feel like home.\nGood food & fair price"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTVZFVlFjVzlmT1ZrMFZuWmxVRFkwV1Voc1pIYxAB",
            "text": "Sabor espectacular, vayan con hambre los platos son grandes y su personal xtra simpáticos y amables"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UE5HWnJja015T1dkZlVFcG5TRGhwVUUxRlJHYxAB",
            "text": "Excelente comida"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MFEyOHpZMFpzZVhWT05VMTNOVWN3ZEY5UFFtYxAB",
            "text": "Cuban-Chinese Cuisine Perfection\nThe hype for this spot is real, and it is well-deserved. I had a craving for some oxtail, and this place absolutely hit the spot. The meat was so tasty and incredibly soft.\n\nWhile the ropa vieja was good, the sesame chicken might just be the best I have ever tasted in my entire life. My God, it was so good!\n\nThe service was also top-notch and very attentive.\n\nI took some egg rolls home and ate them the next day, and they were  perfection out the oven. I will definitely go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUVpGVlJkR0YxU1hkbVZGVkdRVTFtU3pGTVNsRRAB",
            "text": "Great spot 🙏"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcmRIUm5RVko2UXpSeVZuZHJPUzA1ZVRGelMyYxAB",
            "text": "I loved everything about this spot the food, the service the people working there they were very kind thank you to Willie. He took good care of me and my sister while we were there. I appreciate the hospitality quality Chinese fusion it was good. I got the boneless fried chicken meal, which is I believe a popular dish. It was also a big plate that can feed two people maybe three depending on your portion control Get that if you eat chicken and rice overall will be returning and putting others on if they don’t know."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdlQwSnhXRWRaT1U1MGIwTnVUazgwUjJScWFsRRAB",
            "text": "Cuban-Chinese cuisine served with huge portions. Taste is on point, and the employees are also very friendly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TWVYbGtVSFJCTmxrM1dDMU5WemRhY2xWVGJGRRAB",
            "text": "Food was so delicious! I would strongly recommend the chicken cracklings, the oxtail or the steak! Fried rice a must! Staff incredibly friendly & welcoming! I will definitely go back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WeGJITk5jazlyU3pnd2JrbHljbFJUYmxsQ1MzYxAB",
            "text": "I ordered some take out general tso and sesame chicken from the lunch specials, with a side of beans. Came out to $40! For that price I was expecting better. Overall nothing special won’t be returning and you can get better tasting food for cheaper. Not sure what the hype is about, perhaps the history from its previous location?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WS04xbERSa3h5VW1aM01UVlJTMkZOY2pGR1NWRRAB",
            "text": "The food was OK, but the service was terrible. Other tables got complimentary bread — we didn’t. One of our dishes was completely forgotten, and I ordered a large rice but got a small one instead. Honestly, I’ll stick with my Chinese-Cuban spots in Brooklyn and Queens. Much better service and overall experience. I don’t recommend this place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNFlqTnNXSHBZWDNKeGNtRnpTMHh4UlRad2FFRRAB",
            "text": "It doesn't matter if you order Spanish or Chinese, the food is always excellent, and the service as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSFUyMTFSV3RwUzNjMFQyZ3hhMGRXUlVoMlIyYxAB",
            "text": "A legitimate hidden gem in the Upper West Side. Stumbled upon this spot after originally wanting lunch from Thai 72, but decided on this restaurant instead. Seriously, it's so worth it.\n\nLunch specials everyday, a beautiful combination of Cuban and Chinese food. Complimentary bread, a choice of white or yellow rice with beans, large portion sizes, and aggressively competitive pricing.\n\nNext time I definitely want to try the pork belly, but the sliced chicken with yellow rice and beans legitimately blew me away. Will be back any time I'm in the UWS. It's fantastic."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWGVtNUZhRzFWWjNocFNFUnVXRUZPVDBJM1puYxAB",
            "text": "The service and the food was excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWd1dGa3RZWGhXTTJwV1EyOXhPWHAwUTJaek5IYxAB",
            "text": "Our waitress Ana was great very fun to be around her."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STFozSnpibFUyWm1Gdk5HRkJPVmhNVEdjdGNVRRAB",
            "text": "Good food nice service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wa1NteHRhV2xIV1hnNVpHaERWM1YwYUdkTU0zYxAB",
            "text": "The food was so delicious! Everything we ordered was on point. We're on vacation and so far yet...this has been the best place we've ate at. The service and atmosphere was great. Definitely going again before vacation is over. If you're in manhattan check this place out. You won't regret it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMWEzSjZha2hWYUdWbk1uQnhkM3B1V1ZkM1UzYxAB",
            "text": "the food and the service was good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYkYzOHVjekpiTTBnRRAB",
            "text": "Amazing service & atmosphere!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJT255Y3lyak9TcGV3EAE",
            "text": "Tasty food at reasonable prices.  The portions are generous. Eduardo and Willy are terrific and personable servers. Our family really enjoyed our dining experience there."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKX2wxNTZmejZiZk1nEAE",
            "text": "Food is great! Service is great!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdjBvdjZENUlPajR3RRAB",
            "text": "Had an amazing experience! First time comer! Will be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPVF9tWnJoOEpiWXlRRRAB",
            "text": "The food was outstanding—fresh, thoughtfully prepared, and clearly made with high-quality ingredients. Every dish felt intentional, from the flavor combinations to the presentation. You can really taste the difference when care is put into…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLTFN6LWJiNjdYeVFBEAE",
            "text": "Henny Colada was the soooo Good food was exceptional service was great Gary the owner was wonderful made sure everything was on point def coming here again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZjZ3WnZRdU1uVzZRRRAB",
            "text": "La Caridad has the most delicious food. The steak palomino, pork chops, yellow rice and beans are the best.  The staff are so friendly. We will keep coming back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLM25qSXYyamJQSWdBRRAB",
            "text": "5 Stars\nI’ve been to La Caridad 72 four times now, and every single visit has been exceptional. The food is an outstanding Cuban and Chinese fusion—flavorful, fresh, and always satisfying. It’s a rare combination done right, and every dish hits the mark. What truly sets this place apart is the service. Ana and Lisa are warm, welcoming, and always make you feel at home. Their friendly approach turns every meal into a memorable experience. This spot is a true NYC gem—I’ll keep coming back!"
        },
        {
            "date": "6달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeklyejFnRRAB",
            "text": "우연히 방문한 식당이었는데\n맛, 서비스 최고 입니다."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbE9qODJnRRAB",
            "text": "This is a unique place that will not disappoint. Growing up in Miami I recall a similar spot that served Cuban Chinese cuisine.\n\nI ordered the Beef Steak with Fried Rice. Every bite was delicious and I wanted more even after I was full.\n\nThe venue is nice and clean and the service was quick and friendly. Very unassuming place that doesn’t need much frills to provide delicious food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaGZuN3R3RRAB",
            "text": "My family and i visited here a few weeks ago for dinner. Service was great, staff were all attentive and approachable, rest room was also clean (thats a big plus for me) their portion is for sharing, its a lot!\n\nWe had\n\nRoasted chicken- i rate it 2.5/5, not a fan of tthe flavor, it didnt seem roasted to me, more like baked chicken.\n\nChicken crackling- this is 5/5 i definitely enjoyed it, the chicken were not dry and  for breast part, the fried rice was flavorful (i was too hungry that i forgot to take a photo)\n\nSweet plantains- who can go wrong with these, i also enjoyed it\n\nFried yuka- i enjoyed it really well\n\nThe black beans mix with rice my husband literally finished the whole plate, he enjoyed it very much. I guess thats a 5/5 for him"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa29xUVpnEAE",
            "text": "please subscribe to my YouTube channel aboricualifeinusa and Tiktok.Excellent service and latino chinese food. Had the steak and fried rice and ginger ale.Also a bit expensive but worth it. About 30$."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdE4tUkJBEAE",
            "text": "Brunch Buddies had brunch on Sunday. The food was delicious, the oxtail is the best , meat fell off the bone and that gravy ,so yummy. The portions are just right. Try the green beans we ordered for the table and we all loved it. Staff is friendly and attentive  and the wait for the food was very short. ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6anZpd2NREAE",
            "text": "This restaurant completely shocked me. I've never been to a Chinese / Cuban Fusion Restaurant before and the food was out of this world. We ordered a bunch of different dishes and shared them all. The flavors were insane and on point. Cream of Corn soup and the wonton soups were really tasty.\n\nThe Sesame Chicken was such a departure from the \"hood\" Chinese food that we normally get from the corner yet still had the same flavor profile to make it familiar.\n\nThe Shrimp & Broccoli was amazing. The Fried Rice that came with it was one of the best fried rice dishes I've ever had.\n\nThe Crackling Fried Chicken was delicious and juicy while also being super crispy.  If you're used to Latin food, this is pretty much Chicharon con Pollo and the black beans that it came with was really really good.\n\nThe Bistec de Palomilla had such a delicious garlic flavor and really tender. The portion was really big too.\n\nAnd the Vaca Frita had a wonderful char on the outside with a juicy inside and the onion flavor complimented it nicely. This was a small portion but it made up for it with taste.\n\nWe also ordered a few drinks. The Nutcrackers were so strong and delicious but my Caipirinha was sooo good. It was like getting it from an actual Brazilian bar. It was so balanced whereas most other caipirinhas are heavier on the cachaça or sugar.\n\nSaving the best for last, the service was awesome. Our server, Ana, was sweet, endearing and very attentive. She made some really great recommendations and she simply enhanced our visit that much more. I always factor in service because a good meal with really poor service can ruin the entire experience for me. Ana was wonderful!!! We are definitely coming back here again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbWQ2R2ZREAE",
            "text": "If you are in the upper West Side, definitely stop by to try authentic Chinese Cuban food. All the meat dishes are soft and tender. The side dishes are filling and properly portioned. The drinks will get you happy, if you know what i mean 😏 The interior gives off a cozy feel. The price is fair, considering the inflation rate and the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWbXVfaklREAE",
            "text": "I missed them so much when they closed during the pandemic, but they are back in this new location, and I couldn’t be happier.  The new space is smaller but it’s clean, spacious, and conveniently located near the 72 Street subways and bus.  I went after work yesterday and ordered the Fried Chicken Crackling ($18) Combo platter.  The platter came with 6 pieces of chicken, house fried rice (roast pork & shrimp), salad and 2 pieces of bread.  The food is exactly as I remembered and was so good!  The chicken had the crunchiest skin but was still moist and not over fried.  The rice was fluffy with lots of roast pork and shrimp mixed in.  The salad was just shredded lettuce and one slice of tomato. They had balsamic vinegar and olive oil at the table, so I put some on the salad and it was great!  This is the only Chinese restaurant I know that has oil and vinegar at the table.  The food portion was large, and I ended up with leftovers for lunch the next day.\n\nI must note that the service was wonderful. It literally took 35 minutes for me to sit down, order, eat and pay my bill.  It’s amazing how quickly they get the food out to you.\n\nI’m just so glad they reopened and will definitely put them on my rotation of restaurants to go to in this neighborhood.  Highly recommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcnB6VzFnRRAB",
            "text": "I randomly found this restaurant, I was tired of walking so I just decided to go in and give it a try instead of looking for reviewed places. This is one of the best things you’ll get in the neighborhood for how much you pay. Food quality and portions were great, the staff were friendly and very helpful. Just try whatever and if you are not sure what it is the staff will help you out."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNBaWNNZRAB",
            "text": "The food was delicious and comforting. Our server Ana was super friendly and gave us excellent recommendations on the combos. We had the fried chicken wings, oxtail, beef steak, and plantains and thoroughly enjoyed everything!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcjZfM2hBRRAB",
            "text": "The moment I entered La Caridad72, I was welcomed with smiles. The hospitality of the workers here, made me feel comfortable immediately.\nI came during lunch time. They have lunch specials and a surprisingly robust drink menu. I had the Shark Attack - a non alcoholic mixed beverage. It offers a cute spin on a Shirley Temple. The drink was fruity and sweet.\nThey provide bread for the table if you choose. While I asked for bread, we did not partake so I cannot tell you how good it is.\nFor my main dish, I had the Devil’s shrimp with rice. I upgraded my side of rice to combination fried rice. I was warned that the Devil’s Shrimp was spicy but found it quite mild. The shrimp and veggies were alright. I added some chilli paste and hot sauce to bring out some flavor.\nI enjoyed the combination fried rice. I thought that was great and tasty. I would order it again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieUlHRzBBRRAB",
            "text": "Was chatting more with a couple of staff members this time, who are very friendly. They were happy we are returning customers. We learned that they closed the previous location during the pandemic, relocated so they hope that their old customers will realize that they are back.\n\nWe liked the tripe with black bean sauce. Tried squid ink rice - 2 kinds: from chinese menu with shrimp; from cuban menu with veggies which we got. Has a hint of the ink flavor but not fishy, went well with the dry food we got- cuban fried pork and crispy chicken cracklings were good, both not oily or too fatty. Bistec de Palomilla (beef steak) combo with fried rice was a huge serving, cooked well and flavorful. And we didn't forget the Yuca fries, dipped into fresh garlic in vinegar. Servings are shareable so order a variety of dishes."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MU5PN2tRRRAB",
            "text": "I grew up with The Caridad Restaurant! I am so happy I found it again- The food and our Server Anita was Excellent! Thank you❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuN1piX3pBRRAB",
            "text": "By far one of the best places you can go for authentic Cuban style chinese food. Everything is top notch, fresh and delicious. Highly highly recommend the fried rice and the fried chicken. All dishes are exceptional. Make sure you get some green sauce!! I can’t sing enough praises about the customer service they provide and they’re so nice as well!! Come try this spot. You won’t be disappointed."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdUxTQ09nEAE",
            "text": "We went here during thanksgiving, and it was very well staffed. While we were there, there was enough people to change the fall decorations to winter decorations, cook food, serve food and bus tables. The waiter was very friendly and sociable. They had a wide variety of food. The food had very good quality and flavor. It was also very cleanly, and the paintings on the wall were very cool. Overall, it was a great experience. Would come again! Highlights included their oxtail stew, fried chicken and yucca dipped in garlic sauce."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuc191Ry1RRRAB",
            "text": "Amazing General Tso’s chicken. The best I have had in NYC.  Crispy, all white meat, very little breading and made fresh.   Service is very kind and attentive. Our waitress was Anna.  Will be back and a perfect neighborhood restaurant in UWS."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbHFqLThRRRAB",
            "text": "Get off the review section and just go. This place was SO good. I ordered the beef steak, chicken crackling, squid fried rice, house fried rice. Plantains both ways, general tso fish and more. Staff and service were very nice and attentive. Going back for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYak5xM2NBEAE",
            "text": "So glad to have this place back in the UWS!  Amazing fried rice.  The lunch specials, which are available on the weekends too, are a great bang for your buck."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMDdlUW93RRAB",
            "text": "Really good service!! Okay prices for the area, $18 was the cheapest full meal I could find. Big portions tho, enough for a light eater to take home. The best part of eating here was the warm cozy lighting and the kind and attentive service. Clean bathroom and they take apple and google pay."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaExyTnJnRRAB",
            "text": "Had a great first time experience eating here! Great apps and main dish combos to enjoy. Thank you Ana for the wonderful service and I will be back for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0d3F6TFhREAE",
            "text": "Truly delicious! I’m so happy this restaurant is back and maintained it’s quality through and through. Very affordable real food and real people. Can’t wait to see what they continue to do with their new location! Couldn’t stop myself from eating before taking a picture."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOTYtTVhREAE",
            "text": "Amazing food and good price for portions. Ana was very friendly and made our experience more enjoyable. Would highly recommend eating here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MzdpNGNBEAE",
            "text": "La Caridad 72 is truly a neighborhood treasure. The servers were so welcoming and attentive and the food was incredibly tasty. They also gave us free bread before ordering. Order the pepper steak and/or the crackling chicken!!! The portions are big and prices are reasonable. It was also super clean inside and the atmosphere is great. Definitely support this business, we will be back very soon!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxbzhqWkF3EAE",
            "text": "Absolute legend of a place been going there for 20 years. Incredible food, get the 1/4 chicken the gravy w the Maduros. Crackling chicken w the bone in is crazy tasty too!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbGF5NTZRRRAB",
            "text": "Great food, great service. My favorites were the squid ink fried rice, the oxtail and the boneless fried chicken. The tres leche is also a must try."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLXzE3SXFvODVMNzZ3RRAB",
            "text": "If you're looking for a delicious and unique dining experience, this Cuban-Chinese restaurant is a must-try! The fusion of bold Cuban flavors with classic Chinese dishes is both surprising and satisfying. The food is fresh, flavorful, and served in generous portions. Be sure to ask for Ana as your server—she’s attentive, friendly, and goes above and beyond to make your meal enjoyable. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcU9Qc3JnRRAB",
            "text": "WE FOUND IT!!! La Caridad 78 used to be my favorite restaurant until it closed its doors during the pandemic. Fast forward to today, with the help of Google, we saw that they reopened!! Same Great recipes and a few familiar faces, just expect a new location and a slightly different name. I couldn’t be happier! I got the pepper steak and onion platter with the combo rice and my fiancé ordered the beef steak with combo rice. He added a wonton soup and a spring roll to his meal and everything was satisfactory! We will definitely be back and tell our friends!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNHRxTkxnEAE",
            "text": "Wow, feels like  Home!! Ann is amazing !! Attention to details and makes you feel like family. The food is Delicous, Oaxtail, Chicken Crackling, shrimp and the fried rice wow!! Highly recommend this place. Tell Ann that Efrain from Chicago sent you !! Enjoy!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNDd6Zk5REAE",
            "text": "Excellent, polite service; great flavor and serving size like it used to be!\nthe interior is really clean and you could come as a family like we did or smaller groups, couple, or single."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNzc2V1d3EAE",
            "text": "Love this place! We just went for the first time and it was such an amazing and authentic experience— the staff is amazing. Just ask them what to get and they’ll tell you. We weren’t sure so they gave us a half portion of a couple different chicken to try. Really delicious and quick! Highly recommend"
        }
    ],
    "reviews_count": 80
}