{
    "name": "Sempre Oggi",
    "place_id": "ChIJ25ryEZ5ZwokRNUaYyZc52_8",
    "grid": "MN7",
    "address": "164 W 75th St, New York, NY 10023, USA",
    "rating": 4.7,
    "user_ratings_total": 345,
    "phone_number": "(212) 377-7150",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa2RUWlhWMmxXYW5Cc1owVTVkbTFwWVdoR1YyYxAB",
            "text": "Beautiful restaurant with good vibes and friendly staff. Delicious food and cocktails, approachable wine list, with lots of well priced bottles from Italy, France and USA."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdlNtbzBaSEV0VXpOMk16TTFablZSTnpGcmNYYxAB",
            "text": "Walked in on a Saturday evening (on the earlier side), and we were able to get seated at the “chef’s counter.” We started off with drinks at the bar ($10 cocktails from 4-6 PM!), which had a nice vibe, before moving to the chef’s counter right in front of the kitchen. It was nice to be able to see the hustle and bustle of the kitchen and take in the aroma of the various dishes being prepared.\n\nWe started with whipped ricotta and fig bruschetta; the balance of savory and sweet made for a nice bite, but some parts of the bread were grilled a bit too long and were burnt. For mains, we had fettuccine with white bolognese and fusilli with basil pesto and spicy sausage. Both pastas were very good. The white bolognese had hints of liver to add to the layers and richness of the flavor. The fusilli had a brighter flavor, with a nice dash of heat from the sausage.\n\nDessert was torta di formaggio, which ended up being a chocolate cheesecake. The upper shell was hard, which added to great textural contrast. The orange cream also balanced out the decadence of the chocolate.\n\nService was friendly and informative. The vibe was a bit more fancy than your average neighborhood spot, but not so fancy to be stuffy."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUmExY3RjREp3ZVZaVVNEbGhkamhTTFRkcVFrRRAB",
            "text": "Food and service are fantastic as is the wine list. A+ all around!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RVZHdDBOWEppU1doNWMxWTJhMGhqYzFOcE1tYxAB",
            "text": "Upscale with a local UWS vibe. Staff could not be friendlier. Great place to share multiple courses. Love the branzino with artichoke. Bryan made us feel right at home."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMGRuRm5jRGhxYld0RWFUQm5hMnBxTTBGdVNrRRAB",
            "text": "Absolutely loved this place! The food was delicious, the vibes were on point, and the cocktails were amazing. The lighting is dim and cozy—perfect for a girls’ night out or a romantic date. Everything from the service to the atmosphere made for such a great experience. Highly recommend!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSM05rZFllVTVPVVZVeU1qbFJSbWhNV0VSMGJVRRAB",
            "text": "Amazing food, team & ambiance!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkR1IyZ3diMmhYTWtsck1sWjBaREJOT1VGVlNHYxAB",
            "text": "Of my favorite restaurants, I live in Harlem, and I find myself here often as a regular. The bar is incredible. The service is out of this world, and I love how the menu changes frequently, where you have to return weekly.\n\nOne of my favorite things to order from the bartender Marvin is an extra dirty martini."
        },
        {
            "date": "수정일: 5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3by03V3pRRRAB",
            "text": "Wonderful location, food and service are DEVINE."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNFJtdzFlRGRGZHpsVFZYTjJORVUyVm1kd05IYxAB",
            "text": "Our server Emma made the evening. She was attentive without being intrusive, incredibly knowledgeable about the menu, and had fantastic recommendations — she clearly loves what she does. Her friendly energy and professionalism made us feel completely taken care"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdlZVVXpNR1ZFWm1KbVVGOXdSbUZKYmt4dlFuYxAB",
            "text": "The food and service is immaculate! I’ve never tasted food like this in my life. Every detail to the service, food, and overall atmosphere of the restaurant is incredible. Everyone should get a taste of Italy!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMFZuSTVTa3RSVWxJdFZUUTJSRUZ0TjFKQ1dVRRAB",
            "text": "Excellent service, high-end atmosphere, and the food was great. We will be back for sure!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMVFtcFhibmhmUjB4ak1IcHVhVE50UVVaQ09WRRAB",
            "text": "I come here almost every week now and honestly this is the best Italian restaurant I ever been to!! Everyone is very friendly and I have tried Almost everything on the menu by now and can’t say one bad thing about it!! Even brunch is so good!!!! Just love coming here every single time and don’t hesitate coming here at all!!! 10/10!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWVVWUnFhVE0yY1RaNVUzZzFRbWxyYWxCTVJXYxAB",
            "text": "Da leccarsi i baffi!\n\nSempre Oggi has quickly become one of my favorite restaurants in New York City, and I can confidently say that it serves some of the best Italian food I’ve had outside of Italy itself.\n\nThis is the place I bring the people I love when I want the night to feel special. I’ve celebrated just about every milestone here — my best friend’s engagement, my sister landing her first job, my girlfriend’s move to NYC, my mom’s birthday, my dad’s birthday, even dinner with a chef/friend I wanted to impress. Sempre Oggi has become my go-to spot for moments that matter — which, in my view, is a true testament to how exceptional it is.\n\nThe menu is carefully crafted, with signature dishes that always hit and seasonal specials that somehow raise the bar even higher. The staff is attentive, warm, and genuinely invested in making sure you enjoy your night. The space is beautiful, the ambiance effortlessly inviting, and the overall vibe? Immaculate.\n\nVolete sapere quando dovreste provare questo ristorante? La risposta sarà… Sempre Oggi."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4dFFtaE9Va2Q2U0ZGQ1dFTTBka2cyTUhWYVNFRRAB",
            "text": "My wife and I strolled over to Sempre Oggi after having a drink near by. We were greeted warmly and after a short wait were seated. Not bad on a Friday night without a reservation. Loved the stracciatella with  beets but when the server offered bread we expected a basket not focaccia which was added to our bill. After that our appetites were spoiled. The focaccia was far to filling so unless you’re really hungry take a hard pass on the bread option. My wife had pappardelle and I had the halibut. I preferred her pasta because the fish was over flavored with oregano and swimming in oil. We could barely put a dent in the Brussels sprouts which were delicious but so saturated in flavors we couldn’t taste them. Other than the bread issue our server was excellent. If there’s a next time we’ll be sure to share more dishes and leave room for desert."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RE0yVXdiblZCYnpWbVNHNUpiMUpHYURBdGFuYxAB",
            "text": "My son and I were in NY for an opera weekend, and as we were staying close by at the Beacon Hotel we chanced to walk into Sempre Oggi on Thursday night without reservations. The wait for a table was only a half hour but there were 2 seats open at the bar and we grabbed them. What a delightful dinner we had! We started with 2 wonderful cocktails. (BTW, every drink the bartender made looked amazing.) We agrred that our 2 salads, the Norwich Meadow Farm’s Mixed Lettuces and the Little Gem With Classic Caesar  Dressing, were two of the best salads we'd ever had. He ordered the pappardella which had perfectly made pasta and was extremely flavorful. I just had an order of arancini and they were so tasty. Service was perfect and friendly. A lovely meal!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNWRWVlhTbmxLTFVwc04zVTJkV054WjFrMFZXYxAB",
            "text": "Went here once for apps and enjoyed it so was excited to come back for dinner. Unfortunately this had to be one of the worst Italian meals I’ve had. Appetizers of bread with riccota and Caesar salad — the presentation of their bread and ricotta was so sad, like one piece of bread sliced into 4 with a little dollop of ricotta. The Caesar salad was inedible — hands down worst Cesar salad I’ve ever had. 18 bucks for some fishy undressed lettuce with zero crunch or texture. Sent it back. For 35 bucks you can get pasta with guancale which was recommended to us but truly had no flavor at all. Mostly just tasted the water the pasta was boiled in. The branzino was pretty good, but not good enough to make us come back. We live in the neighborhood so was hoping for more, but I would say it would be best to look somewhere else. Also, the bartender says “hell yeah” too much. We’re not in Cali brah."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeGEyaHFaVTFPVlVoUFdFRTFhM0ZNVUhGMmRrRRAB",
            "text": "Another fantastic experience at Sempre Oggi — so outstanding we went two nights in a row! The tuna crudo, little gem salad, whipped ricotta with fig bruschetta, chicken, ribeye, cappelletti, and broccolini were all exceptional. We started the evening with a Boulevardier, which was sheer perfection. Marvin is an absolute pro who always has the best recommendations, and last night we met Amina - both make us feel so welcome and cared for. Our favorite spot in NYC!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSVpUQm1Ua0pEY0docVJqRlZkM1pNVG1wME0xRRAB",
            "text": "Here in June - sublime.\n\nHere in October - as if the property has changed hands. Service was engaging and reasonably attentive, but the seamless hi-end team approach now replaced by something more casual/haphazard.\n\nKitchen output unrecognizable vs June visit. Overdressed salad, wilting to inedible in its time on the service bar. Pastas of a serviceable but unremarkable execution/flavor profile. Kitchen timing issues, awkwardly long waits for courses, etc\n\nLoved this property, June 2025. Please return to that standard."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMlpUSmtiSEZsTVRGa09YQTFRMVZHUVhadFRXYxAB",
            "text": "We loved our dinner at Sempre Oggi. The food was delicious and the staff were so attentive. Couldn’t have asked for a better experience."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUk9YZENSVVJLYVhGWlRWbEtPSEJRWDBOSmFFRRAB",
            "text": "Best new restaurant on the UWS. And, you can have a conversation!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcmFFSjJlRkpXZDJ4VVRtY3djWEZ1V0hOTmRYYxAB",
            "text": "Had a lovely dinner with my daughter this weekend. The service is spot on - smooth and accommodating. From cocktails to dessert - everything was delicious. The whipped ricotta and fig crostini - amazing bite. Ceasar - different and bright. Pasta dishes (especially the rigatoni amatriciana) are beyond your expectations for a freshly made pasta. We cannot wait to return and work our way through this ever changing menu."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aM09WWjNWMVJxTkd0V1pEaDZiemhaUkU1NmNrRRAB",
            "text": "Warm welcome at the door. Well-designed spacious dining room with great vibes, yet quiet. Beautiful salads and excellent 'true al dente' pastas (we had the linguini alle vongole and a spaghetti dish with roasted cauliflower). Attractive wines by the glass and also a tasty sober spritz mocktail. Highly-recommended!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWExTMTRMWFJoVTBZMFNIZDFUbUpYTmtacFQwRRAB",
            "text": "Great food and fantastic design decor. New favorite spot in Upper West Side!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaGNVcGZaM1IyYURkcGFGaFVZbGt4VVVjeVpXYxAB",
            "text": "Had a great pre-theater meal at Sempre Oggi. The restaurant is very pretty and cozy, the staff was warm and hospitable, and the food was excellent.  I had the duck pasta and was tempted to lick the bowl, it was so food!   Worth the trip."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bFgyWllVV042VTJSalVHaHFaV1JpVUVWMFYwRRAB",
            "text": "This is a true UWS hidden gem!! Everything was perfection! From the hostess, sommelier, bartender, waitress and service. The care was at Michelin star level, yet without the price tag. And the food was beyond. Bite after bite was more incredible than the last! I cannot wait to return with everyone I know.  We always struggle where to go locally because the food and restaurants are just average on the UWS. But this is truly a gem! I just hope we can still get a reservation after everyone discovers them!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1YU1GUkRZVzVvUms5TVIxWTJOVTVDZEhkdmMxRRAB",
            "text": "Service and food far above average, overbooked, so we had to wait more than half an hour for our table."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbFRVOXpVVVJvVkVkS2NGRk5SWEp4YUhaM1ptYxAB",
            "text": "Best Italian in the UWS hands down, one of the best chickens in town!\nSeasonal cooking done at is best"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dFUxRjZjRFpOZGtGWFNFRlNaR2xXWlVwa1ZFRRAB",
            "text": "Horrible, horrible, horrible! The worst experience in New York. Things started off badly when the staff rushed us to choose our drinks. We sent back a glass of wine because it was completely fermented — being from Argentina, we know our wines. The sommelier (or whoever he was), a man with a mustache, treated us with total disrespect and disdain. The food took ages to arrive. The chicken was undercooked, the fries were over-fried, and the fish came drenched in a buttery sauce. Everything was greasy. Everything was unpleasant — the service, the place, and the food. Don’t waste your money here unless you enjoy being mistreated and ripped off."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsa1QwbEJXVVZyV1U5aGVWbE9ObGw0VFRWV01FRRAB",
            "text": "Place never fails. Very consistent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQ2EzQklPSGcyYkZZM1RuQXlSekJ5TTNWMlIwRRAB",
            "text": "Riccotta Brushetta and Rigatoni was so good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMWJTMVpkRVJuZDNGaGVVb3hNMkpwY0dSaFdtYxAB",
            "text": "The only negative thing I can say is that I should have written this review sooner!! (Sorry Bryan!!) We worked with the manager, Bryan, to plan a private dinner for roughly 80 people last June. Everything was FANTASTIC. I have planned and run events at some of the largest venues in NYC and dozens of other restaurants and I can say without out a doubt that this was one of the best experiences I ever had.\n\nFirst - the restaurant itself is stunning. Elegant yet modern, sleek yet warm. Everything from the lighting, to the acoustics, to the comfort of the chairs has been deliberately thought of to produce an extremely comfortable and beautiful dining experience. Over the course of our planning I ate at the bar and in the garden room and both experiences were just lovely.\n\nBryan and his team are true professionals and worked with us to create the perfect event, meeting our budget with creative menu ideas and setting up the room to allow for optimal flow and comfort. Bryan clearly knows what he is doing and leads with great ideas but makes room for the client to exert their own ideas and needs. It was a wonderfully collaborative process.\n\nThe event went off without a hitch. Everything fired on time and service was outstanding. Every single one of our guests remarked at how incredible the food, service, and ambiance was. I can only hope to have another event to throw so I can work with Bryan here again. Until then, you'll have me as a customer!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdFZIWnpSMFp1ZEdKWWVGTmlZMWg0WjB0NFpGRRAB",
            "text": "Can’t say enough great things about this restaurant experience. The place looks beautiful - modern, unusual design.  Everyone there was so incredibly gracious and friendly. And then the food - really incredible.  if possible go with four people so you can really sample the dishes. Antipasti that we had was the unbelievable focaccia, the arancini filled with duck, and the fried artichoke hearts with lemon cream. All were superb. We had two pastas - the seasonal spaghetti with zucchini and the orrechetti with sausage and broccoli rabe. Dessert was equally delicious but I’d recommend the crostata, whatever is in season. I wish I lived here so this might be my favorite Italian!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNFgzZFNiMnd0Y2pab1RtbzFXSGxGYW5aTVoyYxAB",
            "text": "My wife and I celebrated our pre wedding party at siempre oggi with family and friends. Amazing experience food, drinks, service was excellent beautiful and kind atmosphere far from those crowds and noisy restaurants in the city you guys made us feel like home. Definitely coming back. Thank you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MFdGY3hjazlTY1hwQmQxOWFOblpTWVhaTE9WRRAB",
            "text": "Absolutely phenomenal! Lovely host and server my birthday extra special 😊"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bFVESmxjekZ1T0RCUGRuRXpkRlJoWWpBd1duYxAB",
            "text": "We went there for brunch today. So...everything was great until we started getting bit by mosquitos. And then I saw a GIANT cockroach climbing up the wall by the bar. I told the staff who took care of it. And if that wasn't enough, I had to kill a bug crawling to the wall on the way to the bathroom. I looked for the grade outside the window but I didn't see it. I don't think I will be going back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MmJGRm5VMUZUVEd0R2RrRlJaVUZTYlZCSFZVRRAB",
            "text": "I’m Italian and I can guarantee that when you eat in this restaurant you will feel like in Italy! The food is amazing!! The service is impeccable, Iris made our experience superb, she’s so prepared and she helped us make the best choices!\nBest restaurant in the Upper West side."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsd1lrVkZjSFZTZFUxMlpsZGllRkpzVFcxNlFtYxAB",
            "text": "I have dined here multiple times and every time the food, service, and ambience have been excellent.  One of those times was a surprise birthday party for my husband.  They could not have made it easier or been nicer or more accommodating.  Many guests commented on how lovely the staff, food, and space were.  They are a wonderful addition to the neighborhood!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTFgzZElUalJwZEhwMWJHZHFVMlZETlhKSk1uYxAB",
            "text": "This was my second visit to Sempre Oggi and I was excited to bring my foodie & wine lover friends to celebrate two birthdays. The concept & name of the restaurant- Always Today, is what drew me in.\nNot only was my sommelier friend delighted by the wine & cocktail  options but everything from the fluffy fresh foccacia to the incredible pasta, fish & desserts were chef's kiss. I had the spaghetti with a zucchini creme, fried zucchini, basil & pecorino. I ordered the roasted mushroom melange which I added to the pasta- Oh My Gawd! So good.\nNow the service...our server Michael, Luis the somm & Bryan the manager were all amiable, attentive without being overbearing and felt like old friends. The industry is small and there is always a common thread. Ours was wine!\nThe space is beautiful and elegant without being stuffy.\nNeedless to say my friends & I were happy & full. We will be back again...and again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsd1dVaGpYMk5LZERKRVZYQmhXV0UwYVRKUlVFRRAB",
            "text": "From the minute we stepped in, we were made to feel so welcome! The team did a wonderful job of creating a warm atmosphere through their friendliness. On top of that, the space itself was uniquely cozy yet sophisticated, and the noise levels were ideal to converse without feeling a need to shout.\n\nFor dinner I ordered the sweet corn cappelletti, and thoroughly enjoyed it. The corn filling was summery and fresh, and the sungold tomato sauce was the perfect burst of flavor to complement it. The pasta served as a delicate wrapper for the corn filling, which was fun to eat and allowed the corn to shine. I look forward to coming back and trying other seasonal delights.\n\nAll in all I was quite impressed with Sempre Oggi and I'm excited to have them in the neighborhood."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvci03TUxBEAE",
            "text": "CHECK YOUR BILL! When our bill arrived it was more than double what we owed, with 75% of the items being charged twice or three times. I truly hope this was an honest system error. Food was decent, service was slow. I don’t know if I’d go again.\n\nUPDATE: The restaurant reached out and said to contact them about my experience, sharing an email address (see comment below) which is not a legitimate email. 🤔"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabGJXbHRURlJGTFRNMGR6TkthMlpEUm1zNFNFRRAB",
            "text": "This place is a must try! We were greeted very warmly when we arrived and gave them our name. They also have a little spot at the front with standing cocktail tables where you can wait for your table. We ordered cocktails there, and our table was ready so quickly, they offered to bring them to our table. The cocktails we tried were fantastic! Our waitress and the staff were phenomenal and provided their recommendations for each category on the menu. For an appetizer, we ordered the calamari and the olives, both of which were simple but great. We ultimately decided to split a primi (pasta) plate and a large plate. Once we chose our dishes, the sommelier came to guide us in choosing a wine. The wine we chose based on his recommendations was perfect for what we ordered. Both the linguine with gulf shrimp and the branzino were fantastic. Desert was also great, especially the tiramisu (maybe the best I’ve had). I cannot recommend this spot enough! Not only was the food and service fantastic, but the restaurant’s esthetic was top notch as well!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVE4ydHVXbGxDVFRaSlpVVm1ZWGhaUmxCSk5uYxAB",
            "text": "Unforgettable experience from the food to the service to the bar to the atmosphere. Fantastic."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcmVWZExjRzFmWXpObGMzVjZVbEl5WTNwNldVRRAB",
            "text": "I don’t know where to start…\nFood, no words! Excellent.\nInterior design, WOW!\nService, A1… Great Job Michael!\n\nCan’t wait to go back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWlZVcDFha1l0V1hvNFZsOW9TSEZSU1RZNVgwRRAB",
            "text": "Robert was phenomenal host\nservice was in accord to every aspect of NYC finesse\nfood- you could feel that in Sempre they use only good, healthy ingredients\nBravo"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oT1JYcDZXREk1UkZwSWNtUTFRM1JZU0VWMGJuYxAB",
            "text": "Even though the place was slammed at 7 on a Wednesday in August, service and food were wonderful. I feel as stuffed as if I went to Nonna's house, and our server JP made us feel truly welcome and cared for. The focaccia is legendary, and I loved the pickled mussels, branzino, crostata, and delicious Sicilian wine pairings. Do yourself a favor and skip lunch before coming here, and definitely make a reservation."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGYVJ6bGZRMWxGTkZGeVpFWlZjalZYY1d0Q1UxRRAB",
            "text": "Amazing service, wonderful food. Absolutely astonished by the amazing service Robert gave"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMmNHWXpRMlZLWmxVeFlXVklZVFppWlRrNVVVRRAB",
            "text": "Luis gave me an incredible experience between service and wine and food, i was massively impressed. This is a special neighborhood spot, the food is delicious, the space is gorgeous, and it was an absolute pleasure to dine with such a lovely staff! Thank you again for a great dinner."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVExYSjFPR1JzYjBKUmNXUmlZbk5PYlcxZlIyYxAB",
            "text": "Who knew how wonderful this neighborhood Italian restaurant could be? We took advantage of Restaurant Week and discovered a gem on the UWS!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORmJqRTBRVVpwWDFONmFub3lUR1l6ZVZGNloyYxAB",
            "text": "Always a great experience! I went this time during NYC’s restaurant week and had an amazing dinner. Creative menu and the quality of the food are always impressive! Keep doing the great work!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMlMyNW1PVFkwU0hkbU5Xc3pWRkJUTjJWbk4zYxAB",
            "text": "The service was poor and inattentive. It took 45 minutes for a salad to be served and 90 minutes for the main dishes. The eggplant lasagna was burnt.  They were kind to remove the charges but could care less that it ruined the evening. I will be reluctant to return to this restaurant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sZlpsRnBRVmgwTUdKU1dXTkVWbE5QUkZBelJrRRAB",
            "text": "Atmosphere is utterly stunning, and the food was alright. The counter seating with the open view really tells how well the cleanliness of the kitchen is, but not really kid friendly due to smoke. Really busy dinner rush when I got in so service was a tad slow. The food was good but a bit too sour for my palate."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJLU81UFdIdDV1SDNRRRAB",
            "text": "We are so happy to have found this neighborhood new fave. Food was very fresh and prepared with seasonal ingredients. Our waitress, iris was super friendly and attentive. Four of us all loved our food.\nThe only thing that is a little off is the bar area which is where our table was located smelled like cigarette."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdU5VNHhhMVZHU1dZMVpWZGxkblV6T0ZVeWJuYxAB",
            "text": "New favorite spot in the Upper Westside. From the service to the ambiance to the amazing food, Sempre Oggi did not disappoint.\n\nOur server Yussef offered the NY Restaurant week menu but we ended up ordering from the traditional menu to have more options. Started with an espresso martini, the prosciutto, a perfectly dressed little gem caesar salad and just-right crispy calamari. Then had the well seasoned branzino with artichoke and tagliatelle with rabbit.\n\nCleaned our plates and got out in great time for a show around the corner at the Beacon. Thanks team for the lovely meal. Will definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3a011NUtnEAE",
            "text": "Excellent food, but really disappointed by the service. The ambience is pleasant, but the tables are packed together, so there is no privacy. They knew I had to leave for a show because they called me and asked again when I arrived, which is nice. However, despite their assurance that I would have plenty of time, they brought the last dish after the time I was supposed to leave. I had to eat in a rush and couldn't enjoy my food. Once they knew they were late, instead of communicating openly the waiters hid away."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYemVqNGpBRRAB",
            "text": "My best friend and I decided to check out Sempre Oggi as we had a comedy show on Friday October 25. The place is very spacious and the decor is captivating. Apparently on this evening, another couple took our reservation, which was odd but we were quickly seated and well taken care of. The bread was yummy and our dishes too! The restrooms were also very clean and individual which is always appreciated! We did not order dessert as we were very full but I loved the atmosphere and the service was superb!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMmQyN1RBEAE",
            "text": "A great addition to UWS; spacious, amazing food, family-friendly, impeccable service, etc. You can comfortably host a big group (6-8, or more) here. We were able to talk undisturbed throughout our meals because the space has enough room between the tables. The pasta dishes are all delicious, but I personally felt they were a little bit smaller than other restaurants(?).\nOur favorite was the Roasted Chicken!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3a3NTcEp3EAE",
            "text": "Finally found a pretty decent restaurant in the UWS that I would go back to. Calamari was crispy and flavorful. Pastas were perfectly cooked and nicely seasoned. The veal Milanese was perfectly crispy on the outside and tender in the middle. Didn’t have room for dessert but will have to return to try more dishes."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMDRydmVBEAE",
            "text": "Incredible! Favorite new italian spot on the UWS- amazing authentic food, the best i’ve had since traveling to italy. The interior is completely redesigned, huge, and beautiful with a gorgeous bar and a counter where you can eat and watch the chefs cook right in front of you. The service was amazing and i believe almost all italians- our server was a very sweet woman from Milan who even put one of our desserts on the house! Everything was consistently delicious and we can’t wait to come back and try the rest of the menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuazd2MzFBRRAB",
            "text": "I recently dined at Sempre Oggi, and it was truly an unforgettable experience. From the moment I walked in, I was captivated by the elegant ambiance. The decor is chic and modern, yet warm and inviting, setting the perfect tone for the evening.\n\nThe service was impeccable — attentive without being intrusive.\n\nNow, on to the food — every dish was a masterpiece! We started with the seafood salad, which was a delightful combination of fresh seafood, olives and parsley. We also had the focaccia bread which was absolutely delicious! For the main course, I had the Almond Crusted Halibut, and it was simply divine. Cooked to perfection, the ingredients were fresh, and the flavors were perfectly balanced.\nOverall, Sempre Oggi exceeded all of my expectations. It's not just a meal; it's an experience. If you're looking for a special night out or a place to celebrate, this is it. I can't wait to return and explore more of the menu. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cEtXRm53RRAB",
            "text": "Tried this place for the first time. Didn’t think it would live up to the 4.7 rating and be worth the price but i was so pleasantly surprised. Beautiful restaurant, great service, and most importantly, everything we ordered was excellent. We got 2 cocktails each and split the ceasar salad, the crab linguini, and the rigatoni. It was all so good we tried ordering another pasta but the kitchen had just closed. The rigatoni was our favorite but the linguini a close second. Totaled out to about $100 per person which is what we were expecting. I’ll 100% be back and likely ordering some takeout from here in the future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieWZQeXZnRRAB",
            "text": "We had a wonderful brunch this morning at Sempre Oggi, which is now in the space of one of our former Upper West Side favorites, Cesca. The owners did a beautiful job with the renovation. The menu options and food were both great. Most importantly, though, the service was out of this world. Sempre Oggi is definitely going to be one of our new go-to spots up here. It's great to get another fabulous restaurant back in the area!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRclBqUVlREAE",
            "text": "A+. What more to say? GM Bryan was wonderful too!\n\nDefinitely worth adding to your list to try, if you haven’t. Found my new favorite spot in NYC!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MGRfbGhRRRAB",
            "text": "For those upper Westside foodies who thought they had to go downtown for a great meal, save your Uber fare and walk over to Sempre Oggi located on W. 75th St. between Columbus and Amsterdam, once the home of Cesca\n\nFrom the moment we entered we were warmly greeted by front of house staff including the GM Ken. . Before being seated take a moment to appreciate the renovated interior inspired by italian architect and designer Gio Ponti. While the space is large, you can still have a civil conversation with your dinner companions without shouting across the table. Always a plus!\n\nNow to the menu. So many interesting choices, but I will share my experience. The Caesar salad was perfectly dressed in a tasty dressing- not the usual heavy creamy style. One of my many pet peeves is having to ask for serving pieces, but our terrific waiter Rex magically made them appear! Next,  perfectly cooked orecchiette\nwith broccoli, calabrian chili, meyer lemon & pecorino Calabrese. The grilled swordfish, adorned with\ncharred cauliflower, golden raisins, pinoli  and gremolata, was both beautiful presented and delicious. Dessert options were all tempting, however snapdragon apples are among my favorite so I selected the snap dragon crostini with ice cream. (It just happened to be our waiter’s favorite as well!)\n\nBut that’s not all….as we were leaving we were gifted with tote bags. A great gesture to thank us for coming to the restaurant and, of course, to help spread the word.\n\nThe environment, the food the staff was all impressive. Sempre Oggi is a welcome addition to the Upper West Side. Maybe some of your downtown friend will venture north?!\n\nBy the way- as in the name Sempre Oggi- Always Today, the menu will vary based on selection of available fresh products!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U1owNTRhRGt3VEdaalVVbHRkMFpSTVU5dVQyYxAB",
            "text": "Incredible meal. Fun, lively atmosphere (design has a funky modern Italian vibe). Food is off the charts DELICIOUS, start to finish. Grilled zucchini appetizer, the halibut meal, the chocolate cheesecake dessert…just phenomenal. Seasoned and cooked to perfection. Lovely, attentive staff. Couldn’t ask for a better night. This restaurant is the new STAR of the UWS."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dDhydG5RRRAB",
            "text": "I cannot say enough amazing things about this restaurant!! I went there to celebrate my 25th birthday and left with both a happy heart and stomach. The front-of-house staff greeted with me so much care and kindness, offered me a coat check service, and quickly sat me at my seat even though I arrived 15 minutes early. When I made the reservation, I told them I was celebrating my birthday and they printed out a special menu that read “Happy Birthday Sydney” — such a sweet touch! They were so kind and generous, offering me a free glass of bubbles for my birthday and quickly attended to every need. I ordered the focaccia, rigatoni amatriciana, and the tiramisu for dessert. Best Italian food I’ve had since traveling to Italy 2 years ago!! I sat at a bar-like counter that oversaw the kitchen so I got to watch the insanely talented chefs whip up everyone’s meals. My waiter was incredibly kind, patient, and just a wonderful server. Special shoutout to Colleen, the Assistant General Manager, who made my birthday extra special with her generosity and joyful spirit! I even got a chance to chat with the owner’s parents and learn more about this incredible family establishment. As I told everyone I encountered, I will be back and will be bringing all my friends and family! Thank you all so much for making my birthday special!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Rd2JVNUxObEpVWTBSU01ESlFaRkEyTW01cGIwRRAB",
            "text": "The branzino with artichoke was very good. The deserts were excellent. We had chocolate ice cream, blackberry sorbet and tiramisu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRFpFTnlOR3RQWlU5NGJWZENjemhRVjBoUVFXYxAB",
            "text": "Cannot say enough good things about the restaurant and their team. Colleen has helped perfect two big family celebrations for my family. The management team led by Brian is so incredible too!! Truly, they have exceeded all of our expectations. Now about the food, it’s the freshest and most delicious dishes we’ve tried - consistently. This is my top 5 restaurant in all of NYC. the service and all of the waiters staff are so accommodating and knowledgeable. I love the addition of market fresh dishes, it makes every time we visit so much more exciting. Can’t wait to try the brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNianFIS1J3EAE",
            "text": "I'm still thinking about my dinner at Sempre Oggi on the UWS - sophisticated yet simple and packed with flavors! From the seafood salad to the corn risotto, grilled chicken, beets, and desserts, every bite was a revelation. Kudos to chef Basone! The service was also super friendly and attentive, and the atmosphere was cozy and inviting. I'm already planning my next visit - don't miss out on this place, trust me!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcGNVbEhja2MyZFV4eFlsRTJabVUyVFZsRVRVRRAB",
            "text": "Lindo y sofisticado lugar en el upper west side de Manhattan.\nBuenas pastas y antipastos. Carta de vinos no muy larga, pero bien curada.\nLos platos nos son demasiado abundantes.\nPedimos un vitello tonnato, una pasta alla matriciana y otra con pistachos, muy rica.\nDemoraron muchísimo entre la entrada y el plato principal, lo que hizo que perdiera temperatura la \"muy estrictamente medida copa de vino\". No comimos postre.\nLo considero caro, pues no deja de ser pasta."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1amFXdE1URVpQUkZRNVkyMVFTMVZmUzAxaGJrRRAB",
            "text": "Yesterday there were 5 of us. We celebrated my friends’ recent wedding and my son and his girlfriend’s college graduation. They even print out  special menus celebrating the 2 occasions. Brian the manager simply asked us to leave it to him to order for us. Our waiter Michael was very attentive and the wine guy Lewis was an expert in serving the wine. It was a 3 hour blissful perfection in every way! Exquisite food and service! Can’t wait to go back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMaXhydWkxNzlxRlZREAE",
            "text": "Sempre Oggi It’s an extraordinary restaurant. Despite being very crowded, the atmosphere is incredibly cozy, and the food is amazing. If you sit near the chef’s counter, you can also watch the process. it’s fascinating to see how the chefs manage to prepare so many things at once. The staff is very attentive, especially the manager, who is very charming and extremely professional. He came over personally, spoke with us, and asked how we enjoyed our time. The bartenders are also incredibly professional.The drinks were delicious, and the food was amazing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdUpUMVdnEAE",
            "text": "Beginning to end every single dish was unique, tasty, and full of flavor. There was so much attention to detail and the service was impeccable. We will absolutely return!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeFdEaEhVemR1YlhoWlNVNVdiMlIxWTFjeFNIYxAB",
            "text": "One of the best restaurants in the neighborhood, but it feels like they're still finding their way post-Michelin. Service was friendly but terribly slow, at the bar as well as in the restaurant. Cocktails were good, appetizers were STELLAR,…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueTZiNDlnRRAB",
            "text": "In my reservation notes I requested a quiet table not hemmed in by guests.  When a guest makes a request, believe them. No sooner was I enjoying my salad when the host dropped a four top right next to me with the kind of people who don’t know how to talk in a public space.  Loud mouths is the inelegant term.  The waiter kept calling me ma’am.  Single women should be referred to as Ms.  In fact, all women should be.  No one wants to be aged.  I asked for more olive oil for the fabulous focaccia and apparently the staff had to go press more.  Eventually, I asked another staff member for a bit more although by that time everything was cold.  At least the waiter remembered to top up my sparkling water.  The salad had too much dressing on it.  20 dollars for lettuce, a few radishes and scallions is precious beyond measure.  The encrusted halibut would have benefitted from the nuts being finer.  I asked to finish my meal at the bar because the 4 top could be heard over the jazz music playing on my ear buds.  The bar was zen and peaceful and the bartender was sweet, listened kindly, and set me up with hot tea and the most lackluster flavorless dessert on the planet. Overall, it was an experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTFVFd3hiVlppU0hZMlpVWkVRa2xuUkhjNWNrRRAB",
            "text": "Warm and welcoming staff from the moment I stepped through the front door. I sat at the bar for dinner for 1. Kevin and Marvin - both behind the bar - as well as Luis, the sommelier took excellent care of me.\n\nI appreciated the curation of wines by the glass. The food was superb as well. I enjoyed the Vitello Tonnato (a longtime favorite northern Italian dish) with a glass of the Sicilian grillo, followed by a perfectly prepared branzino with a lemon beurre blanc. The GM Bryan introduced himself and we chatted for a moment while I waited for my entree. The staff made me feel like an old friend. 10/10 I’d do it again. I’ll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqak0ybjdnRRAB",
            "text": "Wonderful dining experience last night. We had the duck ragu and porchetta, which were great. But the ricotta blossom (forget the name, it was a daily special) was amazing. Very nice place with great service. Everyone was on point. Great job Sempre! We will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEM0xhRldBEAE",
            "text": "Dinner opening weekend did not disappoint!  I followed Robert on insta months ago and impatiently awaited the opening of Sempre Oggi. When they finally opened the week of my husband’s birthday I felt like it was fate. My expectations were high and were met and exceeded.  Everything we tried on the limited menu was excellent.  The calamari was gluten free and fabulous! The carrots in hummus were miraculous.  The porchetta was crispy perfection. Cocktails were excellent.  Big fan of the Boulevardier. Service was impressive—especially since it was the first Saturday!  Wait staff anticipated needs.  No glitches!  Decor and vibe also incredible.  (Gio Ponti-esque… I want to steal the furniture. )"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNXzQwTC1raDd2UmRREAE",
            "text": "The food was spectacular! There were 10 of us celebrating our daughter’s dental school graduation. We ordered family style. Appetizers were delicious. Then the main courses arrived. We all were blown away. Every dish we tried was better than the another.  Fish, steak, veal - literally a piece of culinary art!! The service was outstanding. Thank you for helping us celebrate and enjoy time with the family."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeWIwODVRbVpPTTNWdU0zaE5USGhSVkdoNVprRRAB",
            "text": "Marvelous meal with professional, knowledgeable staff. From start to finish, a delight!  Seasonal menu offered!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paR09FODBXR2RMVmxaNGMyY3pTV1UxUVV4RGFYYxAB",
            "text": "Wanted to love this place but after four visits, I have to be honest about the consistent issues.\nI really wanted Sempre Oggi to work out. The concept sounds great and the reviews had me excited. Unfortunately, after giving them four separate chances over the past year, I keep running into the same problems.\nThe Food:\nThe dishes that arrive are often inconsistent. During our most recent visit over Fourth of July weekend, my salad was so cold it literally hurt my teeth to eat. It tasted like it had been sitting in the walk in cooler for way too long. The other dishes were similarly disappointing, lacking the flavor and care I expected based on their reputation.\nThe Service:\nThis has been the most frustrating part across all four visits. The staff seems perpetually distracted and overwhelmed. We had to remind our server multiple times about basic parts of our order. Water glasses sat empty, requests were forgotten, and the overall experience felt chaotic rather than professional. I understand restaurants can have off nights, but when this happens consistently, it suggests a deeper issue with training or management.\nThe Atmosphere:\nThe dining room itself is nice enough, but the constant service issues make it hard to relax and enjoy the meal.\nFinal Thoughts:\nI genuinely wanted to write a positive review for this place. The menu sounds promising and I know other people have had better experiences. But after four visits with consistent problems, I have to be honest about what I experienced. Maybe they were having staffing issues during my visits, or perhaps the kitchen was overwhelmed. Either way, for the price point and the expectations they set, the execution just isn’t there.\nI might consider trying again in the future if I hear things have improved, but for now I’d recommend looking elsewhere for your Italian dining needs in the area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSVEwWm5SbEJUYjNRMWJtOU9SQzFHTlhCV01sRRAB",
            "text": "My new favorite Italian restaurant! in NYC! Fill of amazing taste surprises.  I had the fusselli with Pistachio pesto- amazing - and friends had the lemon cappelinelli, and the rabbit pasta.  and the chocolate cheesecake with orange whipped cream is to die for. We will be back!\n\nThe service was great, and I loved the decor too.  Perfect place if you are going to the Beacon theater."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQVDY4WUxxaF8tOTBBRRAB",
            "text": "Amazing food, lovely atmosphere, attentive and friendly service, and exquisite experience overall. We went to Sempre Oggi for Mother’s Day brunch, and it could not have been better. The menu offered a good variety, and the play on American/Italian cuisine melded classics in the most harmonious way. We brought our 10-month old twins with us, and the staff were so friendly with them, making it a fun experience for everyone. They even brought out stalks of celery for them to chew on and play with. Sempre Oggi is easily one of NYC’s best gems.\n\nPS: the espresso martini and sweet pea cocktail were to DIE for\n\n-Jasmin"
        }
    ],
    "reviews_count": 82
}