{
    "name": "Haven",
    "place_id": "ChIJJUh2zMdZwokRwsVawXLRU3s",
    "grid": "MN7",
    "address": "226 W 79th St, New York, NY 10024, USA",
    "rating": 4.5,
    "user_ratings_total": 142,
    "phone_number": "(646) 609-1059",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SWFqWmpRVlZTTTFFelVGZDRWMDUwUjBKVFUzYxAB",
            "text": "We had such a lovely time here and were so well taken care of. Kind, thoughtful service and generous portions. The Miso Matzo Ball soup and chocolate babka are not to be missed!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kc1QzZ3hNa1paTlZOalFrVTRTVWhhZUdjNVNFRRAB",
            "text": "Good resturants make you feel welcome. Exceptional restaurants make you feel at home with warmth, great food, and a sense of gratitude. Haven. is an upper West Side gem.  The menu is eclectic, the food well prepared and the vibe is New York City.We celebrated our anniversary not just at Haven but with Haven"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdkx2c3J3RRAB",
            "text": "$20 Sheep's Meadow salad came, without mention, missing an ingredient; hardly any beets and sweet potatoes mixed in. $38 skirt steak came with a sliced portion of beef no more than 4oz, looking like the sad contents of a mediocre street burrito.\n\nTo the kitchen's credit (hence two instead of one star), they did prepare a new steak, but the plate arrived without its arugula salad. Service was generally polite, but could not be bothered to refill our glasses with the bottle of wine ordered. Never was asked about dessert when presented with the bill (which did comp the salad).\n\nGranted it's a six-month old restaurant, but this kind of half-assured execution isn't worth anyone's time and money."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adllYSkVWR00wUlRNMVJsUkJlRFkxV1Vjd1FsRRAB",
            "text": "Don’t go. Took 45 minutes to get a drink at an empty bar. They forgot to put vodka in the martini. Rather than tell them and wait 45 more minutes, we just paid and escaped."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeGJUQTJVVTlrYldvdFdsVTBWWFJHU2xodFpYYxAB",
            "text": "Went for brunch, they have an excellent bloody mary and the food was just as good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMGFWOXBXbXhGUW1sb2JqVkRRMjVXZGtSWFJWRRAB",
            "text": "What a gem. Brian and his team are incredibly professional and thoughtful; we had the best time.\nWhether you’re looking for a place to eat dinner or host an event, your wants and needs will be met and exceeded.\nWe had our after-wedding dinner at Haven and the entire planning process was a breeze.\n\nWe felt welcome, at home, and will 100% be back anytime we are in the city. Food- delicious.\nAmbiance- impeccable.\nService- what you can only hope for when you go out for a beautiful dinner.\nThank you Haven!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKV1puVnFTSEZHTnpBdFRHMWlWVnBvUlZWVGVrRRAB",
            "text": "Haven is a true gem of the Upper West Side. The inside is really beautiful, and is able to host quite a few guests.\nWe sat at the bar and had the pleasure of meeting Keith, an uber-talented bartender that makes the BEST creative cocktails. I ordered the Miss B Haven, which was both smooth and complex, offering flavors of spiciness, smokiness, and just a touch of sweet. He also made us his signature Lavender Haze (a lil bit of a secret menu item hehe), one of my fave drinks in NYC.\nWe got quite a few appetizers to try - French Onion Stuffed Mushrooms, Reuben Flatbread, Onion dip and chips, Bacon Wrapped Dates, and complementary hummus and veggies. Everything was good, but our clear favorites were the dates and flatbread, they were next level. Not pictured, we also got a pizookie with ice cream to take home - sooooo delicious 🤤\nLove coming back to Haven again and again, it’s definitely one of my faves in the city!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdGFqTlhZMTlPUVRONVFrSTBabEZtWDFwYWJXYxAB",
            "text": "Another nice place on the upper west side!  Went for wine and appetizers.   2 of the items on the happy hour menu were not avaliable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkT2JHcEhTV1kxUjIxWFNEZFdhWEpJVUVaR1UwRRAB",
            "text": "Everything was exceptional—the filet mignon, the Mediterranean sea bass, and the cocktails. Jorge (manager)provided outstanding service and thoughtful recommendations. We’ll definitely be back next week."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b2NFaGhWVEJFYTFadk1qaHVXVGxKYTBsaFVrRRAB",
            "text": "The food is original and inspired. It is beautifully presented and scrumptious to eat. We decided to share several smaller dishes (that are still very generous). Today, the standouts were the tuna crispy rice, the farro bowl and the 79th street corn. I love their beet salad too. The showstopper is Grandma's kugel! Yum! The owners are warm and engaging and they create the atmosphere for a lovely evening. So worth the visit!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSk9IbHpURWQzZERGUlpUZzBNMFJPYUVSaE9HYxAB",
            "text": "excellent food and really great service! the lamb rice was awesome! staff was friendly and the ambience was wonderful"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRd2RFVjFRMlZOY1ZaaU5saE1jRlZxU2tGQlMwRRAB",
            "text": "A pleasant bar-restaurant with a generous happy hour. The staff are very welcoming!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMlZYZzRVbmwxZUY4MWNFNUpaa0ZwU1VneVpHYxAB",
            "text": "Friendly, professional, and quick! Everything went better than expected."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNVdFRmZSazV5WlRoQ1ZrTmpRMEZyV1dkSGIxRRAB",
            "text": "Elegant setting with great food and drinks"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdk4xWkJkRjlMU1ZnNVQzQktPVVpLYm5BMWVuYxAB",
            "text": "S/O to Keith, aka the Knight of Haven, who made my friends and family's meal so special and unforgettable. Also, the man knows how to make a DRINK.\n\nYou can find great restaurants around the city, but I can guarantee they won't have a Keith <3"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbldsWndibFo1VVROMlEweE5PREpzY0hkWFZFRRAB",
            "text": "Had a lovely meal here - the owners are wonderful"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWVVWTjVOMkZsTjBoYU5XeERXVkl5TVVsd1dtYxAB",
            "text": "This place is amazing! They close the kitchen around 10 but when I walked in hungry the chef offered to make me dinner. Definitely made me want to come back! Super cute in the back too. Keith and Angel were so sweet and the tuna was great. Get the passion fruit drink and you can’t go wrong :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xneFFrOVdPRU16VGtOUmRqSkljSFExYUZOcExVRRAB",
            "text": "Great food and cocktails! Excellent service! Enjoyed the good greatly!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwYWNHMWhiWEp6WjA0NUxWTjJkWFZvZEc1ak5VRRAB",
            "text": "Food was good. Greenhouse room in rear is lovely.\nWe were there on a Wednesday night so were surprised at how loud it was, and how long it took for our food to come, though several tables were empty."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJXzFvWTMtaUk3bDlBRRAB",
            "text": "Awful"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNVQyaHJhV0pPZWxnd2R6bHJaM1JvV2tob2NWRRAB",
            "text": "Went tonight with a group of 7. Made a reservation on the phone this morning and we discussed a particular table where we would all be able to see and hear each other-I explained we were celebrating a graduation. I had a great convo with Keith the bartender. When we arrived, the table had been given to another party. It was the only large table available except a table in the back room where there was a private party of 30 12-year-old girls. You can imagine the scene.  Everyone else who was being seated in that room promptly left, but we were a big group at 6:30 on a Saturday night, with what we thought was a rez, so we stayed.  Rather than help me solve it—like maybe rearrange the tables in so no one was just alone on the end unable to hear themselves think-or even offer us a round or drinks or app on the house—the owner Brian said “well do you want to stay or not?” He offered nothing. I asked if the bartender i had spoken with was there-owner looked me right in the eye and said no, he’s not. 5 minutes later, the bartender himself walks over! And then he offered me, no other people at the table, a drink. It was so awkward. Finally I said fine thanks I’ll have a Hendricks and tonic. He brings me a Negroni instead!  The acoustics are awful. It was the most unrelaxing $600 meal and the owner was so arrogant. Not hospitable at all. They served my gin and tonics in glass mugs with handles, and the proportions were all off, and my friend’s old fashioned with tiny floating ice cubes! On to the food. Salty burgers according to the 2 people who ate them. Delicious onion soup mushrooms and tuna apps but expensive, small portions and not plated in an appetizing way  at all.  They were literally just put on the same small plates we had at the table. Seared tuna was delicious. Salmon was cooked how I asked, which was good. brussel sprouts were good but also a little salty. rest of the food unremarkable. Also, I’d requested a candle in the dessert for the person we were celebrating, but they had no idea about it. We made the best of it, but we’re looking forward to a wonderful night  catching up with friends and we had to shout just to be heard over the 30-person party. The owner should have closed that room to other diners. So unprofessional."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKX0h3ZEdRbWVIOGxRRRAB",
            "text": "The sweet potato gnocchi were to die for. The tuna appetizer was also delicious.   Music was outstanding in the bar area.   Overall great addition to the Upper West Side."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLR2UtWkR0bk5UX2ZREAE",
            "text": "Dinner was a hit from appetizers through dessert!  The service was on point.  We were so impressed with the menu.  What a unique fusion.  The salmon, gnocchi and steak frites were to die for.  We can’t wait to return and bring friends!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKLVJ6cjdIOTdqREJREAE",
            "text": "We had such a lovely and delicious meal.  Warm and welcoming staff and food that made it difficult to decide and very hard to stop eating!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJX1docGVmbzdYTFZBEAE",
            "text": "Haven was delightful. My husband and I went there for dinner after a show at the Beacon. The food was absolutely amazing and the service was great. We live in Brooklyn but we'll definitely be back again. Highly recommend for dinner. For appetizers we got the chicken lollipops and bao buns. My husband got the burger for his entrée and I got the seared salmon and we shared a side of brussel sprouts. We finished the night off with the sinfully delicious butterscotch risotto."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOamwxY3VQaU1UbnhnRRAB",
            "text": "After a night of laughs and lighthearted tomfoolery, my wife and I played Restaurant Roulette, and chose this cozy nook of a gastronomic experience tucked onto the corner of 79th and Broadway, a nice, brisk walk north of the Beacon Theater. The food was prepared with Love, Passion, and a general zeal for watching patrons enjoy a delicious meal that you've personally prepared. The service was Immaculate, the food, a culinary Rollercoaster, with twists, turns, inversion after sweet, delectable, inversion. The service and staff were warm, lighthearted, professional, and almost familial. The perfect blend of culinary adventure, without the stuck up pretentiousness of the area."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLNkpwS3VQbjVYQjN3RRAB",
            "text": "Spectacular food and service. We looked for a place to have a few families celebrate our children's graduation. Brian worked with us on the menu and pricing and even allowed us to rent the restaurant for 3 hours. The food was fabulous. The service, including Jacob and Oliver, was personal and respectful. Brian and his staff went out of their way to make our celebration special, to the point of printing a special menu with our children's school on it. Nice touch. Thank you, Brian and all. We will be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOcW9tTEd1NXRXWDNBRRAB",
            "text": "Exceptional in every way.  Delicious fresh food and craft cocktails. Portion sizes perfect.  Very attentive service.  Cozy atmosphere.  The owner/manager keeps a watchful eye on every table and detail.  We'll definitely be coming back.   Word of advice: make a reservation."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZLXREcXRRRRAB",
            "text": "went there with my gf. we both liked the food. portions are decent for the brunch today. 30 in total per person including a side biscuit. the backyard has a lot of light almost like a backyard with a window ceiling"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMG96SEJREAE",
            "text": "Just had dinner at Haven in the Upper West Side, and it was such a standout experience. The service was incredibly attentive, and every dish was thoughtfully prepared and full of surprises. Highlights for me were the French onion soup stuffed mushrooms, the seared tuna, and the mussels - each one was exceptional. If you’re looking for creative, well-executed dishes in a warm setting, I highly recommend checking this place out."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveTd1dExBEAE",
            "text": "Must try. Salmon was perfect with hearty rice and lovely green beans. Service was wonderful with the perfect amount of attentiveness."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMmM3T1F3EAE",
            "text": "Go to HAVEN! It’s a haven in a bustling neighborhood! What a great find! Three of us had dinner here last night and it was all delicious.— the cocktails, the apps, the mains, the desserts. All were fabulous. I was a little shocked that there were so many opened tables on a Friday night — so odd as everything was so well done. The staff is friendly and the spaces is welcoming and has wonderful ambiance."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcjlXVVB3EAE",
            "text": "Sadly disappointing…\nThe food is bland and poorly cooked. The salmon was dry with skin that was not crispy at all and the apricot glaze was really some weird splash of jam not making much sense while the supposedly wild rice ended up being half wild, half white with an unpleasant stench of some old fat. The burger felt as if it was made of defrosted patties from Costco - subpar even compared to Burger King.\nNot ordering again. Such a shame."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbFpic0dREAE",
            "text": "Great meal!  Brian is an amazing chef/owner and host.  Food was delicious .  Our server Tessa was polite and professional.  The back dining room is just special with the skylights. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMk9hQXlnRRAB",
            "text": "The food is so good it is very fancy the people that work here are very nice the food gets to your table so fast!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OTdXMF9BRRAB",
            "text": "Stopped by this spot recently for drinks and appetizers. The cocktails were good and the food didn’t disappoint either (had the mussels - delicious!). Definitely coming back to see what their brunch and dinner game is all about."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eGJya1hBEAE",
            "text": "Stopped by for happy hour before show at Beacon Theatre. Amazing cocktails, delicious apps, incredibly friendly bartender and host. Highly recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dU96ZVJREAE",
            "text": "One of the best nights of our lives started here. Keith is a master bartender (or a cocktail chef😍). He was incredibly knowledgeable, and because we're bartenders, we aren't easy to impress. On his recommendation, we started out with an anejo Sazerac, which will now be my signature drink if only any other bartender can accomplish the perfect balance Keith created. He took us on a cocktail journey where we tasted everything from old fashioneds to a classic French 75 (which Keith taught us is much tastier than the Americanized version) to a sweet strawberry gin drink that was better than candy to some amazing cocktail with lavender and egg whites. The other staff members were welcoming and very knowledgeable. The atmosphere was inviting and you feel cooler just being in the building. The perfect vibe. Really can't say enough good things here. We were so grateful for the experience and the extraordinary hospitality."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3a095YW1BRRAB",
            "text": "I wanted to like the restaurant but the food was really not great, everything was bland… be mindful the back room can be very noisy… cocktails were great. The barman was not super friendly but the waiter was. Unfortunately wont be go again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NEo2eFp3EAE",
            "text": "Attentive and friendly service. Food was delicious and always came out very hot. We got the tuna tartar, burger, gnocchi, babka sundae, and cookie skillet. The dining room has a green house feel with glass ceiling and hanging plants with a modern vibe. Will definitely come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbTVxa3pBRRAB",
            "text": "First came to dinner at Haven with friends about a month ago and everything from the food to the service was superb. Returned last night with my sister for my first post-baby cocktail at the bar and so glad I did. Keith Knight is a true artist in creating innovative and balanced cocktails. Highly recommend stopping by during happy hour to chat with Keith at the bar and have him make you a piece of art.\n\nCome for the food, service, and beautiful atmosphere, but stay for the cocktails. Love this spot and so excited to have Haven in the neighborhood!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBa3Fua2VREAE",
            "text": "Adorable place with really nice drink selection (and fun/creative bartender, Keith) and food is fantastic! Honestly surprised it isn't busier since it really is a gem."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNBa3NrZRAB",
            "text": "Keith makes a damn good cocktail - will be back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOWZ1cXV3RRAB",
            "text": "Super unique fusion! great food and amazing service!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNTZyX3B3RRAB",
            "text": "Ate at Haven for the first time last night and it was so delicious. As a table we ordered the sweet poe gnocchi, Rueben flatbread, street corn, one of the salads and a chicken plate. Everything was so so good. The inside of the restaurant was beautifully done. Quiet and well lit. Our server Jacob was such a sweetheart and the host made sure our entire experience was perfect. Highly recommend this place. We will be back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eU5pbmV3EAE",
            "text": "Hosted our engagement party at Haven in November 2024 — had an outstanding time. Brian worked with us to craft the menu, waitstaff was super attentive and food was great (per usual). We love Haven, a very welcome addition to the UWS. Definitely check it out!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cHNib0JnEAE",
            "text": "Haven was the perfect UWS spot for a casual dinner with friends. We started with cocktails, served by a knowledgeable and friendly bartender.For apps, we especially liked the chicken lollipops and unique mushrooms stuffed with onion soup. Our entrees ranged from steak to gnocchi. Portions are generous, and the food is tasty and not fussy. An indulgent chocolate babka sundae capped the evening. Go for the relaxed atmosphere, fun music, attentive service and good fun."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQc29TVUVREAE",
            "text": "Great food and service"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNua1l1WUNBEAE",
            "text": "Haven UWS is a delight. At the moment we walked in we received a friendly welcome and were seated right away.  The service continued to be excellent complemented by their excellent food and creative menu.\n\nDon’t give it a second thought, just go!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcmN5bTBBRRAB",
            "text": "Was in town for the weekend & went with some friends to Haven & had an amazing time! The food was phenomenal - a few of my favorites were the french onion soup mushrooms, noodle kuggle, chicken paillard with Brussel sprouts, sweet potato gnocci & the chocolate babka dessert was to die for so save room for dessert! Service was excellent & loved the atmosphere… will definitely be back next time I’m in NYC!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINGUySkpBEAE",
            "text": "The food here is delicious. We had the kale cesar, tuna crispy rice (I'm still thinking about it), gnocchi and fries. The service was excellent and friendly. It's also beautiful inside. This is an amazing edition to the neighborhood. If you're thinking about it, just go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMk9TNVd3EAE",
            "text": "Great restaurant. Cool fusion menu with a unique spin on dishes you’re most likely familiar with. Killer cocktails. Awesome atmosphere inside.\n\nSome great menu features are the General Tso’s Chicken Lollipops, Sweet Potato Gnocchi, Falafel Burgers, and BBQ Lasagna. If you’re a fan of kugel, get it here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6aVppZ01REAE",
            "text": "We had a wonderful experience at Haven. Our server, Karen, was absolutely fantastic. They were kind, attentive & quick.\n\nWe ordered smaller bites to share. We ordered the General Tso Lolipop chicken, Miso & Matzo ball soup, and split the Wild Mushroom Medley.\n\nEverything came out quickly. The food was amazing. The chicken was by far our favorite dish!\n\nJust overall, a great place for dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0bS03WHVRRRAB",
            "text": "Haven is a great addition to West 79th Street and to the UWS.\n\nFirst and foremost, the food is excellent. The owner, Brian Staub, was there to welcome us… and we felt there were extra touches along the way that made us truly feel like guests.\n\nMy cocktail - the Mezcal pineapple combo (It had a great name, too… but I cannot remember what it was called) was amazing.\n\nWe started with the complimentary white bean dip and veggies (yum!), chicken lollipops - yummy and juicy, ricotta toast - delish!  and Haven salad. All tasted perfect.\n\nNext, we had the burger (outstanding - and even more outstanding because it has an Orwasher’s bun😊)  and chicken paillard - a lighter choice that was also delicious. .\n\nWe were full… But how could we pass up the Babka dessert with vanilla ice cream?  It was quite possibly the best dessert I’ve had all year (& I’ve eaten a lot this month!). Just when we feel we were finished… they brought us outrageously, soft and warm, salted chocolate chip cookies that sealed the deal.\n\nCan’t wait to go back… And maybe Brian will morph the front room into a jazzy bar for later night hours…that would be cool."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd1phS2NnEAE",
            "text": "I am a die-hard Upper West Sider and there is nothing more welcome than a new and unique restaurant in our hood. While it has only been open a little over 2 weeks, I have eaten there a few times and it keeps getting better. The front windows are welcoming and you clearly get the vibe once you enter the space, which is filled with awesome music and friendly staff.  I ate a few times in the back room and once in the 6-top up front and was just as happy in either room.  I would consider myself a low key “foodie” so I was really intrigued with just about everything on the menu: favs so far are the french onion soup mushrooms, crispy rice with tuna and absolutely LOVED the italian salad – omg the dressing!!! God only knows what they put on the Haven burger, but it’s amazing!  (*My teens by far favored the burger but happily ate just about everything else we ordered too!) The skirt steak is topped with a magical chimichurri and the sliced tuna was just delicious.  I have never loved sweet potato anything but their sweet potato gnocchi is quite special which oozes with a yummy sauce.  One night I sat next to a couple who said Haven’s kugel was better than her own “Killer Kugel” and we ended up sharing kugel recipes which only added to the warm and cozy vibe of Haven.  I actually saw a lot of those conversations happen across tables. This place has a community feel that I haven’t felt in a neighborhood restaurant…maybe ever.  I ended up drinking Haven’s sauvignon blanc each time which was priced well and tasted delicious.  My husband is an avid beer drinker and has loved the Talea on tap. The wait staff has been super friendly and I am pretty sure a few know me by name, which is also something I have longed for living on the upper west for over 20 years.  While Haven is new and, as with any new restaurant, still working out some kinks, I am looking forward to many more meals there and many drinks at their very cool bar too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUMnNyVy1nRRAB",
            "text": "This place is a hidden gem. Nice atmosphere perfect for date night, and got great service from Julie and Brian.\n\nWe got the miso matzah ball soup, the burger, sweet potato gnocchi, and farro. Everything was delicious - highly recommend the gnocchi it was fantastic.\n\nFinished off the night with the warm chocolate babka with vanilla ice cream. We devoured it in 2 minutes it might have been the best food of the night.\n\nHas lots of vegetarian and/or kosher options, and an easy 2 minute walk from the 1 subway. Truly excellent we will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdDdPcGd3RRAB",
            "text": "I bounced into Haven on the recommendation of a friend and I was extremely impressed.  I most certainly will be back anytime I set foot into NYC.  First off, go to the bar and visit TJ and have him pour you the most amazing cocktails you have tasted.  Just let TJ decide what you are having after a brief conversation about your personal likes and dislikes and you are certain to receive a refreshing cocktail bursting with flavor and you will enjoy the company as well!   For dinner I started with the Kale Caesar salad.  The Kale was very earthy and fresh with a crisp bite that prepared my palate for the amazing dinner to come.\nFor the main course, I tried the Sweet Potato Gnocchi - Simply stunning is the only descriptor that comes to mind. Rich, creamy and full of flavor, each bite was a taste of heaven.   This is one of the best dishes you will eat this this year, if not ever.  For a side I had French Fries and the only thing that kept coming to my mind was that the fries at Haven are THE DEFINITION of French fries.  The fries were so hot, crispy, and covered in the perfect amount of salt.  Flavorful beyond belief, these fries will ruin french fries at every other restaurant.\nDo not miss this hidden gem.  The drinks, food and flavor are worth every moment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdl9pVUVREAE",
            "text": "Definitely a must try. Staff is wonderful. Services Is great and the drinks are spot on went with my newborn for a relaxing dinner with my wife we will be back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicm9YSzJnRRAB",
            "text": "Very disappointing!\nOur brunch reservation was 12:45 and we weren’t served our food until after 2pm (it was NOT crowded)\nThe restaurant was understaffed - only 1 waitress, who was also bartending. She’s the reason for 2 stars, not 1.\nWe ordered a side of bacon, $10, came with only 2 pieces.\nI don’t think the a/c was working, it was quite warm."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueF9lY3hBRRAB",
            "text": "Haven UWS is a fantastic spot! The ambiance is cozy yet modern, making it the perfect place for a high-end dining experience. The staff is incredibly friendly and goes above and beyond to make you feel welcome. The food is fresh and flavorful, going far beyond expectations– you can tell they care about quality. I also love the variety on the menu, offering something for everyone. Whether you're meeting friends or enjoying a special night out, Haven UWS never disappoints. Highly recommend checking it out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIemFUVEpnEAE",
            "text": "We couldn’t have asked for a better dining experience while in New York! We found the restaurant on a walk back to our hotel and we are glad we did. The space was so beautiful and cozy, but the food was unforgettable. We had the French Onion Mushrooms that I will forever dream about. I had the Braised Short Rib, it was also dreamy and melt in your mouth with so much flavor. My friend had the Sweet Potato Gnocchi, it was the perfect balance of sweet and savory. We finished the night with the chocolate Babka sundae, it was perfection! We had the whole restaurant to ourselves at 8 p.m. which was sad to see because our experience was so amazing. Definitely stop if you are in the area. It is so worth it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0M3FMaDhnRRAB",
            "text": "Excellent dinner at Haven UWS! From being warmly met at the entrance, to a friendly chat with the bartender at the chic bar, to the most incredible meal - an amazing experience! My skirt steak was so good and my Husband loved their pork belly & scallops special of the day! The ricotta toast app - beyond delish! Haven was lively, but never too loud. Def make a reservation - every table was full! It was a perfect location for us as we walked over to see Seinfeld at The Beacon Theater right after! A perfect date night!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOF91cWF3EAE",
            "text": "I really want to like this place, but both times I have been the service has been inordinately slow. My spouse and I went to dinner there last night before a show and it took more than 50 minutes for them to get an appetizer out, which ended up arriving after our sides and entrees. Somehow larger tables next to us received appetizers within ~15-20 minutes of ordering them. I would love to see this place thrive as it has a great aesthetic and creative menu, but the service leaves much to be desired."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxb2EzVkRnEAE",
            "text": "Brought my family of five following a visit to the museum of natural history. We were greeted warmly by the owner Brian who sat us at the perfect table. We enjoyed some great appetizers, the bacon wrapped chop was to die for and the tuna on rice cracker was succulent. The meal just kept getting better. We tried the chicken, burger, steak and tuna entree along with the noodle kuggle as a side dish. We finished the meal with an amazing Bobka and chocolate cookies.\nVery impressed for a new restaurant to deliver so on point. Can’t wait to return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNic0lyU0Z3EAE",
            "text": "Haven was amazing!  Attentive service and delicious food. Highlights were the tuna crispy rice and the ricotta toast appetizers, the skirt steak and the everything tuna entrees, and the noodle kugel side dish!  Definitely go try this neighborhood gem!"
        }
    ],
    "reviews_count": 65
}