{
    "name": "Prohibition",
    "place_id": "ChIJSc_3GIVYwokRh6OzVnCnh6g",
    "grid": "MN7",
    "address": "503 Columbus Ave, New York, NY 10024, USA",
    "rating": 4.5,
    "user_ratings_total": 994,
    "phone_number": "(212) 579-3100",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbVgzUnZPRGhsUlY4NGIwbHRlWEF6VVVad1ZtYxAB",
            "text": "Went to watch a band. The band was great and the crowd was totally into it. Fun spot for music!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Q01raHJSUzFrUW01eGNHdHRVemR5VW0welIzYxAB",
            "text": "Hosted my husband's NYC marathon party here - staff was wonderful, location/atmosphere was great, and the food/drinks were enjoyed by all! Would highly recommend hosting an event here and coordinating through Natalie - she was responsive, professional, personable and just lovely all around!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTlNrOTVlbGhDWHprMFpERkRPRlZpU1dWQ2MxRRAB",
            "text": "I had my birthday party at Prohibition with about ~30 people and it was great! It was in the back speakeasy room where we had direct access to the bar. The atmosphere, drinks and food were good. Everyone had a great time. Natalie, Miranda and the bartender were very accommodating and friendly. The minimum was comparative to other bars I checked in the area. I would host another event at Prohibition."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUWJFeHFaSEpMZUVOT1FVdEtaMHBEVFZKMFoxRRAB",
            "text": "You always leave prohibition with a smile as everyone who works there is beyond wonderful."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1emVrOVBURk5vUjNscExWRnFXVkJ6YUhCRE1XYxAB",
            "text": "If you know, you know. Our go to spot to bring guests from out of town. Never fails us. Friendly service,  great food, amazing drink selection and top notch music. EVERY time we go we have more fun than the last time. Everyone just sings along and has a blast. Prohibition is the best place on the UWS!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUFEzRjBUalZqYm1Oa2FIUm5jWHBRUVZWT1UwRRAB",
            "text": "We came here for a friend’s birthday and it was so much fun! The drinks were great and so were the apps - the staff was super friendly and we loved the live music. The main area definitely got crowded but very fun Saturday vibes. Would definitely come back (and thank you to our amazing bartender!!)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nemVtOUVUMGQwYmxCVE5IbDJaM0pVTkRac2IyYxAB",
            "text": "We went for a retirement party and the service was excellent as was the food. The open bar kept the bartender busy, but there was never much of a wait. Various, delicious, freshly prepared foods were brought out and were quickly consumed. Many were vegetarian and seafood.\nWe had our own secluded area, while.a.live band played in the main restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYWFraEtkWFZsYjAxU2RrbE5iMWxIY21kRVYwRRAB",
            "text": "Great food, music & drinks!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbGJIazBUV0V4ZFVGTmFIVnhPRlZSVFd4Qk4yYxAB",
            "text": "My wife and I had our wedding celebration party at the speak easy bar of prohibition! Such a honor being chosen this place, everything from A to Z (food, service, hosting, drink, music, atmosphere) was excellent 10/10. Natalie Colton took a great care of us. They welcomed us with a big congratulations greeting and did this important moment of our life unforgettable. I have no world to thankful enough. Excellent job and thank you again for hosting us, see you soon!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paemFITnBUMlpQUzNsdFFYRk9SRU4wZFc5S2NsRRAB",
            "text": "Great food , great service, great atmosphere, great live music. The perfect place to be"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUVYwOXhVRTFrVjJ0a1EwTTJPWGRMWVY5TmNtYxAB",
            "text": "I was there for one drink and some live music.  The drink was good, just a little expensive. The music was great. My service was excelent, very friendly and free water. There where mainly male employes the where all really friendly. The only female waitress looked a little anoyed. She didnt even attended me but still gave some bad wibes. Still a solid 4/5 would come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWWRYVlljRXczZEhoc1oxSnZhbWxJVVV0d1RsRRAB",
            "text": "Went for happy hour on Friday, our server walked around and literally past us a few times without asking if we needed another round. I also saw him just talking with the host and also walking outside of the bar lol. Definitely wouldn’t be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205YVRVaHhMVzVDUVhGT1kwaEtWbEpHVWxNNVgzYxAB",
            "text": "Styling locale with live music. The food is priced a little above average for the neighborhood, but is served very well presented. The cocktails were very good. The venue gave us problems because my wife and wanted to share one of the prix-fixe menu options as we had eaten before joining our party. Everything was \"good\" but maybe not standout enough for the price they're  asking. The live band was really good. We had a burger, salmon, steak, and the poke. Not the server's fault they needed to implement the 'chef's decree' that plates not be shared, but I'm not seeing how this would have hurt their bottom line when we were dropping over $100 per person anyway. Their cheesecake dessert was a little heavy. Didn't try the salmon but our friends left some behind. Make of that what you will. Would rate higher if not the nonsense with the splitting."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWVozbDROMGc1VldabWIyRkhTRGd0TVhWMFFtYxAB",
            "text": "Live music on Fridays!! Great venue, saw The Sonic Bullet and had the best time! Scotsman bartender with a fiery red beard was also a great vibe"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCV09GSldZVTF5VDFSb05ubEtUSGhxUXpsdldrRRAB",
            "text": "I had my 30th birthday here and cannot wait to host again! Natalie and the bartenders took great care of our group of 18! Josephine’s corner was the perfect spot for our group. Trailer and hitch band was phenomenal!! We had small bites throughout the night and they were all sooo good. My friends have not stopped talking about how fun and amazing this party was! All thanks to prohibitions"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMmRYRjVjVFJYVHpsNVlYSk5PRmhmZDFGbmVrRRAB",
            "text": "The vibe is mesmerizing ❤️💯✅✅my go to every time I visit NC. You must go, highly recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Q2VWaE5SV1ZzWXpsdE5VZE1VeTFaVmt0MGIzYxAB",
            "text": "I rented Josephine’s corner out for a birthday party and it was incredible. The staff, service, live band, drinks, and food were all fantastic. I highly recommend prohibition for a private event!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxb1dqZFZhVFZPTTJkVGRHczBPVVZqVUhaTmRrRRAB",
            "text": "I held my husband’s 49th birthday party here on a Saturday afternoon in the Bonnie & Clyde room and everyone had a wonderful time! Natalie is a dream host to work with - expedient, smart and so personable, esp when serving food to our friends. Gabe was fabulous behind the bar.  Everyone loved the food and cocktails (couldn’t stop talking about the cheeseburger sliders/ wishing they were on the regular menu!). Highly recommend for a very special event. There were 23 of us and there was plenty of room for everyone to sit and/ or mingle. Even at 30 people it would still feel spacious. Thank you, Prohibition team (Tyler and Miranda too)!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaVpXUnZWbFJITWw5WGRuQnRielJRYzNkTGRGRRAB",
            "text": "The drinks and service here are top tier. My friends and I enjoyed each drink we ordered and my pisco sour was great. They also have live music nights which adds to the good time. The steak I had was flavorful, but the green beans and carrots could have had a bit more seasoning. Overall would recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa1MxRlBVbVZJV2taWGNWaDRTWEUwUWxWaVMxRRAB",
            "text": "This place is a gem! We were lucky to have both Ava and Reece take care of us last night and both were attentive, fun and had great conversation. We were very well taken care of. The door guy, or should I saw gentleman was attentive to all patrons and made sure that everyone was both safe and taken care of. The band last night was cover boy and good lawd, they brought the house down. It was an amazing night and the next time we are in NyC we will be sure to visit this amazing place again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRVkzWlNhRlY0U21WSFFrbGtUVFkyZGtVMFdsRRAB",
            "text": "Interesting on YouTube."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa1JucElWMmhDUVVGMk0xWnVRbXRuZHpNeGFFRRAB",
            "text": "I have had not one, but two events at Prohibition this summer. Each time, the staff was unbelievably professional, drinks were delicious, as was the food. Natalie is highly professional, organized, and timely - she helped our events go perfectly. Highly recommend going to Prohibition and hosting an event there!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUVNXNUlhbWxzWkVOZldsZHNjMWt6UTBOeE9WRRAB",
            "text": "Saw the band Copy Copy perform here. It was a blast! Drinks were good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MGVXTk5lREZxVm05cE1reFhTVU5oT1hZM1RXYxAB",
            "text": "Extravagant cocktails, friendly staff, and fun live music! Wish their kitchen was open later on Sundays but a great time out nonetheless!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMGVXbGtNbFpOYmkxYU5raExTVEV0WmpGeGMyYxAB",
            "text": "Good hang outs!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdlIwUnlTVkZYTlRGME5ucDJVazR6VDNKYVpFRRAB",
            "text": "Yesterday I had one of my best experiences in NYC in this amazing restaurant-bar with very good friends R. and A.. Everything was perfect: venue (take a look at the back room), food, service and above all excellent band! Will be there every single week 😉"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaGFUZ3lka3B0VmxnMVkwWlliVEpZY0Y5elgxRRAB",
            "text": "My sister and I had a private event on Memorial Day Saturday to honor our father. We could not have been treated better, had our hands held tighter, or had a better experience. It was a beautiful send off for my dad with great food & drink, access to their AV system, and extremely attentive and warm service. Could not recommend this place more for a private event or to listen to music and have a drink. Many thanks to Prohibition for a seamless and bittersweet day!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNWFEVTNOeTFRVEdScGEwTndOMmxpYzAxcGJuYxAB",
            "text": "Prohibition, a supper club with Jazz Age-themed decor, is a great bar located on Columbus Avenue on the Upper West Side of New York City!! I recently visited for the first time with my boyfriend + a friend of ours who was visiting the city, and we had a great experience here. :-) Shout-out to Ryan, who took great care of us behind the bar!! Prohibition's Mickey Finn Margarita is absolutely delicious - I highly recommend trying it. The atmosphere inside of Prohibition is comfortable & cozy, and I'm looking forward to trying some of their food items when I return for a visit in the future (as their kitchen was closed during our recent visit)!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UlR6ZFZXR2t3TkVOVGQzVm5kbUk1TVd0Q1dVRRAB",
            "text": "The worst!  They waited 10 MINUTES before our party of 8 arrived to celebrate a birthday to advise that they could only serve bar food!!!  Sandra claimed that the chef was so busy with a private party that they didn't make other food!?!?  We don't eat bar food!  What establishment waits until 10 minutes before your customers arrive to advise of a problem - especially if there is no food!?!?  Who does that????  NO CLASS"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKZWQ3Wm1vajh5Y293RRAB",
            "text": "Great vibes"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeWExRmFkWEF4VkRGT1Z6UmxiMGh4ZDFaelRGRRAB",
            "text": "I would give this more than five stars if it was an option! We had a group of 12 of us from all over the United States, looking for a fun place to have dinner and drinks for our last night out together. Getting a reservation booked in the morning was so easy and they were so nice throughout that process.\nNext, we were a few minutes late for our reservation because of delayed trains. Not only where we still seated, But we were welcomed with excitement and enthusiasm like they knew us already!\nAs if the greeting wasn’t warm enough, with only 15 minutes left to go in happy hour they sat us and took all of our orders and got everything out as fast as possible so we could fully get the most out of happy hour pricing.\nThen, the live music began, and it was the perfect ambience! Everyone was so patient with our large group, made it so easy for us to figure out the bill and invited us to come back next time we are all together.\nSome of the tastiest and smoothest drinks, with the coolest names and presentation. Definitely get the salted pretzel and pretty much everything else as well. Needless to say, Prohibition didn’t just give us a place to eat on our last night, they provided us with a memorable experience that we will all remember for years to come!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLT3hpdlNZdlpfMXlBRRAB",
            "text": "We hosted my Father's Celebration of Life at Prohibition a few weeks ago, and I cannot speak highly enough about the whole experience. My initial inquiry was  responded to within two hours, on a Sunday, and that evening I had a proposal. I worked with Natalie on the details, and there was constant, and almost instant  communication. Thoughtful suggestions were made on things that could add to the celebration. Cut to day of, PERFECT! It is hard to say a funeral is fun, but it was, and everyone felt it. The food was lovely, the staff was AMAZING, ambiance is great. This is a wonderful place to have a party of any sort."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcmYwTkQ5NWZHQmhnRRAB",
            "text": "Place to go to for a nice chat when there is no live music and to listen to the music during performance (but then it’s hard to talk)! Good atmosphere, we had a student hang out night there and all went well. Some students didn’t drink alcohol so variety of mocktails was a plus."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLU1hscy01dVBpZEVBEAE",
            "text": "I celebrated my birthday here with 20 people. The staff helped me to organize everything in advance. They were on top of everything, thinking of every little detail. The service that day was amazing, food and drinks were delicious. If you want to have an amazing night to celebrate with a large group, don’t think about it twice and go to prohibition."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLNkZoTjNOek5LeF9nRRAB",
            "text": "Probably top 3 fries I've ever had. Really nice wait staff as well"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM2Ytajh3RRAB",
            "text": "Celebrated my husband’s 30th birthday party with 25 friends and had the BEST night! Natalie was so helpful in helping us organize the evening, the wait staff was beyond attentive and made sure we were taken care of constantly, and most…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdzZ6cTJBRRAB",
            "text": "We recently hosted our engagement party at Prohibition, and I cannot say enough good things about the entire experience! From the start, the manager and staff were so accommodating and helped with every detail to ensure the event went off without a hitch. The food was absolutely outstanding—our guests are still raving about it! Every dish was delicious and perfectly presented.\n\nThe staff at Prohibition went above and beyond, offering impeccable service with a personal touch that made us feel like we were the only ones there. Their attention to detail and seamless execution truly made the event stress-free and memorable for us.\n\nWe are so grateful to everyone at Prohibition, especially Natalie, for making our special day even more amazing. Highly recommend this venue for any special occasion!"
        },
        {
            "date": "6달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNDd2QVB3EAE",
            "text": "Obsługa bardzo miła jedzonko pyszne.\nNiby mała i klubowa ale  późne śniadanko...\nBARDZO POLECAM"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNHNQdjRBRRAB",
            "text": "A Magical Monday Night at Prohibition 🎶🍸\n\nLast night, I had the pleasure of attending a Monday mini concert at Prohibition, a charming bar and restaurant with a historic New York vibe, nestled in the beautiful Upper West Side neighborhood. I came to see one of my favorite Red Note singers, Lin Hao, and the entire experience was absolutely delightful!\n\n✨ The ambiance was warm and intimate, with live music filling the room and setting the perfect mood. The service was exceptional — well-dressed staff moved gracefully through the crowd offering gorgeous trays of delicious bites, making everyone feel cared for.\n\n🍺 I ordered the Five Boroughs IPA, an excellent draft beer — crisp, flavorful, and a must-try. The cocktails looked amazing too — beautifully presented and clearly made with care.\n\n😋 As for the food, everything was spot-on: juicy cheeseburgers, crispy dumpling-like bites, skewers of burrata and cherry tomatoes, bacon steak, cheesesteak bites, and perfectly seasoned guacamole with chips. Every dish was full of flavor and beautifully presented.\n\nProhibition offers the full package — live music, great drinks, delicious small plates, and an inviting atmosphere in one of NYC’s most charming neighborhoods. Huge thanks to Lin Hao for the fantastic performance and for bringing us all together. Can’t wait to come back again!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aUlHeml3RRAB",
            "text": "Great vibes & drinks.  Great service from Sabina"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ci1IX2dnRRAB",
            "text": "Overpriced drinks, bad service, and THE WORST live music."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcjlXblZ3EAE",
            "text": "The half chicken main, the lamb chop appetizer and the bacon roll were memorable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbDdXMm13RRAB",
            "text": "We had such a great night - incredible live music and great service! Thank you!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcmZMMlZnEAE",
            "text": "i cannot give enough love to Sarah our server!!! Miranda is also AMAZING such a fun vibe for music and good service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMVpQMUd3EAE",
            "text": "Enjoyed a great night of music, food, and drinks on Saturday. Sarah and Kayly took care of us and made a quite busy night look easy!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRLXNLTTh3RRAB",
            "text": "Made a reservation here with a big group for a birthday party on a Saturday night. Our event coordinator, Kayly, was very accommodating, a great communicator, answered all of our questions, and is an absolute sweetheart. :) The place was packed for the band, but our server Sarah was attentive, fast, fun, and just overall amazing! Food was great, drinks were great, band was great."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRc0w3bTBRRRAB",
            "text": "Had such a great night out here for a friend’s birthday! The music (90’s covers) was a lot of fun, but the staff really made the night for our small group. From Amir and Kathleen holding down the fort up front, and Gracie, Ryan, and Sebastian keeping our drinks and bellies full (the food is delicious!), to Miranda and David making us feel so welcome - I really can’t say enough about how well this place is run!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNThpa2FBEAE",
            "text": "Great space! I was at a party there and the food was great"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNlpYZ2JnEAE",
            "text": "Absolutely great time at their monthly speakeasy party...the music, cocktail, and atmosphere were all SO good.  And bravo to the bartender...aside from being great a great guy, the smoke dome he was creating over the mezcal cocktail was incredible..."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRck1idUhnEAE",
            "text": "I booked a table for 6 people for my wife’s birthday. Our hostess, Heather, was extremely hostile and rude towards us from the beginning. She had an attitude when we were giving order. We asked for a bottle of champagne and she brought a glass instead which isn’t a big deal. When I told her we wanted a bottle, she snapped at me very rudely and blamed me that I said glass at first. The whole night, she tended to our table visibly unwillingly and made us feel extremely unwelcome.\n\nWhen we reported her behavior to the manager, he also seemed to not take us seriously, and when I complained to him that it was a very unpleasant experience, he arrogantly and offhandedly told me that I made it unpleasant for myself. He avoided responsibility for his staff at all costs and was extremely emotional and amateur. At the end of our discussion, he told me to never come back again. I wonder if he was the owner or not, but I strongly recommend avoiding this place unless you’re going for a drink and live music. I have never experienced such hostility for no reason in my life, especially when we were celebrating a birthday!\n\nIt is a shame that we had such a horrible experience there because it is a beautiful venue with excellent food and the performers were very very talented."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdjQtZG1RRRAB",
            "text": "It's a very cute and intimate spot, it's also great for small groups. We really enjoyed the live band! The service was great considering how busy they were. The food and drinks were  good. We had the gnocchi and the cheese steak egg roll. I would definitely go back again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfb1p2WUl3EAE",
            "text": "Our experience throwing our baby shower/ baby party at Prohibition was nothing less than exceptional. Both of us working in the hospitality industry most of our lives, we both have incredibly high standards of service and the Prohibition team not only met them but went above and beyond to make sure our day was special and went off without a hitch. Kayly the party manager was great to work with I emailed her a ton with my vision and wants and needs food wise etc and not only did she execute with her team, everything looked and tasted perfect. From the moment my guests walked in with the staff coat checking to every bartender interaction people felt warm and welcomed and it was so nice. I feel like this event space is a hidden GEM of the upper west side amazing for any event because they transformed the place just for us. I could not recommend this venue more highly if I tried and like I said we are New York Hospitality vets who are hard to please. Truly thank you so much for making our day as beautiful and seamless as it was and can't wait to host something else here.\nAlex & Josh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dWRDelpBEAE",
            "text": "As the name suggests, this bar-restaurant is modeled after a 1920’s prohibition era speakeasy, with an actual speakeasy. So nice for a refreshing Sunday evening drink. Also got so see great love performance by musician Arthur Latin and Tommy.\n\nNestled in the back is also a cozy speakeasy- didn’t get to go inside but seems really nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcmZPOFR3EAE",
            "text": "We came here specifically for jazz music but were disappointed.. It was super noisy and acoustic was not good. I'd say the singer was not great either.\n\nFood and drinks were good.   Good place if you want to hangout as it's near the central park"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwa2RtU3ZBRRAB",
            "text": "Wonderful evening out. Our server Brian was a hoot!! He was very attentive and made fantastic and delicious recommendations. All the other wait staff were wonderful too - sadly I didn't get everyone's names.\nThe ambiance was so fun - they had some memorabilia on the walls and a hidden door for the \"speakeasy\"!\nThe music was a delight - we caught the tail end of one set and then we got to see the full following set - Harmony with Hunter. He did some cover songs but he also treated us to some original pieces which were outstanding - so much so that we asked for more!\nWe were lucky enough to be there during restaurant week so 2 of us tried the set menu and were not at all disappointed.  The tuna appetizer was mouth watering as was everything else. We stayed for a long time and everyone was gracious and kind and did not make us feel that we had to hurry up and leave (that being said, it may be different on a weekend night when the place is more packed) . In any event, it was a lovely experience and the live music was great fun. Would definitely go again.\nOf course, being on the uws, please don't expect easy parking - if you're willing to go around a bit you will probably find. Its better to Uber anyway especially if you want their specialty cocktails which 2 in our party thoroughly enjoyed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM3JyVEJ3EAE",
            "text": "Good vibe and entertainment but dont waste your money eating here. We wanted to catch the early live music on Friday so arrived around 7 and they let us in without a reservation.. either on the side or out at the back at the speakeasy. We…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNObDZtVTVBRRAB",
            "text": "Great place to eat AND enjoy live music. Food is okay, but the music is better. Would not come back for just the food :( Hostesses are all nice and friendly, servers were very stiff like it was everyone’s first time working at a restaurant.\n\nWe got the NYC restaurant week, generous amount of salad, not homemade pasta and the shrimp was bit fishy :( Homemade brownie was cold and crunchy which was a big disappointment. The band was nice, they took requests and played for a long time before a break. Might go back for a drink and the music, but probably skip the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsOFpuZXhnRRAB",
            "text": "I loved this place! The location has a front bar with a stage, some VIP tables stage-side and a semi-hidden accessible and cozy speak-easy-like bar in the back which the manager graciously showed me. The food was higher-end bar food+ including multiple appetizers and main dishes like steak, rib options, salads, burgers, etc. The cocktails were delicious, I especially recommend the frozen Cosmo and our main focal point for service was Emma and she was excellent. She was so friendly and on top of the service and our needs and that made a huge difference in our experience.The band was great and everyone had great energy and sang along the many classics of the 80s/90s and beyond. If you want a fun night in the UWS then go visit. For more insider tips visit @Ohmtina ✨"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaGE3c1N3EAE",
            "text": "Brilliant place.\nGreat atmosphere.\nAmazing service.\nYummy cocktails!\nSalads and fresh fish quite delicious.\nLive music. Most quite good.\nJust so much FUN and enjoyment!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYc2Fldmd3RRAB",
            "text": "Great steak and truffle fries. The drink selection was also very nice. We loved the live music and cozy vibes, overall I definitely feel like reccomending this place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCeTYtRlV3EAE",
            "text": "The live music hit so well. Both artist killed it. It really made the Restaurant Week dinner hit so well. The sauce that comes with the chicken skewers was delicious!! We ordered a side of it. The Tuna Poke Crisp was delectable. There's a speakeasy in the back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIaXBDWHp3RRAB",
            "text": "Great place for live music, food and drinks! A nice selection of crafted cocktails. Tonight the music was fantastic!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOVBfU01REAE",
            "text": "Prohibition was absolutely fabulous tonight.  The hostess was quick and helpful even with a larger party including kids.  The live music was great.   The drinks were tasty.   Ryan’s service was wonderful and his recommendations were we re delicious.   The bacon steak was great.  The pork shank was incredible.  The burger and fries were tasty as was the salmon.  Even when the Halibut wasn’t quite right, the server and management jumped right in and made things right.  We will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMGFTVjRRRRAB",
            "text": "The most important and impressive quality of this establishment is the staff. Our server, Lacy, was welcoming, attentive, friendly, and knowledgeable. The ambience was incredible, only to be topped by the food. I was blessed with the best chicken I've ever had. We also got two free shots! It was a great experience and I'll surely be back soon."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneWJtbXZ3RRAB",
            "text": "I love this place ! I had a really great night here with my partner. We have a reservation for 11:00, the staff was super accommodating and took us in early and even sat us down at a table so we can enjoy the band a little earlier. It was cold outside and the front door guy was so nice and let us wait inside. This place is always a fun night , great bands , staff, and atmosphere! Definitely check it out , I know we will definitely be back. Great spot for a fun chill evening, thank you !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoX1pqQmp3RRAB",
            "text": "Speakeasy vibe in upper west side.\nMade reservation to attend live music and cocktails.\nThe venue is spacious with plenty seating options including patio and bar area. The speakeasy bar is at the back in a separate section.\nBartender was friendly and super fast service.\nHighly recommend to check it out if you are on the neighborhood.\nPS: Mamoun Falafel is across the street 😉"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMmZPc25nRRAB",
            "text": "Nice spot for dinner, drinks and live music. It definitely gets busy and the staff is very busy running around. Drinks are nicely crafted. I tried the burger recently and it was very tasty! It was a little greasy for my liking but otherwise…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaZ2M3OGd3RRAB",
            "text": "Fantastic spot to stop for a cocktail or five! We missed the live music but great set up for it, will definitely be back. Great cocktail menu, bartender was so great, very genuine chill fun knowledgeable. 5 stars all around"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtd2N5V1pBEAE",
            "text": "My boyfriend and I had a great night at Prohibition! Service, food, drinks, entertainment were all 5 stars! Ryan was an amazing waiter and my good friend, David went above and beyond to make sure we had a great night. Thank you both!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1ME9mNXRRRRAB",
            "text": "Visited for the first time Saturday night to see Andy Mac perform. The food was delicious and the drinks yummy! Our server, Sarah, was so friendly and accommodating that I'll definitely be back. The wheelchair-accessible bathroom was a little hard to get to, but was a decent size."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMFk2bkR3EAE",
            "text": "Service and drinks were amazing.  The live band was fierce.  I’m definitely going back again and will tell all my friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIajZERzF3RRAB",
            "text": "Amazing place to have a fabulous milestone birthday! Service was excellent. Kayle was lovely and of course the band had us on the FLOOR!"
        }
    ],
    "reviews_count": 72
}