{
    "name": "French Roast",
    "place_id": "ChIJ2V6HH4RYwokRb0PY09qwtJA",
    "grid": "MN7",
    "address": "2340 Broadway, New York, NY 10024, USA",
    "rating": 4.7,
    "user_ratings_total": 3488,
    "phone_number": "(212) 799-1533",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V1psOXVNelJ4T0hveE0xQkJRbFprWVRSUE0yYxAB",
            "text": "Great food and great service — our server, Lena was very sweet and made great recommendations!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaWRIZHhhVGhtWjFwdVJsbzViVXBLVG01VGJVRRAB",
            "text": "Great neighborhood spot, good vibes, food, coffee, and great service from Lena. And nice to get a free dessert on a bday. We’ll keep coming back"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRmRUVmZWa2xJYUc1MVNIQlVielZETVhoSFFsRRAB",
            "text": "Great cosy brunch spot"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMFFsWm5ZbUZITjBJNWRGaERiRnBFY0VFdGJWRRAB",
            "text": "Lena was a great server, and French Roast has long been one of my favorite spots in NYC."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVlVWRmxMV3N5VkVGV2VFTlFTMkl6TFhaMFgzYxAB",
            "text": "Juan is an excellent bartender! He always makes us feel special and known! It’s a great feeling."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMlZHZHRNWEJmU1U5dGIxWktVSGx1Y1VKMlFrRRAB",
            "text": "Great place with a nice selection of French Food. The Boeuf Bourguignon was delicious. But that's the only French thing about the place. I was amazed to have Mexican soccer on TV 🤣🤣🤣"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdVdIbHJSbXBmZG5SWllWZHRSbEZ2YlhaRVNtYxAB",
            "text": "It feels time stopped in this place - not in a good way unfortunately… The food is dated and of some inferior canteen quality. The steak was acceptable - not terrible but nothing special either. I believe a home cook can make something equally good at home quite easily. The Black Sea Bass was quite poor - bland and dryish with noticeable smell of whatever box it was stored in. The accompanying roasted carrots were covered in what resembled some low quality oil and the cauliflower puree had texture of baby food (at least it wasn’t bland like the fish). The addition of lobster reduction was puzzling and did not make sense (maybe to unnecessarily bump up the price of the dish).\nThere are many much better options on Upper West Side - many just a stone throw away.\nThe service was quick and very friendly though; however the atmosphere is rather depressing and feels even more dated (in a bad way) than the food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWblNHbHlTSGRpUWtoWVdqUTVOemR6YVdSNlRuYxAB",
            "text": "We had sliders and mussels before a Lincoln Center concert and were delighted by the food and service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200elV6TnRZVUoyTlRrM1NXRkNNVWRWUkVGV1pWRRAB",
            "text": "We were there for happy hour and had delicious food served with care and grace."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2clphNXZRRRAB",
            "text": "Juan is the best bartender!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWk9GVnJabGhFWmpWdU1GbHlNemx0VHpKaGVIYxAB",
            "text": "4.4/5 rounded down. We are eating smaller portions so thought the Happy Hour menu was perfect for us. We got moules mariniere (mussels in wine sauce), pommes farcies (potato skins), chicken liver pate and truffle fries. All good and well proportion & for $8 each. Complementary delicious bread served with our food. Discounted beer and wine. Atmosphere is lively without being too noisy. Outdoor seating. June 2025"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaekxXeGZZblp4WW1WR05XVktTR2RoUmxGcU5VRRAB",
            "text": "David was our server. He has waited on us before. Very attentive, patient, and knows the menu offerings very well. A pleasure to interact with."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SZlpUazFZbkZwVm5kTWJuSTRjVmRDTUZKSU4yYxAB",
            "text": "The food was delicious and fresh! Good size portions as well! Our waiter Adam was really nice and attentive! Nice and calm atmosphere."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNVdGRmlNVlYyTVY5RE0xbDFPV0UxZWpJMk0xRRAB",
            "text": "Came here for the first time today and truly enjoyed my experience. The food was fresh and delicious and the environment was warm and welcoming. I was served by waitress Lena, who was very friendly and attentive."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeTlpQlR3EAE",
            "text": "I have been frequenting French Roast for the past few months.  The food is great and the service is very good.  Darwin, one of the servers is excellent, is extremely welcoming and personable!  I definitely recommend this place to UWS locals and anyone else strolling in the neighborhood!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WeldETjBkQzFIVDI5bVdXUnpWVWRTU201TWMxRRAB",
            "text": "Our server Nelson is the best!  Very accommodating.  Our burger was cooked perfectly.  So juicy!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNVFtUmtOM2c0U0dsM2MweERhamd5WDB0dVEzYxAB",
            "text": "what a lovely time here. great food, drinks, service and seating. betsy was our waitress, she was very sweet and made sure we were well taken care of. would come back in a heartbeat. until next time"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OT1oycFljbHAxYkdWRFdYRkZiMVZWTjJORFlrRRAB",
            "text": "Loved being here with my young hip friends!!!"
        },
        {
            "date": "4주 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVGRXMWFiRzlhTnprMWVIaGpRVGRNUWtwZlRVRRAB",
            "text": "油封鴨腿超正宗！配上底下的燉飯，味道很豐富。松露燉飯的起司味道很重，好吃！但是不習慣起司味道的人可能會不喜歡～ 整體來說是一家親切、可愛、溫馨而且味道很棒的街角小餐廳！！！大推！"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nd2VtVlpSVlZTV2tVMlN6TjRUVjlvTVhKd1ZYYxAB",
            "text": "Alex is a great server. Food is consistently excellent."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNFp6SXlUR0ZKTmpWZlpFbEpkakZPV25saWRFRRAB",
            "text": "8 of us, some arriving at different times. Our server took care of our drinks each time someone arrived when we all had a chance to look at the menus she took our orders and specifically took each order. Repeating all the specific requests. As soon as we asked for more coffee she brought it. She was calm throughout the time there. Every order was correct. She was helpful, friendly and nothing seemed to much It was extremely impressive"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVE9FSjVYMWRpVUVsRGRGSlFlVVJQTUVsdlVtYxAB",
            "text": "I did not understand the popularity about this place. The food was just okay and the service was incredibly subpar. All the servers are in the back laughing & giggling except 1-2 actually working & managing the entire floor. I had to ask for my waiter multiple times. I asked for my steak sandwich medium rare, came medium well. Ciabatta bread was also not super fresh. For the price I paid I expected much better service & food. Would not recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMGRucFJaRkJxTjFaSWRrNVhWRUZ4ZFVoNE5IYxAB",
            "text": "Lena is the best server, she is cute and friendly. The food is very good 🥰"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUlVtWnhZalEyTkdOak1UWTFTakJoVUVkcFdrRRAB",
            "text": "Our server,Alex R. Was an extremely  pleasant and patient server with our large group , delicious food,and great brunch experience.\nI had avocado toast done perfectly.Will return here definitely"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ga1VUbHJSMHA1UzFneFozY3pVV2w1YTBOMlptYxAB",
            "text": "Our server Alex was fantastic. We were a party of 7 outside and she was professional and attentive.  Took care of us all."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KT1NWTXhOMWMxU2pSNlRIWTRNbkJ1YjNWMWRHYxAB",
            "text": "Steph!!! She did her big one."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdlVFdG9Ta2xUYld0c2JHTlVZVXhYUzA0eFdrRRAB",
            "text": "Steph was our GIRL!!!!! Had a lovely brunch!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeVN6SlpXa2xXVnpNM1NVUmpNakpOU3pocllWRRAB",
            "text": "Steph was a wonderful waitress. The food here is always excellent. I cannot recommend this restaurant enough!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSWVEVnJYMFZoWTBSR1VFNU5SVlZIWWxKNWEzYxAB",
            "text": "The staff here were absolutely amazing and so was the food! Best experience I've had in a New York restaurant!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRWJXcEJVVE5LUW5Wc1FtSk9XRVpVYXpoRlQxRRAB",
            "text": "Lovely staff and great food. Lena was a great server and very sweet. Thank you Lena!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wS1ZrRTJNMjAyVW1GSWRWSktVR3hQVFZaT1dIYxAB",
            "text": "Best onion soup. Really good and consistent food. Tasty desserts."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JelNFOXdYMDU1U0dOR1EwMXNWM1pNYlRGV2NVRRAB",
            "text": "Had the pleasure of being served by Lena tonight! What an outstanding server! She was kind, patient and very attentive. French Roast is a favorite neighborhood restaurant - food is always wonderful! Will always support this business."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkamExSmxiMHd5UW5KV01FWldiakpRVGpZeFJFRRAB",
            "text": "Ive been a fan of French Roast when it first opened up downtown decades ago. Brunch was my go-to and I loved the service and feel of the place. I recently decided to try the UWS spot for dinner, sadly the quality of my dinner didn't live up to expectations.\n\nPROS:\n1. my friend had the French Onion soup, which they enjoyed.\n2. warm sourdough bread for the table\n3. attentive service from everyone on the team\n4. warm family friendly atmosphere\n5. my dinner order was messed up, so I had my friend's duck confit, which was solid.\n6. because of thr messed up order, the staff gave us free desert. Passion fruit sorbet was a nice palette cleanser to end the meal.\n\nCONS:\n1. I ordered the crab cake special for dinner - and the serving size was 1 thin cake and not noteworthy.\n2. I ordered the lamb chop special, and the dish was sub par. For $42 I got wilted salad, dried out French fries, and 3 small cuts of lamb doused in tazikki sauce. I was told that the sauce came on the side, but the meat was swimming it instead.\n3. We arrived for dinner at 6:30, and it took awhile for the kitchen to come out with our dinner.\n\nIm dissatisfied with my meal at French Roast - because aside from thr lamb - the salad and fries were an afterthought. Given that the dish is $42, id expect fresher greens and fries. It's the small things that make a dish memorable and I hope the kitchen will show the same level of attention as the French Roast staff. Front of House was very \"on it\" and we appreciated their care.\n\nSUMMARY: go for the standard dishes. I don't think their Specials are worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSclRUZ3hSRzlIZEdsQmFsQjJTV2RWTkRkU1RIYxAB",
            "text": "Authentic parisian cuisine & decor; great service & location"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twV2NGRXhkR016WjNkVldtdG1hMk5DYkhSV2VIYxAB",
            "text": "Great eggs benedict, Manager was rude."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeFFrSTRNMll5UmxaRmJFNDFWVzVNVURndFgwRRAB",
            "text": "Moved away and now miss it …"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5V1pWTmtWM0IxTW5GUldVUkZXV1I0WTJWVGIxRRAB",
            "text": "Great restaurant, great service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSWMwTmpXV3A0VEY5eVJGVlBZbVpZWlZOUGRGRRAB",
            "text": "Had a Tuna Nicoise salad and a burger which were very delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVFVqRlhhRlZxUmtOS2JGTTNabEZUTFZocFZGRRAB",
            "text": "Favorite upper west side breakfast, brunch, and lunch!  Very chill, both inside and out"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UFEzUm1iRmN4ZGxObGVqUkdhbk5wV2pWa1JGRRAB",
            "text": "The food was amazing, but our waiter really made our night. Thoughtful service is rare, nowadays. Our waiter, Adam, remembered our drink orders after just one round and even suggested a dish that ended up being our favorite of the night. His attention to detail and easygoing personality really made the ambience of the restaurant enjoyable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMlgwRkhaRGxmV0hsaVJYTndPVTlQZVZoUmQwRRAB",
            "text": "We had a great breakfast at French Roast! My poached eggs were perfectly cooked. Shakshuka was really flavorful with cumin and spices. French toast and waffles were big hits as well. The portions were very generous for the price. Thank you for a great start to the day!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdFQwTXhjMlJSUVdwRU5WSjNSRUV5VEVoZlJtYxAB",
            "text": "What a special treat on the upper west side… the best french toast i’ve ever tried! everyone was so lovely and attentive, will be returning for brunch again!!! 🍳🥞❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMFlWQlVTelZFWW1kWlVFOVVPRmx5TVZJME5VRRAB",
            "text": "French Roast had been a favorite for years, but post pandemic it started to slide- smaller menu- no seasonal change- perfunctory service. Now it’s back to its old glory! Expanded menu with specials and the food is delicious. Amin is an excellent manager who monitors the service and makes sure you are taken care of. So happy to return again to an old favorite!"
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWWNDMW5iVkpWUWxSd2MxcEhWRkZ6YjJOMVZWRRAB",
            "text": "Absolument délicieux, et lieu et service très agréable. Je reviendrai."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNFZVUTNNbk5RY0dKU2QxQkJNbEJGZFU1QlRWRRAB",
            "text": "Highly overrated for brunch\n\nKnow several in the neighborhood who stay away from this place\n\nPotentially better for lunch/dinner fare but haven’t been"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVM2NHNVBSRjlsVG00ek5YQllZamRtTTFjd1ZrRRAB",
            "text": "Great food, better wine, the best bartender!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdVJUUmFUWE52UjA1Q05ISnlkMDVpTldsa2NtYxAB",
            "text": "A comfortable brunch!\nThe food was incredible, the dishes beautifully presented and delicious.\nThe friendly and comfortable service was an incredible experience for us.\nManagers Betsy and Amin are very friendly and attentive to the restaurant's excellent service.\nI will definitely return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZdFJIcHVWR2hMY1hKdWVuZHVNbVE0TTAxc2FuYxAB",
            "text": "Short rib was great, little dry. Service was terrible, we continuously got left alone for way too long several times. Wasn’t even busy, very frustrating. Could have been a much better experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MmNISnlkVWxxY1ZkVU5USnVUbGxUY214MlJXYxAB",
            "text": "Great old world style brasserie bistro. Amazing happy hour prices and food. Great service. All around amazing place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTVR6azVURlZqZHkwNE9TMWFhbkY1VWtkVFIyYxAB",
            "text": "Lena our server was amazing . A super chill spot at 8 pm on Sunday - had a great time."
        },
        {
            "date": "수정일: 3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMVluMlVBEAE",
            "text": "프랑스 분위기를 실컷 즐길 수 있는 곳이예요! 커피도 맛있고 음식도 좋았어요!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSFUzbEZVRmRpV0VKWGRrUkZlRVJtVDNKRVRXYxAB",
            "text": "We had a small brunch type of situation when visiting NY.\n\nThe server and staff were the highlight. Every one was so sweet and courteous, a hands off to the entire staff at this place.\n\nThe food was also pretty good. Definitely worth a visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNlJHRXlWVzVTTURObGVFSTVNbnBqUzBaTFNuYxAB",
            "text": "Great food great mood! Fabulous dishes.  Really liked the steak sandwich.  All so tasty.  Little bit salty in my taste. But anyway great place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSlVIUlZTbEptWWpFd1J6VXlVWFI0TTNOcVpYYxAB",
            "text": "A visit here brings me back to Paris where you can enjoy delicious food and drinks on the sidewalk watching people go about their daily lives.  They have a nice menu and assorted drinks as you would expect. The service was very attentive though not intrusive even though the restaurant was busy. If you’re in the neighborhood you should check it out."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveHZiUm9RRRAB",
            "text": "The escargot and onion soup were quite good—definitely the highlights. The rest of the brunch menu was just okay. I ordered the ‘Friggin Delicious’ cocktail, intrigued by the name and the unique ingredients, but it ended up tasting like a standard Moscow Mule, hence a little disappointment for $18+tax."
        },
        {
            "date": "5달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOVEF2OFg5LTZPVFVnEAE",
            "text": "Kahvaltı seçenekleri çeşitli. Omlete bayıldım çok güzel pişmişti ve lezzetliydi. Ve diğerleri de beğenildi. Servis oldukça hızlı. Rezervasyon yapmak iyi olur. Yoğun zamana denk geldik ama 1 saat süreyle yer bulabildik."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMWFVbHdXRnBKWkZWSE9IbG1jV3hOWW5oWVRHYxAB",
            "text": "It’s my 27th birthday and wanted to treat myself to a birthday breakfast. The service here was and is great. I was presented a birth special, Stephany was my waiter and she’s the best. Thank you to all the staff. Food was amazing, hospitality 5 stars…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCU1owVXROelZNU1ZwRWVFcExZMVZXWmpkekxWRRAB",
            "text": "Not a bad place to drop in for dinner without a reservation on a weekend evening. They serve some classic French fares at a decent price point. The atmosphere mimics one of a Parisian bistro. I had the coq au vin and enjoyed it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbXI2MFp3EAE",
            "text": "No frills French cafe meets vintage vibe. Came here for the inaugural Forgotten Foods festival that I saw online as I love to travel for food. Off that menu we had the pastry with sweetbreads in the middle and the pheasant. Off the regular menu we had the pheasant. I’m pleased to say the pheasant was marvelous. Great presentation with a glass dome removed upon service. Very moist. The sweetbreads dish was beautiful but unfortunately on this and the escargot somebody in the kitchen was very afraid to use salt, and I typically prefer escargot with more garlic. It could just have been different and personal preference. Great service. Very popular spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJanNUaHlRRRAB",
            "text": "I came here for my birthday and it was an amazing experience!!! Lena was such a great server - super attentive and accommodating! Lauren was awesome too and plays the BEST music. Also, best honey lavender latte I’ve ever had. Will definitely be back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBaXNHZ2ZREAE",
            "text": "Great lunch for restaurant week. Varied menu and delicious choices. Escargots en croute were good, a little oily. The brunch burger was very good and large. The service was 10/10, especially server Darwin. Very friendly and knowledgeable about menu. Overall a good experience and cozy, pretty restaurant. I would certainly return with family and friends."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRc1otMDFRRRAB",
            "text": "My daughter brought me here to celebrate my birthday.  First time here.  Staff was very accommodating and helpful when we asked questions about the menu.  Such pleasant service from our server.  Food was immensely delicious.  No complaints here at all.  Everything was great.  Thank you to the staff and manner for helping in celebrating my birthday.  ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbi1EVVJREAE",
            "text": "Yesenia and David were amazing! They provided splendid service. Came to eat brunch with my best friend and we ate the Eggs Benedict and Avocado toast. Will definitely come back again!!!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREOEw2NW9RRRAB",
            "text": "7-5-25 update\n9:24am\nAgain, I'm afraid I must comment on the music choice. For this hour of the day, it would be so helpful to have something softer, more elegant, to bring us into the day. I'd love to be able to enjoy the tasty food and wonderful atmosphere of your restaurant with music that is more peaceful.\n(Not so percussive and beatbox busy for this morning.)\nAs it is now, it's just not relaxing for early morning breakfast.\nUnfortunately, this makes me think twice about considering FR as a favorite breakfast spot.\nThank you.\n********************************************\n\n2024-\nTime goes by... We still have \"French Roast\" on the UWS (85th & Bway). I remember when it used to be open all night long! Even though that's no longer possible, it is still such a \"go to\" for tasty food, great cappuccinos, and fabulous ambience.\nThe service is also wonderful. Just a wonderful staff.\nThe one thing that would make it even better for me would be.... Create a soothing and distinctive musical experience to go with the classic and classy venue. Here on the UWS, I think you could do great with upbeat classical music! No one else does that (except Zabar's, and it's obviously working for them! 😉)\nTruly, putting some thought into music that is sweet, uplifting, and tasty would be great.\nNo rock and roll heavy duty stuff. Make it soft and sweet! It will help my digestion! And it will soothe my heart, as much as your delicious comfort food already does. Upbeat soft classical or tasty jazz (Ella Fitzgerald, Tony Bennett, Sarah Vaughn, Bill Evans, Bill Charlap, etc.) would go a long way to create even more of a distinctive and unique character for your wonderful bistro. Thanks!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMVpMdWxBRRAB",
            "text": "After having a nice day walk around the area we decided to try this place for lunch. It was a cold day so I definitely went for their French onion soup! The food was great and the server was very accommodating and friendly. After eating lunch we had coffee and their dessert."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cy1pYmlBRRAB",
            "text": "A French bistro on the UWS.  We had a great time there for dinner tonight.  Maria was a wonderful server.  She made us feel welcomed from the moment we sat down.  The food was delicious - the drinks and wine too - and the service was the best."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaG9XUWZREAE",
            "text": "We had a great experience at French Roast! Darwin provided excellent service and was so kind. Food was absolutely delicious!! Very happy with the atmosphere- such cute French vintage decor! Veggie burger was so good. Best French toast I’ve ever had!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214d1VsWnlPVUpOTm1wWFQwazBNREZHY214WE5GRRAB",
            "text": "Great bistro on the UWS.  Friendly staff and wonderful menu!  Highly recommend the burrata tartelette.  Great atmosphere, will definitely be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2N2RpZEdnEAE",
            "text": "Maria Lena, was a great server. She took the time to explain the specials and each meal on the menu. She was very gracious and approachable. The food was also exquisite. If you want traditional French food done right, come to French Roast! Open 365 days a year and they have brunch too!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzX2JxdWRREAE",
            "text": "We love dining outside here during the warmer months—the outdoor seating adds a lovely touch to the experience. The food is consistently excellent, with a great selection of wines to complement the meal. The staff are incredibly friendly and attentive, always ensuring a pleasant visit. This is easily one of the best spots to dine on the Upper West Side!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SWJGbzRhWFp6VW5oQ1Z5MDBVMFU0Tm1JM1dYYxAB",
            "text": "We had dinner Friday July25 . I was impressed by the attentiveness of the manager. He was trying to get better located table for us. He came to our table many times making sure if we have bread to dip into sauce and etc   Excellent and exceptional service. I saw him kindly escorting a lady using Caine to bathroom .Other waiters were very attentive also. Food was good. We had onion soup and mussels with marinara sauce. I recommend highly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdWlpdFhOb3VlVDFRRRAB",
            "text": "Okay, WOW. The food was great(burger and stuffed croissant), coffee strong, and service was stellar(Lauren!! You’re a star). Highly recommend, though reservations seem to be a must for parties bigger than two."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaHA2MFZBEAE",
            "text": "Amazing! We had the goat cheese, zucchini noodles and french fries to start! These were REAL truffle fries! And then we had gnocchi which was more cheese than anything/filet mignon and arugula salad/ the specialty soup (carrots & something else)!! Everything was delicious we finished everything I must say we probably could skip some of the entries as there was plenty of food! The cocktails looked amazing but we only tried the margarita which was smokey delicious! Staff friendly and really packed!! Consider doing a reservation"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfc3QtakJBEAE",
            "text": "Loved Nelson our waiter most of all who made our experience fantastic!  All the food was perfect without even a thought or question of perfection. Plenty of bread & drink to go with a perfect app, entree & dessert. Can’t go wrong with anything you choose!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUczRURG1nRRAB",
            "text": "My husband and I visited for brunch with a reservation. The place was packed, which we took as a good sign. We were seated immediately but it was quite some time before a server visited our table. She was quite apologetic and it was understandable with the number of active tables. Unfortunately, no conversation could be had over the din and revelry. The mimosas were pedestrian at best; however, the entrees were outstanding. I had waffles and my husband had the croque madame. We both greatly enjoyed our meals. Each single entree would have been enough for two people. I doubt we will return, but only due to the noise level, not the quality of the food."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLdTF6ZWp5blluS3pBRRAB",
            "text": "Love the eggs benedict, although i would probably enjoy it more when they had their home made potatoes instead of french fries. Cute outdoor seating and wonderful service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNldGTnBPVmhFY2w5eU5qUnlRalJwTms1eU1VRRAB",
            "text": "came here for brunch with a friend. seating area was a bit tight inside. staff was friendly.\n\npresentation of food looked good, but the food was just okay"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbXByVndRRRAB",
            "text": "Our server Stefani was amazing, she truly was the icing on the cake to an awesome experience .\nEvery food item came out perfect from the snails to the Scandinavian bene, not to mention the speciality cocktail we’re on point. Definitely check this place out for brunch on your way to the markets on a Sunday ."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdkwycFJBEAE",
            "text": "A really great night in a fantastic location on Broadway. Really attentive and helpful staff, great food and a wonderful atmosphere. Best meal so far in the big apple. Definitely worth a visit. Maria Alexandra was great, very helpful and made the evening even more memorable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbE9TdUF3EAE",
            "text": "My husband and I are obsessed about this place. We almost know the whole team by now, we been to brunch, lunch, dinner, and ordered their dinner specials since we discovered the restaurant. It was always a 10/10 experience! On a hard day at work, we go and blow off steam with the always amazing food. On weekends,we bring friends and family to the restaurant to enjoy a sunny day conversational brunch. When we got our puppy, this is the first restaurant we took him to because we felt comfortable and at home! Highly recommended this place.... I can't say enough! Amin, Lena, Nelson and everyone always make us feel sooooooo welcome. Please check this place out ASAP!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURna3F1NWdBRRAB",
            "text": "This place has superb food, food price and portion size. Stephany B was amazing and made sure our food came out on time. Definitely would be coming back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeDVlMUh3EAE",
            "text": "So my beloved, who is a Michelin Star trained chef who has mentored with Michel Guerard, Alain Senderens, Pierre Troisgros, Roger Verge, Anne Willan and Barbara Tropp decided to surprise me after a rare night to go to French Roast.\n\nWe tried the Restaurant Week menu with a few add-ons. Our server was named Drago, who actually was very attentive and extremely personable.\n\nOur food was extremely well prepared, especially the salmon which my beloved likes it medium rare, so one can taste the freshness of the sea. Will definitely be going to them again and again, and if you do go look for Drago, he’ll definitely take care of you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFdFkzUkxXRW96TVZsdGVrRnhPVU5DYXpWa2IzYxAB",
            "text": "Came with my friend for lunch and the food and service were great. We didn’t have a reservation but were still able to sit outdoors. I also really appreciate that they enforce dog rules, unlike many other restaurants in NYC. A lady at the next table had her dog all over the table. Don’t get me wrong, I’m very dog friendly, but this is a restaurant where people come to eat. I was glad the manager stepped in and told her that the dog couldn’t be on the table."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa05XZDZRRRAB",
            "text": "The French Roast is already our go-to\nspot, but Alex’s service really took our trip to the next level! She had such a warm, inviting spirit and made sure or check in on us often. The food was incredible too. We’ll be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOC11NnJnRRAB",
            "text": "French Roast is a wonderful spot to eat, relax, and catch up with friends. The atmosphere here is wonderful, easy going, relaxed, atmospheric, and very free. And the food is amazing! The tomato soup was delicious and the Grilled Salmon as well.  Croissants are fresh and crispy and coffee is flavourful and full of aroma.  I throughly enjoyed the food and the ambiance of this wonderful restaurant, the people that work here, and will for sure come back and recommend this restaurant to everyone."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBa2RmZnFBRRAB",
            "text": "We had the server Stephany and she was absolutely lovely! Service was great, food was amazing. Atmosphere was beautiful. Would definitely return!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMLVgtcG5XcGJEcVR3EAE",
            "text": "Absolutely phenomenal experience from start to finish! The food was rich, flavorful, and beautifully presented—truly a taste of France. What made the evening even more special was the outstanding service. Juan, our server, was incredibly attentive, warm, and knowledgeable—he made us feel so welcome. Amine, the manager, stopped by to check in on us and was equally gracious and professional. It’s rare to find a place where both the cuisine and hospitality are this consistently excellent. Can’t wait to come back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmX0x5WmNREAE",
            "text": "Stopped in for a Saturday brunch - amazing experience. The white cote du rhone is one of the best I’ve ever had and the croque madame was cooked perfectly. Lena’s service was beyond incredible if you get the chance to visit her on weekends! Extremely attentive, quick, and friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ0tleTJRRRAB",
            "text": "We had a reservation for 4 people at 1pm which we made 4 days in advance. We sat outside with a dog. They had heat lamps. We really enjoyed the food and the service. The Shakshouka and the baked eggs were similar with the baked eggs not being spicy. The avocado toast was fresh, with the eggs it made it filling. The steak and eggs were good, however we asked for it medium and it was closer to rare. Still tasted good. It took a bit to get the check but overall a great spot for brunch especially if you bring a dog. Bathrooms were nice and clean"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeDZiTk9BEAE",
            "text": "Crowded on Sundays for brunch. The Scandinavian eggs benefit was very delicious. Our server - Lena - was friendly and attentive."
        }
    ],
    "reviews_count": 90
}