{
    "name": "RedFarm",
    "place_id": "ChIJ50n4UohYwokRLrnKpXxjuFE",
    "grid": "MN7",
    "address": "2170 Broadway, New York, NY 10024, USA",
    "rating": 4.4,
    "user_ratings_total": 1044,
    "phone_number": "(212) 724-9700",
    "reviews": [
        {
            "date": "수정일: 11시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NzlHVWx3RRAB",
            "text": "Chicken and beef was very processed and fatty, practically inedible. Will come back for the Peking duck and shrimp dishes but I would avoid these two items.  Crab and shrimp dumplings were possibly best ever.\n\nRecent visit has the spicy beef, duck wraps and sweet and sour shrimp. All were very good (4 star) but the shrimp was not nearly as good as the downtown location.\n\nBeen here several times now, can also strongly recommend the Singapore noodles, very tasty, quality ingredients.  They only have one soup dumpling left on the menu and it is quite bad.  The crispy skin chicken has decent peanut sauce but isn’t really enough food for a main.  The oxtail fried dumplings are very large and quite decent.\n\nCame back for the Peking duck which was a little dry but overall very good.\n\nLast two visits have been quite good.  The shrimp curry is exceptional. So were the shrimp and snow pea dumplings. The udon noodles with spare ribs were very good although there was barely any meat."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdVVHNW1NMmxSVkMxUWJqVmlUbmMzTlc5WlFsRRAB",
            "text": "Solid Asian food. Good place to go prior to a concert at the beacon. Nice people. One of my difficult to please New Yorker friends really loves it, so it must be good, right?"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQ2FHSkhPVlJ0WkZaR09XRTBNVFY2ZGtodFFWRRAB",
            "text": "They notice if your water glass needs refilling. Their food presents excellent flavors. Plus, the workers maintain a positive demeanor. People filled the entire establishment. This spot will meet your expectations."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObE5HOU9MVEJZUmxod2RIRlVVVTlaVVY5NVVXYxAB",
            "text": "Delicious, innovative take on standard Asian dishes.  The flavor combinations are wonderful and unique.  The presentation is fantastic.  The service was attentive and helpful but never annoying.  Prices were reasonable for the quality."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wd2FXYzJkMkozUnpGbmNWRjVhRXh3UXpKYWRHYxAB",
            "text": "This place easily deserves 5 stars. The food, the drinks, and the staff are all impeccable.\n\nThat said, the reason I’m writing this review is so next time I remember to not make the same mistake I’ve already made twice. Note to self: the udon noodles are mildly spicy and my kids don’t like them!\n\nHowever, they do love the pork buns!\n\nAnd we love the noodles and everything else, especially the Shiso Wonderful cocktail.\n\nEasily our current favorite place in the UWS to go with our kids these days.\n\nUpdate: turns out they can make the noodles not spicy, and the waitress remembered us and offered to do that!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scmIwSkhObFprTTJaSU1HTlRkako0UTNFM1RYYxAB",
            "text": "Good but too expensive can recommend soup dumplings and duck wrap."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrNVUyVm1NVXAzVGxoSk5WRTFSeTF0VVRJNVRtYxAB",
            "text": "Our #1 restaurant in Nyc"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdk1tTlNVMUJIWVhWb2FYWnJXRk4wU21jNVRrRRAB",
            "text": "This is my favorite Asian restaurant. It can be a great spot for friends or even for a romantic date. The ambiance is lovely and the food is absolutely delicious. I highly recommend it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abU9YQlRTa1ZMTlRNNVFuVmxRalkyTUd4d1NIYxAB",
            "text": "Always a winner! Thank you, Charlie, Sully, and the entire Read farm staff for a fantastic meal. From start to finish, our evening was perfect. Some suggestions for readers: Order Peking Duck in advance – it’s worth it! Treat yourself to a special drink offering – I particularly like the white sangria with peaches. The dumplings and cold noodles in sesame sauce are to die from! Enjoy every minute and every visit. 👍👍👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTlgzTjROSEJsYTFOWWJERXlibXRxWlhGUmVXYxAB",
            "text": "Food is amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMk1EVlJUMjF0ZG5sdU5uRjRjREZUTjNOVFdFRRAB",
            "text": "Enjoyed our dining experience. Food was good. $$$$! About $100 per person with tip. Drink water. Nothing special wine by the glass is $17.00\nfor a weak pour. Special occasion kind of place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNWRGTnNiVjk0TUZKU1NuUmxUVkpDWDJ0SVVWRRAB",
            "text": "I’ve been a loyal customer of Red Farm for over five years and have always enjoyed my experiences—until recently. Unfortunately, my last two visits have been major disappointments.\n\nDuring my most recent dine-in experience, the service was almost nonexistent. No one checked on our table, and the customer service fell far short of what I’ve come to expect.\n\nTonight, I decided to give them another chance and ordered the sweet and sour chicken for takeout. To my shock, the chicken was raw. When I called the restaurant to politely inform them, they immediately became defensive, insisting their chicken is pre-boiled and couldn’t possibly be undercooked. I would not have taken the time to call if I wasn’t certain of what I received.\n\nWhile I won’t escalate this to the health department, I feel compelled to leave this review. Something has changed at Red Farm over the last couple of years, and sadly, it’s not for the better."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNE0wdGlSWEEzTTNKR1FtOUJMV2hOU1dkTlFXYxAB",
            "text": "Fantastic atmosphere and the staff were very good about accommodating our gluten allergy once we spoke to the manager. The food was tasty but seemed a bit overpriced, especially the fried rice, although portions are big."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabU1FdGZUMkpRU1U1dk1qaE9NRVl5VEc5eWVHYxAB",
            "text": "What a superb experience in this restaurant, the red farm provided such a vibrant and unique area for us to really break bread after a couple years apart, especially the fan that was brought out for our most Hot member of the squad. Above all, I would recommend the duck lettuce wraps, as they really succulent. Made my belly, sing, joyful songs of Justice and unity."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTVZXOTZjWFJLVWtFMWJVczRlSEYzVG14NVFtYxAB",
            "text": "Great food, dumplings and noodles were amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeGF6YzJNbFZPZFdKd09GRk5OM0U1YVhnMVlVRRAB",
            "text": "Food was pretty good and we were able to walk in which was great! Service was excellent and overall felt like good value for money"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NmFqSm1aRWhWYWtKS2IwRkpObVYyZVRsQlJXYxAB",
            "text": "Food was AMAZING!\nSara is a such great server !\n5 stars!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENWFPeHdnRRAB",
            "text": "Excellent food\nGood service\nVery expensive"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdnl5ZEM4aV9tc09BEAE",
            "text": "Modern Chinese food with bold flavors and creative dishes. The egg rolls and soup dumplings are packed with flavor. Warm, stylish setting and great for a casual meal with a fun twist\n\nIf you're looking for a delightful culinary experience, I highly recommend trying the vegetable curry. This dish is a vibrant celebration of flavors, combining a variety of fresh vegetables that are perfectly cooked to retain their texture and nutrients. The curry sauce is rich and aromatic, infused with a blend of spices that strike the perfect balance between warmth and zest"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcVFncWlnclpIWWlRRRAB",
            "text": "Everything is delicious have tried several things on the menu and you can't go wrong. Known for their pac-man dumplings presentation which is great. A little on the pricier side but the dishes are big portions and can be shared. Recommend trying at least one dish with noodles and one with rice."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc29lbWh3RRAB",
            "text": "Spectacular!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMVBpbWxnRRAB",
            "text": "Every time I go here the food comes quickly and is always delicious. I specifically like the oxtail dumplings. They always greet me and my family when we come in and we are always happy to be there."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJazYzYzVRRRAB",
            "text": "Highly recommend the dumplings!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJLWM3QTRnRRAB",
            "text": "Ok, hear me out, there is little to complain about here.... We love dumplings! This place is busy for good reason\n\nWe arrived with a party of 6, without reservation around 6, stepped outside to choose to wait or find something else. Staff came out because a table opened up, so we stayed, everything was amazing. The fried rice, wide noodles with veg, pork buns topped the list. Curry and pastrami egg roll disappeared quickly.\n\nI completely forgot to order dumplings, my only legit complaint, I take full responsibility for this failure. Now, I must make it right when we return.\n\nThank you Red Farm, for your service, food and overall experience. See you again soon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcjZDN3FBRRAB",
            "text": "Excellent experience overall! Food was delicious and exciting, with every menu item being unique but approachable. Everyone on staff seems to be happy to be there and wants you and your meal to feel special. Will be recommending to anyone attending a show at the Beacon"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeVpEcU5REAE",
            "text": "One of the best dining experiences I’ve had recently! Every single staff member from the host to the waiter was so nice and extremely helpful! I’ve ate at the other location a few times and the food was just as amazing here. So many great vegetarian options and a lot of variety in the menu. I think I’d come back to this location over the other though solely for the hospitality."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbFBxNGt3RRAB",
            "text": "Always awesome.  Never had anything less than an outstanding meal at Red Farm.  The Peking duck is phenomenal."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eE5fZXBnRRAB",
            "text": "The menu always has interesting items and is consistently delicious!  The staff are welcoming and helpful.  We always enjoy eating here!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3d05ITXNnRRAB",
            "text": "RedFarm on the Upper West Side masterfully blends traditional Chinese cuisine with modern flair. Their signature Pac-Man Shrimp Dumplings are both whimsical and delicious, embodying the restaurant's innovative approach. The Spicy Crispy Beef offers a perfect balance of heat and sweetness, while the Three Chili Chicken delivers a flavorful kick. The ambiance is inviting, and the service is attentive. RedFarm is a must-visit for anyone seeking inventive Chinese dishes in a vibrant setting.​"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRek8tOGtnRRAB",
            "text": "We love Red Farms; the food is superb, great quality, and delicious, we've been several times and find lunch on weekends to be the best for us. A great experience and worth the expense."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaXNHUUlBEAE",
            "text": "Tried to order delivery (2 nights in a row) - the first night the order was canceled an hour and half after ordering. The second night we called the restaurant before ordering (explaining what happened the night prior to make sure we were able to order delivery) and then we called them after ordering to confirm they had the order (which they confirmed) - and it was canceled again an hour later….  When we called the restaurant they claimed they never got the order.  The restaurants manager blamed the delivery service, inferred we were lying about speaking to Red Farm staff to confirm the order even though we spoke to someone at Red Farm confirming the order (twice).  Formerly a fan of this restaurant, the way this mistake was handled was super rude and upsetting.  (I wasn’t asking for anything from them other than acknowledging the mistake)."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOHZTcjRRRRAB",
            "text": "Always a good food experience here. Unfortunately, the young guy at the host desk needs a serious therapy session. Miserable and uninviting. Such a shame because all the other staff are incredible, including our waiter who has clearly been around the business a long time."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN2N6RnB3RRAB",
            "text": "Had lunch on Lunar New Year day. Seating was prompt and courteous. Server was also prompt and courteous. He explained dishes and made suggestions. The food was truly tasty! The decor threw me. For a moment I thought I was in a BBQ restaurant with the farmhouse wooden decor and checkered tablecloth. However, the service, food and my lunch guest made it a none issue."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNDdIUThnRRAB",
            "text": "UWS gem, recommend with family or friends. Casual chic place with succulent Chinese food"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMOXRUYWNBEAE",
            "text": "Haven't been here in years but food is excellent and far more original than typical nyc Chinese spots. It can be a bit expensive but the food is excellent and the quality is first rate. Dumplings are exceptional. Try the bacon and egg fried rice. It's yummy."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNGZ2cW53RRAB",
            "text": "From the moment I walked in the door until I left, I received excellent customer service. The food was also delicious."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNVA3blF3EAE",
            "text": "Good food from a ridiculously overpriced menu. Not worth it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNHNld0V3EAE",
            "text": "Service was outstanding. I’m typically not a huge dumpling fan, but the husband was craving a so I obliged. I searched for the highest rated dumpling restaurant in the upper west side and RedFarm fit the bill. We got the soup dumplings, crab and lamb, pac man and 5 flavor.\nThe sweet waitress was patient with me explaining each one. And she was spot on. They were all excellent. But the soup was hands down my fav - esp on this cold winter day. All of the servers came by and checked on us so much we thought they must be owners. Turns out- they’re just a great team that takes pride in their work!  Cheers to me for this great find :-)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfM05ma19RRRAB",
            "text": "The atmosphere is pleasant and the service is great, but the food is meh and overpriced. The spicy crispy beef was leathery and overly salty (I'm a salt lover, btw). The fried rice was crispy, but otherwise unremarkable. Truffle shrimp dumplings were interesting, but served over corn which does not work. Mango salad was fine and plentiful, but meh. Despite the great service I will not be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcU1mTExBEAE",
            "text": "I thoroughly enjoyed this meal, everything that we ordered was delicious.  Will definitely return!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNTc3S2JnEAE",
            "text": "We come to NYC every month and always make a visit to Red Farm. The food is excellent, as is the service, and this time we came with a party of seven.  At the end of the meal we were treated to an array of desserts because we were seated next to the front door with an occasional blast of cold air.  It was a very thoughtful and generous gesture.  Red Farm continues to be our favorite UWS restaurant."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdUpyS2lnRRAB",
            "text": "Elite atmosphere and customer service. Matt was an amazing waiter!"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbWRmei13RRAB",
            "text": "Si quieren comer pato, ese es el lugar!, lugar acogedor, buen servicio, preferiblemente ir con reserva"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmejRfTWdRRRAB",
            "text": "First time in New York first time here Came with my family and it’s was absolutely beautiful, food lovely and fresh great atmosphere but the best part was our servers Matt is an incredible asset to the place very knowledgeable about all the food great recommendations first class! And the other server was Francesca she was so lovely great conversation about food the place and her family from Scotland! Thank you so much for making our visit relaxing x"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdnBhb3FBRRAB",
            "text": "DON’T WASTE YOUR MONEY!!!  EVERYTHING Was Oily!  OVERPRICED, OVERRATED.  ONE STAR IS TOO MANY"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dk5uTFR3EAE",
            "text": "A little price but the food was great. Very creative but good combinations. The bbq fried rice and oxtail dumplings were good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2a05LLXZRRRAB",
            "text": "Clean plates all around! Lovely setting and delicious food. Good selection of vegetarian options: dumplings, noodles, fried green beans 🤤 Ask for the chili oil to spice it up. Nice vibe to dine at the bar and Aisha the bartender is excellent!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Nk1HMjd3RRAB",
            "text": "We’re no strangers to paying for exceptional dining experiences, often visiting 2- and 3-star Michelin restaurants. That said, this restaurant is seriously expensive for what it offers—$34 for fried rice and over $20 for dumplings in a casual, no-frills setting.\n\nUnfortunately, the food was average at best, lacking the standout flavors or creativity you’d expect at this price point. Worse, the decor, presentation, and service didn’t come close to justifying the cost.\n\nOur rating reflects the price point the restaurant has set for itself, which falls into the territory of a 1- to 2-star Michelin experience. At these prices, expectations are naturally higher, and this restaurant simply does not deliver. If you’re looking for high-quality Chinese cuisine in NYC, there are many better options."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzck1YcEZnEAE",
            "text": "The best restaurant ever."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQM2Z6Qm9nRRAB",
            "text": "The service people are extremely friendly and welcoming very professional. Food was exquisite and the knowledge of what food they have was equally exquisite."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNTdUbDV3RRAB",
            "text": "비싸기는 한데 맛이 없거나 기분이 나쁘지는 않은, 그런 무난한 경험을 선사함. 근데 이게 왜 퓨전이니 모던이니해서 중식인지는 모르겠음."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMWVtOTl3RRAB",
            "text": "We had a great time at RedFarm. We sat at the bar and our waitress/bartender was Aisha, who was extremely kind and hospitable. Not just to us, but every single person she interacted with.\n\nShe made great recommendations for our first time there. We got the lunar New Year dumplings, the Crispy Beef, Crispy Chicken, and Wild Rice Noodle with Duck.\n\nThe rice noodles and crispy beef hit home for us.\n\nIn terms of food, as a Cantonese person, it’s very familiar and is high quality and very good. You can get similar quality with higher quantity and lower prices in Chinatown but you won’t get the same vibes or drinks. You’re really paying for the vibes.\n\nVibes are super nice. Definitely seems like the place to be.\n\nWould go back with some friends for an experience and maybe try the Peking Duck. The prices are on the higher end so heads up."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibU15dklREAE",
            "text": "We had a wonderful meal; crispy beef, hot and sour, scallion pancakes (they were a real standout) followed by delicious lamb and cumin dumplings, decadent oxtail dumplings, and super fun crab-duck dumplings with a little crab claw handle and curry to pour inside. I’d never seen anything like it!\n\nThe steamed sea bass with black bean sauce was the star entree; light, soft fish in a banging sauce. The short rib udon was also great. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcU1pWmRnEAE",
            "text": "Yes, they have Peking duck but please try all the excellent dishes as well. I love their dumplings, soupy and soft and umami. I love their asparagus and their snow peas, tender but crisp and salted correctly. I love their wings, meaty and stuffed to have multiple textures. I love their steak, oh my goodness that sweet salty fatty steak. I recommend basically the whole menu. My advice is to order with balance: sweet and salty, fatty and light. You'll love this place.\n\nAlso the staff is so cool, they made me feel like I was part of the neighborhood. Thanks for taking care of us."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MHN6d1RBEAE",
            "text": "This place was wonderful. We didn't have a reservation, but they were able to seat our family of 6 at the bar.\n\nDale, our bartender was simply amazing; friendly, funny, and informative. The cocktails are crafted well, with a unique Japanese flair.\n\nThe food was absolutely delicious. We ordered a whole bunch of different little dishes and passed them around family style. The service was quick and wait-staff was very attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkcnRmVlRREAE",
            "text": "We liked it. Had a bunch of dumplings and various apps. Overall we liked it but it was so expensive for a Chinese lunch. Like $6 for each small dumpling.  The food was good nicely prepared and hot. Service was great and the decor ok.  With these prices I would try elsewhere"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKa3RtWkFREAE",
            "text": "The staff is bar the best asset at this establishment. Every single person we dealt with went out of their way to accommodate us and make us happy. Literally every single staff member, they were amazing.\n\nTheir toasted chili sauce is divine.\n\nThey worked diligently to ensure the member of our party with Celiac disease was offered safe options, and when serving the dishes, they were careful to point out which would be good for them to eat vs. which would not.\n\nThe staff was also careful to advise us to mind the little dried red peppers cooked with one of the dishes; I have to assume some people must have had a bad reaction, because the peppers seemed pretty normal as far as hot dried red peppers go. IYKYK.\n\nThe food was good, but not make me want to rub it on myself good. It was good, but not amazing.\n\nPerhaps with the exception of the smoked crispy skin chicken situation, which made the meal worthwhile.\n\nAll of the dumplings we sampled were very tasty, as was the multi-spice chicken dish we had, though for me, I needed a little salt to really brighten it up.\n\nThe reason for the not so great rating regarding atmosphere... We visited in the beginning of July and more robust air conditioning would have made things much more comfortable, and we were not the only group to be off put by the heat and humidity.\n\nOverall, this was a solid experience with marvelous service. I would definitely go back, I just might not go totally out of my way to do it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5NVBud2d3RRAB",
            "text": "Fusion Chinese food. Everything was great but my standards in dumplings are high this is why I give 4 stars.  I would suggest not to get too many fried stuff or it can be a little too much. Price is on the higher end compare to dim sum…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaWZtc1pnEAE",
            "text": "My wife and I came here for dinner tonight. We had high expectations and they were surpassed! The food was extraordinary. We had duck wraps, pancakes, blackened cod and bbq beef. All of which were delicious. It was our 8 year anniversary and they surprised us with a candle. The ambiance is perfect we sat outside it was a good volume but still felt the vibe. But to be honest the stand out was our waiter, Milton. We have been to many restaurants and never once had someone so attentive, knowledgeable, and considerate of how our experience was and the food we were eating. He gave great advice on what we should be having and ensure that our experience was perfect and beyond what we were expecting. We were a bit lucky to have a way to like him. I would highly recommend coming here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeHN5TnBBRRAB",
            "text": "The food is always yummy that I want to try everything on the menu! The service and care is wonderful as well.\n\nOne note is that I saw a mouse running around inside the restaurant when I was dining that it did ruin the dinner I was enjoying."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaN2V5Q2F3EAE",
            "text": "This place is truly incredible. Milton, our server, was unbelievable. The food recommendations were perfect and so reasonably priced. Every meal was divine and so fast. We sat outside under cover and it was so nice. We can’t wait to be back already!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURWaXF0aRAB",
            "text": "My recent dining experience at Red Farm was nothing short of extraordinary. From the moment my friend and I took our seats at the bar, we knew we were in for a treat. The staff, led by the wonderful Tashi, guided us through an exceptional culinary journey.\n\nWe started with a pot of the fragrant jasmine tea that set the tone for the evening. The soup dumplings and wonton soup were a delightful beginning, brimming with flavor and warmth. But the standout dish was the flavorful noodles, perfectly cooked with tender chicken, elegantly laid on a bed of fresh greens.\n\nWe ordered the duck wraps and exchanged the typical pancakes wraps for lettuce wraps which made it a bit lighter with the succulent duck, making each bite a delightful mix of textures and tastes. They brought us some different sauces to try so we were mixing and matching. The attentive service added to the charm, with the staff checking in after every first bite, ensuring everything was to our liking.\n\nAnd just when we thought it couldn’t get any better, the dessert arrived. The homemade ice cream sandwich was a masterpiece, each sandwich offering a unique flavor. The pistachio was my personal favorite, ending the meal on a high note.\n\nThank you, Tashi and the Red Farm team, for an unforgettable experience. I’m already looking forward to my next visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsenZ5SnR3RRAB",
            "text": "Without exaggeration, I can honestly say that this place lives up to its reputation. Despite my initial skepticism, it truly is the best Asian cuisine in NYC. The Peking duck was beyond delicious, perfectly complemented with sesame peanut sauce, cranberry sauce, and the classic hoisin. The crispy duck skin was absolutely divine.\n\nNot only was the food exceptional, but my girlfriend raved about the basil lemonade. The drinks menu certainly caters to all tastes, and the wine selection is killer.\n\nIn addition to the remarkable food and beverages, the atmosphere of the place was also outstanding. The ambiance was a grounded farm to table experience.\n\nI must also acknowledge the outstanding service provided by our waiter, Dan. He was phenomenal in every aspect, attending to our needs with great care and professionalism.\n\nOverall, this restaurant deserves nothing less than a confident 5-star rating. Without any hesitation, I highly recommend it to anyone seeking an unparalleled dining experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNob1lELUlREAE",
            "text": "A Chinese fusion experience with American and Japanese influences.\n\nThe pastrami roll was really good, along with the crispy fried beef. My favorite entree was the seabass with black bean covering.\n\nI'm looking forward to returning and trying out some of the specials."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcnZlTVNBEAE",
            "text": "The food here is amazing. The spicy, crispy beef, chicken, lettuce, wraps, all the dumplings, garlic, and string beans and brussels sprouts were all excellent. The cocktails are also delicious ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdGZiSm13RRAB",
            "text": "The food IS delicious but there are not many options. The 5 chili chicken is basically the same as the chicken dumpling.  It’s a bit Spicy for me but very good. Great waiters here and music Not Too Loud."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhNDZpNUNnEAE",
            "text": "Amazing asian fusion place. We went as a group of four (2 vegetarians and 2 meat-eaters), and all the dishes were superb. The starters and dumplings are pre-made and had some meat-related sauce mixed in, so my vegetarian friends ordered from the mains and noodles/rice options which were made fresh. I think the only complaint I heard was that the mango in the fruit bowl was sour - but cut fruit isn't the draw of this place, so nothing crazy there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweWVyck93EAE",
            "text": "Amazing food! Super flavorful! Lol the juice got on my shirt but came right off ! The food we ordered came out at all different times but everything was delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtakpxTmh3RRAB",
            "text": "Gives off very American/fusion vibes. The food was good; the Peking duck was amazing and I liked the scallion pancakes as well. I feel like prices were very overpriced though, and maybe that's why we were the only Chinese group in the restaurant when we went haha."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbWV5UVFBEAE",
            "text": "We came back and the service was great; it must’ve just been an off day the first time we came. This time around we got the pork belly, yuzu & mango arugula salad, fried pork buns and the udon with short ribs. It was the perfect amount of food and just as great as the first time!\n\nPrevious Review:\n\nFood was great. We got the Duck & Crab Dumplings, Pork Belly & Jalapeños, Spicy Crispy Beef and the Three Chili Chicken. Overall the food was great (highlight was the pork belly & the beef).\n\nService was okay. They were friendly enough but wouldn’t say it was outstanding. This is the only reason it’s a 4 instead of 5."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURCNzhGQRAB",
            "text": "Great place to go if you are looking for peking duck. Dim sum dishes are great too. Loved the dessert menu. Definitely recommend making a reservation. If you go for a late dinner they sometimes run out of peking duck."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2ck11MWNnEAE",
            "text": "Menu is filled with delicious options, starters, dim sum, fried rice, noodles and all in between! We tried the pan fried lamb and the ox tail dumplings, we only wish the portion was 6 instead of 4 :) we also tried  the Singapore noodles with shrimp and sliced BBQ pork which was very tasty. Dessert menu seemed overpriced at $14 but I guess that’s just NYC."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOW91ZVpnEAE",
            "text": "I have to say that this are probably one of the best dumplings I’ve ever had. The ones I like the most were the duck and crab dumplings. The curry that came with the dumplings was perfectly seasoned. The pastrami egg roll was very original and fantastic flavor and texture."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcS1uUWpnRRAB",
            "text": "First of all let me tell you I've been a fan of this place for years. This time I took my parents who had never been there and heard so much from me over the years. A/C was bad and saying it felt like a sauna might come short. The duck was definitely overcooked. The rest of the food was very good. We had a rice dish that came with beef cubes that could easily serve me as a last supper. Hope they have fixed the A/C issue and also the cooks don't keep overcooking the ducks. Will go back hoping they address the issues."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudF9xWGJBEAE",
            "text": "Food was a little salty, but it was still so good\nEverything was delicious, we ordered four dishes for two ppl, it’s proper amount\nLoved shrimp dumplings"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2aHJlY193RRAB",
            "text": "UPDATE, 2nd VISIT, IN 2022: The food at Red Farm is so fresh tasting. The server was very pleasant. We hope to go more frequently, but the prices are a tad dear, so the value for money means I can't quite give 5 stars. It's a 4.5-star restaurant overall.\n\nWe had the Crab, Truffle and Corn Chowder, which I highly recommend. It was amazing. It is a smooth style of chowder, which I vastly prefer over the style of chowders that have large chucks of potato in them.\n\nThat was followed by the Happy Buddha Delight and a crispy-skin smoked chicken dish with the merest touch of spiciness from (lightly sautéed?) jalapenos and, I think, chopped scallions. I recommend both. The chicken dish is sufficiently mild for those who do not like spiciness, such as my dining companion who thought it was excellent; they simply made sure to not eat one of the jalapeno slices. The server beforehand said the dish was mild and my companion and I both agree that the server's description is accurate. More importantly, the chicken was decidedly moist and tender!\n\nThe bite-size ice cream sandwiches for dessert were pistachio, chocolate, coconut, and strawberry, and occasioned the meal's only snag, which was minor. The dessert was described to us incorrectly by another staff member before we ordered it as including caramel, not coconut, as one of the flavors. I rather strongly dislike coconut, so my dining companion enjoined that whole sandwich, which by tanning-lotion-like smell alone--not to mention color--was instantly discernable as most definitely not caramel. But my companion, a coconut fan, thought it was excellent. I most enjoyed the strawberry one. These are not sandwiches except in structure... :) They are four sandwich *bites*. It would be better to call them, perhaps, Ice Cream Finger Sandwiches, to evoke that they're rather dainty. They are quite small, yet can still be shared by two diners--each one getting a small bite. All of the dishes were easily shared.\n\nA PRIOR, 2021, VISIT: Prices are steep but the quality of the food arguably justifies it. The spicy tequila cocktail was amazing. The happy Buddha dish was good but the Singapore noodles dish was even better. We ate outside and thought the table was great--good people watching. Attentive staff."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleDR6SU9nEAE",
            "text": "I bit dissaponting as my sister dined at their London location recently and we thought we would try nyc Her dumplings were little pieces of art ours were not . The dimsim dumplings were $17 or more  per order we expected exceptional. They…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLMzQtSXR3RRAB",
            "text": "A must visit! The food looks and tastes great, nice variaty of dumplings. The cocktails were tasty and original. We enjoyed it very much."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybVBUaFZBEAE",
            "text": "We made a reservation and were seated promptly. The atmosphere is casual and uncluttered (I've seen some people call it intimate and that is not accurate). We had five dishes between the two of us (1 appetizer, 2 dumplings, and 2 entrees) and we found all of them to be bland. The flavor was superficial and the ingredients didn't always mesh well. Also, our waiter didn't seem to know the menu very well. He gave a virtually identical description of three different dishes. Lastly, I ordered the special cocktail and asked for an additional shot of tequila. The cocktail tasted like a mocktail -$18 for fruit juice and a watermelon garnish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMEw2VVlREAE",
            "text": "A+, I ordered delivery for 6 people and was able to call in for a peanut allergy and other specifications. They were very responsive and accommodating. The food was creative and flippin delicious. Oxtail dumplings? Heavenly. It's pricey but worth every penny in my opinion. What a special meal. Looking forward to dining in."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMHZXOWZBEAE",
            "text": "Expensive but well worth it. Had a lot of unique takes on traditional Chinese dishes. The staff is very friendly. They were attentive and always checked in. Make sure we were okay or need anything. Lots of good chicken options."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncThIWHVnRRAB",
            "text": "It's New York, so it'd be overpriced in most places - but that's how they've got to pay the rent here, expect it.  The food was both delicious and beautiful!  We had a truly lovely meal.\n\nThe place is extremely popular and very busy. Expect to wait if you don't have a reservation, they do have a nice bar area at the back.  They won't sea your reservation unless everyone is there (due to extremely high demand) so make sure your friends arrive on time. They do pack people in quite tight, so don't expect any private conversations or elbow room."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cU43bll3EAE",
            "text": "Two words - Mongolian beef.  Make sure you order it maybe even 2 orders of the dish. Food was excellent.\n\nService was fantastic and all dishes came out quick."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdGJ6dmp3RRAB",
            "text": "Good service, very tasty food, good comfortable atmosphere. Recommend the duck and crab dumplings, short rib and crispy beef as they were definitely the highlights although the Pac man dumplings were pretty fun. Big shout out to the restrooms - an experience in itself!"
        }
    ],
    "reviews_count": 84
}