{
    "name": "Cafe Luxembourg",
    "place_id": "ChIJXQP8fYpYwokRgkepJvnLNlc",
    "grid": "MN7",
    "address": "200 W 70th St, New York, NY 10023, USA",
    "rating": 4.4,
    "user_ratings_total": 1692,
    "phone_number": "(212) 873-7411",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTVduUjJRa3gyTW1ORU5HdDRNVEF4Y21OVk9FRRAB",
            "text": "This was the single worst service I've had in almost 40 years of dining out in NYC. The food we got was not hot, but we couldn't ask for any of it to be reheated because no one ever checked on how our food was or if we needed anything (like mustard...or more wine...or hotter food). Which was lame, but excusably so. But only three of the four of us actually got served the food we ordered. Which we could not remedy because no one (not one person) ever checked on us. And when we finally flagged our waiter down maybe fifteen minutes later, he didn't really seem to care. Which, in retrospect, was kind of how he seemed to feel (about us) from the beginning. There are plenty of other solid places to eat in this neighborhood for less money, so we will not make this mistake again."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeWQxRkZaMGxuYlROelJuYzBhakpUY0ZwMlNrRRAB",
            "text": "This popular Upper West Side restaurant has excellent food served by n a warm and clubby atmosphere. Have to envy the regulars."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eVZYcGpTM2w2VlRCSWRXTjBYM1l6Vm01MmVIYxAB",
            "text": "Crowded to over-crowded. Diner food."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKT1MyUnhVVWwwUVdoYVlXZFRMVWxWUTFFM1UxRRAB",
            "text": "One of the best UWS restaurants. But yesterday instead to go there I ordered food online. The manager and his team did the extra mile for me to get the food on a timely manner. He was also very kind to offer me extra cookies for the kids. And the most important the food was as always very delicious."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScFFrbE1kWGhXTW5aaFprcGxTMGxCVGpBeVQyYxAB",
            "text": "A classic New York staple."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdHI2a0VREAE",
            "text": "I’m sad to update my review to lower stars. Cafe Luxembourg for many years has been my favorite restaurant. My visit today was unnecessarily unpleasant. I was given a table outside and as I waited for my waiter I took out my laptop. After taking my order my waiter left and another woman walked over. She told me they had a no laptop rule and asked me if I still wanted the food I ordered. I have no issue with the rule against laptops, I was just unaware, and I think it could have been handled with more kindness. The tone was accusatory and instead of a gentle note on the restaurant’s policies, made me feel very unwelcome. I left without eating."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbFMwMUVlV0YwUW1aQ2FWUm1RMFpVV1VJd1dGRRAB",
            "text": "I remember when this place was fabulous and elite. Even though the neighborhood has changed significantly, Tim brought us back to the good old days. I sat at the bar and was warmly greeted. He made our night  AMAZING. Thank you Tim!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ2FrUmZSVTkzVEVsTVJUTlhVVmRtU0hweU5XYxAB",
            "text": "A very popular spot in the UWS with lots of regulars. We walk by all the time and decided to stop by for dinner.\n\nService is good (especially for NYC standards and considering how busy they were on a Friday night).\n\nFood is decent as well but not as consistent as I'd like for the price point.\n\nThe tuna crudo was too bright (too much citrus) but quality of tuna was excellent.\n\nWhile our burger was cooked perfectly (medium rare), we found it to be under seasoned/bland - with that being said we didn't get it with cheese or bacon so maybe that's the differentiator. The chipotle sauce is great and the accompanying fries are good but our portion was half of what we saw in other reviews online and seems like we got the end bits and pieces so lack of consistency is a bit disappointing.\n\nThe seafood linguine was very good. Pasta was cooked perfectly al dente and dish was well balanced. This dish was executed perfectly.\n\nThe atmosphere is energetic yet relaxed and while it's an elevated bistro it's not stuffy and staff is very friendly and keep their cool even when things are hectic.\n\nPerhaps the food didn't quite hit the mark for us since we went on a busy Friday and the quality control in the kitchen was not quite keeping up."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUFZqSlpPRzAyUnpkSk1HNWxibFE0TVhGRFRtYxAB",
            "text": "My favorite place on the upper west side. The service cannot be beat and the food is wonderful. An absolute gem. I come here at least once a week, and it’s lovely to sit and have a nice meal with friends. The burger is amazing. The steak frites is great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5T00wSXdWa0ZsU0ZKb1FtbGFabDl4Unpkak4yYxAB",
            "text": "Great drinks too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTFVGcFdaa2RXVFdGT09EbFdka0l5VDJ3NVRIYxAB",
            "text": "Visited Café Luxembourg and left feeling unwelcome. Manager Rachel Cornish spoke to me in a way that felt biased and dismissive. not the kind of treatment anyone should get here."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCc1RXeElSbWxoY1V4RFlVSnJkV0Z2VjBnd1gwRRAB",
            "text": "Wonderful brunch on a lovely day."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkR2JrbEhVMmwxWkVZMmQxQkJNMFV3VDBoVWMyYxAB",
            "text": "I’m not a native New Yorker, but I travel there once a week for work. I eat at holes in the wall.. I eat at fancy steakhouses… the whole gambit,. I get to see a lot of restaurants there. I don’t know what New York used to be but people talk about it like it’s a wasteland that and used to be a glimmering Metropolis. Café Luxembourg seems to be unchanged and hold standards of quality that made New York the legendary city that it used to be. There’s nothing about it that I would change."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTWExUTNURUp5V2pkTVJ5MXRNWE5LWVc1dlVtYxAB",
            "text": "We had a double date there, dare I say it's the best service we've seen in NYC so far"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzODVuLVZREAE",
            "text": "Café Luxembourg is pure magic. From the moment you walk in, the glow of the room, the hum of conversation, and the warmth of the staff wrap around you like an embrace. It’s elegant without being stuffy, timeless without feeling old.\n\nThe food is perfection—every dish thoughtful, balanced, and deeply satisfying. The beef tartare, my personal favorite, is a masterpiece: fresh, vibrant, and prepared with a finesse that turns a classic into something unforgettable. You taste the care in every bite.\n\nThe service is gracious, attentive, and kind, the kind of hospitality that makes you feel truly welcome.\n\nWhat makes this place unforgettable is the atmosphere: cozy, romantic, alive with the spirit of Manhattan. Sitting here feels like being exactly where you’re supposed to be.\n\nFive shining stars for Café Luxembourg—a restaurant that doesn’t just serve a meal, but gives you a memory to hold on to."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WeVJYUjJRa1YxU2todlowOHdkVGsxU1VwVGVGRRAB",
            "text": "Staff were very attentive and  incredibly courteous.\nThe WC, or lavatory, was totally clean and spacious.\nI will most definitely be returning!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkd1NIWkxOSE54VUVsWE0zRmpWM1ZVYVVKa1NGRRAB",
            "text": "Really tasty food and a very attentive server, Aby.\nManager Slava was in charge of the section where we were seated, and he checked on us many times, making sure that we were enjoying every single bite.\nThe special salads with cherry tomatoes and the other one with lettuce, turmeric, and asparagus were so fresh and tasty; we couldn't ask for more.\nVery generous measurement for the espresso martini."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVd1FrUkJYM013Vm05R01saDBPRkF5Yms5aFlsRRAB",
            "text": "We had a great dinner at Café Luxembourg! We started with two salads: the special tomato salad and the bibb salad and both absolutely amazing, fresh, and full of flavor. For my main course, I had the steak frites, which was cooked to perfection. To finish, we shared the homemade pecan ice cream, and it was a true highlight — rich, creamy, and delicious.\nThe service was outstanding throughout the evening. Our server was attentive and made sure everything was perfect, and the manager, Slava, warmly welcomed us and made the whole experience feel special!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSFZqaHVZMTloTmtRNGMxaG9aMnd0V2xGQ2NtYxAB",
            "text": "Just. Plain. Right. Seriously, this place knows how to 'do' restaurant. Period."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeVoxWXRRbmhYY25JemVqRk1jVWRQT1c1MVZHYxAB",
            "text": "Very good , modern American style brasserie. Relax and great great food and service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MFVraHhRblZNVVhvMFp6Z3RhSHBXWldWZlMxRRAB",
            "text": "Years of expertise and hard management work do not go by unseen a real icon of the UWS"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVFlWbHJla2ROWDBscE9FcHJNUzFuTmxCdk9XYxAB",
            "text": "Went on a Tuesday for brunch and got a table right away. Delicious breakfast sandwich, great coffee, super friendly staff, and a beautiful, charming atmosphere. Loved it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKcFpYbFNkRmRVTTJjeVRUVlRORkJXVVVFek1rRRAB",
            "text": "Thoroughly exquisite experience from beginning to end. Beautiful setting and every course delivered beyond expectations. Most of all our server Benjamin provided perfect service and made our night as special as possible. We will very much look forward to returning!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkR1ZIWjJNbGQwUnpBd1RuWnBVbmxGUWxObFFsRRAB",
            "text": "I own a restaurant. I just ate a Frisee salad with chicken breast. No kidding. I don't know how the chef cooked the chicken. But it was the best I have ever had. No kidding. Hat's off!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQldGZEZiVlpVVGsxelQyMVFNRlp3VDBoeWNFRRAB",
            "text": "Average fish"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213d1dYaDNSbUpVU2pBMFNXSjFabVpwZG5wNlUyYxAB",
            "text": "Vibrant atmosphere, delicious food, and attentive service. We’ll be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoelR6QnZOVUp1UldkQ1lUQlVMVkJWVTI5SlkxRRAB",
            "text": "Had an amazing dinner here with my daughter last week.  It certainly lived up to all expectations with excellent food (steak followed by tarte citron), delightful service and a great atmosphere.  I will be back next time I'm visiting my daughter!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dGVHVkJOMjE2YmtsbU4zWndibWxKVTE4NFJFRRAB",
            "text": "Sitting at their bar with a drink and dessert before calling it a night is among my favorite things"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRVVuRkJWVWxCWDFnME0yVkRRbUUwUjA5cmRuYxAB",
            "text": "Very nice"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdWJ6SjNObVl3VURsQmF6bFVXWEpVVG5WclozYxAB",
            "text": "Classic French bistro perfect for brunch or dinner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eFgzTlNUWE13UlhWM1lVbExOamRGVEdWWU9XYxAB",
            "text": "The food was very poor on a rainy night  The atmosphere and service was pleasant. The steak was so grisly it was inedible and the roast chicken was plated with a cold salad.\nI expected better ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUWFISlZkVlV5UldjeFFuVTFYM0J1VVdWR1MxRRAB",
            "text": "It was a pleasure to dine here! Service was fabulous!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRVZsUnhZV1p2VjFWT05GQmZibEZUYlhWelFsRRAB",
            "text": "Prototypical French restaurant with super attentive staff. Inside seating looks kinda packed. We enjoyed the weather and air outside dining. Only got to try the burger with fries. It was cooked perfect with some juice running. The fries are more on the airer side. The pair the meal with Mayo, ketchup, and house sauce which was excellent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WT04weFlSbVkxVWxGVU56WjJSbVE0Tm1NNE9VRRAB",
            "text": "Excellent food and service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkd1UyOHRiM2xFVUZKRk5GRkhWRVZYWkVGYWRuYxAB",
            "text": "Rachel is awesome. She understands hospitality and flexibility.\nWhen a last minute guest joined us Rachel made sure we were accommodated very graciously."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcVVuWjNkbXB6UWxCamRUSnNibk5SWXpkd1IwRRAB",
            "text": "It’s a favorite. For good reason. Always welcoming and good service. And food never disappoints. Love Lux."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNlJVODBNakZqYTFFM1JGUnZjMmN3YkhkQlgyYxAB",
            "text": "Atmosphere is nice. Service was  awesome, food was delicious. Nice spot to have brunch on a Sunday."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeFYwMHpRa00xVFVkS04xOTRWMjB6WkZnMWFVRRAB",
            "text": "Decorated with precision and maintained with respect, Cafe Luxemburg takes U back in time. Both the service and the food, are delivered with excellence as well. A time well expended."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQ1ozZFVOMmR2VUdaVFIxa3lYMGR4ZW1WVE5YYxAB",
            "text": "Otro level."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUlYyVjNiRGRvWDA0MlJFMU9kMjk0WkZCUGRGRRAB",
            "text": "A perfect night at Cafe Lux as always! The frisée salad never ever disappoints, and everything else was fantastic—the steak tartare, Luxemburger, and the fish and chips. We always make it a point to go there when above 57th street!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBMXJtdWpBRRAB",
            "text": "Consistently high quality over the years. An institution"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWlFtNXFSV3B1UnpoSGFWVnhOM0JUTlVkbVIzYxAB",
            "text": "Everything about this Upper West Side (Lincoln Center ish) restaurant is NYC amazing. The vibe gives ultimate NYC neighborhood restaurant (bustling).  I recommend having a martini at the bar before taking your table."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdlYwSXhPRXg1V0ZCUExVaEJlbk5QVURRMFlXYxAB",
            "text": "This place always delivers.  We live in LA, but always return to Cafe Luxembourg when we are in the City.  It's a great spot for post-theatre diining (or any dinner occasion).\n\nService and food are always top notch; and the place itself is special.\n\nCafe Luxembourg will remain on our list as a great New York spot with staying power."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNFkzQktabkZ2WkdSRVltUlVkblpzYVZOUVlYYxAB",
            "text": "I could not make a reservation during the day before 8pm. When I arrived without reservation at 545 they had a table or seat at the bar. And outside was completely free (might have been quite warm). The burger and french fries were delicious. It felt there were too many waiters walking and looking around for work. Slightly restless feeling"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oZmJXWTBZbXBqY3pWeVJVdDZSMVZVTTBkdldVRRAB",
            "text": "I have been coming here for over 30 years and there is a reason it's still here offering outstanding service, great food and an atmosphere that is relaxing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaGNHeDBXSEpwYm5sZldVeFZVMUJXV0c5S01uYxAB",
            "text": "Classic old school NY spot.. Just lovely."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psS1ZGSXhTWGRDU0RKck9VNUlhMGRYVEVRMU5VRRAB",
            "text": "The service could use some improvement, and the food was just average—not quite as good as expected. The tables are also placed too close together, making the dining experience feel a bit cramped."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbFowWlZaSGwwYlV4cGVUWmpRVzlYWXpkVWQzYxAB",
            "text": "Flavors were bold and balanced perfectly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUE1YbGlkWGRpYkRSTVoyeEdlR2xCWWtWb1kzYxAB",
            "text": "Cute French restaurant in UWS. Felt very much like a neighborhood restaurant. Sat at the bar and had cocktails (which were great), a tuna burger and fries and rice bowl."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNWNtdE9kbU5YWlVOV1JIaFlabEZ2WVVOd1pHYxAB",
            "text": "I went here with myself and my family and we had a wonderful meal. Service was fast and knowledgeable. Food was excellent, can't really think of anything less than great. I would happily go back anytime."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdFBPQXdnRRAB",
            "text": "주문한 모든 음식이 맛있었고 요청하지 않아도 커피를 리필해 주십니다. 전문적인 서비스를 하는 곳으로 생각됩니다."
        },
        {
            "date": "8달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMllfcFpnEAE",
            "text": "오전에 예약을 하고 방문했음. 예약방문인데 뭔가 복도자리를 줘서 뭘 이런곳을 주지? 라고 생각했는데 특별히 나쁘진 않았음\n좀 무난한 메뉴를 미국에서 먹어보고 싶어서 그 주제로 토마토수프 맥앤치즈 버거를 시켰고. 수프는 정말 내가 먹은 토마토수프 중 최고였음. 산미와 감칠맛이 절묘했고 사워크림이랑 크루통이 정말 맛있었음. 맥앤치즈는 꾸덕한 맛이랑 부드러운 식감+ 표면의 크러스트가 아주좋았고. 버거도 정석대로 패티+빵+샐러드가 각각 아주 좋았음.\n서비스도 친절했고 깔끔했음."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZb042cV93RRAB",
            "text": "한국인을 위한 먹방가이드;\n개인적으로 뉴욕에서의 브런치는 카페룩셈부르크가 제일 맛있었다. 종업원들도 너무 친절하고 스윗하고-\n햄치즈오믈렛 정~~말 맛있었다. 추천함!!"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeF9EOUN3EAE",
            "text": "1983년부터 사랑받아온 카페입니다 역사가 모든 것을 편안하고 신뢰감을 줍니다. 커피 맛있고 오늘의 추천 요리는 매우 신선하고 맛있읍니다"
        },
        {
            "date": "4년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2cnBUaWpRRRAB",
            "text": "분위기좋아요! 살짝비싸서 별하나 깎았어요ㅋ"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKQ0hxT3Vrc2VXRjd3RRAB",
            "text": "This was my first time here, every- time I passed it was packed- I see why. This is an upper west side staple. Sit inside outside at the bar, service is fantastic. Everyone smiles and greets you like you’re a regular. The manager even came over the see how our meal was - it’s was delish. The eggs cooked to perfection, crispy shoestring fries and a fresh salad. It was my friend’s birthday so they added a custom plate and candle. Cant wait to go back !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKZXR2cGZDaWFyeHdnRRAB",
            "text": "Café Luxembourg is love at first sight!\nOur server was fantastic—attentive and caring. The food was absolutely delicious. It’s a small, classic American restaurant with a rich history. I was happy to find a cozy table for dinner, but I had made a reservation in advance. I highly recommend doing the same if you want a chance to get a table here!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVeVNHRjFYMnQzVDBvelQxUllibTVvTW14blZIYxAB",
            "text": "This legendary spot has been around for nearly 50 years — a true hidden gem of New York, tucked away on the Upper West Side, far from the city’s usual hustle. If I hadn’t heard about it in advance, I would’ve never thought to walk in — I’m not yet skilled at spotting diamonds in the rough.\n\nDespite the place being packed (as it always is), we were greeted warmly and kindly, even though we arrived completely unannounced. They managed to find us a table — not the coziest one (near the door with the exit sign), but we didn’t mind at all. We were just excited to try the famous lobster roll and fries.\n\nWord is, the fries here are made from scratch, old-school style — not those sad frozen ones you get everywhere else. The bun is a soft, pillowy potato roll, and the lobster is incredibly fresh, served in generous chunks. At $45, it’s a solid choice for a quick, satisfying lunch.\n\nA special thank you to manager Slava, who made us fall in love with this place. Now we can’t wait to come back — and maybe even become regulars."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYWE2dXVseDlqTi1nRRAB",
            "text": "I stopped by Cafe Luxembourg this week and was pleasantly surprised. It’s such a cozy spot with an amazing atmosphere — you can feel the history in every detail. It’s one of those places you’d call iconic. Also, I had the best lobster roll I’ve ever tried in New York. And the service? Absolutely top-notch. Definitely the kind of place you want to keep coming back to."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zelNWSmFNVmROWDJoMFl6aFJkMmgzTFhaak0xRRAB",
            "text": "We were going to a show at Beacon Theatre on a Friday night so decided to stop at Cafe Luxembourg. We arrived at around 5pm without a reservation but they were able to seat us. We timed it well as about 20 minutes after we arrived the place was completely full.\n\nWe had never visited this restaurant before but the atmosphere was great and it felt like being in a bistro in France. We started with the Oysters, which were lovely and fresh. I then ordered the molues frites and my other half ordered the branzino. Both of us loved our dishes, the sauce with the mussels was so tasty and I highly recommend asking for some bread to mop the leftover sauce up. We decided to share the lemon meringue dessert, which had the perfect balance between lemon tartness and the sweetness of the meringue.\n\nService was prompt without ever feeling rushed and our server was very attentive. Prices are a little high but given the area that is to be expected. There is nothing groundbreaking with this place, it’s just classic food done well.\n\nWe also shared a bottle of wine and our total bill, including tax and tip, was $260. A little expensive but to be expected for the area. We both agreed that if we had another show at the Beacon we would probably stop here again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJazhpSXpBRRAB",
            "text": "The restaurant was super crowded, and I was glad I made a reservation through open table. I was asked multiple times if I had a theater plan, and I'm guessing the kitchen prioritizes those customers first to accommodate the showtime schedule.\n\nThe beef tartar was okay. The beef tasted a bit dry. The burger and the grilled cheese were good.\n\nWhat I really liked was the French Onion Soup. The crusted cheese on the French Onion soup bowl was a nice touch. It came off almost like a thin cheese cracker.\n\nI would go again."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbk1pTTVBRRAB",
            "text": "Located in the heart of the Upper West Side near 72nd Street and Lincoln Center, Café Luxembourg offers a delightful blend of French and American cuisine in a setting that evokes a sense of nostalgic charm. The restaurant’s warm and inviting ambiance is matched by its attentive and friendly staff, ensuring a consistently welcoming experience for diners.\n\nThe culinary craftsmanship at Café Luxembourg is evident in every dish, with each item prepared and executed to perfection. The yellowfin tuna burger is a standout, featuring a flawlessly medium-rare tuna patty with a smooth texture and exceptional tenderness. Another highlight is the steak frites, which is impeccably seasoned and cooked to satisfy even the most discerning palate.\n\nFor a truly memorable start to your meal, the French onion soup appetizer is an absolute must. The rich, savory combination of caramelized onions and melted cheese creates an indulgent, comforting dish that exemplifies the restaurant’s dedication to quality and flavor.\n\nCafé Luxembourg provides an exceptional dining experience, seamlessly blending sophisticated cuisine with a relaxed and welcoming atmosphere. Whether you’re seeking a leisurely lunch, an elegant dinner, or simply a memorable meal before a performance at Lincoln Center, this neighborhood gem delivers on all fronts."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQQ2d4SUNudDhMTTZBRRAB",
            "text": "Great cup of coffee, the food was great as was the service. We would definitely not hesitate to return if we found our selves in NYC again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOTViV3BnRRAB",
            "text": "I came here for the first time on a Monday evening at 530pm for dinner. I was able to find parking on the street outside within the same block.\n\nFood (5/5): I orders the cheeseburger medium well. It was delicious and perfectly cooked.\n\nService (5/5): When our waiter was setting my plate in the table I went up to help him and knocked the plate by accident. The cup of fries fell onto the table and floor with about 20% out of the cup. I told him it was no problem I would just eat them from the table and he insisted and said he would bring me a new cup, which he did in only a couple minutes.\n\nAtmosphere (5/5):  For being in the city, they did a good job decorating and my dinner guest and I had plenty of privacy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSU9IUXlPVms1WmxBNWQwdGFXSE5SZUhwWmVXYxAB",
            "text": "Jupiter treated us wonderfully! Dinner was delicious and everything was kept up to a T! Wonderful atmosphere, wonderful food, and perfect vibes. Fine dining service without the $$$ price tag!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOTDAyc1NLXzVubUhnEAE",
            "text": "The food here was so lovely. Went with a few friends and we ordered the french toast (the bread sort of reminded me of Panettone which was a plus for me), the salmon eggs benedict (to die for), the lux burger (very very yummy), and then the icecream for dessert.\n\nThe service was so lovely all the workers were extremely kind and looked happy to be working there. My friends and I felt very welcomed, too. Will be coming here forever!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvX1BLVnFBRRAB",
            "text": "What a lovely neighborhood gem! I’ve been coming to the UWS for years and never had a chance to eat at Café Lux. I will definitely make this one of my go-toos from now on. The service is impeccable, water glasses refilled before you got to the bottom, and the food… absolutely delicious. Thank you, Café Lux, for being such a welcoming place to sit and enjoy a meal."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM1pyWEVBEAE",
            "text": "Stopped by for a quick brunch with a friend and had a great experience. The restaurant has a charming, old-school vibe that adds to the cozy ambiance.\n\nI went with the Luxemburg burger and fries—good overall! The fries were crispy and generously portioned. My friend had the fish sandwich, which was the special of the day, and he liked it.\n\nThe atmosphere was inviting, the service was friendly, and the food was satisfying. Definitely a spot worth returning to!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdFptVnJZVFozUVhwSkxYRXllR3d6YkUxMWRsRRAB",
            "text": "This place is truly exceptional. The wine selection is fantastic, and the food is absolutely outstanding. Every visit feels like a flawless experience. The service is warm and attentive, and the ambiance has that effortlessly cool New York vibe. We had the steak frites, clam spaghetti, and pumpkin truffle ravioli—each dish was a five-star delight!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaDV1aDZ3RRAB",
            "text": "Lovely late night dinner. I was amazed at how cheerful the staff is—especially late at night.\nThe bolognese has such a warm traditional taste. We added a Chianti. Pure delight.\nI went for the special roasted chicory salad. Unusual and satisfying enough for me.\nMy husband loved the profiteroles. Luscious and tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURULS1Ub1VBEAE",
            "text": "We ate outside on a lovely warm Sunday afternoon. The french toast is to die for and we loved the french onion soup too! Excellent service, super relaxing vibe overall. Highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNHJPYnB3RRAB",
            "text": "Sadly, the inconsistency of food quality has turned a long time staple in to a hard pass. For almost two decades this was always one of our favorite places to enjoy a great meal with exceptional service. Unfortunately the food quality, especially that of the steak, can ruin an otherwise pleasant experience. The service was still top notch, but the cramped space and elevated prices are no longer overcome by the quality of the food itself.  It’s just no longer worth the risk of getting a steak that is mainly gristle.  Hopefully this is just a phase, because in a city with so many amazing restaurants, it’s hard to compete if you’re not on your best game."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeGVHRWxBRRAB",
            "text": "Always a favorite of mine for brunch...never disappoints.  It can be difficult to get a table sometimes because it is very popular but it's worth a wait.  From the egg Benedict to the cocktails and dessert the quality is top-notch.  The outdoor seating is especially cozy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPZml4YmVHMWRLR1FBEAE",
            "text": "Loved my avocado toast but the vibe was a bit weird…nonetheless it was still pretty good! I would go again for breakfast!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aHB1QlF3EAE",
            "text": "**A Memorable Thanksgiving at Café Luxembourg**\n\nOur Thanksgiving experience at Café Luxembourg was nothing short of exceptional. The restaurant’s refined yet inviting ambiance provided the perfect setting for a holiday celebration, blending understated elegance with a warm, convivial atmosphere.\n\nThe service was impeccable. Despite the demands of a busy Thanksgiving evening, the staff were gracious, attentive, and efficient, ensuring that every detail of our dining experience was handled with care. The special Thanksgiving menu was equally as impressive\n\nCafé Luxembourg demonstrated an unwavering commitment to excellence, making our holiday celebration truly unforgettable. It was a remarkable experience, and I look forward to returning to this gem in the future."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN0tYbG5BRRAB",
            "text": "Traditional French food that is tasty. Service was friendly and prompt. The wine by the glass was just OK and my straight up martini was warm. Steak was a bit tough."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdU5mSWNnEAE",
            "text": "The server never stopped by to take our order after waiting 30 minutes.  The manager finally took our order.  I was shocked that a salad with salmon cost $35 and only had 8 pieces of lettuce and a square of salmon that was the size of a deck of cards.\n\nMy Manhattan and my friend’s Vesper was good.Her fries were crispy.  Thankfully she shared them with me because I was given no bread or anything in addition to my tiny salad with salmon.   Nobody stopped by to see if we were happy or if we needed anything.   We had to flag someone down to pay.  It was a huge disappointment\n\nSee photo to understand what I got for $35."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TVFVOHpVMUYyT1hka2FFNVdaV1ZaY1VkcWIyYxAB",
            "text": "The wait staff is wonderful but we had an unpleasant welcome from a young man at the hostess station today. We had a 10 AM reservation but I called at 9:30 to ask if I could more it to 10,30 and they said they could only move it to 10:15. . We arrived at 10:05 AM and the restaurant was only 1/4 filled. He told me they would seat us at 10:15 and basically motioned for us to leave. No smile, no welcome. Thankfully his female colleague was on top of it and got us seated 30 seconds later. But the exchange left us feeling annoyed and unwelcome.\n\nTo the owners, get your front staff to be more welcoming. Your waitstaff knows how to do this.\n\nFood was great but pricey. Very crowded space. Have eaten there many times but not sure how soon we will return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwZmIwZERVRlJZVEV0SFR6STVORzlDYUVGTmVIYxAB",
            "text": "The food, the service, the atmosphere, the vibe, the location and everything is so relaxing and beautiful. Such a great energy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaE55RVV3EAE",
            "text": "The food and ambiance was great. I had the French onion soup and ravioli. The ravioli was amazing. The soup had a little less salt than I’m used to in a French onion. However, I will definitely be back very soon for the amazing food and wine!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLakxlLXhnRRAB",
            "text": "One of my favorite brunch spots to date! The staff was attentive, helpful, and friendly. The food was so so so good! I will definitely be back and I can't wait to try their chicken dumplings. If you plan to sit outside, I would recommend bringing a jacket because it can get chilly."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcWFQck5REAE",
            "text": "Overall, it was very disappointing. The food was just alright. However, my main problem was the service. We were seated and forgotten about. We saw our actual waitress twice all the while we watched her check in on her other three tables 5 times a piece before we were seen. We had to ask another hostess for our check and then after waiting for another 10 minutes with a check and payment in hand our actual waitress conveniently showed back up to collect payment and watch vigilantly for what tip she'd get. We wanted to love it. However, the environment was just so disorganized and confusing it made it impossible. We will not be going back.\n\nReply to the owner:\n\nMy apologies for my possible misinterpretation of the timeline since it has been 3 months since the dinner. I obviously have no timeline to compare to yours from your cameras. My memory has the timeline toward the end of our meal being more spaced out. Either way, I will bring attention to the 26-minute span where we were not checked on after the food was delivered. As well as the 10 minute time from the table being cleared, no dessert being selected, and having to ask the manager for our check. I hope my comments here can be taken constructively going forward.\n\nThank you"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJYnY3cXJBc0xsTxAB",
            "text": "My family and I came to the restaurant after graduation. The place was practically empty and even though they could accommodate us on a booth they gave us separate tables. Although we were a walk in, kindness, hospitality, and communication go a long way. The hostess was borderline rude and not willing to help, and the manager wasn’t any better. For people in the service and hospitality business they are severely lacking in this department and could definitely use some training. Some servers were nice so credit where is due, but if you want good service look somewhere else!"
        }
    ],
    "reviews_count": 83
}