{
    "name": "Da Capo",
    "place_id": "ChIJFfd0TolYwokRNGGQO3ualC4",
    "grid": "MN7",
    "address": "322 Columbus Ave, New York, NY 10023, USA",
    "rating": 4.5,
    "user_ratings_total": 483,
    "phone_number": "(646) 882-0197",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS2MyOHdVWFowYlRsd1J6ZDVjM2t3VjNJeVZYYxAB",
            "text": "Wonderful \"25th\" birthday celebration; From the moment we arrived, the team invited us into our home away from home; The atmosphere is superb -- house music just perfect, and we were able to bring our own soundtrack to play because we rented the back room.  Atmosphere was so sophisticated that we didn't need to decorate, and the food and drink OUTSTANDING!!!!! Thank you to Craig -the visionary at De Capo, and Johmmy and Rachel, who facilitated our party, with their energy and joyfulness, the evening was perfect -from start to finish!!!!!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaFRUUkJhREJaT0Y5UWFVeFlSamMyWWxwM05tYxAB",
            "text": "We had a great experience here hosting a corporate networking event in Da Capo's back room! Craig the owner was extremely attentive and helpful with picking the menu and creating a good atmosphere for the event. Definitely would return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNFdXRm9UalZQZFRsd1J6VkxNbWxsYkc1MVYyYxAB",
            "text": "Best bar in NYC! Great drinks, great food and above all the best staff! Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adExXdEljMEpYYTJKeVZIWnlSVEJOUVRSSlkxRRAB",
            "text": "Amazing place, amazing drinks, the best and the kindest staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SblpIaFlOVFJSYkcxV2NtUTFkbW8wVjFsRU5VRRAB",
            "text": "Amazing cocktails and the sweetest servers! Especially love the big in japan 💜💜💜💜💜"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQmEybHdXRGRKVmpOWVMwdGtjMmRmV1VabVNYYxAB",
            "text": "30 years living in the UWS and truly horrid experience. Da Capo was suggested on the Open Streets due to a lovely live singer so I thought what I great way to have brunch after church w my aunt. Blatantly ignored by the owner, Craig (even got his name bc he worked all other tables) the whole time! Our server London (first day) was lovely and attentive thruout, even brought to owners attention the fact that our table was wobbly. He didn’t even bother to come over (which as you read you’ll know why this bothered us). Worked all 5 other outdoor tables but ours. We waited 30 minutes for 2 drinks. Waited another 30 minutes for our food while seeing the owner continue to work the rest of the patrons where we finally had enough and decided to leave (no food in sight!). Truly disheartening experience for my aunt who was heartbroken to have received such service or lack there of in our own neighborhood. Do not support.\nNote the common theme in the negative reviews."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKazd5NjJnRRAB",
            "text": "2025 UPDATE: I visited for the first time in over 6 months and the bartender recognized me and recited my typical cocktail and kale salad order. Impressive and i felt special :-) ORIGINAL:A favourite in the neighbourhood. I love the kale salad which is shredded with little bits of toasted tortilla the give it a fun bit of crunch. Cocktails are well done. Nice atmosphere cozy but classy. And always friendly staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaFRWRkVWVFkzZUVwS056bHhVSFptT1ZkSmNWRRAB",
            "text": "Stopped by Da Capo for a coffee, loved the cold brew! So refreshing!! jam filled croissant was good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT2VVUmtTakpITm5selRtOXZNazlvYjBsZmRHYxAB",
            "text": "Dive bar done right, local drafts, peanuts, and bartenders who chat without hovering. Their pickleback shot (with house-pickled jalapeño brine) is legendary."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdVNYZDBTSFJJUkVsc2F6QkNWbVUzYVRaQ1RHYxAB",
            "text": "If you’re in New York, you would be remiss not to try this restaurant/bar. I am a Canadian and like to visit NY annually, and Da Capo is an imperative stop on every trip. You MUST try the tortellini.. but every item on the menu is worth trying, including any one of their signature cocktails. Also, staff is top notch - Tay, Jahmi, Rachel, and Jay… all wonderful people. Stop in and say hi! 10/10 would recommend!! ⭐️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeE1FUTJkRUkwVFdKVVdXUldObDlRY2taQmFWRRAB",
            "text": "We had an amazing cocktail experience here. Love the drinks and ambiance was something super classy. Mixologists who balance creativity with classic techniques. The smoked maple old fashioned arrives under a glass cloche, pure theater. Happy hour oysters are shucked to order!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNE9VbHVjekUwVFZkQ2VYaHJjbkJSUm5KQmJtYxAB",
            "text": "Great spot. Kostas makes an amazing coffee and makes Da Capo an amazing place to hang and work from"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWM09GSnNNMHBtUVRoVFVHdDNWWFZzVEdneWRuYxAB",
            "text": "Delicious drinks and pasta!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQT3lfWks1N1pXZE1BEAE",
            "text": "I think this is the best cocktail bar on the UWS. I love the vibe here - it has the energy of a downtown bar. The service is terrific. Shout out to Vlad behind the bar who always takes great care of us!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQclVnOVhQMnVXcXRRRRAB",
            "text": "Best chicken sandwich of my life!  Also, goes perfect with the espresso martini - which is also the best!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbDRPM0RREAE",
            "text": "We had amazing drinks at Da Capo. We shared the Kale salad which was delicious, fresh, crisp. We had dinner reservations elsewhere, or we would’ve stayed for dinner. It was so good!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeW9fWTR3RRAB",
            "text": "I have been here twice, had a wonderful omelette and cold brew iced coffee that was excellent. The second time. It was just for coffee, but I think it was shift change so it took a little bit of time for the staff to notice me. Then they told me that after 4 PM coffee wasn't available. I guess it makes sense to avoid caffeine too late in the day."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeXViMUdBEAE",
            "text": "Drinks were great. Vibes were great. Everything just took really long."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbS0tVm9nRRAB",
            "text": "We came here for some drinks and they were delicious. The vibe was chill/darker ambience. Relaxing"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNEt5YnZRRRAB",
            "text": "Da Capo, located on Columbus Avenue, is a nice spot for a cocktail on the Upper West Side of Manhattan. My partner & I recently visited for the first time, as we were headed to Jazz at Lincoln Center for a show in the evening and were looking for a place to stop on the way over. I'm giving 5-stars for the service, as the bartenders at Da Capo took excellent care of us during our visit. In terms of cocktails, I'd give 5-stars for their drinks as well - their Hauntingly Beautiful + their Yellow Jacket were delicious!\n\nHowever, I'm only giving 3-stars for atmosphere + food, as my boyfriend & I were not super impressed with either. The food was decent in that it hit the spot, but we didn't find the dishes totally mind-blowing for an UWS restaurant in Manhattan. We tried the Arancini al Formaggi, Lemon Hummus, and Margherita flatbread. Each dish was good, but felt relatively basic in presentation and quality. In terms of atmosphere, I think the photos online presented a more romantic vibe. We sat at the bar when we arrived, and it didn't seem to be what was presented on their website or via Google's photos. :-( I wonder if it would've been a little more quiet and cozy in the back? This was just our perspective.\n\nOverall, we had a good experience, but it wasn't outstanding or particularly memorable. Still, probably worth a try if you're looking for a place to eat + drink in this area!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbWFtX1dREAE",
            "text": "Mino was outstanding and a lovely bartender, he had a welcoming attitude and made me feel great thank you. I’ll definitely be back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaW9TdHFnRRAB",
            "text": "Absolute vibe, dark lighting, amazing drinks. We had express martinis, mezcal, pisco sour, old fashioned. Highly recommend asking a server their favorite and you won’t go wrong."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBc2FybmVnEAE",
            "text": "This place is 10/10"
        },
        {
            "date": "8달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMGMtNWpRRRAB",
            "text": "Locale molto carino ed accogliente!\nLa barista albanese è stata molto gentile, anche se era il suo primo giorno di lavoro è stata molto accogliente e professionale! È bello vedere questa complicità tra italiani ed albanesi anche fuori dall'Italia!! Complimenti! 👏🏻\n\nTorneremo sicuramente!! 🇮🇹"
        },
        {
            "date": "8달 전",
            "language": "de",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBa2V5MGFBEAE",
            "text": "Café war lecker, allerdings Bestellung vertauscht. Wurde aber sofort bei Nachfrage verbessert. Insgesamt 6/10"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeXF6ZzlnRRAB",
            "text": "Very Nice and cozy"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbmItV2VnEAE",
            "text": "One of the best burgers I’ve had in NYC accompanied by great cocktails!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfazVyZlFREAE",
            "text": "Ok I am impressed with this place.  Order the Salmon burger and it was delicious and an amazing portion of Salmon   Old Fashion well made by the bartender. Great brunch\nMr. B"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfN1BPVXdnRRAB",
            "text": "Amazing cocktails and atmosphere.  10/10 would recommend."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2czhuM3FnRRAB",
            "text": "Great vibey neighborhood cocktail bar!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2czRtc2N3EAE",
            "text": "Great happy hour"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MU5mZ3lnRRAB",
            "text": "Craig was absolutely fantastic in coordinating a private event. If you are looking for a space for anywhere from 10 to 45 people on the UWS you should absolutely reach out to Da Capo and work with Craig."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dHBlRXd3RRAB",
            "text": "Amazing espresso martinis and they do a special one with bourbon that was delicious! A fresh take on the cocktail! Service was great! Arturo is an awesome bartender!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eG9Ia29BRRAB",
            "text": "The cocktails here are fantastic, with the Big in Japan being a standout. The space is lovely with an intimate ambiance."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbDZtNk1BEAE",
            "text": "This place is amazing. By far the best cocktails in the upper west  side."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbDZMV1dBEAE",
            "text": "It's my new favorite neighborhood spot. I'm addicted to their cappuccino, food is really good, and the atmosphere is excellent!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdzc3YUx3EAE",
            "text": "Cofffee was so bland. Would not recommend"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdGZLaUt3EAE",
            "text": "My friend and I stopped in for a bite last night before a concert at the Beacon. As always, the food was delicious, service was impeccable, and ambience was perfect. Always a great experience at Da Capo. Never disappoints!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzekk2STV3RRAB",
            "text": "My husband and I came here last night with friends and I have to say the atmosphere exceeded my expectations. The customer service was impeccable and the food matched we got salad and pizza, basic items on the menu but they were executed perfectly. I always feel you can truly judge a restaurant on the equality of the most simple menu items. We definitely be going back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbThYQ3FRRRAB",
            "text": "Great spritzes & coffee drinks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubjYyMUt3EAE",
            "text": "I recently had my engagement party at Da Capo, and I can say with full confidence that I made an excellent choice. I booked two of the spaces they offered: the back room and the lounge, which comfortably fit a little over 40 people.\n\nThe staff were gracious and accommodating. The food and beverages were delicious—I highly recommend the Arancini balls and their 'Big In Japan' cocktail, both of which were hits at the party. What blew me away was their openness to explore gluten-free options, which was helpful since my family is allergic to gluten.\n\nAll my guests loved and complimented the space, with some even stating that it was a hidden gem on the UWS. We found it easy to move around and mingle with other guests in a space that felt intimate but was large enough to avoid feeling cramped.\n\nI had a great time working with Craig to organize and collaborate on the event. He ensured that I had nothing else to worry about on the day of the engagement. Overall, I happily recommend this place for your strong consideration. My guests and I had a beautiful evening at Da Capo, and I'm sure you would too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNWRhenNRRRAB",
            "text": "I came here for a few drinks one night after dinner nearby. Very nice place, not too loud so it was good for conversation. The back area if very cozy and the drinks were delicious. Would definitely go back if in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNWRUeVZ3EAE",
            "text": "The burger is always perfectly cooked, and I haven't had a bad cocktail yet.  The bartenders are friendly, and so are the patrons at the bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIajlTQUd3EAE",
            "text": "Really disappointed. Low quality service, mediocre food, basic cocktails, a lot of money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbXZlSE1BEAE",
            "text": "Da Capo is a staple neighborhood spot on the Upper West Side. The service is exceptional, with a staff that consistently exceeds expectations. The food is always delicious - my favorite is the salmon burger and the kale salad also the crab cakes are amazing! You can also order a pasta dish without breaking the bank…\n\nThe cocktails are also so good and very creative, my favorite is the Big in Japan.  I've never had a disappointing meal or even experience there. I also appreciate that it transforms from a coffee shop during the day into a vibrant bar and restaurant in the evening. Lastly, it’s also a great way to meet people especially neighbors and I’ve made plenty of friends by going to da capo !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINHZxNmdBRRAB",
            "text": "The berry tart was totally frozen, and the side strawberries tasted like onion. The bourbon and aperol tasted off. So disappointed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIam9pRDZ3RRAB",
            "text": "We had a wonderful time! It was a birthday celebration!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bmZXU3dBRRAB",
            "text": "Oh my gosh this sandwich!!!! Not to mention the best ~and strongest~ cocktails we had all trip. Stopped for lunch, it wasn’t too busy and we didn’t expect to be blown away but we were wrong. Excellent!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3c09qTzRBRRAB",
            "text": "Hosted a party at De Capo’s back room and they are incredibly accommodating! Food and drinks were fabulous and our server was attentive. Will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMXFqcE9REAE",
            "text": "Salmon burger was heavenly. Putting this on here as my good deed for the day—no one should miss out 🤤"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWekpfQ0h3EAE",
            "text": "What an awesome concept. A coffee bar in the morning, then Da Capo converts to a cocktail lounge at night. I stopped by in the afternoon for a cappuccino, and both the service and coffee were outstanding. We will definitely have to return for lunch or a cocktail. The space is beautiful. It has a great high-end, downtown type feel to it. A very cool place to grab coffee."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwamE3YjhnRRAB",
            "text": "Really enjoyed a date night dinner here!  The kale salad was a perfect appetizer. The salmon burger was absolutely delicious! The salmon and col slaw were perfectly done. Wedge fries were well seasoned! My husband enjoyed the burger! We had a slice of the grandma pie for desert which had a light lemon taste to it, a refreshing dessert. They are known for their cocktails so I tried a cucumber one that I really enjoyed!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdHVuWkp3EAE",
            "text": "Great ambience for a date or friendly, intimate gathering. Wide range of uniquely named cocktails. Classy decor. Professional and friendly staff.\n\nFood was tasty but when paired with all the above it just makes even more of a favorable impression. The depth in terms of how far it goes back allows for a difference of seating but still feels at times as if you have the place all to yourself.\n\nRecommended with enthusiasm."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobDVxWlZ3EAE",
            "text": "Understated café with excellent italian espresso, delightful cakes, a lovely local feeling. Discovered this on one of my walks in the upper west side a few years ago and have been a regular here ever since. I still remember the first time I came here, nestled at the bar to knit with lemon cake and a cortado, overhearing the conversation of a couple of seemingly-regulars chatting with each other and the bartender. The lemon tart is incredibly light and fluffy, not too sweet, unique and probably the best I’ve ever had. Some of my other favorites are the berry cake, cortado, iced mocha, and iced americano. The baristas are also really friendly, no matter how busy the café is. I’ve taken nearly a dozen friends to Da Capo (on separate instances, of course), and definitely want to come back sometime in the evening to try the espresso martini and other cocktails."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyby1iN2lRRRAB",
            "text": "I have never had coffee here, but have been here later at night when it becomes a bar. I ordered a few of their specialty cocktails like the Carribean Roast. It was a fantastic cocktail. There was so much flavor that I had to get a second,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSenVMdXVBRRAB",
            "text": "This was the best spot I have been to in NYC to be honest. Great chill atmosphere with great drinks and great appetizers. Veal meatball and Caprese were spot on. Also the bartender @cocktailartillary was awesome!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDdWN2RUt3EAE",
            "text": "Generally disappointing. The quiche was heated in a panini press and was full of chunks of fat. The \"pine nut\" lemon tart was clearly covered in almond slivers not pine nuts and tasted like uncooked starch. It was also enormously expensive.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1ZzdxZjNBRRAB",
            "text": "Truly loved the vibe at De Capo. My Salmon burger was perfection. Arrived with a large group and received impeccable service from Tay the entire night."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvX3FIc3JRRRAB",
            "text": "Really upscale feeling place thats a Cafe by day and restaurant/bar by night. It feels uptown and yet super low key and intimate. The food is wonderful and the staff is really great. Highly recommended"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndk1QQjVBRRAB",
            "text": "I’m editing my original review: I’ve tried coming in here twice now in the past 2 months, and both times I gave up after waiting forever and didn’t receive so much as a hello, how are you doing or a glass of water sitting at the bar. Both times there were plenty of waiters and baristas around doing something, but apparently attending to customers was not one of them. I will never come back here again! And I can’t recommend this place to anyone anymore!! Shame.\n\nA fabulous new coffee place that is just what was needed in this area! Excellent coffee and pastries. Try the apricot croissant (not pictured here) - it’s marvelous! Five stars for knowing what a “babyccino” is. 👌"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXM3BpVWt3RRAB",
            "text": "Great coffee, good space to work in! There's a scaffolding out front that blocks some of the sunlight which is a shame. Would still recommend the coffee!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0a0t1b3BBRRAB",
            "text": "Swung by this place to grab a Latte and do some work. Wonderful place, great atmosphere, owner was very friendly, and the Barista made me the best Latte I’ve ever had.  My only regret is that I didn’t know about this place the last time I was in NYC."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3LWNudHNnRRAB",
            "text": "Excellent neighborhood cafe with phenomenal service. A wonderful happy hour location as well."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnZy1MRml3RRAB",
            "text": "Great new spot in the neighborhood! Excellent cappuccinos and very friendly service. Will definitely come back during the day for coffee and in the evening for some cocktails."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2Z3RxOEVnEAE",
            "text": "Real Coffee in a Real Coffee shop.\nSo much better than S.B.\nTake some time to enjoy your Coffee sit a moment. Start your Day. 😍…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaczkyZHhRRRAB",
            "text": "Great find! I wanted to stay in my neighborhood, rather than traipse all over the city for my birthday celebration this year. We had a small group of 9 people. We sat in a separate room in the back of the venue. It was really pretty, nice cool art on the walls, cozy, comfy with perfect lighting and music volume - ahhhhh. The owners just get it - in terms of making you feel like you’re in your own living room but with a real vibe. The menu worked with some great sharing plates, the drinks were very good and the service, patient and prompt. A winner for the neighborhood! Will be back and recommend it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWNmNHOHpBRRAB",
            "text": "Very nice surprise!\nI stopped in just because it looked like an interesting spot. Excellent place for a Quiet little meeting, too. All I had was a Cortado but very nicely done. After seeing the other reviews on the food and drinks, I will definitely return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyd191d29nRRAB",
            "text": "I absolutely loved Da Capo. The ambiance was so cute, especially the room in the back. It's great for a date night or just to grab a drink with friends. I highly recommend the quattro formaggi flatbread pizza for anyone planning to check this spot out. All-time favorite dish!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzcXJ2UTlBRRAB",
            "text": "Full bar cafe. Excellent service. Amazing dessert options as well as food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1dm9tei1nRRAB",
            "text": "Came here one random day looking for a good happy hour spot. Prices were decent and drinks were delicious! The bartender was knowledgeable and friendly. The atmosphere was great and I will definitely come again!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMWUzZGx3RRAB",
            "text": "A friend who lives in the neighborhood invited me to this great neighborhood spot. \"Hidden gem.\" Very cool back-room/dinning area. Warm, inviting atmosphere. Nice crowd. Mix of young and old. Tasty cocktails. Good wine selection. Delicious small and large plates. I can recommend: Pasta Bolognese, Meatballs, Eggplant cake, and the Crab cake.\nI will go back to try the burger."
        }
    ],
    "reviews_count": 71
}