{
    "name": "Water & Wheat Upper West",
    "place_id": "ChIJNzxnVXlZwokRAkzhCqiIrtQ",
    "grid": "MN7",
    "address": "2418 Broadway, New York, NY 10024, USA",
    "rating": 4.5,
    "user_ratings_total": 19,
    "phone_number": "(646) 386-7424",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWYVYyNVpVV3BMZEVWSlMwRkNhRkJuYkhSVE5HYxAB",
            "text": "Wonderful new Italian on the UWS.\nJust went there for lunch today. I had the carbonara made with 3 yolks. It was one of the best I’ve had in the U. S. It had the right amount of sauce and guanciale with wonderful flavor.\nMy wife had the eggplant Parmesan which was large enough to take half home.\nThe pour of the red wine was generous and my cortado finished the meal off perfectly.\nWe’ll definitely be back!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1T1pDMVdURUZ5WjBkQ1pUTkxPRXA2VVVWalJrRRAB",
            "text": "Just the most fantastic lunch find! Have been here twice this week for their lunch specials. The panini is stacked and huge- fresh baked bread and the best atmosphere. I can’t wait to be back for dinner. Also, you can’t beat their happy hour wines 11:30-5:30 everyday!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMGNsRkZVMU5yWkdObmRGQlhTVXhhU0U5Q01YYxAB",
            "text": "This cozy Italian spot delivers beautifully crafted fresh pasta and artisan flat-breads in a warm, inviting setting. With a modern twist on traditional cuisine, every dish celebrates the simplicity of “water and wheat” done right. An excellent choice for a relaxed night out or special occasion in NYC"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMFRraGljMmM0TkdoS1lsbEJSMU5PY25SYVFVRRAB",
            "text": "Excited for this new addition to the neighborhood and they’ve done a nice job with the renovation. I’ve so far just had lunch great special of soup of the day (cauliflower this time) and lightly toasted sandwich (classic Italian), both delicious. They have a happy hour and lovely vibe. I’m looking forward to returning for dinner."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVlJrMDNiSGhMZEVOR2NUSmFTRUpwVEVGTVdXYxAB",
            "text": "We stopped into Water & Wheat and sat at the bar, where Jason, the bartender, took great care of us! The food was absolutely delicious, especially the flatbread. We’ll definitely be back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MVdtTlpSVXN3VTJJM1JHOTZiRzFpWVY5WVMzYxAB",
            "text": "The pasta here is great!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210b2JTMVlla000YXpsRk9GZHdNVk5IWVZCRVgwRRAB",
            "text": "Extremely disappointing in all categories….service was awful many staff members with no experience or accountability"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kV1UzcHhRVjlXYTBaa1pHcEpVMVl0V25CSk5tYxAB",
            "text": "Just visited Water and Wheat and I’m already planning my next trip back. This is exactly what the neighborhood needed  a modern Italian spot with soul. The pasta is clearly handmade you can taste the difference the ingredients are super fresh, and the menu strikes the perfect balance between comforting classics\nthe ambiance is warm but stylish perfect for a date night, a dinner with friends, or even a solo treat. Service was attentive, friendly, and made us feel right at home."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SS2R6QjRTemt6WjFCd1FYWTVRMVI1UVVrM1ZFRRAB",
            "text": "I was very excited to try this new spot on the Upper West Side, but unfortunately it was a major letdown. The service was rushed and inattentive, the food was very obviously reheated  and premade — when I asked for a side of extra sauce, they said it wasn’t possible. Very very poor service. we were basically pushed out of our table as soon as we finished eating. Our table was crammed next to another and you could barely get out, with hanging vines literally brushing into our plates. Disappointing overall and really not the experience I was hoping for. I will not be coming back. This restaurant has a lot of potential but clearly poorly ran."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNFJucHZOMkZvTmpsTGNIaHhTblZCYlRKRlJXYxAB",
            "text": "Really good place. Solid food. The carbonara was over-emulsified, but almost nobody gets that right. Otherwise? Aces!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSVNHdDBXVFEwYkRKRlZqTjRObGczUVc1WU4wRRAB",
            "text": "Good food, service feels like run up. Potential for 5 star with small effords"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTWJ6Qk5TM3BTU0dWRVFsOHdSMnR2Y25OYU1uYxAB",
            "text": "Nice place! Just book early so you’ll get a nice spot."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMVpIWk1URVZyWlhrdFNVaHRkMUV6UkZOV1JFRRAB",
            "text": "I have absolutely loved this place on the upper east side, and I am so excited that they are opening a new location on the upper west. This location is much more upscale than their first one but the food is just as good. Great for a date night and or an easy night out with friends. I strongly recommend their homemade pasta along with their fantastic sauces. PS they should add the meatball flatbread back to the menu ;)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReU1HaDFWMGRQWnpZMGFIUmlkRVJLVEV0cVRFRRAB",
            "text": "I stopped in here randomly tonight after seeing it had just opened and was really impressed by the extremely friendly service and fantastic food. The cacio & 3 peppers I got was easily one of the best dishes I’ve had at a restaurant in a long time—I loved the inventiveness of adding Sichuan pepper to an Italian dish, and the homemade pasta made it exceptional. I’m excited to go back and try more of the menu."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeWVWZHlaSGxZVDNKVFJGbFZWWGQxV0VSaldFRRAB",
            "text": "Brand new cosy Italian place, much larger than the one on upper east side, enhanced menu, great wine selection. No waiting time. Quick service. Can't wait to visit the place again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMVRsbHBWRmRCVUhabVlYTlJSVlJQU2pkd2JrRRAB",
            "text": "I stopped by on opening night for a glass of wine and excuse to get out of the house with the puppy ;) everyone was so incredibly kind and my waitress Melina made me (and George the puppy) feel right at home. I was seated immediately (outside, as I requested)- and served right away. Great neighborhood spot, and plan to be a regular! Did I mention the menu is 🙌🏼"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObVZqa3liRlJDU1VscWFsZHViVU5uTVRaemVGRRAB",
            "text": "Really excited about this place. When is the actual opening? We can’t wait."
        }
    ],
    "reviews_count": 17
}