{
    "name": "Lokal Mediterranean Kitchen",
    "place_id": "ChIJc7n6cYVYwokRv_AbO5bS33k",
    "grid": "MN7",
    "address": "473 Columbus Ave, New York, NY 10024, USA",
    "rating": 4.5,
    "user_ratings_total": 1039,
    "phone_number": "(212) 595-5554",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdVRYUnBURlkzT0RnMGVsSm1WVXQ0Y25Wc1dFRRAB",
            "text": "Wow!\nFood 10 out of the 10\nWere very satisfied"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVM1IycDFXVkpvTUVSbU5XUXpha05JYVVzM1VrRRAB",
            "text": "Great Mediterranean food with authentic Turkish dishes!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdlVWbFpOMFJyTmtKelFVaFRTMWxOTjJKV2JWRRAB",
            "text": "I just finished dinner with friends at this restaurant. The waiter's service was good, but the food was absolutely terrible. However, the prices were extremely overpriced.\nI can not recommend this restaurant to anyone."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWk5GbzNiM1prWVd4Zllsa3dXSEIzYkRsUk5tYxAB",
            "text": "You have to be really good, or special to survive in NYC.  Lokal is both.  Food is luscious bronzino is superbly prepared and reasonabley priced at only 39 for a large whole fish."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa1RrdEZkRE0yUkRaNE5EUTNhbkJWWkhCeVYxRRAB",
            "text": "Tasty food with large portions in a nice atmosphere"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVVFrcHhRazR3UkV0TVVqUjFXREEzZWs5U00wRRAB",
            "text": "the pumpkin dessert with tahini was outstanding"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRFFXaDRURXRyUjBaRGVrVm5aSGg1TnpoblozYxAB",
            "text": "We ordered kids chicken strips with fries, manti and chicken soup. Everything was tasty, although i find chicken soup to be thicker than usual"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUWIzZFpiMUJtU25kaVlTMUlkVTVYYVRGb1lXYxAB",
            "text": "Baba ganoush and hummus were best I've ever had. Gluten free options clearly marked. Definitely will come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWWQwMVdRblF6U1c5dU1qZDFjMUkzVW1FMVVuYxAB",
            "text": "The fresh, hummus, labneh and babaganosh were tasty but the cabbage wrapped lamb and rice was tasteless."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNVoyNTBTRzFzWkhkNGNuSkNZVWhzTUhOclduYxAB",
            "text": "Mediocre, expensive. Plenty of far better places around."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U2VVbHNNRW81ZEdkb2QxYzFTelJ2VFV3eU5IYxAB",
            "text": "We had an amazing brunch at Lokal Mediterranean! The staff was so warm and hospitable, and they went above and beyond when I asked for a birthday treat for two of our friends, it made the whole experience extra special. The food was fantastic! I had the roasted chicken, and it was so flavorful and perfectly done. From the service to the atmosphere to the food, everything was top-notch. Definitely a place I’d come back to for brunch again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1M2VUSlpkakZhWDB0dmJESmFjbVEwTjJsRVZHYxAB",
            "text": "10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeVdWbEtSbEJGTjNsZlkzZE5aM2xuTUhSTlpIYxAB",
            "text": "Perfectly nice. Nothing special, nothing wrong. That's about it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WmFtRlJkMUpuUWxCUlNYRnBOMWs1T0ZaMFozYxAB",
            "text": "Wonderful restaurant with fresh delicious food. Friendly staff and a great atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GZlNqSllhRXd0WjBoRmFVaHFjRU5mTVZOUlFuYxAB",
            "text": "The interior is very nice and the staff are friendly. I wasn’t a fan of my main dish (grilled meatballs), but the second dish we ordered—manti—was good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUFdHWlNZVkZNYlhoUE4waHZlVXd6TUdoaU4zYxAB",
            "text": "Just wanted drinks and small plates after Natural Hostory Museum and this was perfect."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKME4wdHlVRVZhVW5od1FrZDNhazF4WlhwNlNuYxAB",
            "text": "Good food, good service, reasonable prices"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMFVrY3pOVWhuT1djdFpHeGtTWEpWTlZkS1QxRRAB",
            "text": "So far best Mediterranean restaurant in NYC"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kR2QwNTFaRTVsYkhoRlNVSnNTVGw2UzBOUFRsRRAB",
            "text": "Very good."
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocVJtaFNORGhsWW5Ka09FNVVTVmxJY25BemRtYxAB",
            "text": "Super adresse !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWFZVNTRkVFZXTWpWRWN6aEpPRUUwTnpSaFVWRRAB",
            "text": "Great neighborhood place. Food, service are exceptional. Huge menu. So rare nowadays ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdlNubzNSME5sTWsxTlZHOTBWblpmZG1GS01IYxAB",
            "text": "Delicious finds at Lokal! The Greek salad was refreshingly fresh, and the Virgin Mango Margarita was a sweet treat. The Falafel entree stole the show, served with creamy hummus and flavorful rice. Can't wait to come back and try more…."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMWRsSkdOMjh3U2psNlNERXdZVFppY3pBdFVYYxAB",
            "text": "Really cool spot with variety of Mediterranean diahes. We wanted a place with AC on this hot day  and they ahd it.\n\nWe started with some wine which was good..we had a taste ofnthw Greek wine which was pretty decent.. don't rake my word, I'm not a wine expert. The Chenin blanc from South Africa was really good.\n\nThe\n\nThe octopus salad was one of the best we have ever had. The ajvar was like a romesco and tasted really good. The bread was warm and topped with olive oil.\n\nThe sea bass was missing salt and the salad was lot larger than the fish. I gave the 4 because the salt flavor was missing and had to als for salt. I'm a low slat eater in general.\n\nThe staff was very nice. They gave us a  cheese cake on the house. It was lemony and tasted  little bit like a linzer tart. Very good.\n\nYes I would go back here again. It's  arealky nice spot"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeU5rSnpjalJDWDBObmRIZHJjMkk1V20xNVMwRRAB",
            "text": "Had an amazing lunch at Lokal! Food is delicious,  atmosphere is welcoming and service is great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRVkwaHpTMFUwU1ZrNVQxRXdRMjlmV1hKVVFtYxAB",
            "text": "Wonderful Mediterranean food. We eat a lot of Mediterranean cuisine and this is among the best."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0d05FeHNjbU0wYzNCa1JUWjFOemxVTW14NFZYYxAB",
            "text": "This is a wonderful restaurant.\nDelicious, fresh, healthy and satisfying food, friendly staff, and a beautiful and relaxing design. Very reasonable prices too. One of my favorite spots"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNllYZGxiMVpWYTJSalVVbFFTVkJFVmxjek4yYxAB",
            "text": "I Loved this restaurant. The chicken paillard was simple but so good! I would go back just for that chicken."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkblZUVldOV3RVYkc4MlVYQnFTRWRJVVRKa01GRRAB",
            "text": "Was pretty good Mediterranean food. The dips were definitely the best part of the meal. The actual entrees were good, but portion size was pretty small for the price."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keE16bGtTa3MzWDJkd2VuTlFiRzU0VUVFdFUxRRAB",
            "text": "Amazing food and amazing service. I'd definitely come back."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbDV5cFJREAE",
            "text": "Highly recommended ,we have been several times this location,Awesome food and  very delicious. Nice atmosphere,clean friendly."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWk5WaEVka1pCTVdwRk1GRlNPREpFZGtWVFQyYxAB",
            "text": "Platos grandes, probamos chicken y ensalada y salmón con ensalada, muy ricos. Al ser bastante en el plato pudimos compartir"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKU3h3UGF3ci0yb3J3RRAB",
            "text": "Relaxed place with good service and good food. Great service, quick and efficient.  Decent kids menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOX0JrNV9tMTlQM0ZnEAE",
            "text": "Where do I start? The service is impeccable. Some of my group had to leave early for a certain reason, and they were very nice and made their food quickly. Before the entree even came out, we instantly hooked. We got some stuffed grape leaves, and some dips. When they brought it out, it was heavenly. The bread they bring out is also amazing, and I was very impressed. They shortly brought out the entrees be a get were the best Mediterranean food I’ve ever had, and I eat Mediterranean often. The atmosphere is also amazing, and it is WELL worth the price and the time. Would recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKR1g2Tjdzei0tc1d3EAE",
            "text": "It’s my second time here for lunch. The food is very fresh and excellent! They give a nice size salad, and I had a salmon wrap which was delicious. They have a good variety, good servings and very fresh food."
        },
        {
            "date": "5달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMmRUVnhUVGt4U2tvMk1VRXhOMVp4VDNsNGJsRRAB",
            "text": "Akşam yemeğinde köfte, mantı ve hamburger yedik. Çok güzeldi. Ozan ozellikle bizimle çok ilgilendi. Kendisine çok teşekkür ediyoruz."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZXAwdjdIaEw3cU5REAE",
            "text": "Quality food, very Mediterranean, nice ambient and not too crowded"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPLXIwTF90a1BLOEZREAE",
            "text": "Chicken Shish was fantastic!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNUFZudmFRdXVIenBBRRAB",
            "text": "We had an incredible experience at this place.\n\nThe drink menu is enticing and the entrees had familiar items and adventurous ones, I got the Malti (first time) and my wife got skirt steak with chimichurri. Both were incredible.\n\nOne person in our party ordered the Stuffed Cabbage which had an unfortunate taste, wouldn’t recommend that item, but try everything else!\n\nPhenomenal restaurant and you can tell it’s well managed from top to bottom."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRGprWUdnNFBLVXJRRRAB",
            "text": "Nice spot for brunch! We got the Hummus and the Bread that came with it was great! French toast was nice and sweet! We came at around 2:15 and there was no wait!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPdkU5Zkdwejc3QnhBRRAB",
            "text": "Great food and dips."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPNzEtUEcwN3FHUWRREAE",
            "text": "When I was living here this place was my go to for delivery after the longest days at work. Their food is incredible especially the soup!  Coming back after being away for a few years and it’s still just as good!  Service is always top notch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNR2Q5c3pUdjhHU3NRRRAB",
            "text": "Reservation and seating was super easy and accommodating, food was fast, lots of great shareable plates for a group"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPQzEzS0dtc2ZQSXhBRRAB",
            "text": "We have had two large group get togethers at Lokal and both times the staff were incredibly patient and accommodating. The food is delicious and there are plenty of options for vegetarians."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOWHdrSV9UbVpXOHd3RRAB",
            "text": "Great yummy balanced diet... Would recommend for a mid eastern delicacy, close to central park."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeHRpZm1RRRAB",
            "text": "This is a very nice place. It’s very welcoming. Their appetizer plate comes with a lot of dip and freshly baked bread. Super delicious. We also liked their salmon in grape leaves. Never had this kind of dolma. Turkish tea came as it’s supposed to be. Loved it. The only thing we were missing: the desert menu. 🤣"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMHNPWWdnRRAB",
            "text": "Never fails."
        },
        {
            "date": "6달 전",
            "language": "fi",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNlBMU3p3RRAB",
            "text": "Bussin’"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvemVUSXF3RRAB",
            "text": "This place was so loud (horrible acoustics), we gave up on conversation during dinner. My stuffed cabbage was served cold, had to be sent back. Everyone found their food to be “OK.” Wine was good as were mezze dips and bread."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMm9LVnRBRRAB",
            "text": "Muy rico y ingredientes muy frescos."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveXZpZ3p3RRAB",
            "text": "I rarely leave reviews, but this place deserves every bit of praise. From the moment I took the first bite, I knew I was in for something special. Every dish was perfectly cooked, beautifully presented, and bursting with flavor. You can really tell the ingredients are fresh and that the chefs put thought and care into every detail."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSX1pYYld3EAE",
            "text": "미리 예약을 하고 갔는데 편안한 부스석을 준비해주셔서 기분좋게 식사할 수 있었습니다. 브런치 메뉴를 시켰는데 건강하면서도 맛있었습니다~! 무엇보다도 서버분이 세심하시고 무척이나 친절하셔서 편안한 식사가 될 수 있었던 것 같습니다."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJd1BxVmN3EAE",
            "text": "I went here today for dinner and was very happy with my overall experience. The food was amazing!! The free bread they give is some of the best bread I’ve eaten in my life!! I ordered a few appetizers that were delicious! My dinner which was a shrimp kebab meal..omg the shrimp was unbelievable fresh and flavorful! Overall food was of the best meals out I’ve had out in sometime. In terms of services it was attentive, but not annoying which I liked. Also, atmosphere was perfect and not too noisy where you were able to hold a conversation. I will definitely recommend this restaurant to others and next time I have an excuse to visit this area I will need to eat here again!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzM2NUZEVREAE",
            "text": "Walked in on a Saturday afternoon for brunch and the three of us were seated in a very comfortable seating at around 1:30 pm. The restaurant was not that busy, and noise levels were on the lower end.\n\nOur order consisted of Ajvar ($11), the Lokal Burger ($27), and Falafel Entree ($25). We found the food just ok. nothing spectacular, but the portion sizes were really generous justifying the portion size to price ratio. The fries with the Lokal Burger were quite disappointing - very very dry.\n\nWe ordered a hot sauce on the side and were told that its a mixture of five difference spices, including some Turkish spices. Spice level on the hot sauce was amazing. Very flavorful sauce!\n\nService was excellent and team was very friendly and welcoming. Will definitely visit again with friends and family!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueEpmSXJBRRAB",
            "text": "Fresh great quality, big portions and tons of favour, service is friendly and efficient! They have a lil patio and outdoor dining structure if you like the fresh air\nI got the grilled meatballs - great texture cooked to perfection and\nI picked 3 dips babah ganoush hummus and eggplant salad -\nGrilled chicken is tender and juicy lots of flavour and the pita is nice and fresh"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaDhlQXB3RRAB",
            "text": "Cozy restaurant with delicious food and drinks! The homemade bread was the best I've had in years. My meal was very flavorful and a great portion size. The menu has lots to chose from and the service was great. Highly recommend this place!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNFlxSlV3EAE",
            "text": "LOKAL feels like when a Mediterranean grandmother wears her Sunday afternoon jewelry on goes strolling in the park. She is casually showing off, not too much but just enough, so that you know she invested her life’s work into a poshness that most can understand but few can fully appreciate. I recommend LOKAL for brunch with friends, family, and dear loved ones of all types as well as a potentially casual spot to enjoy a meal. Reasonably priced considering the quality, and with a subtle air of posh serenity."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeXVlZXJRRRAB",
            "text": "Superb. Highly recommended! My friend and I enjoyed a lovely lunch here during a quiet holiday weekend. There's a lunch menu but we opted to go traditional menu with dips, it was hard to choose! All are yummy, a yummy tomato avocado salad, and very crisp falafel! The homemade warm bread with garlic was amazing to accompany everything. Then we moved on to dessert... cheesecake and the tiramisu!! The staff is very attentive, friendly and helpful. The atmosphere is welcoming, warm, quite large inside and out. We'll be back to try more of the huge menu. Make a reservation.\n\nENJOY!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdkxpbG13RRAB",
            "text": "Lokal was an absolute delight! We'd had a long day (with three kids) at the museum and needed to have a break with good eats. Not only did Lokal provide that but it was all better than imagined. We had the stuffed red peppers (our favorite dish) it was so refreshing with the lemon yogurt. We had hummus which paired fantastic with their house bread. The kids got chicken tenders and pizza. They loved it and we loved sneaking bites. I had the avocado tomato salad with grilled salmon: wow! A delight! So fresh and filling! My husband had the lamb burger with feta cheese. He devoured it. We all shared some baklava and the grownups a delicious cup of espresso. If we weren't leaving NYC, we'd totally return for *several* more meals. Perfect staff deserves a shout out as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMN2VqTmt3RRAB",
            "text": "Great restaurant. Excellent food and service. Also pretty healthy with reasonable portions. We are here on our way to the natural History museum and we're very glad that we did. Great little spot. Would definitely come here again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxMU5YQkFnEAE",
            "text": "Small cute Mediterranean restaurant. Made dinner reservations after our trip to AMNH. Our overall diner experience was pretty good, but we did hope the waiter was more attentive. It often felt the other staff bringing out the food and clearing out plates were more helpful and attentive than our main waiter."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aE5pMVl3EAE",
            "text": "Lovely little neighborhood restaurant on the Upper West Side.  Cozy and warm inside and truly a wonderful place for a nice dinner.  Service was slow the night I was here.  Dinner was excellent, the appetizer came out after dinner and didn’t wow me, but it it was served before the entree, it probably would have been fine.  All fresh ingredients.  I will go back, the actual dinner was that good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ai1YVWp3RRAB",
            "text": "I chose this restaurant for lunch because of the reviews. The service was wonderful, very attentive and kind. I originally wanted to try the red caviar mezzi but my server told me the hummus was a better choice. I also got the octopus to accompany it. The bread for my hummus with dill and olive oil topping was the star of everything. Nice and crisp on the outside, great olive oil used and inside was nice, soft aromatic. The hummus was ok, I’ve had better and surprised when server suggested it, this sounds plain to order here out of everything available, but he said it was good. The octopus was a huge disappointment for $19. It was small, it was over cooked and dry. Texture was like dried chicken pieces with taste of seafood. I guess I wasn’t expecting a soggy octopus & red onion salad. It was on a bed of over soaked iceberg lettuce, some tomatoe, oil and herbs. It wasn’t really edible but this was my lunch… I’d avoid the octopus. Total mean was $37 with tip - I had to go elsewhere to fill up for lunch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdk91UTZRRRAB",
            "text": "I got a chicken noodle soup for an appetizer, crab cakes for an entree, and a gelato alongside mint tea for dessert. All of the food was good, but the crab cakes were particularly really good. In addition my waitress was incredibly friendly and attentive. Overall the atmosphere was very chill in the outdoor seating area"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdHFpdmFnEAE",
            "text": "The lokal burger (lamb burger) was a standout—perfectly seasoned, juicy, and packed with flavor. The staff were incredibly friendly, making the whole dining experience feel warm and welcoming."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eHY3R3ZnRRAB",
            "text": "We came for a late lunch.  The restaurant was fairly empty.  Cocktails were in order, a variation on a gin and tonic.  We ordered an appetizer of muxed pickles and feta, which was refreshing. Main course was salmon in grape leaves.  The grape leaves were intense, so I removed most of them.  Food was good.  Price was high for what we had"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURweXN2bzNBRRAB",
            "text": "Good Mediterranean spot! The appetizer dips paired wonderfully with their exceptional bread – served hot and oily, a true treat. The Greek salad was a refreshing choice too. Definitely recommend if you're in the area or just passing by."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycmJqT2lnRRAB",
            "text": "Lokal Mediterranean Kitchen was the perfect place to celebrate with a group of 10, including a newborn. The food was amazing, and the service was fantastic. They were very accommodating to our group and made sure we had a wonderful experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsZzV1MDR3RRAB",
            "text": "We stopped in for lunch and to avoid the rain and what a treat. Cute place, friendly service, great wine pours, and a tasty lunch.\n\nThe bread brought to the table was piping hot and topped with butter or olive oil. Perfect on a cold rainy day. Nice wine options and great pours for the price!\n\nThe chicken shish wrap had lots of grilled chicken and the side salad was fresh and crisp.\n\nThe lamb burger was big and messy in a good way. Topped with a nice amount of feta and served with hot seasoned home fries.\n\nI would definitely eat at this neighborhood gem again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURleGJDc21RRRAB",
            "text": "So delicious! Fresh, fresh food, excellent drinks, outdoor seating was relaxing and the server let us sit and enjoy the beautiful Fall day in the city. The server was fantastic. Very attentive, and we even got a complimentary limoncello at the end of our meal! I had a cucumber and tomato chopped salad with feta, and The bread was incredible! Hummus wasn't recommended by my sister, she said it was bland. But everything else was so delicious! Yum! Yum! Yum!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSM2Ytd2dBRRAB",
            "text": "We went on a Saturday and it wasn’t too busy. We started with the tzatziki (save your complimentary bread for dips) and it was super fresh and yummy. We both got the wrap brunch special which left us both stuffed. All of the food is super fresh which is great and the service was wonderful too! We’ll definitely be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdzVhOVZBEAE",
            "text": "Just had a terrific meal here tonight. We (my daughter and I) shared the following: labneh dip, pickles and feta, and the lamb sautéed. The food was all prepared to perfection. The dip was cool yet tangy, creamy and with a bit of bite provided by the walnuts and the warm delicious bread. The pickles and feta included pickles, obviously but also pickled carrots, piquant peppers and cabbage. The feta was a lovely accompaniment and paired wonderfully with the pickled veggies. Our main, the lamb sauté, was very well prepared. Served with a yummy aromatic rice and cooked with peppers and tomatoes. The whole meal was simple yet extravagantly tasty. I knocked a star for the atmosphere due to the heat in the indoor dining area and the dim lighting. Seems like all of New York wants to serve food in the dark lately. And although it was only in the upper 70’s outside tonight it was quite hot inside, so much so that we left earlier than we would have otherwise.\n\nAll that aside, I look forward to my next meal at this establishment. A new favorite for sure! Oh also failed to mention that the service was terrific!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdlpxSjZ3RRAB",
            "text": "We dined outside for dinner. Amazing mezze spreads! We ordered the babaganoush, beet and red pepper spreads. The stuffed cabbage was ok– it lacked some flavor and the presentation with the asparagus on top was interesting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudm83ZUZBEAE",
            "text": "Wow. So freakin' tasty. We sat outside, and it was a beautiful day. The food is soooo good. Baba ganoush and stewed lamb is what we enjoyed, and boy, did we enjoy it! The lamb has so much flavor and is super tender. I've never had Mediterranean food like this. Our waiter was friendly, and we thoroughly enjoyed our experience. I'll keep going back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCOHZMVDdnRRAB",
            "text": "Lokal offers some of the best Turkish and Middle Eastern mezzes in Manhattan. From the excellent cocktails to the flavorful dips to an exceptionally tender octopus appetizer, we have fallen in love with this restaurant. It's worth a trip to try.\n\nThe portions were very generous. We ordered too much! Each entree was big enough for two people. The vine wrapped salmon was so juicy and paired well with some labneh, which we had ordered as a dip appetizer.\n\nWe very much appreciated that they have kunafe as a dessert. It's a very special treat to enjoy.\n\nI think the flavors here are really quite exceptional, and some of the best Middle Eastern food I've had in New York so far."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaUplWGNREAE",
            "text": "Cute Mediterranean spot! The food was tasty, especially the bread that goes with the spread! Warning-The lentil patties are served cold. They are still flavorful."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2LWF6QWFBEAE",
            "text": "This great place became an instant favorite of mine. The spreads are just so good. The cheese pastries are great and the stuffed peppers are delicious. We wanted a small dinner, but it ended up being a lot for two people. Very recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cjhud3BnRRAB",
            "text": "Had the 3-dip of baba ghanoush, labneh, and whipped red caviar. I liked the dips in that order, favorite first. I liked the whipped red caviar the least because it was quite salty -- though I guess that's how caviar is. I had just one portion of bread, because I also was going to have the grilled octopus, so while two different persons asked me on separate occasions if I wanted more bread, I declined.\n\nI ended up finishing the baba ghanoush and labneh on their own without additional bread. Don't know if the additional bread would have cost more, but it was good to see they were attentive enough to ask if I wanted more.\n\nThe grilled octopus was reasonable, not remarkable.\n\nOverall 4 ⭐ for food and service. The atmosphere was great. It was lively but not too crowded (it was a Sunday dinner)."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aWVia01BEAE",
            "text": "A fantastic meal while dining outdoors. The bread was fresh, and hot out of the oven. The french fries were crisp, soft on the inside, and not at all greasy. My entree was the salmon and it was cooked perfectly at medium-well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdlBieTJRRRAB",
            "text": "Me and fiancee really enjoyed eating here . Nice ambiance - had the lamb sojouk and zucchini pancakes.small plates ,and chicken paillard aain course . We loved the lamb sojouk and zucchini pancakes - the chicken paillard and choco lava cakes were not bad . Would come  again !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbWJ6MGdBRRAB",
            "text": "Found this place on a random walk. There is not a usual brunch menu for weekdays. (The brunch menu is only for weekends)\nCoffee and Bellini were fine and the service was very good. Our server explained the menu and made sure we had coffee a few times. Refilled our coffee for free 😄\nThe soujouk is a great dish by itself but the cheese pastries need to be shared since they are very cheese and too much for one person.\nWe shared both dishes and they complemented each other well.\nThe best part was the complementary bread super fresh, full of dill and olive oil. The smell and taste just amazing!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtc2RQZ21nRRAB",
            "text": "Tried this Turkish restaurant in New York. It seems warm and friendly.\nWe loved the vibe and decorations, but their food wasn’t my favorite in general.\nI would give 5stars for their hospitality and cleanliness, but 3stars for their overall food and drink tastes.\nThe Baba Ghanoush was good, the Pink Queen was better to my opinion and no to the beet salad.\nTheir SHRIMP CASSEROLE tasted good too\n(Prime quality jumbo shrimps, oven baked in a clay pot with tomatoes, green and red peppers, mushrooms, garlic and topped with Italian mozzarella cheese, served with rice on the side)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbklqb0VnEAE",
            "text": "We ordered 3 dips; hummus, eggplant salad and spicy veggies. They came with warm bread. My favorite was eggplant salad. We ordered cheese pastries and they were fantastic!!! We skipped entree and got desert. Kunefeh was okay. The bottom was a little burnt and dry. Turkish tea was delicious! Overall pretty good minus kunefeh."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDdGFUeENREAE",
            "text": "SUPER delicious food! All food! Everything that we ordered (fish, lamb, salad, octopus) were fantastic! Service was very fast, friendly, and attentive. No wait time on orders, bringing checks, anything. It's a gem in Manhattan! HIGHLY recommend to everyone!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNHE2RzB3RRAB",
            "text": "This is delicious! It's mostly Mediterranean food, but they make it with great expertise. I haven't tried the desserts, but the other food here is amazing! I really enjoyed the grilled shrimp and the Feta and pickle platter. It was very quiet, we came at a fairly odd time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5elA3aE1nEAE",
            "text": "Lokal was delicious! We came because we had a gift card but now we will definitely be back. Service was amazing, staff was friendly, family / friendly but up beat vibes. Music was fun too. Great spot on upper west, near the museum of national history."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoME1US013EAE",
            "text": "The food here was excellent. I really enjoyed the salmon in vine leaves. The plate came with several small bundles of salmon wrapped in vine leaves. The salmon was tender and juicy, and the vine leaves added nice flavour. The side of rice was interestingly seasoned too. Presentation was unique and pleasing. I liked how the dish was not only delicious, but also wholesome and well-balanced."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMDg3N0V3EAE",
            "text": "The food was excellent! We love their baba ghanoush — it's a must-try, so delicious. The atmosphere and decor are also very warm and welcoming. We loved it so much, this place has become our regular spot. Definitely one of the best in town for Mediterranean food!✨"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbkpTSVV3EAE",
            "text": "We had ordered grilled shrimp and chicken pillard- I liked the shrimp it was soft and tasty. We ordered it with homemade chips instead of salad, chips were like regular ones but i still liked it. The chicken should have been more juicy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OU5tWm5BRRAB",
            "text": "Got the Lokal Burger and it was amazing. The fries were very good, everything came out warn and i was surprised by the service. They were on top of it making sure we had water and that the food was good. The lamb chops were really good as well, great seasoning and perfectly cooked. Impressed with this eating spot. Would definitely recommend it for anybody, with people of all ages, kid friendly, accessible, beautiful atmosphere. Definitely coming back."
        }
    ],
    "reviews_count": 89
}