{
    "name": "Elea",
    "place_id": "ChIJk84XGIRYwokRGrW8KFlR2_g",
    "grid": "MN7",
    "address": "217 W 85th St, New York, NY 10024, USA",
    "rating": 4.6,
    "user_ratings_total": 1009,
    "phone_number": "(212) 369-9800",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkb1lUUkxZbDlvWjNjeFdUSjFXVEJMU0VwTFpsRRAB",
            "text": "I was the very first reservation when E’lea opened and this restaurant’s menu and follow up service is impeccable. E’lea deserves a Michelin Star for its consistency of upper level selections and attentive service to its customers. I am alway interested in their specials and their creative  cocktails."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKc09HbzRTVTlPT1ZGbmNtNUJSall6YURsek5VRRAB",
            "text": "Angelo is my favorite bartender! He's charming, elegant and always has a smile. He makes the best espresso martinis and  best of all he is\nteaching me Greek!  I look forward always to visiting Elea thanks to the ever great staff and friendly and beautiful environment. If you get to visit this upper West side gem. Orderthr  Expresso Martini from Angelo,! He's a wizard!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaFRuQklTR2xLWldORlYxTnBiR2xyVjBvdFUxRRAB",
            "text": "Had a great evening. Great food and friendly staff. Interesting cocktails.  Glad we got an earlier reservation - the place got filled as the evening progressed."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Jd2EzaHBWVzAxY0UwelMzTktWRXRTZVZWM1pVRRAB",
            "text": "It’s all good!! Third time going there and they never disappoint. Plus, the acoustics are magnificent."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eWRGUnRlVFJsZDJSV1NuUnZYMGg1VTFNNVZVRRAB",
            "text": "This is what I call a great dining experience. The restaurant itself is beautiful -though despite having a reservation, we were first offered a table in the basement, which we politely declined. The staff kindly seated us at the bar while we waited, and within a few minutes we were moved to the main dining room.\n\nThe service was excellent- fast, attentive, and professional-and the food was genuinely delicious and authentic. The only small downside is that when you start at the bar, you need to close your tab before moving to the table, which means two separate bills and tips. Not a big deal, but something to know.\n\nOverall, a wonderful evening- great food, great atmosphere, and a team that clearly cares. Highly recommend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CblUzTk1ZMlZ4V0hkaGVITmtTMUUyWlZock9VRRAB",
            "text": "Nice authentic Greek food in a lively setting."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweE1tRTJVbkY0YzBOeE9EZEJkamxQUlhRd2FuYxAB",
            "text": "Very elegant vibes at this place. We got three spreads, the almond-garlic was my favorite, and the pepper-feta was good as well. The moussaka was delicious — very rich and the portions were generous."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KT1pXTjRWbHBNVFcwelpFSldWSFF5TWs5SFpGRRAB",
            "text": "Yummy"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WblZucFlkM1IyUlhKWFFYaDVTQzFKU1hSellYYxAB",
            "text": "The staff was awesome and very dedicated to making the experience enjoyable. We were in Greece last year and to taste a meal that was spot on authentic warmed or hearts."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdWF6TnZhME5WZFVaV2EzbHdNMUZvUkVOcGFWRRAB",
            "text": "We had some typical Greek food like spanakopita, keftedes, tzatziki and fakes soup, which all tasted very much like the traditional version 👌\nIt is a nice and chic stop in Upper West."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wYU0ySkNlRTVwVkV0elFWTnJZMWRIT1Y5dlZYYxAB",
            "text": "Excellent food and drink options, definitely try the spreads and the haloumi. I enjoyed my wild mushroom risotto and my Paloma."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsU1ZWbFFWMk5GU2t0NE4yUk9PVmx4ZEVaRFowRRAB",
            "text": "Wonderful!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dk1sZEhSRXRUU3pGaVVYZGhMWEY0UTJSRWRVRRAB",
            "text": "Our server was great. Favorites were the beet salad and tzatziki! The mullet roe dip, tuna tartar, and royal dorade were ok. Not sure if we’d go again but it was fun vibes inside. Food just didn’t knock it out of the park. I think the host…"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabVRVMUlkR0ZzUWtKc2FWRTRWalZJWTJwTWVuYxAB",
            "text": "El lugar es hermoso y su comida deliciosa. Gran experiencia de comida griega en New York."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kc1oyUnVOREpzY3pVMlUyZExWbkpKVEdjelkzYxAB",
            "text": "Lovely restaurant, interesting food, very noisy"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5eE0tbUJnEAE",
            "text": "Its Greek"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMk5EWldSblpYWkRsNWNtdE1WbVZ1TXpsSldVRRAB",
            "text": "Excellent food. Nice atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRlRIUXhWRmQzZWpCb1ZWa3RSV3hIV0hsbmRsRRAB",
            "text": "Lovely to sit outside on a summerday"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRE1IVk1TVXBTYldOU2JVb3pkM1ZOVTNWVFlsRRAB",
            "text": "Thank you guys! You made our wedding the happiest day of our lives. Everything was flawless. Andrew was integral in creating this special day, and the staff were so efficient at helping everyone with all of their needs. The food was perfect, the celebration was perfect, everything went perfect."
        },
        {
            "date": "2달 전",
            "language": "id",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaFRIWjNWVWRuWVZsbmVGWjZhWE16ZUMxYVpsRRAB",
            "text": "Apik Temen Ya USA, Kapan Isa Mengeneh 🌎😭"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25acmFHRmZkalppVFROUVRERTFUMkl6VEVGclRIYxAB",
            "text": "We had a special event in Elea restaurant.\nIt was quite pleasant experience.\nNadia and Andrew made sure that our experience exceed all our expectations.\nThey tried to accommodate all our guests needs in the most unintrusive manner.\nIf you want top notch Greek cuisine in the highest level of service we recommend Elea as one of the New York City's best restaurants."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1blRYVTJVazVZTlcxRlozbGtRVUZPUVZaeFRIYxAB",
            "text": "the service and food is always excellent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV2VqUjBXbE40WTJRd1kzSlhOR1YzYzBoeWVGRRAB",
            "text": "Absolute fab experience. Reservations recommended on weekends, plenty of seating outdoors and indoors with a spacious basement perfect for family seating.\n\nVegetarians also have plenty of options which was surprising!\n\nWhat to order: Tasting of 5 Spreads ($32) - Skordalia stands out, Grilled Halloumi ($18), Gigantes ($16), Asparagus ($12) - all cooked to perfection!\n\nNon Vegetarians won't go wrong with Lamb Chops ($55) or Grilled Shrimp ($25).\n\nService was absolutely fantastic but our server Arthur was friendly and attentive. Very welcoming and friendly staff.\n\nWe will be visiting again with friends and family!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4QlEyNTBibWRUUWpkSFJUSkRhamxMZFVoblZYYxAB",
            "text": "Large attractive restaurant with really delicious food. Center bar area and outside dining."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUVF6aE5PSEowV0ZkZmNEUk1UMGszWldoQllWRRAB",
            "text": "For ambience,exceptional Greek Mediterranean fare and an authentic Upper West Side  scene par to non, do visit Elea.\nThe Manager,  Andreas will greet you with the inherent warm hospitality uniquely be known to the Greeks.\nMeanwhile Bartender, Anna,shakes up the perfect lychee martini with such grace and poise reminiscent of the nostalgic era visited now only on TMC movies.\nA wonderful Saturday night out to be had with friends or loved ones!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUWFVdzBTSE4wWkVSMGNYSk1WaTFVUTJ4c1dYYxAB",
            "text": "Everything and I mean everything was a 10 out of 10. The small plates, the main courses, and the dessert, wow the dessert was amazing. We tried 3 of them and they all were absolutely fantastic. I 100% recommend. The service was great also."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNVFubGtkMWxxUlZsVmFYVXhObEoxUTJWT1YxRRAB",
            "text": "Delicious spreads; huge entrees; solid mixed drinks; attentive wait staff; good coffee. Our table of 4 sat outside on street terrace; crowded environment but doable/vibrant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUGRsQnFVM1IzWm0wNU5HTmlZbmhQTW5Vek1IYxAB",
            "text": "Love this place. Great food, quick service, and lively atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WU5IcEhZVWxDUmxSZllVTkNUelZXU2xwa05VRRAB",
            "text": "Amazing- Cooking -view -\n\nservice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGM00yazJVM2hEU25sRk4wdEVhbXBTWjFORVdsRRAB",
            "text": "Fabulous restaurant. Beautiful and airy, many options for delicious food and drink, and kind staff. In addition to the photographed food I highly recommend the elea chips appetizer and the dips, particularly the Tzatziki which is some of the best I’ve ever had. The hummus is pasable for the other better dips. My major complaint is that the chairs inside and upstairs were extremely uncomfortable - I was shifting the entire meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRFpGSmlXR2x5TTB3eGFtNUtZVlJQVFRGTVkyYxAB",
            "text": "Great date spot. Food is always good too"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tndFpqQTVUMGR0UlhKcFZsUlhWSEpGVUdReWRFRRAB",
            "text": "This is the perfect restaurant, the food was amazing, the service was excellent, and it is just spectacular overall."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcGNXbHhWbVphY0hsZlVqUnJMWFo1ZERBNGJGRRAB",
            "text": "This is not only our go to neighborhood place, but our go to for Greek cuisine.  Everyone we recommend it to, loves it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kd2NEbENVMEZZVlV4V05IcGpUVmh6Y1hWamVIYxAB",
            "text": "A great dinner spot. Both the food and service are the best I have experienced anywhere. I highly recommend the \"small plates.\""
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTWVWVlFRVll0WkVsTFgweFZSMUV4TjI5cmRVRRAB",
            "text": "We went to Eléa on the Upper West Side with friends and were seated downstairs. The space is much larger than it appears from the outside, but that’s actually part of its charm. It’s beautifully designed, with soft indirect lighting that gives everything a warm, elegant glow. The atmosphere feels calm but still lively, and the service was truly impeccable — attentive without being overbearing.\n\nThe food leans Greek, but in a broader Mediterranean way — lots of fresh fish, flavorful dips, and a clean, well-balanced style of cooking. Pricing is more than fair for the quality. If I had to nitpick, I’d say the whole experience is so polished that it almost feels a little too perfect — like it’s missing a tiny spark of personality. But that’s a very minor point. Overall, Elea is a fantastic dinner option — refined, generous, and totally deserving of five stars."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdFlXWnNOR05RU214aldYTmhNMGRIUkdOQlNsRRAB",
            "text": "Food was good but overpriced for the quality, the short rib dish was very good. The server didn’t say his name and was not very kind, and he only took our order and presented the check, someone else delivered the food, asked how it was, and gave us a to go box. So, when the check came, it had presets of 20, 22, and 25, but I put in 18%. Server did not say anything as he walked away but I heard him mutter an offensive slur under his breath at me and my girlfriend. Will not be coming back. Server was tall and white, possibly had a beard."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaFJuWkRNM1ZzUVRRM1NIbzRVa1ZFUjFWQ1pGRRAB",
            "text": "We sat outside and the experience and food were amazing!\n\nWould definitely come back and highly recommend to others! Food was outstanding!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbFkyVktURGw2TURsS00zVkJOakJMVFVWR2EwRRAB",
            "text": "I hosted a birthday dinner for over 30 guests in the Dionysus Cellar at Eléa, and the entire experience—from my initial inquiry to selecting the menu, drinks, and wine—was seamless and enjoyable. Nadia and Andrew were professional, gracious, and accommodating, and they personally oversaw the event from start to finish. The entire staff was excellent. I've experienced very good service before, but there's a warmth and kindness at Elea that is truly rare. All the guests mentioned not only the fantastic food, but also the wonderful, friendly service. I’m so glad I chose it for this special occasion."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMmRVSjNVRmRvTW14WkxXWkRiMlp6V1ZBeVFuYxAB",
            "text": "Loved everything about Elea. The atmosphere, the service, the food. Everything was incredible.\n\nThe major highlights were the dips (melitzanosalta, skordalia, tyrokafteri), the htapodi (grilled octopus) and the lavkaki with lemon potatoes."
        },
        {
            "date": "3달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bFJrNTBNMVE0YTJ0YWF6QlBkSEprTFZGWmJtYxAB",
            "text": "Foi minha primeira experiência com comida grega. A moussaka deliciosa, o vinho branco geladinho e a mesa no deck criaram o cenário ideal para uma noite incrível entre amigas. Voltaria com certeza!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeFFWTmxZbVp1VkhsS2JYaFJTVWN0ZEdrMWNrRRAB",
            "text": "The food was amazing one of the best dinners I’ve had in years! I had the special Risotto and it was perfect! My server George was on point. Will definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQmJtOW9TMll5VDNSek1ITm9hR2hXVDNoS2RtYxAB",
            "text": "Was here for a fundraiser ! This restaurant was very cute and all of the snacks they prepared for the event were very tasty. Private spaces available up on request and availability. Try it out she’s cute"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SaU5FdFdMV0ZZVTFvNFRuazNTRmRRZUhWeE5FRRAB",
            "text": "Overall Okay. The food isn’t outstanding. The best thing on the table was the hummus. Service is average. It’s a busy spot, so the servers are normally quite occupied."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMWVtVlVVMWROTkVwSGF6WXliVGx2WkhGcmJuYxAB",
            "text": "Went there for a family function having a fixed menu.\nI would absolutely go again to try other options from the menu. Enjoyed my experience there."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcGIySmlaSEZhWVVJMVNXSTNTamhVYlZSQlJuYxAB",
            "text": "Great food and service. I had one of their bottomless drinks. Servers and bartenders are very nice and very attentive."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNVltVTNjbU5rWWkxZlRTMXVkMTg0ZVdkdk5HYxAB",
            "text": "food was great, service was excellent- highly recommend the short rib orzo"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oc1oxcHdZMWw0VGxReVJHaDBiSEJYY2kxZmQzYxAB",
            "text": "Love this restaurant. Get the grilled octopus, it is amazing!\nOur server Miquel made excellent recommendations"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeFJYZ3phMmhYUXpSVVIxWnFVV040U2twTkxWRRAB",
            "text": "Greek at its best.!🩵🤍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WlVrTTFMVE5sUWtSNFdYZGFURTgzY3kxVFlWRRAB",
            "text": "This restaurant is so delicious. The feta red chili pepper spread was our favorite. Also the lamb chops were great along with the cucumber chips. The only dessert we liked was the chocolate mouse thing. The cheesecake is too light. The baklava was too dry."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcWMxRk5WMk50UkVWamVscEZXVWxrY201Qk9WRRAB",
            "text": "Super cool spot with delicious food. Ask for Nikolas to be your server he’s the best they have!!"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbDY2NnV3RRAB",
            "text": "식당 분위기는 매우 좋았습니다.\n랍스타 스파게티를 먹었는데, 면은 제 스타일은 아니였어요ㅠㅠ (조금 퍼진 느낌이었습니다)\n기타 다른 음식들은 괜찮았습니다!\n다만 식당 안이 조금 시끄러워서 대화를 나누며 식사하기엔 추천하지 않을 것 같습니다."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbVpQSmJnEAE",
            "text": "I love Greek food, so I was excited to try this restaurant—and it did not disappoint! The portions were generous, and the food was delicious. I especially enjoyed the Kounoupidi—crispy cauliflower fritters.\nFrom the outside, the restaurant looked quite small, but once inside, we discovered a whole additional floor downstairs with plenty of seating. Despite being very busy, the atmosphere was lively and inviting, and the service was attentive. Overall, it was a great experience, and we’ll definitely be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaksybktBEAE",
            "text": "Hilario, the manager made a great effort to help us select the correct wine. He is very knowledgeable and offered great advice. As for the food, it's amazing, great taste and qualify ingredientes.\nIf you visit, ask for Hilarios help in selecting wine and food. It makes a big difference on your overall experience."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYOTZpSEF3EAE",
            "text": "Situated in the heart of the Upper West Side, this authentic Greek restaurant offers a warm and inviting atmosphere, complemented by a beautifully designed bar that immediately draws you in. The dining experience begins with a sense of genuine hospitality, and the culinary journey that follows is nothing short of exceptional.\n\nThe highlight of the meal is undoubtedly the lamb chops, which are perfectly cooked to an ideal tenderness. Each bite is succulent and flavorful, showcasing the chef’s mastery in balancing classic Greek flavors with precise execution.\n\nFor dessert, the orange cake is a delightful revelation. Moist and creamy, it pairs beautifully with the yogurt ice cream, creating a harmonious blend of citrus and subtle tang. The dessert is not only unique but also a perfect conclusion to a memorable dining experience.\n\nThis establishment brings a true taste of Greece to New York, excelling in both ambiance and cuisine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydnM3WVF3EAE",
            "text": "Overall: Amazing spot with delicious food and exceptional service.\n\nI came here for a date night and sat at the bar. The bartender was very friendly and recommended the best drinks. My watermelon spritz was made perfectly and tasted so refreshing. He recommended the hummus trio which was a fantastic start. We even got some extra bread to go with it because we couldn't stop eating it. The grilled octopus was also an amazing appetizer that I think everyone should try. It was grilled perfectly in season to perfection. Unfortunately we didn't get a picture of it because it It looks so delicious that we forgot.\n\nThe lamb chops were the star of the show. We got the spinach instead of the fries as recommended by the bartender. Once again his recommendation proved to be amazing.\n\nThe staff is very attentive and professional. Service was exceptional. The place looked very clean. They had a downstairs area that had a lot more space. I can't wait to return to try other things."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbE0tbUZREAE",
            "text": "We were in search of dinner after a day at the museum and we found Eléa via infatuation. Mediterranean is always a go to as it never disappoints and the reviews on Elea looked great.\nWell they did not disappoint, it was the perfect place to walk in with a group of 7 including children which was amazing and hard to come by. The venue is very spacious and has two floors. The space is beautiful and very inviting, as if you’re being transported to Greece with the all white decor and beautiful flowers at the entrance.\n\nI was most excited to try the elea chips and the tuna tartar and they were both amazing!!! The fried zucchini and taziki had the perfect taste ask texture. The crunch that came with the tuna tartar was unlike anything I’ve ever had and was the perfect combination.\n\nThe entree we opted for was the sea bass which was good but I will say the slight mustard flavor threw us off a bit but nonetheless still delicious.\nThe kids got chicken Slovakia and French fries and they loved it. The only small complaint I had was that the drinks were not consistent, we ordered a few lychee martinis and each time the taste was a bit different."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncWREU3RBRRAB",
            "text": "A wonderful dining experience with delicious food and welcoming staff. However, the tables were arranged quite close together—adding a bit more space would enhance the comfort. Also, even though we had a reservation we had to wait around 20 minutes to get seated."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc3FXSkh3EAE",
            "text": "Very soothing and beautiful atmosphere. We went for brunch and really enjoyed ourselves! The food was amazing! I didn’t get a picture of it but the spanakopita: 🤌🏾✨also the sour cherry 🍒 bellini was divine"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvODhlUGd3RRAB",
            "text": "The drinks at this place are absolutely top-notch — perfectly balanced, refreshing, and crafted with real care. Anna, the bartender, is a total gem. You can tell she loves what she does — every cocktail she made was spot-on, from classics to more creative mixes. Her recommendations were amazing, and she made the whole experience feel personal and fun. We’re already planning our next visit. Thank you, Anna — you’re the reason we’ll be coming back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcXRULWJnEAE",
            "text": "Had an amazing time with my wife — the food was incredible. I had the seafood orzotto, and it was absolutely delicious. Our server was super attentive and really made the experience even better. The wines are great too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMlBDdjBRRRAB",
            "text": "We went here for lunch and absolutely loved the ambiance and the food. Everything we ordered was so delicious. I highly, highly recommend the octopus, it was one of the best I’ve ever had. Definitely a place to visit for a fantastic Greek dining experience!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdUlhY1Z3EAE",
            "text": "I had the seafood orzotto. My two companions enjoyed their meal as much as I did mine. Professional and friendly staff. Hands on management. Choice of street level and sub level dining which offers different experiences. I recommend making a reservation."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSd3JlMGZBEAE",
            "text": "Easy to book reservations online, nice decor and friendly staff. This was our second time here and the food was delicious both times. Food was well seasoned and cooked well. We ordered the lamb shank, octopus and shrimp. The lamb shank was good but the seafood was phenomenal. Will definitely be coming back for the octopus.\n\nMy one piece of feedback is not looking on our reservation notes about dietary restrictions. The form specifically asks for this and I'm gluten free but they put bread on the table. We asked for them to take it back but would have been nice to be asked first to confirm."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3c08tRUlREAE",
            "text": "We hosted my sister’s baby shower at Elea. The food was outstanding and the service was even better. Andrew was incredible to plan with, super kind and accommodating and full of great suggestions to make the shower perfect. I highly suggest hosting your next event here!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReVlmSmF3EAE",
            "text": "Went to have dinner with a friend. We started with 3 spreads: chickpea hummus, almonds and garlic, and the spicy red pepper with feta(my totally favorite). Then I ordered the wild cod which was wonderful (I’m usually picky with seafood) and the mini baklava rolls for dessert (which they put 2 candles and sang me happy birthday🥳) My experience went beyond of what I was expecting and the vibe of the place was great!! I will totally go back!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbTlTWDl3RRAB",
            "text": "A busy, buzzy Greek restaurant in the heart of UWS. This is a perfect date spot with a huge menu, great for mezze shares or large entrees if you are hungry. They have some of the best grilled octopus I’ve had and I highly recommend the dip trio and seafood orzo! Will be back to try their fish at some point, but everything was quite filling even without a full entree."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdzhXMy1RRRAB",
            "text": "Came here with a friend for dinner and I am so glad we did. This was a 5/5 dining experience for us! All of the food was tasty and fresh! We got several small plates to try and we left full and happy. The fish and caper dip was my absolute favorite. I would come back just for that!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCOS03cWZnEAE",
            "text": "A wonderful experience from the moment you arrive to your table. The waitstaff, busboys and food runners are all very well trained and professional. The food and drinks are delectable and you cannot go wrong with anything. The lamb chops were slightly dry, but everything else was great. Restaurant week has gained them another customer."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBamVyUTV3RRAB",
            "text": "A great Greek restaurant on the Upper West Side. The food is delicious, with a nice selection of wines and well-crafted cocktails. The service is excellent, and the ambiance is inviting. They also have a spacious room in the basement for larger groups."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpN2YzQnB3RRAB",
            "text": "Despite having a reservation, we had to wait about 15-20 minutes before getting seated. It appears that the restaurant does not have a balanced handle on online reservations and walk-ins.\n\nAfter being seated, the service was very delayed. About 20 minutes in, we managed to get our order in and get tap water on the table.\n\nThe octopus is good, but the fava and accompanying garnishes are the stars. The burger was sadly dry and unseasoned.\n\nOnce the restaurant can handle the reservations to not over-stress the staff, I think it's a decent Greek brunch. The staff is friendly and accommodating. There is also nice live music on weekends."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4LVBUaUdREAE",
            "text": "Elea is an absolute amazing Greek style cuisine and a wonderful dining establishment based in Manhattan, New York.\n\nIn May of 2023, I brought and treated my wife and myself for dinner at Elea to celebrate our Happy Relationship Anniversary, and we both give a huge two thumbs up to the restaurant’s staff for providing us with an extraordinary dining experience.\n\nWe were politely welcomed by the restaurant’s staff and were quickly provided with a table upon entry.\n\nOur waiter, Rikos N treated us with the utmost care and grace. He made sure to properly document our meal orders, address our inquiries, and continuously checked with us to make sure that we were okay, that we enjoyed our meals, and that our needs were met.\n\nWe thank Rikos for his superb professionalism and great hospitality!!!\n\nBoth my wife and I loved our pita bread based appetizer, and we very much enjoyed our lamb chop entree meal!!!  We’ve definitely placed Elea among our top favorite Greek restaurant!!!\n\nIn addition to the great meal and service, both my wife and I were impressed with Elea’s cleanliness and the Greek island vibe that’s evoked by the restaurant’s atmosphere.\n\nAll in all, both my wife and I would like to thank Elea for providing us a wonderful dining experience, and for playing a big part in the celebration of our Happy Relationship Anniversary!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0Njd2ZUN3EAE",
            "text": "Came here during NYC restaurant week. Food was amazing, I ordered the gulf shrimp, shirt ribs and orange pie, Service was warm and welcoming, the atmosphere was beautiful with soft music in the background, perfect for a romantic date. Highly recommend and definitely will be returning"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbUhfTmZPdjZQcTdnRRAB",
            "text": "The service was remarkable. They all work together to make your experience worth the time and money.\nThe cocktails were fabulous - a fig martini and two fancy mojitos.\nWe ordered three tasting dips, a \"small\" plate with octupus that had beautifully cooked red onions. I highly recommend both. We then shared the lamb chops and Greek fries. Both done perfectly. No dessert, too full\n\nWe will be back. Soon and often."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxa01iOXF3RRAB",
            "text": "Great brunch place! We had the avocado toast which was very nice and the French toast which was nice, but felt like it wasn't marinated enough in the batter. As we were waiting we saw a lot of great dishes that looked fantastic, especially the burger, so we will definitely come back to check it out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiemZESG5nRRAB",
            "text": "Great food & the wait staff was very friendly!\n\nI recommend the short rib youvetsi. The meat was so tender & flavorful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGaW9tdUN3EAE",
            "text": "Obsessed! Their food is incredible! Loved the shrimp and halibut! Great decor and energy. We sat at the bar and the bartender was so nice. Would eat here everyday if I could."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cjd6UkpREAE",
            "text": "Came from out of town to dine at Elea. From the service to food and drinks, everything was beyond 5 star! Staff was very attentive, food tasted as if directly from Greece, and drinks were delicious! Will definitely fly back in town to come here again! And the place is beautiful inside!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMUlMdnp3RRAB",
            "text": "Everything is delicious!\nWent there for lunch and everything was good.\nThe live music was a bit loud at first but then it kind of made a nice background, so we liked it.\nService is nice and funny as they made some jokes around our clean plates.\nBut those plates were clean because the food is delicious.\nMy lmb chops were perfectly cooked and the fries were well seasoned.\nThe deserts were amazing as well as they are very light and not overly sweet. Just perfect.\nHighly recommend this place and I look forward to go back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQS2ZqdnlXcHJYaWh3RRAB",
            "text": "Delicious. The food was phenomenal, and the Tuna Tartare was the best I’ve had. So fresh and delicious. Not a single bite was anything but delicious.\n\nThe staff, Miguel and Pedro, were so attentive and kind and welcoming. Thank you for a wonderful experience. My fiancé and I will be back!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvalB1QktBEAE",
            "text": "Un lugar bonito, la comida es muy muy buena, sabores peculiares, las porciones generosas y el precio justo. La atención es extraordinaria. La coctelería es buena."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN2JIS2tnRRAB",
            "text": "I had a great experience with my family at Elea! Immediately upon entering we were kindly greeted and offered a few different seating options for our reservation. Hosting family in town, the ambiance was really pleasant - busy but also not too loud. The dishes were amazing - including the unique salads and cauliflower fritters. Aside from the delicious food and great service, what I truly enjoyed was the atmosphere - we spent over two hours enjoying our meal, not feeling rushed to leave and clear out for another group. These types of dining experiences are harder to find and was glad to have experienced it. I was so “in the moment” that I didn’t even take my phone out for photos! We will have to return outside of Lent to try the meat dishes too - looking forward to my next visit!"
        }
    ],
    "reviews_count": 81
}