{
    "name": "Osteria Cotta",
    "place_id": "ChIJOb-eH4VYwokRkyzosmvD_sk",
    "grid": "MN7",
    "address": "513 Columbus Ave, New York, NY 10024, USA",
    "rating": 4.4,
    "user_ratings_total": 1186,
    "phone_number": "(212) 873-8500",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sweU5sQjNNemROZEdwTlVXMUtRV3RuVVVkd1kzYxAB",
            "text": "Do not order take out from this restaurant.\n\nI ordered from this neighborhood restaurant through Uber Eats, I live just nine blocks away, and it took over 25 minutes to arrive. When it finally did, the pizza box looked like it had been dropped. The pizza itself was completely flipped upside down, stone cold, and inedible.\n\nI called the restaurant expecting them to help, but they couldn’t have cared less. They told me to “request a refund through the app” and reorder myself. No apology, no attempt to fix it, just total indifference.\n\nIt’s incredibly disappointing, especially from a local place I actually wanted to support. If this is how they handle customers, I won’t be ordering again, and I suggest others think twice before doing so."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaFdWRnBZVUZETjNwaFgzZG9ZM2hPVGxwdVQyYxAB",
            "text": "Average Italian"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMWJFVmFRekJTT1d0VlQxcGFXRXhqZFVaMk1YYxAB",
            "text": "I only had a calamari and glass of wine but it was very tasty and enjoyable experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWFpWVnVZa0k0U25rMU9FcEpkR05UUTFaSU0wRRAB",
            "text": "I have been to Cotta a few times before and had very good experiences. So when my friends were coming to celebrate my birthday i thought this would be a great safe choice. I was extremely disappointed. We ordered a steak and asked for it to be cooked Medium, and the middle was completely raw as you can see below. When we told the waitress she said she would tell the kitchen but then all she offered was a free dessert and still charged us for the steak. i was appreciative of the free dessert, but when celebrating a birthday, getting a raw steak is extremely disappointing. I do not think we will be returning for a while."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RmQxZG5OVXhVVWpOUVlreEZSRkpVTjNoRlZrRRAB",
            "text": "Burrata & pizza were great 👌🏼…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOT1RsWjBMVEJzTmxGMlRsRmhaR2s1VTNSM1FYYxAB",
            "text": "Yummy paninis in the heart of the UWS.  The pizzas looked good too.  Great dough!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keE9GRkZVVmRWZGs5NFoycHhhblpJVjFJNGRtYxAB",
            "text": "I had a lovely night.  The staff was very sweet. Would recommend 👌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVGVFOUliRlF0WTBWc1pVSnVkME5IVVZGdU9GRRAB",
            "text": "This place is a gem! The rosemary chicken wings were absolutely incredible—one of the best wings I’ve ever had. The bartender Marco was also fantastic."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVmVqZ3pkVTB6UjJKb1dWTnRRbE5NU2pKTFdHYxAB",
            "text": "Best bolognese sauce I’ve ever had! The rosemary wood fired chicken wings were amazing! Will definitely come back when in NYC!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWV1ZFaEplRlJCTFRCT2QySktNMlJLTWxGSlpYYxAB",
            "text": "“We came from Boston with my husband and son and had an amazing meal at Cotta! The lasagna, meatballs, and spaghetti were delicious, and the ambiance was wonderful.”"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGT1gyeE9WVVpOWW1Kc04wWllYMk5FT1dkS1kzYxAB",
            "text": "For 50 whiskey soda you better act like you own the place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMmEwSktabVZHZVZkT09VWmtZMG94TVdwalprRRAB",
            "text": "Really enjoyed this place. Good food. Great atmosphere. They can hold large groups too. I had the lasagna and it was delicious. Nobody had a bad meal. Excellent wine list."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGU1RsSkpabFZCZUZSU2JtbFhXbXhzV0ZJM1FsRRAB",
            "text": "Stopped in for a drink and to try out the red sauce at Cotta. We love that the portions are reasonable here and they have small plates as well. We had an excellent IPA from Vermont and a mule. Then shared a bowl of the best  bolongese with fresh ricotta.  Amazing red sauce here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMlNGQXpkakppUmtvNFNFWXpiMnBPTkZaTE5YYxAB",
            "text": "Very yummy authentic Italian food at a reasonable price!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWVYycFhVVXBOTFdOdFZsQkNVMGw0YkhKV01rRRAB",
            "text": "Good value, good white wine, great kind bartender, a kinda salty pappardelle but still super yummy and flavorful"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa1V6VlhUMVF0VGpaVFFtWmlSa2cwU21KWlZtYxAB",
            "text": "Beware: if anyone in your party wants to do unlimited / bottomless, they’ll force everyone to do it. This isn’t written in the menu nor the website – staff claimed it’s a new rule (“only started 2 weeks ago!”), but based on other reviews, it’s been ongoing for over 6 months.\n\nAdditionally, prices are higher than the menu on the website."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUU9HcEZReTFLVVRNMFJrdDZhekpPVm5adUxYYxAB",
            "text": "We took the Carbonara pasta and they were not good. Not tasty. The waiter was nice but that’s it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obWVYTkRURTlPVDFSQ2EyUnhRVkoxWWxKU1UxRRAB",
            "text": "Consistently good. Go to this place if you want a nice meal, good portions and not break the bank."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM01YZHBlVFZxYUY5VVpFUnhTVzlwUjBVelFWRRAB",
            "text": "Always a good time and great food"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNThDU0dnEAE",
            "text": "Osteria Cotta has the most delicious food, the loveliest atmosphere, and the greatest service! I had the best experience here, I came for Sunday brunch while on the Upper West Side near Central Park West & I will absolutely plan to return in the future. They also have a great wine list and their sangria is excellent as well. Highly recommend!\n\nUPDATE (6/18/2025): I’ve been back to Osteria Cotta several times since I wrote my initial review, and this place has always been excellent! I love their appetizers (including their Marinated Olives, Arancini, and Burrata), and their Penne Vodka + Margherita Pizza. :-) The atmosphere inside of this place is fantastic, as it’s so cozy & intimate!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOS3kyYUM0bnRhTjF3RRAB",
            "text": "Great meal sitting outside on the weekend. The Pomodoro and vodka sauces were so good on our pasta. The pizza was excellent, Neapolitan style, wouldn’t have been surprised if it was from the five star boutique pizzeria across the street!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKcTYyb3pmcDRXYm5nRRAB",
            "text": "Absolutely loved the vibe inside!\nFood was super mid (ordered margherita pizza, spaghetti pomodoro and baked ricotta). Everything was super underwhelming and unseasoned.\nThe atmosphere made up for the lack of flavor so I would definitely come back for happy hour to enjoy the space!\nStaff were so accommodating and very efficient!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYk91WmFucGI2Yi1RRRAB",
            "text": "Very good food and friendly staff. Our server really helped me make a good choice for vegetarian options! Super dark inside though and a bit loud. We just walked in and they had a table available for 2, but it was a weekday. Would recommend!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOUlfb3RRRRAB",
            "text": "Do not expert water, napkins, or bread.  Do not expect a waiter.  Don’t even expect to be able to order food and drinks. Just sit there for 20 minutes, waiting for a whiff of attention from a very spaced out guy who doesn’t actually know or care that you’re in the restaurant. I don’t expect great service at every restaurant but any service at all seems important to, you know, order and eat something???"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZjl0cXZuNzdDNG9RRRAB",
            "text": "We reserved a private room ad part of\nan event with our school. The food was served family style and everything came out fresh and delicious. The service was great, we always had our drinks filled and our dirty plates taken away. Great experience, I recommend this restaurant for large parties."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveV9PYm1nRRAB",
            "text": "WAOW italian!!  (Empty dishes is a great sign :-) Victor is the best waiter!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbGF2VUNnEAE",
            "text": "Fantastic happy hour, great service from Victor, excellent personal pizzas 🍕"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaHNUOVhBEAE",
            "text": "Hemos ido muchas veces y siempre está a la altura. Muy amables y muy buena comida. La atmósfera nos encanta"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJa3Rqb1ZREAE",
            "text": "First time coming here for brunch and the food was amazing & flavorful the brick oven pizza is a must! I would definitely recommend, the restaurant has a cool wooden theme definitely coming back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJckp5Slp3EAE",
            "text": "Wonderful neighborhood find"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNU83ZUJREAE",
            "text": "Had. Breakfast brunch upstairs...loved the ambiance and of course the food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OU9QdXhRRRAB",
            "text": "Loved the rustic vibe and the food was amazing. We had the pizza, pasta and dessert and all was delicious! Our server was very attentive and helpful and gave us great details on the menu"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcGFMRlB3EAE",
            "text": "Very nice place amazing food and good atmosphere"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNU9ERUxnEAE",
            "text": "Good restaurant. The Oaxacan (negroni) was well crafted. I really enjoyed the balance of flavors. I had the steak and swapped my truffle fries for roasted cauliflower.\n\nThe steak was cooked medium rare but 1-2 pieces of it were rare. I expect a restaurant as good and upscale as this to get it right completely esp for a $40 price."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMFptdXhBRRAB",
            "text": "I took my girlfriend to Osteria Cotta on a Sunday evening. I ordered the spaghetti and meatballs and a caesar salad.  Later that evening I got the worst food poisoning of my life. The only other thing I ate all day was a plain bagel. Avoid this place at all costs.  I’ve been eating at Italian restaurants on the Upper West Side my whole life.  I’ve never experienced anything this horrible.  Completely unacceptable. Also, take a close look around and you’ll see the extra dim lighting is being used to hide a lot of grime."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbnREYWxBRRAB",
            "text": "You MUST go here for good Italian. They make some of their pasta in house and it shows. Get the house made pappardelle and the orecchiette. I love to bring out-of-towners here!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMl9EU0dnEAE",
            "text": "Came for the brunch special, offers a great all you can drink option."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNHBqRnZ3RRAB",
            "text": "Welcoming staff and\nthankful the kitchen closes at 1130 :)\nGood food and drinks 🍷.\nA solid place in the UWS."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnek96YU1nEAE",
            "text": "A great spot for date night. Very cozy and intimate (request for dining upstairs). Food was delicious and service was quick. Definitely try the burrata, pasta and tiramisu!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncXNtZTNBRRAB",
            "text": "Victor was amazing - very fun and causal vibe with excellent wings, wine menu, and pasta options in the heart of the UWS!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcVpUWVF3EAE",
            "text": "Went for brunch, and it was an excellent deal. $32 for bottomless mimosas as well as an entree. The food was great, and the servers were attentive. The atmosphere was intimate and just the right amount of fancy."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcHViRmJnEAE",
            "text": "One of my new favorite Italian restaurants in the city! We got the calamari and Caesar salad to start—both great and large portions. For entrees I got the orecchiette with pesto and sausage, and added burrata - it was incredible!! My partner got the branzino which was also fantastic. Service was very attentive, and the place has a cozy ambiance with interior brick and candles, but still fun and lively. I highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNmZmYVJ3EAE",
            "text": "Truly a terrible experience, not only once, but both times I went here. The owner is rude and gives attitude to all guests. I went a few months ago and he was rude, then tried again and the same thing happened. The food comes out in 5 minutes (likely heated up in the back) and is nothing special. Will not be going back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNFpPT2F3EAE",
            "text": "One of the best and cheapest brunch places in the city. Great food, beautiful and cozy ambiance and really good service. Highly recommend this place!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NVliYnJBRRAB",
            "text": "We had a great time out tonight at Osteria Cotta. The decor of this establishment has a nice old-world type charm. It is very cozy here, the food was excellent as well, and the menu pricing was fair. We will definitely return, Osteria Cotta is a fantastic date night spot on the Upper West Side!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cHZfNHZnRRAB",
            "text": "Ate here two nights in a row during our trip, great staff and food and drinks are amazing. We had the same server each night and she was wonderful! We’ll definitely come back next trip!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dXZxNzdnRRAB",
            "text": "I ordered through DoorDash. The food gave me the worst bout of food poisoning I have ever had. Avoid if you're trying to stay healthy. Enjoy if you're trying to lose multiple pounds in one day due to food poisoning."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eXVMYjd3RRAB",
            "text": "I stopped by this restaurant five years ago when I was at college and recently came back while visiting a friend in NYC. It’s just as good as I remembered! My friends and I shared some classic pastas, pizzas, and their specials, including a cocktail and fish dish—everything was delicious. The Orecchiette, my favorite from back then, is still amazing. Highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQXzh5TTlnRRAB",
            "text": "The housemade pappardelle was just alright. The pasta felt light and watery. I also tried their pesto pasta and it way too salty. Overall I would say this place has decent food but nothing to rave about and prices are slightly high for the quality of the food. Service was slow"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrd19LU0RnEAE",
            "text": "해피아워에 피자나 와인즐기기 좋아요\n피자도 바로 구워줘서 너무 맛있었고\n와인도 해피아워엔 6달러 정도!\n로컬 사람들이 많이 오는 느낌이라 분위기도 좋음!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyek9IZUZnEAE",
            "text": "Had brunch on Sunday and it was such a nice experience. This is a warm and chic spot with a nice menu. Two floors with plenty of seating but weekend fill up so I highly suggest reservations.  Brunch menu is nice with egg dishes, French toast, paninis and the well known wood fired pizzas.   Reasonably priced, nice wine list and excellent service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINjlQT0Z3EAE",
            "text": "Had an early dinner for a group of 7 at the upstairs area. Went mostly for the happy hour, but it does not apply to the seating area upstairs, only applicable if sitting downstairs or outside. We decided to forego the happy hour and sit upstairs. The bar and downstairs area only has high chairs. The outside area is not very attractive. Groups of 8 or more have to order from a prefix menu ($40 pp)   We ordered from the regular menu. The pizza is ok. The lasagna was good. The calamari was good. The spaghetti was tasteless and very salty. The penne was ok, a bit salty. The salmon was ok. The branzino was ok. The chicken milanese was not good. Ordered a bottle of red wine (screw top for $38 ) was ok. The glass of Lambrusco was good  The service was average. The upstairs feels dingy.   The food overall is a 3. Most of it lacks flavor, and is very heavy on salt. It’s basically Americanized Italian food. Only worth a visit if you do the happy hour. Would not return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINHE2R1Z3EAE",
            "text": "I stumbled upon this restaurant by chance, and what a pleasant surprise! The food is absolutely delicious, with well-prepared and flavorful dishes, all at very reasonable prices. The service is quick and efficient, perfect for a lunch break or a casual dinner. The large terrace is also very nice and the perfect spot to enjoy a great meal outdoors, whether you're dining solo or with friends. I’ll definitely be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5ME9PQmhBRRAB",
            "text": "The food here is FANTASTIC!\n\nI would say it’s the best Italian on the upper west side.\n\nMy dish completely melted in my mouth. The wings are the best you will ever have.\n\nThe prices are also super reasonable, a bit cheaper than most of the restaurants in the area.\n\nThe atmosphere is almost medieval mixed with some upscale features.\n\nI recommend sitting upstairs."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCbHN6UXdnRRAB",
            "text": "Good service, tasty pizza, really rustic and hearty lasagna, the chicken was exceptional as well! Love that they have Lambrusco by the glass! The vibe and ambiance a great too, I love a super dim, elegant rustic space!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMnVUUEx3EAE",
            "text": "Food was great! The bread pudding and tiramisu were wonderful!  The burrata was the perfect appetizer! The truffle fries were yummy as well. The only thing was that it was a little too dark inside for dinner,  but it did fit the atmosphere in there."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhaWZMREx3EAE",
            "text": "Osteria Cotta has to be one of the best brunch spots I’ve been to. Great food, strong drinks and impeccable vibes.\n\nI had a fairly large party for bottomless brunch and it was a great experience. The mimosas were on point- stronger than I expected and tasted great.\n\nBecause we had more than 7 people, we had to go with the family style option of salad, wings, pizza and dessert. I wasn’t sure how I felt about that at first but they brought out plenty of tasty food and it was actually a really nice variety. My only wish is that we had less salad and more wings.\n\nService was fast and it’s in a superb area of the upper west side. Will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcnBfTml3RRAB",
            "text": "Amazing experience here! Gnocchi was very good (sauce a little salty) but overall the arancini and warm ricotta were amazing. The service was very fast and the atmosphere was amazing! Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUQ5czQwOBAB",
            "text": "Food 5/10\nWent here for brunch and the food was alright. Got an omelette and the toast came out cold.\n\nAtmosphere 8/10\nNice interior and plenty of space, two floors.\n\nService 4/10\nTook forever for the food to come up, it was an hour until we got to eat. Disappointing. They gave us a free chocolate cake though as an apology. Felt bad for the waiter he was the only person staffed :("
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MHZTZlpREAE",
            "text": "Great location and service, but food was mid.  Brussel sprouts way too oily, could bear a little more cooking.  Beets were good.  Sauce for meat ways was watery.  Really wanted to love it, but was disappointed."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdlpfNWJnEAE",
            "text": "The brunch was very good. The Baked Eggs in Purgatory were delicious- I had never had before, but it was warm, fluffy, and delicious. The restaurant is very cool as well, we ate upstairs and had the entire place to ourselves."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dzZuSktnEAE",
            "text": "Nice ambience! Had calamari, meatballs, and two pasta dishes. Foods were 3/5, extra salty, pasta noodles were not as well cooked. Wasn’t delicate in general. Service also was ok, nothing particularly bad or amazing. Nice deco and vibe tho. Would be a good happy hour place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3aVBqQ2tnRRAB",
            "text": "Casual Italian with a broad menu and huge seating space. There’s a covered outdoor area, a decent space around the bar, and two large rooms upstairs. The pizza was well put together and quick to the table.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd3B5Mzl3RRAB",
            "text": "Great Italian restaurant with fair pricing and great service. The ambiance is fun and romantic. The food selection is diverse and a great list of drinks. Affogato here was fantastic with great quality espresso."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bTVHMUV3EAE",
            "text": "Exceptional food (the paparadelle with braised pork was delicious) and good service. The atmosphere is incredible, with beautiful decor and cozy lighting and furniture. For the quality of the food and the beautiful setting, the prices are quite reasonable."
        },
        {
            "date": "2년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadHNXSWF3EAE",
            "text": "Ein toller Ort!\n\nIch suchte eine Toilette und hätte diese auch umsonst einfach nutzen können.\n\nAber dann haben wir uns spontan entschieden, doch kurz zu verweilen.\n\nSuper nettes Personal, unser Essen war sehr gut und schnell da und das Ambiente passt zu einem kleinen Amerikanischen Restaurant.\n\nHier gibt es kein \"Sterneessen\" sondern gutes Comfort Food, für das es sich lohnt."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOU9HUk1REAE",
            "text": "A warm and happy spot; dependable menu with great wines at fine prices. A fan for over 10 years, we're always happy to have a lunch or dinner at Cotta.\nThe rosemary wings & shrimp scampi appetizers are excellent. All pizzas and pastas are always a hit. With a group of friends, date time, or with kids, a fine place to enjoy a good meal with good wine. Adrianna is a lovely waitperson, and overall what a good value for money at Cotta."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eG8taXdBRRAB",
            "text": "I came here at night with a few friends and the atmosphere is very comfortable--it is rather spacious for a restaurant in NYC and you don't feel too crammed or up close and personal with other diners. I would definitely recommend this place…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMU5qT0ZnEAE",
            "text": "This is such a cozy cute restaurant. Service is quick and efficient and I absolutely love their desserts they are huge and fair priced (try their tiramisu). I always go for the pizza, its not the best pizza in NYC but its light and crispy and worth it for the whole experience!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MDlfQjR3RRAB",
            "text": "Came here on a Saturday for lunch. They have an interesting cocktail all you can drink option, which you get a set price for an entree with unlimited cocktails for 1.5 hours. We had a pork ragu pappardelle and a buon Giorno pizza. Both were so good, reminded us of the food we got in Italy!  Very reasonable price and awesome service too!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyMm9lbHBRRRAB",
            "text": "Love this place so much! Reasonably priced, yummy food. We got the fried calamari, margarita pizza, and spaghetti. Great service and awesome outdoor seating!! Will keep coming back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMWZTaUJ3EAE",
            "text": "Dinnee time, ourside seating. Got the meatballs to start with some bread and oliveoil, pizza and lasagna. Portions were approriate for the price, specially the meatballs which were 5 , with plenty of sause and parmesan cheese. The saus was salty for sure, as it was present in the lasagna and pizza as well - but it could be subjective on our part .\n\nService was good, and attentive."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcmQtc0xnEAE",
            "text": "Beautiful simple european styleplace. Very nice italian food and the pizza is authentic. Excellent prices, especially if you're looking for drinks🍸 . Absolutely recommend 👌"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNjZxand3RRAB",
            "text": "Our favourite restaurant in New York.  We eat here at least twice every trip.  Margarita Pizza, Papperdelle, Spaghetti Pomodoro, Meatball Appy,  Banana Bread Pudding, Tiramisu are all out of this world.  So much so, we haven't tried…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MXJmUlJREAE",
            "text": "One if the best pizza place, in my opinion, and with the burrata is amazing!! Went back for more, a few days later. The vibe inside is pretty nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldHNYS1ZREAE",
            "text": "Osteria Cotta has a beautiful ambiance and the soft lighting is very unique. The food is also really excellent. The woodfired rosemary wings are the best wings I have ever had anywhere and this is not an understatement. During brunch, we had a mishap with a vegetarian entree, but the young manager was so incredibly professional that she handled the situation with amazing care. I cannot recommend Osteria Cotta enough."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBem9qVWlnRRAB",
            "text": "Nice outdoor seating when weather permits.  Love the service and the wait staff is perfect.  The Calmari was good and they serve cocktails to your exact specifications."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMllPeWRnEAE",
            "text": "An absolutely wonderful time from start to end! The staff was so warm & welcoming, the atmosphere was simply beautiful, the food & drinks were Delissssh!! Can’t wait to go back!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZa3Q3NlVREAE",
            "text": "The service here was Amazing! The manager needed to do something to the window behind our table, but was worried about bothering us- it was very minor we didn’t even notice. Because of the minor inconvenience, he bought us a round of drinks…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeklpbDR3RRAB",
            "text": "Had a wonderful experience! We didn’t have a reservation but we could still sit at the bar. The bartender was great and the food was amazing! Best Italian we’ve had in a long time and the ambience was super nice. We had the arancini balls (ate so fast we couldn’t take a photo), spaghetti, and marg pizza. Definitely recommend!"
        }
    ],
    "reviews_count": 80
}