{
    "name": "Tavern On the Green",
    "place_id": "ChIJKy5pv_RYwokRBaqWbokKqOc",
    "grid": "MN7",
    "address": "Central Park, W 67th St, New York, NY 10023, USA",
    "rating": 4.4,
    "user_ratings_total": 7738,
    "phone_number": "(212) 877-8684",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVWMxOUVRV2hpUWxWVFpqSkNibFpEUVc5cFpFRRAB",
            "text": "We have never eaten here, but always stop by for a drink when we're in NYC. The cocktails are delicious and the staff friendly. A visit to New York wouldn't be complete without an hour at the bar in this beautiful establishment."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeGFrdzBhak5xYkU5TE9VVXliMnd0WVhaWk9IYxAB",
            "text": "What a special dining experience. We sat on the terrace, and it was perfect weather. Our server was wonderful and the food was divine."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4elFVaFJTbTgzTms5WFoxbFljVVkzZWpSNWNVRRAB",
            "text": "Always visit on a trip to NYC, little piece of calm in the bustle of the city"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMWQwWlRiVFJyTTFCWE9HOXlXa2hmYm14cGExRRAB",
            "text": "Feels luxurious and they listen to any specific food allergies you have."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRFIxVXpORkI0YmtKVWQzcGxjR2hwVms0NGEzYxAB",
            "text": "My wife and I were stressed because we had plans to see a show and she  didn't like the food or the service. It was horrible for me to see my wife not happy."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYWRGWTNZbmhEY1ZOT1JWaGFXVlJGTm1KNGJrRRAB",
            "text": "mediocre at most part for the food, i think a lot of them lacked in flavor"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORGVsTlNZMHBtV0VaMldUVTFabUpaT1hCU1NYYxAB",
            "text": "Quality served is not what you would expect from the Tavern on the Green. Do not call burrata what is not a burrata, and don’t have flat  bread on the menu if  you are unable to serve it ."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bFlUVklkalkxVDBkNlRqVXdSRTlMZWpsek0wRRAB",
            "text": "Kat is the best server. She was so sweet to my mom and I, and it was my birthday which makes it so much more special. Thanks for everything again!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wa1JEUkNVekkyYWxCMFRVNXJjM2R5VUdWbllsRRAB",
            "text": "Great outdoor place for a drink in the fall.  Right by Central Park, the restaurant has an option on dining or just drinks."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVmF6RmhXamxoZGxWMVFtZDZkbk5qWkMxR1lsRRAB",
            "text": "Food is just not good, drinks aren’t either."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcGFFZE5RbFYwTVROeU5UWmtSMHBMV0dKWWFIYxAB",
            "text": "Amazing atmosphere"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMGFWQkRPVXd6U1ZReGNGaHdXR0oxVUU0NFVIYxAB",
            "text": "We really enjoyed lunch here. It's so pretty and almost kind of majestic inside. Food was delicious and my bloody Mary was really good."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aM1JIbEJRelJCZEdaRVFUaE1OMUY0WHpsU2VXYxAB",
            "text": "Had the best time at Tavern on the Green, big thanks to our amazing server Carly. She had the perfect recommendations for all three courses, and was so kind and patient with those in our party that required some special accommodations. Taylor in the gift shop was also so helpful and fun to chat with. Thank you for a great evening!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdU9VOW9ORVpWU3pWSllXOVZRa3BJUW1GSldrRRAB",
            "text": "Twenty minutes into our experience, we were wondering if we had been seated in no man's land. When our waiter finally approached, he made his lack of attention a bit jokey...\nWe each had a variety with my husband having the lamb chops, which were cooked perfectly and had a wonderful flavor. Our friend had the short rib special, which lacked a depth of flavor that I expect with short ribs. I had the chopped salad with a light vinaigrette and truffle macaroni and cheese(huge portion for a side dish.) Both of my selections had good flavor and were prepared as expected.\nThe waiter did come around and once engaged with us did an acceptable job."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZdGJEVllXR3BCYlZwbWVVVmhiRk5TUVRoaVRXYxAB",
            "text": "This place is such a unique atmosphere, in Central Park so there is a lot of outdoor seating with garden like views, and indoor bar and small tables, and another dining room reminiscent of a greenhouse. I was there around lunch and I sat at the bar and the staff were very friendly and provided excellent service. If you want a table with more than a couple people you’ll likely have to wait unless you have a reservation.\nI only had the burrata and grilled sourdough appetizer but it was delicious - fresh and perfectly prepared and seasoned. There is a great drink menu and plenty of food options.\nThis is an expensive place but the food and atmosphere make it and a memorable meal!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sa1QwUkhNVEJpZFY5blJtUlhNRXBQVmtOSVpIYxAB",
            "text": "This is a great place for all time of events, casual dining or special occasions.\nWe  celebrate our son engagement with special dining menu."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdlV5MXFZMk5uVFZaWlRrbHZjVm8yTjFaRlQzYxAB",
            "text": "Really nice!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210QmNXbGhSMjVRYzFOV1owWlRXSFZhVVdScVJGRRAB",
            "text": "Amazing place! The food is great, the service is fast and friendly. Try to make your reservation about 1 hour before the sunset to have the experience with natural light and the blue hour."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVM1lUVndibEk1YmxWMlRESnVaVWsxWjJVdFFsRRAB",
            "text": "Don't waste your money, not the same anymore!\nLike most fine things, this has gone downhill mostly because of the new, uncultured, improperly trained staff. They would not honor our reservation as they \"ran-out-of-tables\" due to rain!?\nIt rains all the time in NYC and on our day it was just a light mist.\nThe staff at the check-in area were clueless with 4 of them all looking down hopelessly studying the screen trying to figure out what to do. UNACCEPTABLE!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeVltdE9SMWs1ZG10RlRTMTRORlJ4TlZwNVVIYxAB",
            "text": "I had a terrible and humiliating experience with the host. I don’t know his name, but he was an older man with gray hair. I’m new in the city and still learning English, and I came with my service dog and a friend who was helping me translate. The host was extremely rude and dismissive. He questioned the authenticity of my service dog card and didn’t even allow my friend to translate for me.\n\nIt was shocking and upsetting to be treated this way, especially in such a well-known restaurant. I felt discriminated against and completely disrespected. No one should be made to feel embarrassed or unwanted because of a disability or a language barrier. People like this need proper training on how to treat customers with dignity and empathy."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa00wZHNjRmxVVTI1clRHVjJlR1pLU2pCQlExRRAB",
            "text": "I don’t know his name, but the host was aggressive and completely unprofessional. I was trying to translate for my friend, who doesn’t speak English very well, and she brought her certified service dog. Instead of showing understanding, the host accused her dog certification of being fake, which was deeply disrespectful and humiliating.\n\nWe calmly tried to show him all the documents, but he refused to listen and said we weren’t allowed to come in. I felt discriminated against, not only because of how he treated my friend but also because he didn’t even let me explain or translate. It was an awful experience that made us feel unwelcome and judged for something we did nothing wrong about.\n\nNo guest should ever be treated that way"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMk1WcENPRFZDYkRWRU4yRklNMHh1UkU1M1dtYxAB",
            "text": "We never got to taste the food because all the staff seemed poorly trained. Long chaotic waits with no updates. Gentleman outside front door checked us in and seemed friendly and said just go inside and we will text you in a few moments when your table is ready. We went in to find a lobby full of chaos including the small overflow gift shop. No one knew what was going on and no text ever came. After 30 minutes I asked at desk and the young girl said without even looking up or knowing my reservation time said point blank it will be at least another hour! We left needless to say. On the way out I thanked the gentleman for checking us in but it would have been nice if he had said the place was overrun and out of control with too many reservations and wait times of 1 to 2 hours even if you have a reservation!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSk5FUlNWM1ZwYzBKSWFFa3dXamQyVVdzeFdFRRAB",
            "text": "Poor service, lack of basic organization, bad front counter customer service with a lobby full of unseated guests milling around not sure of next steps or when their reservation will be honored. Wait staff act like children acting unprofessional in kitchen area with cooking staff instead of tending to guests needs. DO NOT GO a total waste of time and money!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poS1lWRlhNRXBWUWt0UVVESlJabDlsWjFVMlpuYxAB",
            "text": "A couple weeks ago my boyfriend made a reservation for us to eat here. We were excited, but when we showed up, the restaurant was closed and only their To-Go window was open. Nowhere on the website did it say they’d be closed the day that…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poV05rWlhhR1ZTZEVwSlMybHJiREJUUzNwd1NVRRAB",
            "text": "eating outside was an incredible experience, beautiful place and good service, I fill like a manhattan citizen for a moment."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWU1GQkVXVGREUjE4NGRVeFRkRE56T1dNd1VXYxAB",
            "text": "QUITE OUT DOOR FINE DINING WITH KIND FRIENDLY STAFF SERVING YOU WHATEVER YOU LIKE (WATER, SODAS, ALCOHOL BEVERAGES), INSIDE THE RESTAURANT YOU WILL GET A BIGGER SELECTION OF ALCOHOL. THE PRESENTATION OF FINE DINING IS EXQUISITE & DONE W/PERFECTION BY THE CHEFF & THEIR STAFF. THE BEAUTIFUL SCENERY IS BREATHTAKING! IF YOU WANT MORE ACTION & ENTERTAINMENT, YOU WILL GET THAT INSIDE THE GORGEOUS RESTAURANT! YOU WILL BE TREATED VIP STYLE WHEN GOING HERE! TAKE THE DAY & WALK CENTRAL PARK & STOP HERE TO ENJOY A GOOD RELAXING ENVIRONMENT W/GOOD FOOD & GOOD PEOPLE ALL AROUND! IF YOU HAVE KIDS, ID BRING THEM INTO RESTAURANT BECAUSE OUTSIDE HAS A CALM SERENITY TO IT! #SUNSHINEViBES74 ENJOY HER TIME WITH HER ONE OF HER BESTIES! #BUNNYSREVIEW1026  I TYPE IN CAPS PARTIALLY BLIND, #GRAVESDISEASE  #TED #THYROIDECTOMY #THYROIDCANCER #Traumtic #brain #Injury, YES I AM A HOT MEDICAL MESS BUT IF I CAN PUSH THROUGH THE DAY, YOU CAN TOO! STAY ACTIVE & BUSY TO KEEP DEVIL OUT! BE UNSTOPPABLE & KNOW OUR WORTH! WE TAKE ONE DAY AT A TIME! STAY BEAUTIFULLY UNSTOPPABLE WHO EVER CHOOSES TO READ THIS! ENJOY #GOOGLE LOVERS"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaFNFUTFWVlJLUzFaRWVXMHplVzVhV0ZNdFRtYxAB",
            "text": "Probably the best restaurant I’ve ever been to"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paZk0xUTVkVkJCWm1KRlIyVmxZbU5tWDJOTVpVRRAB",
            "text": "What a great experience to be done. Loved it. I will come back for more drinks and absolutely another steak sandwich."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSa1NVcHRUemhxVlhkb1FtSTBXRVZKVkhkMFgyYxAB",
            "text": "Chardonnet beef short ribs, and my children both ordered the gluten free trout."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aFl6RlpZWEJuVEVsWFMxQTVTMFI0Y0V0TGJFRRAB",
            "text": "We were at Tavern on the Green to celebrate our 40th wedding anniversary. The food was outstanding as was the service. We  were asked if we were celebrating anything and upon hearing it was our anniversary we received a card from the managing partners, Jim and David. The card was placed on our table visible to staff and many stopped as they were passing to give their well wishes. This made us feel so special. We received a gratis box of truffles on a beautifully decorated plate to help us celebrate. This was such a lovely experience. The only reason I rated atmosphere 4 stars instead of 5 was because the noise level was high as there were several tables around us with children. It wasn't quite as romantic as we had hoped."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRGRISlJNMTl3UjBWR2RWUkZWVk0wU0VSeFJIYxAB",
            "text": "The problem is they are operating this site with the wrong team lacking 5 star talent and professionalism for excellence. The staff were wandering around looking bored and in another world. The food and coffee were served cold to luke warm - I was stunned. Truly. The Server was MIA majority of my visit and I gave up. Kitchen staff are lost and the Chef does not know how to cook food. I asked the food runner how does cold food get beyond the Chef and I don't think he understood what I meant or English was an issue. The kitchen looked lost jerking around in the open kitchen view, slapping high fives, playing with each other, etc. Organization of seating was also lacking and you wait standing amongst chaos for someone to get it right. The dining room Host was initially loud/ghetto speaking to me as if I was in the same energy. She seemed to lack the emotional intelligence to connect differently and instead worsened things by continuously wanting to jump in my table space with her hot energy. This place is a nightmare I would not revisit. It is Tavern on the Washington Heights spectrum which is a shame as it will degrade this lovely space into nothingness eventually. They also had the gall to charge me $40 for a small plate of pasta and barely there chorizo. The pasta type for my meal was rigatoni and I discovered elbow macaroni in the end. I left it sitting on the plate to return to the Chef."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWV2FUbEdOWEUwVWxSc1JVTnlTV05UZWkxU0xXYxAB",
            "text": "Not the same - save your money - disorganized - claimed 1.5 hour wait due to rain - NYC has rainy weather every Autumn - Tavern on the Green could not handle it. They did not honor 2pm reservation and said it would be a 1.5 to 2 hour wait as they did not have enough tables. We walked to little Italy who had many venues with outdoor tables set up with coverings etc. Totally disappointed with Tavern on the Green as they know it rains in NYC and failed to handle it. It was total chaos in their lobby and no one knew if or when our 2pm reservation would be honored. DO NOT GO AGAIN - IT HAS GO TOTALLY DONWHILL!!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCb1owVkZkVk5KUjFST2RXTXlVM04yTkRkR2MyYxAB",
            "text": "A very cool and nice restaurant in central Park! Professional service, food good and classical, nice terrasse . Top!\n\nI took the opportunity to continue reading my thriller “Honesty Bar” over coffee (a great plot without violence, suitable for the whole family, found on Amazon, which takes us between Warsaw, Paris, and the Seychelles!), and it was really great."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ac2VFOTFNVEpwWkUxdlptMUlZVGRCVlZoNWFsRRAB",
            "text": "The food is okay, nothing special. The atmosphere is filled with staff who seemed like lost children. The food runner placed our sides in front of us and the entree outside of us vs. the other way around, which was shocking. A man with a headpiece seemed very bored disturbing customers multiple times with, \"how is everything?\" when their mouths were filled with food. He would circle around the restaurant and became annoying to us. The food runner came out to the dining room and kept moving the tables slightly to what he thought was perfection but kept hitting my foot in the process. He remained in the small dining space to do nothing really but hang out and move things as a distraction for his noisey energy. Staff did not display restaurant training and we laughed at how they tried to seem elegant but were really fast food material. We left with the impression of it being a 2 star dining space for inexperienced tourists who are excited just being on Central Park and needed another server to take their photo."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRVFXZG9ORE55UlRGQ2JEUTNNM0owV2tReWVuYxAB",
            "text": "Oysters are great, beer menu needs work. Good cocktails."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMlowSTVPR3N4V0RVMlRIUmxiVWhPTXpBNGFYYxAB",
            "text": "My boyfriend took me hear for my 1 year anniversary. My experience on Tavern on the Green was worth it. Server Tony was very attentive and kind. Their fine dining at its best. I would recommend birthday cake for dessert."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVVRub3RNV2RLYzFGRmEzZG1OV3N3VjBGbFowRRAB",
            "text": "Beautiful, historic restaurant nestled in Central Park. Made reservations... was our Anniversary and they gave us a beautiful card and a small box of chocolate truffles for the occasion, which was very nice. Service and food was top notch! They also have a small gift shop you can visit to purchase souvenirs. Highly recommend visiting if you're in the area!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVmJHNVZjbkZaVUZSTE5FSmxibmw0VFVOVk9GRRAB",
            "text": "Overall the experience was disappointing. The atmosphere and service were excellent, but the food was lukewarm and clearly had been sitting for a longtime. We sent the potatoes back because they were cold, and the replacement was microwaved soggy potatoes. At $200 for dinner for two, it’s really not worth the money."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScFNWcFNkRTlEY0hkb1preFVRVmxPV21kbFVsRRAB",
            "text": "Lovely"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObGVFWkVWVzQwTkVwSVRtcElURUphY0ZwR1ExRRAB",
            "text": "Beautiful and historical restaurant! Would come back just for the ambiance. The brunch food is great but nothing extraordinary and we had to wait for 30+ minutes despite having a reservation. I really enjoyed the frittata, which was flavorful despite my hesitancy from some of the reviews here. My friends loved the burger."
        },
        {
            "date": "1달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveWRVMTNVbU5xVWpSVmQwVmZjRmx1TkU5MU1sRRAB",
            "text": "מקום מקסים, שירות טוב ואוכל טעים מאוד"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONFRraHpia28yY1RSQ1ZGQkhhRlJXUWtKVllrRRAB",
            "text": "Our 2nd visit to NYC and our 2ne time eating here and when we come back we will do it again. The food was amazing and the se vice top notch. They knew it was my wife's birthday and they surprised her with a free dessert. You'll never regret eating here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kZlIyUlViRVV6T0VKU1ZHVkZlazQ1UVVVM1JHYxAB",
            "text": "Perfect place for a special date"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MGVtMWhUbmMzWmtneVQwTkhVM2xQZDBkbVFWRRAB",
            "text": "Had my 30th wedding anniversary in 2013"
        },
        {
            "date": "1달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dlJESmlkRlJIY2tKMlJXUjNXVWhvWVZkcVdFRRAB",
            "text": "緑を全身で感じられる素晴らしいレストランです🥰友人とランチに訪れましたがテラス席の居心地が最高でした🌳お料理も美味しかったです😋"
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Jd1RWaDNWemRDV2pKWmIzaERiMU5TYWxrelRtYxAB",
            "text": "Einmalig - fantastisch - großartig!\nSehr toller Service - sehr leckeres Essen!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UE5scExkbGN5YjNobmFGSjBaVk5KVEVaVVNXYxAB",
            "text": "I was so happy to visit this iconic restaurant and I was not disappointed. The  food and service were excellent, and the ambiance was terrific. It was well worth the wait."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVGRtSXhVMWhDZWtaSVZtSkJXR2xLYkdkcmFrRRAB",
            "text": "Demoraron demasiado. Trajeron La comida fria. Pedimos 4 platos y trajeron 3 Se invitation de traer uno. Una mala experiencia"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oU1FsbDBOV3RVU1RWaExYVjNUREl6WTJ0VldrRRAB",
            "text": "5 Star lunch today! First time at Tavern, everyone working was so kind and welcoming, perfect service! The menu made us salivate quickly! Watermelon Cooler cocktail was perfectly refreshing and tasty, Watermelon 🍉 Salad was fresh, perfectly sweet and savory and the Tavern Burger was the best burger 🍔 we’ve had in the city! Will be returning for each time we come back to the city, make sure to buy something petite and luxurious at the beautiful, tiny gift boutique 😍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSlRWZFlTRjgxTW1oQmQyNVBjRmRvWTFoU1VsRRAB",
            "text": "Food is not remarkable service is not professional"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUR6ai1obRAB",
            "text": "주말에 가야 더 다양한 메뉴가 있어요\n창가쪽 자리에 앉으면 채광을 받으면서 분위기 좋은 식사를 할 수 있습니다\n예약할 때 미리 자리를 부탁하면 좋아요"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPZzRHNVZ3EAE",
            "text": "맥주 한 잔 하기 좋은 곳이에요..공기도 좋고 음악도 좋고..추천합니다!!!"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZd192ZnFnRRAB",
            "text": "분위기좋음\n맛잇음\n비쌈\n날씨좋은날\n오래먹기좋음"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzOThYU3lRRRAB",
            "text": "덕분에 최악의 날을 맞았습니다^^ 음식맛은 “다행히 실패하진 않았네”정도의 적절한 맛이었어요~ 구석진 자리에 앉게 해놓고 웨이터는 조온나 오지도않고 조온나 기다렸어요. 또한 직원은 우리가 시키지도않은 커피를 주문에 넣고 12불이나 더 계산할뻔하게 했어요. 컴플레인 걸어서 사과했지만 그의 띠꺼운 사과는 달갑지 않았어요~ 당일 우드버리 아울렛을가려고 왕복버스 시간이 있었는데 그러다보니 시간이 너무 촉박해졌어요. 결국 우리는 우버를 타고 약 이만원 정도를 더 소비했지만 버스시간도 놓치고 쇼핑때 쓸 캐리어는 그냥 들고다녀야했죠."
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMHB2czBnRRAB",
            "text": "에그베네딕트와 멋진 분위기가 좋아요."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjay1PWE9REAE",
            "text": "분위기 만큼은 인정"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUVZHZHpXV1ZUVkVGTk5uWm9ORGwzWVdwR1IwRRAB",
            "text": "Tavern on the Green is hands down one of my favorite local spots, and it’s the perfect place to enjoy a meal both indoors and outdoors.\n\nMy family and I went for lunch to celebrate a special occasion, and we couldn't have asked for a better experience :)\n\nEvery dish we ordered was absolutely delicious. Fresh, flavorful, and well-balanced! And the dessert? Just the right amount of sweet to end the meal on a pleasant note!\n\nA special shout-out to our waitress, Nicole, for helping make the moment feel even more memorable. Highly recommend this place for any occasion! :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTWVUZHhSV1ZrTFVocVVtRjBOM05YWWpOcE9WRRAB",
            "text": "We had the most amazing breakfast! We made reservations for 9:30am which was perfect as the restaurant was just opening and it was almost empty. We were seated immediately in the garden (if you are dining here - you must sit outside!) Our server was fantastic! Very attentive and friendly.\n\nOur drinks and food came out very fast and everything was perfect! We had the best time - it was one of the highlights of our trip!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdVZteGlRM0ZhWDJaS1luUklSVlUxWDI0Mk4xRRAB",
            "text": "We chose a table with the garden view. The food was all delicious. The banana bread from the bread basket with their homemade butter is really good. Good coffee. The jumbo shrimp is fresh. The Tavern burger is one of the best burgers I’ve had. The pea soup is fresh and delicious. Eggs Benedict with Maine lobster is pretty good too. Lovely place for lunch and after walking around Central Park."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaU5WWXlNamhrTmtweVMyRkZWRlZPVURoSWJsRRAB",
            "text": "My salmon was cooked perfectly and the crisp on the edges just made for such wonderful bites.\n\nThe menu was super gluten free friendly. For dessert, I had an apple crumble cake with ice cream and it was such an indulgence.\n\nService was great. We went for dinner and got to experience both day and nighttime setting. I actually preferred the nighttime aesthetic. My only comment is that I wish all of the outdoor hanging lights were working as half of them were out. But food and service were impeccable. Delightful experience and definitely worthwhile for visitors!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNU09nSXJ0ck95bUh3EAE",
            "text": "We had a beautiful lunch at Tavern On the Green.  The lemon brick chicken was moist and delicious.  The Bronx cocktail was perfect.  Our server was so kind and with excellent recommendations.  Another guest had a health emergency while we were there.  The staff were professional and handled it with care.  Beautiful outdoor dinning. Excellent desserts."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GQ2MwaERXbmxuWkdFMlprZDVlbXBwVm5WalQwRRAB",
            "text": "Live music! Great food! Amazing atmosphere!\n\nWe made reservations online and stopped by after a stroll in the park for our first lunch date—it couldn’t have been better. The food was clean, fresh, and flavorful. We sat outside under shaded umbrellas, which kept things cool and comfortable.\n\nI had the watermelon cooler, which was absolutely delicious and refreshing. The service was spot on—attentive without being intrusive. It was a hot day and we drank a lot of water, but my glass was never empty for long; someone was always nearby to top it off.\n\nOverall, this place offers not just great food, but a real old-world charm and experience. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psb0xUVTFNMk5CTTJKMk1uTXlXbFZhY2pBNVIzYxAB",
            "text": "We love family dinners at tavern on the green we have gone three times now twice with our son and we love it! I love the kids menu how not only does it have food but toys for purchase as well! The gift shop is so cute and it feels cozy no matter what room you eat in. Food is amazing I always get the beef short rib, tuna tartare & truffle Mac & cheese 🥰"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kV01GbENlRkJvZG1sTmNsVlBiVVJRY0dKWWFGRRAB",
            "text": "A true New York classic and an absolute gem. We always have a magical time here. Never hesitate to celebrate a special occasion at Tavern on the Green. The food and ambiance are both spectacular. If you stay late and the space empties out, don’t miss the chance to ask for a quick tour—it’s worth it. Originally built as a sheepfold in 1870 and transformed into a restaurant in 1934, this place has truly stood the test of time!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMVdsaHRhRUpIY2tSMldHSldUVGxCYzBKQ2VIYxAB",
            "text": "We had a very good lunch at tavern on the green. We arrived around 11 with a reservation. Service was on-point and we sat outside and enjoyed the beautiful weather. It's in a great location in the park. Food was good, but not great. Could have been seasoned more strongly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUVJXRmtha1ZSZFd4bldrTmZXa2x4U1hoUk5VRRAB",
            "text": "Even though it was a rainy evening and we had to sit indoors, this place did not disappoint! Ambiance, service, and of course, THE FOOD! Highly recommend anything seafood on the menu! They also gave us a little anniversary treat :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWVoyZFNZVkYxV21GTVRFTkpUekZZVFZwQ04zYxAB",
            "text": "The atmosphere was absolutely beautiful, and the service was excellent, warm, attentive, and professional. While the experience was overall enjoyable, the food had a few surprises. I paid $30 for a single crabcake that didn’t seem to be handmade, which was a bit disappointing. The French onion soup leaned sweet, which may not be to everyone’s taste.\n\nIf you're planning a visit, I highly recommend making reservations for indoor seating to fully enjoy the ambiance. Despite the food quirks, this spot feels like a necessary experience for your first time in Central Park. I plan to go back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVVN6ZzRZVmxwZWxGNmMyRjJWRVZIUTJOcmRGRRAB",
            "text": "I’ve been to NYC so many times and finally made it to a Tavern On the Green! This iconic restaurant in Central Park has been featured in several movies and is known for its celebrity clientele. I guess that’s why I thought I’d need a reservation months in advance and expected    to pay alot for my meal. My friend and I were walking through the park and she suggested we stop there for lunch. I was shocked that we were able to get a perfect table on the patio when we arrived! The atmosphere is is “casual fancy”- not stuffy at all. And the food was fantastic and reasonably priced too. The service was top notch - it was the perfect lunch spot to relax on a warm spring day! Of course it is probably hard to get in on holidays and maybe the peak of tourist season, but you never know…. Definitely a must for any trip to NYC!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNUFVySk9nOGYtSHhnRRAB",
            "text": "Tavern on the Green is one of the most iconic venues in New York City, nestled right in the heart of Central Park. But you probably already knew that…\n\nWhat you might not know is just how next-level the food is—I still remember my birthday dinner there from 2018! So when I recently had the chance to go back, I was beyond excited… and they absolutely did not disappoint.\n\nWhat makes this venue so special is how it offers four totally distinct vibes within one space. When you first walk in, you're greeted with that classic New York charm and a beautiful horseshoe-shaped bar - it’s cozy, historic, and full of character. From there, you step into the main dining room, which is a bright, glass-walled space that feels completely different and overlooks the gorgeous terrace.\n\nThe terrace itself is split into two sections - one upscale and elegant, the other more relaxed and casual. And then there’s the event space: partially indoors, partially out, with a covered outdoor section that’s perfect rain or shine.\n\nIt’s easily one of the most beautiful venues I’ve ever seen—and the Central Park location just makes it even more magical. Whether you’re planning an event or simply looking for an unforgettable dining experience, I can’t recommend it enough."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VON1A2S2ZpbEtXa0ZREAE",
            "text": "⭐️⭐️⭐️⭐️⭐️\nA Memorable Dining Experience in Central Park\n-\nTavern on the Green lives up to its iconic reputation. The atmosphere is warm and inviting, with a perfect balance of elegance and comfort. I ordered the pork and it was outstanding—beautifully cooked, tender, and packed with flavor. The presentation was just as impressive as the taste. The service was attentive without being overbearing, and the setting, right in the heart of Central Park, made the whole experience feel special. A great spot whether you're celebrating or just treating yourself to a top-tier meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMVlWTm1aR2hXV1hOb1ZFVkNkM0pST0VSNk5FRRAB",
            "text": "This place is amazing!We didn’t book a table, but we got a great spot on the terrace, so we enjoyed the jazz music. The waiters were sweet. I loved the eggs Benedict - huge portion!The dates and cheese appetizer was nothing special. The cocktails were top-notch. My friend ordered a «Staten Island», which tasted very similar to a piña colada."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KYU1qZFhVR0ZYYm05Wk1VUkNkRlZ2TlhwcVQzYxAB",
            "text": "Had my 30th birthday lunch here with my husband and it was outstanding. The extra care that was put into the experience made such a difference. We both went with the special for the day, a steak and cheese sandwich, which was one of the best things we’ve had so far on our NYC trip. Special thanks to Conor for this amazing service!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RFJuSktWMmhVTVdFNGJYaHFhVzFoY1dKSU5uYxAB",
            "text": "It is a New York icon and doesn't disappoint. The bar is usually where I go. In summer there is a nice outside bar too. Staff is very friendly and knowledgeable about the drinks. Small bites at the bar including  interesting meatball sliders. Certainly worth a visit.\nUPDATE- we went back for Saturday brunch. With no reservation, it was only a 5 minute wait for a table. We were seated inside. Ariana was our server and she was most helpful and knowledgeable about the venue. They offer several refreshing bruch cocktails which were great. The  frittata delicious. Served with roasted potatoes.  The tavern burger (at $34) was pricey but worth it. It was huge and the meat was tender and very flavorful. It came with shoestring fries that were very crunchy and not greasy at all. Overall,  this second visit was a great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5M0xVaG1OMDUxUmtWVVVVdDZaa1JGUzJOSmRHYxAB",
            "text": "We had a reservation and we're seated immediately. Our waiter was extraordinary! Paid attention to every detail, was not intrusive at all. Food was excellent,  as always."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CME5VRXlUWFJqY2prdE9IRnljRVpNZVhOelYxRRAB",
            "text": "This place is a must when visiting NYC.  Great location right by Central Park, a short walk from the subway station.  The atmosphere is great and the staff kept checking on us to make sure we had everything we needed.  Great food choices with daily specials, conveniently priced for the experience.  We had lunch in the patio and enjoyed it very much."
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NVdteFhUek52WHpSWFVtaE9jVUZDTFRSSFRHYxAB",
            "text": "Parfait !\nJe suis venu prendre un « goûter » vers 4:00 pm en extérieur, et tout a été parfait :\n- lieu très agréable et joliment décoré\n- service professionnel et affable\n- excellent gâteau aux fraises (je le suis régalé) et jus de tomates très bien préparé !\nJe reviendrai avec plaisir"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWWNtdExNRUpuTXpCZlRXMUVTVVJ4UTNGVlJuYxAB",
            "text": "The service at Tavern on the Green is what always makes it such a timeless experience. Christian is an absolute delight of a server and we loved chatting with him! We were hoping for a frozen cocktail in the heat, and he very kindly made a miracle happen!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSFdXWTVTVVZqTURWbVEyOWhaVEZRUzNGSVIwRRAB",
            "text": "Tavern on the Green in Central Park is a beautiful and inviting spot, perfect for a relaxed meal in a charming setting. The food is very good, with dishes that are flavorful, well-prepared, and ideal for sharing. The menu offers a great balance between sophistication and comfort, making it easy to enjoy with friends or family. A special shoutout to their breakfast pizza, it’s a standout item that's both delicious and satisfying. Overall, a lovely dining experience in one of New York’s most iconic locations."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPV18xX2E5cWJydGNBEAE",
            "text": "Tavern on the Green offers a quintessential New York dining experience in one of the city’s most iconic settings. The atmosphere is charming and elegant, with twinkling lights, garden views, and a cozy yet upscale vibe—perfect for a special outing or leisurely lunch in the park.\n\nWe had the best burgers of our trip here—juicy, perfectly cooked, and packed with flavor. The brick chicken was also exceptional: beautifully seasoned with a crisp skin and tender, flavorful meat.\n\nService was friendly and attentive, and the overall ambiance made the meal feel like a special occasion. While prices reflect the prime location, the quality and experience made it well worth it. A must-visit for anyone looking to enjoy a memorable meal in Central Park."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQ2VYWk5jbVEzVWxSQmFqRjNjMjF3TVRSNFVWRRAB",
            "text": "The food was absolutely delicious! The staff and chef were amazing with their service. I was incredibly impressed by how the meal was prepared and presented. I highly recommend coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQmFHNWxla2hFZFRCTGRFeHpWamxFZWxGV1VVRRAB",
            "text": "Very classy in an old school type of way but not stuffy. Service was absolutely amazing. And the location is obviously a dream. I sat inside after a long day in the city and in Central Park but the beer garden is also quite lovely."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbFkybHBOSFZIV0dwMU9FMTRhMFZIV0ZCSU1sRRAB",
            "text": "Nice space with beautiful ambience. We stopped in for a cocktail each on a walk through central park. Very friendly service and while the cocktails are on the more pricey side, the location, views, and staff made it worth."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMSG9wSmlZcmRqSHBBRRAB",
            "text": "Unforgettable fantastic dinner experience! We are from Arkansas and came 20 years ago. It did not disappoint to return on this trip! Had the best food and the best service! Our waitress Rashae made the night so special for the 8 of us. Highly recommend!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRE5GZExUakZTUkVWbU5IVkxXVTVRVkU1S1oyYxAB",
            "text": "This is a beautiful and iconic restaurant in Central Park. The ambiance is nice and elegant and the staff is knowledgeable and attentive. It is a popular tourist spot so reservations are recommended. All the food we ordered came out delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadFdGcGtOelJNVG1rMVF5MVZkeloxVTBwNk0yYxAB",
            "text": "Tavern on the Green's reputation precedes itself. I've always heard about it and coming to have a birthday lunch here was a lovely experience. The east coast oysters were small and briny, but 2/6 of them did have a bit of shell in it, so the experience was not as enjoyable as it could have been. The farfalle/bowtie pasta was very solid—the tomato sauce was bright, vibrant, and acidic. The duck confit salad was a pleasant surprise and probably the highlight of our meal. The crispy skin bits added a lovely crunch to the bed of frisee and watercress, and the grilled cantaloupes were a nice touch. The steak sandwich was cheesy but the meat was a bit dry. The shoe string fries were excellent. We got a funfetti cake at the end for our birthday celebration. All in all, a very nice experience with beautiful ambience, though maybe the food could have been better at this price point."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNF9xbWtBRRAB",
            "text": "A classy, traditional yet updated vibe. In the southwestern corner of Central Park, somewhat close to Columbus circle. A delicious experience. The Bacon and Egg pizza was phenomenal. The crispy chicken sandwich special was out of this world. The drinks were the best we have had in the city to date. Staff was on point and the atmosphere was great. An amazing experience. Tell em Barsnobs sent ya!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLQ2swTE9iNi03dkZnEAE",
            "text": "The Brooklyn is a very good mixed drink. Little sweet but tasty. The French onion soup was delicious. Again on the sweeter side, but very flavorful. The house summer ale beer was good. Nothing to write home about. Its more about the ambiance and the history of the place that keeps you there longer than intended."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaGFqTDJ3RRAB",
            "text": "My wife and I had dinner here last night. Like most restaurants, you can be in and out in 40 minutes if you don't set the pace in advance. Wait until you're finished your appetizer before you order your main. Service was excellent, food was excellent, and of course you're in Central Park so the views are amazing. I got the crab cake for an appetizer. It was pretty good but I'm from Maryland so I'm not easily impressed with crab cakes from other places! Lol for my main I got the scallops. There were actually five of them but I forgot to take the picture until I had already eaten most of them. We made reservations online but we actually arrived 20 minutes or so early and we were seated within a minute or two. That was one of Friday evening so we were pretty happy about that. The desserts were awesome as well."
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcXRHTVhnEAE",
            "text": "Die \"Tavern on the Green\" ist in NYC eine Institution. Wer Ghostbusters kennt, erinnert sich an die entsprechende Szene.\n\nDie Lage, direkt am Rand des Central Park lädt ein, den Tag dort mit einem Brunch zu starten.\n\nDie Begrüßung (bereits vor dem Restaurant) war sehr freundlich, unsere Kellnerin äußerst zuvorkommend. Das Service ist tip-top.\n\nWeniger überzeugt waren wir vom Preis-Leistungsverhältnis der Speisen und Getränke (240 USD für 4 Personen). Alles hat gut geschmeckt, aber war andererseits auch nichts wirklich besonderes.\n\nWirkliches Highlight war eben das Ambiente. Deshalb haben wohl auch viele Gäste während unseres Aufenthaltes Geburtstag oder Jahrestag gefeiert.\n\nZum Frühstücken ist die Auswahl eher bescheiden, zum deftigen Brunchen (für Europäischer teils ungewöhnlich, was die Leute aus NYC bereits um 10.00 Uhr morgens essen) aber gut geeignet.\n\nFazit: Ein schöner Besuch, mit herausragendem Service, durchschnittlicher Speisenqualität in einem fantastischen Ambiente das seinen Preis hat."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NVEzb3pTRTExUWxwb04wVm1hbm8yTlZacFdFRRAB",
            "text": "This place is inside Central Park, it was walking distance to our hotel, lovely views  of the park under their glass ceiling terrace. My short ribs were exceptional, my son had the sliders and he left no crumbs. Wait time wasn’t bad but make sure you make a reservation ahead of time. Overall great experience. We will return everytime we visit NYC."
        }
    ],
    "reviews_count": 90
}