{
    "name": "Miriam Upper West Side",
    "place_id": "ChIJ8fEOZPFZwokRDcA5x-C09I8",
    "grid": "MN7",
    "address": "300 Amsterdam Ave, New York, NY 10023, USA",
    "rating": 4.3,
    "user_ratings_total": 777,
    "phone_number": "(646) 590-2659",
    "reviews": [
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbVkycW9RRRAB",
            "text": "손님이 처음 왔을 때, 어떻게 환영해야 하는지 모른다. 손님을 대하는 태도가 불성실하고 성의없고, 가끔 불편함을 느꼈다. 아마 내 생각에는 요리사가 진짜 주인이고, 홀서빙은 고용된 직원들인것 같다. 왜냐하면 음식은 나름 괜찮고 맛있었지만 서빙과 직원교육이 문제인것 같다. 다시는 안 갈것 같다."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oak0zbzRURlI1YnkxWmRFMVFNV0Y2VDJoV1YxRRAB",
            "text": "I went in without the reservation on Saturday lunch. They managed to sit me at the counter bar. The brunch menu looks really good unfortunately I already had breakfast. So my husband ordered Chicken schnitzel which came with mash potatoes, beets sauce, chop cucumbers, onion, avocado and tomatoes. The chicken was don perfectly, crispy and moist. I had Kofta Kebab which is meatballs with humus, vegetable, and pita bread. There are still a lot of things on menu that I want to try. The service at the bar was pretty good, the bartender was very pleasant. The ambiance is airy with interesting art pieces displayed."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUmFUSlBPR28xVHpkWU5XUmpORnBJYnpjeFdtYxAB",
            "text": "Extremely Disappointed – Served Raw Chicken and No Real Apology!\n\nWe’ve been to this restaurant several times before and always enjoyed it — great food, atmosphere, and friendly staff. Unfortunately, our last visit completely changed our impression.\n\nI was served raw chicken, which is not just unappetizing but a serious health risk. Our waiter agreed it was unacceptable and offered to replace the dish, which we appreciated. However, when the bill arrived, the replacement meal was still charged, and nobody apologized or made any gesture to acknowledge how serious the situation was.\n\nServing undercooked chicken is a major food safety issue, and the complete lack of accountability was shocking. I genuinely hope the management takes this seriously — this kind of incident simply shouldn’t happen in any restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaU1scFVOMFZKYzJoaWR5MUxSRFkzYTJOUk1sRRAB",
            "text": "Without a doubt the greatest brunch I’ve ever had. Menu items were simple but incredibly flavorful, the sauces that were served alongside them were the stars of the show.\n\nWe LOVED the pickles, too!\n\nWe will absolutely be returning."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5alQzWXhaa013WDIwNFZtTTNXRzg1YkhCcVMzYxAB",
            "text": "ADDENDUM: The general manager at Miriam reached out in response to our feedback, apologized, and offered to replace the ruined clothing. We are truly grateful for her customer service! Will be increasing our rating from 1 to 3 stars to average our initial experience and the steps taken to rectify it.\n\nOriginal review below:\n\nWe dined at Miriam this evening. The food was good, the patio atmosphere was pleasant. Unfortunately at the end of the meal, the staff member cleaning the dishes off the table accidentally toppled the dishes onto my partner, spilling on his shirt and pants. Both are ruined. Initially, we were told his meal would be comped. I expressed some dissatisfaction with this (his shirt and pants cost more than a burger) and they then agreed to comp the whole bill (there were three of us dining). This was a step in the right direction, but it took about 15 minutes for this to be offered after the incident. No manager ever came to speak with us/apologize. I think the proper way for the restaurant to handle the situation would have been for the manager to come out immediately and ask (and then cover) the price of the outfit. While I appreciate the offer to cover the table’s bill, the outfit still costs much more than our total, and it was naturally a major inconvenience. While I don’t blame the staff member for the accident - things happen! - I do think the restaurant should have handled the aftermath better."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmZ2VMTzFRRRAB",
            "text": "Beautiful food!\nLovely atmosphere and service. All the dishes were spot on in flavour, size, presentation and price. Their cocktails are unbelievable good, well put together.\n\nFamily of four."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aU5TQzRBRRAB",
            "text": "Excellent meal before our show at the Beacon.  Tasty drinks.  Food was great.  Plentiful portions.  Wait staff was attentive and friendly.  Lamb spareribs, hummus and focaccia to start.  Meals included short ribs, lamb shawarma, white seabass and chicken schnitzel.  Pictures tell the tale.  Desserts were just right.  Great value for the money.  Took off 1 star for the noisy holiday crowd."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRd0tlOEVBEAE",
            "text": "The place is really nicely decorated, the service is nice and the food is good. We arrived on a cold day and were seated in the outdoor area at the table closest to the door. I had to eat with my jacket on. The heater worked poorly and it was terribly cold. We ordered a bill, it came very quickly, and then getting the bill took over 30 minutes and I had to let the waitress into the restaurant so I could continue my day. That's why my review is 4 stars because when I give a review, I look at a comprehensive experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205ZlJtbGhURmROYWpKUlZscHNPVGhyWkdKSk5GRRAB",
            "text": "The food was fantastic, and my girlfriend and I truly enjoyed the entire meal. What made the experience even better was the outstanding customer service. We felt genuinely taken care of, and I really wish I had gotten the names of the server, bartender, and manager so I could shout them out—each of them went above and beyond to make our night special. Huge thanks to the whole team for making it such a memorable evening!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaWZUc3lnRRAB",
            "text": "It is amazing that each dish is delicious and gives us a chance to explore the unique Israeli cuisine. Before dining in Miriam, I had very little idea about what is Israeli cuisine. Now I am so excited about trying all dishes Miriam can offer. I don’t know how they cast the magic but I just want to come back again and again. The food is light, delicious, healthy, not too big portion. Great balance between the ingredients and flavors as well as nutrition and carbs. It also provides vegan and gluten free options. The best touch for me is the desert. The Halva Mouse is a MUST order for anytime!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMG9xMFVnEAE",
            "text": "We enjoyed a delicious brunch date. My husband got the lamb burger and said is was very good. I had the Norwegian Eggs (smoked salmon benedict over latkes) with labneh and salad. The Benedict was delicious but I will dream about the labneh. It was one of the best things I’ve ever eaten in my entire life. Would gladly return daily."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMHNuSV9RRRAB",
            "text": "Spacious place and good decor.\nWent in on late Sunday afternoon, got a table for 2 immediately.\nBureka - got a side of bureka, it was big enough. It was too heavy on olives though, if you are not a olive fan then this filling might be a bit too much\nFalafel - the taste was great but they were a bit oily\nGreen Shakshuka - Good taste and good quantity for 2. The labneh served with it was nice"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNU5FUjRiM2xQVVVoTGNWQk5jM2hGZEdWR1NVRRAB",
            "text": "We were six of us. The food took 45 minutes to get to the table. we were first ones in the Restaurant.We were with a three-year-old and six-year-old. I ordered French toast, which is very simple to make. It came out wrong. It had whipped cream all over it. I indicated to the waitress, absolutely no whipped cream, please !!!  They redid it. I had to wait another 20 minutes and it was tasteless and cold !!! The bill was very high not worth it at all.!!    We will never return. Also, the waitress never came over to apologize for the poor service and attitude."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdGJPeGh3RRAB",
            "text": "Really good meat!\n\nJust finished a comedy show and stopped by here afterward—so glad I did! The lamb baked rice was absolutely mind-blowing, definitely a standout dish. However, the wine selection could use some improvement. Despite that, I'd gladly return to this restaurant on my next trip to New York."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4T2FqTlZiRE5uZVdsSGFESjFXbnBYY0dOZmJGRRAB",
            "text": "Lovely restaurant with a great menu. I went for brunch and had the Jerusalem brunch which was excellent. Will definitely be going back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMlJGTjRZbDlCZEY5VlQydHRhemRWTjJkbVdrRRAB",
            "text": "Decided to take a Sunday walk down Amsterdam to see if I could find a nice new brunch spot. Seeing how packed it was in here, I decided to give Miriam a try. It was a 45 minute wait without a reservation but bar seating was available. Food was wonderful, exceeded any hope or expectation. I can’t wait to be back for more brunch and dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwd2VTa0l3EAE",
            "text": "This place is a fantastic Israeli restaurant! 🇮🇱 Miriam serves a wonderful selection of delicious 🤤 Mediterranean dishes 🍽️ - definitely try the Hummus 🧆 and Chicken 🐔 Schnitzel with Creamy Mashed Potatoes! 🥔 Ambience 🎶 is great, staff 👨‍🍳 is friendly, and the plenty of indoor and outdoor seating! I wish I came here earlier!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oM0xXWkZOWGhqWkRGTUxVMUxNMk5KYjBSRmQwRRAB",
            "text": "1. Waited ages for drinks, server disappeared and had to ask hostess to send her our way\n2. Inexplicably bad math on the appetizer dip to bread ratios—one (1) breadstick is provided. Still got charged $8 when we asked for one (1) breadstick ontop of the already overpriced app.\n\nRecommendation is to avoid, will not be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdXVDQnNBRRAB",
            "text": "Wonderful Mediterranean food!\n\nWe really enjoyed all the dishes we have tried, and the service was great.\n\nWe will definitely be back here!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbDlIeTZ3RRAB",
            "text": "Great brunch. The side hummus was really good. The green shakshuka is nice, but I felt I should have gotten the regular one instead. The croissant eggs and cheese dish was good and the burekas plate was also delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYc3FDcVNREAE",
            "text": "Their Chicken Schnitzel satisfies all my cravings and beyond. The chicken is perfectly crispy, yet moist on the inside, the mashed potatoes are rich and creamy, and the Israeli salad is crunch and fresh. They let a few of us get seated before the rest of our party arrived, which was really appreciated."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleUpqOFVBEAE",
            "text": "Fabulous, delicious Israeli/Mediterranean food in a beautifully designed restaurant just off Amsterdam Ave. Came in here because it looked nice from the outside and what a great decision! We had lamb shwarma, Falafel platter and egg with Jerusalem breakfast (eggs and an amazing Jewish bagel). So amazing! Server was fantastic too. Best meal on our trip so far! Best falafel I’ve ever had!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdS1UeU5REAE",
            "text": "A great gem on the upper west side for people who love good food and prefer to eat breakfast/brunch for lunch. Miriam has great options to choose from. We tried the Bureka dish and the Norwegian plate. And had their Kanafe dessert. We were there on Friday lunch time and the place was packed. Not surprised. Between the great food and fast and attentive service, it’s a spots we’ll come back to. Next time for dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcE9YTFNBEAE",
            "text": "Very nice food as always! Had been to Brooklyn one before. Consistent service and food quality. I’d definitely recommend this amazing Israeli restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteHFMb3J3RRAB",
            "text": "My favorite restaurant on the upper west side!! Absolutely everything is a hit here, every dish feels so curated visually flavor wise and texture. The service is THE BEST thanks to my favorite waitress Paola, I’ve must have been here about a thousand times and it’s always an amazing experience! I whole heartily recommended this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwX2Z6Zy1nRRAB",
            "text": "Miriam has lovely decor and is in a great location. The dishes we had were hit or miss. The highlight was the kadaif shrimp. We asked for many meze items to share explaining this to our server. Everything was served at once, within 5 mins of us ordering. It was all cold by the time we got to it since there was no way to eat all of that that quickly.\n\nI would not recommend the cauliflower nor the meatballs. The pomegranate dip served with the meatballs was great though. Meze dips were average."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzX3ZIdTdBRRAB",
            "text": "I can VERY CONFIDENTLY say this was some of the best food I have had in a while. Everything about this experience was something I will now use as the measuring stick for what 5 stars is. My friend and I came here on a Tuesday night and it was not super busy - we got sat immediately.\n\nWe chose to sit outside since it's warm for November. The lights in the little front enclosed patio area are so cute. We started by splitting a half carafe of Pinot Noir - perfect for the two of us. Then we got the hummus... I think I actually almost fell out of my chair. I am not kidding this has to be the best hummus I have ever evvvvveeerrrrr had. It was magic. On the menu the pita is called \"fluffy pita\" and rightfully so.\n\nAlso on the menu we saw \"Grilled Plant-Based Steak\" - as a vegetarian I am always drawn to the plant-based options (naturally) but was wowed for a moment because I have never seen a vegan steak option. Impossible burgers, yes... but vegan steak? This is new. So my friend and I were talking about it, and talking about it loudly it seems as all of a sudden the chef comes up and strikes up conversation about it. It's something he is very confident we will like, and he also tells us another special he's working on now. The chef's name is Alon - he is incredible and so fun to talk to.\n\nSome time passes and he drops off one of the specials for us to try, a gesture we were so thankful for. It is an absolutely unbelievable butternut squash in labneh. I will dream of it forever.\n\nSo then we get the \"steak.\" Oh my GOD. I have not had steak in about 8 years and I cannot even begin to tell you how insane this was. You should be RUNNNNINNNGGG to Miriam right now as you read this to get this plant-based steak for yourself. I want every single person I have ever known to try this. I will include a photo of the inside of it too, you can see it has the consistency and graining of a short rib or a real piece of steak.\n\nLong story short, I would give Miriam and their all-star servers and chef Alon 100 stars if I could."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bGNTRWtBRRAB",
            "text": "This was a bustling loud restaurant this Saturday night and the staff was working hard.  I’m struggling here as I don’t like to be critical so am giving them a 3 star rating but it’s generous. We sat at a high top table by the door on a very cold night and had to keep my jacket on. I understand that’s hard to control. But they could control the volume of their music. People were screaming to be heard.  Maybe they want it that way?  The waiter a very nice guy kept us waiting for a really long time but I did say it was packed inside. Still we did pay $75 a head with no drinks and 1 shared dessert and 2 shared apps for the 4 of us. This is not gourmet food. Ok the humus and warm pita were great but the falafel was not.  It was an odd shape probably machine made and texture leading me to believe it was freshly made. FYI avoid the fish dishes here. The fish shawarma was horrible. It tasted nothing like shawarma and had a fishy tasted.  The Israeli salad tasted like it was sitting around for a couple of days as the vegetables were water logged and soggy with zero taste.  Two people had the Moroccan fish and thought it was too spicy. I didn’t think so but it was covered in a heavy sauce. I’ve been to Morocco and never had this. I’m not going back but maybe I had an off night?  Too busy?  I won’t take that chance"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncHJmZ3N3RRAB",
            "text": "The food was fresh and tasty, very enjoyable. A somewhat gloomy weekend afternoon but the atmosphere was very cozy and bright."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Z2VERGVREAE",
            "text": "Went for an excellent brunch experience. Place was packed and held a great social atmosphere. Food tasted amazing - never knew Israeli food could serve such delicious brunch items. Had the “quesadillas”. Girlfriend had the lox. All amazing."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cGNUalhREAE",
            "text": "What a great restaurant. Our server was very helpful. The  apps and meals amazing!! A must go too!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbkxfbWp3RRAB",
            "text": "Went there for late brunch on Saturday and it was packed. Good thing the street dining had free tables. Plus points for the cool bottle of Mint Water - you'll need that because the wait for the food is a bit long (maybe because the place was packed). The Lamb is seasoned just right. The hummus and the dips taste fresh and maybe made from scratch. Looking forward to try other dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcWFMNEZnEAE",
            "text": "Great location right next to the Beacon Theater, so if you are in the area for a show- recommend to grab a drink and a bite at this place.\n\nWonderful Mediterranean manu with plenty of vegetarian options so there's something for everyone.\nWe ordered the fluffy pita bread (indeed fluffy) , focaccia\n6 dips - delicious and fresh, my personal favorite out of the 6 was the eggplant and the labaneh dips.\nEach git a couple of cocktails, all were very light and refreshing\nDefinitely recommend for a nice evening out:)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabHZfMElREAE",
            "text": "Staff was super nice. Food was an 8/10. The shawarma was HUGE. The place has a theatre smoking zone just beside it so if you sit outside you’ll most probably leave a bit dizzy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNFJVRmhOMWh2V0VwRWNtaFVRbWRLVGxKRlQyYxAB",
            "text": "I got the french toast, and it was okay. I felt it was slightly soggy and too soft. Also, the portion size was huge and the dish was too sweet as well. Not terrible, just not the best food I’ve had."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdGVFVXRWVTkyUVU5RFEzVmhSQzF6UVdkQmVsRRAB",
            "text": "Went with a party of 6 and no one came away impressed. Everything was under-seasoned and the price was outrageous vs the quality. We'd also gone for brunch several months prior and had similar issues. Just poorly made and seemingly low quality food at a terrible price. Lots of better options in the neighborhood like Friedman's just a few blocks away."
        },
        {
            "date": "3년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcE9LY0d3EAE",
            "text": "O restaurante Miriam localizado na região do Upper West Side é um restaurante bastante novo e recente que serve deliciosa comida mediterrânea/israelense. Esse local aparentemente vai virar um hot spot. Esta localização é uma ótima opção para uma refeição após uma visita ao museu de História Natural.\n\nMiriam restaurant in the Upper West Side is a pretty new and recent restaurant that serves delicious Mediterranean/Israeli food. It seems like it’ll turn into a hot spot. This location is a great choice for a post Natural History museum meal."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ejV1QkNnEAE",
            "text": "We were looking for an Israeli restaurant after a show and this restaurant did not disappoint.  Very tasty menu, pleasant atmosphere and helpful staff.  The lamb shawarma terracotta was fantastic!  Never had anything like it, portion is for 3 people.  Desserts are unique and tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MDRUbHZ3RRAB",
            "text": "WOW! Miriam is on another level. The food is incredible, the vibe and atmosphere are elegant and natural feeling, great music and great service. I had brunch and would definitely come back for the entire menu. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdC1DUWFnEAE",
            "text": "Delicious and flavorful meals in a charming and lively section of the upper west side. The frena is a must with some labne and matbucha (think bread cream cheese and tomato sauce but elevated). Loved the short ribs and kadaif shrimp. Outdoor dining is very well lit with plants and flowers. Indoor was a bit loud and had stunning decor. I also opted for the hibiscus iced tea which was perfect and hydrating but unfortunately they ran out and I couldn’t get seconds!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dnNQbHd3RRAB",
            "text": "Visited the uws location...and I'm quite dissappointed.\nUnlike their Bk location, this wasn't as good as expected.\nThe food was NOT freshly made.\nAttention was bitter and the space sitting/table is very very very reduced, even for a New yorker.\n\nOn the other side, shawarma had a great taste, everything else: wack."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSlVGWTNRMEpEWTNsemJsY3plRUZHUlZCb1kyYxAB",
            "text": "LOVE IT HERE! I come always for my birthday, but today I want to shout out our server Kevin! Such a fun, knowledgeable, and helpful guy. We love him. Thanks Kevin!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReVdVcHJkWGcyZUU1RloxcFBUSFV3YXpFNWNXYxAB",
            "text": "The food is special and so tasty! We love their brunch - serving up great options for adults and kids alike. For brunch, we’ve tried various options and don’t feel you can really go wrong."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bmVIWFl3EAE",
            "text": "We had a wonderful meal here at Miriam! The food was delicious, drinks tasty, the staff was super friendly, and the ambiance was inviting and comfortable. I would definitely recommend this place and hope to visit again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cFUxOU9SbFV6Tm5GM1RuaG1RMGN6UzJoWmVHYxAB",
            "text": "Brunch used to be amazing here. But, they just changed the menu, and the new menu is meh. The portions seemed smaller, the ingredients are lower quality and less original, and the vibe was just off. I don’t think it’s worth it anymore. Too bad."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGOG9UN29RRRAB",
            "text": "Revised review:\nUnfortunately on my most recent visit last month in November of 2024, I discovered they had reinvented several dishes that used to be great, like the chicken shawarma. The dark meat replaced with dry breast meat and the whole thing lacked the depth of flavor it used to have.\n\nSeveral other changes also contributed to a decline in quality.\n\nShame.\n————————————————————————-\n\nA reliable tasty staple in the neighborhood. I especially love that they use dark meat for chicken shawarma. Generous portions.\n\nTheir vegetarian options are also great, they use ‘Chunk’ vegan steak which is probably the best vegan meat alternative I’ve ever tried."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoejZudzNBRRAB",
            "text": "Came for brunch on a Saturday and was able to get a table even though it was prime brunch time. The restaurant filled up but wasn’t loud at all. Miriam is beautifully lit with lots of natural sunlight coming in and the decor is very mellow and comfortable. Their orange juice is great and my Israeli breakfast plate was delicious. I also had some of their French toast which was great as well. The service was fantastic and I would come back or check out their park slope location next."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNmJWVnlWM0JGUjA5UGJrRnVTWEl6YTBneFdtYxAB",
            "text": "A nice Brunch restaurant which offers a variety of brunch and breakfast items from around a few cuisines.\nThe portions are ever so generous.\nI recommend the.Mint Tea and the Eggs Benedict Latkas."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdE9DMFl3EAE",
            "text": "I had the red shakshuka, it was good but to me the tomato sauce was a little bland. Hummus was tasty. The rest of my party loved what they had. The waiter (Mets fan) had good knowledge of the dishes and was very helpful. However it took forever to get the food. We’ll be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUeDhTOFV3EAE",
            "text": "Excellent lunch. We had the lamb shawarma and the Israeli breakfast. Everything is fresh, the vibe is nice and service was good.\n\nThere is a 3% additional cost for credit card transactions if you prefer to pay cash."
        }
    ],
    "reviews_count": 50
}