{
    "name": "The Ribbon",
    "place_id": "ChIJeXBWf4tYwokRkseOOZT3_mc",
    "grid": "MN7",
    "address": "20 W 72nd St, New York, NY 10023, USA",
    "rating": 4.3,
    "user_ratings_total": 1089,
    "phone_number": "(212) 787-5656",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdE0zSmZTamt5U2tsVlJXTlRVVjkzV0hCUk5HYxAB",
            "text": "I made a reservation for 9 people at The Ribbon as a post-marathon celebration. I booked two months in advance, as I had friends and family from around the world in town for the weekend. The restaurant called me a day before the reservation and told me that they couldn’t honor my reservation. All I can say is this I’m shocked and truly very let down. Had I known in advance I could have made alternate arrangements. The restaurant shouldn’t be taking reservations it’s unable to honor, and if they do they should notify people well in advance. Terrible."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkT2RVOUViVFJLWDBweFIydGhaVlZaV0VaQlgwRRAB",
            "text": "Not sure how to rate yesterday's experience, but I'll try. 2 of the 4 of us really liked their meal, 1 said it was ok and then there was me.\nIt started when the waitress asked if there were any questions and I asked about the fried chicken. She responded it was what you were known for and I asked if it was only white meat and she responded yes, only white meat. I told her I like only dark and I didn't order it. I opted for my 2nd choice corned beef hash.\nMy friend was willing to bet that the order would come out wrong and he was right. She must have been new to the restaurant.\nThe order came out piecemeal and things were left out. We flagged a back waiter and the missing pieces were delivered.\nWell , my friends fried chicken came out and low and behold there was dark meat on his plate and to add insult to injury my corned beef hash was mostly broccoli and potatoes with only a hint of corned beef."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdFVXOU1NWFk0ZW01dFQxTkNVMmhGWDFOMU5XYxAB",
            "text": "Nauseating food and drinks. I immediately felt sick after the first few bites of my burger. My husband’s beer was sour and chicken tenders didn’t taste good (although he feels fine). Do not go here."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WS1FsVTBSVzF4U2tZM1oxZFRXbkl5ZUROTlZrRRAB",
            "text": "The best\nThe food was sooooo good"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaVVFTnVXSGRuVlhFMU1rNDNSV2Q0V2pKSWNIYxAB",
            "text": "We had a great date night at The Ribbon. The food was delicious, service was excellent, decor was so interesting with vintage items and most impressive old photos and art from a private collection, credited on the wall. We would definitely go back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNlh6WlNkR1JNUjJ0SU16TjRTR3R4Y0haVk1YYxAB",
            "text": "We traveled all the way from Miami to celebrate our wedding at The Ribbon, and it couldn’t have been more perfect! From the owners and managers to our amazing event planner Heather — and the incredible servers and bartenders — every single person made the entire process easy, seamless, and truly enjoyable.\n\nThe decorations were stunning, the food was absolutely delicious, and the service and hospitality were unmatched. Everyone on the team went above and beyond to make all our wishes come true, and it showed in every detail of the night.\n\nOur guests are still talking about how beautiful everything was and how wonderful the staff made them feel. We’re endlessly grateful to The Ribbon for creating such a warm, elegant, and unforgettable celebration."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTU1uZFlWSFZEVW10RGQzRlpjbVkwUWxOclFuYxAB",
            "text": "Delicious food in a nice atmosphere with great service"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRGFtZHNlbFY0Y2xSWlJEaFpUakJMVkRWME9IYxAB",
            "text": "Walked in without a reservation and got seated right away (party of 3). Great service — our server was friendly and had solid recommendations. The steaks were perfect; the bolognese pasta was just okay. But the 16-layer chocolate crepe cake? Absolutely amazing — one of the best desserts I’ve ever had! Note: 20% service charge is included in the bill."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbVYzQk5hVzR5ZEhBelgzTTVjRWRXVERkQk0xRRAB",
            "text": "Riley got us seated in a comfortable booth seating for our party, and the interiors were really festive. Halloween is coming!\n\nTried their Ribbon Lager, which was really crip and light and easy to drink. For food, we got a few things including Mac & Cheese and Butter Pasta for the kids from their kids menu.\n\nI tried their Parmesan Cheese Ravioli ($26) which was really good. Phillipe, our server suggested Fried Chicken ($32) for the table which for perfect for three adults to share. Their Truffle Fries ($14) didn't really have a truffle kick. The Tuna Crack Rice Flight ($26) was impressive as well.\n\nNoise levels were on the higher end, they had a private party going on. Amazing outdoor seating too.\n\nOverall - a very nice experience. Will be one of our favorite places to go to in the area!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSVJYcE1hRmcxYzBaa0xVeFFVMHMyZFVoemJXYxAB",
            "text": "Great lunch spot - great mix of food for the whole family. Tremendous service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3dGFrZGtSM2xZWmtrd01UWjFkV1ZtVkVaRFVsRRAB",
            "text": "Mario made my best friend's birthday so lovely! The food was great along with the Manhattans. Super cute decor for the fall too, and great views for the Yankees game"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWZmVXaGtWRlp2Y2tGb1RWOUVOVmRZZUhBeVpYYxAB",
            "text": "a great place with great dishes, especially if you like meat. World's best burgers, too. Nicer warm atmosphere, and a very attentive staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVVJVSktWSEpwTFZaMlptSXdORzVKU2tGMU5WRRAB",
            "text": "Dined with a party of 10 in a private room and had an overall fantastic experience. Great drinks, apps and entrees with attentive service. Very accommodating and oh…get the Nutella Banana Dumplings for dessert. You’re welcome!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNldUUmZkVWRJUW0xbE9XOW1iakZ6TUdKUk9YYxAB",
            "text": "The place is nice and the service is great but I did not like the food. I tried the wagyu nigiri that was not good the rice overcooked and the meat not tender and soft, the cali roll did not taste good and I found pieces of crab shell in it and finally the sweet potato gnocchi were too oily and not tasty at all. I will not come back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSFUzQkVVV1J1VjNaSlQwZHRTa3hHZWxaNVkzYxAB",
            "text": "This was a go to place until they Suddenly removed happy hour on Friday night, Without any notice, And the bartender rudely told us they didn’t have it as though we were supposed to know… When my friend and I have gone there at least twice a month for the last year. Friday night is the only night that we can hang out… So it had become our spot to go on the upper west side. We were good customers often ordered food as well. The website still claims they have Friday night happy hour so it’s blatant false advertising. We went last Friday and then walked out without ordering anything. It’s too bad because now we’ll have to find a new place to spend our money! Plenty of other happy hours on Friday night.\nCiao!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bFNrTkZPSEI2WTBwZlVYUnhSM1ZIVVRsUlMwRRAB",
            "text": "Finally had a great meal great service def a go to spot"
        },
        {
            "date": "2달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMFQzRm5lRUoxWVU5Wk5sazJTbXBKY2xsQ1VGRRAB",
            "text": "Empfehlung. Das Steak war super."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbFp6WXlkR2xuVUVGeVJXOUhVVXBvVEhZM1puYxAB",
            "text": "Its a nice middleclass restaurants. I had good good and I enjoyed been there"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTloxRlhXR2hJZDAxNGRITllSbk5NZGtjMGRVRRAB",
            "text": "Service was extremely slow in a sparsely filled restaurant. It looked like perhaps 12 other customers. I had to wave to get attention after 15-20 minutes of waiting.\nWe finally got a server and gave our food order at the same time as our cocktail order as we were uncertain when we’d see him again.\nWhen what appeared to be a kitchen staff member brought out our orders, my wife’s order was wrong and we had to wait for the replacement.\nI would highly recommend that you keep walking past this restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKa2VHcEVNbTVTUlZWSE9HVkhPR1JGU0U5SGJFRRAB",
            "text": "One of the best dining experience we’ve had in Manhattan lately. The server was excellent, the food was amazing and it was the perfect night to sit out on a New York City patio."
        },
        {
            "date": "2달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWWVtOHhhMVZEZDFrNU1VUjVNM0pIUkZSYWJtYxAB",
            "text": "Ambiente confortável e agradável. Atendimento muito bom e comida excelente."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KR1RtUllRMDlXY0hSd1oxTXlUQzFqWWt0d1YxRRAB",
            "text": "Food was good, but the atmosphere and service were just okay."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMVpWTkRWVEZJU2xoMVNUWXhiSGt5VUMxS1luYxAB",
            "text": "I came to this restaurant wearing an abaya, and from the moment our waitress saw me, her attitude completely shifted. She looked at me with clear disgust and carried herself like she had a chip on her shoulder. Every request we made seemed to annoy her, and although she tried to mask it with forced politeness, the negative energy was obvious. The experience left me feeling singled out and unwelcome. Also DO NOT order the churros, they’re terrible."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wT0xWaEZjbEV5WVRCMFltbDRlR050TUhoU1RYYxAB",
            "text": "Met a friend here expecting a typical, serviceable midblock UWS experience. Wow, what a delightful surprise. Great neighborhood vibe, and friendly, knowledgeable servers.  Tremendous wine selection. But honestly, the food was just superbly executed.  Sushi was shockingly well done, and the Bao Buns were showstoppers.  I lack imagination, so I ordered the sirloin after that, and it was a perfect medium rare, flavorful with a nice char.  Shouldn’t have gotten desert, but after some Cabernet decisions weren’t well considered. But the 16-layer cake absolutely popped, even as I was fading.\n\nThis is my new “go to” on the UWS. Totally unpretentious, fabulous execution.  The Ribbon is…Blue!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saE1FTXdVVE5IU2pWU1kxRm9OWFJ0WDJwaVJVRRAB",
            "text": "I had a group of 11 here on a Saturday. The food was incredible, the drinks were fantastic, the cheesecake was creamy. They were so quick getting our food out! 10/10 recommend and I cannot wait to go back. This steak I got was delicious! Haven’t stopped talking about it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaFkwMTFhMHBxZWxKMFpIRkNjR3hOWW5kMWRrRRAB",
            "text": "Came for a birthday brunch! Great food and service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STVRXSlZSSE5aWVdsVWRFeFZkRlJ5VldSUldtYxAB",
            "text": "Everything was a solid four stars for the ribbon. The food was rly good! And price point was super reasonable. Cute ambiance and good service. Wasn’t out of the world hence no 5 stars but a super solid choice and would definitely go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeFRHTkxVRloyYVhkaGNqVXhXbWs0U1ZRNVgxRRAB",
            "text": "Nice place in a great location\nVery good music and atmosphere\nThe prices are bit higher than the top end of the scale"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KV2NtWm1VMGRZYlhabFZtVmhURmt0YWpKc1MwRRAB",
            "text": "Nos encantó The Ribbon. El ambiente es acogedor, con una decoración elegante pero sin pretensiones. La comida estaba deliciosa, bien presentada y con muy buena calidad en cada plato.\n\nAdemás, el servicio fue excelente: atentos, rápidos y muy amables durante toda la cena. Un sitio ideal para disfrutar de una buena comida en un entorno agradable.\n\nTotalmente recomendable, repetiríamos sin dudar."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMU1XWlFTMWRMTmtkdlZWUkpRVEZUUkV4MVZIYxAB",
            "text": "I suggest that the restaurant close for renovations: the air conditioning worked very, very poorly, and the draft beer listed on the menu was also completely absent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWllsQmZRbmxWY2pCRlEzVmlUV296TWprNFdtYxAB",
            "text": "We came here to celebrate my niece’s 15th birthday. The food, atmosphere and service were all great! Our waitress, Stefania was particularly wonderful and engaged with us throughout the evening, making the day even more special."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RVRFUXpWazFQZEdOMFFtaElPWEpXZVdJMlVFRRAB",
            "text": "It was pouring rain and we ran inside to escape the elements and to grab a bite to eat.  We will be back for the service for sure. Felipe was our server and he was phenomenal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMWQyTndjME16ZGkxRmNrOWlVMlJFZFVoTVEzYxAB",
            "text": "I’m not one to leave negative reviews but this place really made us feel unwelcome the moment my group of 7 walked in on a Saturday evening. As soon as we asked if we could join tables to accommodate our group in their outdoor dining section, we were shut down with a snappy attitude and told that they don’t do that, which is incredibly weird in NYC. I asked a bus boy and he confirmed that they indeed do join tables when needed… the service was atrocious, the waiters messed up our order 3 times. We were served flat beer. As a native of the neighborhood, I’m disappointed in the cold service and will not be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUFgxWjJOR0pRTjE5TFpYSnVRbFZEWWxwc1RVRRAB",
            "text": "Fantastic spot on NYC’s Upper West Side!  I hosted a company Happy Hour event here this week - it was a great choice!  This restaurant and pub have an excellent assortment of delicious appetizers and sushi.  Try their awesome lemongrass chicken dumplings, and check out their first class grilled and seafood dishes.   The Ribbon is a superb venue with phenomenal food and excellent service.  My new fav in the area!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OU2IwUnJXWGxyV1hkS05UZEhWbVpFZFdSR2IwRRAB",
            "text": "Coming out of Central Park on 72nd we were happy to see good reviews for The Ribbon just in front of us. Grabbed a nice table outside and chose from a good selection of cocktails and beers. Platter of sushi to start was expertly made and proudly delivered. Lobster & Shrimp curry, Crab Cake and special seafood linguine were all very good. Menu had lots of other choices as well. Paying was also not bad as price for the location was very fair. Highly recommend especially if hungry/thirsty after a walk in the park."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKd2VUazJOblV3V1ZreVJUVkNOall3YzBZM05tYxAB",
            "text": "Cool spot. Food was good enough to feel value for the meal. Ravioli Cacio was lighter than expected and not as rich as expected in a good way.  Ribbon roll was good and big enough to share.  Don't totally understand the asisan part of the menu but it was good.\nRaphael gave great service. Wife's  cod was well cooked and good.  A few hiccups with the bar but intentions were good and they tried to make things right. Neighborhood bistro vibe that is worth tourists dropping in and feeling like dinner out was worth it.   If we lived here would be a spot we'd come to once a month or so.  Very much recommend and will come back the next time in nyc."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVWQyaHNZelJ3WDA5NU1EVTBkakZxY2w5YVpXYxAB",
            "text": "Great food and service.  Well priced and just overall lived the vibe and area of town."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeExUWTVVazFJWW5kbFVUbE5hakpLTmtoRFMyYxAB",
            "text": "We ate there months ago on a snowy day so we were excited to return on a sunny summery day. My burger (the sand item I ordered in January) was hard. The server practically nonexistent. We won’t be returning."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RNVMyOWZWM1J2U1dKMlRGazJOREpYYVV4eFRYYxAB",
            "text": "It was so good if i need to be honest the ribbon steak was a masterpiece.They paid attention when i told them i had allergies."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGa05reHNRMjlNVFVKbmFGOHRTV2R1ZUd3MFdYYxAB",
            "text": "The whole experience was fantastic. Great food, excellent service. We sat in the dining room. Excellent atmosphere.\nGreat appetizers!\nI had the fried chicken and it was excellent.\n\nWe will be back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWU1IVkRVa1pyTjJObE9WVnJkR2hUTkd0R2FsRRAB",
            "text": "Wandered in here for a late lunch. We shared a few appetizers. Pleasant atmosphere.  Overall good experience. It was quiet, but we were here during off peak times. We imagine it could get quite noisy if full. Would return when next in the city."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRmJqTXpTV1ZETkRndGVVSktRMWRhWTBScFkwRRAB",
            "text": "It was an utterly amazing experience, specially for the waiter/barman Salvador. I will definitely come again thanks to him. Congrats, Salva."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPU0RrSnZpd3NTWW93RRAB",
            "text": "Hugo was a great bartender for my dad and I on his birthday, he was so kind and fun to talk to, hope we can see him again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWeGMyZEVWalF0WDFWT05FRTJjVmhpTkZCSGNrRRAB",
            "text": "Not happy about my experience here. Big bald waiter felt like he didn't want to help us much. Food wasn't great either. Never returning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS1JvWXpfOWFidDBnRRAB",
            "text": "Stéphania is amazing! Seriously super kind"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJR08xWmV0MEw2M0xREAE",
            "text": "Excelente lugar, comida, atención."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNeXhrZnU4OS03N1ZBEAE",
            "text": "Love the fried chicken here and the chips are excellent as well. Very well done chopped salad, too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLMlp6YUdTeU8zT05BEAE",
            "text": "The food made me sick! After the quinoa salad, I had stomach pains, then had to use the bathroom multiple times and finally threw up. The quinoa wasn't cooked all the way, but I'm not sure that was enough to get that sick. There may have been something else in that salad because after all my travels around the world, very few times in my life have I ever experienced this! My partner said he didn't feel anything, and he had a burger. So maybe stay away from their salads?"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNzdLMmxnRRAB",
            "text": "Got food poisoning..First time trying the Ribbon and really wanted to like it. However, unfortunately things went from bad to straight up a nightmare. Firstly, we were seated in the back with very little airflow and no AC. The food that came out looked pretty good so I still had high hopes for my French dip sandwich and breakfast plate with runny yokes. However, a dried up sandwich and overcooked eggs was served. Luckily the mimosa pitcher helped to wash half of it down. We left being slightly disappointed, especially as I think the place has so much potential. Little did I know, later that night I realised I had gotten food poisoned (only thing I ate that day) and was out of commission for almost 3 days. Would not recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaDVXcDZBRRAB",
            "text": "Love the Prime Rib Sandwhich! 😀"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNU1PTUNBEAE",
            "text": "찐로칼느낌. 홍보가 안되서 그런지 한국사람없구요. 직원서비스좋코 리본스테이크 맛있고. 치킨맛있고 돈얼마안나왔어요. 그리고 센트랄파크인근으로 화장실가까워요"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncXNENnF3RRAB",
            "text": "I was brought here by my husband for Valentine’s Day dinner. Great choice. Steak was perfect. Oysters were a nice touch and the drinks were top notch. I would definitely recommend. We got there just as dinner was starting so it was a little quiet but started to pick up by the time we left. Waiter was attentive and made good recommendations."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbmJiM0JREAE",
            "text": "Food was great. Everything was loaded with flavor. Id recommend the full booth in the back if you can get it. Seats about 6 with 1 chair at the end. Went for my sons birthday dinner since we happened to be on the west side and we were happy with our choice. The front is nice but the back has a completely different feel to it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUODV6UUpnEAE",
            "text": "Late lunch date at this really nice restaurant.  No trouble getting a table, the staff and bartender were very welcoming and attentive.  Brunch menu.  We sat at the bar, there are lots of tables as well as outdoor seating. Drinks were well made and generous!\nHad a great hamburger (with bacon😁). The restaurant is accessible ♿️. Street parking."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ3EyTHhRRRAB",
            "text": "We went for Happy hour and loved it.  There are 3 types of deviled eggs to try and all were great- the salmon one even had red caviar on top :).  My favorite Happy Hour dishes were the sliders and the chicken tenders (I am finding it difficult to find good tenders in NYC and these are very good). Was very busy on Saturday evening but we got a seat right away. We will be back 😀\n\n[To the Ribbon mgt: feel free to use my photos for your marketing- no credit necessary ]"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdzZEWTFRRRAB",
            "text": "This place was amazing. The vibes, the food, the service. Although I know they forgot to add my main entree they did a fantastic job making us feel as if it wasn’t forgotten lol. They where very accommodating and the food comes out fast, fresh and delicious.\nMac and cheese is basic, I would pass, besides that our group ordered a wide verity of items and it was Fantastic."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNHFHUWFREAE",
            "text": "I'm not a huge fan of southern food but I have to say that the appetizer menu at the Ribbon is fantastic. They have an awesome oyster special as well, making the bar area a great place to have a drink and some oysters. The Ribbon in general is a beautifully done establishment with very nice and attentive servers. I highly recommend it here, especially for happy hour!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlejk3UzhRRRAB",
            "text": "Amazing place, wonderful atmosphere, awesome employees!!\nFood was extremely delightful! Everything we got was exquisite! The wine recommended was perfect! Great family atmosphere place.\nHighly recommend the Lobster and Shrimp Curry! 🦞 🦐  ♥️ 🍷🍾\nWill definitely be returning and recommending to EVERYONE! Simply love the atmosphere and look of this place! 😎"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSMjlyZjBRRRAB",
            "text": "The place is quite spacious, with nice private rooms. Good for large groups and families.…"
        },
        {
            "date": "6달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvemRieXlnRRAB",
            "text": "Rewelacyjne jedzenie i wyśmienita Margarita! Polecam jeżeli szukacie dobrej miejscówki w okolicy Central Parku i Muzeum Historii Naturalnej 👍"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdHRyYTN3RRAB",
            "text": "Ordered medium rare burgers and got well done dried burgers. Meat wasn't even tasty. French fries are more chips than fries as they are super hard and  thin. The service was super slow. They had us waiting for an additional 30 minutes with…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscmE2aTZBRRAB",
            "text": "We did their thanksgiving day lunch, and it was delicious. The food arrived quickly, the thanksgiving day menu had a bit of everything for everyone. The service was good and the drinks were also good. The restaurant was clean, and flowed well. I would go back to try their daily menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcnFTaVpnEAE",
            "text": "Nice atmosphere. Friendly staff.\n\nFood is worse than any local diner. $19.50 “breakfast sandwich” arrived; took a bite. Tasted very bland, so opened it up to at salt and lo and behold it has one tiny, thin egg. Paper thin.\n\nI asked why only one egg, and was told by the manager that the chef portions it that way and it’s calculated for revenue and profit etc. Point being, this chef thinks one egg on a breakfast sandwich is respectable food to be serving for $19.50.\n\nMy wife asked for butter for her stack of toast. They bring four little tiny bricks of frozen butter.\n\nJust silly. Not a serious establishment."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteW9IQjFnRRAB",
            "text": "My experience at this establishment was nothing but extraordinary! Our server Luna was absolutely delightful and we were treated very well and constantly assured when waiting for our order. The restaurant is very well decorated (it’s a…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNjRLaW5nRRAB",
            "text": "I would rate this 6 stars if I could! Had an incredible southern fried chicken here - this was my first, so can't compare but if this is what fried chicken is always like, then I regret not having tried it for so many years!…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBeFlEZVRBEAE",
            "text": "Best restaurant on the upper west side. The atmosphere is energetic and welcoming. Great for friends or family.\n\nExcellent service all around. From the hosts to servers, everyone is professional and friendly.\n\nThe food tastes great. The chefs really know what they are doing. Everything is cooked to the correct temperature and the flavor is exquisite. One of my favorite dishes is the vegetable risotto. Healthy and filling."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNVBiM1BBEAE",
            "text": "Went in during the day time. Had a pulled pork burger and some pasta. Our server was Mario. He was quiet but friendly. The pasta was really good. The fries with the burger were moreish. Crunchy and super thin. The beer was fine but could do with more choice. For the area it's a solid choice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bWNhdE1REAE",
            "text": "Pleasantly surprised that they have several kids menu options (not printed). The burger was good (forgot what a good restaurant burger was), the fried chicken was extra crispy, and the fries were fantastic. It's a nice spot for a good meal and the place is large enough that getting a table is not too hard."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNTd1MGlBRRAB",
            "text": "The smoked brisket was very dry.\nEverything else was fine.\nGood location.\nPlenty of room to move. Family friendly.\nThe half armish chicken was the winner and highly recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHcF92UmZnEAE",
            "text": "My son took me to breakfast here. I love this place! My personal food assistant was amazing. They were very attentive, patient and helpful. The decor was very pleasant, and it was very well staffed. I will return on my next visit to see my son."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzX05MSk53EAE",
            "text": "The Ribbon is one of the best restaurants in the UWS. Everything I have tried here so far has been excellent. The wait staff is always friendly, the drinks are strong, and the food is delicious. We've come back again and again because although the price is a bit on the higher end, the food is incredible. We have never left thinking we paid too much, even when the bill is over $150 for two people, it is soooo worth it.\n\nJust writing this is making me want to come back... guess ill see you next week, Ribbon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaanQ2bS1RRRAB",
            "text": "New York neighborhood upper westside go to. Super attentive staff, well rounded brunch menu, full bar. Scrumptious eggs Benedict, on a homemade super thin English muffin, perfectly cooked potatoes and a cute side salad. Sports on the TVs and smiles on faces."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBaTluVm93RRAB",
            "text": "Had a reservation for 4. They made us wait 20minutes because there were also 2 children in the reservation and they wanted us to change tables. Finally we convinced them we can all fit in a table of 4 with 2 high chairs, that’s what I…"
        }
    ],
    "reviews_count": 73
}