{
    "name": "Hi Life Bar & Grill",
    "place_id": "ChIJyTJKxYVYwokR6Xgqq38yAi4",
    "grid": "MN7",
    "address": "477 Amsterdam Ave, New York, NY 10024, USA",
    "rating": 4.4,
    "user_ratings_total": 779,
    "phone_number": "(212) 787-7199",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMVVIRldUbmQwWlY5eVRtSjJUR1pGYW5JMlgyYxAB",
            "text": "Please don't come here all the time and crowd me out just because I left a great review. The food is reliably delicious. Whatever they are doing in the kitchen, its working and appreciated! Servers seem to be from a place where they care about you. Not the most NY way to do things for food service staff in a local neighborhood place. Greatly appreciated! So many great places to eat and have a drink on the UWS but Hi Life is consistent and reliable."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMWRqSkVkbVJUVVVsUFJtMTBMWEJpYUZoUVRWRRAB",
            "text": "Easily the BEST (and most reasonably priced!!)  🥩 and 🍸 on the UWS!! I love in the neighborhood and I've been to EVERY restaurant on the block. This one is THE best. Service and staff are incredible, great energy and vibes inside. Food is delicious, drinks are overflowing and the people that work there are IRL genuine & kind. to. you. Come and try it out, you will not be disappointed 😎 cheers everyone 🥂"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQlkyd3dNSGxtZFhGUFFrcFdRVFYxVXpKcmJXYxAB",
            "text": "Excelente comida ,y postre delicioso sin duda volvería pronto....y la mesera muy linda y amable."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oaE9YQkpjMUZMUTBwT1Vra3hlREY1WW5vNVozYxAB",
            "text": "Nice drinks. I didn’t order any food but I saw they had a wide selection to choose from."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsT2NYWnJXR1JOV2sxdFprWXdibVY1WTJ4YWNuYxAB",
            "text": "The Steak Au Poivre was absolutely delicious. It was cooked perfectly, the mashed potato and cream spinach sides were the perfect combination. Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTFNqSmxTRnBQWWxNMFZ6RnhiWGRFUlcxMGVIYxAB",
            "text": "Love this local spot. Their happy hours are great, oysters are delicious and they serve sushi."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbWFWSk5Oa3RtTUV0MFoxTnBYemhSYURWSE4wRRAB",
            "text": "My favorite neighborhood spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21salYySXpORVl0UjFoc1REVmZTVTVOUXpNNVFVRRAB",
            "text": "We always go here before we go to whatever in Central Park. It's a few blocks away. Always cozy, good, decent reasonably priced food. It's small. I personallyove the place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdlJWcEhXVUp0YTA1dFowTlhOR1pCZVZGVVUxRRAB",
            "text": "Our go to spot in the Upper West Side for solid pub food that also does really fresh sushi and raw bar. Service is always good as well."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MFJGTnZkalJpWkhvM1JVOWpVVXgxYmkxMmEyYxAB",
            "text": "I love to keep coming back here and taking my friends and family! The atmosphere is incredible - very cozy and cute in an authentic way. The service is incredible - everyone is so relaxed and kind. The food is excellent - they have such a wide range of options (including sushi and a raw bar) so that literally anyone could find something to enjoy. I love the champagne cocktails as well. Be sure to check out their happy hour! This is one of my favorite places in the entire city and you really won’t be disappointed!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padldFaDRNM2hzU1c5S05YQXpkR1Z6Y0Rkd1puYxAB",
            "text": "My favorite neighborhood spot! Big fan of the martini’s with the sidecar. I keep coming back over and over. The staff are always so friendly and accommodating."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MmJETlVYM2xCWWxCdloxWTFWRlZoWHpaR2RsRRAB",
            "text": "A neighborhood gem!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWlJGaGFNMmRtZEZkcVMwODNaMGxKYjFJMVQzYxAB",
            "text": "Best brunch in Manhattan - best atmosphere and best servers!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUU5ISnlaVFprYVZoS1ExcHZNVkZFWjE5eFNFRRAB",
            "text": "Excellent"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZk9nN2ljcmJQOGpRRRAB",
            "text": "made a large group reservation here for my post-law school graduation dinner with family last night! Earl and the staff were great to work with and we could not have had a better experience! Thank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPelFyc0x5LU42emJREAE",
            "text": "One of my fave places near Central\nPark:)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQWGNyLW1CamZiS25nRRAB",
            "text": "The best spice margarita in the city, I loveeeee, and I taste a lot margaritas spice haha believe me, one of the best in the Town. Highly recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMQzhuTDNUbnRTYlB3EAE",
            "text": "I'm sorry that I've not dined here before. I went for brunch with seven other people and we very much enjoyed the food and atmosphere. The service was friendly, welcoming, courteous. Our server was so kind, attentive, pleasant and patient with us. Compliments on your diverse and appealing menu. Good muffins, but the highlight was Paco's breakfast burrito. Thank you for an enjoyable afternoon."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPTG1nZk9pcF9qSkRBEAE",
            "text": "Excellent spot, big menu and everything was delicious. No wait on a Saturday for dinner somehow. Sushi was great. SUPER reasonable prices for the city"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPT1N5WUtEb2R1bVFnEAE",
            "text": "It's like 1982 in all the best ways. My first days in NYC."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOUxqRUxnEAE",
            "text": "Cool joint worth stopping by on the UWS"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM1pxbU93EAE",
            "text": "Thanks Earl. I’ll be back again. Food is too good not to. I love the place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM2RxOVdBEAE",
            "text": "Came with a friend for brunch ..the challah french toast was good. Came with cinnamon butter and a muffin which was nice.  Excellent service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbGNURzNnRRAB",
            "text": "If you love to travel the 7 seas on a giant Cruise ship, then this restaurant is for you.  After being greeted by a hi-tech exotic aquarium when you walk in, you are kindly seated in a Carnegie Deli style dining room that would make Guy Fieri jealous.\n\nThe menu is reminiscent of a Carnival Cruise dining room - Oysters, Sushi, Argentinian Skirt Steak, Pad Thai, Italian Pasta, and if you order off the secret menu Shrimp Burritos. The drinks are tropical and come in sweet tiki cups! Please do not steal them. It adds to inflation when you do…\n\nThe pesto aioli and Fries were my fave! If only they had a Molton Lava Cake for desert… 5 stars."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJM29MdDlBRRAB",
            "text": "Been coming to hi life for over 30 years! Own brownstone on 85 st. Here the PROBLEM! Food good but took my friend for happy hour! Mix drinks first $8 then waiter said $11 then $12.75! No problem! The problem was the Indian young bartender on Tuesday April 1st AFTER 7 rounds & my friend total 13 to 14 drinks the bill was $135! Paid with credit card! But gave the Indian bartender $20 CASH in Tip! AS I WAS LEAVING AFTER 2 HOURS OF DRINKING SHE ASK ME WAS THE SERVICE BAD? ANYTHING WRONG? CAUSE SHE WASN'T HAPPY WITH A $20 TIP IN CASH! SHOULD  TIP MORE SHE WAS LOOKING & HINTING! VERY LOW CLASS ON HER PART! I BEEN IN THE AREA SINCE 1970! WAS A PARTNER AT RACCOON LOUNGE YEARS AGO ACROSS THE STREET FROM YOU ON THE OTHER CORNER! Other WISE your PLACE is GREAT vibe! All the best!\nSteve.\nP.S. Earl great place for over 30 years! That young Indian girl bartender NEEDS to be talked to! Too hungry for more $$$ and tacky asking for more tip money!\nNo worries!  Steve."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cktmajJRRRAB",
            "text": "Sushi is the best!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRd29IRk93EAE",
            "text": "Chill spot. Even though it was pretty full, the service was good."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRblBUcHBnRRAB",
            "text": "Megan our server was outstanding.  She picked my dinner, Lemon Chicken, which was excellent.  She also put up with my snarky humor and brought me Manhattans that include a small carafe with a little extra, very much appreciated.  My daughter and her friend had the sushi and raved about it.  The menu is very diverse and the ambiance is old school.  The only complaint was that the clams weren’t shucked correctly, they need to slide of the shell, not still be attached, otherwise they were fresh and the perfect size."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfN0xiUFJREAE",
            "text": "Are you a foreign looking for great espresso? Although, it's mostly a bar, they have an amazing espresso coffee, that you might enjoy in their bunch on weekends (and maybe holidays).\n\nAmazing espresso means not the best in the world, but definitely one of the best in the US which isn't known for having good espresso in their cafeterias."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdGFlLUdnEAE",
            "text": "Great place great service always!!!\nStaff is super friendly"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNzllRlhREAE",
            "text": "Earl and Nicole are the reason we had such a great experience here. They were so welcoming to our family of four. We ordered hot chocolate for the kids, and the dim sums and garlic edamame for us - they were was amazing! Unfortunately, the customers next to us were a bit confrontational with us having our kids.. hopefully it’s just a one off experience.  It was our first time but we’d definitely recommend this place to anyone looking for a quick bite and cozy vibe."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmamQ2NnFBRRAB",
            "text": "Lugar para comer, beber y escuchar buena música, a precio asequible"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbHJyTFFnEAE",
            "text": "Hi-Life Restaurant offers a delightful dining experience that blends exquisite cuisine with a warm and inviting atmosphere. The moment you walk in, you are greeted by friendly staff who are eager to make your visit memorable."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbHREM1RREAE",
            "text": "Absolutely dreadful and horrendous service. I stopped in with my friend to get a night cap and he received a broken glass . He cut his finger while reaching for the glass and shed blood. We alerted the server and she was monotonous and dull,  barely offering him a band aid. We didn’t expect her to call an ambulance but an apology and new beverage would’ve been the appropriate response . We didn’t even get that drink taken off the bill and when I asked the server about it , she brought back the chipped cup demanding where he cut himself. This is extremely unprofessional, insane and disgusting treatment of customers. I will NEVER come back and you should not visit! A “Karen” would’ve thrown a fit having the whole bill compensated. Horrible place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcG9lUDNBRRAB",
            "text": "Very dark and dive aesthetic for the area which was not expected.  I heard the bartender say to another patron (assumed friend by the amount of attention she got in comparison to others) that someone asked for a cocktail and she didn't know how to make so she just gave her anything.  She didn't try to sell me any food and I only learned they had food because another patron asked.  Felt like I was on an episode of Bar Rescue and Jon Taffer was going to burst through the door at any moment."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaXNQTlNREAE",
            "text": "Great spot to get some breakfast after a long night out. Food is delicious.  Get the west sider- two fried eggs over yellow rice and black beans. Decorated so cute for Christmas! And try the frozen shots!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQb2ZLUGVBEAE",
            "text": "Great place!!! Have been coming here for years with the family 💪🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMza0xqcWhBRRAB",
            "text": "Good for groups, we called ahead and got a seat, the same evening. A bit of old NYC nostalgia, one of a few spots from the 90s still open. Big menu, lots of veggie options"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOGV5UDl3RRAB",
            "text": "Truly a great spot for food and drink. Atmosphere is all they say it to be. Definitely going back when I'm in the area. We had Buffalo wings and the HiLife burger, the Blue Cheese burger and coffee. Everything was up to par! Service, great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua0tQeS1BRRAB",
            "text": "Nice brunch. Complimentary cinnamon sugar toast is great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbDdIUWVREAE",
            "text": "Back in New York again, and I couldn't resist stopping by Hi Life, one of my all time favorite restaurants. Once again, they delivered an exceptional experience. The food was not only delicious but beautifully presented, and the hospitality was, as always, warm and welcoming. Whether it's a casual meal or a special night out, Hi Life never disappoints. Their consistency in quality and service truly sets them apart. Highly recommended!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURreWJxV3lRRRAB",
            "text": "We’re back again! Or should I say back in the Hi-Life again! … tonight it’s steak night - steak au poivre for me and Argentinian Skirt Steak for my friend, both cooked to perfection! Paired w icy martinis - so fun!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3X09qdlRnEAE",
            "text": "My favorite go-to place for martinis on the UWS. They are served with a sidecar.\n\nThe burger and fries (with the dill lemon mayo) are also phenomenal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bUtYVGp3RRAB",
            "text": "Mussels and fries are to die for. Could use some toasted bread on the side. Perfectly seasoned and salted. So good we ordered twice!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MUw2VU5REAE",
            "text": "Met a friend here for drinks on a Friday night and this is the perfect neighborhood bar. This small spot is cozy and not overly crowded, but it still had a super warm and intimate buzz about it. I just loved this place. I didn't eat this time, but my friend (whose judgment I trust immensely) said the food is also great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiN3FYS2t3RRAB",
            "text": "Just an absurdly good neighborhood place, thd kind of bar/restaurant you *wish* your neighborhood could have. Everything is delicious, staff are all nice and competent, clientele is all nice (it's self-selecting, I suspect)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyczU2TFFnEAE",
            "text": "I come here every week and order a dirty martini with fries and nachos. Great service! Best bar in the hood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNElxOWZ3EAE",
            "text": "Food was served barely warm."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyakpqS1J3EAE",
            "text": "Such a quaint and cool spot. Perfect for meet ups, and silo dates. Food was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcThLSld3EAE",
            "text": "Had brunch with my girls here. Food was def tasty, we all finished our meals.  We had the blt, burgers,fries and the grilled chicken sandwich with pesto. Our server was great! We have to come back and try the breakfast menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyczgyN0NnEAE",
            "text": "Last weekend, I visited here for having brunch. I got smoked salmon Benedict.\n\nServers were so friendly. Regarding the service, nothing to complain. Just good!\n\nThe fries were salty..and I don't know why it was almost black.......\n\nAlso, one of my muffins was burnt.. it was bitter...\n\nI cannot say it was bad. But it's a shame they didn't focus on the taste..😂"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aHJ6MklREAE",
            "text": "Fantastic burgers (had the Cheddar cheese burger and tried the Cheddar cheese and bacon burger), perfect temperature, juicy, fresh and tasty with home cut fresh crispy fries. Loved the Idaho Potato Skins, absolutely delicious fresh and crispy... my only complaint is that it was too small. Last but not least, the service was A+++. Waitresses and management were very attentive and the bars own patrons were extremely friendly.  Highly recommended, a must go for a laid back sports retro bar / restaurant atmosphere with great American fare 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOX3JIMnRnRRAB",
            "text": "Enjoyed Sunday brunch this morning @ Hi Life. It was easy to reserve, we sat quickly, loved our sandwiches and pancakes and mimosas — and had really attentive and great service. As I was about to head home at the end of the day — I stopped back in to grab a cup of Hot Chocolate to go. And the hostess gladly cooked one up for me and wouldn’t take any money. True story — will be back! :-)"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWX1k3ZkhBEAE",
            "text": "Hola a tod@s.  Les platico que este lugar es muy agradable, una barra tipo pub, el servicio es muy amable y los oysters y clams de la happy hour están muy buenos. Vale la pena ir al happy hour!!!Las ribs están super bien.. la\nZona la puedes caminar sin tanta gente. Si buscan happy hour oysters es un buen lugar para ir y tomar también happy hour cocktails. Vayan!!\nSaludos"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMGJ2c3JBRRAB",
            "text": "We loved dining at this hidden gem. Amsterdam Ave is full of different restaurants and we chose to add HiLife to our restaurant week this year. Service was great, attentive and food came out so fast. The atmosphere is cozy and full of old school photos worthy of conversation. As for the food, the sushi was super fresh and delicious. My skirt steak was just a tad bit chewy but flavorful nonetheless. The pad thai was one of the better pad thais we've had in a long time. The chocolate brownie was warm and decadent. Overall this place has a variety of options on the menu, a little something for everyone."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NUlpZnZ3RRAB",
            "text": "You gotta love Hi-Life.  They have literally everything on their menu and it is all good. Tonight I had a steamed artichoke to start and split a burger with my friend. Everything was delicious. We did not drink tonight, but the cocktails are terrific as well. My favorite is the Cosmo. It’s very pleasant to sit outside on a nice evening. Best of all, the prices are reasonable. Hi-life is a reliable neighborhood “go to” restaurant!  It’s been there forever, and it never gets old❤️"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5ME5TRXN3RRAB",
            "text": "Good food!  Great service!  This is a great spot to get a bite to eat before heading to one of the museums close by! Casual dining.  They have outdoor heated seats.  I recommend this place for people watching or meeting a friend in the area for a meal!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtd0ptQXl3RRAB",
            "text": "Great venue for food and drink before show at Beacon Theater. The service was excellent and they also had a nice selection of beer and shot combos. The skirt steak and pot pie entrees were delicious and fairly priced."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2OC1pX193RRAB",
            "text": "The wait staff was so accommodating and we had last minute 2 more people. The food was fine for price and drinks yummy.  We ordered alot of appetizers to pick and choose from."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybWVQeEdBEAE",
            "text": "I've been going here since it first opened. Great bar. Interesting menu with solid food and lots of choices. Love the cocktails and atmosphere! So glad Hi Life is still here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadUp2aFpREAE",
            "text": "The kind of a neighborhood bar every neighborhood should have. Solid drinks, perfectly crispy french fries, delicious oysters (who would have thought!?!?), on point burger, kind and caring service. Happy hour till 7pm with drinks deals and $1.50 oysters."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnZ0lIYl93RRAB",
            "text": "The atmosphere here is excellent. The food is pretty okay, though nothing amazing. The service was pretty inattentive, but friendly enough. Overall, not a bad choice but it wouldn't be my first."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdHNHcHJ3RRAB",
            "text": "Great spot for a burger, vibey place for a Friday night date or catch up with a friend. Depends what you like but I would try to get seated in the main bar area as the seating out the back is a little quiet. They serve a proper British sized pint here too which is 👌"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaGNyd3ZnRRAB",
            "text": "Delicious lunch, amazing drinks & very friendly staff. Living nearby, this is one of my favorite restaurants in the neighborhood."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzeVpIU05REAE",
            "text": "Good Service,  Nice selection of craft beers.  Even though bustling, place was quiet enough for a conversation.  Food was passable and the wine list was a bit weak.  But the desserts (sour cream apple pie) were delicious!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNWFyNE1nEAE",
            "text": "Perfect blend of divey yet tasteful. Where else can you get great sushi and steak/wings? Loved the garlic wok edamame and eel avocado roll, and blown away by brownie a la mode. Great energy all around"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoeUktQWhBRRAB",
            "text": "The Hi Life is a great local restaurant and bar on the upper west side. They serve late and have a huge eclectic menu.  They offer good pasta, Thai, Burgers, and Sushi!  One of the few places you can go with a group.  There’s something for everyone.\n\nBurgers are great.  French fries are always crisp.  Mussels are good too.\n\nThe bars always hopping and it’s definitely a good time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqME1hQkd3EAE",
            "text": "Bartender in the bar does not give attention to the customers.  I was waiting when she will notice me. I left, many other bars around with good services. You have to hire better bartender, the one that you have now, very slow and blind"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMXFuZVJBEAE",
            "text": "A very lovely place. We had a reservation, but we were 45mins early for the reservation,  they still accommodated us. Food is awesome, service is great. Try this place and proof me right."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdHRxNkdREAE",
            "text": "Américan grill bar pub food. Regular menu is quite nice but brunch is pretty limited. The pasta was good with the sauce on the side. Excellent service."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdTRteFRREAE",
            "text": "Nice place to have a dinner. The staff is lovely and friendly. Special thank's to Luis who help me to translate and order the menu."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3aDlDLXNnRRAB",
            "text": "Hi Life has been a go to spot for drinks and inexpensive eats for decades. They have special deals on items such as sushi (50% off Mon & Tues), appetizers (3 for the price of 2 on Wed & Sun) and more (check their website for deets). They…"
        }
    ],
    "reviews_count": 72
}