{
    "name": "The Wolfe",
    "place_id": "ChIJ7bVx_8RZwokR1CtZHxbP4vg",
    "grid": "MN7",
    "address": "425 Amsterdam Ave, New York, NY 10024, USA",
    "rating": 4.6,
    "user_ratings_total": 175,
    "phone_number": "(646) 876-1004",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGblN6bG5aRWx4TFhBMWJuVjZZVmhMT0ZSa01WRRAB",
            "text": "I love this place. The food and service are always amazing, the Cherry Wings specifically are to die for! Trivia is SO good there as well with amazing happy hour deals."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNFQyZGtWSFZ1ZVZGc01GOWZNRU5xVGxwZmJsRRAB",
            "text": "Food was delicious\nServer was polite and helpful\nBathroon was very clean and well decorated\nNo complaints!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FemIwTjJTVWMzYzBGb1dqRkhObkZQZFZSV2NuYxAB",
            "text": "Great atmosphere for a traditional bar. Very good food and some excellent cocktails. People were friendly and accommodating when we held a small event there."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRVNEUlJlRmhzVm1kNVZVTTJSR05UUkZkbE1WRRAB",
            "text": "They had the wnba Ny liberty flag flying , so I stopped in, and glad I did !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFemJsTjZZamQ2TnpRMGQwOVVTMnRNWlVFNVRrRRAB",
            "text": "Great spot for daily specials ranging from drink deals, brunch, and food deals!\n\nI came on Thursday for the $1 jumbo wings deal. Unfortunately the wings were mediocre at best with soft skin and a bland sauce. The blue cheese tasted nice and fresh however. I coincidentally came during the US Open and they were serving the famous Honey Deuce! This was delicious and even came in the branded cup.\n\nI find The Wolfe to be a nice spot to come for some classic American Food and to get a drink with your coworkers or friends. The vibe was definitely chill after work hang out and catching a game on the many TVs. This also seems like a nice spot to get brunch if you’re in the area."
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUFFtaEZkbkJPUjNSbmNVbGFPRGhHVUhkTk5VRRAB",
            "text": "Tolles Lokal, excellente Burger, top service, Preislich top"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTVdHOUhSVUZZYTFadWRVeDFWSGRZTmxreFVrRRAB",
            "text": "Absolutely delicious!\nI had an amazing experience at this restaurant. The burger was hands-down one of the best I’ve ever had—juicy, flavorful, and cooked to perfection. The steak was equally impressive: tender, perfectly seasoned, and served just the way I ordered it. The sides complemented the mains really well. Service was friendly and attentive, and the atmosphere was cozy yet lively. Highly recommend this place if you’re craving a top-quality burger or steak!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjeldESm1TVUoxU0haWk0wdDZTRzFHWjNsa2EyYxAB",
            "text": "Good drinks. Margaritas are my favorite there"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aV2FISmZUa055WmtKeFZFYzRZMkkxUm1GdFpWRRAB",
            "text": "Came here yesterday and their food is amazing! I'll definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcVFYZ3dla3QyWWt0Q2QwNUNSR2RWWjFkbVRsRRAB",
            "text": "The chicken schnitzel is BOMB. And I say this as someone whose German grandmother cooked him homemade schnitzels on the reg growing up"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSVMwTjJhRFJRY0dsVVNtcEZTVjl0ZEV4bllXYxAB",
            "text": "Wednesday night trivia is the best. They always have such yummy drinks too! I tried the matcha martini and I’m obsessed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bVEyTlBTbU0wVTBoR2NYcFhOa0pvT1ZCdWEwRRAB",
            "text": "This review is to acknowledge an employee named Kevin (I believe he is the bar back here). He was exceptionally kind and considerate to my friend and I on 4th of July weekend. He was already closing the place out for the night since it was late, and all the other places were already closed, but he helped us out when we needed it most. He also seems like a very hardworking individual. The integrity and values of one's employees can make or break a business. If the food is half as good as Kevin was kind, then it is surely amazing. I will definitely make a point to come back and try the place out for myself."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMlJYUldURXRsVDFGdlpVVkxjR1phWkZoV00zYxAB",
            "text": "Great new find for lunch. Nice atmosphere. Sat our party of 5 in minutes. Definitely recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUVVVRTNWVEU1UmxnM01HMWlNbWx6YlRkNVEwRRAB",
            "text": "Our waitress was great, great service, great food, great table. I had the Wolfe Burger and it was delicious and cooked to perfection. Cocktails were also on point. We will be back again and this is a great addition to the UWS and Stout Hospitality Group. Another Home Run!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMU5WQlRVbWh3ZFVadWFsUm9NRzUwV2xsMWNtYxAB",
            "text": "Love this place! They hosted a Tone Awards party for 10+ of us and the service was outstanding! Kudos to the amazing staff!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUE1qbGhaMGx2WWpGME9EWmlZMVV5Wkc5U2FsRRAB",
            "text": "All around this was a nice spot and 6 minute walk ti the Museum of Natural History. Our waitress was so kind but she was the only one! Food: the deviled eggs, chicken schnitzel and the ahi tuna were tasty. My friend got the wedge salad and the blue cheese dressing was not good but I am very picky about blue cheese dressing; not sure that is a fair judgement for anyone that isnt picky about it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQNmxnWlhmdFBuanhnRRAB",
            "text": "Friendly staff, bar food with a twist, enjoyed the drinks and atmosphere will definitely tell folks to come and enjoy brunch!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNlRXMDNZV1JCWlVaNlJFOXdjak56Y0hsbFgzYxAB",
            "text": "Mexican here! If you so happen to come to this restaurant craving tacos your in luck! The beef barbacoa tacos are surprisingly good plus the green salsa is especially delicious"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMXzZ1bzJYcDQzODRRRRAB",
            "text": "Their matcha martini may be the most balanced cocktail I have ever had"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJZmRqOF93emJiY3B3RRAB",
            "text": "I am going to have a lot to say so bear with me.\n\n1) Ambiance - nice! Very nice happening vibe. Louder in the main room but the back private dining space is perfect if you want a separate space.\n\n2) Food - tastes great for a bar restaurant but the wait was very long and our expectations were not managed. We did not come here for drinks. That seems to be “the move” of most of the customers. Not sure if this was a one off with the slow food service but it is tough if you come in hungry and ready to eat a meal. The main dishes were also skimpy. The cauliflower steak was very little cauliflower for $24 plate. It was sad. But delicious. The ahi tuna main also delicious but like put a proper side or something with it please aside from avocado. It’s not a full plate. 😔\n\n3) Service - poor. Maybe it was a one off but it was not professional. This was related to the food being slow but also very little was communicated to us. It would have been nice if the server told us ahead of our meal “hey just a heads up the kitchen is super slow - I want you to know that before you order and get comfortable.” I could see him looking at our table to see if our food arrived or not and maybe he would go and talk to the kitchen. But more communication to us would have gone a long way. I tipped low because of our experience on the service, and noticed the server give me a look when leaving instead of smiling and saying I.e. “thank you guys! Sorry it was slow tonight hope you come in again and we can make it up to you.” Little care and attention and the end did not feel welcoming.\n\nThe short of it is come for drinks assuming they are good - I can’t speak to that - and a lively ambience - sit in the back for quieter or the main room if you don’t mind the extra chatter around you."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYXNzOXY5aS1lYzRRRRAB",
            "text": "Sam is a 100/10, give him a raise !!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYjJ3Si05a3RfTUR3EAE",
            "text": "Very solid bar and restaurant with great happy hour deals and daily specials. Came once for the $1 wings on Thursday and they did not disappoint! Drinks are solid and a nice price, the staff are very attentive and friendly, and the music + sports on are a great vibe. Will definitely be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLLXB2OFRnN3RLR1RBEAE",
            "text": "Sam is the best ever!!!! this is my favorite neighborhood bar/ restaurant and look forward to sam’s service every time. the food here never misses.at this point i have tried everything and can vouch every menu item is amazing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNcmVtcDdDMmFiaWNREAE",
            "text": "Sam is the best. Period."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNajVuUFNzOXJuZktBEAE",
            "text": "dirty martini and good wings what more can a gal want- also strangely it has the most beautiful NYC bathroom??"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJRHNuTURudy16NUxREAE",
            "text": "The best spot ever. The food is incredible, the drinks are amazing. Great place to watch sports too. The city needs more places like this. Will forever crave the smash burger app."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZX3JUdmJREAE",
            "text": "Best brunch-lunch I've had in New York City. The waitstaff so friendly, the atmosphere perfect perfection-we had huevos rancheros, a Smashburger, started with deviled eggs, and the Benny eggs..all were fire. Highly recommend. I can't wait to go back💙"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXJIeXFnRRAB",
            "text": "The staff was aggressive, intrusive and rude.  We sat in the bar area at a high top table. Were asked to move mid meal due to a reservation.  We happily moved to the bar. An hour later we noticed our high top table was still open.  Simultaneously the bar tender was incredibly unhappy, rude and unwelcoming.  Avoid this place at all cost.   Wish we went somewhere else and maybe would have enjoyed our time instead of wondering why we were so mistreated the entire time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNW9xNE9nEAE",
            "text": "The rudest bartenders ever. Hospitality is not their strong suit."
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdXNHNVl3EAE",
            "text": "Joli bar, belle ambiance et personnel sympathique !\nLa cuisine est très bonne 😊"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcmJmd2d3RRAB",
            "text": "Great brunch spot. Outside seating is first come first serve but it’s worth it if you can get it. We get bottomless mimosas every time we come"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbGREUzJ3RRAB",
            "text": "Wolfe salad was delicious. Very nice atmosphere. Clean. Went for lunch on a Wednesday-Quiet. Waitress was bartending and hostessing as well. She was very sweet and professional. Great happy hours prices on drinks as well as food. Very reasonable!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbUlhNXlRRRAB",
            "text": "Very comfortable neighborhood bistro."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aXN2LTFnRRAB",
            "text": "I kinda loved it!   The Brussels spots are killer!   We had St Patrick's Day dinner there.   The Shephard pie was tast. However, the corned beef sandwich was killer!   Sorry, a St Patrick's Day special!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMF8zbmJREAE",
            "text": "Great bar food (especially the Brussels sprouts), Perfect Pear cocktail was perfect, but the Mule was terrible"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdDZhSk5BEAE",
            "text": "Great food and ambience for a Saturday morning. We enjoyed our time here."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaDVLMFN3EAE",
            "text": "Good Upper West Side bar. Fun place to watch sports. Good brunch."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM29pc3JnRRAB",
            "text": "It can get really full if you come a little around anytime before that you won't wait at all"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcUlTV3FnRRAB",
            "text": "So many bars have come and gone in this space, but it looks like they finally found a winner in The Wolfe! I’ve been several times and I have never had a meal I didn’t like. Their wings are my fave, the schnitzel is awesome, and my friends rave about the burger. Oh and don’t sleep on the chicken sandwich - I get that often!\n\nTrivia on Wednesdays is SO FUN - but they fill up fast so make a res if you can. They have different promos every night. It’s a nice differentiator from the slew of “college bars” on Amsterdam; The Wolfe is nicely suited to those of us in our 30s/40s."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNF8zQmpBRRAB",
            "text": "Tiny sports bar named for Tom Wolfe. Went on a Saturday afternoon @3 pm and were disappointed to see so many breakfast items . I guess it's a brunch place. Decided to order anyway and was pleased with the only 2 items that was not breakfast or a burger. Both were well made."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbXZxR1BREAE",
            "text": "The service at the bar was cold and unapproachable, like I’d expect the arctic den of a wolf in late January to be. The two dogs that sat and ate on the floor behind us on a Thursday night at 8pm loved it! Their to-go containers and water bowls stayed on the floor to remind us that the canine was in charge here. It also seems like a great place to bring your laptop to sit at the bar and work, well into the night."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeEkzN3FBRRAB",
            "text": "The service was amazing. They were very welcoming and attentive. Food tasted great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfazl5UXFnRRAB",
            "text": "Don’t honor reservations. Also served basically raw steak when asked for medium rare."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMElmMl9nRRAB",
            "text": "I came on a holiday Monday when there were multiple basketball games on. Staff very accommodating to my request for a certain game on a specific TV.\nCame in around 430 on a super cold day and more than enough barstools but still a lively vibe.\nBartender took extra time to make sure she understood the way I wanted it.\nGot their Wolfe burger and was executed perfectly. Fries perfect and piping hot"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcHRLVW9nRRAB",
            "text": "The food was so delicious, we had the burrata and figs, deviled eggs, tuna dinner, drinks were strong and very tasty. From the moment we walked in the staff was very friendly. Nice place for dinner and drinks."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd0tmdFh3EAE",
            "text": "Great smash burger and fries. Will be going back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmX1BlMk9BEAE",
            "text": "This was WONDERFUL!!! Go here!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMnBEYWZREAE",
            "text": "If I could give extra stars for service, I would. Food and atmosphere were phenomenal, but we were so welcomed and accommodated from start to finish. Our server even offered to move our party of 5 from high tops to a split booth for our comfort when it became available. I can’t say enough good things!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQODZ6OU1REAE",
            "text": "Unfortunately I will not be returning here due to extreme racism I experienced. I was with a party of 3 although we didn’t have reservations  that was offered to us was a small round table with 3 stools which caused serious backaches after walking around all day in the city.a family four then walked in and was offered a table that had proper seating and this table was reserved for another party that comes in at 7. I can’t believe this happened to me and racism is still alive at this time, this is very disheartening to experience from this establish especially in such modern times. If possible i would give 0 as a rating but google doesn’t allow it so i will put 1 but my true rating is 0"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeWNhVVF3EAE",
            "text": "Excellent all appointed Cocktail bar with elevated food menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6c08tLUxREAE",
            "text": "First time here. We were a party of four. Three had salads which were quite good. I had the hot wings special. It's a dollar a wing and you can buy in batches of 8, 12, 20. Unfortunately, these were mediocre and I suggest to skip them. Truffle fries on the side we're very good.\n\nThe staff was very friendly. And the ambience was pleasant. A good place to meet up with friends but not a date.\n\nIt's super noisy inside. Not a bad thing but between the music and people (place was packed on a Thurs night).\n\nSuggest dining outside or in the back where there is a small private table/cozy room."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbE1Ub0N3EAE",
            "text": "I really liked the vibe of the restaurant and the staff was kind and attentive. My appetizer had great flavor and so did my burger. The desserts were the main event and did not disappoint! The Cinnamon Sugar Cronut Holes with the vanilla bean ice cream from the Butter Toffee Cake was too good! My sister and I went for restaurant week so I’m happy we got to try out something new on the UWS"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMlpLMDVnRRAB",
            "text": "Chic neighborhood spot! We walked in and immediately threatened to be regulars— that’s how tangible the ambiance was.\n\nLuckily we did not misplace our loyalty as our server Jake recommended the calamari (gluten free!!) and we inhaled it without pause. The guests beside us ordered the chicken wings which Jake also promised were a fan favorite and they were raving.\n\nThe smash burger offered an undeniable out of this world experience, end quote.\n\nThe wedge salad was a major slay as well with steak cooked so perfectly I gasped.\n\nWe chit chatted with the owner prior to leaving and he explained the concept as refined casual fare with something for everyone — we will be back.\n\nAlso Lauren makes the BEST dirty martini I have maybe ever had. Live laugh love your way to this bar.\n\nThey will also be hosting trivia on Wednesdays."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaFBPSWtnRRAB",
            "text": "Stopped in here for happy hour.  It was packed and such a great vibe.  Got a table and had such a good time.  Drink specials were great.  Nice beer on tap and specials on cocktails until 7.  Truffle fries with Parmesan cheese were the best I’ve ever had.  Nice menu for dinner too.  I will be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxZzVfNnBBRRAB",
            "text": "Stopped in for lunch here. Jess at the bar was friendly and helpful. They have a great lunch special but I opted for a Wolfe burger instead because of the onion jam and roast tomato in the description. It was AMAZING. DEFINITELY COME TRY THIS. The drinks look great and we will be in to try them at some point!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOS1uTnpBRRAB",
            "text": "We tried the double smash burger and the spicy UWS smashed plant burger. The double smash burger had perfectly balanced flavors. The vegan burger had a good spicy kick to it but the rest wasn’t as appealing. I personally prefer vegan patties made of grains and veges, but this was a soy patty. I should’ve checked beforehand, so that’s on me. The vegan burger bun was also gluten free and extra points for accessibility, but it was kind of a crumbly bun - which might be the norm with gluten free buns. It was definitely a new experience for me. The portion sizes were good and the shoestring fries that came with the plate were decent. I loved the service, just the right amount of attention and care was provided, nothing over the top. Just a person doing their job, and going about their way. The atmosphere was electric because the soccer game was playing. People were cheering simultaneously for team USA (the COPA America match). I knocked off a star simply for the average vegan burger, I wish they would that one a little better. All in all, a solid place to grab a bite on a Sunday evening."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudUtQbElBEAE",
            "text": "While the food was good (bear in mind we only ate vegetarian options) the environment was sub par. Between the volume of music, the televisions blasting the baseball game, and the loudness of other diners and closeness of the tables there was a lot to be wanted. The air conditioning and the fans were also whirring at full blast over our table and we had to ask if perhaps they could shut off the one above us as it was blowing our food cold. If you want to be able to hear the person you came to dinner/drinks with I wouldn't recommend this place. My aperol spritz was kind of not the best so I switched over to prosecco."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENnZlOHJBRRAB",
            "text": "I came to here on a random sunday to watch football and have a nice cocktail and it was exactly what i wanted. the staff is super nice, they make a great drink and the artichoke croquettes were so tasty. 12/10 would recommend, i’ll definitely be coming back !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGazV6RXhnRRAB",
            "text": "Really excited to see this space transformed into a chic cocktail bar. The staff was very well trained and friendly. I enjoyed my drink but was absolutely enthralled with the Brussel sprouts. Definitely going back for a full meal next time. Great place to bring a date, watch a game (with their many tvs) or just grab a night cap by yourself."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdXBPVUdBEAE",
            "text": "We have not even finished our appetizers and had to give this place 5 stars asap. The burrata, deviled eggs and Brussels sprouts are devine. The thoughtfulness and effort of each dish are comparable to a fine dining experience. Perfect for a zen brunch on tranquil Amsterdam avenue."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbWF2T0tBEAE",
            "text": "Such a beautiful place. I loved the vibe. Nice bartendars. But the Italian spritz just wasnt great. I've had so many good zero proof cocktails, and this bar was on my list just didn't hit good at all. So, i wouldn't recommend them. But, definitely a chill vibe bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqX3ZYVy1RRRAB",
            "text": "It was ok - just ok. You can always tell when a staff team are bored because they turn the music up so loud the people eating cannot speak to each other - and the waitress behind the bar had to ask 3 times that I repeat my order...... Which was average when it came. Time to remotivate the staff there...."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEamZMUFNBEAE",
            "text": "We had an awesome experience here. The food was delicious and everything was on point."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQN29MVEhBEAE",
            "text": "awesome spot to go with a group. Food options were great and delicious!! Would definitely recommend if you are looking to spend a fun casual night in the city. We had the following dishes to share and they were all on point: baby smash burgers, Brussel sprouts, burrata, calamari, croquettes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENnFubmJREAE",
            "text": "Absolutely love this addition to the neighborhood. The food is fantastic and everyone is really friendly. The Brussels sprouts and deviled eggs are a must for starters. The schnitzel and the smash burger are my favorites for an entree. For dessert, the butter toffee cake is one of the most delicious things I’ve ever eaten. Cocktails are also great and Cole is super friendly behind the bar. Definitely don’t give this place a skip…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOHRQM2hnRRAB",
            "text": "My boyfriend and I were looking for a place to eat after our visit to the Natural History Museum. I am so happy we ended up choosing The Wolfe. The food and atmosphere was great. Our server, Spencer, was the best. Thank you for making our day, Spencer <3 :)\n\n& Happy Birthday to The Wolfe!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6eE9QX1RREAE",
            "text": "I normally don’t leave reviews but I just had to after our experience with our server Spencer today! He was so extremely kind and funny and made our trip to the Wolfe so memorable! We just arrived in NYC and Spencer was so friendly and helpful with absolutely everything and it was so lovely to get to chat with him! We will definitely be back to the Wolfe again because of Spencer and the great atmosphere in this restaurant! There were also great deals during happy hour, overall I 100% recommend a trip here!"
        }
    ],
    "reviews_count": 67
}