{
    "name": "Crave Fishbar Upper West Side | Raw Bar & Seafood restaurant",
    "place_id": "ChIJqztVA4ZYwokRiLK8Lzh7_sk",
    "grid": "MN7",
    "address": "428 Amsterdam Ave, New York, NY 10024, USA",
    "rating": 4.5,
    "user_ratings_total": 810,
    "phone_number": "(646) 494-2750",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRVRIY3pVbGhDYTNkeVRuVTJjRzFoWjA4NFQzYxAB",
            "text": "Great oysters! Calimari !\nThe service is always excellent!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUlVXOXViRXRXTVhSRlgxZzVUbTg0Ym1GSmNHYxAB",
            "text": "Delicious food and quick service for happy hour!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMVoybFpMVGxtVUdONlVEaHVhMFZxWkZNeFVGRRAB",
            "text": "Great seafood, great drinks! Love sitting outside"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQlUyVk1YMjlsUVdGaWNXNUdZblpoY3psck0wRRAB",
            "text": "Great choices of raw oysters"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aS2JISlVNMEZVVnpWdWEwRXlWbHBSVVVsWGFHYxAB",
            "text": "The food is delicious and the servers are so friendly! Come on Monday because they have the best deals. Mussel monday, martini monday, a buck a shuck monday."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRFJHVk5XbTVNUTFwamFVaDFjbTFEZUd3MExWRRAB",
            "text": "Went early in the evening. Enjoyed Oyster Happy Hour! Had some great food from the dinner menu as well. Friendly and attentive staff. Definitely recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UGNUaFVaRjlqYUVWV2RGUTFOVlJWYTNZMVRXYxAB",
            "text": "Smallest portion of salmon I’ve ever been served at a restaurant, and ridiculously priced. Provided a butter knife that couldn’t cut through the salmon skin. Wouldn’t recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdWRETXhNRFU0UjFOWGFYVndYMFpaUlVGemQwRRAB",
            "text": "Really enjoyed having dinner there.\nCan’t say 1 negative thing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZM1FYaGFlSGhhV1ZJM2EzcGhjelkxWjJZMmFXYxAB",
            "text": "Delicious as always! Came during Hapoy Hour so had lots of oysters followed by grilled fish tacos and salmon Toscana! Never had a bad meal!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSFlucGpjbWxCVkZSUkxVdzBVbWxWUzNaS2NtYxAB",
            "text": "We did the $1 oysters and $10 martinis on Monday - what a great deal! The grilled fish was great and so was the crispy rice. The sushi with the broccoli rabe was interesting but surprisingly nice!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRFJ6ZHZWVU5GVm5OTlRsTkVWa1JsTFdKS2JWRRAB",
            "text": "BEWARE RATS\n\nMy experience at Crave Upper West Side was deeply disappointing, despite some positive aspects. The food was genuinely delicious, with well-prepared dishes and appealing presentation. The service was also commendable—staff were attentive, friendly, and ensured our needs were met throughout the meal.\n\nHowever, our visit, which occurred just over a month ago, was marred by a shocking sight: two rats scurrying across the dining room floor during dinner service. The presence of rats in plain view during peak hours suggests a serious hygiene issue, likely indicating a larger infestation problem. For a restaurant, especially one with such promising food and service, this is unacceptable and raises significant concerns about cleanliness and safety.\n\nAs a result, we will not be returning, and I cannot recommend Crave Upper West Side. Its sad because we live 2 blocks away and were regulars along with several of our friends. Potential diners should be cautious—great food and service don’t outweigh the health risks posed by such conditions.\n\n**Rating: 1/5 stars**"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eGNGTk5OSEpUWWxWMFpFVkxXbkJSWm5CSWRIYxAB",
            "text": "Food was delicious but it is overpriced and portion is small . Service was average."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMFgzSjJOSGxqVFZvdFdUQnlkRFZDUmxGM2RsRRAB",
            "text": "Maya and Bridget and the amazing host created an incredible experience for two on a Tuesday evening. Happy hour was delightful, the oysters were great, and restaurant week was worth the trip. The staff made sure we were taken care of- from wine tasting to oyster recommendations. Can’t wait for our next visit."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRem9iQllnEAE",
            "text": "Great spot with a great staff that always make you feel like you're visiting friends"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNWNuQjFaV2cwUW5SbVpEQlNlblF6VDJVd2FIYxAB",
            "text": "Came by last night for dinner and was so amazed by the service, the food and overall experience. Before arriving I got a call from the restaurant asking about my accessibility preferences given my wheelchair. They agreed to reserve a table for us outside even though it’s typically first come, first serve.\n\nThat was an awesome start but when I arrived, I was even more impressed with the attentive service. We were walked through the restaurant week menu which we ended up going for and started with the calamari and crab crispy rice. I ordered a filthy martini which came out pretty clear and they let me know that they water down their olive juice which was an interesting choice being for cocktails but great if you like em strong!\n\nFor the mains, my friend got the Thai lobster curry and I ordered the spicy squid ink spaghetti. Definitely was way too much food but I’m glad I was able to squeeze a bite of the warm cookie a la mode dessert because it was DELICIOUS. New neighborhood fave! Thanks team."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OME1XOXJaa0ZvWDFNdGRsY3paMWhVVEZSTmVVRRAB",
            "text": "I came here on Saturday night in mid July for a 745pm dinner a pleasant weather day with two other people. The reservation for the restaurant was booked less a week prior. The restaurant didn’t seem to be close to full at any point during our experience so a reservation might not always be needed. Note that is table seating in the front bar area as well as in the primary dining room, in addition to outside seating.\n\nI really wanted to like this restaurant. The menu looked great. The atmosphere of the restaurant is super charming and on theme. Our server was attentive, pleasant, and knowledgeable of the menu. I also tremendously appreciate the sustainable aspect of the menu and business. Unfortunately the food just tasted sort of like nothing. Everyone at the table agreed.\n\nI wouldn’t refuse to go back to this restaurant if someone suggested it, but I also wouldn’t see out another visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMkxVSkxjbVJ2VTBsWGJrbElPVXc1ZDFkQ1RsRRAB",
            "text": "Amazing food and atmosphere!! Fresh seafood, amazing lobster roll, and delicious drinks! We loved our bartender, Bridget. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReFJ6QlRUVGs0T0RSWlZubHZNMFpEUjBSTmJVRRAB",
            "text": "Simply the best"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPakp3N3pGc283elp3EAE",
            "text": "Wanted to love this place, it was a pretty restaurant and the food + oysters we had during HH was solid. unfortunately we saw a roach on our plate and it turned us off from eating any more. And only our drinks got comped 😰…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKNkIzZXI1bnRqV1FBEAE",
            "text": "Excellent oyster selection (calling out West and East Coast options).  Sushi options were a pleasant surprise.  Be sure to visit Sunday evening for the Appetizer + Entree deal"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVbzVqTWtRRRAB",
            "text": "Food quality has gone downhill."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbno2Y1ctZ3BQT0J3EAE",
            "text": "Tremendous menu, a clear repeat"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdGNQanF3RRAB",
            "text": "Very friendly staff, the fairy lights and candles add to the vibe, the decoration is one that mirrors the aesthetics of a ship. Went during NYC Restaurants  Week, had a great selection of dishes.\n\nCan choose to arrive early prior to six for happy hour and lower oysters price!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaTRqYXhnRRAB",
            "text": "Grate place for oyster.\nOrder calamari, the crab hand roll and the fish tacos. Top top!\nWell done\n\nSustainable seafood!\n\nEnjoy!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOWZ5LXVRRRAB",
            "text": "The oyster class was so awesome. It depended our love for oysters, if that was ever possible!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3elp2cjZnRRAB",
            "text": "The food is delicious and so are the drinks esp during happy hour. But my favorite thing about this establishment is the staff every single person, they are welcoming and make you feel like a super star. I see you and I thank you"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3X01DaUVREAE",
            "text": "We ordered off of the happy hour menu this past weekend. The food and drinks were great (salmon sashimi, shrimp taco, fries, 12ct oysters). However, the next day both myself and my partner were both incredibly sick. We believe it may have been due to the oysters as our symptoms lined up with what others have reported after eating raw oysters. We would have probably came back to this restaurant, but now we are both wary of it and oysters themselves."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3N3ZqWGVREAE",
            "text": "The food was amazing, bartender Bridgette is fantastic, oysters perfect, would be here every week if we didn't live in California."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMDkzRGF3EAE",
            "text": "Friendly and knowledgeable staff, great oysters and small plates"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNXJyWkp3EAE",
            "text": "I was suggested to come to crave fish bar.    I absolutely love the ambience and the fresh seafood.   The staff is so welcoming and friendly. It is amazing to feel so comfortable somewhere in New York City!  Love supporting local restaurants and fisherman, kyle and maya were brilliant!       Love this place  thank u for the great hospitality!!!!!!!  The oysters 🦪 were from Long Island !!     Felt so good 😊."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReHJxWGNREAE",
            "text": "The best place to get fresh oysters .\nFood is great !!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReEtiQ01nEAE",
            "text": "Excellent oysters. And manager knows A LOT about them all. Real expertise. Highly recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcWJ6X2pBRRAB",
            "text": "Food was delicious, and entree portions were relatively generous. Pricey, but can be expected for a seafood restaurant. Service was fast and accommodating. I’d recommend sitting in the back half of the restaurant for a more intimate setting. The crab sushi was delicious!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncjVEcGVREAE",
            "text": "Went here on Monday for happy hour and had oysters and snacks. Everything was delicious until I woke up on wednesday morning at 4am with norovirus. Everyone who ate here in my party also got norovirus from their oysters. My whole family is now sick. It has been a nightmare. One of the worst sicknesses I've ever had. I couldnt eat or drink for 36 hours. If you go here AVOID the oysters for the time being. Everyone got sick, it was not a random incident. Management and owners need to 86 the oysters until this virus is no longer a threat."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMHI2QWJBEAE",
            "text": "Was in NYC for business, took my wife me. It happened to be Valentine day.\nWe were craving for oysters 🦪 and seafood.\nWhen we came, were basically turned away. Presented a menu that we basically HAD to order everything from it , and we’re came for oysters…\nNot a pleasant experience\n\nAnd its a shame that I get shamed for sharing my experience. Experience that I did not wanted to have. And after that answer, I dont know if I will come back... Keep it up, there will be others..."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNzlLNVhREAE",
            "text": "Some of the best oysters in the city. Love that they sustainablysource. Staff is always amazing. Tasty drinks."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdFl2U0ZREAE",
            "text": "Our server Joe was fantastic! He was so knowledgeable about the different oysters as well as beverages. He was so patient and helpful. Thank you Joe!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScm8zNzhBRRAB",
            "text": "Still one of my favorites on the UWS. The oysters are always good and the main courses offer enough variety.\nThey do have a few house cocktails worth trying too."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeXV5RXRnRRAB",
            "text": "I loved this place! I went for the first time today for the oyster happy hour and everything was amazing! Super fresh and delicious. Shucked right in front of you at the bar area, which was a treat to watch. I also LOVE their commitment to sustainability when it comes to seafood and wildlife! Will definitely be back!"
        },
        {
            "date": "10달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MjZ6TmxBRRAB",
            "text": "16种不同地区的生蚝太棒了"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eV9PM3V3RRAB",
            "text": "Holiday buzz, great place to meet friends, catch up or celebrate"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cGNTRXhnRRAB",
            "text": "Stellar seafood. Excellent raw bar selection."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NHUtb1BnEAE",
            "text": "These are their happy hour prices. The food tasted okay but when I’m factoring in the quantity and price it makes it a bad deal. I paid $10 for salmon tostada and they gave me two tiny chips. The one bite was not worth $5. The slider really is just one tiny slider. The fish taco really is just one fish taco. They are charging outrageous prices for the quantity."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQc1BlVDBBRRAB",
            "text": "So happy to have stumbled upon this gem. Meal was a home run for my family — food was served fast and they have a ton of varieties of delicious oysters and their kids menu is kid approved 💯 Atmosphere was fancy while down to earth and very family friendly. Our server was Maddie and she was exceptional, truly made the dinner a special occasion ! We’ll be back :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQN3BxTFFREAE",
            "text": "I'm only giving them 4 because I wish the 90 mins unlimited drink was longer. The place is really nice. Staff is super and drinks fantastic. The star of the show was the rice dusted calamari.  I can eat this every day and be happy. Highly recommend this place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNGM3ajFRRRAB",
            "text": "Me and my bestie stop by here regularly! Great happy hour and brunch options. I can always trust these Oysters to be amazing!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNzhtdjZBRRAB",
            "text": "Great fishbar overall! Raw bar has over 15 oysters from all over US and Canada. The seafood was fresh, and loved the shrimp cocktail.\n\nMenu has a lot of plain and interesting combinations. The casual, lively ambiance made it a fun spot to relax and enjoy a Saturday meal - there were a lot of people and the staff was super friendly and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNUlXWXhRRRAB",
            "text": "Today was my second time visiting Crave Fishbar UWS (I’ve also been to the Midtown location last year as well). My last visit to the UWS location was early 2022. Food and service were good back then. Today….was not a good experience at all. My fiancé and I had brunch with “Drink like a fish” (basically 90 minutes unlimited drinks). After the first drink came, the waitress put a sign with the time the 90 minutes would be up. Thought that was neat but it also came with a disclaimer, only one drink at a time and if we ordered too fast we’d get cut off before the 90 minutes. Okay… in all my life and in all the restaurants I’ve been to, I’ve never heard that one before, but thought maybe they had some rowdy people in the past who got too drunk or something.\n\nAfter we received our first drink, we chatted for bit while waiting on our food. The waitress came back and seemed shocked that we finished the first drink, and made a remark. I started feeling a bit uncomfortable, like I was being watched, but ordered a second drink anyway. Pacing seemed spaced out on purpose so we don’t order too much. My second drink order was wrong; ordered a mimosa and got a beer (I don’t drink beer), but I didn’t want to cause any issues.\n\nFood arrived. Good, basic, small portions.\nI ordered a third drink, but my fiancé was told he couldn’t order another until he finished what he had (which we understood) and not to chug it. At this point we felt like we were children being told what we could have and how much. After the third drink we left.\n\nThere was still 45 minutes left (out of 90) and we were still hungry, thought about ordering more food but honestly didn’t feel comfortable with the service so far and ended up eating at a place across the street afterward.\n\nI would not recommend visiting Crave Fishbar. Service is abysmal and honestly there are better seafood restaurants in the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbmRESTFnRRAB",
            "text": "We live in France, at the west coast. So oysters are a very frequent way to treat ourselves. We absolutely love them.\n\nOyster producing regions are Normandy and Bretagne and we know a lot about the various qualities that the French oyster producers have to offer.\n\nSo the first time we ordered oysters in April '23 at Crave's we were sceptical, we were expecting a mediocre quality.\n\nTHAT WAS SO WRONG ‼️\n\nWe ordered a mixed plate of 18 oysters. They are absolutely FANTASTIC ‼️\n\nThe dry white wine from California was a perfect choice with the oysters.\n\nWe went to Crave during happy hour and we were able to sit on the terrace.\n\nCrave Fishbar is a must go place. We visit Manhattan every year and we've returned twice in '24 and will definitely return in '25."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYck5fanFBRRAB",
            "text": "Stopped in for some seafood and oysters, probably the worst food I have had in a loooong time!  Oysters were fishy in taste, the mignonette tasted like dishwater with a hint of vinegar . We also had salmon sashimi which was flavorless, even the French fries were dry?"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrcmJqd2NnEAE",
            "text": "직원들이 매우 친절하고 재치있게 설명을 잘해주시네요, 굴 요리는 정말 신선하고 맛잇엇어요. 팁을 더주고싶을 정도로 서빙이며 음식이 맛잇었습니다."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdl9tYkF3EAE",
            "text": "We went around the holidays and it was beautifully decorated outside and inside. The staff/waiters are amazing and attentive! Oysters are delicious and fresh -It’s been 24hrs since I ate there and didn’t get sick :) so that’s good!\nHappy hour is from 4-6 and that prices are very reasonable includes cocktails wine beer and food!\n\nFor the main course (after 6pm) we had squid ink pasta, lobster roll and steak! All were very delicious and good portion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbjZtQkVREAE",
            "text": "Our favorite brunch place in the neighborhood. The food never fails, oysters always fresh, and the Bloody Mary, hands down, the best I have ever had. Been there multiple times and the service is always exquisite, you can feel genuine hospitality from them. Love love love this place a lot."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4anN5cDRRRRAB",
            "text": "This oyster happy hour has a strong reputation for a reason — it generously delivers.\nWe recently revisited Crave UWS after a 1.5 year long hiatus from it (not intentional, just hadn’t gone in a long time). It was fantastic. My husband and I are trying to cut back on our *imbibing*, which can be hard to do at a happy hour. However, they have a good non-alcoholic beer on hand and who ever said tonic and lime doesn’t go great with oysters? Exactly.\nWe ordered a dozen blue points and two cherrystone clams to kick it off. SO GOOD and SOOO HUGE. Honestly the blue points were actually a little too big for my taste! However, they’re tasty and you get your moneys worth. The raw bar offerings are cold, crisp, clean, no matter what you choose to order. It really lets you enjoy the nuances between the different oysters. My friend from CA looooved the Shibumi’s!\nI highly recommend this spot if you like seafood and especially if you like oyster happy hours. The other items on the happy hour menu are also delish. Get shuckin!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENnFYbHF3RRAB",
            "text": "Good but not great food.  All the fish was very fresh, but the flavors were nothing special.  The atmosphere and service were both excellent, as was the cocktail and wine menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPc2YzbENREAE",
            "text": "Excellent Oyster happy hour and kid friendly\n\nGreat drinks, high quality oysters\nHad a mix of east and west coast oysters.\nThe basic wellfleet were actually the best for our palate.\n\nBloody Mary was excellent!\n\nFish Tacos were well done would recc\n\nThe kids meals were okay\n\nThe Seabass crudo was a bit heavy on the sauce and could have been better trimmed.\n\nSalmon tostada was good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMXFQT0NnEAE",
            "text": "Came here for brunch. We used our pulsd deal and had a wonderful experience. The Bloody Marys are not that good. It was too tomatoey. We got the mimosas and they were better. The lobster rolls are not surprisingly very small. Get the squid ink spaghetti if you want something more substantial. We also ordered the oysters which were really good and fresh. The decor was nice and servers attentive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCaTdxaVVBEAE",
            "text": "Enjoyed a family gathering here for New Years. I did not get to sample them but the beautiful Blue Point Oyster platters I saw going by had me regretting not doing so. I had a delicious squid ink spaghetti that incorporated chopped shrimp, garlic, chiles for a little punch, and clam stock. I was also intrigued by and tried the garlic chive griddled rice, which was a side\nand made of snap peas, egg and rice, which was good if a little dry. There were no complaints about any of the entrees and the deserts (I had a taste of a good Sunday). Laid back atmosphere, very attentive staff, it is on the upper west side, so expect premium prices."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbFlPczZBRRAB",
            "text": "Loved it! Awesome filling portions and tasty food. Plenty of seating. All seatings are well spaced, cozy and airy. Our Server was fabulous. We ordered fish tacos and a fried fish sandwich (about $18 each) with mimosa and a non-alcoholic cocktail (pictures attached). Our bill was $30-35 per person."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVcHZmMHBRRRAB",
            "text": "I came several time. The food is excellent - the octopus, the sea bass and oysters 🥰🥰🥰 perfect for fish eaters and to have a healthy break in NY. Good (and funny) service ! The deserts are great!…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicjZHbXRRRRAB",
            "text": "Just had 1.5-dollar oysters mid-day on Saturday in the post-pandemic UWS!! 😻😻😻 For a second, I thought I time-traveled to the good old days 😅 More surprisingly, those were not your regular blue points. My oysters were so fresh and not too meaty or salty that I didn’t want to mix it with anything other than a drop of lemon juice!! I am quite picky when it comes to oysters. Here, you can find a more refined and interesting selection from both coasts, which is something that has almost disappeared from way too many places in Manhattan in recent years. That being said, not all oysters are included in all of the deals they have, and some West Coast varieties can be up to $5 per item. Still, what is included in different deals during the week offers you a decent choice. Plus, their pre-fix restaurant week menu that runs until September 1st does include 6 oysters, three from each coast. Had a crispy sandwich, too. It was better than I expected: The fish was crispy but not deep-fried. And waiters were nice, knowledgeable, fast and not too overly attentive. Frankly, I was so surprised that this place I only found by passing by a few times wasn’t busy at all during the brunch time. So I’d recommend this place to catch up with an old friend you’ll be exchanging the news with because you’ll certainly will be able to hear the other person, but, if you want a more pronounced party vibe, maybe it’s not here (at least during the brunch hours). One thing that I didn’t particularly like was that their bloody mary was way too spicy for me. So maybe discuss that before ordering if you want it to be mild. Otherwise, it’s a lovely, laidback spot. Will def return!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OU1pS0l3EAE",
            "text": "Expensive but good, some dishes have a larger portion of fish than others. We ordered the barramundi and tuna dishes, with oysters.\n\nThe barramundi was great, maybe a bit over seasoned but plenty of fish. The tuna was much smaller in size, with a lot of corn hash to make up for it. We came for the oysters, and they did not disappoint."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMExiM0ZnEAE",
            "text": "Dropped off some film and was in the mood for oysters so I looked on google the closes place.\n\nI remember being here once but can’t remember that visit, but this time that I was here was amazing.\n\nGot there at 5pm which was during the happy hour period. Ordered a dozen oysters that were on happy hour, salmon sashimi tostadas, a slider, and cold crab claws paired with some wine.\n\nEverything was amazing. This was a solo date for myself and it was really comfy to able. Staff was amazing, my bartender did her thing. This is my new happy hour spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5anNQc0FREAE",
            "text": "Love the Brioche French toast with vanilla bean whipped cream and blueberry compote. Also a fan of the fried cod fish and waffles!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJNk03RjRBRRAB",
            "text": "Excellent fresh seafood. Presentation was awesome. Not a fan of oysters but my friends would not stop taking about how good they were. Finally a place that really does salmon to perfection. Loved the calamari. Love the way the restaurant looks and feels. Will absolutely be going back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSODkzRGh3RRAB",
            "text": "The interior was so pretty, you immediately feel like you’ve left the city. We had reservations, so we were immediately given a seat. We ordered from the brunch & lunch Menu.\nThe Seared Rare Yellowfin Tuna was AMAZING. The flavors, the proportion size, just everything about this dish was great!\nThe Lobster Roll was not my dish, but I did try it and thought the proportion size didn’t match its price ( gave less than expected).\nI also wasn’t a big fan of the aioli they add to the lobster. Fries were good.\nWe also had the unlimited drinks which was a pretty great deal !!! All in all, I’d definitely recommend this place. The service and food were great."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeVlMSDdBRRAB",
            "text": "EVERYTHING WAS EXCELLENT. From our host Maria, our server and crew, to the FOOD.\nDrinks: Smoke & Mirrors (short glass) & Japanese Highball (tall glass).\nAppetizers: Nashville Style Crispy Fish Tacos(2 pc), Hand-Cut Fries, and a variety of oysters.\nEntrees: Handmade Spicy Squid Ink Spaghetti & Oven Roasted Barramundi.\nDessert(Not Shown) : Giant Chocolate Cookie w/ Vanilla Ice Cream.\nExtra: Bloody Mary Oyster Shooters (red drink)\nEvery thing excellently prepared and displayed.\nAtmosphere was very relaxed, especially for a Friday night, yet still booked to capacity.\nWe WILL return!"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMzdyR3FnRRAB",
            "text": "So, thought we'd give this newly opened place a shot.\n\nFor starters I had the octopus, which I found a little tough. I tend to find that when people cook an entire tentacle it's generally not as tasty as it is when sliced up into chunks. But given I like octopus I always try to give it a go when I see it on a menu. The accompanying greens and sauce were nice though.\n\nMy husband had the Korean style Pork belly. That was cooked well, though he did say it was quite spicy.\n\nFor the main meal I went for half a lobster and 4 different west coast oysters. They all got eaten very quickly but there was nothing really memorable about them in terms of taste.\n\nMy husband had the swordfish which was okay, but a little overcooked.\n\nWe split an ice cream sandwich, 2 cookies Sandwiched a roasted rum, banana ice cream. The ice cream was fine, but the cookies were a little soggy, which really didn't make the dessert very appealing.\n\nFor a an average meal it was rather overpriced, so a slightly disappointing experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbU52VEF3EAE",
            "text": "I love the design and ambience of this place. You get a lot of personal space between tables.\n\nThe seafood is fresh and the service is efficient, but generally the staff isn’t very friendly/warm.\n\nOysters 🦪 are the main event and are perfectly presented and super fresh. The lobster roll has guacamole in it which I was excited about but later realized was a bridge too far, and the fries are weak.\n\nI’d suggest this place more for happy hour (oysters and white wine), and head up the street to Mermaid 🧜‍♀️ Inn if you want the best seafood dinner in the area (with a lobster roll and old bay fries to live for)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSem96aWR3EAE",
            "text": "Nice happy hour deal on oysters. We sat at the bar and got to try a variety of small plates as well. Everything tasted great and a fun atmosphere"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1Z1pTOEtnEAE",
            "text": "Happy Hour every day from 4 - 6.  Best Oysters available.  $1.50 for large Blue Points can’t be beat.  Pair it with an ice cold Pilsner and it’s the perfect summer late afternoon snack.  Service is great.  Seating available inside and outside. I hear the foods excellent, but I can’t get past the oysters!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eDQyUkhBEAE",
            "text": "We can't wait to return. Everything was excellent. It was like I imagine The Bear would be. People were friendly; Kyle, Lala, Jeremy, all the beautiful people who brought the food to our table, and made the experience magical. Kudos to all!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNZ2FxdFlnEAE",
            "text": "The great thing about their kale salad is that it harmoniously mixes different ingredients while not giving up the kale base. I was surprised by how delicately goat cheese can be added to the salad. And there's no enough way to praise the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleFB1XzV3RRAB",
            "text": "Pleasing atmosphere, an okay wait staff and menu selection.  Used to have a great happy hour but please beware the oysters are not all $1.50 and they don't point it out to you; as a result I had and $81 tab when I was looking to spend half as much. Good drinks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcGFhaDhBRRAB",
            "text": "Nice place in one of my favorite areas in Manhattan. Food is tasty but didn’t impress me… maybe because I ordered the seafood bowl not in bowl or Japanese restaurant. Nothing to complain maybe I just had too high expectation after reading all five star ratings."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURud2FuR3lBRRAB",
            "text": "Great seafood, we order also Brussels sprouts and they were a little burnt, I wouldn’t recommend it. Other than that it was good. The place is gorgeous ✨"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCOWJUenF3RRAB",
            "text": "Fresh oysters, nice environment\nBut our server was too late to respond everything\nFood was good especially oyster and salmon, but don’t get fries that is not crispy at all"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVcWJ6VUt3EAE",
            "text": "Went for my birthday celebration in July, and had a ball.  The oysters and Moscow Mule were so good, I'm going back for a friend's birthday celebration very soon. Reservations already made!  The staff was top notch!  Atmosphere is very relaxed! Kids will enjoy!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydTdEcDFnRRAB",
            "text": "I went there on a whim and Wow.\nI love everything about this place from the hostess,server and food. I had a drink and some oysters. The drink was delicious and strong.The oysters were deliciously fresh and shucked beautifully.I look forward to trying more of this menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOF83MVhREAE",
            "text": "Awesome spot for seafood. Happy hour menu and happy hour oysters are fantastic! Don’t skip the Calamari."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwM3QzX2h3RRAB",
            "text": "Went during a beautiful Sunday around happy hour and sat outdoors.\n\nThe cocktails were some of the best I have ever had. Highly recommend the spicy marg 🌶️.\n\nThe seafood itself was delicious and very fresh. The salmon sashimi tosdada— wow. Crudo— ditto.\n\nNashville style fish tacos— 🤤\n\nUnfortunately devoured everything rather quickly so only got a picture of the oysters, but they have an amazing selection and also serve with grapefruit (which I hadn’t seen previously).\n\nWill definitely be back!"
        }
    ],
    "reviews_count": 81
}