{
    "name": "The Heights Bar & Grill",
    "place_id": "ChIJMS6bmjv2wokRgIfSoY9u1gw",
    "grid": "MN9",
    "address": "2867 Broadway, New York, NY 10025, USA",
    "rating": 4.2,
    "user_ratings_total": 800,
    "phone_number": "(212) 866-7035",
    "reviews": [
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWE0xWklXRmhVYmkxa2RraEZlakYzWm5GSFNFRRAB",
            "text": "This place has an amazing service best fries in NYC and the skirt steak is just absolutely amazing! The staff are knowledgeable, nice and friendly! Went there probably over 15 times now, and it’s just so great that I wish I could go back every day (sadly my wife wants to eat at home and also try other places too, even though she loves it there too).\nThank you to the team and the staff in the kitchen too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwclpMSjBBRRAB",
            "text": "10/10 so good. Jake was an AMAZING servicer. Loved the chips & guac app, we got yummy mini margaritas, I got the chicken burrito (mind blowingly good) and my friend got the burger. So delicious.\n\nOne thing to note, they have rooftop seating but it might not be what you expect. The walls are higher, so you don’t really have a great view. But it was still nice to be outside"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaXZyNlZnEAE",
            "text": "Love this place, the rooftop is also a pretty good date spot. The food is always spot on with generous portions. I’ve never left hungry. They even offer some good happy hour deals! Try the nachos you won’t be disappointed. Worth checking out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUa003ZDlRRRAB",
            "text": "Food was great especially the nachos and Mexican Cobb Salad. Unfortunately we were denied a table for two by the window despite several subsequent pairs of people being allowed in the same seats we requested."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWWFHOWZlRlU1YUdFMGJYcEJUalZZWVdwMmNFRRAB",
            "text": "We stopped by on a Friday summer evening when the local university was on break. The second floor place was mostly quiet with most table seats full. We got a spot at the bar around 10pm easily. It’s a solid choice in this area if you want to go to a bar."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVaGZITGxnRRAB",
            "text": "I came for happy hour with a group of folks on the weekend. We were seated pretty quickly and attended to shortly. There are various options depending on what you’re in the mood for. The food is definitely a bit over priced for what you get…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cHJLVWFREAE",
            "text": "Small place that gets crowded quickly. Food is always great. Mostly been for brunch. Last time I was there the bathroom was really gross a bunch of flies like a lot that concern me the bathroom is pretty close to the kitchen and bar. The big huge windows can be open and have no screen. No insect traps I could see. The wait staff is great kind friendly and accommodating."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5cUlPeTBRRRAB",
            "text": "The food was delicious!! It was cool going up the heights! It feels like a cozy place. It was almost closing time when we went so it was on the quiet side and I enjoyed the atmosphere. I like it was on the darker side and feels like we had privacy and our waitress was nice and friendly! Didn’t get any drinks but the bar looked awesome!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaX0xmU1RnEAE",
            "text": "Nice place if u want to drink a draft beer or a nice froz Margarita! Happy Hour until 11pm! And a nice college pub like atmosphere! Rooftop is also nice!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxS1JVcEtka051WVRaa05raG1XRzFLY1VoV2RWRRAB",
            "text": "My burrito was so squat it was a friggin square. It was as wide as it was tall. I couldn’t even pick it up! So disappointing.…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0cGJTUjh3RRAB",
            "text": "Lugar pequeño pero muy bonito y muy buen ambiente. El único sitio de la zona para tomarte una cerveza y comer de ración. El resto son tiendas, cafeterias y take away.\nEl dueño o gerente muy amable. Nos dio a probar las cervezas porque no sabíamos cuál elegir. Y aunque solo pedimos un plato de finger de pollo, estaban muy buenos."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPM2VTcl9BRRAB",
            "text": "The Heights is unassuming chic at its best. Not quite a rooftop, but it's on the upper level of a third storey walk. Above average customer service with a sensual southern atmosphere. Great dive for a dirty night. Very dark and discrete. Screams Tinder."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaU9YaHB3RRAB",
            "text": "It was a nice warm place for a few drinks. Our bartender was amazing. Her drinks were fantastic. Great service!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvd1lqUGhnRRAB",
            "text": "Great little joint with a lot of stairs. There’s a rooftop but there’s also food. The food also can come with drinks. The drinks can also come with a variety of appetizers. And believe it or not the appetizers can even come with a variety…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dFRFTlFOMkZsYmpKeVJsVmpiRWRtTkdwRk0yYxAB",
            "text": "Amazing time here. Been wanting to come try this spot for awhile since moving to the uws area. Bartender JALIN and manager SHAUN were so welcoming and hospitable. Excellent service and will def be coming back!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaXJuZExnEAE",
            "text": "I love bringing family and friends here. It’s easily one of my favorite restaurants in NYC. Everything on the menu is great and the music gives a great vibe for the rooftop. The bartender also has a heavy hand 😉\n\nEverything about the Heights is great except for management. I never feel “welcomed” when I’m there"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNklUYll3EAE",
            "text": "The Heights Bar and Grill is a national landmark of the Upper West side akin to the Empire State building is to New York. I was born and raised in Upper West Side and I have always gone to the Heights through its lifetime, even experience the tragedy when a fire erupted there. The food is delicious as always and the service is also amazing. Shout out the Heights new employee Olympia. She was amazing and super super friendly. It gets busy after 2pm so plan properly if you bring more than a party of 2"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNMVl6R0hREAE",
            "text": "Really delicious food. The steak is always juicy and flavorful. The fries are crisp. Even the side salad is great."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDc0luVFdREAE",
            "text": "Our waitress Hailey was wonderful.  The food was delicious and the drinks were on point. !!! It's  definitely a place to visit with friends"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbS1xV2V3EAE",
            "text": "I ordered and paid for a gluten free burrito (because I am gluten intolerant) but they gave me someone else’s order and I ate almost 1/3 of it before they came to tell me it was a mistake! Please always triple check your dietary restrictions with your customers!!!! I haven’t eaten gluten in over 5 years so this was such a shock mentally and physically."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGVXVDJnRRAB",
            "text": "Waitress sat us, took our drink order, delivered our drinks, and never came back until we flagged her down to get the check. She brought the check. She never came back. We had to pay at the bar.\n\nMaybe another line of work is in order for her."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5d2REOC1RRRAB",
            "text": "SEP 2018 REVIEW\n\nGreat spot for brunch! 4 dollar mimosas! Absolutely can't go wrong with that! My…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQTF9uNmZNcVBfd3B3RRAB",
            "text": "It's was just what we needed to eat. Everything was great and reasonable.  $7 Margs\n$14 late lunch meals.\nGreen tree tops out the window."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzX0lpMnhRRRAB",
            "text": "It’s an ok establishment with a decent menu , I think the service was very mediocre and could use some improvement. The food was delicious and portion size was spot on ! The drinks were blah at one point I swear I brought just a glass of…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJek9lU1hnEAE",
            "text": "Usually love this place, but the bouncer King was extremely aggressive. On Saturday, instead of standing next to the door to check IDs, he was standing a few storefronts down so he could hang out with a friend. I entered the Heights and he proceeded to scream “Excuse me” at me from down the block. Instinctively, (as a woman) I thought I was getting harassed so I ran inside only for him to chase me inside. He proceeded to scream at me for not knowing he was the bouncer and called me racist for being scared of him. Had he been standing at the door (as he was supposed to instead of hanging out with a friend), then I would have realized he was the bouncer. I complained to the waitress (since another friend had this exact same experience) and she was very understanding. Going forward King needs to be standing at the door and be less aggressive towards women"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbmRPdW13RRAB",
            "text": "Good food, good drinks, Good views from the roof. Nice interior, intimate, not a huge space but really good energy. Really enjoyed our visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdHJ5Q2l3RRAB",
            "text": "I’ve been here many times over the past couple years & they never disappoint. The food is always good! We love the nachos & calamari in buffalo sauce. Frozen margaritas are also really good. Customer service is always great here!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNU5EOXpRRRAB",
            "text": "Wings and frozen margaritas at The Heights always hit the spot! Other items on the menu are great as well."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNTk3U1dnEAE",
            "text": "my favorite happy hour spot on the UWS. delicious margaritas and good food too! Ashley, our server, was personable, quick, and kind. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibDV2MFlnEAE",
            "text": "Food was excellent! Great chill atmosphere with fast efficient service with a smile! Highly recommend the cauliflower tacos and chicken tacos 😋"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBd0xDOFh3EAE",
            "text": "Good lunch specials. Nice ambiance by the window. Food was ok. Would come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcUxEWUZnEAE",
            "text": "Cute rooftop. Server/hostess Dru was amazing!!!! Wings were great. Frozen marg was ehh…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDcl95dzlBRRAB",
            "text": "One of my favorite bars. The food is great and the rooftop is amazing. I will definitely be back for more drinks also. I loveeee this placd"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eXBxamxBRRAB",
            "text": "College bar with good food! Especially the Nachos and Burritos. Definitely try Six point Bengali beer, you might not like the 1st sip, but it will grow on you into the night. Have a good time!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnOVlXamZ3EAE",
            "text": "A great place, great specials mon and wed night. Extra long happy hour. Great food (burritos, nachos, burgers, fries) and a well stocked bar. Great view of Broadway from tge second floor. Seats about 25"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqaHVUNkVBEAE",
            "text": "Love this place definitely good for a happy hour and the food is not bad either. There is also a rooftop which is cute. Mondays they have 1/2 of wings they also have Taco Tuesdays. Happy hour is from 12pm-7pm."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncnZ2aWtBRRAB",
            "text": "It is a very cute place.  The food was very good, not exceptional.  It was priced well, and the service was great.  It is a place I would visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ZzRHNFF3EAE",
            "text": "Seeing the condition the restaurant was kept in despite the photos was concerning, but the mice on each level on the trip in and out was probably the most concerning. I don't know if it's the current staffing, but I couldn't recommend this in its current state knowing the amount of incredible dive bars in the area"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNVFVNXhZVTVyZGpKdVRISlJUR1U0TlUxMGRXYxAB",
            "text": "Fantástico lugar. Lo único es que esperamos mucho, pero valio la pena.!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NGNEc1pREAE",
            "text": "Nice chill place although gets busy on weekends. We come quite often and always have a good time. And a good steak! Any meal of the day here is great, and their lunchtime deal with a soda and a main for around $12-14 is brilliant value for NYC. If the weather is nice the rooftop is great. If the weather’s not so great, sitting by the window on the second floor is a nice alternative."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBOUk3ckRnEAE",
            "text": "Excelente! Un hermoso bar en un primer piso de Harlem, con un menú económico de 7 a 9 dólares, riquísimo y abundante! La moza muy amable! Lo recomiendo!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNTZuUjd3RRAB",
            "text": "I really enjoyed my experience. The upstairs terrace is really nice and had a nice vibe going.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOXNqOUtnEAE",
            "text": "Wings were phenomenal! Service was top notch and very friendly.  Will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMN3ZDSjJRRRAB",
            "text": "ZERO STARS-Let me start by saying that my husband and I have been patrons here since my Columbia days ('99-'03) & we've never experienced anything like what happened to our family last week. We came here to celebrate our eldest’s graduation only to have my husband rudely & aggressively spoken to, nearly poked in the chest, followed down the steps by their manager Sean. We placed a call at noon on Friday to make a reservation for nine at 8:15pm. The day manager, Deon, told us he couldn’t accommodate us, that we would just have to come down and see. But since the roof was open, it shouldn’t be a problem. We arrive around 7:45, I inform the very tall server with the dark framed glasses, that I would like a table for 9. As I stand there with my graduate in her graduation attire, he immediately tells me he can’t accommodate us on the main floor, but “go up to the roof and see if they can accommodate you there”. I start to walk to the roof, he calls out “wait, my manager just said there’s no space up there either.” Interesting, as no one had gone to check. No one asked if I wanted to wait for a table, or told me what the wait time would be. No one acknowledged me any further, period. That should have been our cue to leave and not return, but we had driven in with family. I went to talk to my family downstairs. I came back to ask that they put us on a list for the next available table and the manager, Sean, is griping about accommodating a group of 9, which is interesting as I’ve seen plenty of large groups seated both on the main floor and roof without issue. What kind of manager audibly complains about seating a large group at a restaurant? Last July, my family reserved a brunch table for 15 without a single problem (different manager). He begrudgingly takes down my name and number and tells me it will be 45 min to an hour. My husband goes upstairs to use the bathroom while we wait. While he’s waiting for the bathroom, the same server asks my husband to move because he has to get by. My husband tells him he’ll move as soon as he can but a kitchen worker was throwing out trash, so the path was blocked. The server rudely tells him he needs to get through because “I have customers, I need to get by.” Again, my husband repeats same. Server rudely tells him he has customers to attend to and he needs to move. My husband responds “I’m a customer as well. Why are you speaking to me that way?” Before the server can respond, Sean jumps in my husband’s face and yells “you can’t talk to my employees like that!” My husband tries to tell him what's happening but Sean interrupts yelling “if you have a problem, you talk to me, not him”. When my husband responds that he would be happy to talk to him, but now he’s also being rude, Sean flys off the handle, yelling “You know what?! You’re not welcomed here. Leave!”  as he continues to point towards his chest. My husband tells Sean not to touch him and that while he’ll leave, he will hear about this treatment later. As my husband is turned and walking down the stairs, Sean FOLLOWS HIM, yelling “get out of my building!” Sean is now closely behind him as he is walking down steep, narrow steps, which could have caused him to fall down the steps. He continued following him to the front of the restaurant, where both my brother and I had to step in front of Sean to keep him away. He had no business following anyone down the steps once they turned to leave, much less attempting to continue the confrontation on the sidewalk for our family, children and every passerby to witness. To say that we will NEVER step foot here again is an understatement! We have seen Sean be rude, flustered and unhinged when the tables are packed. However, last week took the cake! Turned away at arrival, ignored, verbally AND physically accosted all because Sean is temperamental, unprofessional and could not and would not manage our large party on a Friday night in June is the epitome of incompetence, repugnance, arrogance and, I will add, left a very clear taste of prejudice and bigotry."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtaExqOTZRRRAB",
            "text": "Live in the neighborhood but hadn’t been for a while. We were so happy with our dinner, really good food at good prices, great beer on tap, delicious mocktail and a yummy frozen margarita. Friendly staff, too. Loved sitting  on the roof deck and having the sky overhead. Nice to rediscover this low key and fun spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSak9mLW93RRAB",
            "text": "Fairly tasty, reasonably priced food. Decent happy hour, but mediocre drinks. Friendly service. Cute outdoor rooftop. I'd go back for more food and to try other drinks. It's too bad there are no hh food specials. The place is small, but we also appreciated not being rushed."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxN09IcUN3EAE",
            "text": "Great food and service! Margaritas were some of the best we've had! They aren't stingy with the alcohol!! We had pulled pork, loved my burrito and others loved their sandwiches!! We sat on the roof, if you're looking for a stuck up snooty…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaemRiVkpREAE",
            "text": "Greater warmly & enjoyed food suggestions.  Some appetizers were simple, and two tacos were miniscule . Salad very generous but add chicken...and became unusually expensive.  Roof was closed to a private party. Everyone was on main floor and slightly crowded."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ek92SnBRRRAB",
            "text": "One of the servers was really nice and sweet but the other one was totally a menace. She tried to threaten the girls next to me by their tip rate and I felt really uncomfortable. It also made other customers uncomfortable too. The drinks were fine and I enjoyed the night other than that."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcDZLNjB3RRAB",
            "text": "Really great rooftop bar! The burgers are delicious and the fries are super crunchy. Fantastic service— my friend hates pickles, can’t stand them, but since another friend adores them, we asked if the pickles could be brought on a separate…"
        }
    ],
    "reviews_count": 50
}