{
    "name": "Ban Ban Shop",
    "place_id": "ChIJce0NdYf3wokR1D8bIrOgeVQ",
    "grid": "MN9",
    "address": "2911 Broadway, New York, NY 10025, USA",
    "rating": 4.6,
    "user_ratings_total": 134,
    "phone_number": "(917) 261-2231",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vdGREUnFabU5zVEdVMmMwWkVaM1ZYTms1cWVIYxAB",
            "text": "Nice banh mi from here, friendly staff, quick turn around."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSck5USkRRWEJIVUhaM2JWQkZMVVEyY1ZsMldsRRAB",
            "text": "The Happy Hour from 3 to 6 PM is fabulous! Great Bao Buns!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQ1owd3dMVUZRWmpSVFJrWklla05xUlVWSVNHYxAB",
            "text": "Love the sauce!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeldWOVVlVEZzUlVJeWF5MDBOMjlFUjFWc1lYYxAB",
            "text": "Needs other options other than pork on ClassPass"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMlVXSlZlamxqVDFkVmFESXllRTFxU2tKQlNWRRAB",
            "text": "I wish they would accommodate for vegetarians. On ClassPass you can only purchase a pork bowl and when speaking with the staff they aren’t willing to trade it out for tofu. There are a lot of folks who don’t eat pork for various reasons.…"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMkoyV0F3EAE",
            "text": "A great place for delicious food for less than 15 dollars.\nI recommend the five spice roasted pork in a grain bowl. The pork is so tender and caramelised.\nNice decor and friendly staff.\nHighly recommended.\n\nExtra info August 2025. Just came back for lunch and it’s just as good as before ! The pork tasted even better."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U2NXaHJXVFpmTldsVlRVbFlaVVF4TjFFeE0yYxAB",
            "text": "The hibiscus lemonade is delicious. The 5 spice pork bahn mi was ok. Too much hoisin sauce or something I can’t put my finger on… my partner loved it though. He’s never had one."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVd1VrSXlTVEZHY0V0b1MzVnNOSFl5VUROQk9VRRAB",
            "text": "Captivated by name of establishment, looking for a banh mi sandwich. Have been wanting one for months.\nSaw they have bowls and got the chicken grain instead.\nWas good 👍🏼\nMore carrots than I've had in a while.\nDope place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdGRVVlBPVXRYWjJreVlUVk9ZVk10YldSVU4yYxAB",
            "text": "Came on a Saturday around noon for pickup. I have mixed feelings about this as I’m from the west coast and where I’m from we have a LOT of Banh Mi shops. If you’re looking for a true authentic Vietnamese Banh mi, then this is not the place for you. There’s no traditional pickled daikon/carrots and none of the traditional Vietnamese salami/deli meats or pâté spread and mayo.\n\nI would describe this place as more of a Banh mi inspired sandwich with some Asian influence. The bread is alright but the rest of the sandwich is dry. I’m assuming this is where the spicy sauce comes in. We ordered the pork and also the flounder. Both were surprisingly underwhelming.\n\nThe saving grace is actually the shrimp maki roll; probably the best item on the menu. Shrimp is cooked just right and the flavours and textures go well together. Overall, I would only come back for the maki roll."
        },
        {
            "date": "3달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pod2RUZEZVMXBDZFRKeGJpMHdjR2g2Wm1reGRIYxAB",
            "text": "학생들이 자주 찾는 밥집입니다. 포장도 되고 먹고 가는것도 됩니다. 자주 방문해도 질리지 않고 무난합니다."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eFdUUXlabkJWTTJsMlJEUTRablJvTlRWcU0wRRAB",
            "text": "The space is super cute. Perfect for friend meet ups and solo dates. The ban ban sandwich is pretty small for the price (compared to other places Ive been to). But its good. I had the roasted chicken ban ban sandwich.\n\nI would come back again perhaps for the buns because they looked good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNFpVNWZNR3R5T1dvNFprMXZkWGxWYlVSQlRIYxAB",
            "text": "Shrimp Ban Ban was good. Size was smaller than I usually get. Thank you 🙏 for the tasty food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbGFrcENTSFpPUjFGWVZEbGlabmw0Tm5Gb2JrRRAB",
            "text": "I got the pork sandwich and it was delicious, plus the place is really cute."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbUxUaEtWV0kxVXpGMmJuZG5ZVzk1Y2xVMlMwRRAB",
            "text": "Food was amazing!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsc01GTXhkMFprV25oQ01sbGtlVFp0WVVjM2EwRRAB",
            "text": "Rice bowl with pork is always amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WclVqRlBNbFY1V0c5dFYzZFJVVko0T1hkSWVVRRAB",
            "text": "Vibrantly decorated inside. Great spot for lunch in the area! Loved the organic tofu sandwich."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKZTM3ZmZZM3V2S3FRRRAB",
            "text": "Perhaps it's because I hadn't eaten all day, but the sandwich with tofu really hit the spot. The bread was tender, there was a good balance of salt, sweet, acid, and heat. Wonderful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJUzVsOXltNlBtYjVBRRAB",
            "text": "Daily Happy Hour from 3pm to 6pm. I had to try the $3 steamed bun. Well worth it. I’ll definitely return and try the lychee sangria."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNUEtpYWYxMWFIOGlRRRAB",
            "text": "A hidden gem of a restaurant. Highly recommended!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMnJISTZBRRAB",
            "text": "A solid 4.5.  The grain bowl is delicious. The Bahn mi is not authentic so just be aware."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc19TZnd3RRAB",
            "text": "Fantastic food, great portions. We tried the sushi and the sweet potato sandwich. Simply delicious."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0LUlEdkpnEAE",
            "text": "Food delivered faster than expected.  Taste is amazing.  Portion size decent."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRLUlDOHdnRRAB",
            "text": "This place makes me crave their shrimp rice bowl with the lime-honey dressing.  And love that this bowl is gluten free!  The servers are always nice and accommodating and the space has the cutest wallpaper!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbm9ueDR3RRAB",
            "text": "Always great"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBODlYQTdBRRAB",
            "text": "The pork sandwich is amazing\nGreat sauce. Great bread. Great pork."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcW8yZmFBEAE",
            "text": "Found a spot for a meal under $15 located right by Columbia University! Ban Ban Shop is a Southeast Asian-inspired spot for banh mi, bao buns and bowls. It has a vibey interior with ample seatings and a clean bathroom. I would definitely come here often for lunch if I studied at Columbia.\n\n＊Five Spice Roasted Pork Banh Mi $13\nAlthough their banh mi was pricier than the ones I usually get in Chinatown, the banh mi size was enormous. It was fully loaded with at least 3 to 4 slices of roasted pork. The edges of the meat were too charred, but flavor-wise it was decent.\n\n＊Shrimp Maki Rolls $14\nSurprisingly, their maki roll was the standout dish. The avocado was buttery and complemented perfectly with the shrimp and housemade mayo, just like tempura rolls.\n\n＊Steamed Buns (3pcs) $13\nThese baos were heavy and loaded!! The toppings kept falling off when we held them. The steamed bao was soft and stuffed with pickled veggies. Roasted chicken was well-seasoned, sweet potato was tasty, yet the braised tofu wasn't marinated enough imo.\n\n＊Chicken Noodle Soup $12\nA heartwarming dish in winter as the soup had a spicy kick. It had a hearty portion of shredded chicken and veggies. It reminded me of a mix of pho and russian tomato soup.\n\n＊Crispy Lemongrass Flounder Salad $14\nThe salad dressings, sesame caeser and lime-honey, were so addictive. I'm willing to eat more greens if I have these sauces at home.\n\n＊Hibiscus Lemonade $4.5\n＊Mango Pineapple Cooler $4.5"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfb2NITnhRRRAB",
            "text": "Was shocked at how delicious and tender the five spice pork is - I've eaten the rice and grain bowls over the span of 3 meals, so great value for the price as well. The maki rolls are extremely filling and good for when I'm craving avocado"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMEpqbUtnEAE",
            "text": "This is it, this is the new spot. You can’t beat some ban ban and delicious hot tea on a cold and snowy day. I can’t wait to come back for their other happy hour deal of $4 beers. I can’t believe I paid less than $15 for a good lunch today. You just can’t find that anywhere in this neighborhood."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNWRha0JBEAE",
            "text": "Quick and delicious. Fusion done right"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNWRxS2dRRRAB",
            "text": "Delicious! I got the pork rice bowl with the lychee sangria and it hit the spot"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dk1QY0VBEAE",
            "text": "Very nice but a little too salty. $3 happy hour baos are a great deal!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Z0xiTmp3RRAB",
            "text": "Get the roasted pork steamed buns, trust me you can't go wrong . Excellent service and great ambiance in the restaurant. Will definitely be coming back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQOGJqREtBEAE",
            "text": "Nice grain bowls, tasty sandwiches"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNXRqVFhREAE",
            "text": "Reading other reviews I'm not particularly an expert on this type of cuisine like others. But I stopped in for a quick lunch to go. And I was very happy.  I got the roasted pork bowl.  Flavorful. Veggies were tender. Pork loin was fall apart without being to dry. Rice was sticky and moist. I used one of their hot sauces. It was a solid and filling lunch meal. I would go back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMTk3cmt3RRAB",
            "text": "I ordered take out from here and got a few things to try. I really enjoyed the lemongrass flounder sandwich, the roasted sweet potato steamed buns, and the shrimp maki roll. all were super flavorful and fresh and I really enjoyed the crispiness of the bread. I will definitely come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYX2NQOVZREAE",
            "text": "Killer food, highly recommend the Bahn mi and van van"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYekpUMGtRRRAB",
            "text": "I come here for happy hour bao bun sandwiches. $3 / bun - feels like a not too unhealthy dinner as there are some vegetables. Atmosphere is casual which I personally prefer. You eat. You go. No big deal. This is a good thing imo. It’s always a solid option."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubmVPcFRnEAE",
            "text": "Came in for a quick bite to try some baos\n\nThe chicken bao was really good and flavorful - moist and juicy chicken with a nice subtle aoili.\n\nThe Crispy flounder bao was dry and lacking sauce/season and we wouldn't get that one again\n\nThe sweet potato bao is an interesting idea but too much sauce and seasoning on this one.\n\nHappy hour is a great deal at $3/bao! Chicken for us was a winner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcm9EaFVBEAE",
            "text": "The sweet potato sushi is a winner and the chicken soup broth 🤌🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dnJucFNnEAE",
            "text": "Classic tourist/university trap. Genuinely the worst bao buns I’ve ever had. Wishing I never went here and could remove the food physically from my stomach."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3LXB6RmRBEAE",
            "text": "I’ve had protein and grain bowls here for lunch a few different days and they’re always delicious! Today was roasted chicken and vegetables over rice. Pleasantly surprised by variety and portion of veggies - carrots, cauliflower, and parsnips. All very flavorful.\n\nVietnamese flavors and generous portions! Can’t go wrong!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OS1TTkhnEAE",
            "text": "loved their banh mi especially, also i would high key recommend the maki rolls especially if you love avocado!! they have a happy hour for their bun baos everyday from 3-6pm!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cmRUdWtRRRAB",
            "text": "Such a cute spot!! The staff were very friendly and knowledgeable. The steam buns were so delicious! We got the pork, chicken, shrimp, and the sweet potatoes! By far the pork was the best!! But everything was so tasty, we will definitely be back and try more of the food items! Also you can’t miss this happy hour special! So worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3amNybzV3RRAB",
            "text": "10/10 highly recommend Ban Ban Shop! Th Pork Bau is delicious and by far my favorite. But don’t sleep on the sweet potato, it’s easily 2nd best. The atmosphere was welcoming and service was quick. Definitely lived up to the hype on TikTok."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMnVpMkRnEAE",
            "text": "Overall, my experience at this restaurant was a mistake. The atmosphere was nice, but the staff seemed disinterested. The food was a major letdown, with the rice shrimp bowl being cold and rubbery, and the chicken noodle soup being unappetizing. I ended up throwing everything out and would not recommend dining here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiXzdmMWN3EAE",
            "text": "Pretty good. I'd go back to try other items."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMS0ycDd3RRAB",
            "text": "Delicious, love the $3 buns"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNmEtdjF3RRAB",
            "text": "The best salad I've had in the area so far. Greens and chicken were fresh and flavorful, and of course the vibes inside are amazing, too! I also appreciated the handicap door button as a wheelchair user, though if the owners read this, it didn't seem to be working the last time I went in--the door doesn't close the whole way so it may not be able to open with button."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyemI2Q1BREAE",
            "text": "Went for their Happy Hour ($3 buns) and it absolutely delivered on the happiness!  They don't skimp on the portion just because it's HH. Tried the chicken, sweet potato, flounder, & 5-spice pork bun which was sooooooooooo memorable. Completely melted in my mouth. Atmosphere and staff are super friendly!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeksta0t3EAE",
            "text": "Cute little place to sit near the University. The happy hours are worth it. Loved the Tofu Bao Bun, the sauce makes everything even better. Didn’t like the Shrimp Bao bun. Overall 8/10"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbFBTeFlBEAE",
            "text": "Loved stumbling upon this new hidden gem in the upper West side – – perfect for a coffee or lunch date!\n\nThe menu has Southeastern Asian influences and has delicious options for everyone! We loved the bahn mi, their Vietnamese iced coffee and the happy hour $3 Bao buns! (cripsy flounder, chicken + tofu options)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0c2RfQ0RnEAE",
            "text": "Food: 5 | Atmosphere: 5 | Service: 5\n\nPork sandwich was incredible. Baguette was soft and the flavor unmatched. If you like heat, pick up a hot sauce.\n\nVietnamese iced coffee was sweet and delicious. Might get it separately from the sandwich next time to fully savor each flavor.\n\nHighly recommend for a quick bite!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd0lENUJ3EAE",
            "text": "Food 7/10\nHighly recommend the shrimp maki roll and chicken bao. Super flavorful, and the homemade hot sauce was pretty good. Portions are quite large, perfect for if you’re on the go. The mint honey green tea was solid as well. The only downside was the beef in the banh mi, which albeit being really well seasoned, was a little too tough for my liking.\n\nAtmosphere 8/10\nVibey interior, sucks that their entrance is blocked by scaffolding currently. Very tropical vibes and plenty of seating\n\nService 10/10\nFast and friendly staff, thank you for having me!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSam8yTkh3EAE",
            "text": "The pork belly sandwich is hand down the best I’ve had.  Tasty pork belly, tangy pickles and perfect baguette.  The chicken rice bowel is equally tasty.  Excellent services!! Will come back many times"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSanR6X3RRRRAB",
            "text": "The food is really delicious! Definitely recommend the sandwich with the five spice roasted pork. (The baguette isn't so hard that it makes it difficult to eat.) Also did the the maki rolls with shrimp... tasty!! My friend had the soup, which he said was also delish!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cUxHZDJ3RRAB",
            "text": "The steamed buns we tried with the five spice roasted pork was absolutely amazing. My husband took one bite and he immediately went “oh my god”. The bun and the meat were so soft, it all melted in my mouth. The spicy ban ban sauce really brought the dish together; I got it on the side, but I really don’t mind if it was slathered all over the dish 😂"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSb2FINm9BRRAB",
            "text": "The most delicious pork buns/rice bowl and chicken sandwich ever! I could eat here everyday and have been going about 2-3x a week. Great addition to the neighborhood. Can’t wait for more locations… Fun decor too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cXMyRzNRRRAB",
            "text": "Great lunch spot! We loved the simple menu offering an easy selection of Vietnamese-twist food. We tried the pork and chicken protein and they were both seasoned so well! Would definitely recommend anyone looking for lunch or dinner options around the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGcHI3TkpnEAE",
            "text": "The food was ok and I think it would be better if the five spice roasted pork sandwich had more vegetables. The staff made the wrong order for me; thus they gave me the wrong order, but I corrected them and they were accommodating. The packaging was not super great since it’s all in paper and the sauce spilled through the gaps between the lid and the bottom part of the container. It got all over my jacket."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocmFudXV3RRAB",
            "text": "The place has been opened for less than 2 wks and already been there twice. The pic is from the the rice bowl with pork. It was delicious. The rice with flounder and the pork buns were both delicious too. Would recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoM3FIOXdRRRAB",
            "text": "Great addition to the neighborhood!  They serve healthy vietnamese style sandwiches and bowls (Mix grains, meats, veggies), similiar to dig inn but tastes much better.  The service is great and the decor inside is cool."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSanBmT0dBEAE",
            "text": "Michelin Star Chef Nils Noren did it again with this amazing fast casual spot in Morningside Heights.  The five spice roasted pork sandwich, crispy flounder on steamed buns & shrimp maki rolls are a must. For vegetarians, the delicious roasted sweet potatoes can be your protein substitute for the sandwich, steamed buns, grain/rice bowls, salad or rolls. Service here is excellent and the ambiance is inviting."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Z042RFp3EAE",
            "text": "Went to Ban Ban early Saturday evening and it was pretty busy. I love bahn mi and usually go to Saiguette but thought I would give this place a try! Me and my boyfriend ordered the chicken bahn mi (from the kiosk…) and the bread was absolutely fantastic, the chicken was moist and my boyfriend loved it, we both just found the flavor and brightness to be lacking.\nI do find the whole vibe a little odd (with the kiosk and everything) it is almost like this place is engineered to have the least amount of people working as humanly possible… the people working were hustling, two people seemingly doing the jobs of a full front and back of house. Neither staff member really had time to answer a question and any interaction with them I felt like I would be interrupting the like 20 thing things they seemed to be doing at once."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMEp6MjFBRRAB",
            "text": "oh my god every time i come here im blown away. incredible flavors and textures. you must try the pork steamed buns and the watermelon drink is sooooo refreshing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxdjZDbnVRRRAB",
            "text": "Blown away by this place. Ordered the tofu grain bowl which was insanely good, portion size huge, tasted really healthy and cheap. Friendly staff too :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENmVDMnZRRRAB",
            "text": "So delicious!! I had been wanting to try this spot for a while and it did not disappoint. The rice bowl was really good, the service was so nice, and although I did takeout, the atmosphere inside the restaurant is great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bmZTZUF3EAE",
            "text": "Quirky and bright interior in a location very close to Columbia campus! The grain bowl with tofu was delicious and I got the Vietnamese iced coffee as well which was very sweet but very yummy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMblAtbUp3EAE",
            "text": "Great spot for a good and affordable bite to eat. Love the decor of the restaurant but it’s definitely a solid spot as an alternative to the expensive competitors in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSazVhNkVBEAE",
            "text": "A delight from the moment we stepped in. Greeted with a big smile and the kind man working here told us all about the menu. The Roasted Pork Sandwich was delicious. I look forward to coming here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb1pfd1pnEAE",
            "text": "Took one bite and immediately opened my phone to post a review.\n\nI ordered delivery so I can’t say much about the atmosphere or service (other than I received my order super quickly!), but this is quite possibly one of the best meals I’ve had in the city, and I’ve lived here for 25 years.\n\nThe pork sandwich and shrimp maki are to die for. Spiced but not spicy if that’s not your thing but I’m excited to try their hot sauce next time. I really ordered for their Vietnamese coffee and was not disappointed - smooth, creamy and well worth giving up my Starbucks membership card for.\n\nDon’t know where Ban Ban Shop was when I was suffering through undergrad but thank goodness for masters programs."
        }
    ],
    "reviews_count": 70
}