{
    "name": "Briciola Harlem",
    "place_id": "ChIJ2054MAz3wokR13Q2g5LfV_E",
    "grid": "MN9",
    "address": "398 W 145th St, New York, NY 10031, USA",
    "rating": 4.6,
    "user_ratings_total": 212,
    "phone_number": "(212) 315-3315",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkemFqZGhkVkZFYjFSd0xWZFlPVVJmVW1GT1ZIYxAB",
            "text": "Amazing food. This is a well kept secret"
        },
        {
            "date": "수정일: 4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdWJPa253RRAB",
            "text": "Great food and wine selection for a reasonable price."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMFdIVnBlbFJDTVdoT1NIZHJaVVIyU0dsQ1QxRRAB",
            "text": "It's mid and slightly average and every Italian restaurant is different but nonetheless it was enjoyable. I liked my wine a lot and the bread and the food wasn't that great but the waitress was nice and accommodating. If you like it i love it but there are better spots out there"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMU1UZGFhMkpuTVdoVVNtcE5XVEZ0Tldoc2NtYxAB",
            "text": "Little gem  with very good Italian food. Highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUmRrNUZSM2xKUlhKSk1YWnRWMFZVUTNGdVkxRRAB",
            "text": "Food was yummy and an excellent lunch special."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdFJtcDROamhWVlZWSVpXWTBNMDFWVTE4NVpXYxAB",
            "text": "Floppy, wet pizza. Pizza wasn't well made: we ordered a pizza with chicken, tomato and onions. The tomatoes were thick, giant slices -- the kind you put in a sandwich. Thru made the pizza soggy. So soggy that the to-go box was wet at the bottom. The chicken looked like it was the same chicken strips used for salads just thrown on top. The pieces rolled off the slice as you picked it up. Nothing stayed on the slice because everything was heavy and wet. The pizza didn't taste bad but it was so difficult to eat and enjoy because it was floppy and wet and basically needed to be eaten with a fork. The menu has different types of pizza so we expected a custom order wouldn't be hard to pull off but it clearly was. This was our first time trying this spot. Not a good impression. Probably won't come back."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNE1XNHljV1phVWpRdGQzWlliVWRIUkVGb1VGRRAB",
            "text": "Me encantó cuando fui la primera  vez me hicieron sentir comomen casa la chica que estaba ahí en el bar y atendía ese día las mesas junto a otra persona ese día fue Exelente servicio no recuerdo su nombre pero realmente hace bien su trabajo porque con su atrncion tan original y tan afable me hizo sentir cómoda y confortable en pasar un tiempo ameno no solo para comer sino para desconectar y eso es lo importante en un ambiente sano todo depende del personal los que trabajan en la cocina mis respeto todo el staff en general son muy serviciales\nPero aquel día que fui la muchacha que me atendió y el otro muchacho me hizo sentir super bien tanto que decidí volver\nLos precios son muy buenos la comida muy buena y el mejor capuchino que puede encontrar en el área como el vino si le gusta el vino pero en general todo es exquisito y muy fiel a la cocina italiana en cuanto receta se refiere recomiendo ese lugar"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcFUwSktRa1JVUXpZd1pXTnVUVUZRUzI1Q2IzYxAB",
            "text": "The food is ACTUALLY good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201Uk5rTkxTMDE2Y2paeFpsWmZiM1l0VTBWMU5VRRAB",
            "text": "great, hospitable service across the board; had a wonderful time here and felt so taken care of by the bartender and the kitchen staff! would highly recommend to anyone"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TU0xSTNWRTlvZFdoallXaGFPRkY0VkRCRlRVRRAB",
            "text": "Very cozy spot. Only a few tables and bar seating inside and a few tables outside. Our server Jacqueline was very friendly and attentive. We ordered their meatballs to start which were very flavorful and tender. You get 5 per order. They give you an order of bread to start also with EVOO and balsamic vinegar.\nFor the drinks they have a good selection of wines and about 3 beers on the menu. They only do an aperol spritz for a cocktail.\nWe didn’t do any pastas. We ordered 2 personal pies for the entrees. The diavola which is a spicy pepperoni pie and a pepperoni Italian sausage and onion pie. Both were delicious. My only gripe with the pizza was that it was greasy and very floppy in the middle. We had an excellent time and definitely will go back to try the pastas."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdU9WVXlSamQ2UlVkSmVYQnNOMDlrY1ZkNVdIYxAB",
            "text": "Good, nice lunch special"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NFprWnVlSGhXT0VRMGRESnJiRlJFVGs0emEwRRAB",
            "text": "Went on my birthday. Very good meal, atmosphere and service. I live in the neighborhood so definitely coming back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaR2FFcHBVV056YUhCblFrbDBVbEExYTFjM1JrRRAB",
            "text": "Best gluten free pizza I’ve had"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTk0zSnhWVnBhWm5kNFRIVXpiMHRMVFdkUWJuYxAB",
            "text": "Food is always good and service is always friendly"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMU5tbERTSGhNYVdwaFlUSmZNR1JXYlRCamVtYxAB",
            "text": "Food was good. Small place but very intimate. Great place to have a nice dinner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWmFFWlJUalJvZVc5NlNsaHBRbUpVWTNKSVdFRRAB",
            "text": "WORST CUSTOMER SERVICE!!!!\nI am shocked! I have been ordering from this place for the longest time and I clearly expected the customer service to match the food I enjoy from here but, boy was I wrong!\n\nBE CAREFUL with their daily specials. They always have a buy 1 get 1 free special on Uber eats, which I usually order from a couple of times a month.\n\nToday I was near the area so I picked up my order in person instead of having it delivered. When the girl at the bar hands me my order, I quickly realize there’s an item missing. They only gave me 1 pasta.\n\nWhen I try to find her to let her know, she’s literally seating and eating at the bar as the restaurant is open and there are clients in the restaurant. I let her know that there is a pasta missing; I explained to her that I ordered the 2 for 1 and I showed her. She said there was probably a mistake on the order because it said there was only one ordered.\n\nI explain to her, yet again, that I ordered the 2 for 1 and that I can understand that mistakes happen and I said: “I don’t mind waiting” and processed to ask if they can make the other one. She literally SAID NO!\n\nShe said it’s not her, it’s the guys in the kitchen and that she knows they’re not going to make it.\nI was taken aback by her answer and lack of care, but in my disbelief for such poor customer service, I then asked her if she can please (at least) ask the staff to make the other one.\nShe literally said “I’ll ask but they’re going to say no”. She proceeded to go to the kitchen to tell them what happened in Spanish not realizing that I can understand and comes back in less than a second to say NO!\n\nAgain I paid for the 2 for 1! I understand mistakes can happen, I don’t mind waiting; I asked for the missing item (that is already paid for!!!) and they refuse to make it!\n\nI am at a loss for words, clueless on what to do and don’t even know how to feel about this place that I was so looking forward to visit and enjoy in person one day. I’ve never experienced such TERRIBLE CUSTOMER SERVICE, specially at a restaurant!\nBe Better!\n\nIf you can’t live up to the set expectations, don’t set them!\n\nSTOP gaslighting your clients and playing with their money!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bFNXVXlObFpSU0VKaFpqTnlZM1pWY2t0RldIYxAB",
            "text": "My co workers invited me for lunch. This place was very small, cozy, and exquisitely designed for relaxation and comfort. I enjoyed the outside dining experience. The personal 12 inch pizza was so good.The pizza was absolutely delicious and a true treat to the taste buds. I would definitely go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSFJGUnRielp3V21OeGNIWkJjRmQyYVc5clpVRRAB",
            "text": "Delicious pasta and friendly service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNlNXOUJlalpOYlZkbGFrWjFNMkZ5Y0MxblpWRRAB",
            "text": "Fantastic little wine bar. Lunch special is a great deal! Wonderful service and good food and wine. Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReWFFcFFNamxSUmtkSU1XVnNaRzl0YWxOT05IYxAB",
            "text": "They do what they do very well here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObVJVZFhkVU15ZGxsWlNDMVJUa0ZzWTFOeE1IYxAB",
            "text": "A small shop with great taste and good service."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJalllTENBEAE",
            "text": "Italian food bellisimaaaaa!!! Sarah is the best.. Bianca pizza is the best"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKR3huSW5uNjhQM0R3EAE",
            "text": "Went to this restaurant for dinner was immediately off put by the servers rushed/nonchalant service. We got our food and he did the absolute bare minimum while we noticed that he treated the white patrons with much more respect and attention. There was only 3 other people other than us there. The server was not busy he was eating pasta behind us. We noticed as we were finishing another guest came in and he was treated much more kindly than us(another white guest)  he was even offered bread immediately which we never were offered. This was our first and last time at this discriminatory establishment. The server saw our color and decided that we were not worth his time or effort"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQcW03YXpxLTdfRkpBEAE",
            "text": "The team here is incredible. It’s a small venue and they always make us feel welcome and the food is amazing. Thanks to Sara who is open and kind and gives outstanding service! Massimo is great too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQV2g5Y1B2NU5LTWxBRRAB",
            "text": "Been here 5 times now and I’ve never had a bad dish or experience. We keep coming back to the lamb shank, it’s perfect every time and large enough for 2 to share. It’s difficult for them to accommodate large parties due to the small footage, but they’ve maxed out the space as best they can"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNMmZtbzJieVllQzRBRRAB",
            "text": "This WAS my 10 year old grandson and I spot.  UNTIL  I went with my sister and it was three of us.  there’s no accommodation for three people.  There’s ways of communicating and giving customer service.    The restaurant had one party of three closed to the window.  I believe there was way of accommodating us, but don’t know what happen! Not like he have not seeing me and my grandson before.    He didn’t even offer the outside So, definitely in the wrong neighborhood.  I decided to go back to my local restaurant FUMO had the best brunch.!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNSFZ5dXU0M0tDZ0xREAE",
            "text": "I tried two different pasta dishes, but unfortunately, both were soggy – not a great visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPamRndlR0dTZ2Yzh3RRAB",
            "text": "I “only” gave Briciola Harlem four stars because a five star restaurant is a gem. This is a perfectly fine Italian place with totally adequate pastas and other dishes, and prices just right Italian wines. It is not a superb place but it is completely enjoyable. I had a good time and  Sara behind the bar is a pistol. I look forward to dining there again for a simple, no-nonsense meal trattoria-style."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLLUN3NmZ4NXNXSzNRRRAB",
            "text": "My colleagues and I always stop by this place for lunch whenever we're uptown especially for the lunch special: $21 for pasta or pizza with a glass of wine. It’s an amazing deal.\n\nThe service is great, and the servers are attentive and spot on. Most importantly, the food is amazing. I love this place! It’s cozy, cute, and has a great vibe. Overall, it's a fantastic spot from my perspective."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcll2LUR5bmNDZ3hnRRAB",
            "text": "I went with my sister here for her birthday and the food was delicious! The service was of the top quality, the servers and waitress were all kind, caring, and respectful and our waitress had an amazing sense of humor! The ingredients were very high in quality, the portions were filling, and the ambiance was very nice!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLMi1wNGk3ekpiUktREAE",
            "text": "Delicious and great prices."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQU1c2dkRvaE1TVFd3EAE",
            "text": "Make sure to try the tiramisu! It’s the best I’ve ever had!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNN212cHFuaU9LenR3RRAB",
            "text": "The fried calamari is to die for...this places food is extremely good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMTh1Rlh3EAE",
            "text": "Amazing experience this afternoon, Small and cozy place with enormous flavors 10/10. Responsable prices everything tasted so fresh, and attentive service from the two gentlemen in front."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvemZTaTh3RRAB",
            "text": "This is a legit Italian kitchen - pasta cooked al dente. I’ve had enjoyed everything on the menu. They always have specials as well, like a tender lamb shank with risotto or tuna steak with peppercorn sauce, fries, and broccoli di rape. It’s a small, quaint venue with a great vibe. Wine selection is varied and recommendations always spot on."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvenByRlVBEAE",
            "text": "I love this little gem in Harlem. Massimo and Alex are the best . They will make the experience unforgettable!\nThis is my new favorite place . Grazie ragazzi !! Bellissimo ❤️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOFp1WklnEAE",
            "text": "Great experience even with take out"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aHZ6UTVnRRAB",
            "text": "a great cozy italian spot! service was excellent, food was spectacular. I had the black truffle gnocchi, but each dish at the table was superb. will definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMmVTX1RnEAE",
            "text": "Friendly and courteous service! Excellent food in a pleasant atmosphere!\nAnytime(!) again 👍👏🏼"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNmRPQUhREAE",
            "text": "This tiny Italian restaurant offers a delightful culinary experience with its delectable array of pizzas, pastas, and appetizers. Each dish bursts with authentic flavors, showcasing the essence of Italian cuisine. The restaurant boasts an impressive selection of wines, perfectly complementing the savory delights on offer. Whether you're craving a classic Margherita pizza or a rich, creamy pasta dish, it delivers excellence in every bite. With its cozy atmosphere and attentive service, it's the perfect spot for a memorable dining experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeVlmdlV3EAE",
            "text": "Our experience at this restaurant was an absolute disaster. From the start, we were treated rudely by a server because we accidentally made a reservation at another location within the same chain. Instead of resolving the situation politely, we were practically yelled at, making us feel embarrassed and completely unwelcome.\n\nThe atmosphere was chaotic and unprofessional. Not only were the staff loudly discussing their business matters right next to us, but we could also hear the bartender screaming across the bar to customers on the other end. It felt more like a dive bar than a restaurant, which was surprising considering how few people were there.\n\nWhile my food was fine, though we waited a long time for it, my partner's meal was completely cold--even the entree, prosciutto burrata with tomatoes was icy as if it had just come from the freezer. There was no apology or explanation for this.\n\nTo top it all off, when I got home and checked the receipt, I realized I had been overcharged. I ordered the day's special, the beef ravioli and was told it was $20, but the bill listed it as $28. They blatantly lied to me about the price.\n\nThis experience was beyond disappointing. Between the rude staff, the noisy atmosphere, and being overcharged, we will never be returning."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNGZLUEt3EAE",
            "text": "Love this place. Today they had no heat. Instead of closing, they decided to stay open. My family and I got beverages and had to leave. I know how valuable business is, but it's below freezing. I felt bad for the staff. This establishment must do better."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNV82U2NBEAE",
            "text": "A hidden gem in Harlem - incredible pasta and some of the best calamari I’ve ever had. Good wine selection as well for a small cozy spot. Staff and service cannot be any kinder or welcoming."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmZ1phcHRRRRAB",
            "text": "Bricola Harlem is a great discovery in the neighborhood and a hidden gem offering authentic Italian cuisine crafted to perfection. The prosciutto and burrata starter transported me straight to Italy, and the lobster ravioli with vodka sauce (Tortelloni all’Aragosta in Salsa alla Vodka) was so incredible I joked about taking home a jar of it. The ricotta cheesecake was a perfect ending to an unforgettable meal. They have a good selection of wines and every dish is perfectly Italian, can’t wait to try their pizza! With its cozy atmosphere, soft lighting, and intimate counter seating, the dining experience feels uniquely inviting. The kind service provided by Massimo and his team and top-notch ingredients make this a must-visit spot. I can’t wait to return!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eFltWVVnEAE",
            "text": "Looking for lunch in an area we weren't familiar with. Happened upon Briciola Harlem. Wonderful food, comfy/cosy atmosphere, lovely hostess/waitress/bartender (all in one). The bruschetta al funghi e montasio was fabulous. With a glass of Primitivo, what could be finer?"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQMHFmSHRRRRAB",
            "text": "top notch, beautiful, and cozy. one of Harlem's finest restaurants."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNW82NFR3EAE",
            "text": "Delicious, simple, classic Italian hole-in-the-wall spot."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMi1hSTJRRRAB",
            "text": "Delicious food, great service and atmosphere. The pizza tastes so fresh, the pasta has great taste and everything is seasoned to perfection. The staff is so welcoming and friendly, they really take care of you here. You can sit at the bar or get a table, you’ll have a great time."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzODZ6NDR3RRAB",
            "text": "The best food and service and atmosphere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcFAyUENBEAE",
            "text": "I can’t believe we waited so long to try this neighborhood spot!  It’s a chilly November evening , and we got seats at the bar.  Such an inviting and intimate setting!  The vibe was perfect for a couple’s night out.  The food was even better than expected.  We ordered the pasta bolognese and the meatball pizza.  Both were excellent. The ricotta cheesecake was exceptional!  Super creamy and dense with a burnt sugar crust on top.  Served with ice cream and berries.  Definitely Briciola is now at the top of our list!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaU12RmdnRRAB",
            "text": "Can't beat Briciola for uptown Italian, one of my favourite restaurants in NYC. This place has the perfect balance between price point, service and quality in a relaxed atmosphere. Staff are attentive but also let you relax. Most people seem to walk up and they are always accommodating. I appreciate that all the pastas are the same price, the bolognese is decadently creamy and delicious. The octopus salad and thinly sliced mango/goats cheese salad are great. Chocolate lava cake is the best dessert. They serve a dry Italian rose wine which is also top notch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYODViSzFBRRAB",
            "text": "Our party had two vegetarians and there were plenty of options.  We had a gnocchi with truffles special, the penne with artichokes and the fettuccini with mushrooms and they were all excellent although the fettuccini was the winner.  For…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUek9iWG13RRAB",
            "text": "Stepping into this cozy spot near 145th and St. Nicholas Ave feels like a bit of an escape from the hustle and bustle of this busy Harlem corner. You can tell the folks who dine here are regulars.\n\nServers are smartly dressed and greet you with a welcoming hello. Pick your own table or settle in at the bar. Daily Italian specials are handed to you on a small chalk board.\n\nFood comes quickly and you can see into the small kitchen where chefs are working hard. Wine and beer only restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIakozc0ZnEAE",
            "text": "I am in love with this restaurant!♥️ 20/10 for sure. Best risotto EVER! The wine selection, the atmosphere, the lighting, and of course the food. Its perfect if you want to spend a lovely evening and you are a foodie. Its a MOST! 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOVpMNkJREAE",
            "text": "We were planning to get some fast food while we waited for a gospel concert nearby, but we stumbled across this restaurant and decided to get pasta: our expectations were surpassed, they were delicious! Our waiter was also super nice"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaHBDNFFBEAE",
            "text": "Stopped here on a whim Sunday evening and ate inside.  I wanted the full dining experience from apps to dessert, so I ordered the 12oz pour of the house pinot grigio, marinated olives and feta, the truffle gnocchi special of the day, and the tiramisu to go. The wine was pretty smooth and balanced for a house pinot grigio.  The olives were flavorful and the feta was creamy. The gnocchi had a cheese gratin on top, which complemented the creaminess of the truffle sauce. Portion sizes are generous, so I will enjoy everything again tomorrow! The server was attentive. The bathroom was clean. Definitely will come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMl9hME9nEAE",
            "text": "Friends just picked up pizza & brought it home. 2 pizzas with gluten-free crusts. Both were delicious! Thin but well cooked. Supportive crust so even with 2 kinds of meat, the crust didn’t sag or drip!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4c1piTkxBEAE",
            "text": "Walked by and was surprised there's a location in Harlem! Lovely spot for a date night. The gnocchi was creamy and soft. The pizza was lovely. Nice wine options!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidl9iRWpRRRAB",
            "text": "I have ordered from here many times but today was the last time. The driver had dropped my food and when the pizza arrived he left it on the floor infront of my door.when I called they couldn’t do anything about it and said they would make a complaint. The worst customer service at a restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabllIaE9BEAE",
            "text": "This place looks really nice. It’s small but very smartly furnished and aesthetically pleasing. The food was extremely good. I would really recommend to visit. We ordered from the specials and it was worth it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWNTl2MExREAE",
            "text": "Food was delicious service was awesome. Happy I dont have to travel far some real authentic Italian food. Will definitely return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWamJqRGFnEAE",
            "text": "Love this place!! The people who work there are great, the food is amazing and of course the wine is great too!! Would definitely recommend for a date or a night with a friend. Love the ambience as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREM01lYjVBRRAB",
            "text": "the pizza was literally addicting to eat i loved it! it is pretty pricey for very small & thin slices but it was good. if you want some amazing Italian food in Harlem and are willing to spend quite a bit then this place is for you but if you just want some pizza on a budget this place isn’t for you"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadkl5WWNREAE",
            "text": "I ordered a $110 worth of food delivery and no utensils at all.  I have to admit that the taste was not that good, really not worth the price! Not for this time of restaurant. Starting with the Mac and cheese drenched in milk 🍼🥛. It was disgusting, I should have ordered cereal with milk instead!\nCooks here need lessons on how to properly make some simple Mac and cheese, especially at an expensive Italian restaurant like Briciola Harlem.\nThe pizza was ok but I'm sorry to say that the prosciutto crudo smelled like wet dogs! It literally took the elegance of the pizza away with that horrible smell! I had to take out the prosciutto so my invites could have the pizza!\nThe side order of rapini had zero taste. It was like throwing some grass over a grill and serving it to someone 🤢🤢\nThe gnocchi was ok and the bread was fresh. The melanzane e caprino was the only dish worth applauding. Overall too much money for the bargain."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGczRxcW13RRAB",
            "text": "Tried it for the first time today. Picked up a slice and noticed flour all over my hands. I called the restaurant. No offer to redeliver (20 blocks) and extremely rude. We Harlemites deserve better. Mistakes happen, it’s about how you address them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdEpXNWJBEAE",
            "text": "The uptown sister of its midtown brother, Briciola Harlem is a welcome surprise within walking distance of City College and on the block with the express trains. Greatly prized seating at the bar and new classic Italian cuisine accompanied by a wide and deep wine list makes this a quite fine addition to the secret Harlem food scene."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKX3JxVUJ3EAE",
            "text": "Valentine and Maximo were perfect hosts for a great meal. We needed some good restaurants in Harlem and we finally have a few! Welcome Briciola to Harlem!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMalBhM1VREAE",
            "text": "Good food, good vibes, ordered way too much 🤣 calamari fritti is ON POINT"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNzRxRlBBEAE",
            "text": "The place is just amazing. The service, the food, the vibe! Just love it ! Recommended 100% 🥰🥰🥰😍😍😍😍! One of the best fried calamari I’ve ever had!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbW9DNEJnEAE",
            "text": "I love this cozy place, the service is really great and so is the food! The risotto with the lamb shank was pure perfection"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURILW9Mc1NnEAE",
            "text": "This place is a hidden gem....\nTheir dishes never disappoint.\nI keep on ordering from this eater.\nTheir best dish is the meatballs...you can order as appetizer or with spaghetti.\nAnd all the food are delivered in carefully packaged in non plastic containers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGd3FQS2RnEAE",
            "text": "Sublime!! We had such a delicious dinner tonight. The pastas were fresh, incredibly flavorful with generous portions. The service was top notch. The chocolate cake was warm and incredible. To top it all off the eclectic retro music they played made all the guests feel at home!! We will be back!!!! Thank you!"
        }
    ],
    "reviews_count": 72
}