{
    "name": "L'Artista Italian Kitchen & Bar",
    "place_id": "ChIJscGs5JD3wokRcU7HNiu5akM",
    "grid": "MN9",
    "address": "142 Hamilton Pl, New York, NY 10031, USA",
    "rating": 4.6,
    "user_ratings_total": 265,
    "phone_number": "(646) 858-0312",
    "reviews": [
        {
            "date": "2일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTWQydGFZMll6WTE5dFNHVnVNa1J0YjJwa1dYYxAB",
            "text": "Qué lugar tan encantador. Pequeño, acogedor y con una vibra que te atrapa desde que entras. La música de jazz en vivo crea una atmósfera mágica —de esas que te hacen olvidar el tiempo—, los tragos están muy bien preparados y el servicio es cálido y atento.\n\nEl verdadero protagonista de la noche fue el bartender, que se lleva las 5 estrellas por su energía y el arte con el que prepara cada copa. Es el tipo de sitio perfecto para ir con amigos o simplemente relajarse después de un largo día.\n\nSin duda, una joya escondida en Nueva York, ideal para disfrutar de buenas conversaciones, tragos y música increíble."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0M1ZVaG1XWEYwTVVKaVNWQnZNR1ZqZUZWdGRuYxAB",
            "text": "As a local guide for decades now ( when it was not even a thing and we relied on zagat) it took years to find little cute quality gems like this.But thanks to Google maps not we can!\n\nFood is great, atmosphere dreamy and jazzy, ad servers friendly and professional. I love their charcuterie and I sample the tia steak and it's one of my new neighborhood favorite. There was jazz my painted friend tok me to see after a session and we ha a great food and drink  experience."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sc1FXUlBXVFZMVkY5dWNVNW1Ua1pCY1hsUmVHYxAB",
            "text": "Nice little Italian place for wine and appetizers."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMWFGSmhhbFZETFZCdFlrRnJVM0JZTmpab01rRRAB",
            "text": "La’Artista is a gem! The grilled branzino was insanely good, the drinks hit the spot, and the vibe was perfect. I was a little worried unsure because my friend is a vegan but they had cauliflower tossed in bbq sauce.. which my friend  loved.. Huge shoutout to our waiter Edwin who was super friendly and made the night even better. Can’t wait to go back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNkxYTldlV3Q2TTJFeVlXNWZjVzV5UjA5NFExRRAB",
            "text": "The food was very good, the service was excellent, everything was wonderful and for those reading this I highly recommend the restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdmRFRjJlbkpJYkVGU1N6ZHpVbGxNYVRKMU5IYxAB",
            "text": "The food was very underwhelming. We order the meatballs that are priced $15+. They were very small, not as tasty and disguised the small meatballs with mozzarella cheese. The pasta was not cooked in salted water so it tasted bland. The Bronzino was OK but once again, there was no real seasoning our flavors. I wouldn’t recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUmJHUktTVVppYnpKd2RFSXdUaTFDV0V4aE5rRRAB",
            "text": "Came to eat here a couple of times and it’s always great with food and atmosphere. Hands down would like to come again but the luck I’ve had with a server making side  comments about the stuff we order (food and drinks) and after ordering our second a second drink telling me I’ve had too much and I was genuinely confused about the whole situation. Not sure if he confused us with another table but the side comments he made made me not want to come back again. Other then that it was great to dine"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJbTUydl92bE1XZ1JREAE",
            "text": "The food was good, four stars. We all ordered different dishes: bolognese pasta (good), flat bread pizza (very low quality), beef (good), calamari (average), and octopus (good). The ingredients were of good quality, but some dishes, can be improved such as the “grilled” calamari, which is more like a soup of boiled calamari. The nutella tiramisu was terrible."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d1phUkhREAE",
            "text": "Great food, awesome service, & cozy atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbDhEWk93EAE",
            "text": "I ordered carpaccio and I got processed (not raw) slices of beef that were from a deli. I'm Italian and I know exactly how carpaccio should be prepared.  Also, it wasn't wagyu slices of beef"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bF95aUl3EAE",
            "text": "I sat down to a peaceful, delicious, mid-afternoon meal on Sunday, and everything was lovely...food, service (Edwin, our server, was just the right blend of efficient and discreet). I thought I couldn't be happier. But about an hour into the meal, I discovered I could: I don't know if it's every Sunday, but a live, small ensemble program of music began around five. I was sorry my holiday crazy schedule wouldn't let me stay, but the quality of the food and service, plus the added dimension of the tastefully gentle live music--not to mention the reaonable prices--will have me returning undoubtedly. The charm of middle Europe, without the airfare!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzXzk3TDZBRRAB",
            "text": "came here for a birthday dinner and was pretty disappointed.\n\nchicken was good\n\nshort ribs were VERY fatty\n\nbotanica cocktail was advertised as being made with Hendricks gin, but waiter/bartender used Beefeater, which makes it a very different (and not as good) drink.\n\ndon't think we'll be back to this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcFBlRmd3RRAB",
            "text": "Great authentic Italian spot. The fusilli was excellent and the service was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudmRIUFFBEAE",
            "text": "Everything was incredible. What an amazing spot.  Truly delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOXBEV0lBEAE",
            "text": "everytime i come here, its always a magical intimate moment. the server is always attentive to my order and has the most amazing picks when jt comes to the menu. their dishes, especially the pollo will leave you begging for more and has made me a repeat customer when i lived in new york city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3LS1pSVRREAE",
            "text": "Rolando was just perfect. Funny, attentive and kind. Nonetheless the food was just perfect, as Italian I wouldn’t have changed anything. We started with Tagliere Campagnolo, exceptional rosemary taralli, sliced cured meats and olives.\nAfter that we had tagliata di tonno (such a tender and exquisite piece), gnocchi al Gorgonzola and polletto. All of us were super happy and full!\nAnd the final homemade limoncello was just the cherry on top!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieC1idHRBRRAB",
            "text": "We had a *very* special meal at L’artista. First time there. Delightful, caring service. Atmospheric, compact interior. Absolutely delicious food. It’s Restaurant Week so the three of us ordered our 3-course options from the limited, $45 fixed price menu. Also, we all had mixed drinks as it was happy hour. Good deal. We shared each main dish…Eggplant with burrata, pan seared branzino, and a Bolonese pasta.  All were outstanding. The killer appetizer was thin sliced Wagyu beef with smoked greens. Bread pudding dessert was yummy.  Wish we lived in the City, as this place is clearly one to which we’d return, repeatedly. Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURia1ltOEl3EAE",
            "text": "I stopped by for a quick drink with two companions and ended up enjoying a couple Italian Marguerites, several appetizers, and a great time last night!\nThe restaurant is lovely...well designed, comfortable, and welcoming. The Server (Rolando?) was great.\nInside and outside seating with an intimate outside nook in back of the restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibWRyMEV3EAE",
            "text": "I had a surprise birthday party here and every thing was wonderful. The service was 10/10💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMLWZ1X2pnRRAB",
            "text": "L’Artista is a true gem! We’ve been regulars for 3 years and have loved it every time.\n\nDon’t be fooled by its small physical footprint - this restaurant packs a punch. Everything from its starters (try the Arancino), to the mains (all the pasta dishes!), to the deserts (lava cake is a personal favorite) is delicious.\n\nThe restaurant also has an impressive wine and cocktail menu - ask for recommendations from the knowledgeable staff.\n\nOne note of caution: Since L’Artista only has limited seating, make sure to reserve ahead of time if you want a spot on a special day, like Valentine’s. Once you do, nothing will stand in your way towards a delicious evening!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMam8yU2t3RRAB",
            "text": "I visited this restaurant last night and could not believe how good the food is in this place. Every dish was absolutely delicious including desserts. A gem!  Can’t wait to go back for more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6aDRLcHNnRRAB",
            "text": "My husband and I have been to L'Artista on a number of occasions and it never disappoints. The food and wine menus are very thoughtful and always a delight. The atmosphere is fantastic (inside has a cosy Harlem Bohemian vibe and the outside area is a gem as its tucked away from traffic on a square where there's often live music playing). More than anything, the service is outstanding. We've always been very well looked after by Giovanni, Ronaldo and on our last visit also the lovely young lady who's just joined the team. Really recommend this place if you want an elegant but relaxed date night (the brunch is also fab)."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6X2VxclZ3EAE",
            "text": "Je suis un jeune Français en visite sur New York et quel ne fut pas ma surprise de trouver ce petit coin paisible où la convivialité du staff, l’excellente nourriture et la véritable recherche autour de la carte des boissons vous feront passer un moment des plus agréable je vous recommande vivement cet établissement allez y les yeux fermés, vous ne serez pas déçu !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6a3B2dkx3EAE",
            "text": "A neighborhood gem. Delicious food and drinks and perfect atmosphere. Giovanni is a great cook and wonderful bartender, who serves as a warm host too. And the new chef is also great!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6emZ6NHB3RRAB",
            "text": "Had a wonderful dinner here, Rolando took excellent care of us! Great happy hour prices"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6dVAtUlFBEAE",
            "text": "What an amazing discovery! Took our daughter here for an after graduation dinner and everything we ordered was exquisite. Spent our dinners passing plates around so that all could enjoy the amalgam of flavors as we sat out back. Even the thunderstorm that ripped through couldn’t dampen our meal as the umbrella that was moved over and the surrounding overhangs managed to keep us dry.  FYI, the signature drinks were also perfect, including the 0% Negroni. Extra acknowledgements to our server, who kept everything straight as we kept changing our minds, and introduced us to J’Nai Bridges and Willie Alexander, who just happened to be sharing the patio with us at the next table. So on top of everything else, new music in the queue! All of it is just a long block over and short block down from the 145th St 1, facing Johnny Hartman Plaza."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdjVDVF9BRRAB",
            "text": "What a wonderful walking distance to City College.We celebrated our son's graduation and was so pleased with the service, the ambience and food. Great choice of wines, beers and cocktails along with delicious flat breads and a flavorful meal I had was octopus with polenta. The restaurant treated us to Limoncello shots and dessert to celebrate and the staff was so friendly and attentive. We enjoyed watching people in the square play dominos and see the sunset on the surrounding buildings.  A great find."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUMTREMHpRRRAB",
            "text": "We had a fabulous meal at a table  outside. The action on the street added to the great atmosphere\nService was top notch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdWMtTkZnEAE",
            "text": "I’m not one to write a review, especially a bad one. But this was one of the worst dining experiences ever. The cocktails were terrible, our appetizer came out still frozen in the center, the service was unbelievably slow. We saw bread on all the other tables but had to ask 3 times to get some- after being there almost 2 hours. We were given a salad on the house which was nice, but nothing was comped from our bill and the prices are super high for the neighborhood. If you’re looking for good Italian food , go to Bono . Don’t waste your time or money here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUMU4tVktBEAE",
            "text": "Very delicious Italian food. Variety of options to choose from and very friendly staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNFlqdHl3RRAB",
            "text": "Really good food and drinks however we went for happy hour but they didn’t have a happy hour menu in person and after we asked the waiter said to check online but also there want one there. The guy serving us was very nice but he was the server/busser/hostess he was the only person there taking care of 7 tables so we got our glass of wine 30 minutes after ordering, felt bad for him! Hire more people!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqenNMVVV3EAE",
            "text": "Nice atmosphere, soft music , great service . Rolando and Giovanni were very welcoming and friendly . Food was nicely served and well prepared. Overall a pleasant experience. Can recommend to anyone who is looking for  a great experience in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNXB5YmhnRRAB",
            "text": "We had a family dinner on Saturday, 4/20.  Kate was our waitress and she was absolutely AMAZING.  We had the artichokes and the carpaccio for appetizers.  For dinner, the table had the beef short rib, salmon, tuna, and spaghetti.  Absolutely exceptional.  The entire experience was to notch and it’s highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdkltUktBEAE",
            "text": "Beautiful environment and warm staff. Absolutely wonderful place."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENDlyNDVRRRAB",
            "text": "El sitio es pequeño pero acogedor, los tragos bien, el servicio excelente,  la comida muy bien,  solo una pequeña falla con la pasta que pedí no estaba al dente. Volveré una vez más. 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbHZQUXFBRRAB",
            "text": "The food here is exquisite.\nVery cozy & intimate atmosphere.\nNever had a bad meal!\nThe people working here are very friendly & make me feel welcome every time.\nI always look forward to beautiful options.\nWill definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dDhXbzd3RRAB",
            "text": "Had a great experience.  The waitress was very attentive and food was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cU4tWjZnRRAB",
            "text": "My friend and I got done with class at City College and were going to go to an Italian place near campus, but they had a 45 minute wait. We discovered this a few blocks away and decided to check it out and I am so glad we did. This place is a hole in the wall with some of the best handmade food I’ve ever had. I got the gnocchi and it was prepared as an individual portion made to order and it was the best gnocchi I’ve had in a very long time. They were pillowy and soft and the sauce they were served in was insanely good. The service was wonderful and the atmosphere was perfect for a catch up sesh with my best friend. I will be coming back here and telling my friends about it because — wow! Truly so delicious. We also split the passion fruit pannacotta for dessert and it was made with fresh passion fruit on top. If you’re looking for good food, this is your spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkaC1Ia3lBRRAB",
            "text": "My Husband and have lived in this neighborhood literally 500 ft away, and for the first time in 8 years we tried a local restaurant and was blown way. The Food 5🌟, the Ambiance 5🌟, The Staff 5🌟. Overall the The Best Instant Date Night Ever👍🏾👍🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMXJ1eXhnRRAB",
            "text": "Appetizer was good but service was very slow"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0dVB6SVVBEAE",
            "text": "Danny is an incredible server! He took such good care of me and my friend, I will definitely be coming back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdk8tNkZnEAE",
            "text": "Super cute spot with great food and drinks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbkphc29BRRAB",
            "text": "One of my favorites! I miss living close to this jem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbUx1ZV9nRRAB",
            "text": "Fantastic service.  Even more fantastic food and wine. 10s across the board"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLTR6RDB3RRAB",
            "text": "We came in for a birthday dinner and were absolutely blown away. Fabulous food. Fabulous service. Can’t wait to return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLTdDMWl3RRAB",
            "text": "Such a wonderful spot great service and amazing food!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdThYejlnRRAB",
            "text": "Amazing food and service, would definitely come back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdTVIcTNnRRAB",
            "text": "Amazing place - excellent restaurant, exceptional service and we had a great time. The food is great, especially the crispy artichoke, tuna and the mushroom pasta."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNjh2VGN3EAE",
            "text": "My husband and I recently moved to the area and noticed this charming-looking restaurant on the square. After some time we finally went last night on a whim. It was every bit as inviting inside as it appeared when we passed it by. The atmosphere is not the only selling point. There is a good wine list that is reasonably priced and the food was delicious too. The pasta was a stand out. Our waitress was very kind and welcoming as well.  It’s a great a neighborhood restaurant that I will definitely visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcmJfQzN3RRAB",
            "text": "adorable neighborhood Italian eatery. Small but mighty!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDaUp5NXV3RRAB",
            "text": "Neighborhood bistro overlooking a small square with good al fresco ambiance, (so long as the square not being occupied by noisy groups). The location was perfect for cook afternoon and evening, as the sun sets behind the building.\nThe wait staff were wonderful on the two occasions we dined.\nPros: outdoor dining when timing is right. The sides of mushroom and spinach were excellent. The seared tuna was great.\nCons: only one draft beer choice. The \"Prime\" Ribeye may not be the USDA \"Prime\" grade, but was ok for the price.\nThey also have a back patio that could also have a nice ambiance at night when the lights come up, bit haven't been."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNXE3ZW9BRRAB",
            "text": "Last weekend I hosted my sister’s bridal shower at L’Artista and it was simply wonderful. I’ve been working with the owner German, trying to plan it for several months. They have a beautiful backyard patio, but due to structural issues we could not host it there like originally planned. I had an idea to host it in the public square in front of the restaurant. German, Guillermo, and the other staff were more than accommodating to make my vision come to life. The food was delicious, drinks were strong, and staff friendly. I personally prefer to support smaller, local restaurants and they surely provided amazing services. Thank you so much for everything!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMGJQNlZREAE",
            "text": "Had a nice evening during happy hour in this little gem. We got the cheese & meat board and bottle of red. We watch the people pass by while enjoying the place and the food. The bread is amazing! It’s fluffy and went well with the light buttery cheese. It’s awesome that my bf place is just around the corner. Can’t wait to sit by the little park and enjoy the sun while having a rose when it gets warmer."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDbU9XTmZnEAE",
            "text": "Lovely place with great food, simple Italian menu with a hint of Spain, simple wine menu as well but you will find some wine to pair with your dishes.\nI tried few dishes and I loved them, I've been following shef German from his other restaurants and he has been consistent with the quality of his food.\nI tried the prosciutto with tomato and mozzarella and it was nice and fresh, tried the lamb and it was beautifully cooked with even temperature on both pieces, which is a sign of a skilled chef.\nService might take some time, usually for me that knocks down the rating to 4 stars but I understand that things are not the same since the pandemic, other than that a nice restaurant with great atmosphere.\nMake sure to check the back area, it's quite and relaxing if you want to enjoy a conversation"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDNEppVndBRRAB",
            "text": "L’artista deserves 5 starts!!!\n\nThe backyard is just magic, all those lights and set up make it more special.\nFood was very good, i also appreciated the service a lot!\n\nPizza was crunchy, pasta al dente!!!\n\nI will be back for sure."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxanB2RzJnRRAB",
            "text": "Wonderful brunch menu. Had the Frittata & Riesling wine. Very friendly service. Chef German prepared the food. YUM, Yum, YUM.Good variety of wines, beer & liquors. LIVE JAZZ MUSIC later on!! Come on up to Hamilton Heights. This is well worth the trip!! I highly recommend.\nI just stopped in to have dinner. This cozy restaurant is still great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoelBMTjNBRRAB",
            "text": "My family and I went to L’Artista Italian kitchen &Bar last Saturday evening. The service was fantastic. The food was amazing. My daughter ordered stuffed crabs ravioli. I ordered sea food linguini and my husband cheeseburger. All delicious. Closed it with perfect dessert! All perfect. 💯💯💯…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDNVpxUFh3EAE",
            "text": "I opted for something light so I had the Salmon and a glass of Pinot Grigio. The wine was very nice, the salmon and vegetables grilled just right. The curbside seated worked out well because of the nice evening weather but they have a rear…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxeVBmTjJnRRAB",
            "text": "Great food and ambience. I didn’t enjoy my meal but I feel like it wasn’t a match for me (fried rice ball). Next time I’ll try something else. My partner had amazing seafood pasta dish that we both enjoyed. Made in-house and tasty. Service was great. Would come back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPLVAydDJ3RRAB",
            "text": "Went for dinner on a Sunday, no wait and plenty of seating. Very small, perfect for a date night. Small menu but still variety. Everything was delicious. Pastas was fresh and cooked just right. Would go again. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCN3MzSGJBEAE",
            "text": "The atmosphere is great we sat outside and they’re dog friendly. They have free bread and a spicy olive oil which is great. Our server was very kind also. However the food was mediocre. We go the braised duck and noodles, which tasted like plain chick. Also got the grilled shrimp calamari which was a small portion and did not taste grilled. The food quality did not match the price. Would like to go back if the food gets better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMEpiaVJnEAE",
            "text": "Absolutely fantastic!  Best food and service I've had in a long time.   Just great.  We got a meat board (Spain v Italy) which was great.   We also got the rib and mussels.   Also fantastic! It is so fresh.  We could literally watch the chef cooking our food.   This is a place that makes all of it fresh and immediately.  For example, we saw the chef make our mashed potatoes right in front of us.  Fresh potatoes, boiled, and all the good stuff.   I could not recommend more."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJejkybUd3EAE",
            "text": "This restaurant is phenomenal!!! SO glad it opened in our neighborhood- great atmosphere and place to be. Would most certainly recommend. Owner is lovely, food is excellent and the passion fruit drinks are spectacular! Best burger in town!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZdUtQNE5nEAE",
            "text": "I think everyone in the neighborhood should visit L' Argot. The place is perfect for a night out, chatting with friends, dating, etc. I love their food especially their burgers. The drinks are a whole different level, I never had a bloody…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZMDlheHl3RRAB",
            "text": "This was our second time at L'Argot. The first time it was on a weekend for a brunch and it was delicious. This time it was for dinner, also delicious. For a starter, we had a guacamole with plantain chips (instead of tortilla chips),…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScV9LaHdBRRAB",
            "text": "Stopped by for a glass of wine and some fries, amazing food and wonderful service. The atmosphere was great and the outdoor and indoor seating was perfect for a date night. Alvin the bartender was super nice and helpful."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHMi1xRHBRRRAB",
            "text": "Such a lovely sweet new addition to the ever expanding Hamilton Heights restaurant scene.  The food, service and wine were all on point.  This place has one of those great cozy vibes - not too large yet big enough to have a buzz, meet some…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxa0xDdGxnRRAB",
            "text": "Food is absolutely top notch! It’s so much better than Fumo. Everything we tried is delicious.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdHFuX2JnEAE",
            "text": "They have very beautiful garden. The servers so nice. Very beautiful place. And food and drinks are delicious."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4NDhlN1NREAE",
            "text": "The food was great. Syrup for the pancakes had a weird taste that doesn't remind you of a homestyle syrup. Overall had a nice experience"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLd3FIcDZBRRAB",
            "text": "Was here yesterday with my family. Food is amazing. Everything is so cute! Guys, we will come back and we will support you! Wish you all the best! You doing great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcy15Y0dnEAE",
            "text": "We enjoyed a family brunch following the engagement of out daughter. We sat outside on the lovely patio. This is a very small but beautiful restaurant. The food was absolutely fantastic, the service was personal and friendly, and the cocktails were perfect. Be aware that it takes time to eat a meal here-so don’t be in a hurry. We will definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobTQzMTRBRRAB",
            "text": "It's tough to not sound as if I've been paid to say write this - I was not. Haha..  I loved this place.  The food was amazing!  The cocktails are worth a subway ride.  The service made me feel like I was with family.  The space is…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2N2NYWkpBEAE",
            "text": "Lovely neighborhood spot, perfect for people watching over a glass of wine or negroni"
        }
    ],
    "reviews_count": 74
}