{
    "name": "Cafe One",
    "place_id": "ChIJbUiV42T2wokR-PueTvKy764",
    "grid": "MN9",
    "address": "1619 Amsterdam Ave, New York, NY 10031, USA",
    "rating": 4.6,
    "user_ratings_total": 533,
    "phone_number": "(212) 690-0060",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONlVIWnZaVlJMV2s1UmFrTmxaRlZPYTJkak4wRRAB",
            "text": "The ABSOLUTE TRUTH OF CAFE'S 👏 ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wc1EwNUVWM0ZDU2pKRU9HdGZPVnBDUWpoM09GRRAB",
            "text": "Jocelyn was very patient with us early on a hot Sunday morning when we didn’t know what we wanted or how things worked. Coffee and Pain au Chocolat were excellent and very reasonably priced."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaWVtc3hWMWgxUWtkTk4yMVZkME5JZUZBMlZHYxAB",
            "text": "While working as a receptionist, the cafe notified me that they were sending someone to return a coffee machine. Instead of going to the main entrance and proceeded to yell at me even though they did not tell me where they were going for pick up. Poor service, rude and entitled owners and staff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSU1UzSnZPVE16WVhwNE9XZFRTemxmUzJSck9FRRAB",
            "text": "I’ve gone through their entire drinks menu over the 10+ years I’ve gone here, and literally everything tastes fantastic. I’ve never gotten a single bad drink from them, ever.\n\nThey also have a great variety of food within different price ranges—but if you can try only one thing from here, get the black bean burger."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNFV6SnNkblJ2UXpsRmNuZEhVVTlNUTNWV1puYxAB",
            "text": "Really great local shop with fresh food and relatively low prices. Wonderful for the students in the area to get quality food and drinks without breaking their bank. The staff is really kind and warm!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKaVIyTG1jN08ycnJRRRAB",
            "text": "Coffee is good. Bread was old and hard, and service is subpar."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMX25pcFdkaXI3WXhRRRAB",
            "text": "My go to morning coffee is here.\nReasonable customer service.\nOwners are for the community,  serving decent food.\nThey cut my sandwich BEFORE it’s wrapped!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcXFrTHFLNi16S3R3RRAB",
            "text": "Stopped in on a whim one day to check it out and was delighted by their chocolate mousse cake. Is it subtle? No. This is not a French concoction that will set you back $15. This is a Friday night, it's been a long week, you're eating your feelings indulgence. Rich, creamy, satisfying. Way better than a pint of ice cream. I used to occasionally head over to Westside Market for a slice of their Chocolate Outrage cake but I'll be coming here instead from now on."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMS2x2TldNcG9fazlnRRAB",
            "text": "23 minute wait for a bacon egg and cheese on a slow day. A consistent issue that they have had for years is that orders will get lost or ignored. Great food. Terrible wait each time even when ordering ahead with apps"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeWItOXZRRRAB",
            "text": "This spot is perfect for a cup of perfectly brewed coffee. You can pick up your sweet treats, sandwiches, beverages and everything is fresh! The servers wear friendly smiles and this cafe attracts a wide range of down-to-earth people including families with small kids. Neat little spot. You can sit inside or outside, and there is plenty of parking too. Give Cafe One a try if you are ever in the neighborhood—good eats!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveTRhUUdBEAE",
            "text": "One of the best cafes in Harlem. Everything is delish."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLXMtcVVnEAE",
            "text": "i stopped by this spot earlier in the week and absolutely loved the service and my food!! it was so fresh and delicious, super affordable too☺️"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbWZXSWlBRRAB",
            "text": "This place has good coffee, and the owner, Katlyn, is so friendly. The only thing is that this place would need a fix someday! The food and variety/ quality are lovely, too. Do not think twice. They have gotten much quicker with their orders as opposed to previous years💯💯"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmZ2QzSXJnRRAB",
            "text": "El café, realmente bueno. Hago un update si pruebo algo más, pero muy bien el croissant. Es un café de barrio en Harlem. Amei."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NVpIUU5nEAE",
            "text": "Love this place! Went to City College and I used to always come here with my friends and get the black bean burger or their pre-maid salads. This was between the years of 2013 and 2016. I just came back recently in 2024, and their black bean burger still taste amazing!! I get my burger on a wrap. I would recommend getting the black bean burger. 👌🏿"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2c3VYbHNRRRAB",
            "text": "Everyone comes here for a reason.\n\nThe staff are so friendly, definitely a highlight to my mornings, or afternoons depending on my mood.\n\nI usually get a matcha or chai, equally good. I prefer spice for my chai but when I want something sweeter I go for vanilla. Whatever I get, the barista does it amazingly.\n\nTheres plenty of good food there too. I put up a pic of a bacon egg and cheese on a bagel. They also have a good chicken sandwich, the spicy chicken, that I recommend.\n\nI recently tried the chicken Chipotle. I’m not a fan of tomato but it definitely did its job in the chicken Chipotle. The juices and the lighter tomato balanced out the stronger and meaty chipotle chicken, so I recommend leaving in the tomato this one time.\n\nThere’s usually a bit of wait time but it’s so worth it, if you’re in a crunch def call ahead"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNlp6cWtnRRAB",
            "text": "My boyfriend loves their black bean burger."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQb1B2eDFRRRAB",
            "text": "This is a small cafe with a huge personality! There is kindness and warmth radiating from every corner. What puts it all together is the genuinely amazing drinks and foods that are offered here. It’s mostly affordable, and def has made my experience as a college student a little bit better :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMWN2aXpRRRAB",
            "text": "Amazing place! Best value in NYC highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeXRqVV9RRRAB",
            "text": "Great place for a cup of coffee"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeHFhRGV3EAE",
            "text": "Nice place to get coffee"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubmJuWm93RRAB",
            "text": "FIRST STOP ! When my wife booked our Airbnb brownstone apartment in Upper Manhattan, NY for our recent 2 week vacation we could see on Google Maps there were a few cafes pretty close by...handy for breakfast. On our first morning at our new…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN09IUzJRRRAB",
            "text": "Fun spot.  Had breakfast to go with my daughter and wife.  The food was great and freshly made, the service was prompt. We noted that police and college students were the main customers and it was busy in a good way.\n\nWe had variations of egg bagels - all reasonably priced and delicious.\n\nHighly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdnMyejlnRRAB",
            "text": "Good pastry and not overpriced at all!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURid08zUDd3RRAB",
            "text": "I lived in Harlem for 2 yrs from 2016-2018. This place was the best then and is the best now. My husband and I went last week and the food, coffee, and staff is still the best ever."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOGFtUFlREAE",
            "text": "The Beagle excellent. The macaron is amazing. Owner was very helpful for someone from another country."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNlBEMkZ3EAE",
            "text": "This is such a great neighborhood cafe! The coffee and breakfast options are excellent, but their paninis and pastries are even better! There are three tables inside and high top seating at the window. There are also seats outside.\n\nWe loved the macarons! Buy 5 and get the 6th free for $12 and they were great! All the staff were friendly and service was quick."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNEo3TVBREAE",
            "text": "the food here is not bad. just pricey since it’s by university and all. however, the wait time is horrible. They move quite slow. i’ve been here for 25 minutes for a regular chicken wrap. .."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bTZ1REpnEAE",
            "text": "Overall very nice and price is reasonable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0d1pDdVZ3EAE",
            "text": "It’s in the pricey side, but that can be excused since it is located in Manhattan and it’s your local bakery. It tastes delicious and is convenient when coming out for lunch from CCNY. Glad a friend introduced me to this place, because now I haven’t stopped… 😂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0LUxQcFBnEAE",
            "text": "A great place serving City College and the Hamilton heights area  great coffee, great sandwiches, the owners and staff are some of the friendliest, most courteous employees you will meet."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0d09mR0ZBEAE",
            "text": "Was looking for a lunch place, the line was almost out the door, very friendly, food, reasonably priced, got a turkey Panini that came with a salad for $9.50, pretty good for Manhattan. Cherry danish was pretty good too, coffee was average. Best thing about the place is you can get a variety of food, price is right, and the vibe is good. Not a fancy place, best if you want to grab lunch to go."
        },
        {
            "date": "1년 전",
            "language": "uk",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc3Y2bzVnRRAB",
            "text": "Це було звичайно. Ми очікували сендвіч із справжнім м'ясом, проте отримали лише шинку в своїх сендвічах. Шинки було багато, до сендвіча йшов свіжий салат. Але все це було не дуже смачно, на мій смак. Можливо комусь це сподобається. Кекси були свіжі, але дуже скупі на начинку. Кава непогана, хоча ми просили не додавати цукор, а вона була солодка, можливо додали якийсь сироп. В цілому, може бути для сніданку. Але ми б не повернулись знову."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsbHRDNFpBEAE",
            "text": "Cafe One is the best! Amazing customer service. Great food. Great business."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURscktQeWh3RRAB",
            "text": "I go there multiple times during my school week to get coffee. Never had a bad experience. They are friendly and the coffee is priced reasonably. They also open on time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGc2ZteTdnRRAB",
            "text": "made a stop at my go-to neighborhood coffee spot before running errands ☕️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1eHRyU0ZREAE",
            "text": "Mainstay for good lattes and a bagel. Great service! Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaLWNfV0p3EAE",
            "text": "Had a pretty good lunch here recently. I ordered on seamless and picked it up and it looks like the prices are higher to order through that than in store. They were really busy and it took 30! mins for my food to be ready which I was pretty annoyed by. The inside is small and they have some outdoor seating. I ordered the Italian wrap and it was good.  I’ve had it from here before and this time wasn’t as good, honestly.  I also tried the spicy beef sandwich with sauce on the side. It was good but entirely fell apart so it was hard to eat.  Overall, I’d say the food was good but the wait was way too long for me.\n\nIt looked like a lot of people were getting coffee and special drinks so maybe I’ll try one instead next time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaa3VLcE13EAE",
            "text": "Affordable and great quality❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaajVIODZRRRAB",
            "text": "Amazing chai"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M1BtV1NREAE",
            "text": "omg prob my fav spot after my house & the bookstore, i absolutely love getting food here, it’s next to uni so it’s like literally perfect, they have amazing breakfast options, super healthy also and v affordable, only $4 ish for a sausage egg & cheese! my fav lunch items is the greek avocado on a spinach wrap and the mozz panini w salad and sometimes w jalapeño chips (rlly spicy)!but the BEST thing is prob the mozz & peppers and the iced vanilla chai w oat, their iced coffee is also good bc it’s only $4 and comes with an espresso shot so it’s like perfect when studying, also the muffins are daily baked (my fav is the double choc muffin w butter) and when it’s cold it’s perfect to study but it gets like rlly busy! 🎧☕️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOEp6MUlBEAE",
            "text": "VERY BUSY. Good food. Service was fine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aWM2RFlnEAE",
            "text": "Just what I needed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSODVpbU93EAE",
            "text": "Delicious sandwiches and nice staff, worth the wait. Convenient for city college people."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSc2NYdmF3EAE",
            "text": "The best place in the neighborhood"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHMktTdUFREAE",
            "text": "Beautiful place with a great choice of beers and drinks. It is getting more and more expensive (one small coffee is around $5) but it's the perfect spot to work, chill, and join some crafts/game club."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSM0t1Y2hBRRAB",
            "text": "Amazing place for a quick bite!  Food and service are both perfect! 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSX0l5REh3EAE",
            "text": "First time ordering from this cafe. I bought the chicken pesto panini with a side salad and wow, it was delicious! The panini was grilled to perfection and so crisp. I really enjoyed it, and for that price includes a salad which you cannot go wrong! Also the cashier was very attentive and friendly. Next time I’m trying their drinks. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNjYzWmZnEAE",
            "text": "Cafe One is a great place for breakfast and lunch. We've seen many students lined up there from City College and they know where the good food is at near their school so we went too. The line can be long but it's a great cafe. We love how they support the students by placing their artwork on the walls. As for the food, we enjoyed their everything bagel with cream cheese for breakfast. It was delicious, the bagel tasted fresh and the cream cheese was creamy. They put a lot of everything seasoning which is good because some places skimp on everything seasoning. Glad they make it worth it. We also ordered their Black Bean Burger for lunch. This was a great vegetarian option for a burger. It tasted good with the seasoning on it as well. The bun was soft and the lettuce and tomato were a great fresh combo with the black beans."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eGFQanhBRRAB",
            "text": "Hands down the best coffee anywhere near city college. Also they have amazing sandwiches, definitely a top lunch spot in the neighborhood. The staff are super friendly. This place is a great family owned cafe with tons of regulars. I recommend the hazelnut coffee and the BLT, the best place for a BLT!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoODVXVXd3RRAB",
            "text": "I had a very disappointing bagel on a cold Saturday morning. While I appreciated seeing some vegan cream cheese spreads, their avocado was far from fresh (most of it was brown and mushy) and it almost made me gag. People eating sandwiches seemed pleased, and it was pretty packed in the late morning/ early afternoon, so it might have been an anomaly."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzN3FHYW9BRRAB",
            "text": "Went there for the first time today at 2:00 pm and it was packed!!!! Line out the door. No standing space. But the workers are very good at keeping things moving! Polite and nice. Great food for a decent price. I ordered a black bean burger and tuna spinach wrap. 2 free chips come with it. Total was $12.96."
        },
        {
            "date": "4년 전",
            "language": "ja",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMEtUcGhRRRAB",
            "text": "お手頃価格のカフェ。混んでいますが、テキパキ動いてくれるので、そんなに待ちませんでした。ブラウニー、サンドイッチがおいしかったです。\n\nこのあたりでは珍しく普通にトイレが使えるので、そこもとても助かりました。\n\nドリンクやサンドイッチ、ベーグル、ケーキ類のほか、普通の一般的な飲み物も売ってます。自家製?と思しきオレンジジュースやレモネードなどもありました。\n\n全体的にお値段がお手頃なので使いやすいと思います。"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdmRTVEN3EAE",
            "text": "Tienen una variedad de sándwich y puedes escoger pan y sabores. Delicioso el de huevo con jamón y queso! Además el pan riquísimo! Creo que volveré a probar el de aguacate! Solo el café no me gusto mucho, si estaba rico para acompañar pero no estaba muy caliente!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbGVxWWFREAE",
            "text": "This was my first visit to Café One and it will definitely not be my last. I can around 11 AM on a Saturday morning and it was not too busy, but the traffic started to pick up as I waited on my food.\n\nI ordered an Egg, Cheese, and Bacon sandwich on a 7 Grain Bagel, Grab-n- Go fresh squeezed orange juice, and a Gluten-free Apple Cheddar Scone.\n\nI was able to just pick up my orange juice which was in prepackaged plastic cups with lids. A couple of minutes later, my scone came out warm as requested. About 5 minutes later my sandwich came out. It was warm and cut in half like I like it and it was amazing.\n\nThey have a variety of coffee and healthy options but I didn't get any. I'm sure they were equally amazing.\n\nThis will definitely be one of my stops every time I am in NYC."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZOTllUmVREAE",
            "text": "Excelent service, nice breakfast with a croissant, sausage, eggs and cheese and with all yhe lovely donuts on show, I couldn't resist to get one. Nice WiFi connection also."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocFl6cENREAE",
            "text": "If you need a place to go for a good sandwich this is it. I had to wait a bit, but good things come to those who wait because the food is delicious. I was pleasantly greeted and treated."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzcDV6NS1RRRAB",
            "text": "Soooo good!!!! Everything bagel with bacon egg and cheese. I also got a vanilla latte with almond milk amongst other things for my family. They were friendly, quick, and it’s delicious!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZNExXTERnEAE",
            "text": "Very good coffee and pastries. Huge selection of macarons. Food is always delicious and fresh but take away is best. Seating is supee limited and they are always busy"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMjliRGpnRRAB",
            "text": "Combination of flavors and unique and incomparable colors you have to visit this place. Amazing customer service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtNy1fV193RRAB",
            "text": "Cafe One is gettin’ cheap for $6 sandwich! Guess u only get one slice of ham on the weekends…folded over!🤷🏻‍♂️ Was more like a grilled bread with a hint of ham and cheese sandwich! Ouch!…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMy1PNDh3RRAB",
            "text": "So great! Very Good Sandwiches and bakery. Tasty Coffee! Greatings from Germany"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNneVpyN1lBEAE",
            "text": "Love this place! Always busy but thats only natural. Their beverages and food are great. Best customer service, they go an extra mile my remembering your name."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4dllINjNnRRAB",
            "text": "I really loved the buttery sweet thick Blondie. The turkey club and black bean burger is delicious."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRM28yX093EAE",
            "text": "Lots of food and Cafe options, affordable. WiFi! For $9, I got an avocado BLT, free chips, and a small Cafe Au Lait. I just hope they have recycling for the plastic containers."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxOElxMGdBRRAB",
            "text": "Great spot for a nice and fast breakfast. Good coffee, a vast section of tea, great menu (featuring one of the best Carrot Cakes I have tried in a long time). The staff is very friendly and the service is very efficient! They are still…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURza05MTG5nRRAB",
            "text": "Cafe one offers a great menu variety. Their black bean burgers are so so good. It is a great place to sit down and enjoy a coffee and a bite, of course, when it is not peak hour. During lunch hours the lines can be out the door. I advise…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMktLUlhBEAE",
            "text": "This is one of the best-kept secrets in NYC. I lived behind here for over a year and used to stop by often. I came back here to visit and do some work. The place is always clean, beautiful, and excellent customer service. The people that…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcFlicU13EAE",
            "text": "Good neighborhood café (especially in a sea of neighborhood bodegas) with decent sandwiches and coffee.\n\nThe one zonk against this place is that they are INCREDIBLY slow during peak hours. At minimum, at least 5-7 minutes of waiting in line just to order and then another 10-15+ minutes to receive your order. Definitely don't go here if you're in a hurry / looking for quick service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtazhfa2d3RRAB",
            "text": "I ordered an egg bagel & a oatmilk caramel latte. The bagel was definitely store bought - tough & rubbery. Kudos - They did pile on the egg whites and avocado - hence, the 2 stars.\n\nThe latte is good. It tastes like vanilla was added, but overall acceptable.\n\nIn conclusion, they’re too expensive to be serving cheap rubbery bagels. I can get a fresh, homemade bagel for less."
        },
        {
            "date": "7년 전",
            "language": "ja",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndE5qT1B3EAE",
            "text": "早朝から常に混んでるフレンドリーなカフェ。ちょっとした気遣いがあって会社に出勤前の近所の人達や学生が買いに来る。"
        }
    ],
    "reviews_count": 71
}