{
    "name": "Bird In Hand",
    "place_id": "ChIJrWGPN9D3wokRaw-MMbid2aA",
    "grid": "MN9",
    "address": "3569 Broadway, New York, NY 10031, USA",
    "rating": 4.5,
    "user_ratings_total": 313,
    "phone_number": "(845) 669-7371",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNE5teEpZbTVvU0dWYVEwVlpVa1pYYm5jMlVGRRAB",
            "text": "This place is very relaxing and great for brunch. Their Egg Benedict was cooked perfectly and their home fries which also included sweet potatoes was delicious. They have a very creative cocktail menu and the servers were very attentive as well."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kcU9XdEdOVXA1VTE5WlJYaDRlUzFYUlhsUWNuYxAB",
            "text": "The interior is so cute & it has the comfiest chairs! The food was quite good."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UWJtSmtRazlvVEd4UVdtcElVMjFKYzJOU05FRRAB",
            "text": "No voy a esperar para hacer este review. Celebrar cumpleaños comiendo Creo que es una de las mejores formas de hacerlo para empezar el día antes de asistir al concierto de Havana Social Club, llenar nuestros humildes, estómagos con este festín, creo que vale la pena comenzar el día así.\nBird in Hand es el claro. Ejemplo de primer nivel en Servicio. La recepción por parte de la hostess, fue absolutamente amistosa y de ambiente familiar; un detalle que jamás debe dejar de agradecerse. En lo tocante al servicio culinario, todo fue traído a la mesa, justo en la forma como se solicitó y la entrada del Martini Espresso me ha puesto a tono para continuar el siguiente concierto. Los alimentos están perfectamente equilibrados, ausentes de MSG o al menos no lo pude percibir tanto, y es un digno representante de la cocina sureña de los Estados Unidos. Las porciones son estratosféricamente distintas a las que se acostumbran a comer en otros países, pero eso no nos hizo menguar el intento y hemos dado fin con semejantes proporciones.\nCelebro haber asistido a este lugar, y creo que va a ser uno de mis lugares predilectos en la gran manzana."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eFNrazJPVEIxYlZkMlRqVkVXR3hMYTFoT1gyYxAB",
            "text": "Great place, wonderful attention, good food. Plants and lights make it cozy together with good vibes music"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacFJUVkdVRE5PY1VJelJqbHlWMVIyUVZsVU0zYxAB",
            "text": "I stumbled upon this place with my friend after having no luck finding a nice dinner spot around the area.\nThe atmosphere was a 10/10. Dim lighting, beautiful decor and moody music.\nOur server was very nice and periodically filled our water without having to ask twice.\nDrinks and food were soooo amazing, arguably the best dinner I've had in New York so far."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbFJFVTBObmhXZDBKM1ZIUnFWRTVwTVVwWGNsRRAB",
            "text": "We came upon Bird in Hand by accident and we are so happy we did. The deviled eggs are incredibly delicious and a very creative dish. Try the French Onion soup on a cool night - you will love it. Finally, the cocktails are great and nice selection of NY state wines at reasonable prices."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cnJfZ2xRRRAB",
            "text": "I LOVE this place so much, I even had a birthday party here last year! The food and ambiance are top notch, and the staff friendly."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWmFITlZiblJUT0RGUWFsQm1SeTFEZDBsa05FRRAB",
            "text": "Absolutely delicious food. I nearly fainted the biscuits were so good. Lovely, chill, pretty place with great service and outstanding food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscVdGWXdRVTlaUVc1TVRrWlRaMDh0UzBVeWRVRRAB",
            "text": "My new favorite spot close to home. The charcuterie board was so good, I was pleasantly surprised. Drinks are amazing as well. Love the atmosphere, it’s very chill."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTloxRkRUREkzUjJ0blVEbHVVWGN6T1dselVtYxAB",
            "text": "I really enjoyed this restaurant. I went around 11pm on a Tuesday and the ambiance was low lit and so nice. Perfect date night, wind down vibes. The food was really good as well, i recommend their chicken and waffle plate *chefs kiss*, waiter knew exactly what I was looking for when I described what type of cocktail I wanted. Would definitely go again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVE5sQnlORVJYZEZGTlVqSXdjRmMyZEROWmEyYxAB",
            "text": "I was sitting and there was a roach on the wall"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oa01XRkpWbk5YY1VoWWVIZHZZWFZrWkROM1VuYxAB",
            "text": "Great drinks and food. The one thing I really like about this place is consistency every time I go no matter who's bartender or serving i get the same exact service and quality drinks"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOd1MwVmtiVjk0TldGT1VVZG5UR1JpVVhreWFYYxAB",
            "text": "Stopped by for lunch, food was okay. Enjoyed their version of the old fashioned more. The menu’s were extremely filthy and covered in dried food. Please discard and print new ones."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMFdUSkZWMjV0Y1ZFMU1YbFJPVVowUm1OYWRuYxAB",
            "text": "Great new place in the neighborhood. Awesome atmosphere, good food options for brunch or dinner, creative and tasty cocktails."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQlpIZzVjVkpsV0RsamEydzJWekpITVRCNVZGRRAB",
            "text": "This was my first time going and I enjoyed myself.  The service and the atmosphere was good. The food choices I had and shared with my mother were good. I had the brussel sprout and fish. I tried the carrot cake and that was NOT to my liking  at all.  However everyone has different taste buds and that's why I gave them a four. The music choice was excellent! They played a lot of old school music that I enjoyed. I was singing from the time I walked in and left. I remember the  people sitting next to us left singing and dancing too. Lol\nIt was a nice Sunday brunch environment!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWVVVRTBkRE5tYUVGM1NtVjVlV0ZoZUhKWVNFRRAB",
            "text": "My husband and i have always mentioned coming tot his spot for a while, specially since we live so close to it, and finally we made it, and boy oh boy it did not disappoint, this has become one of our regular spots now, the food is just simply amazing, the staff is great, Maggie was our server the first time and also when we came back, she recognized us and remembered what we had order the first time which i loved.. Listen this place is a must visit, the atmosphere is just amazing and relaxing. YOU WILL NOT REGRE IT"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWVpYQnBRbTVYVms4M1oyVldNbVZmWTNwS1VIYxAB",
            "text": "Food was good, portion for price was great. The small plates like Mac and cheese and brussel sprouts were delicious and good sized. Worked well as a bar and a nice seating along the sides and back area"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeVMzbDFURk5QUjBnNU0ycHNNR2xvWjBGclFWRRAB",
            "text": "Excellent service, great portions equating to fair pricing, and a dog-friendly outdoor patio with a fresh and modern interior."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVVRqTmFRek5WYm00M2RWcExWRlJzVDIxMldIYxAB",
            "text": "Cute but that barn music gotta go …"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUE4wbHhiVUpJTWxsblNGOUROM1ZHWVdKYWJWRRAB",
            "text": "First time, definitely going back. Great food, including ample vegan choices (I'm not vegan but it's nice to have the choices and it's excellent even if you're not). Excellent service, and pleasantly not too loud"
        },
        {
            "date": "수정일: 3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WQ2JYSXRSbkV3UVd4UlVVRnJZWEJtTFY5SloyYxAB",
            "text": "Es un lugar cómodo y acogedor, con una buena cantidad de alimentos frescos y buena comida para disfrutar en familia o con amigos."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKcWVYWlpaR3B1TmpSaFNGaFpWMnRaYkZKTFRXYxAB",
            "text": "Drinks were pricey for the area but overall a good evening."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSFJETkplakp6WDFseGJXSm5MWFJuUWxRMFNsRRAB",
            "text": "Went here for drinks with a friend and I loved the atmosphere inside at the bar! We went around 9pm so it was busy but they were able to squeeze us in since there were only two of us. I think the cocktails were pretty mid given the price point but the bartender was nice and it was just an overall average experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUFl6bHhPSEZRTlV4RlVVaHdVV3hFYXpsTVExRRAB",
            "text": "Noisy beyond at lunchtime. Evenings in the right table and so pleseant. Food is very good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWlZUWkdPV2QwTVVJeVJXWlVhVVJHUTJkb2FYYxAB",
            "text": "We had a four course meal here on a whim and it surpassed expectations. Food was great appetizers, drinks, entrees, and desert. The music playlist/excellent. Ambiance/Excellent. However, Had two waitresses so attention was on point. One waitress was stellar with good vibes and interaction (an uptown style gal) the other waitress was bland almost bad energy, was quippy and gave real “I hope you leave” energy (she had a downtown working uptown type energy). We overlooked her energy and had a ball, but should not have had to. All other staff were excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWVNGaDJMV2h2ZGtkMVJ6aDVNRGg2VFhGaVJVRRAB",
            "text": "Highly recommend their burger. The rest of their food is excellent too. The drinks were reasonably priced and mixed well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMFdWbEJjVlYwZWs5SmVVUmtkMG93VjBSdlRVRRAB",
            "text": "The drinks are amazing the food could be so much better if they would brine and season their chicken before frying it. Its such a simple way to pack a flavor punch. The waffles were good and the fries were tasty. The fried cauliflower needs some help. The mixed salad was huge and was great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paU1pVUTNkVnBSTkU1MGEweEVTV1JOTlRaR05sRRAB",
            "text": "this place is so cute and vibey 🥹 I don't drink alcohol so I can't speak to the drinks here, but the food is yummy and I think the decor is really nice both inside and outside (which is appreciated since people have stopped putting effort into outdoor dining experiences). the service is always wonderful and the wait staff are friendly and kind. they also always suggest mocktails when I mention that I don't drink, which is a nice option for people who want to participate in the aesthetic of drinking but stay sober. it's nice when a place has non-alcoholic options that aren't just soda and tonic!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSb1puSTVjazg1T1Y5MlRUSkVkMVJFWm10RlkyYxAB",
            "text": "Fantastic. Omg the Brussel sprout is out of this world good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKbld2dGZNd29QcGFnEAE",
            "text": "Drinks are sophisticated and on point! The lava cake is criminally good. Thank you to JJ for all his attentiveness and really bringing soho uptown."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKNmhySUhDeTZyOU93EAE",
            "text": "Amazing people!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYUY4LUtfX1kyQWJBEAE",
            "text": "The ambiance was serene here and I enjoyed the food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcklfTEN4b0lTTkNnEAE",
            "text": "Celebrating a graduation in the backroom on Sunday couldn't have happened in a better place!  The ambience was welcoming with a cool vibe.  The staff was genuinely caring and their service was ever present without being obstructive.  But, then there was the food...wow!!!  We enjoyed every offering!  I was thrilled at the buffet/family style since it  let me sample so many of the goodies I had eyed on the menu.  Biscuits, sausages, deviled eggs, lox, crispy bacon, French toast, waffles, compote and jam, scrambled eggs (fluffy and warm!) bagels + spreads and the salad...the salad was exquisite, too.  Wow and an understandable venue choice from my cousin who's made this a favorite neighborhood go to.  So, I think I may be visiting my cousins more often 😉"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMZTYzTC1uOUp5blN3EAE",
            "text": "I ordered the Bird in Hand Benedict, their version of Eggs Benedict with fried chicken and country ham. It costs $20 and I had high hopes. Womp womp. The fried chicken had zero flavor and was dry. The “country ham” looked and tasted like Canadian bacon. Real country ham is cured and salty as hell, there’s no mistaking it for anything else. Beautiful presentation but no substance, like the restaurant itself."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbmpqZFNnd1luQV9RRRAB",
            "text": "Good Food & A Good Atmosphere"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNdml1LUs4NHBfQ3l3RRAB",
            "text": "Ambiance was great. Food wonderful. Signature drinks are not for me to fruity or floral but over all great. The music was A1 and this was a Monday."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMkQ0LUg0eTZUeUhREAE",
            "text": "Great brunch, celebrating a soon yo be mom!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN2N5S0VnEAE",
            "text": "The good around us looked great.  Our vegan dishes were HORRIBLE! The vegan chicken and waffles had the worst tasting and looking \"chicken\" and this day and age, vegan chicken isn't hard to make or prepare. The tofu scramble was even worse. I should have known by the brightness of the yellow that it had too much turmeric. It was awful!!! Complete waste of money. And no one ever came to refill our water."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvajVmRXR3RRAB",
            "text": "I mean this is my first time. They ran out of that we wanted. We ordered all sides and still waited an extremely long time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJajc2bHN3RRAB",
            "text": "Food was great"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOE9hTDZBRRAB",
            "text": "This place is grrrrrreat (Tony the Tiger voice).\nSeriously, service is friendly, food is delicious, never a bad vibe. Our server noticed us eyeing another table’s appetizers (the deviled eggs)  and told us they’d comp them if we ordered them and didn’t like them. Ordered them, loved them, will order ago. Go here for brunch\n\n5/8 edit: Editing this just to add I went for dinner recently and the carrot cake was literally the best I’ve had in my LIFE. Bird in hand, ride or die. Don’t let the tourists find out about this place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJajVmNGN3EAE",
            "text": "Bar tenders were very friendly drinks were very good this post is for the kitchen I don't understand the meaning of taking a blow torch to a ceasar salad to make it fancy and charing the lettuce it tasted like burning house and smelled funny the fried pickles were to soggy over all I would drink there again but skip dinner"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMDhpSVpBEAE",
            "text": "Delicious food, great service. One of the best veggie burgers I've ever eaten. And let's not forget the fried pickles!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOGVQNFpBEAE",
            "text": "A gem in Harlem. Food is delicious. The atmosphere is welcoming and alive. The staff is friendly and funny. You won't be disappointed. And like me, after the 1st visit I was hooked."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRelpMMjZRRRAB",
            "text": "This restaurant is a Gem in Washington Heights! Love the atmosphere, the food is insane and the service is amazing. I've gone twice just for the chocolate molted lava cake, best dessert I've ever had in NYC! and I'm a true chocoholic snob. Loved the juicy tender fry chicken and the steak and fritts 🤤😋 a 10 out of 10! Definitely worth a visit."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRX3RPa2x3RRAB",
            "text": "This is my new Brunch spot forever! Family friendly and great brunch options. Staff was super friendly and the food was amazing. 😻"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnck1HV0xREAE",
            "text": "Great food, great drinks, great atmosphere. One of Harlem’s finest!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncmJMQy1RRRAB",
            "text": "Great evening hang out. Love the buzz"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNna1pxTU13EAE",
            "text": "Best money ever spent. Drinks are crafted to perfection."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNy16SUJBEAE",
            "text": "Bird in Hand is an absolute gem! From the moment you walk in, you’re greeted with a warm and inviting atmosphere that makes you feel right at home. The attention to detail in everything—from the beautifully curated menu to the impeccable service—is truly outstanding 🩷\n\nThe staff is friendly, knowledgeable, and genuinely passionate about what they do. They make excellent recommendations and ensure that every guest feels taken care of.\n\nWhether you’re a local or just visiting, Bird in Hand is a must-visit. It’s the kind of place you want to return to again and again. Highly recommend!\n\nMatt is a sweetheart! ❤️❤️❤️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOWFiOURnEAE",
            "text": "Came here for lunch with my dad. I grew up in the neighborhood and it was close to his apartment. Excellent service. Great vibe. Delicious cocktails. Cocktails were between $16 and $18. But I have to say they were very well balanced in flavor and strong. I ordered the Churchill Old Fashioned and the Aggressive and Aggressive. If you like a good whiskey cocktail these are for you. Ordered the burger medium well. That was $18. It was banging and very filling. Our waiters kept refilling our water and were very attentive to everything else. After two rounds of cocktail our total came out to $135 before tip. Not mad about it. Great quality. Excited to go back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdmF2UGdBRRAB",
            "text": "We were absolutely shocked with how excellent of a time we had tonight at Bird in Hand.  Our waitress Jess was positive, welcoming, and incredibly helpful navigating the menu. We were taken care of by Maggie at the bar who made our drinks custom and with great attention to detail.  The vegan options on the menu were filling and delicious.  The whole staff was relaxed and joyful, which is exactly what you want to see after a long day at work.  We felt honestly at home.  Bravo to the whole staff! We will certainly be back regularly."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMWFPWmhRRRAB",
            "text": "I wanted to enjoy this place more, but between the service and the quality of the cocktails and food, there are so many better places in the neighbourhood, and this is among the most expensive. The deviled eggs seemed overcooked and rubbery, an odd texture. The cocktails were very average - the tough as nails was very basic, not very tasty. The buzzed aldrin was better but still lacking. A place we likely wouldn’t come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbEltU2hnRRAB",
            "text": "It's such a cute little place for the food to be so bad. It's clear they cater to the gentrification population. The it's giving drink was great but I'll pass on the rest of the food. The Asian wings weren't bad but they were too sweet for my taste. The wings were fried well though.  I asked for the steak medium well and it was well done and so salty it was inedible the fries were decent but I had to ask for new ones bc the first batch was cold. It's hard to mess up a waffles but they tried until they succeeded. The giant chicken was flavorless but fried well."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcFktTFlnEAE",
            "text": "Very cute restaurant! Well\nDecorated, and the ambiance in the evening was comforting and moody.  The service waa great - I sat at the bar and the bartender was friendly, attentive, and engaging. The food was cooked well; the textures were good but the seasoning was lacking. This isn’t soul food; it’s southern style cooking."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfemNpY2NREAE",
            "text": "This is a beautiful chill cozy bar. Music, cocktails and vibe were amazing! Recommend to drop in for a drink. Bartenders were super attentive and nice. It is truly a gem in Harlem. 10/10!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCNS03MDN3RRAB",
            "text": "Came here for a dinner with a group. We had a reservation and were only limited to the late-night menu. The fried chicken BLT sandwich was good and the wings tasted like regular wings. The hostess was super nice and the drinks were good. Is…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdllqV1lREAE",
            "text": "My wife & I came here last night for the first time. The food was excellent, especially the deviled eggs. It's a very nice atmosphere & the service was great as well. We will definitely return for dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodHRxXzJnRRAB",
            "text": "Great cozy bar that’s beautifully decorated and gives off good vibes. The cocktails are really good and are well priced. Great for dates or grabbing fancy drinks with close friends. I will definitely be back again!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUd2VtMkNBEAE",
            "text": "This place is absolutely everything I want in a bar. The vibe is great - fun decor, TV's but not sports bar-y, great music, pool table, etc. Drinks were fantastic - both cocktails and beer selection. Service is solid, staff know what they're talking about. But the food is the real star. They truly nailed some vegan dishes to a point that makes me angry at other restaurants for not taking so much care with their options for dietary restrictions. Vegan Caesar was insane. Fried maitake \"chicken\" and collard greens almost made me cry it was so good.\nI'll be back. Obviously."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeGNuaUVREAE",
            "text": "Amazing food. Great atmosphere. You would never know this used to be a pharmacy. Amazing drink and beer selection, eventually 12 local taps. Date spot for sure, no TVs. Great owners. Lounge area with two couches, one big table for a 8 top…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMDdmNURBEAE",
            "text": "Bird in hand was amazing. Service was top tier. The waitress Maggie was very attentive and perfect. A great space and cute patio."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSekxmbHZRRRAB",
            "text": "Food was delicious! Attentive bartender! The bao bun could be better though. It wasn't soft at all, maybe it was a one off. But I love the Brussel sprouts! The souffle was pretty amazing! I think it's the best I've ever had (I don't order much desserts)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldl9DcjVnRRAB",
            "text": "Great addition to the Sugar Hill hood, the Cheff created a Fall menu that is really worth it. Great bar and atmosphere, ideal for getting together with friends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NXEtUG9BRRAB",
            "text": "Lovely beautiful bar with great staff. Delicious southern-inspired comfort food. Laid back atmosphere and delicious cocktails. Awesome addition to the neighborhood and a cute place to stop by for a date or a hangout with friends. I unfortunately ate all my food before taking photos :-/"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MzZfV0VREAE",
            "text": "Amazing food, delicious cocktails, friendly staff and comfortable vibes. I've been visiting for dinner almost weekly. The staples on the menu and seasonal dishes are all incredible. No reservations needed, it feels like visiting a friend's house to hang out and relax from the day."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbXRlMUx3EAE",
            "text": "Went for brunch and absolutely loved this place! The food was delicious, the staff was kind, and the vibe was so chill! I can’t wait to come back and also hopefully at night! They have a pool table and I think live music to come! Highly recommend!\n\nMy friend got the avocado toast and I got the Benedict (both tasted so great)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdlo3a2V3EAE",
            "text": "Had late Sunday brunch; we came in last hour of brunch and was seated right away. The menu had lots of variety, so it was hard to choose. Everything was delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbXJYNFpnEAE",
            "text": "I've been curious about this spot opening up and had the chance to check it out during their soft launch opening. The space is super cute with lots of natural lighting. They have excellent deals on classic cocktails, wine, and beer for…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdHBybHFBRRAB",
            "text": "This place plays great music, so great that the music called me in from outside. It’s fun, great vibe and the food is great! Staff is on on point. I highly recommend this place!!"
        }
    ],
    "reviews_count": 70
}