{
    "name": "Oso",
    "place_id": "ChIJuYwVAmX2wokRTnBiQLDD6us",
    "grid": "MN9",
    "address": "1618 Amsterdam Ave, New York, NY 10031, USA",
    "rating": 4.5,
    "user_ratings_total": 816,
    "phone_number": "(646) 858-3139",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQ1FUQXRXazFGUzJScVRqVlNjbFJLWm5OUWVuYxAB",
            "text": "César’s service was simply spectacular — out of this world. 🙌\nThe drinks he made for us, the food — everything was incredible. Very talkative, friendly, and with a super cool vibe — he truly made the whole experience even better.\nHe prepared a spicy mezcalita and a michelada that, honestly, not even in Mexico had I ever had ones that good! 🔥🍹\nI 100% recommend César and his amazing service. Without a doubt, an experience worth repeating many, many times."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSFgxVm9jbFZqTmtOSVJFTm9UMGhQYXpWT2RVRRAB",
            "text": "Was there to celebrate a milestone birthday,everything was so great(didn't want to ruin the vibe with revealing the water leaking from above the table)but it's a favorite so hopefully it's resolved EVERYONE should try it for sure."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcW9fSXVRRRAB",
            "text": "Nice decoration. Good quesadillas with pollo.\nFriendly servers.\nHorchata ice cream is the best thing, also the churros."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMmJWTXdkMkZJVFhSaWREQlVZMHRFY21KMVEzYxAB",
            "text": "Food was very good! We arrived and staff was very warm and welcoming! The food and drinks were good, the churros were amazing! I would only deduct a start rating due to pricing…I think for what it is the prices a bit higher than what I would pay. Otherwise good place to eat."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneU4zUXdablZmVlRkTFRXZFdSRkoyZGt0U2QwRRAB",
            "text": "Super juice Cochinita Pibil (braised pork) with a margarita to die for"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kdk5URnNMVXhIUVdwRVpHcElibU5RZW1seFJFRRAB",
            "text": "Lovely Mexican food. Well worth a visit if you are visiting New York. The tacos were flavoursome and well-seasoned. Wonderful environment."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkalpFeGtTR2RRU0ZKNWVuZFRSRXR5ZUV0Sk1YYxAB",
            "text": "I’m currently eating my insanely delicious hot churros with chocolate sauce as I write this review, because I can’t wait until I get home to write it. This has been one of my best, most comfortable, and most enjoyable dining experiences. From the cocktails, to the food, and most especially to the service, I can’t believe I haven’t visited this place before. Shout out to the man who attended me, Alexander. He did his big one! He was kind, attentive, and made me feel so much better after I was stood up! He was wonderful and I’m asking for him when I go back.\n\nI started off with the chips and guac which was basic but good. No notes. I got the al pastor tacos and they were delicious. The pineapple worked so well with it, rather than against it. And my cocktails… How they can take the margarita that we all know and love and add to it and even make it better is beyond me. I got the taco truck (mezcal and hibiscus) and the coconut margarita (argue with the best cocktail in the world) and they were both 10/10. I had a great experience at Oso, and I’ll be back!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkd1NWTTJUbXRXYkVKTlZFNUtSa1JXYVVWSGEyYxAB",
            "text": "Après un excellent concert Gospel nous nous sommes posés à 6 dans ce super resto accueillant et chaleureux tout au long du service. Mention spéciale à la serveuse  ❤️. Les plats mexicains sont délicieux!  À ne pas rater lors de votre visite de Harlem 🙏"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205U2FuQjZWbGhvYmpoNVRYUlRXVmsxVkdGaFoyYxAB",
            "text": "Restaurant is a Bib Gourmand location, reasonable price for outstanding food. There is a Dia de los Muertos theme, but the decoration is simple and the restaurant is clean. “Oso” means “Bear” in Spanish, which patrons were constantly inquiring after.\n\nIt wasn’t busy when we visited, the service and the food were outstanding. We had a mix of tacos and fish dishes, to include ceviche and a tuna tostada. Just off the north end of the CUNY campus. Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKb09GUXhNMlZGVjJvdE9EZHVUMEZDTlhOUGRsRRAB",
            "text": "Best tacos in Manhattan as certified by a real Mexican."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSmVrdGpjakF4Ymt0R05uQTVhbDh5V0VScGVrRRAB",
            "text": "This place is hilariously expensive and the food is not good enough to justify it.\n\nTo put it into perspective, you’ll pay $16 for two shrimp tacos that have 3 shrimp cut in half across the two of them. You’re mostly paying for sides and a tortilla.\n\nMost Mexican spots in NYC are about $4-5 a taco.\n\nDrinks were alright though."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQ1JERkVhbXhrYWpBelJWUnBhMHgzZG1KaFptYxAB",
            "text": "What a gem! The food was great and just felt effortless. Don’t overlook the sopas - we tried the pozole and it was great, felt like a warm hug. We inhaled the chips and the tacos are just great. Leave some space for the churros!Will definitely come back to try the other dishes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM2JIRXhZbUpSZG5Gck1VMU9SamhJVEZaT1ZtYxAB",
            "text": "Places in Midtown wish they were this tasty. They truly blew our minds, from the Sauvignon Blanc to the simplicity and tastefulness of the elote. Taco de Cochinita is as good as your grandma is she were a chef. Loved it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVWVHUnFTRkZMWlZWTFdFUk9VbVZpZFVaRlluYxAB",
            "text": "I love everything about this restaurant. The food is delicious. You must try their birria."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV01WUkhhVFZQVmw5QlgwOVhkV3hHU1djd1owRRAB",
            "text": "Yummy dishes and nice portion sizes for sharing (if you're into that sort of thing)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMVIyaHVaRmsyYTJJdFEzSTVNbEl3WjJVNFdYYxAB",
            "text": "What a neighborhood gem! This place has beautiful interior and outdoor seating. Drinks were tasty and delicious - I had the refreshing rose sangria. Our wonderful waitress tipped me off to an off-menu vegan meal that was so flavorful without being over-seasoned. I was blown away - it was so good. My friends were meat-eaters and loved their food too. Roasted cauliflower and jalapeños were an unexpected combo that was so good. Very underrated establishment."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcVRtOUtZbXBSU1dwQ0xYQkxabDlVVVhoRVgzYxAB",
            "text": "Les recomiendo este lugar para comer pulpo enchiladas de mole y ceviche están súper deliciosas"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcGEydzJXbWs1ZFRGbU9IWTVRVXM1TjBOb1pYYxAB",
            "text": "Service was attentive and pleasant. Vegetarian options were limited but great tasting. Bar service was great. Atmosphere is dope. Kind of like small and intimate. I would go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMVZGVXhWM0pXWW5kUlkwbHhkVlk0VWxSaVdFRRAB",
            "text": "Fantastic meal, fantastic service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TmRXWkdVR1ZsZDBGSWEwWTVZMU4zVVRZekxYYxAB",
            "text": "I’m Mexican and I can truly say they have the best vegetarian pozole I’ve ever tasted!!! Way better than the original recipe! SHOCKING I KNOW! I was surprised myself but it’s the absolute best! 🥰🥰"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aE9GVlZRMUoyUkV4a2RVUkpkVnBIWVZFek5WRRAB",
            "text": "One of the best steak tacos I’ve had in a long time. authentic, savory, tender and homemade! 2 for 1 on happy hour too!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkM01WSkNjMFJpZWxoVU9YazVja3BTVVVGV1YxRRAB",
            "text": "One of the top tasty Harlem restaurant\nGreat service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RdFJURXlkVU5KVEhCd00ybFhOMUp0Tldkek1sRRAB",
            "text": "Amazing place!! Amazing time!! The service is impeccable, fast, courteous! Especially if you get Alexander he will make your night worth it!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNWJtRm1ibUp6UlVWeVZTMVVSVFJRTFUxWFkwRRAB",
            "text": "We have been going to Oso for many years. Relaxed atmosphere, excellent margaritas, delicious tacos! The service is friendly, as are the customers. Sit outside, inside, at the bar - just go there and have a good meal and a good time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRVUwdFRaamxyU0RBNVZqaHhVRkIyTTBSRFgxRRAB",
            "text": "Shrimp Quesadillas are on point. Service is amazing."
        },
        {
            "date": "4달 전",
            "language": "it",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SGIxRXdNbmhGVmt4WVdtZDVlSGhXVlZreU9XYxAB",
            "text": "Locale accogliente con personale molto gentile e ospitale. Cibo buono, nella normalità"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeU4wcHVVRVZOUWxCYVgyaHFRMXBwYURGVGEyYxAB",
            "text": "Brenda made amazing cocktails and provided amazing service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFelNqbERkMnhqTm5aaWFsazFabnBMY0hSdk0yYxAB",
            "text": "wow I’m impressed. This was so good. I recommended to come here for some good Mexican food 10/10. It’s a good vibe, good food, good music."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMU0ZrT0dMcjkzSnNnRRAB",
            "text": "I can't love this place enough -- especially this dish: a whole dorada, deep fried and swimming in what can only be described as a righteous garlic sauce. Just ridiculously good.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNRFl2N0tQZ3U2VE13EAE",
            "text": "A cute restaurant in Harlem. The service was attentive and friendly.\n\nWe ordered the ceviche, tamales, Al pastor tacos, birria burrito and churros. Our favorite dish was the ceviche. It had impactful flavor and tasted really fresh.\n\nThe tamale wasn’t warm and when we ate it the cheese was a firm block in the middle. I found the al pastor tacos and  the birria burrito meat to be too tough. It wasn’t very tender."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPTElqdTdiOGV6Tjh3RRAB",
            "text": "My colleagues and I were looking for a lunch spot, and one of them lives nearby and recommended this place.\n\nAs soon as we walked in, I loved the vibe cozy and chill, exactly the kind of spot I enjoy. The food was great and affordable, but the best part? They have a happy hour with Buy 1 Get 1 Free cocktails! When you break it down, it’s about $8 per drink, which is an awesome deal and they’re delicious too.\n\nThe waitress was super attentive and had a great sense of humor,  she definitely made the experience even better!\n\nHighly recommend, and I’ll definitely come back next time I’m in uptown!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJUHZvWnU4OXNIUk9nEAE",
            "text": "The best! We’ve been coming to Oso for almost two years now and the staff have consistently gone above and beyond for our family. The food is fantastic! Drinks are amazing! We also hosted our daughter’s 1st birthday here and it could not have been a better experience! Go, you won’t regret it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMNjFwLWl2aDRldkZ3EAE",
            "text": "Delicious food with very friendly staff"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPX183SkxBN1llblBBEAE",
            "text": "Great service, loved the 2 for 1 happy hour deal. Fish tacos 10/10, however gauc portion is small compared to the amount of chips you receive. Overall great spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPck1rb1dteE56ZE9nEAE",
            "text": "Nice little gem in the Harlem side of Manhattan with a nice ambiance with music and a delicious and authentic Mexican menu."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJVFlpcFNaNXM3U3F3RRAB",
            "text": "Really great restaurant with authentic Mexican dishes and one of the best spicy margs I’ve had. Also enjoyed the overall ambience of the restaurant.Look forward to coming back to try the rest of the menu, especially the chilaquiles and birria tacos!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMS0zQW53RRAB",
            "text": "Brenda was amazing! The drinks were 10/10. I’ll definitely be returning."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbmJXUThnRRAB",
            "text": "Found this spot on the Michelin Bib Gourmand list when looking for a brunch spot while in the area. They have delish tacos (we went with their birria, chicken and braise pork, all of which were great), great attentive service, and a charming atmosphere. We appreciated the tortillas pressed fresh on the spot, and also enjoyed the chips and guacamole (cleaned the bowl easily), tasty elote, along with perfect Palomas. Def recommend this spot for brunch (boasting tons of mimosa options) and any meal that you find yourself near this great neighborhood spot. Cap off the meal with their tender churros served with choc and caramel sauces. 👌"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaW9PQ3lRRRAB",
            "text": "The ambiance is really nice. Nicely decorated and well lit. Allowed the nice spring breeze to flow through. The service was good. Staff was attentive. The food that was ordered wasn't the best in our opinion. We tried the guacamole, tostada, tacos de pescado, and the camarin tacos. Everything was very underwhelming. More authentic seasonings would be really great additions."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvek56MlFBEAE",
            "text": "We had such a great experience at Oso! The food was absolutely delicious — fresh, flavorful, and beautifully presented.\n\nWhat really made our visit special, though, was the service. Brenda was our server and she was amazing from start to finish — super friendly, attentive, and made sure we had everything we needed. She made us feel totally taken care of.\n\nHighly recommend Oso if you’re looking for great Mexican food and even better service. We’ll definitely be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcU5tRk9BEAE",
            "text": "Really fantastic Mexican food in the 130s in Harlem! The mole is great!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNWRlcGlnRRAB",
            "text": "Great spot, had incredible chilaquiles and delicious churros. The staff were so kind, shout out to Luis and Brenda."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJM3VEOHN3RRAB",
            "text": "Good Mexican food - leaning toward refined tasting over purely authentic."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJXzhhYzVRRRAB",
            "text": "Great spot, amazing service, excellent food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJM2J5ZjRBRRAB",
            "text": "Meh....my Loved One {wife}wanted to come to this place for the longest time. Since she is pursuing her master's right across the street at City College. Nothing special...service was okay BUT 63 plus dollars for nachos and molle was excessive. Plus 2 whack pilsners and red wine. Nope not going back any time soon...cheers."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMGNhTGR3EAE",
            "text": "The service is very friendly and quick. The food is tasty and fresh. The flavors are very authentic. Drinks are good too and they have happy hour on weekdays 2×1 from 2 to 6. The atmosphere is cozy and clean with Spanish music playing on the background."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdW9tNjd3RRAB",
            "text": "The food was great and the cocktail menu is fantastic. A superb in house margarita but also some great original cocktails. It's the mark of a good bar when the cocktail menu is adventurous rather than running the usual basic plays and this adventure is worth taking.\n\nSlight ding on the service score because it felt like they were rushing us out even though we had a reservation and there were multiple empty tables. We still stayed for and through desert and the churros are not to be missed (even if the staff asks if you want the check rather than offering dessert)."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeVBuMVRBEAE",
            "text": "Brenda and the team were fantastic! The happy hour is a really good deal and the food was spectacular."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaU1lQ2pBRRAB",
            "text": "Great food and atmosphere! Brenda is killing it with amazing service. Great spot in the neighborhood!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cjRpOW9RRRAB",
            "text": "If I could give 0 stars I would. One of the male waiters kept bumping into me tonight and would not stop even after I asked him to. One of the people with me graciously switched chairs with me and when the waiter noticed, he stood behind me and yelled \"thank you\" in my ear. We left soon after and went out for drinks at the wine place next door. I did not enjoy any part of Oso and will never set foot there again. Go to Chipotle, at least the waiters aren't rude there."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbGJtMkR3EAE",
            "text": "My husband and I googled authentic Mexican food for our scheduled day date. We found Oso and I must say I am happy that we chose this restaurant. AMAZINGGGG!!!!... The food is beyond authentic, the flavor is out of this world, and the customer service was exceptional. The drinks we had were so good. I had the Birria tacos and the Tuna Tortilla, My husband had the Tinga Quesadilla, and it was delicious. The price was very affordable, especially for two people. I normally don't do reviews, but this restaurant deserves to be recognized. I will definitely be back to Oso."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyOWZxOGRREAE",
            "text": "Oso offers a creative spin on Mexican classics that I thoroughly enjoyed. The watermelon salad struck a perfect balance of savory, fresh, and slightly sweet flavors. The birria tacos, while not traditional, were still delicious, and the consommé was so good I ended up drinking it by itself. And don't skip desserts – the churros were soooo good and the portion was generous. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdV9hazNBRRAB",
            "text": "The food is decent, but the happy hour policy is confusing and your server will happily scam you if you’re not careful.\n\nWe were told that you have to order two of the same drink in order to get 50% off both. We did this for two rounds, and were ultimately charged for 4 full-priced drinks because we “weren’t supposed to change our drink order.” Even the first round, which was placed before 6pm, was charged full price. When asked to clarify the policy, our server Ariana was very condescending and did not offer to help.\n\nThe guac is nice but absolutely not worth $14. Birria tacos were flavorful and bigger than I expected, albeit the $14 price is still steep. The mole sauce on my enchiladas was flavorful but a bit watery and there was an unpleasant bitterness to the lettuce garnish or something else in the enchilada.\n\nThe food made us want to go back and try more, but we will not be returning because of the strange happy hour policy and unhelpful staff. I have been to many happy hours all over the city and have never seen such a policy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweG91eEFnEAE",
            "text": "Love it! Very nice ambience, great food, big portions, and very very affordable. We ordered tamales, and tuna ceviche as appetizers. For mains - we ordered burrito, and quesadillas. Portions were so filling that we took half of the order to go. All with tips was about $66 for two people! (Which clearly was for more than two people as we took a lot to go). Plenty of seats -indoors, outdoors, and at the kitchen. At night, the restaurant is dimly, romantically lit, making it a perfect spot for a date."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURFLXRyWjNRRRAB",
            "text": "Came here for happy hour time. Most of drink were half price till 7 pm. We loved it.\n\nThe waiter was very friendly and attentive.\n\nFood were also good. They refill the chips frequently enough. But one of tacos was cold...\nI liked the fish taco most. Guacamole was great too.\n\nWill come back for different tacos."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaUlDN2ZBEAE",
            "text": "Food was overpriced for the quality.\nOnly a good dish was butternut squash salad.\nCorns, limes, chicken in enchilada were not fresh at all, so dried & smelly. I think they used ingredients that were supposed to discard.\nLimes were hard to squeeze since it’s too dried. Corns were not juicy at all. I felt like I had leftover food.\nI was expecting to churro since it had many of good reviews . However somehow churros had onion smell. After one bite, I couldn't eat due to smell of onion. I assumed they cooked with the same oil that they fried onion or something like that.\nfish& shrimp & pork tacos , enchiladas were not tasty. So I needed hot sauce to made food better .\nThey charged for small portion of hot sauce.\nThis was one of the terrible meals I’ve had."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMk12NkNREAE",
            "text": "The interior is absolutely stunning. I wish I could say the same about its menu options which is limiting. Ordered the birria tacos with consomé. The consomé came in a tiny cup size with large pieces of onions (view photo). What an absolute insult to the the traditional Mexican dish.\n\nThe drinks were pretty good but extremely pricey. The meal itself was extremely expensive. I can get 3 Birria tacos and an order of consomé in Queens for better quality and a better price point.\n\nThe service was decent. The decor was tasteful and the bathroom was clean at the time of visit. I’m not sure if I’ll recommend having a meal here but having a drink before your night start is recommended.\n\nI hope they improve their food quality and lower their prices a bit to make it more affordable for the amount of food that is served."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2eWV6UHlRRRAB",
            "text": "We had a lovely experience here. The food was pretty good but not excellent. The shrimp ceviche was very fresh and lime flavored. We really liked the birria tacos with the consume but the cauliflower tacos were ok. My pozole verde had a…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbTRId2lBRRAB",
            "text": "This restaurant is phenomenal. The food is fantastic! So much so that we came on Cinco de Mayo and waited for a table just to get in. They do have 2 for 1 specials on drinks, but otherwise no other deals or happy hour specials. The seating is well spaced considering the restaurant is smaller. Being able to see into the kitchen as they make the food makes it that much tastier. I really feel connected when I can see them fresh pressing the tortillas 😋 It's very cool. I will say, the fish taco was my least favorite of the foods we ate. I felt like the actual fish got lost under the delicious sauce and well seasoned breading. It was overall tasty, but I wasn't getting much fish flavor with all the other stuff going on. Regardless, EVERYTHING we ate was BOMB and we will be back!\nAte: guacamole, pulpo, tacos- fish, birria, al pastor"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlenBqcURBEAE",
            "text": "I’m going to make this simple, “Yes”\n\nAnything and everything on the menu you choose is going to be great; savory and tasty and ‘may I please have some more’. The taco truck lived up to the hype but I also tried “Oh she spicy” because I like a bit of spice in my life. Tamales were great, esp with the salsa verde. My taste buds loved the quesadilla birria. Brussel Sprout Tacos were on point. I was grateful for that as well as other the non-carnivore options. Desserts shined: churros too good to last through writing a review. Horchata ice cream (what?!?). Yes, it was delicious. Tres leche …what’s not to love?"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnZ29LUVR3EAE",
            "text": "This is not just another Mexican restaurant! This place is truly fantastic! Delicious food, so fresh, flavorful, and authentic! The guacamole is so good, and the tacos are sensational. Wonderful service, great vibe/ambiance. The cocktails…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNDVyVXRnRRAB",
            "text": "The Classic and Spicy Margarita were the best my partner and I have had in the entirety of Harlem. We shared the birria and carnitas tacos, 10/10 for sure. Amazing Service by our waiter, Camilo, especially when learning about their everyday Happy Hour, we took advantage and ordered more drinks🥰🥰 Right across from City College so extremely convenient for students and their friends. Highly Recommend!!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdnFQRGd3RRAB",
            "text": "Update 2022: Best tacos in town!! I love the handmade tortillas. Birria tacos are spectacular.\n\nGreat new Mexican restaurant in the area. A Mexican from Mexico city who is always trying to find best tacos in town (so me) recommends ;) Tacos were delicious!! I did not ask but it looks like the tortillas were handmade. Carnitas were excellent, perfect cooking and flavor. The taco al pastor did not dissapoint either. Guacamole was also very good. They could bring a little bit more salsa, but I know I eat more salsa than regular people  lol The curros were not like regular churros, these were fluffy and soft. I really loved them! Even though they were already cold :(  They can improve service speed. It was slow, very slow :( maybe because it was Sunday evening? I saw my churros ready to be delivered to my table for 10 minutes. But definetly I will come back and maybe I will sit at the bar instead"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKX3FpbVZREAE",
            "text": "I’m in the top 10% of Mexican restaurant reviewers and I can say with certainty that this is the best elevated Mexican restaurant in New York.\n\n#1: their tortillas were incredible.\n\n#2: they have a trombone for authentic al pastor.\n\n#3: they’re spin on churros, which were more like a crueler donut, were out of this world.\n\nCeviche was good as were the tacos and chips. It was an absolute treat and a shock that I could walk into this place. I hope they don’t move downtown!\n\nSorry about this pictures - I was so hungry!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxa2N2bUpBEAE",
            "text": "The Spicy Classic was the best spicy marg I've had in the city. Everything we ordered was fantastic, including tacos, elote, and the octopus. The churros were also fresh and to die for. Will 100% be coming back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJdzd6NnVRRRAB",
            "text": "Overall, my first visit was well worth the $25 for 3 loaded tacos and a bowl of pozole. The flavors were rich and the chips are salsa were free 99;-) The waiting staff was attentive and swift. Authentic Mexican food for sure. Go get your tacos on, NYC style!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLeHZmcGhBRRAB",
            "text": "I really wanted to like this place and give it a good review, but unfortunately it is only 2 stars. Food is waaaay overpriced for the quality. 21$ enchiladas were way too salty and tasteless. You can get better enchiladas from any food…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLWJxRTJRRRAB",
            "text": "Love the music and the open kitchen layout. The food portions were huge and everything was delicious including the cocktails.\nWill be going back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNveEptc1RnEAE",
            "text": "Wonderful, delicious Mexican inspired spot! One of my favorite places we have visited this trip to NYC. Very nice food and good cocktails as well. The whole atmosphere when you walk in is light and beautiful, really adding to the experience.\n\nHighlights for me: pescado taco, elote, chips and guacamole.\n\nAll of the food was good, but to elevate just a bit more, I’d change a few small things. The pozole was good, but a bit too spicy to eat. It would be very nice complemented with a tortilla or type of bread, still staying true to Mexican cuisine. Also, the two meat tacos - I would’ve preferred just a bit less meat and more condiments to compliment the tastes.\n\nExcellent service, which is always appreciated. The server we had clearly loved the restaurant and was able to genuinely give recommendations and information about the menu. Always a plus.\n\nPricing: to me, pretty reasonable, especially for NYC. You can get plenty of food for $10-15 if that’s what you want to shoot for. 3 tacos is $12.\n\nWill definitely return and recommend this restaurant to others! Thanks Oso!\n\n#oso #mexican #tacos #elote #pozolerojo #pescado #barbacoa #lengua #newyork #ny #nyc"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncDlycElBEAE",
            "text": "Ordered the Birria tacos and classic marg this duo was amazing! Definitely suggest getting the birria tacos. The atmosphere is super cute as well perfect for a dinner with your friends or boyfriend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aTVfMUNREAE",
            "text": "Always have such a good experience when I dine here. The food is incredible. Drinks are tasty and fun. The staff is always so welcoming and lovely. Definitely recommend for a date night or a night out with friends! Oh and the churros are out of this world!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSc0x6cHBRRRAB",
            "text": "The atmosphere was nice and the tacos were good. The food felt overpriced. Definitely more than is listed in Google. Given we went with children, we were conscious of the cost when choosing a restaurant for dinner. The wait staff gave us a nice bogo happy hour special which was appreciated bc the drinks were delicious 😋. The guacamole was good but the serving side was on the small side. Overall, it wasn't a bad meal but wouldn't go out of our way to return."
        }
    ],
    "reviews_count": 72
}