{
    "name": "Home Sweet Harlem",
    "place_id": "ChIJW0dkXW_2wokREkQsYUnyosM",
    "grid": "MN9",
    "address": "1528 Amsterdam Ave, New York, NY 10031, USA",
    "rating": 4.2,
    "user_ratings_total": 568,
    "phone_number": "(212) 926-9616",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbVNWUnlVWGhHZW10WWIzRk9la3hIT0ZjeVlrRRAB",
            "text": "their hospatality was great the owner was very kind treated me and my family with lots  respect. she was very accomadating, making sure our expirence was overall great. she had a excekllent attention to detail and was very caring overall."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeExVVnlUR3BqZWsxbGVucHVVRWRhT1V0Q05HYxAB",
            "text": "Me and my husband hosted our wedding reception at home Sweet Harlem. We love that we got the warm feeling of home and love when we walked into the space. Plus the aesthetic in that space is so nostalgic, black and powerful. It was very…"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNlJ6UnVjWEYyVld0VGFDMWlaekpxWjNCUWEyYxAB",
            "text": "Home Sweet Harlem is a wonderful place for gatherings. Last Friday, we used this hidden gem space for a wedding reception. The owner, Donna, and her staff were very helpful and kind. The space fit the theme of the wedding reception. The…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eGJXZ3dUMHBHTmxWMWNWRm9kVGxYYjBaV09GRRAB",
            "text": "I just love it here at Home Sweet Harlem (HSH). My mom loved the food too. She was 89 when she passed this year. The owner Donna was so gracious and allowed us to have the repass at HSH. It was such a warm and familiar space and I know my…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMGVVaE9aazAxVUZCbmMzTnlkRE42TFdwNlRVRRAB",
            "text": "They were out of Nutella and ran out to get me some excellent service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM1MyNUlYMDFpTTBWbGNVZ3hTVzF0T1hZMFJsRRAB",
            "text": "I found myself thinking about this food days later. This restaurant creates dishes with notable refinement. The staff maintains reliable customer care. Though compact, Home Sweet Harlem provides a clean and cozy experience. This spot is worth the visit - I'm glad I discovered it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaWJEVkRhM1pxUTJKbExYZERRbDgzTTI1S2NHYxAB",
            "text": "Very nice staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFemRsZHRTVTFsTUhOU1MydHpTeTF1Y2xWSlNsRRAB",
            "text": "Shrimp & Grits was amazing. I would’ve posted a pic, but my plate was finished before putting this review LOL. Ms. Donna is fantastic, she’s very generous and such a sweetheart. The space is intimate and calm. Will definitely come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRldEQlhRaTA1V0hkWVQwaGhaVFZwTjI1WlNsRRAB",
            "text": "As a Brooklynite, Home Sweet Harlem is amazing. I held my corporate event here and the food, hospitals ambiance was EXCELLENT"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tndGRVTnVlRUpKYldVeVYxQlRjazVDYTB0Q1JVRRAB",
            "text": "Food and hospitality is amazing. A must go eatery for brunch"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWVNqRlNOR05WZVRWeFpUbElabnBITUdoWVlYYxAB",
            "text": "The food was great excellent customer service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JNVMyeFJWbFZ5ZERKbGIybzNRM2xaY0hWbVVVRRAB",
            "text": "Thumbs up, I felt like I was eating a great cooked meal. The space is amazing. I will be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OR1FYUXhVV3h3V1VWNk1WWnhhM2hZUzBsbmNWRRAB",
            "text": "A cute cozy spot in west Harlem, the food was tasty, but the service was terrible.\n\nFirst, they didn’t have any menus or a QR code and the server didn’t tell me until they came to take my order and asked for the menu. So I had to pull up the website menu myself (not a big deal, but would’ve been nice to know right when I sat down).\n\nThen, when I was ready to order the server let me know they had a catering order they were trying to finish and weren’t completing restaurant orders until that was done. Expected 10-20 min wait. I said ok and asked if they could bring me some toast (easy enough to get out in the middle of a big order) as I was in the verge of hangry. Toast never came, but it showed up on my check later. 🙄\n\nThe food eventually came, but I still did not have my coffee. The server did bring it upon asking when the food was dropped and they did come around to ask how it was pretty quickly after. But that was the last I really saw of them at my table the whole time I was there.\n\nWhen I finished eating, I waited almost 10 minutes to ask for a box, check, and to go cup for my coffee (it was too hot to drink, so I barely had any of it). The box and cup never came, and the check came but it was the wrong one. When she brought the correct one, the toast I ordered and never got was on there. I waited for her to come back to adjust but didn’t wait long bc at that point I was tired of waiting so I went up to the counter. She gave a $5 discount (for the cost of the toast), but did not remove the toast from the ticket, so I’m pretty sure I still paid sales tax on it. And there was a 9% service charge that was not disclosed ahead of time. I have no idea what it was for.\n\nI’m disappointed bc it’s a cute spot and the food was good, plus it’s walking distance from my new place, but I doubt I’ll be back with service that terrible."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU0xYUTBhV05FWjBweGFUbGlialZOUjJkUFRtYxAB",
            "text": "GET THE PANCAKES. They are by the best! So fluffy and delicate I do not know how they do it. They are always so friendly and kind in the restaurant as well. Next time you are in the area stop by for a lovely time :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVVMweFJhVnBXVG0xRFh6UkVla1ZRTUVrdFpIYxAB",
            "text": "Sundays are our pancake days! And today I have discovered this place, which made my Sunday more memorable. Pancakes were soft, the chicken was properly seasoned and the addition of strawberries and syrup was amazing! Something that I like…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOM1NtRldRV2MxV2tWTGJYWjFhME52WlVJM2NIYxAB",
            "text": "Such a great experience! My mom and I enjoyed a nice lunch on a Sunday and it’s safe to say we’ll be back every time we come to Harlem!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taT2RFOVhTVEV4Um13MFp6TnBkVE5pYVd0TlRIYxAB",
            "text": "Breakfast took over 45 mins after ordering to arrive even though we were the first customers and alone for over 20 mins in restaurant, eggs supposed to be “over medium” came out almost raw, runny whites and yellows broken and eggs piled on…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMVVuVjFWMjk2WW5OVFRIUTJabU5sVG1wTmFrRRAB",
            "text": "Loved this establishment. The decor lifts you out of nyc and transfers you to an island, Bermuda perhaps. The food is exquisite!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKak5tdFJkMjB6VTE5bmNWVkVUaTFRVjA5NVgxRRAB",
            "text": "Very sad about this place\nReally was hoping after the long walk this black owned restaurant was good.\nShe took our order. And she repeated out order.\nAnd she brought the wrong dish to my husband. She should have stopped it from the kitchen and knew that he wanted shrimp and not fish.\nAnd his fish had some uncooked parts.\nNo AC!\nIt was so hot in here even with the ceiling fans.\nOur table was wobbly and had an uneven table top. The chef came out way late after the incorrect order and the raw fish.\nShe should have come out much earlier to address the issue.\nOh and the chicken sausage does not look good at all."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdGRXRmtXSEJ1UzIxc1IwZFVaelpwU3pWeFpsRRAB",
            "text": "One of my favorite date spots! The food his phenomenal and the staff is always so welcoming and pleasant!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUWVEQldWMUpzT1hRMmIyUXpOVE5EVkc1UFZFRRAB",
            "text": "Pleasant atmosphere for a Sunday brunch and the food was superb!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSmNtNXlTV1ZsUzBjMldUZGtNRmxHYmpGamNsRRAB",
            "text": "It was a great experience! The service and food were fantastic. Completely recommended."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWmIwMUVhMTh6VERsRmEyeDRiazlqU2tOeFlXYxAB",
            "text": "Wow! Visiting from LA and wanted some good brunch on our visit to Harlem. I’m so glad we found this spot because omg the food was great. The environment was so chill and comfortable. Tay made the visit that much better by offering…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRE1GQlBZV2xvUjJsNGVGUlhZbGxXYzJnd2VGRRAB",
            "text": "Absolutely delicious brunch food, the coffee is the best I have had in NYC and the customer service is perfect, just so kind and competent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWGVVdGhjbkZtVUhoamJGRktSVWhVYTNacGVIYxAB",
            "text": "Shrimp and grits was delicious. Biscuits were great. Super affordable. Highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OelVqQkxhM2xvUmprNVRsRnJNbGMyUzI4eVdIYxAB",
            "text": "This was definitely money well spent on a meal. The service was great and the food was absolutely delicious. Freshly made, tasty & the prices were reasonable. I'm very persnickety…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNU1ITkpSMlEwUlZScVF6QjJXVmRxYlhReWNYYxAB",
            "text": "We were greeted by a wonderful young lady. The wonderful atmosphere was a welcome to the many other places where don't even look at you. The food was exceptional. High quality ingredients and presented by loving hands. We got to meet the owner and Chef Donna. Thank you Donna your touch of home. I will be retruning!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQTGw3WUtFbGNXVVJ3EAE",
            "text": "What I thought was going to be a normal brunch experience was anything but in all the best ways.  The shrimp frittata was absolutely delightful.  The service was exceptional and the best parts came afterward when the owner came out and personally checked on our experience and without being invasive engaged in conversation that is unparalleled in New York City dining.\n\nIt was truly a homestyle meal in the in heart of Harlem that left me truly dumbfounded.  In twenty years I’ve never experienced anything like this before.\n\nAs if the service couldn’t get better at this point, I left my credit card at the restaurant.  The restaurant added the personal touch to track me down the very next day and reached out to ensure that I was taken care.\n\nA great meal.  A thankful heart.  Good vibes.  All the things I’m looking for from a neighborhood spot with delicious food and good service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNU4wZDNSMHBDTmxGVFFrWkZMVEJaVFc5RFZuYxAB",
            "text": "Staff is super kind and food is super great! Highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNVEZtTXk3a2REbXZBRRAB",
            "text": "Delicious food!  Amazing service!  The home skillet with yams hit the spot!  Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMlFtZHNaRkZFTURCWk1uTkZkVXM0WVc5eVJuYxAB",
            "text": "\"Too good to eat with a fork!\" -Izzy on the Chicken & Waffles\n\n\"Best brunch place in Harlem\" - Alec"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNN0ltS09JMk9lTWhRRRAB",
            "text": "Thank you Donna! The catering that you provided for my son's party was out of this world!!! The fried chicken was so juicy and tasty. My mistake was not ordering enough... The salmon was a hot. I couldn't recommend enough! I can't wait to try the chicken sausages as everyone raves about them too. Great staple to the neighborhood."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLT0x3SWpGcmVlWjdRRRAB",
            "text": "This place food was AMAZING!! Me and my daughter stumbled pass here. Everything taste homemade like your mom/aunt/grandma was in the kitchen. The orange juice was fresh squeezed whipped cream homemade. Just goodness! Our server was very…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKaThpc20xaFpUMG1BRRAB",
            "text": "I visited this restaurant for the first time this weekend hoping to find a new breakfast place in the area. The food was decent and the place was fine, but unfortunately the service is what made me give 3 stars. We sat ourselves at the table, and it took about 15-20 minutes for our drink order to be taken. About another 20 minutes went by with no water, and I had to get up and ask for it myself. We waited about an hour for our food and were even asked by the server if he had already taken our food order. The server was nice, but never came to the table unless we flagged him down, even for water refills. There is also a service charge regardless of the party size. Overall, the service is what ruined my experience here which is disappointing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ2UzRDlnRRAB",
            "text": "Food: 3\nService: 2\nAtmosphere: 2.5\n\nParty of 2 sat for brunch. Our server was also working the front counter. After 15 minutes, we had to walk up to them to ASK for water, which was lukewarm, and again for refills. A party of 6 that came in shortly after us received ice-cold water immediately. The wait for the food (chicken + waffles & frittata) was an additional 25+ minutes, during which time no other food was brought to the other tables ahead of us, and few tables even had food. Our server at one point even asked if we had ordered yet, even though we ordered with them. The food was average at best, and the kitchen seemed small, considering that party of 6 still didn't get any food or drink by the time we left (nearly an hour later). I'm sure my fellow reviewers received better food and service, but I cannot recommend this place.\n\nEdit: There was also a 9% service charge for \"parties of 1 or larger\"."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaGE2R2NBEAE",
            "text": "Food Sourhern cuisine. Fish cakes and mac & cheese.  Thank you."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLWFPVVFBEAE",
            "text": "Jerk chicken, Mac & cheese 🧀!! 😋😋…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvb2VQc2NnEAE",
            "text": "The food is amazing. The owner chef is womderful. Please support this fabulous restaurant!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdHVyU2NBEAE",
            "text": "Home Sweet Harlem holds a special place in my heart. I wanted the perfect venue to host my best friend’s Baby Shower and since we are Harlem natives, it was serendipitous that we found a place that took us back to our roots. We were able to rent the entire venue after hours on a Saturday and Ms. Donna and her staff were absolutely excellent! We had a full buffet brunch menu, complete with chicken, fish, shrimp, sausage, waffles, pancakes, eggs, potatoes, assorted drinks etc.- the entire spread was excellent. From the onset of the first call Ms. Donna was accommodating and organized. We discussed the seating capacity, the desired menu items, and add-ons. Prior to the event my sister and I went to brunch and sampled the menu in person. The food was so good that we decided to add on items! Ms. Donna had great communication via phone and email, which made for a very smooth event. On the day of the Baby Shower we were greeted by her staff and graciously allowed to enter early for the balloon artist to begin decorating. Her staff pre-arranged the tables to my specifications and cleaned and mopped as we were setting up to ensure that no unsightly florals were on the ground during the set-up process. We greatly appreciated the use her sound system to play our curated playlist as it saved us on musician/DJ fees. Her staff provided individualized drink service throughout the event and everyone noted how personable and kind they were-shout out to Tay, William, and Julian- you are jewels! The buffet was well organized and was served table by table for efficiency. I appreciate that she allowed outside food and beverage to compliment the included food package, and she even provided to-go containers for the remaining cupcakes for the guests to take. Having attended Home Sweet Harlem for both brunch and hosting for a catered event, I can attest that your experience will be top notch. At Home Sweet Harlem we truly felt at home and will be returning “home” very soon!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNWZ5Y0NREAE",
            "text": "Wonderful food and great staff. A Harlem must!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcGYtSlB3EAE",
            "text": "The food and customer service were excellent.  We had brunch and celebrated my sister's birthday."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvX0pMMWxRRRAB",
            "text": "Food amazing…talked with the owner for 20min. such a wonderful person. Light vibe music was perfect"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdDZlWEN3EAE",
            "text": "I walked in and the name of this restaurant really lives up to its name! I really felt as if I went to Harlem and was in someone’s home eating brunch haha! My mom and I walked in and was welcomed by our waiter Tay who was very attentive and delivered amazing service the entire time. We asked for a specific meal we saw on their Instagram page, and said we wanted “that exact picture”! LET ME TELL YA’ll!!!!! The chef/owner did not disappoint! The food was flavorful and cooked to perfection. We got exactly what we asked for, and was very satisfied after our meal. She did what needed to be done & I highly recommend trying this brunch spot if you’re in Harlem! You won’t be disappointed!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbC1YbldBEAE",
            "text": "The home skillet is awesome, delicious, and not salty like other places. I love this place!!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbzlXVzN3RRAB",
            "text": "Salmon croquette were delicious....grits great texture & the farmer's Market Breakfast was the bomb+"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMkppclNBEAE",
            "text": "highly recommend Home Sweet Harlem for catering! They make delicious and beautifully arranged sandwich platters, salads and sides. Donna is very responsive and can put together an order even on short notice. We use Home Sweet Harlem…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMzdhT0ZREAE",
            "text": "Very welcoming atmosphere where do I start with the food very filling , shrimp and grits full is the way to go , also they played great music so happy to finally stop in !!!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcXVhaEFREAE",
            "text": "Went here for a work brunch,  food looked really good, I had the waffles the salmon croquettes were so good,  have it 4 bc I didn't get to taste the chicken"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJakwtbTF3RRAB",
            "text": "Held a wonderful event and closed down the shop. Food was wonderful and all the staff were great."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaUlyMVVBEAE",
            "text": "I ordered the Home Skillet.  It was delicious.  I appreciate the fact that the food temperature was right.  Would definitely return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIc0l5TXFRRRAB",
            "text": "Stopped by on a Sunday for brunch and we were literally the only ones there. We were quickly sat and able to order. I ordered the shrimp and grits full. This came with sautéed shrimp over grits, a salmon croquette, 2 eggs, a biscuit, and fresh squeezed orange juice. Everything was really tasty, I just wish the sauce for the shrimp didn’t have so many tomatoes in it. My friends and I also shared an order of the Challah French Toast and I was not a fan at all. If you like crunchy French toast then this is the dish for you. If you’re like me and like it soft, I would recommend asking for it to be prepared soft or just skipping it altogether. Also, when we were ready to leave we were one of 3 occupied tables and our server went missing for a long time. We eventually had to just go stand at the bar and wait to check out. I wish the server was more attentive during our visit. Besides this small issue, I do think this place is worth trying."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIM2FYN1ZnEAE",
            "text": "My mom and I stopped by for Saturday brunch after exploring Hamilton Grange, and we loved it! Everything from the delicious food, to friendly service, to homey decor - it was a perfect place to spend the afternoon together :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuczR2WlhnEAE",
            "text": "Okay so it was empty which is a red flag 🚩 because NYC brunch is a whole vibe. We actually leaving to head over to Amy Ruth’s and we not coming back no more. The food some parts are undercooked some are burnt. The grits had no taste, the fish burnt, potatoes burnt. They took 20% off and the waiter said “stuff happens” we good on here. If you want to play Russian roulette with your food come here."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOHRtVWhnRRAB",
            "text": "It was my first time going go to this comfortable eatery. The staff was exceptionally friendly, very hospitable and constantly always checking in to see if I was okay or needed anything. The food was absolutely delicious. I had the shrimp and grits. The presentation was beautiful and the scenery was very cozy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6anZieFFREAE",
            "text": "Nice  spot, very good  food, nice vibe. . I have been here a few times for the shrimp and grits but this weekend I mixed it up a little and had the grits and fried fish with two eggs over easy and it was probably the best brunch I’ve had all year . Fish was Crispy outside moist flaky inside. Grits creamy, but not mushy with a fat pat of salted butter. Flaky biscuit  Husband had the shrimp in tomato and garlic sauce also good. We are too fast to take pictures of the food.  So we will be back. After we checked out  Hamilton Terrace and the  Grange a.k.a. Alexander Hamilton’s summer home (free! Run by the national park service ) all in all a really nice afternoon."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN0lLczJBRRAB",
            "text": "As you can see its all gone. Superb meal. We are visiting from Atlanta Ga and we ordered the fish and grits (full)with a side shrimp and potatoes. The shrimp and grits are their number one seller for a reason. The flavors were crazy good.…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LWRId0l3EAE",
            "text": "Exceptional customer service. Owner was nice. The server was accommodating and professional. I felt welcomed and like eating at home. I recommend to any one visiting to check out this one of kind restaurant."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNXR1U0JnEAE",
            "text": "This place is very inviting inside and the owner is friendly.  Their menu is full of delicious, flavorful, fairly healthy dishes.  The menu is fairly gluten allergy friendly, free from red meat and pork.  They have a very nice juice/smoothie menu also. Great for any meal, a quick bite, and a drink to go."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdjhUdHBBRRAB",
            "text": "True home cooked meal. Felt like my grandma's house. Well seasoned, soul food. Excellent attentive service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOOGRyXzlBRRAB",
            "text": "Entering this restaurant you could immediately tell you were going to get a nice home atmosphere. It was empty for a Sunday but that was probably because college was out, this place is very close to city college. Me and my friend sat down and admired the exposed brick and plants the had in the space. We then ordered our food. I ended up getting the chicken and waffle plate. When my food came out I was happy about the portion I had received! The waffle was delicious, the chicken left more to be desired. The plate also came with 2 eggs and your choice of meat, I got the turkey sausage. To tell you the truth the meal could have done without the chicken and would have been perfect. The price for the two meals was good and wouldn't break anyone's wallet. I definitely recommend this place to anyone wanting to eat in a homie atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiN3B6aWxBRRAB",
            "text": "Hosted a baby shower brunch this past weekend.  It was classy, great service and the food was really good.\nThe owner Donna is a sweetheart! To say i felt at home is an understatement.  I will be going back for brunch/lunch really soon!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHOTUzS0RnEAE",
            "text": "I was happy and surprised to find the restaurant practically empty save for 2 tables (one finished and one still eating).  My disappointment started immediately when 2 or 3 staff people passed by (one young man came by twice with his hands up as though he was scrubbed in to perform surgery) a time or 2 without acknowledging us in any way.  After about 5 minutes a young lady asked for our vaccine verification and instructed us to seat ourselves.  The young lady took our drink order and quickly brought the water and told us to use the QR code for the menu. About 5 minutes after getting the water, 2 gentlemen sat themselves (prior to showing proof of vaccination) and left about 10 minutes later when no one had come to their table.  A few minutes later we heard someone say, \"they left?\". we let another 5 - 10 minutes pass before reminding the staff that we were still waiting to place an order.  A nice young lady finally took our order and 20 minutes later we still had no food nor had anyone checked on us which would be easy as we were still the only people in the restaurant.  I did notice LOTS of delivery drivers come and go as we waited for our food.  About 5 minutes after asking for our food a young man came to say, \"we just waiting for the biscuits to come out of the oven\".  Remember, THERE ARE NO OTHER CUSTOMERS IN THE RESTAURANT.  There's more but I'm tired.  The food was good except for the scrambled eggs I ordered without cheese that came with cheese and inedible (see photo). I tried to tell the young man that if we were told upfront that even though the place was empty, we would not get food for an hour we could have made an informed decision to come another time or be prepared for the wait.  I also mentioned that they should have comped us the salmon cake appetizer ($6) we ordered as a gesture of good will.  Unfortunately, as it stands now this is a place I don't want to return to or recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhM0t2UURnEAE",
            "text": "Loved it here! What a treat! Home Sweet Harlem is very cute, has great service, and delicious food! I had the shrimp and grits which was great. The biscuits are extra extra amazing. Everyone was very kind and friendly as well. I can't wait to come back!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNl9md1R3EAE",
            "text": "Delicious pancakes🤌🏽, chef’s recipe! 😋 Not a perfect experience, but at least the pancakes were AMAZING 🤤 !!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnX3ZfZWt3RRAB",
            "text": "First of all the food is great, the service is warm and welcoming and the drinks are just right. What else do you need to know?!? It is a good weekend brunch spot for friends and families alike. It has the all important one-hour bottomless mimosas and Bellinis that we go to brunch for.  It’s been written up in Oprah magazine with a shout out from Gayle King.  The atmosphere is beautiful and relaxed, it’s not crowded, there wasn’t any wait when I went and we did not feel rushed (5 hour brunch anyone?). Love this place will definitely be coming back. It was great to see Donna and the staff again since her original spot on 135th street and Frederick Douglass BLVD  in Central Harlem closed.  I remember spending hours reading and studying in that window seat. Back then it was the one and only healthy eat-in restaurant in Harlem at the time.  Great to see Home Sweet Harlem back and better than ever!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbThhdzlBRRAB",
            "text": "My brother and I was in town to attend a funeral and was in need of some food lol. I looked up restaurants and this one came up. The restaurant is small and quaint. The antique furniture was a nice touch. I ordered fish and grits and the…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dDlpejFnRRAB",
            "text": "Was invited for a brunch on a Sunday and it was very pleasant. Owner tends her business like her home. Very nice comfy restaurant, great for Harlem. Food is tasty too but it felt like I waited forever to get some coffee and a sandwich that would've taken 5 minutes at a deli."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNlOXRvNxAB",
            "text": "Home Sweet Harlem is a small gem that is centered in the heart of Harlem right by City College. Its a quaint restaurant with a wait staff who are attentive and very friendly. Matthew was awesome!! We even talked to the owner who is really lovely. I recommend you order extra biscuits with your meal too (they’re made from scratch). I ordered the shrimp, grits, scrambled eggs & Turkey bacon. Delish!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQX3JiSXdBRRAB",
            "text": "The owner Donna/Home Sweet Harlem is phenomenal! From the moment of inquiry, Donna was responsive, very accommodating and flexible. Donna catered our office lunch for 80 people. Her and her staff were on time, professional and they did set up and break down and took care of all of the cleaning. The food was great, still warm and that chocolate cake was amazing! Definitely 10/10 recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdklHWHp3RRAB",
            "text": "Food was delicious and EVERYTHING is made from scratch. That being said be patient with the wait. The owner Donna was amazing and came out to greet us. She is also the head cook and makes some of the best biscuits I have ever tasted. Definitely would recommend."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURFb3JQd2NBEAE",
            "text": "Went there for lunch a few weeks ago. The owner was very friendly, but the guy behind the bar had a very bad attitude, and not friendly at all. The food was okay."
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteTVyVnl3RRAB",
            "text": "Que rêver de mieux pour un dimanche matin à Harlem ? Un brunch typique qui correspond totalement aux attentes\nLes pancakes sont conséquents et délicieux.  L'ambiance est conviviale et chaleureuse et les serveurs sont aux petits soins.\nAvant ou après une messe gospel, je recommande !!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXN3R5UW1RRRAB",
            "text": "After reading a few good reviews and a couple of mediocre reviews we opted to try this restaurant. Upon entry my first thought was that everything inside looked very aged an unkept. We were told we could sit anywhere then realized the table we chose was dirty (with crumbs). The table next to us also had crumbs on it. After ordereing sweet tea, the server suggested I try the sweet tea mixed with lemonade. Sure, why not!? It took about 15 minutes to come and clearly the lemon on the rim of the glass was old as was the taste of the juice. So old that I could not drink it. I had read good reviews on the fish and grits so I ordered this and he ordered the salmon cakes & grits. They asked if I wanted the full size as opposed to simple (which I did not see on the menu). They said it included eggs, a salmon cake (or turkey bacon/sausage), and toast. The fish was definitely cooked in old grease and likely re-cooked. It was not fresh at all. It was visibly old. The salmon cake was cooked in the same grease and was nothing to write home about. The grits were luke warm at best. The mound of butter nor the cheese on it would melt. (Had they been hot they may have been good.) Not sure what kind of toast it was but it was hard and let's just say \"different\". I had high hopes but unfortunately my palette will not let me return to give a second chance, as I normally would prior to giving a not so great review. Our bill was $57.73 which included an 18% service charge + tax. Even 18% was not deserved in this case and I'm not sure of how things were tallied up on the bill but it seemed as if things that were \"incuded\" actually had up charges. I really don't even want to give 1 star."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMjl6TXNBRRAB",
            "text": "Delicious food and amazing staff.\nIt was decided last minute to come from Queens to Harlem for a New Year’s brunch and it was a great choice!\nAwesome way to start the year!\nOur waiter was lovely and so cheerful as the rest of the staff!\nFood was absolutely delicious!\nThank you for making our first day of the year so special!\nWe will definitely comeback!!"
        }
    ],
    "reviews_count": 74
}