{
    "name": "Jin Ramen Hamilton Heights",
    "place_id": "ChIJGcuwKtj3wokRHB7NZ8wzTSQ",
    "grid": "MN9",
    "address": "3599 Broadway, New York, NY 10031, USA",
    "rating": 4.3,
    "user_ratings_total": 181,
    "phone_number": "(646) 822-8350",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdVFubE5VV2Q1VkV4UFRpMWtNa1p3VTJnMlIxRRAB",
            "text": "Don’t order delivery from them, the driver spilled my drink all over my food, everything was soaked and he still gave me a hard time about not leaving a cash tip."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NdE1FbFFZbFZTWlZKSVZITmZPVEowU21aQmFYYxAB",
            "text": "Beware of Jin Ramen's personal delivery guys who aggressively panhandle at your door for tips before giving you your food. One of them even attempted to enter my home. God forbid you tell management, they'll defend their drivers at seemingly any cost."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSS1lWVTNkVkJWUkdscVJYTTFhRzB4Vm5OQ1VrRRAB",
            "text": "Volcano tonkatsu. All day. Every day."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTFVVUnNRMXB0VFdGdlNURlphbDlaVWpKbk5YYxAB",
            "text": "The food was very bland, the portion of the food per ramen bowl was very low compared to other locations.\nThe service was okay, just took 20 mins to get plates delivered starting with the appetizers!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSeE1sWmZOa040TFZCRFpsSktZM0JzVGxNek9GRRAB",
            "text": "Super friendly and attentive staff. We tried the pork kimchi, chicken, and beef lunch, and everything was absolutely delicious. The meats were well-seasoned and cooked just right. We also had their homemade green tea iced tea, which was so refreshing and full of flavor—definitely a must-try. Highly recommend this spot if you’re looking for tasty food and great service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aalpTMUtWRk5XWTB4SlJXZHFaVkZzY0VjM2NsRRAB",
            "text": "I had the Pollo Encebollado ramen. Best meal I have had all year. I will remember this meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5amNYWnhaM1ZMYzJwVWVWRnZjM3BOVm1GS2JWRRAB",
            "text": "I had the most incredible meal here! Our server was so kind, enthusiastic and quick to help. The chef Jefferson cooked our meal perfectly"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214b2RXSkhPVEV6TlhZNWJYVk1OblJWV2tGNFRYYxAB",
            "text": "Truly, one of my favorite places to eat, and as they continue to expand, it’s just giving me more places to explore so I can get my favorite meals. The staff was very friendly. I believe I got there around 8 PM, and there weren’t too many people inside. I guess 8 PM on a Monday, yeah, maybe not gonna be the busiest spot. I was quickly seated, got to look over the menu for maybe 2 to 3 minutes before a woman came and took my order, wasn’t sure about my drink, and by the time she came back, I was. Everything moved very smoothly, and I was probably inside the restaurant for about an hour, of which after I paid the check, I did sit for a little bit just drinking water. Really appreciated the vibe of them not kicking me out, they technically didn’t close until 10. But I was still one of the only people in the restaurant so I’m surprised that they weren’t just like a get a move on."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSWQydElMUzF6YW5kdlQxVjZiVEpzYlRoUloyYxAB",
            "text": "The atmosphere of Jin Ramen was calm around 5pm and Our waiter Ricky was very patient with us, offering suggestions and ensuring we had a great experience. Around 7pm traffic really picks up, yet still very attentive our waiter. Thank you Ricky for your patience as it was my first trying Ramen, love Jin Ramen. ❤️"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNmJrOWljM2xvUjJoQ01rSnFTMkpCUlVSNE5uYxAB",
            "text": "Nuestra primera vez en este restaurante, la comida es buena, muy buen ramen; sin embargo, el servicio súper pobre, la primera persona que nos recibió fue amable, pero su compañera súper rude, cuando entramos y su compañera estaba ocupada dando degustación ella solo la gritó para que nos recibiera, se entiende que está en break pero por lo menos ser amable con los guests que no tienen porque recibir ese trato, luego cuando le preguntamos que si podamos llevar los wonderful chopstick como recuerdo, nos contestó súper seca NO, al pagar nos dimos cuenta que no nos cobró un cóctel y al decirle. “Mira que se te olvidó cobrar un cóctel”, (esto con el fin de pagarlo,), su respuesta fue un poco agresiva : yo no sé, yo no tome su orden, le dije si pero falta un cóctel y dijo pero que quiere que haga m, a lo que preferimos irnos y no seguir con la discusión… la recomendación es tener más cuidado con el servicio, la atención al cliente, los restaurantes es un conjunto de todo no solo la comida."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bU1FRlZRa1prUTJ3MVRUSnhTbDlrWjJwV1JHYxAB",
            "text": "For that price the quality was really mid! Broth was nothing special. Veg curry rice was decent but $4 to add tofu should have been a good amount & better firm tofu, not a tiny bit of silken tofu. Charging $3 each for the spicy paste and the spicy oil was insane. Condiment should be given for free or at most $1 if charged because it is about bettering the eating experience of the customers!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sb1drUkthMGwwVERocWNWbG1jVlZVZDJob2VsRRAB",
            "text": "Loved the ramen here and the decor. The wait staff was attentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTFoyVlBVRmcwZGxoaFVYTldXWEJETlRCWk5rRRAB",
            "text": "I love this place! Food is super tasty and the servers are very attentive. When dining in, portions are very large. They are a little bit smaller for takeout but still worth it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTWJ6VllNbTFOUldsMU1WVkVZMTkxVlRoeWNXYxAB",
            "text": "A terrific spot for Ramen, but also generous portions. Very attentive service even when they are busy."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNFYwTmxZMEUwTlVWMVdWcHhTbkp1VUc1dlZXYxAB",
            "text": "Buen lugar para comer ramen, tienen una promo de sake !!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WU2IwdG1ORm90WlRWUGJYUm5iRlpsVGtjNVVsRRAB",
            "text": "I'm a Ramen Lover, I order the tonkatsu spicy ramen and it was too salty also the chashu taste hard and old. Definitely not fresh 😕 the boy who served us on a Sunday night was nice and attentive, but then  I think he was in his break ,because I saw him eating.  Nobody came to check on us or the other table, because we were only 2 tables on a Sunday night, they were 2 more girls that I heard chatting loudly too. Food portions are descent the takoyaki balls tasted great but it  barely had octopus inside 1 little pieces of octopus in each ball. Food presentation 9/10."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdWFVeFhNV3gwVUUwdFprZDFlSEJ5U3pOc1QyYxAB",
            "text": "Nice and Cozy!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSFFrVlpUbVZHZG5WMFJWOUZOV2xqTTJFNFZtYxAB",
            "text": "Jin Ramen consistently delivers excellent food. We have been going to the original location since they opened and finally got to try this newer spot on Father’s Day. We loved the special menu items here, like the Shrimp Ramen and had good service even though we were the only table upstairs. The main reason for this post though is that the point of sale system added the gratuity to the bill total (including tax) when it is supposed to be on the subtotal, which is what was also reflected on the check. I mentioned this to the server and he said he’d alert management so I hope that gets fixed and we can trust management to do the right thing and not be having any shady business practices. Thank you for your attention to this!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKZndnTXJ6MmZfRWdRRRAB",
            "text": "They have a great selection of rice bowls and ramen. I definitely recommend chashu don and fried rice (chahan)."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbC1PS2xBRRAB",
            "text": "Good food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaGZqWnFnRRAB",
            "text": "Food was amazing but the customer service was spectacular Andre really helped us out and accommodated our every concern and need!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJai1tVlJ3EAE",
            "text": "I’m so satisfied,delicious food and super affordable.\nIn the beginning I was up for the (Matcha Tiramisu)\nBut Andre end up giving me the (Mochi Trio) which I loved even more! Thanks for the excellent service. Also don’t forget to try the (SAPPORO BEER) highly recommended. Enjoy!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdjVySXB3RRAB",
            "text": "I liked the ramen here, but it was also not anything of note. Good enough for anyone who wants some decent ramen without having to leave the neighborhood. Slightly pricy for the amount of food that it is."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMk9XbVVBEAE",
            "text": "Great menu. Tasty food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMTRHSlR3EAE",
            "text": "Parking is difficult"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbDlhWWRnEAE",
            "text": "I love this restaurant. The variety they offer caters to my every whim, whenever I come here I know there'll be something new for me to try. The interior is truly beautiful, with live plants, murals, and koi flags. If you come alone, expect to spend about $20."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcEtQalVnEAE",
            "text": "Profoundly mid food. I’m a huge ramen fan and have eaten it all across the city. Seems like most likely everything here is prepared somewhere else and shipped in pre-packaged (it’s a chain). Tonkotsu broth was lacking flavor and seemed to have artificial thickener in it. Chashu was falling apart (not in the good way). Menma (bamboo) had clearly just come out of a can. Oh and broth wasn’t hot and noodles undercooked. Hard to argue it’s worth spending $19 plus tip when you could make something better out of the package at home for $2"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeEtQajdBRRAB",
            "text": "Yummy ramen 🍜 ラメの.   Only thing, I would prefer (like) the broth to be much warmer actually hot temperature (it wasn’t)."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfai11NDd3RRAB",
            "text": "Its decent. Nothing bad. Nothing great. The one on broadway & w125 st is quite better."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfei1LMlFnEAE",
            "text": "Really enjoyed my ramen and the atmosphere!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdFlMTGVREAE",
            "text": "Delicious food, amazing service, and modern-cozy ambiance"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmM2ZtcFdREAE",
            "text": "It's the first time I've eaten at a Japanese restaurant and it was good. My wife liked it also. The food was fresh and very good and our server was very nice and attentive. The restaurant was cozy."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dmJHbjZ3RRAB",
            "text": "I wish I knew of this place much sooner, I made the mistake of continuously driving by as I picked up my daughter from school. I was kindly greeted by Andre, he gave me good food recommendations and that was \"all she wrote\".\n\nI'm sitting here completely fulled. Writing this! If your reading, come on down. Experience greatness for yourself ✌🏾🤣"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cnBERE9nEAE",
            "text": "Andre was a great server. He was quick to attend us and took our order real quick! He’s so professional and super charismatic! The food was amazing! I loved the karaage was really good and the miso was the best miso I had it in a long time. Will be coming back I wish I took a picture but I ate it before I ca"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bkpIYXRRRRAB",
            "text": "I've been coming here since they opened. The food is amazing and the service even better. The server,  Andre is really professional and knowledgeable on the entire menu. Polite and well spoken. Highly recommend this place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdzRydF9BRRAB",
            "text": "I personally have not dined here, the only reason for the blank rating for service & atmosphere. My 10-year-old son visited, and he was pleased with his food and the environment. This speaks volumes, because children are finicky. Especially mine 💙"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaVlydU1REAE",
            "text": "My family and I absolutely love this place. The new decor is super cute. The food is always amazing. The dumplings are our favorite."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOXJIeHVnRRAB",
            "text": "Food and atmosphere is good. The server took our orders to pack them in to go boxes and when we returned home, saw that they packed us someone else’s leftovers. Horrible experience!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNWJDMXd3RRAB",
            "text": "Andre gave great support and service with me and my sister friend while we was ordering we was going through a tough time not feeling happy but Andre made us feel so much better and enjoyed our food that he recommended thank you so much Andre will be back soon :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcGN5aThnRRAB",
            "text": "I had the spicy tonkotsu , pork buns and it was great. The sauce on the pork bun was great"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzLVpQMS1nRRAB",
            "text": "I so love it here, the staff is kind and the food is amazing!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzaTQyUlRREAE",
            "text": "It’s okay"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ3ItTjRnRRAB",
            "text": "Unfortunately, our experience at Jin Ramen on 149th St and Broadway was disappointing. We ordered a bottle of wine and chose the larger size listed on the menu, priced at $25. When the wine arrived, the bottle was much larger than expected, which we assumed was just a generous pour. However, when we received the check, we discovered that the server had brought out a bottle size that wasn’t even listed on the menu—and we were not informed of this change until the bill arrived. The larger bottle was priced at $85 and was listed on a menu that we weren’t shown.\n\nTo make matters worse, the wine glasses the server initially provided were dirty, with visible lipstick stains and food residue on them. We had to request replacements, which left us uneasy about the attention to cleanliness here.\n\nAnd rather than a proper wine bucket, the wine was served in a stainless steel kitchen food container, which just felt off for a restaurant experience. Overall, the lack of communication, unclean glassware, and poor presentation left us disappointed. We won’t be returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ3JDXzB3RRAB",
            "text": "I cannot recommend this place enough! My wife and I recently went to Japan and needed to scratch that itch, this was the perfect spot. From the appearance of the location, to the friendly staff and the AMAZING FOOD, so amazing. We got Gyoza & Fried chicken along with some ramen and I definitely recommend their fried chicken. As you can see from the photos, that’s what was left of the Ramen, so you tell me if you think I thought it was good. Definitely a great spot for either a causal date or outing with friends. Also, they have plum wine! Doesn’t taste as great as the one from Japan but definitely was delicious, must try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX0pHUVVnEAE",
            "text": "We just had a very unpleasant experience at this restaurant. We ordered a bottle of Otokoyama wine, where the menu they originally showed us only showed 2 prices (one price per glass and another per bottle). When we were paying, the waiter charged us $85 because we ordered a bottle. But he never explained to us that there were two sizes of bottle, a small one and a large one, and the menu doesn't specify this either. The waiter obviously decided to sell us the larger one since it was more expensive. The quality in which they gave us the bottle was not the most appropriate or the most profesional. They placed the bottle in a stainless steel kitchen-like container. The glasses were also dirty with lipstick and food residue, we had to ask the waiter if he could change them for us. Very poor service. Try to be as honest and sincere as possible with your prices on the menu, don't try to trick customers just to charge more money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaXFPam5BRRAB",
            "text": "The place got an upgrade and it looks amazingg!The food is so good, even all year round it’s perfect. The flavor is there, the noodles are done right. The staff and service is great. Ramen hits the spot specifically on a cold day. Tried the pork buns for the first time and very tasteful and flavorful, as well as the Kimchi Ramen. It’s spicy but not too much for my liking. In my opinion you could really share for the amount they serve. Which is great! This is my go to place for Ramen :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYak1QMW9RRRAB",
            "text": "This ramen was so tasty and it has good flavorly  so I would like to come next time to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMm8zcC1RRRAB",
            "text": "Food was delicious at reasonable prices. The staff are exceptional. I would highly recommend, hands down!! Try the Sake flight  4 sake shots for $14....all delish!!! Good vibe music playing in the background."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NjZ1VHF3RRAB",
            "text": "Food slapped. Free drink with entree was great & refreshing. Got the green curry ramen and it was so good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NjR2dmpnRRAB",
            "text": "LOVE. the chashu pork fried rice is to die for. Also, super nice that you get a free yuzu green tea lemonade with your entree!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNFoyQ0l3EAE",
            "text": "I was fooled by the reviews and ratings but I have to make my review:\n1. Service one of the worst I've even had. After 10 min of waiting to order we had to go there and call them cause they were busy doing small talk.\n2. The table was sticky in a really annoying and disgusting way. The napkins were glued to the wood.\n3. Food presentation was good but the taste really disgusting. Maybe the ramen soup is made with lots of different vegetables but the plate was really cheap with ingredients.\n4. Not even once they stopped by asking if everything was ok and again we had to stand up and go to them to ask more water.\nThey had 3 tables and can't say they were too busy to bother for the service.\nNever again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSX05DT19nRRAB",
            "text": "Quick and easy service. Very nice decorated place. Has a lot of foods with chicken and pork (vegan options as well). The kani salad was a favorite. There’s many amazing ingredients that were very good accents to the food. Overall the portions are a bit big but for the food it is all worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM0lpd253RRAB",
            "text": "First time\nVisiting this spot despite that its in our neighborhood, but im glad we finally made it here.\n\nwe had the beef gyudon\nAnd shoyu ramen, my daughter finished everything! Thats a big deal for me, my daughter wont finish anything if she dont like it, she would only eat the noodles and all topings on the side. The beef gyudon was also good, i like that it wasnt too sweet, however its on the dry side, i guess its not fresh For $22 dinner size i expected more.\n\nThe bathroom is clean and thats a big plus for me.\nWill i go back? Yes. Service was also good, our server was nice and attentive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbDVUM3JBRRAB",
            "text": "I got the mapo tofu while friends got this insanely spicy volcano ramen. Flavor was good, I especially loved the eggplant, but wasn’t the biggest fan of the tofu- spice was a little off. Will definitely come back and try other dishes, plenty of seating space and a great Sapporo pitcher"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeXV6MFl3EAE",
            "text": "I am not a big ramen lover nor a ramen expert but I had to try this new restaurant out. I do love the architectural layout of this restaurant.  This restaurant is pretty much all ramen. The dish could be heartier. It needs more vegetables.  It was literally 2 pieces of pork belly,  half an egg, and some shredded green. The black broth didn't taste much like anything."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NjZ6bXl3RRAB",
            "text": "Awesome spot if you are craving authentic Ramen. Same and delicious high quality as their other location. Also, the vibe and decoration is perfect for families, dates, and friends. Can't wait for future visits, especially during the colder weather. Aside from their ramen I also recommend their pork buns!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMXRpb29RRRAB",
            "text": "I’m a vegan and a regular here. The portions are BIG, the staff is great and the food is super flavorful. The vegan green coconut thai curry is simply AMAZING."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxeUpDSGRnEAE",
            "text": "Im going to become a regular here and I’m not even a big ramen fan. That’s how fire it is. Wish I would have stopped in sooner! Nothing on the menu misses a beat, every dish has brilliantly blended flavours & seasonings. Huge portions. I had chicken nanbuns, Sapporo draft beer, and Greeb Coconut Thai Curry ramen (SO GOOD). Inside is beautifully curated & there’s even a dope upstairs. 10/10 reccommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaeV9LaVdnEAE",
            "text": "I had had this place marked to visit for a while now in the neighborhood. Great decorations and artwork around the restaurant. The drinks are unique and well-priced, although it did take a while to come out and the table was somewhat sticky. I had the chicken gyozas & katsu pork curry. Well-flavored and great establishment."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4akw2MFNBEAE",
            "text": "The lunch specials are perfect! $2.50 beers and great variety of lunch menu options. The green beans were refreshing and delicious. Friendly service. A great addition to the neighborhood."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNnUyTWJnEAE",
            "text": "Jin strikes again!!\n\nI’ve been going to Jin ramen for a hot minute now. I’m so happy and thrilled it’s expanding their business and bringing the flavor uptown.\nI’m used to go the original location at the upper west side, which never disappoints. But the trip to get there sometimes it’s hard.\n\nI’ve tried take out from the (Harlem 125)location  which was sadly the worse experience I could have, which discourages me from ordering take out again, until now!\n\nThis location is the real deal, food is quick and freshly made. Their vegetable ramen ( vegan) is to die for *drool* , their chicken buns are exceptional delicious.\n\nThe ambience in this place is very cool industrial aesthetic and service great.\n\nDefinitely happy and pleased to have this nearby!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldWY2VW93RRAB",
            "text": "This spot is new, it’s clean, it has excellent staff, and the ramen is so good. I have gone multiple times already within the time of its opening and I have to say every style or bowl of ramen they offer is fantastic.\n\nHIGHLY recommend for anyone in the immediate area and for those in need of a bowl of noodles in the fall or winter."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNGVqTG13RRAB",
            "text": "I had the tofu buns and they were perfection! It was a chill environment and they let us order even though kitchen was about to close. Will definitely be coming back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwc2JTWWZBEAE",
            "text": "This place serves very tasty ramen.  The soup was very well prepared.  The restaurant is clean and modern. Will definitely come back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxcXVuTWN3EAE",
            "text": "This place has such good, creamy, ramen broth -- both their veggie and meat options. And the things they do with chicken and pork are divine. The upstairs at this location is a great secret -- it's a wonderful place to take a larger group (6-10 people?) and while the night away."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWdGItbzR3RRAB",
            "text": "The newest addition to a small-but-strong group of Asian restaurants in Hamilton Heights! Authentic ramen well-made by a chef who understands the classic and subtle qualities of the namesake dish. Go for volcanic heat or something more mild, but a belly-warming meal in a slow-paced, easy-going environment with attentive service is time well-spent."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldDlQT2N3EAE",
            "text": "This is legit! The ramen is cooked to just the right doneness, and the broth is unbeatable.\nI’ve been a fan of their Kuro Tonkotsu at the other locations and of course that’s what I got. Seriously, other ramen shop might also have a ‘black garlic’ ramen but it’s never as good as the way Jin does it! (Forget about your date, go ahead, enjoy the black garlic drizzle!)\nWe also order a ramen that’s unique to this location- the Kakuni Ramen, which was very nice, the braised pork belly was mouthwatering!!\nThe only thing that bothered me a little was that the lighting is pretty dim upstairs, and the font size on the menu was hard to read under the dim lighting… time for reading glasses 🥲"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcFlMbjBnRRAB",
            "text": "Great spot for Ramen, complex flavors The service was perfect. However, they stop serving from 3PM to 5PM."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqODlUMHJBRRAB",
            "text": "I love it here but most of all, Jason is amazing! He knows my order and i’m always out just in time to make it back to work. Thank you Jason!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNjZUZzh3RRAB",
            "text": "Guys, this is disgusting.  Complaining about the taste, we still received a full check.\n\nThe broth of the ramen is unsaturated, the meat is very fatty, there is little filling.\n\nThe second course is tasteless, dry and unappetizing.\n\nDon't go here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCOEpLLW5BRRAB",
            "text": "Thank you guys Jesus & Amy to welcome me and my daughter and help us to have a joyful and pleasant meal! We will come back soon!!!!🥰 I love the appetizer and the spicy soup!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaem83MXpnRRAB",
            "text": "Went on a full Friday night and had a spectacular time. Appetizers were phenomenal and came with enough to share with the table. I recommend the dumplings and chicken chunks!\n\nMost importantly, we were so well attended by our waiter, Jesus. He was very accommodating with our dietary restrictions. He even explained the menu to us with patience and kindness. Excellent service in Jin Ramen. Thank you!"
        }
    ],
    "reviews_count": 72
}