{
    "name": "Max Soha",
    "place_id": "ChIJFwjwtWr2wokRzG0O5G5QpIY",
    "grid": "MN9",
    "address": "1274 Amsterdam Ave, New York, NY 10027, USA",
    "rating": 4.5,
    "user_ratings_total": 511,
    "phone_number": "(212) 531-2221",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVmRXaHhPRWh4VEVKMFFpMVBXbGhaY1dsU2VGRRAB",
            "text": "Just not very flavorful or filling."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMWVGOXNUSHBOUjFSV2FITmlOMEptWDFwSVlsRRAB",
            "text": "Great atmosphere. Sweet server. Disappointing food. Small servings of mediocre pasta and nice salad. The pasta was not homemade as promised. The pesto sauce was not authentic or good in any way."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaGNGZHBOMkZJU0VOWVoyOHpWRGRyWmpCRVlWRRAB",
            "text": "Great food and amazing service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCM1dFVTRURzFLYUcwNFNuRlBNMlpGTUhSYWRWRRAB",
            "text": "Me and my friends went for some food the restaurant has great vibes and the employees are so sweet and the food was amazing !."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUU1uVlhRMGsxTXpkT2JqTmhRVEUzV21Sa2JIYxAB",
            "text": "We’ve been eating at Max for over 15 years.  Love it 100%.  Totally yummy. And the nicest people."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbVExcDBTalZWYmpGMFVVeEJTVUl4TkhwUVNHYxAB",
            "text": "The overall experience was good. I brought my family for Sunday lunch. It was a bit tight, but we made it work. The food was simple but good. Definitely a spot if you're coming with 2-3 people and is a casual setting."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeWRrTndjbkV6Wlc5RldqSmtOWEZhTUZOZlJuYxAB",
            "text": "It's a little small inside but it's quaint. The only thing that sucks is the bathroom is downstairs and very small. So if you're older or handicap is not the place for you but the food is good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMkxWZHFZblJIZW14TFQzcFFkMjV3TmtwQ00xRRAB",
            "text": "Great food, pistachio and ricotta cake is amazing, staff are wonderful! Lovely, relaxed atmosphere too."
        },
        {
            "date": "3달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWGJubHdWV2RRUTNFNFdXeDBkWEYwTUhKeFdIYxAB",
            "text": "墨魚義大利麵很好吃，海鮮味十足。餐廳氣氛很舒適，如果在附近推薦來吃，但不用特地跑來～"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGc1h6ZzBiRWxMYkRWdmJVbHRiV0ZWVVhCRmJIYxAB",
            "text": "Great Italian spot in the neighborhood. Only complaint is chicken was a bit dry. Other than that great food and service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGU1pqbE5jRTh5WVV4aFFYVnJabGQ2Ym1SamFsRRAB",
            "text": "This restaurant is very awful.I ordered carbonara but was served a pollo mode. Also I ordered my pasta al dente but it was too soft like a baby food, and so disgusting I couldn't eat it. I wasn't planning on tipping because terrible service, but when I got the bill,they told me the tip is included already 20%. Not acceptable with this service and quality. This is a restaurant you should not go to.I just wasted my time and money."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cll6Wm5UaTEyYmt0WmRuZENURUZGYmpNd2MxRRAB",
            "text": "Very weak air conditioning, food portions incredibly small, and had no plastic cutlery for me to take the food out of the hot restaurant to my hotel room."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUFUyTTNiVVJITFRsdFZFeElYMW8xY1ZaUlZrRRAB",
            "text": "This is such a cute restaurant for late breakfast or brunch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTmExcEJjVGRyVVhOQlVtZG1abUZLV1hOVlNWRRAB",
            "text": "wonderfully authentic little Italian joint"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cmNrZFFlRUZsY3kxU1NrTXhUM0ZoUzNsRmVHYxAB",
            "text": "I come here almost all the time to eat breakfast as a student. It’s such a cute ambience cafe and I love your breakfast. The staff are very kind and especially the eggs and coffee here are so good. Support your local business ❤️☀️🍊"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWVFtbFNTM1U1ZEc5VGJtRnFjWFpqVkZCS2VIYxAB",
            "text": "Wonderful dinner menu and cozy neighborhood environment.  Nick is a tremendous server."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMdXAxdXJqMDlyNnV3RRAB",
            "text": "Decent food for lunch. We went there on a Sunday and had a beet salad with chicken which was a bit bland and nothing special. Had the pasta with tomato sauce which was decent and the lasagna which was quite good. It's average food for a quick lunch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKdjk3dDZfenQ3blZREAE",
            "text": "Rushed service, mediocre food and small salads."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWF8zNXJidU5EeW53RRAB",
            "text": "Beautiful and reasonably priced pasta unlike everywhere else."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKT3YwcFd3Z05icURREAE",
            "text": "I live next to Max Soha. I enjoy sitting outdoor at the happy hour. The pasta dishes cost $12 each and the drinks are as low as $5.\n\nTheir service could be better. I stood outside for 10 min before the waiter came. He was not friendly, and he made me feel unwelcoming."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb0tINzlRRRAB",
            "text": "nice and cute place with super delicious food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvckktSXhnRRAB",
            "text": "Loved the pasta and salad that I ordered. My friend ordered the lasagne (again) and also enjoyed that. Definitely coming back.\n\nMy only issue was when I first arrived, I informed the host that XXX had placed the reservation, and that I did not see her. There was an outdoor sitting area, but it was not visible from where we were standing. So I asked if he could check if she had arrived.\n\nHis response? \"Well, I don't know!\" (rolled eyes and all). I'd thought he had a tablet or computer he could guess. Even if no, the reply was unprofessional and most unexpected.\n\nOur waiter was also a little too pushy on the wines. My friend had a glass, but I was not drinking that night - the waiter kept asking me WHY I was not drinking throughout the night. The joke wore off quickly.\n\nI hope I just got unlucky that night, service-wise."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcU5pT2ZREAE",
            "text": "friendly staff, delicious food. great for breakfast and lunch. Highly recommended. I had their lunch spaghetti with vegetables (topped with shrimps). My friend had avocado solmon toast. All amazing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bWJTM0xREAE",
            "text": "Been going here for a few years and it's all fantastic. No notes, it's a great little place with incredible food and great service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNVBmQVVnEAE",
            "text": "Wow wow wow, what a spectacular gem in Harlem! We had a great bday dinner, had chicken parm , fettuccine pesto shrimp pasta and chicken risotto. Outstanding service, food, desserts. Let me tell you, every single dessert is light, decadent, just enough sweet. We had chocolate moose cake, hazelnut cream cake and my favorite banana Nutella gelato with cafe lattes. You won't be disappointed, come and support. Thank you so much Nick"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbWJtZktREAE",
            "text": "Splendid lasagna, though size was small. Cheesecake similar. Background music somewhat too loud for our taste. My date said that years ago, servings were larger. Oh, and price was a bit high considering the quantity."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRLVBUQmdBRRAB",
            "text": "Excellent food and service but the place is a bit congested."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBb0t6VWV3EAE",
            "text": "We came in for tea and a small bite to eat. The rustic eggs were absolutely amazing. The atmosphere was calm yet invigorating. Lily, our server was so attentive and nice! Definitely recommend"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaEozMUhREAE",
            "text": "8 people. Food came very fast. Lasagna was fantastic. Tiramisu was even better!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfLUoza0lBEAE",
            "text": "Delicious food but above all some of the best service I’ve ever received at a restaurant, my party of 6 felt so comfortable and thoroughly enjoyed our brunch as if we were at home. Thanks Lily and Juan for your excellent attention!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmZzZtaWlnRRAB",
            "text": "Italian classics.Staff is so nice. I’d be there all the time if I lived in the neighborhood."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cGR1dER3EAE",
            "text": "We love Max Soha. Our trip to NY was made extra special by our exquisite breakfasts. Amazing French Toast and coffee. Looked after by our host and his staff. What a treat. Thank you!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeF9LTEZREAE",
            "text": "치킨 파니니 너무너무 맛있구여 런치에 원래 파스타 없는데 스페셜 메뉴로 10달러 메뉴로 파스타 있음. 시켰는데 존맛. 학교 근처라 그런지 맛있고 가격 좋아요. 분위기도 진짜*10 좋고 당일날 주문 받던 아주머니 존착!!! 🫰🏻 커피도 신기하게 한국에서 먹는 커피 맛남요 다들 여기 가세용❤️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMnZfd0JnEAE",
            "text": "The food was delicious and the service was good, but don't bother taking anyone for their birthday. Not only did I call ahead of time to let them know, but I also had to tell them again in person so that they could arrange something for my partner. (Of course, the person that I spoke to over the phone did not communicate this with the other staff). Even then they couldn't even simply write a happy birthday or even an hbd on the dessert.  I was highly disappointed in that being that that was the most important aspect of the night."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNjZUNkZnEAE",
            "text": "Great food, cool atmosphere."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMk9XQUlREAE",
            "text": "Ein sehr gutes Café auf der Hauptstraße."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdktHSkJBEAE",
            "text": "Great pasta and Tiramisu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NWZUU2d3RRAB",
            "text": "Amazing little Italian restaurant with a great list of rotating specials"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicUx1LWJnEAE",
            "text": "Absolutely best Italian food amazing service great atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6a3UzeXNRRRAB",
            "text": "Good pasta and lasagna. Service is not so good, but ok"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMTUzUklREAE",
            "text": "Very nice and helpful staff 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbGJQaWpRRRAB",
            "text": "Wonderful spot in the Columbia neighborhood! Very attentive staff, food is really good and prices amazing for nyc! We love coming here."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcXVhLWRBEAE",
            "text": "Locale molto carino e caffè buonissimo."
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdUxpUjV3RRAB",
            "text": "Świetna, przemiła obsługa, fajna atmosfera. Pyszne jedzenie. Polecamy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENXVuTkVnEAE",
            "text": "The place is small, but the tables are not bunched to close to each other.\nThe food & service were fantastic.\nI will definitely keep going back until I have had every menu item."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxNExtNHpnRRAB",
            "text": "Amazing gem with very affordable lunch options. Everything was perfect every time I went."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkeEpTZzFRRRAB",
            "text": "Enjoyed the eggplant parmigiana and pistachio profiteroles! Delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkZ1B1VDNnRRAB",
            "text": "Nice and  cozy restaurant …. I expected a bit bigger portions however food was tasty"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkOWFYVEZnEAE",
            "text": "Really not good pasta. We ordered lamb and bolognaise sauce pastas. Very disappointing. It was no lamb meat in the pasta or sauce. Bolognaise pasta was tasteless. Really don’t understand the good reviews???Also small portions for the price and it’s not cheap considering the quality and size. Much better Italian pasta for the same price in the neighbourhood. As someone said, go somewhere else. The place is small but cozy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMFBUQ2JBEAE",
            "text": "My partner and I went here for lunch today. At the end of our meal, we were stared at by the female waitress whom we had while paying. She proceeded to throw my card on the table after seeing we weren't tipping more than 15%. It was unprofessional and made everyone involved uncomfortable.\n\nThere were zero to little service interactions, so what did she expect? She didn't offer us water when we sat down. We asked and poured our own water after waiting a while. She didn't bring out our food. Someone else did. Heck, we don't even know her name 'cause there was no introduction! If there was barely any service, why would we tip more?\n\nIt was also just plain rude to stare while a customer is paying, not sure if it's an NYC thing because I haven't seen it in Cali or elsewhere. Anyways, we won't be pressured in forking over more than what's fair just 'cause we're getting stared at. It only incentivizes us to tip less next time 'cause tipping is not an obligation, and it's really been getting out of control in our country.\n\nJust a shame since the food was pretty good, but we probably won't dine there again."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdnFMSFdBEAE",
            "text": "Haven't been here since early last year. This is my new regular now.\n\nAfter going to Via Carota yesterday and being extremely disappointed I wanted to come back to Max Soha and see if my first impression was blinded by not having tried many restaurants in NY at that time.\n\nWith my wife we had 2 pasta specials, 1 bruschetta and 2 desserts and I have to say everything was extremely superior to the highly hyped Via Carota (not to mention price friendly).\n\nPastas were extremely good and the desserts were impressive...would highly benefit from having more cocktails though!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoc3BialhBEAE",
            "text": "Came here as a group of 5 people. We got a couple salads, pasta dishes and the salmon. It was very tasty and well cooked."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZMTRLTDhBRRAB",
            "text": "Delicious Italian restaurant. The lasagna may be better if it has a thinner pasta. The salad was good, but nothing spectacular, just salad. The desserts were really good. We have a creme brulee and a mango cake."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdmJEYnl3RRAB",
            "text": "I really hope no one finds this gem ever — great vibe, great homemade pasta specials, great daily fresh juice, lovely furnitures, staff and music. Woah. I will come every night if I can. But again, I really hope no one finds this place ever, so I can keep it to my heart."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5LS11MklBEAE",
            "text": "Wonderful food. Very unique pasta smell and taste. Very surprised to have a powerful sensory experience from takeout food. Much recommended!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJbVpmQnlRRRAB",
            "text": "13/10 this place will blow your socks off. The three of us couldn't decide on 3 entrees so we got four. The seafood risotto was today's special and it was exquisite. We also got lasagna, black seafood linguine, and linguine calabrese. Would 100% recommend you check this place out"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlME1yRm1RRRAB",
            "text": "Ordered the lamb ragu pasta which was absolutely fantastic – pasta was cooked just nicely and the lamb was so tender it melted in my mouth. However, servers were pretty impolite and uninterested in service."
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxek5QeE5REAE",
            "text": "Świetna, wyrazista kuchnia. Dana doskonale przyprawione. Sernik pistacjowy obłędny🥰"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRd002dXp3RRAB",
            "text": "The gnocchi is really delicious! And the service is good and decoration is comfortable. We also took house tea which is less sweet than I expected. The restaurant is cash only so you need to notice it and bring enough cash."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad2RtYUJ3EAE",
            "text": "Cute and quaint place. Lunch pasta portion was really small though, felt like kids size and was hungry really quickly. Pasta taste-wise was quite authentic."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aXVtYXB3RRAB",
            "text": "I have been to Max Soha three times now. The first two times the experience was great and the wait staff was very attentive and kind. However when I went there on Saturday (June 3) the white lady server was not only very impolite but didn’t even come once to our table despite us calling her over and over again. After seeing that we are asking for assistance repeatedly she just decided to send the person in the bar instead.\n\nAlso the Chai Tea latte on this specific day tasted like sweet milk. I couldn’t taste the chai at all. Since the waitress wasn’t showing up I had to go to the bar to request someone to make my chai stronger and the person just added some tea concentrate in front of me and said that it was fixed."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbmU3U3hnRRAB",
            "text": "Love this place. the pasta is AMAZING--the penne alla vodka, the gnocchi, and the eggplant tomato pasta. The service is attentive and the prices are so reasonable and a breath of fresh air for city prices. Takeout is also very quick and efficient. Definitely recommend if you are in the Morningside Heights area."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNcGNQTXVBRRAB",
            "text": "Had a reasonably good meal at Max Soha.  What really stood out was the coffee ($2), which was strong and good tasting, and the diced eggplant in tomato sauce and basil ($6.95).  That was a scrumptious dish.  It went well with the nicely toasted bread that came with it.  The grilled mixed vegetables ($9.95) were OK.  A bit thin and not much to munch on.  They were in a good tasting oil.  That dish was not worth the money.  My dining companion had the spinach pappardelle con funghi ($13.95) (crimini mushrooms & truffle-cream sauce) that he said was OK and at moments good. The bread that came with the meal was good.  It came with a salsa.  I was disappointed in the salad offerings which for $11.95 didn’t offer much.  I would have liked to have ordered a dinner sized salad, but they had maybe 3 ingredients.\n\nNice setting.  Attentive staff.  Has a neighborhood feel to it."
        },
        {
            "date": "수정일: 7년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3c1pDRDNRRRAB",
            "text": "Ne pas se fier à l’extérieur, rentrez et vous serez charmés! Authentique petite trattoria! La lasagne est bien mais les pâtes carbonara sont SUCCULENTES! Belle expérience suggérée par le guide Cartoville! En plus, un excellent choix de bouteilles de vin à seulement 20$."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnOV9XSWVREAE",
            "text": "Great atmosphere and pasta!  It took me back to my vacation to Italy.  Service was friendly and desserts were yummy! Lost one star because they are \"cash only\"."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bE9INl9RRRAB",
            "text": "The food here was INCREDIBLE. The drinks were good but not great, but the food. Holy mother the food. I will be eating here at least once a week for my remaining time in NYC."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwM2JLSUdBEAE",
            "text": "Delicious food. Excellent service. Cozy setting.  Nice music."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbC16ekxnEAE",
            "text": "Beet salad was amazing - lamb ragu, exquisite!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dEo2N3FRRRAB",
            "text": "I came in for lunch on a Thursday with a friend and had a great meal. I ordered the Chipotle Chicken Panini and my friend ordered their pasta special. The server was very attentive and the food was delicious. Even though there was a couple at the table next to us, we were able to have conversations without it feeling like we were raising our voices despite the crowded dining room. The prices are extremely reasonable and I look forward to coming back very soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSN19Xd2pRRRAB",
            "text": "Very cute place, good prices. The people who work there are nice. 3 stars because the pasta I ordered (spaghetti with ragu) was overcooked and the sauce lacked flavor and salt- disappointing. The beet salad was good. If they could make their pasta better I would be going back all the time! Have also been for brunch, which is nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1a1BYYUpnEAE",
            "text": "Best pasta I’ve eaten in ages! Had the daily special of spicy nduja sausage, mushrooms, a little cream - amazing. My husband had the carbonara and loved it. Good beer and wine selection too. Nice cozy and familiar atmosphere. My kind of place!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBeHZ1aWJ3EAE",
            "text": "Great italian place not far from Columbia, good options and affordable. Nice staff but only accept cash which is odd in the 21st century."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMU5yaC1RRRAB",
            "text": "It is a very beautiful place, you can appreciate very rich dishes and not very expensive, you can also try good wines!Desserts are made at home! the best of the day!"
        }
    ],
    "reviews_count": 73
}