{
    "name": "Toast 125",
    "place_id": "ChIJbVAZC2r2wokRaRaEKh56x8U",
    "grid": "MN9",
    "address": "3157 Broadway, New York, NY 10027, USA",
    "rating": 4.3,
    "user_ratings_total": 753,
    "phone_number": "(212) 662-1144",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOeU5rWnRZMlJqZEdacVVITmZWVk5JUVZCbGIzYxAB",
            "text": "My co workers and I came to this place for lunch break. Cute place and to be honest, I enjoyed their food. I gotten their lunch special, it comes with a half chicken sandwich (fried or grilled) and Cesar salad. They have 2 separate Happy Hours! The daily 4:00 - 7:00 PM - including Drinks & Bites. Nights 10pm - Close, Mon-Fri Drinks Only."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdVpVMVplV1Y1VG1KRFVEWkJTVUo1YzNWWk5XYxAB",
            "text": "Lovely little place to eat. Love the mac and cheese, it was war and creamy. Worth the time and effort. Not too far from Columbia University."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MWVqWTJRMlJvVWtkek4yUm5ka1EwTUdVMGVYYxAB",
            "text": "Very reliably good food and service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WWQwTXdZM0oyWTFWSVpuZ3dabWhzYURFelFsRRAB",
            "text": "I had lunch here and ordered BBQ pulled pork sandwich with a  Caesar salad. The restaurant is cozy and welcoming - a place where neighbors gather and enjoy a good time. The food was great - my friend had the chicken penne, which was also delicious.\nThe Servers were friendly, and we really enjoyed our visit! Plus, they also have a lovely terrace!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQmQzTnlVbGxoZDB4cmFGcFhkbVZMVGkxaE5YYxAB",
            "text": "I’m from Iowa and this place is amazing. I’ve been through many places in NYC with a similar background and style and this place is the best. The atmosphere at a minimum is 6 stars and the service was even better. The food topped it all with the cherry on top. Our server was amazing and helped our larger group out perfectly. Food is slightly on the higher end of expense but you get exactly if not better than what you pay for. 100% worth it and 100% reccomend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTFpXcExVSE5mVDBKTmVHTjJTazVIVWpGNWMwRRAB",
            "text": "Genuinely such a great spot to eat on a semi regular basis. Been here multiple times and the food is always enjoyable and more importantly it tastes fresh. Another awesome thing about this location is that the meals all taste just as good as they look! The fries really are that crispy, the salad really is that balanced, and both the entrees really are the star of the show.\nI would have liked to see the waiter be more approachable and attentive but he’s also the only one so it’s understandable!\nLast thing is that it is pretty hot in here. I’m not sure if the AC was down, but New York heat mixed with hot served food would really benefit from having a cooler environment."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaFZDMVdjVE5IZVd4MlNtdGlSWFJqTkVkSFdFRRAB",
            "text": "Buena comida buen ambiente recomendable"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOWDF2YUx6X18zZXRnRRAB",
            "text": "Been our staple for 10 years now. Never fails to hit the spot - due to the variety of the menu Toast fits every mood! Service/servers are kind, attentive, and personable."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJVGlfdkdJc082UEdREAE",
            "text": "I usually come by for Buffalo Wings & other foods and I must say HUGE Shoutout to Ruth (Waitress) & the manager ( older guy with glasses ) I should remember his name lol, but let me let everyone know! These 2 give amazing service!!  from the manager he always fixes any little mistakes or issues, always on point with customers and restaurant overall!! & Ruth always greeting and getting the right orders and delivering safe and delicious foods! Love Toast and I will continue to come and enjoy it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNZnB4Y1RhaHQtdEVREAE",
            "text": "Visited Toast 125 at 3157 Broadway for the second time. Overall, it's a nice spot with a good vibe. The Mexican burger was solid; juicy and flavorful; but like most of the menu, priced on the higher side. Then again, that's consistent with the restaurant's overall pricing.\n\nThe ambiance was pleasant; low-level music playing boleros and other Spanish classics really set a cozy, relaxed mood. We checked out the special lunch prices, but honestly, they didn't make much sense to us. We ended up ordering from the regular entrée menu, which felt like a better value.\n\nOne thing that caught our attention was the drink pricing; beer was only $2 more than a soda, so it felt like a better deal than paying high for soft drinks.\n\nService-wise, this is where they dropped the ball. It took quite a while to get our appetizers, and after that, we barely got any attention from the staff. That part of the experience really stood out in a negative way.\n\nOverall, good food and ambiance, but the service needs serious improvement."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN2FDVVBREAE",
            "text": "This is our go to with kids, even though it’s great as a pub as well. During old people dinner it’s super laid back and no one cares if your toddler is annoying (other than you).  Nothing flash, just a solid regular . At night it has sports and a pub feel."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eDl1eUtBEAE",
            "text": "Food is always good here and they serve all day breakfast options. I had the french toast and I love the strawberry butter it comes with. I also love the mac and cheese."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcmNMak53EAE",
            "text": "Really nice atmosphere. Great service. Great food. Easy to talk, music a little bit lower would be nice but yeah very nice place thank you.\nWhat a classy burger"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbWNtcEVREAE",
            "text": "One of the best Cuban sandwiches I’ve ever had. Also you get your money’s worth. It’s amazing. Service was great, lunch was busy so it lagged but  very friendly and the food came fast. Will be coming back asap"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBa2JEeXBnRRAB",
            "text": "This place is amazing the service was great. The waiter would be nearby and ready to answer any questions that I had about the food. The interior was so elegant it felt like an indoor picnic the exterior makes the place look like a ghost and you would never expect something like that to be there. I blame myself for choosing the wrong food, but everything else was worth."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M01lZDJ3RRAB",
            "text": "Came to toast for dinner and got the fish sandwich. It was pretty tasty and definitely big enough that I took home half for the next day"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYLU16dURREAE",
            "text": "The food and the service is exceptional. My wife and I love coming here and make it a point to have dinner here when we’re in the neighborhood. They have amazing happy hour options. We’ve tried most things from the menu and they’re all fantastic. Strongly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubDR1Nmh3RRAB",
            "text": "Very misleading - sign says $10 burger and beer, which seems too good to be true. Turns out it was! We were explained AFTER our check arrived that it’s a $10 burger if you buy a beer. The server admitted it was misleading but did nothing to rectify the situation. I even ordered by saying, “We’re going to have the $10 burger and beer!” As someone who works in the industry I find this incredibly sketchy and I will definitely not be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNE9XOGRnEAE",
            "text": "Saw flies in the kitchen, they got half of our orders wrong, when they came back with the “fixed” plates, they were completely unchanged, the servers were rude and even cursed as we spoke to them, had to ask multiple times for just two cups of water, and then again for straws, and this was overall a horrendous experience. They also have almost none of the items as they do online. Never coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeGVXalhREAE",
            "text": "I literally waited 40 minutes for a to go order of catfish in a half empty restaurant and watched other people eat in front of me waiting for a $15 sandwich…. And still had to pay for it. Never coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaXZPR0FREAE",
            "text": "Great place close to Columbia. Love the homey vibe. The burger was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINE8yWFRREAE",
            "text": "Salmon came out rare in the middle, and the manager got mad at the waitress because I didn't want the food .. he was scolding her in front of us as we ate our food so we could hear him and quit frankly he was being rude to us by saying we…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bFltQWdnRRAB",
            "text": "Enjoyed a really delicious and filling brunch with friends on a random Sunday. Walked right in around 12:30 with no wait! This place is such a neighborhood gem. Will be frequenting it often I presume!"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicHQzN3B3RRAB",
            "text": "Brunch ottimo e servizio perfetto. Ordinate le uova con formaggio, bacon e french toast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaXZQaHBnRRAB",
            "text": "Lamb burger\nCheesey fries with pulled pork\nOMG"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMblBtdEt3EAE",
            "text": "Decent eggs Benedict, friendly service, and a nice atmosphere for a brunch or happy hour."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6dFBIMER3EAE",
            "text": "Family vibe,  Never had a bad dish or service...I go daily when I'm in the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6ODVQSUh3EAE",
            "text": "Like a warm hug!!"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OGNDREt3EAE",
            "text": "Wir hatten Lust auf Wein und wir haben einen fantastischen Sauvignon blanc vom Mount Reily erhalten. Schöne Atmosphäre drinnen und draussen."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaHIycHhBRRAB",
            "text": "%20 Large group quantity for 2 people?"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpdUlXUk93EAE",
            "text": "This staple, Morningside Heights neighborhood restaurant has been under new management and they’re doing an exceptional job. The day manager, Kevin, has really improved the bar’s craft beer draft list. I find it far superior than most trendy restaurants. Also, he has a super relaxed vibe and I’m always learning something new from him. After all, he is a proud graduate of UC Berkeley. And, Juan, the night manager, really cares about maintaining a high level of customer service, and he’s also fun to chat with. Further, the entire staff is very pleasant and will often engage you in a lighthearted, and sometimes in a deep, but worthwhile conversation (I’m thinking of Cody). Further, the food is excellent! I call it, “gourmet comfort food.” And the liquor selections and cocktails are also very, very good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdnF6eG5BRRAB",
            "text": "If you are native to Morningside Heights or a student of Columbia…. Be warned this establishment does not welcome diversity and I will henceforth not be dining, drinking or ordering from Toast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbDhEQnp3RRAB",
            "text": "The happy hour is really\nAmazing !! I got so much food/drinks  and the mac and cheese was really good and everyone made sure we was good and comfortable.wing and burgers with a good happy hour making the everything under 100 !! You guys need to try it and it's right off the train 1 train on 125 easy to get to. Thanks for having us."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadC0tTWtBRRAB",
            "text": "Cozy place, tasty butter sweet French toast & yummy big omelette! Strawberry lemonade very sour but decent. Interested in coming back for happy hour 4-7pm everyday!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5c0szSjJBRRAB",
            "text": "So grateful to the woman on the train who told us about this gem.\nThe portions were enormous, and that BBQ salad may be the best thing I ate all week.  My husband loves his steak sando and the kid (ofc) loved the Mac and cheese.\nBUT.... The service. Man Gabrielle shot it right out of the park. So attentive and courteous but when she came running after us because my kid left her hat and gloves, that was just the cherry on top."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5OGVHUnFnRRAB",
            "text": "Food was under cook for what I requested. Fries look old .only drink was amazin.aftee I stated eating notice the blood on my burger"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5LU5fTlVnEAE",
            "text": "Amazing! Missed this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkME5qcE93EAE",
            "text": "Rude workers, not worth walking in the door with Craftsman right next door"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0NktqZWhBRRAB",
            "text": "Great times"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOcGJpbTZnRRAB",
            "text": "Slowly becoming one of my favorite gems in the UWS. I sat at the bar the last few times I went. The crowd is always friendly, usually a bit older, though I've seen college kids come when school's in session. The bartenders have always been very polite and fun to talk to. I drank a bit last night and remembered they served me water along with the last few drinks without even asking—something instinctive I'm appreciative of because I didn't wake up with a hangover, haha. The Mexican burger is my recommendation, and they make a very good dirty martini!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxeGU2RU93EAE",
            "text": "Waiter was awesome!! Food was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxa0x5amlRRRAB",
            "text": "thnx for an amazing date night! service was always accessible & didn't feel rushed one bit! pardon me as i forgot the workers names but what a team! our drinks were brought BY the bartender to our table with each drink! while our server joined in on laughs throughout the night with us! food portions were perfect and not one issue with any other kitchen items."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWX09lWXhBRRAB",
            "text": "Shrimp and avocado salad excellent lots of shrimp and avocado, nice crisp lettuce lemon vinegarett dressing was bvery good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsc2RqeXNBRRAB",
            "text": "Perfect for a Friday after-school gathering."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZ2FPcjNBRRAB",
            "text": "A very friendly pub with solid food and very good beer choices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseXRlMzhRRRAB",
            "text": "My first time here and I enjoyed everything! The food, the service, and the atmosphere!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLdnBiZlZnEAE",
            "text": "I always order Chicken Caesar wrap I pay $4 for extra meat it wasn't enough"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGcGN6T2xBRRAB",
            "text": "The food was really good. Loved the people. Our server was amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGeGJtNDJnRRAB",
            "text": "This is a delicate little local, with folks popping in and out to have a nice pint and/or a very reasonably priced meal. I was there at lunch and then again at dinner. The lunch crowd had moms with push chairs, dads with pushchairs,  older gentlemen their for a chat and couples there for at least a chat. It's diversity friendly but also just friendly, welcoming and place to enjoy life.  My son's college is near by, it's going to be a place I go to when I visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1cVp1SEx3EAE",
            "text": "They won't let you send your drink back if you don't like it. They force you to buy it. Make sure you order something you know you'll like!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMV9TRVd3EAE",
            "text": "The order was Mozzarella Sticks, Popcorn Shrimps 16 pieces, Beyond Burger and Lamb burger. Really enjoyed the starters along with the burgers. I recommend trying the pesto that came with the Lamb burger."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBZ0llS3NBRRAB",
            "text": "Live jazz on Fridays. I thought the food was quite bland, but salt and pepper helped a little. The Mac and cheese is extremely cheesy, rather than creamy, and was great. The Caesar salad was not good, really. It just had very little flavor and tasted almost like plain lettuce. It could use grated cheese and grated pepper. If you have Caesar salad on your menu really guys, invest in $4 pepper grinders for the tables, if not a couple server grinders. The little salt & pepper matching glass sprinkle things aren't cutting it. Hot sauce would be cool too. Not bad overall, the jazz was FANTASTIC. I heard it while I was walking by and changed my plans, had a drink and dinner there, instead. Live jazz is really what makes this place stand out from the three other restaurants within 50 feet. I never would have glanced at it otherwise but I'm definitely going back tonight."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNnBqV0xREAE",
            "text": "French onion soup special was very tasty, served hot and delicious. French burger medium rare did not disappoint, juicy and fresh. Great lunch spot! Covid friendly."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvOEpPb0RBEAE",
            "text": "Whether you are brunching, lunching, or having dinner, this warm spot in Harlem will satisfy you. Friendly wait staff, great vibe, great menu - with GF friendly options.\n\nA great spot to bring an old friend to catch up. Right off the 1 train. One of my favorite places!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNac0xuSnZRRRAB",
            "text": "Split a reuben sandwich. The corned beef was out of this world.; tender, juicy and tasty. They have a good selection of draft beers and interesting cocktail. Breakfast all day and a brunch menu. Try the ketchup, no kidding."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MmJ1N25BRRAB",
            "text": "Fantastic little spot! The hamburger and fries was amazing and the bartenders were very friendly. Would absolutely stop in again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNUtpTl93RRAB",
            "text": "Extremely disappointed. Ordered eggs florentine to go, and got this… sharp contrast with the photo on the menu. No salad either. Does takeout get subpar food?"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaa3ZiY09REAE",
            "text": "Genial! Un oasis en medio del desierto para sentarse a tomar una cerveza tranquilo y picar algo o comer directamente. La atención del personal inmejorable. Gran variedad de cervezas."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaTY2RTlnRRAB",
            "text": "Pretty good. The waitstaff was fast and friendly and prompt. Meatloaf was cold inside and had a cat food texture that was hard to ignore. Wings were okay. Will try again just other stuff."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZajRYaTh3RRAB",
            "text": "Great atmosphere and staff.\nI will come back for other dishes.\n\nNew visit - dinner time.\nFood was great but wine was terrible. It’s unfortunate. I want to come back but I don’t think I will."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVMlpUMF9BRRAB",
            "text": "The restaurant was amazing! We went for Brunch. I had a Beermosa for $7 and my friend had a Mimosa for $6. I ordered French Toast. It was very thick and fluffy. I initially thought the serving size was going to be small, but it ended up being more than I could eat. Service was prompt and our waitress checked in on us frequently."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyX09lRlNREAE",
            "text": "This is a spot where you can engage in conversation if you please, or sit quietly in your space. The crowd is a mixture of Columbia and MSM students and neighborhood residents. The beers constantly change and the food is good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bk95QXl3RRAB",
            "text": "Wonderful service. Staff was very kind and accommodating of our group's size. The atmosphere was nice and the temperature was comfortable on a hot and humid day. Would definitely recommend!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3enBxbkZREAE",
            "text": "Great local spot.  Love the shrimp salad, fresh cut fries and spiked apple cider!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBci1UdGx3RRAB",
            "text": "I liked the 12oz ribe eye steak so much, it was so juicy and tasty, it took a bit long to prepare it and they gave me the steak knive  like 10 min after they brought the food, but ultimately the food was great and the staff were well-mannered."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKa1B5WmR3EAE",
            "text": "My husband and I have dined here before. Food never disappoints! We always enjoy it. TODAY WAS ANOTHER STORY..THE BARTENDER AND WAITRESS WAS OUTSIDE PETTING A DOG.\nTHEN CAME BACK INSIDE AND KEPT SERVING FOOD AND DRINKS..Both did not wash their hands! YUCK!\nWhen our food was bought to us by the same bartender. I was totally grossed out! Then she had an attitude when I said something. I love dogs..but not in my food! Neither ever washed their hands after petting that dog outside. It was just nasty! Do better! We spent $100.00 for dog food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCZ3ByWHRnRRAB",
            "text": "Buffalo chicken Mac and cheese and a brownie a la mode. Also the staff were really nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMteXQ2emRBEAE",
            "text": "I used to love this place. The service was spot on, the food was good. I wish that was still the case. I went in with a group of 8 people for lunch. I ordered a buffalo chicken salad and a coke. 40 minutes I received a barbecue chicken salad and my coke was still on the way. I had to eat quickly as I was there for lunch and had only an hour. In my last few bites, we asked for the check. My total was told to me and not shown, $26!! I pay it with a tip that was fair for the service only to find that the gratuity was already included as we were a “large party”.. we were not told this and everyone had given an additional tip. I will have to rethink coming here…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNXM2aHVRRRAB",
            "text": "I remember coming here when I was in high school and this is my second time here 39 years later and let me tell you the wings and the cheese fries are so good. Even the drinks are so good and even strong Michael is such a nice person. And Jean is also a nice person. I will definitely be back for happy hour. 🤗🥂🍗"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNjRQVnF3RRAB",
            "text": "Highly recommend! I decided to try this place out based on the reviews and the menu. The menu is great! Nice variety of dishes to choose from. My partner and I arrived for brunch on the cusp of dinner service and they offered us both. We…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURac3REaV9BRRAB",
            "text": "Toast holds a special spot in my heart. A childhood restaurant for my partner and a spot for multiple dates in the early stages of our relationship. The happy hour is solid and the drinks are strong and cheap. For food, I recommend getting multiple appetizers and sharing those, the chicken fingers are a must! Although it is out of the way, we make time to eat here every so often."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdlpfUnNnRRAB",
            "text": "From the outside looking in, I would have never imagined eating at this place (and I live right next door). I took a chance one day... And I must say, I was pleasantly surprised. The service is great, the food is even better, the prices are perfect! They are clean, friendly and you don't have to wait 50 years for your order. They usually have specials, like a pasta night, or a pretty cool brunch. I Love this place.\nMy last visit here, I waited for my food for what felt like an hour! (I was really hungry). Turns out, the system glitched and they didn't capture my order. The staff was very apologetic and they discounted my order 50%. Nevertheless, the food was great as always. Worth the wait!\nGood food√\nWeekday dinner√\nBrunch√\nBar√\nTV/Sports√\nAffordable√"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2a2RmUmVBEAE",
            "text": "The food is always consistently good.  I personally love their grilled salmon and rice pilaf - or, their chicken penne dish.  The atmosphere is perfect for casual dining.  And, the staff is wonderfully friendly.  Oh, and in the summer time they make the greatest frozen slushy margaritas.  Toast is definitely a family favorite."
        }
    ],
    "reviews_count": 73
}