{
    "name": "The Expat",
    "place_id": "ChIJ-VhG3uH3wokRfYkcXWjtglw",
    "grid": "MN9",
    "address": "64 Tiemann Pl, New York, NY 10027, USA",
    "rating": 4.5,
    "user_ratings_total": 514,
    "phone_number": "(646) 410-2922",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTVp6SkRaMVY1VHpZMGNsOXdaR2RPYlRReldXYxAB",
            "text": "Cozy hole in the wall Asian spot with great drinks and good music :)"
        },
        {
            "date": "3주 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMk5YRklZMFUzVGtwTk1tUXlRUzEwWjFoR1RWRRAB",
            "text": "Coole Bar mit vielen MSM Studenten. Leckeres Essen."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TWJuQmlOMFUzVDNsNFMwWlFlWGt6UXpOclVFRRAB",
            "text": "Amazing place, shout out to Cam for phenomenal service,  loved the food and the service is above and beyond!! GEM!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWmFsbFpUa2RvYW1oTk0wbEJhakZMV21oaVlVRRAB",
            "text": "Turned away at 10:20p on a Saturday night because it was “closed” but their bar was completely full, kitchen hadn’t even closed yet, and officially they close at 11:59p on Saturday evenings. Took our business around the corner to the Craftsmen instead."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNldISmlObWRwVkRoVWNrcEZUWFkxTTFOZmIwRRAB",
            "text": "Great atmosphere and genuinely attentive service. The Lemon Pepper Curry wings are a standout. They're unique, crispy, and packed with flavor. Other favorites: the Curry Chicken Quesadilla and the Char Siu BBQ Pork Fried Rice. If you’re having a cocktail and like bourbon, order the Super Strawberry Smash Bros. All around a fantastic spot. I’ll be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxblkweFNWbHBNWjJadVRFWmxSRlF3TmxORmVXYxAB",
            "text": "Great spot for a happy hour (11:30 AM - 6:30 PM Monday through Friday and 4 PM - 6 PM on Saturday and Sunday)! The cauliflower wings are a must order! . My favorite drink on their happy hour menu is the Kumqat Spritz. Note that it can easily get crowded especially when there's an event hosted by the University."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWGJsWnlWWFZGYnpaRWJqWk5ZazFaYkZsTE1HYxAB",
            "text": "Delicious brunch menu it was hard to make a choice when there were so many amazing options"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnd1JYQTBTMjF2YWw5bWJWOVRjRXhOVlVKTk4xRRAB",
            "text": "I guess it’s a hit or miss with this place, consistency is not their forte."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaGNsaG5hVnBLTnpNMWR6VndTWGRzV2xkV2NrRRAB",
            "text": "Lemon chicken and drinks were amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NlV6VjZOMmg0VVUxaE1IaHhkR3hYUm5sVFNYYxAB",
            "text": "Great atmosphere, cocktails, food and reasonable prices too!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSlRVTmxVMnBtZUVSNE1XOUlhblEyU1ZRM1RtYxAB",
            "text": "My favorite dining experience in NY. Great food, lovely service, and an awesome vibe. Cheers-like pub meets fantastic SE Asian fusion food. Flo and Katie are exceptional servers and add to the neighborly experience everyone receives here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRllUQkJPV3N3WjNsaGQyOTRPQzFXVVMxQ1gwRRAB",
            "text": "Love their happy hour specials and overall vibe of the place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMlpsUjVabkpSTFdWS2NrdFpUR1pXUWxsaGRrRRAB",
            "text": "grand ole time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUE5YUm5WMUZhWVZwbFMwWnZkSGgwU2toZlVIYxAB",
            "text": "Tried ordering from this place tonight through Seamless— food was late so I tried calling and the restaurant’s phone doesn’t accept calls. Couldn’t get an update from the courier either so I ultimately canceled.\n\nEven beyond this, every time I try ordering the food (when it does come) is very late to leave the restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treE5VWXdNRFV4WlVaTFZsSkRaRFpyWlcxbmFuYxAB",
            "text": "The vibes here are wonderful. Great windows, fun seating, lots of plants, service is quick and kind, and great food options"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreE5YUkROak4yZWtGQk0yazROREowYzFvMFgxRRAB",
            "text": "Charming bar with friendly service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205ak9FSm1NamsyTFZoSWFGaFNiamhUVGxObVdVRRAB",
            "text": "Love the service and the food especially the lemon pepper Curry wings.. all who have I have bring  here  enjoyed the food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNFpGWlFOMTlPWW0xMk0xOWhXSHBNZFZkblNsRRAB",
            "text": "best place in the entire world"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTGIxbGhabmRrVUUxVmN6TTFVM1pQWTJnMmNHYxAB",
            "text": "The wings here are super delicious, we got the Thai sweet chili ones and a spicy mango salad. The mango salad was incredibly spicy I must say. But we overall liked this place. Can’t wait to try their brunch sometime, which I believe has a bottomless option."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUFlYSXdSMmxGV1RWNFFYVmlMV2xxYWtsVlFtYxAB",
            "text": "A quiet spot for fun, inventive food. I love biking up here from midtown for brunch"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUE5UaFhkRXRPUm1aUVJsa3lOVE10V1ZSbU1XYxAB",
            "text": "Fantastic brunch. Try the Vietnamese omelette, the Bahn Mi B.E.C., and the mochi waffle."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCV2QyVkJWbE10V1hkS01ucEZVbk14ZG1OVU9FRRAB",
            "text": "What an amazing find. If you’re uptown near Columbia and don’t know about this neighborhood gem you should. Really great environment, great food and friendly staff. The international pub every neighborhood should have"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMldrMUVlRmRPWkRsTVIwTnBZbEJvVG0xMk9XYxAB",
            "text": "Not vegan friendly. There are only 2 appetizers are are vegan. None of the entrées can be made vegan. When I called the restaurant, this woman initially told me that yes, some of the dishes can be made vegan. Then when I pointed out that none of the entrées have the vegan symbol, but that they have the vegetarian symbol, she basically just told me \"nevermind. Nothing can be made vegan for you.\" I asked if she could speak with the kitchen and she refused to. I felt like not only did this worker not know what she was talking about, she refused to put any effort into accommodating me. It's a shame because the 2 appetizers that are vegan sounded good. This person made me feel unwelcome here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdU40ZWZnbGFiSDFnRRAB",
            "text": "Nice neighborhood spot. Great food and beer selection. Servers are friendly as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPdUQ0dVdXekt6QzFBRRAB",
            "text": "One of my favorite spots to go to if I’m in the area. Great food, drinks, and staff."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVblppRHBRRRAB",
            "text": "Excellent"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dEo3bHl3RRAB",
            "text": "I loved the experience, ambiance, customer service,  and food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOMzBxdGJUdHJ2NjVBRRAB",
            "text": "This is the first time I've ever had a Pad Thai and not been satisfied. It was slimy, tasteless, and overall disgusting. I'm sure this place is fine as a college bar, but don't go here expecting good food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbTh1cXpZekxPVFVnEAE",
            "text": "We hosted a party for 30 people, plus some of our guests' young children, at The Expat. Renting out the bar area is a great option for groups of this size or smaller. They accommodated our dietary requests, including multiple vegetarian options and dairy+gluten-free options. Reasonably priced relative to other options in the area, with good food and drinks."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMkluV19nRRAB",
            "text": "Best spot in the neighborhood. Atmosphere is cozy before 7pm and lively most nights. Cauliflower wings are exquisite. The menu has good breadth. Only a few items fall short (i think the pad thai isn't the best), but you mostly can't go wrong. And they have Guinness now!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNjRTbmNBEAE",
            "text": "I had a disappointing experience here. After finishing my meal, the staff took my credit card to process the payment but didn’t bring back the receipt. I had to ask for it myself, and only then did I notice that a 22% tip had already been charged to my card — without my consent or any prior discussion.\n\nI did not authorize or sign for that tip amount. If an electronic signature was used, it definitely wasn’t mine. I believe customers should always have the opportunity to choose how much to tip, and adding a gratuity without any communication feels misleading.\n\nThat said, after I posted my initial review, the management reached out and kindly offered their email so I could contact them directly. I appreciate their willingness to listen and address the concern, and I respect that they took the time to respond thoughtfully.\n\nWhile the situation was frustrating, I hope it was just a one-time mistake. I truly wish them the best and hope they continue to grow with integrity and transparency."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNjRxdmxnRRAB",
            "text": "Food indeed became mushy and much different from how it used to"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LWFfWUxBEAE",
            "text": "Local student hangout wirh happy hour. Thai fusion. Really big portions; especially liked Lemongrass shrimp bowl."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3clk3RGtBRRAB",
            "text": "I been coming here pretty often in the past with my friends and had a good time because the vibes good and the food was good too, but I stop going for a while since the quality of the food kinda slipped. Lately I come back to give it another try and this gonna be my last time. My food was burnt so bad. Check the video I upload."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eFpYTXJ3RRAB",
            "text": "A lively place with great food and drinks. The staff are super nice."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eHJQLVV3EAE",
            "text": "The Expat is a gem. I love the style and vibe. The mix of grad students and locals is great and the prices are better. The food is genuinely creative, which is just a cherry on top."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRemVYcUJREAE",
            "text": "Fun place with yummy food and fabulous service!  Cameron our server was sweet, kind and knowledgeable. Went with all of her food and drink suggestions, and everything was a hit for all four of us! Will definitely go back and ask to sit in her section!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNlpIVk1BEAE",
            "text": "Great neighborhood treasure! Amazing Thai food. I had Singapore Noodles... top tier!\nBar is stellar. Our bartender,  Sarah an absolute delight and beautiful presence.\nDefinitely returning!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndnZPbHBRRRAB",
            "text": "The basil fried rice was amazing and so were the drinks. The staff is very attentive and friendly."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdUlQNEh3EAE",
            "text": "The Expat is a fantastic spot that never disappoints! I’ve been here several times, and every visit is consistently great. The food is delicious, and the service is excellent. The unique basement setting, with windows halfway visible, gives it a special charm with beautiful natural lighting. Highly recommend this hidden gem for both the atmosphere and the top-notch experience!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfc1B2RVVnEAE",
            "text": "I definitely recommend the fried tofu bites and Bahn mi smash burger. We went here for a friend's birthday and they were able to comfortably accommodate 10+ people without issues. The food was delicious, the staff was friendly and attentive to our party and the atmosphere was extremely warm and welcoming. This place is worth checking out. We had 3 cocktails, an appetizer, 2 sodas and two entrees and spent about $80. A VERY reasonable night out for 2"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyX09maDBnRRAB",
            "text": "Great little spot located a block away from Broadway. It doesn't get a lot of transient traffic which makes it a quiet place to visit. Love the cuisine here as well as the selection of alcohol."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M011LUdnEAE",
            "text": "A cute bar for meeting with friends or for a date. It’s great to go for happy hour to get drinks and snacks.\n\nI really like the chicken wings and the different flavorings they have."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNV96MjRnRRAB",
            "text": "STOP AND READ! I have been to over 30 Thai spots since approx 2010 and this place has the best spring rolls and most delicious chicken basil ever! It's really delicious! Please check it out. Has a big bar too but the food is seriously terrific."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM2Z5eXZRRRAB",
            "text": "This restaurant was recommend by several of my friends, I was hesitant to try it at first, but decide to give it a go.\n\nAs I entered, the host didn't greet me at all, I decided to sit at the bar since it was just me.\n\nThe female bartender was overwhelmed and scolded me when I asked for a menu, I assured her its not a problem since they were busy.\n\nWhen my food arrived I had to wait for utensils for few minutes, only to be given plastic fork because they ran out of their regular ones. Fine.\n\nThere was a large party that sat next to me that was extremely loud and pushed me away from my space, while going back and forth for food multiple times. I tried to reason with them by asking them to be more courteous of their surroundings, to my surprise they were apologetic but also didn't change their behavior.\n\nThe Thai fried rice that I ordered wasn't good, there was no flavor, and the chicken was undercooked. Fine, took it to go.\n\nAs I tried to finish my drink, a staff member almost took it away, this is when I decided to get up and pay my tab and leave.\n\nThe female bartender that didn't even serve me yelled at me in front of whole bar that next time I should tip.\n\nGirlie, you tip for service, not for attitude issues. Just because you can't handle stress and work you shouldn't take it out on other people. Also public shaming can lead to a lawsuit, look it up.\n\nIf you are LGBT person or a POC avoid this please, they clearly  don't want you there, nor your business.\n\nHope that the rude female bartender find a job that suits her attitude and zero respect for people."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzamZlY3R3RRAB",
            "text": "Good food, service and hospitality"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbzY3UGpnRRAB",
            "text": "A great local place to have a drink."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzX2RxbnFnRRAB",
            "text": "Yesterday I went there and was given the option of two tables. I opted for the table, closest to the window for me and my date to enjoy. The server then started to prepare the table for me. Shortly after a gentleman walks in with the dog and has a conversation with the server. The server then looks back at me and proceeds to give the table to the gentleman with the dog. No consideration, no apologies for the inconvenience, not even a conversation saying hey it’ll be just a while longer. Just a smug smile.\nTo add insult to injury, he eventually comes over to my date and I to offer us seats outside. It was 8 pm and 48 degrees outside. And it made me wonder if you offered the guy with the dog the same option. Never felt more disrespected at a restaurant."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzOXB1c1pBEAE",
            "text": "Chill vibes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbFBEZ0FnEAE",
            "text": "Best drinks and wings on the UWS. Always get the best service too. Shout out to our waitress Katie. Great bar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUek9URHp3RRAB",
            "text": "Came here for brunch and it was amazing! Every dish was delicious and fresh and the cocktails were strong and tasty. We ordered the Vietnamese omelette, Thai basil fried rice, spicy mango salad, and lemon curry tater tots. I'll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubUpYdE13EAE",
            "text": "The restaurant is a gastro pub and is in the basement and as you enter the bar is right in front of you, so its a drunkard's delight. The restaurant is pretty small, however, there is outside dining. Outside dining needs to up their game, it's pretty sloppy and some tables had bad lighting and right underneath the public CC cameras.\n\nFood: ⭐⭐½\nPositives - The lemon curry pepper wings were good. It had a crunch to it and had a good zingy taste to it. The curry chicken quesadillas were very good. Earl grey hot tea was outstanding.\nNegatives - The Singapore noodles although came with a large serve, felt was lacking seasoning. The Tom yum chicken fried rice although smelled good, the taste didn't match the aroma, infact the food tasted stale and mushy. The Bo Luc Lac was delicious, but disappointing when it came to quantity. There were more cucumbers than beef cubes and it was cooked to well done 😐. The spring rolls were soggy and oily when served. Coconut rice didn't have the authentic robust coconut flavor.\n\nService: ⭐⭐\nThe waitress who took our call, received us at our arrival, and who seated us was welcoming & cordial. However, the waitress who took our order was on the flip side. Initially was good, but turned out to make our evening a disaster. We placed our order and 20 mins later my wife had her order (fried rice). Unlike most restaurants, they didn't serve the appetizers first and my wife waited for the rest of the food to arrive so we all could eat together however minutes passed and nothing arrived. I had to call the waiter and sendthe fried rice back as it became cold. She looked pissed turned around and said in this restaurant we serve whatever is ready first and everything else comes after. In my head and the rest were thinking \"so what's the concept of having appetizers (cravables) if you don't get it before the entreés\". Anyways we let it go by and waited more. 10 mins later she comes in and in a mocking tone explained: \"since you wanted everything together, they are remaking your food\". We all had facepalms😐. 10 mins later the server came and explained it to us for no reason and this time said next time you have to tell us if you want appetizers first. But isn't this common sense to serve them first???!!!!. Anyways we got the food and it wasn't up to par.\n\nAmbience: ⭐⭐⭐\nThe restaurant looked very dull as the first impression led to it being in a basement. Lighting was low, tables and chairs didn't match, some seats were right underneath the NYPD cameras, and tons of marijuana smoke from the streets. I would let others know to dine in and have less than 5 people as the tables don't fit larger groups.\n\nOverall: ⭐⭐⅓\n\nSuggestions:\nUse basmati rice or sona masoori rice, might help with the mushiness of the rice.\nExplain the customers the order in which they might receive their food.\nWaitresses need retraining in people skills.\nPlease make rounds to ensure people have full glasses of water."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMF95Q0h3EAE",
            "text": "I came here after a friend recommended their chicken and waffles to me. The service and vibes of this spot are pleasantly rustic and chill. The wait staff were very comfortable making recommendations, which I really appreciated. While visually the impressive, I personally didn’t enjoy their take on chicken and waffles, as it leaned too far into the savory side (they added spring onions and some Asian seasoning). The skin completely fell apart the already small portion of fried chicken and it was very dry and lacking any fat. The syrup, however, was wonderful!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpdnR1X0NREAE",
            "text": "The Expat is a great pub to go for after work.\n\nThey have a super nice place, that gives a nice vibe of an Irish pub with Asian influences.\n\nThey have a variety of unique cocktails which you should try. Otherwise they offer a good beer selection. When I went there they had 4 beers on tap and several bottles.\n\nThe food is amazing! We started with the cauliflower wings and tofu appetizer. The sauce of both dishes is delicious,you have to try it.\n\nThe entre was the beyond meat burger. Great made with a lot of fries. You will definitely be satisfied.\n\nThe dessert was the lava cake. Amazing! A great Finale for a wonderful time.\n\nThe service was all the time great. All people are friendly and ensure that you have a great time.\n\nWhen you have the chance, go here it is a great experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNXA2S1NREAE",
            "text": "The food here was ok, but nothing special. The chicken pad thai was pretty run of the mill and the lychee rose creme brulee was more like pudding with a lot of sugar on top. I don't think they torched it enough to be crisp and crunchy. Nice idea but not a great execution.\n\nMy server / bartender was nice but seemed a bit overwhelmed and not super attentive. The place has great ambiance and a nice vibe though. I would maybe come back to try something\n\n3.5 rounded up to 4 stars"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOWJuaVVBEAE",
            "text": "I don’t know why I ordered soup\nIn the summer but it wasn’t good. I’m sure they’ll make it better in the winter and I’ll give the place another chance. Happy hour is great and this place has many food option and good portions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURONEpTOVVREAE",
            "text": "Having been a expat in Asia, Singapore/Jakarta/Seoul as well as Europe Austria/Geneva, this appropriately but not overdone venue brings back many positive memories and I have been a consistent local regular since I moved to UWS including hosting events. Unlike many small bars of this kind in NYC the service is consistently high as well as quality of its food/drinks yet approachable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqLU9UZGd3RRAB",
            "text": "One of the best places in the neighborhood! Great place for any occasion, whether it’s date night, group hang or a solo read at the bar in the afternoon during their extended Happy Hour. Food and drinks are on point. They just revamped the menu for spring and prices are fair for nyc. Cocktails are always creative and range from martini to tiki style punches! The staff are super friendly and welcoming, can’t say enough how great this place is!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1cnBUOU5nEAE",
            "text": "2/5: A gastropub with questionable gastronomy and weird (negative) quirks\n\nI’m reviewing this place as a restaurant, not a pub, as I didn’t have a drink.\n\nCame here with my date on a Sunday night to have some plates for dinner.\n\nWe ordered the Thai Yellow Curry Nachos, Thai Basil Stir Fry, and then the Chocolate Brownie.\n\nThe Nachos were certainly… interesting. First off, the yellow curry flavor was not noticeable at all, so I'm not really sure why they’re called “yellow curry” nachos. They tasted like pretty standard restaurant nachos, with chips + cheese sauce + shredded chicken. It wasn’t really bad, but it was overwhelming. There is a ton of cheese sauce on top, to the point where it was a bit off-putting. We enjoyed it for a few minutes but stopped as we knew we’d get sick.\n\nThe Thai Basil Stir Fry was mediocre. Standard white rice. A few pieces of chicken. Weird-tasting pickled carrots. Lots of ginger. A side serving of nuts. It’s okay if you’re super hungry and need to eat anything, but not okay if you’re looking for a good quality entree for $15.\n\nThe brownie was, again, okay. Standard brownie, although it tasted a bit off, to be honest. Waaaaay too much whipped cream on top. Tasty scoop of vanilla on the side. But there were also blueberries alongside the brownie, which is something I’ve never seen before. Strange.\n\nFor all these dishes, we left them unfinished as we couldn’t be bothered to eat anymore after a certain point.\n\nThe service was questionable. The servers were nice, but the weird thing is they kept coming to our table about every 5 minutes or so, asking us if we were done eating. If we put our utensils down for a second to take a break from eating, they’d teleport to us asking if they could take our plates or not. It felt like we were certainly being rushed - strange given that it wasn’t fully packed or anything. Not great.\n\nDo note that it can get pretty loud inside - it is a pub, after all. If you’re looking for a quiet evening, it isn’t here.\n\nOverall, this place might be good as a pub, but as a restaurant, it leaves a lot to be desired."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkX2Y3MmdBRRAB",
            "text": "I was very impressed by the place. Great atmosphere, delicious food and drinks. My only con is that the drinks took too long to arrive, but the staff was very friendly and the fries were to die for."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNl9pUWZBEAE",
            "text": "Been here so many times at different hours. It is one of the best places in the area to either have good food or a fun Friday/Saturday night.\n\nCocktails are okay but some of them are actually really great: lychee martini for example.\n\nFood is actually quite good: the noodle dishes are my favourite.\n\nWill come back and would recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOHJDVlpnEAE",
            "text": "Recommend: DEFINITELY YES\n\nUpon taking those first few steps inside, I was awed at the vintage-chic beauty. The ambiance was amazing and the customer service one of the best I've seen.\nThe food was ok. Could've been better but it was definitely good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eC1YQkJnEAE",
            "text": "I’ve ordered pickup through Grubhub several times. But the last time, there was a problem: the box with my noodles was dirty. It looked like it might have been on the ground or even stepped on, and they still used it for my food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLdU1UUFdREAE",
            "text": "One of the top places ive been to in manhattan, easily. The staff is bright and charming. The outdoor seating is well spaced. The drinks are strong. I was debating with my friend if the firecracker wings here were among the best of…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPZzlPenJBRRAB",
            "text": "Really cute place. Staff was very accommodating. They can make mocktails from the cocktails they have. We had brunch and it was delicious!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXOGNhUXFRRRAB",
            "text": "I really like The Expat for what they offer, a decent beer and drinks selection and good Asian food. However, they seem to be extremely disingenuous when serving vegans and vegetarians. My girlfriend is a born and raised vegetarian. On…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtaVlPRGpBRRAB",
            "text": "Worth the wait! Our food was delayed put the Food was all worth it. Plus customer service recovery with was great!(thanks Carlito) if you have Carlito you’re in good hands. Great drinks! Must try the Bangkok Mule and the Singapore  noodles"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwN0tmcnVRRRAB",
            "text": "Layout/atmosphere\n*Stairs lead down to entrance of lower level of a building (no sign); Vietnamese restaurant; wooden tables/booths; round bar in center of room with TV; projector screen on far wall; tchotchkes on shelves; dog-friendly; covered outdoor dining structure in street on Broadway; tables on sidewalk on Broadway and Tiemann\n\nService\n*Attentive\n\nFood/drink\n*Bangkok Mule (Japanese Craft Suntory Haku Vodka, fresh house-made ginger syrup, lime, Thai basil and bird chili) - Good; the ginger and the chili definitely came across\n*Vietnamese Papaya Salad (shredded green papaya with Vietnamese dressing + shredded chicken; low spice) - good; fresh ingredients; little heavy on the red onions\n*Vietnamese Rice Vermicelli Bowls [Lemongrass Shrimp] (fresh herbs, veggie fritter, homemade beef spring roll, crispy shallots & Nuoc cham sauce) - good; a lot going on in the bowl; shrimp & spring rolls stood out; noodles cooked well; sauce on the sweeter side"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMnVmR2ZBEAE",
            "text": "It's a tad loud and crowded for my taste, but certainly has an exciting atmosphere. The decorations inside are quite eclectic and so are the menu selections.\n\nIf you are bigger than a group of four, make sure to reserve a table ahead of time!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLbFpDZlV3EAE",
            "text": "Their hours aren't correct but lucky for me they opened at 4 pm just about when I got there. Great customer service by all staff. Clean restaurant! Food was impeccable! New favorite restaurant, will return again!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2dGNpaFNBEAE",
            "text": "A great local bar with amazing food, cocktails, and a fun atmosphere. Their cauliflower wings are other-worldly, and they have a great happy hour menu. The staff is always lovely and they decorate beautifully for the seasons. Try the hard kombucha!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldTh1bzN3RRAB",
            "text": "I cannot wait to come back here. The drinks and the food were delicious and the atmosphere was amazing. I felt like I was on a Harry Potter set. So cozy and cute. I got the tofu pad Thai, spring rolls, and an amaretto sour. Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeFBtNXl3RRAB",
            "text": "We had the firecracker wings, shrimp dimsums, chicken nachos, chicken burger, and Singapore Noodles. For drinks we ordered 2 LIITs (The Blue Drink) and 1 house lager.\n\nEverything was great except the Singapore Noodles - will not recommend that. Giving a 5* rating despite the really dry noodles because the wings, nachos and dimsums were outright winners! The Blue Drinks are restricted to 2 per person for a good reason and the staff was really friendly too :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkLVBxVVdREAE",
            "text": "Extremely good food with tons of flavor (curry tots + cauli wings were exceptional), fun digs, and wonderful service. Would highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMzZmamFBEAE",
            "text": "Super chill spot for lunch with exceptional service. Our food was bright with flavor, from sandwiches to stir fry dishes, and our host was very kind and thoughtful."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNW9xbkNBEAE",
            "text": "I had the first date with my boyfriend at this cute place last year, and we’re celebrating our anniversary at this place again this year. The interior is beautiful and food is delicious, service is warm and attending, overall excellent place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMmZtRy1nRRAB",
            "text": "Definitely recommend a reservation if you want to avoid a wait. The staff is friendly and the food is great so it’s worth the wait even if you don’t make one. We got the disco tots and man were they good. If you like a good cheese to tot…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdGMyN25BRRAB",
            "text": "I love this place. They have a great selection of drinks to fit anyones needs and the food is on point. Be sure to check out their new late night menu. The atmosphere is fantastic anytime of day or year. It’s the perfect post(or pre) concert/rehearsal hang. The staff is fantastic, friendly, and inventive. They really value their customers. Cheers!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdm9HbVJREAE",
            "text": "This place is great. Truly adapts the idea of an expatriate in an international country.\n\nThe food is flavourful and authentic.\n\nDefinitely try the Yellow Curry, and get it spicy.\n\nService was great."
        }
    ],
    "reviews_count": 79
}