{
    "name": "Cap't Loui Broadway - Cajun Seafood Boil",
    "place_id": "ChIJw9J02UH2wokRD86VAz-HBho",
    "grid": "MN9",
    "address": "3147 Broadway, New York, NY 10027, USA",
    "rating": 4.3,
    "user_ratings_total": 946,
    "phone_number": "(212) 222-6608",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNk1rcFdiVmhyUjBGdmFsVkhlbG8wU1ZwWWMxRRAB",
            "text": "This place is worth checking out. This place maintains high standards of appearance. Employees provided wonderful attention, being friendly and frequently checking our table. The dishes follow original recipe guidelines. Remarkably good!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUExXaG5MVlZ4ZVRaek56WlBjekptVkZkZmRGRRAB",
            "text": "I wish I'd discovered this restaurant sooner. The dishes show skill. Employees exceed standard service levels for every customer. The interior is clean and aesthetically pleasing. Perfection achieved."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUUxVTlBkRXhpZUdOQmFHeFpZbU0yVjFWMlNrRRAB",
            "text": "Amazing, delicious, great price!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcGFVcFhPR3gwUW1walNtOXdabTFuTTFGcWNYYxAB",
            "text": "Food is very delicious. Service was amazing..First time coming here would and would 100% come back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVFRrcG5VWEE1TUdKa01GRlZURU0wVGpWa05sRRAB",
            "text": "my friends and i enjoyed the seafood boil, we ordered another bag ❤️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeVdtSlNaakZtVUVKSVdIcFVjSEpCVTJwdmJuYxAB",
            "text": "great crab, great service!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205b1N6ZFBRMU53YjA4MFFqRmtRMUo2ZDFkYVdsRRAB",
            "text": "Black parasites all over the snow crab legs. Crab legs are also very empty. Told them about the parasites and they said it couldn’t be cleaned because it’s wild caught. Whatever that means. Wish I took a picture"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SGVVcDJlbVJXUVVsM1pGaHhTa3hOVG5CeFJWRRAB",
            "text": "Great food,atmosphere and definitely great customer service at every location!!I always return"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204dGVVbGlNSEI1ZFVkMGJHSk1NSEJNTm1Od1owRRAB",
            "text": "⸻\n\nMy daughter, and I ordered the seafood boil bag, where each item—such as shrimp, snow crab, etc.—had to be purchased separately by the pound, with sides also priced individually. Unfortunately, no seafood utensils were provided, such as nutcrackers or crab forks. The food was overpriced and lacked authentic seafood flavor. The shrimp and snow crab were not properly cleaned. Had  we known the quality in advance, we would have chosen another restaurant. This will be our first and last visit. Just because a restaurant sells seafood does not mean they know how to prepare it well. Serving seafood has become a trend, but it requires skill and experience, which this place is clearly lacking."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlb01pcnVRRRAB",
            "text": "Good nice service, good food and music chill wine and atmosphere the location just super small they should consider moving back to the old location near polo grounds since esco Pesco is closed, that location was a tad bit more spacier !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vM2QwRkZPRTVtZDA1Rk1YSjFiREU1WVU5blpXYxAB",
            "text": "The place succeeds at both food and atmosphere perfectly. The dishes deserve maximum rating. You're going to want to return here. Restaurant workers show impressive culinary knowledge and exceptional care. I trust the food here and suggest others try it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTk4xUklORTVOU0VGMGRqbFZUV0o0TUVaNE5IYxAB",
            "text": "Love it!!! A most go"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdk4wcFRTVFJ0WVMwMmJHYzNVWGMwV1c5cFpsRRAB",
            "text": "Their approach makes standard dishes feel new again. The food presents combinations that challenge expectations. The spotless environment has a great atmosphere. The staff's attention impressed me equally with the cuisine. The setting was unique, the meals were tasty and my experience was enjoyable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSWJtNU5Za2d3V25rd1NIWndNemRUZDI1UlpVRRAB",
            "text": "I had such a wonderful experience at Cap’t Loui Broadway! The food was absolutely delicious—fresh, flavorful, and perfectly cooked. What really stood out, though, was the service. The staff here are genuinely warm, attentive, and professional, making the dining experience even more enjoyable.\n\nAlthough Cap’t Loui is a chain, this location feels different—it has its own charm and really goes above and beyond to make guests feel welcome. I’ll definitely be coming back and recommending it to my friends!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SE0wOURRemxJVGtOSmJtVldhbVJoUldKbVoxRRAB",
            "text": "The best seafood restaurant of my life! 🦞 Everything is so fresh and unbelievably delicious, and the staff and owner always greet you with such warmth. I brought guests from Korea, and they were blown away by how amazing the food was—total culture shock in the best way! Among all the locations I’ve been to, this one has the most delicious food and an unbeatable atmosphere. Highly recommended!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkd1J6ZHlaWFJGUm5wR1VYaGtNa2hzTjFWSlJWRRAB",
            "text": "Watching the New York subway go by, I have to say Captain Louis in Manhattan is hands down the best spot among them all! 🌟🌟🌟🌟🌟 I tried two different sauces today, and the flavors were absolutely insane—pure heaven on a plate!!! The owner was incredibly kind and explained everything so well, and when I followed his recommendations, it was a life-changing experience. Highly, highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMmNpMUxWVGhaVG5veFdYUlBWbGxmZG10bFZrRRAB",
            "text": "From the prices to the service, this place is just horrible. Don’t waste your time, they overcharge & service is horrible!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oc2FFcGxPR2xLVUZNeFQwazFZMmxxVEhNM2VYYxAB",
            "text": "I was there at the broadway location yesterday at around 3:00. The sever came to seat my self and granddaughter so I asked if I could sit on the cushioned seats and was told I could not because it was only two of us, so I went with the seating she offered us. She sat us on metal chairs with no back support and I am 65 years old with back issues when I called her over to let her know i was not comfortable in those chairs. SHE DECIDED TO QUESTION ME ON WHY I CAN'T SIT IN THE CHAIR then told me she had to speak to her manager about moving us to a more accommodating seating, then she decided that I should go to a table in between two other table where the wasn't even elbow room and I declined and was questioned once again why and I explained that covid was still a real thing and we shouldn't be sitting on top of each other. Finally was seated at a comfortable seat and got kicked in the ass again the food came and it was the worst a small portion of cranberry leg that was so small t hey weren't even worth your time to Crack just a disappointment. I was a frequent costumer But they don't need to worry about me ever again. I CAN'T PAY FOR BAD SEVICES AND BAD FOOD THAT WOULD MAKE ME A FOOL AND THAT IM NOT."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKeFlVbE1OREp5WVhNeVp6VnNaamxHZGtwMWFVRRAB",
            "text": "The prices make sense for the quality. Their cooking impresses consistently. Cap't Loui Broadway values customer satisfaction. The entire workforce is remarkably friendly. I find this place worthy of exceptional praise."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWlYyeGxSWHA1V2xOMFJEZExUemRLVUVoUFpGRRAB",
            "text": "WHY DO YOU GUYS CLOSE SO EARLY ??!??! Yall used to close later. The one on 125 has no liquor and can’t dine in. Even on the weekends can’t even go at 9:30. Literally so many people I know have trouble going bc yall close so early"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaUtydzF3RRAB",
            "text": "This restaurant offered free drinks to delivery service people waiting to pick up the orders. Food and service is best in new york area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSFZGVlBXRVo1VERWWU9UQnBabmhqVG05dmEyYxAB",
            "text": "🗣📣💯🔥"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdVdVSXdTamR6T1RWMk9YbHhORzh4WlRSU1ZGRRAB",
            "text": "Idk something about the quality is off it tastes weird ! The sauce they use is nasty... as well as the lemon pepper flavor.. I don't like places that force you to tip either and this is one of them"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSVZHMXFOREEzYlRKdWFYSmpVVTFSYm5sbWVXYxAB",
            "text": "So delicious!! 11/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVlNIWlRRVkY2UWxZNE5UVTNTakpDT0doSWRFRRAB",
            "text": "Customer service doesn’t match the 18% gratuity they add to all bills…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WamNFMUVSME5KZWtkTE1WQlBiMkptUzFWUFJVRRAB",
            "text": "Wonderful ambiance! I appreciate the service Phet provided. She was very warm and kind."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcFVuVkZaMmRSVHpNM1dXdFNUMVZCUkVOR01YYxAB",
            "text": "Sooooooo good. The broccoli mixed in the bag is highly recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRGRFdDRMV1JmYVVwaGQxTndTbE10ZDJGYVRFRRAB",
            "text": "Best seafood boils"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseGRsb3hkVU5hYldkTlgyMXViM2x5YkhOVWIzYxAB",
            "text": "I have  been to this chain restaurant in Massachusetts and New Jersey. but the ENTIRE EXPERIENCE  at this location was HORRIBLE. We were at a table but the bar was very messy waitreses were on their phones and it took long to get their attention to even bring utensils. The Food took 35min to come out and the restaurant wasnt even 1/3 full. There were 3 tables including us.\nThe food quality is not worth the price...We ordered a boil and it barely had any sauce. The Clam chowder was Clamless.Then they wanted to charge $6 for  sauce for the boil that was evidently quite dry. The waitresses were on their phones 95% of the time and included a 18% gratuity for 2 of us. It was written in very fine print, barely noticeable on the very bottom of the menu. When we asked one pointed to the barely noticeable print and smirked saying they charge 18% automatic gratuity for even one person.\nThen the other ine gigled. The audacity.\n\nThere are so many better sea food boils to eat in this city. Better service, and quality and experience.Dont waste your money or time here. The food quality is not the price and service is TERRIBLE...\nWill never be there again. You've been Warned. Go somewhere better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeGVWZG1OM1J3YUcxT2VGaG9NVlJ6YUVoR05tYxAB",
            "text": "I visited Cap’t Loui Broadway today with a friend and had a great experience! The boiling seafood was fresh, flavorful, and cooked just right. I chose the mild spice level, which had a nice kick without being too spicy — perfect for anyone who doesn’t handle heat well but still wants flavor.\n\nThe fried calamari and lemon pepper French fries were delicious — crispy, well-seasoned, and cooked to perfection. The atmosphere was relaxed and welcoming, and our server was kind and attentive throughout the meal.\n\nThey also offer a good variety of cocktails and beer at reasonable prices, which is always a plus. I’ll definitely be coming back soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNmEyRnNhakZhZVZoa2VFVjNPRjlNYUdkcmVYYxAB",
            "text": "My third time here and the older male manager is unprofessional. When we got there he was giving eat here or dont type vibes because his tables were full and he only had reserved seats. He let us sit on a capped time limit. To my surprise I found a white finger nail like thing in my drink. They came over he said it was paper( obviously paper melts in water and isn't curved). So we settled on it being \"plastic\" from the biodegradablepaper straw. He bro'd me like we was home boys and low key gave microagression. The only thing saving it was that the wait staff were nice. It was dismissive and he should do better as a manager/host. Food was ok"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wd1FXWjJkRlJVUmxCSFdtazJlR0Z5UlVaMFdWRRAB",
            "text": "The experience here rises above ordinary dining. The dishes contained unfamiliar elements of high standard. The meals are great and staff is nice. The proprietor and workers show exceptional kindness. Every part of this place shows quality."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcVRYbDVSRFpQYURWSVlYWkdSV1pzTFVRMlNFRRAB",
            "text": "I’m am totally not happy with the service I received at this place went there last Saturday waited an hour for our food the waitress a little Korean lady she looked at us. She wasn’t nice. Nobody never came back and iold us. Oh your food is coming not one time we stood there for an hour. All we got is cold, calamari, and fries. Then we had to tell her to put them back in because it was cold. Went to the manager complained, the manager said come back. I will take care of you. That was an understatement. We was thinking he was gonna take care of us by giving us a big discounted meal, fast-forward to today went back. We order our food. Our food was 153 he gave me one free drink and some fun nasty cake with ice cream. I asked him. Oh I thought she was gonna give us a discount. Oh yeah take another drink. Not  professional service. I will never return to this place again. The manager is a liar and a hypocrite. Sorry but not sorry stay far away from this location."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsR01USkJWR1ZUWjJJMkxXdGpjSFZ3YTFWU1JsRRAB",
            "text": "Came here a couple months ago. First experience was amazing. Had to come back and get that three pound bag!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMWFsOTJURzlSVVd4dGFETTJTRWRWU1hWV1VrRRAB",
            "text": "Very fast service, delicious food. Great atmosphere, would come again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobE5HZDFZVWh1VG5wc2FERlBiMkpKWm1sdlEyYxAB",
            "text": "Wonderful food and experience! Highly recommend for a taste of Louisiana! ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSWRVUjBaR0ZKYVVVMlR6aHZNRGhuYW5kbVNuYxAB",
            "text": "The best choice for seafood lovers!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Vd00zWlFTbXBxWkhSdlUzaHNkamw0V0MxZmVtYxAB",
            "text": "Tonight I stopped in for takeout. Got home and the corn tasted as if it was spoiled, I had to throw the entire thing away. The worst part is the boil sauce is absolutely the most watered down sauce I’ve ever had. So watery, lacks flavor, to the point it doesn’t stick on the food. The food is just colorless. I’m very disappointed and didn’t have the energy to call and complain."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twb1EzbGtRVTFqZWxaWWNWUnZaMk42Ym5nMFZsRRAB",
            "text": "Ordered for delivery and my kinda mid expectations for a seafood boil via delivery were happily exceeded! The shrimp was plentiful, two pieces of corn and four halves of red potato. We ordered a double boil and ate less than half before we had to take a break. The garlic noodles were al dente and tasty. The Cap’t Loui seasoning was tasty. Sauce was garlicky and buttery."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWWNsQTVTVE5SZVhCdlFVVlFRMHBWWVhkdldrRRAB",
            "text": "Spent $170+ on three seafood platter with whole lobster, clams, and crab legs, plus an order of garlic noodles and calamari.\nEVERYTHING was way over cooked. Rubbery. Inedible. Noodles were brittle. Lobster, what little was there, way overdone. Clams were ridiculous. Rubbery and cold. Crab legs were dry and meat impossible to get at. In total, all the meat from the three seafood platter could fit in my coffee mug. I will never ever order from this place again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VdFNtUndhM2hYU0VSNGJFd3pNR0UxY3pSTlRrRRAB",
            "text": "Impeccable service, recommend 5lbs for 6 people plus sides"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONGVFSkVXRVJOUldSU04zQlZWa3hVYjFvd1ZIYxAB",
            "text": "Amazing food and staff.✨"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waFgwZFZaSHBKYXpCT1dtSmpOemhSV0ZJNVNXYxAB",
            "text": "Amazing seafood boil 😋 Fern took good care of me and my fiance. In the midst of me talking to my fiance Fern noticed we wanted to share a desert for my birthday and they immediately surprised me by celebrating me with beignets and van ice cream with a candle on top. Thank you Fern you're the best!"
        },
        {
            "date": "4달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNFNWZHNVbXBYVVRKWWFFVXdZWEp0TTFwRGJrRRAB",
            "text": "Tudo muito bom. A comida cheia de tempero e o atendimento da Jessica e a Anya é perfeita ❤️. Com certeza vamos voltar para desfrutar dessa experiência gastronômica. ✨"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQalhzTkdobXZudVlREAE",
            "text": "My favorite place ever!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKekItc3ktc3I3SXdnRRAB",
            "text": "Cap't Loui (Loui Loui) has fallen off dramatically. Table for five reservations for 3:30p on a Wednesday- they open at 3p. Everyone ordered individual steam bags (2 had extra noodles to go). Appetizers: wings/fries, and 2 orders of calamari/fries. 1 ordered wine, 2 ordered virgin Pina colada. The Appetizers were spot on! However, all of the steam bag orders were over cooked! How at 3:30p!  The Pasta, the crab, the calamari, the mussel, the shrimp, the corn, the soggy potatoes... I'm extremely disappointed in this location's meals. It was a mess. This is the third time we've experienced this. The other instances were later on in the evening so we assumed the staff was overworked. Completely untrue for this day and inexcusable. The NJ location is much much better- almost like it isn't the same franchise. The bartender wasn't even there and the server tried her best, but failed at virgin Pina coladas which were a bottled mix! How?! Even the leftovers were inedible. A complete waste of $400! I'm pissed because now I have to go to Jersey. After all, the craving wasn't satisfied not even in the least bit. Skip this one!!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbWZfTGV2MU5DWDd3RRAB",
            "text": "Very well made food I love the atmosphere and songs they play. Also they servants were very kind and helpful and make the experience more enjoyable. Honestly I really recommend this place to anyone because of its amazing food, great atmosphere and songs, also it workers were very nice. 10/10 I would recommend 🔥🐔"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZlB3UDdndTh2akZ3EAE",
            "text": "Food was very good, been going for a while with my family and we are always welcomed, it does get full so make sure to have appointments ready. Would definitely recommend!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacHZYb25BRRAB",
            "text": "Excellent food and great service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYTluY095cGFybXlRRRAB",
            "text": "Delicious Sea Food Boil.\nA welcoming atmosphere. Staff extremely friendly, accommodating, and helpful.\nI will return."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnZ3QzRjFnRRAB",
            "text": "완죤맛남"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3c3J1bmhBRRAB",
            "text": "Went on a Friday at around 6pm. The place was not very crowded.  Wait is no more than 10 minutes. Staff was semi-attentive, we had to flag them down to get refills.\n\nThey have draft beer but it is never working so they give you bottles.  They were semi-cold.  We really enjoyed the happy hour drinks for $7.  We ordered blue and black colors, definitely recommend them.\n\nThey gave a new notice with the menus that you will be receiving less complimentary sides with your seafood boil. Our bags had 1/2 a potato and small piece of corn each."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcEotMjl3RRAB",
            "text": "I was so surprised at how good the service and the food is when compared to the reasonable prices. I totally expected my bill to be insane but it wasn't.\n\nIts in a nice part of Harlem. Not much parking so give yourself leeway if you're meeting family or friends there.\n\nI especially enjoyed the soft shell crab and oysters. Their drinks are pretty strong so be mindful."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdl9tMjFRRRAB",
            "text": "Now let me start with the positives. The food is delicious. Everything was fresh and from what others tell me they are consistent. I have friends and family that dine here all of the time but this was my first visit. Now where the issue arises is the service. I was in town visiting family and when we sat down and started looking over the menu the manager came over to us and said “I’m sorry to say this but I can not serve you.” I asked if children were not allowed and he said that was not the reason he stated “the owner just saw you come in and just told me to tell you I could not serve you.” As you can imagine this incited an issue. I asked why several times and his response was he didn’t know. I explained that simply looking at someone and refusing to serve them is discrimination. For some reason he did not see it that way. I have dined all over the world and never have I had something like this happen. This was not only disrespectful but embarrassing. This is a small establishment so the tables next to us could hear everything. I kept my cool even though everything in me wanted to leave and not spend a dime with them but my family members were familiar with the staff and had a conversation with them. I am unsure if this was a case of mistaken identity or something else entirely but it’s not for me to figure out. And despite the apology and the great service that followed I will never return again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveTc2SHdBRRAB",
            "text": "Food was good. Towards the end of our visit, ppl were screaming because of Mickey. I never saw him. He ran in from the outside and ran through stuffed corners. I was afraid.\n\nBut the seasoning was the best. Food was expensive. Place was kind of trendy. NEAR THE train station on the 1 train."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ak1mM0dBEAE",
            "text": "Delicious food, we had the seafood boil with the Captain Louie sauce, medium, it was delicious! I gave it four stars instead of five because my $35 lobster tail was like a large shrimp or crawfish, I expecting something a little more substantial! And they serve plastic forks and I had to ask for crab cracking implements, seems like they should just come when you order crab!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkaC1yb0NnEAE",
            "text": "I wanted decent fresh seafood for my birthday, and The Cap't Loui was EXACTLY what I needed. Oh my word,  it was absolutely excellent 😍  Everything from the time we walked in until we left was on point. My waitress was very attentive & kind.\nMy s☀️nshine, and I haven't been out for a minute, so everything was just groovy.\nHe's a picky guy and he was very impressed.\n\nOh wait....but the drinks in the pouches, were potent & very tasty."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbTR6Wll3EAE",
            "text": "Took my brother here. Wanted him to try something different. He is hard to please but he loved the food. It is delicious. I liked the drinks they put in the Capri Sun bags.  The lemon pepper fries were different, but I enjoyed it. Didn't…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM0w2eVZnEAE",
            "text": "Loved it! Very affordable seafood restaurant just north of Columbia University campus. Delicious oysters and fried catch of the day. It's a low key restaurant, fast service, and super fresh food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMnJiNFlBEAE",
            "text": "I have never left a review in my life, but it was sooooo great. We had a short hang for dinner at this place, it is the best Louisiana style seafood I have ever had. I went to different branch and other restaurants too. But the taste and service are absolutely standing out from all of the places I have been too.\nSee foods are so fresh and meaty. The location is so easy to get, it is right by next to a train station and even there are quite of free parking spots if you go after 7pm. I will definitely come again!! ♥️♥️♥️♥️♥️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdE9IX3FRRRAB",
            "text": "Firstly, server Robert—the BEST!!\n\nOne person in our party was allergic to seafood and they were super accommodating making sure he could have a delicious chicken and fries meal while we had an absolutely wonderful calamari and seasoned French fries along with coleslaw meal with all the dipping sauces you could want—honey mustard, ketchup, spicy tangy creole mayo…yum!!!:)\n\nThey each had Root Beers while server  Robert was kind enough to bring me a hot water with a couple slices of lemon on a cold evening.\n\nThe atmosphere is chill, clean and lovely and the service is quick and kind.  I will definitely return again and hope to try their crab next time—thanks!\n\nFood too darn tempting to take photos before eating—maybe next time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabDhER0hBEAE",
            "text": "Came here for the Happy Hour deal which is technically worth it. However, there were a lot of broken pieces of the shell inside the oyster and I almost bit into them. Chardonnay was also really sour, like old wine. Nothing was done after mentioning it to the server.\n\nEdit: The manager came and offered a free beignet after I enquired further about getting billed for the oysters."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaHBLbmRnEAE",
            "text": "THERE IS A Roach in my food. Please do not eat here. I tried to call the restaurant and the guy hung up for me. Very bad customer service I asked to speak to the manager. They said the manager is a present. It’s 3:35 in the afternoon what time is the manager coming in? No response hung up on me. I work a lot, so I put my food in the fridge raider still in the bag covered and everything I got to heat it up take the food out the plastic put it in the pot put the food out the pot in my bowl. that there’s a roach very ridiculous and trust me. I’m very clean.!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaDU2bXZnRRAB",
            "text": "Stopped by Captain Lou Broadway in Harlem and was underwhelmed.\n\nMy daughter ordered the seafood boil, which she managed to enjoy, while I opted for the fish and chips. The food itself was passable in taste but nothing to write home about.\n\nThe sauce portions were laughably small, leaving our dishes feeling unfinished. The margarita I had was disappointingly weak, missing the zest and strength one would expect.\n\nTo top it off, they slap an 18% mandatory gratuity on the bill regardless of party size, which was a surprise. And then, in a perplexing move, they suggested another 18% tip on top of that🤔\n\nFor those craving a seafood boil, my advice would be to consider other spots in NYC where the service and policy might match the quality of the food and the price."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwdUxLQ19BRRAB",
            "text": "So delicious! The service was great and the New Orleans style boil is delectable, but I had to knock off a star for the Happy Hour oysters. They were not good at all. Im running back for crab legs though!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJdnJhZVF3EAE",
            "text": "Very casual atmosphere, friendly staff, food portion size is decent for moderate costs. Lemon pepper fries and fried soft shell crab were my favorite. Kids had shared an order of chicken tenders and fries. Portion for eleven year olds was…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZMmRieUlnEAE",
            "text": "We went for happy hour.... $1 oysters, cheap fried shrimp and calamari.  Beer and wine at moderate prices ($4 and $5 respectively).  No complaints, service a little slow, but that may be because we came early when staying was low.  Could recommend solely based on the $1 oysters.... But everything we tried was good."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwN2F2ajJRRRAB",
            "text": "If I said I’ve only been to this restaurant a few times, I’d be lying. I legit go every single week. The food is absolutely amazing. Every single time I go I get a boil with shrimp mussels and snow crab legs, I also get a dozen raw oysters.…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bDlqTG9BRRAB",
            "text": "I really wanted to love this place, but unfortunately,  the lobster was very tough and chewy. All the side dishes were great, service was good,  room itself is fun. Fix the lobster problem! Get them fresh, not frozen,  don't cook them twice! Restaurant could be fabulous....."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHd1ozTVVnEAE",
            "text": "Now I see why this place has almost 5 stars. I ordered the pick 3 with snow crabs, shrimp, crawfish, and received a free order of mussels with the order. My side was the garlic noodles. You must select get it in the bag! It was delicious.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzMHFlX0F3EAE",
            "text": ".\nPros:\n(+) Fast and friendly service\n(+) Perfect for any size group, small to large\n(+) Generous calamari appetizer size, fed 3 people with still extra left\n(+) The \"pick 4 pick seafood boil bag\" came with a free lobster or snow crab legs. We went with the free snow crab legs. It fed 3 people and still had extra left.\n(+) I like that you pick your level of spicy 🌶️ (mild, medium, hot, extra hot). We picked \"hot\" 🌶️🌶️ which was a perfect amount of heat. We could have even went a little hotter, next time will try the extra hot 🌶️🌶️🌶️\n\nCons:\n(-) No reservations for large groups, so come early if you have a large group and visit during non-peak hours to guarantee a seat for your party"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5M2YyM2NREAE",
            "text": "The best seafood boil. The lemon pepper is my favorite but I love to mix both sauces. Taste amazing. My usual is king crab with shrimps in lemon pepper sauce. Food is always done perfectly. I have not one complain. If I could rate this as a ten I would. Try it and you will not be disappointed."
        }
    ],
    "reviews_count": 72
}