{
    "name": "sweetgreen",
    "place_id": "ChIJ3W_Lrz72wokRy3BEhF4s20U",
    "grid": "MN9",
    "address": "2937 Broadway, New York, NY 10025, USA",
    "rating": 3.8,
    "user_ratings_total": 516,
    "phone_number": "(917) 675-6616",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWFFXWXRSVVk0WHpOYWFtNW1jMGt3Ymsxa2FrRRAB",
            "text": "So NO!  First time order.  The toppings came in meager portions and were of middling quality and grossly overpriced.  Base greens were not fresh. We were also charged separately for an additional box of what we understood were the base greens to the salad. Given the inferior quality of this order, it is difficult to understand how this chain of stores has so exponentially grown in  numbers."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUFpreExlWE5pUzBkVFdXSmFjbTFYVkhFMVRrRRAB",
            "text": "A scam when it comes to the chicken or steak . They refused to give a full portion of the scoop. They just fill your bowl with a bunch of lettuces"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsZlUyaG5TR3RyVFdvMGEwaFhWMFJpVmpoeGNuYxAB",
            "text": "I got lunch here around 1pm on a Tuesday. Although there was a line of about 10 people in front of me, the staff were very fast and efficient. I got my Harvest Bowl within 15 minutes. Even though they were out of wild rice, my salad tasted fresh.\n\nOne thing to note is that this location has about ~12 seats or ~4 tables in total. I was able to sit at a table with some strangers who were all eating individually. Overall the experience was good and I’d definitely go back again for takeout."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbE5tZFNVa1JoUm1GTWFtb3haMlpXWTJnMlduYxAB",
            "text": "I ordered food from here on Uber Eats as I was mixing my salad there was a bug in my food like a dead fly. I do not recommend this location, I was very disgusted to see that."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RE1XWlJPWFE0VVVkcFZUSmhlbVJuUmtKMk5XYxAB",
            "text": "Always good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNGFIWmplVXRJYUhWclVsUldaVFZoZFd4WVIyYxAB",
            "text": "Unfortunately this location messes up the order more than half the time. Most recently, they gave my son ranch instead of hummus in his kids meal, and completely broken tortilla chips that looked more like tortilla chip crumbles."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQ1QyOHplbFJTUTJaMmVrbFNhMGxCVERRekxVRRAB",
            "text": "First time trying sweetgreen and I love it. I literally downloaded the app as I was standing in line to make sure I got points for my first purchase. I love the different topping options and how they ask if you want light, med or a heavy amount of dressing. This is another eatery I can add to my list."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKemVpZDN1N0syREtREAE",
            "text": "Terrible experience here today, the staff accused me of already picking up my order when I had just gotten there and being harassed on top of it like I’m here for free food. If you speak Spanish go there they seem to favor that over actually doing their job."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPQ3Y3dXZZOUlLd19BRRAB",
            "text": "Came here late night had a great experience thank you Jarrett and faith."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnEzZnJnRRAB",
            "text": "How i order a kale ceasar w chicken and they didnt put chicken, parmesean, or dressing lol go elsewhere"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOXEtNmh3RRAB",
            "text": "I paid almost $19 for this."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOGJtV01nEAE",
            "text": "not friendly, sweet potato not peeled off, fork far away from checkout, average taste. 18 dollars. I should’ve eaten chipotle."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aE5HSTJBRRAB",
            "text": "Amazing food and places"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dzZuRi1RRRAB",
            "text": "wish there was more chicken and less baby spinach/arugula."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbnE2V3ZnRRAB",
            "text": "Most disappointing portion size. This was my kale salad untouched."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnX3NtVXVRRRAB",
            "text": "The staff is very friendly, the manager Moises was very nice person to talk about the ingredients, the place  is very clean overall is really good place to eat a salad."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcE82ejd3RRAB",
            "text": "Wow for $20 you get a strand of hair and a tiny portion of food. To top it off, they got the wrong rice… not worth the money and the visit."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNnAtNlF3EAE",
            "text": "I order from uber eats and EVERY TIME the bag is NEVER secured! No staples or tape to make sure your food is not tampered with. Not even the salad boxes are taped secure. It is so sad."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfM3UtenZnRRAB",
            "text": "Excellent"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdDVXSnZRRRAB",
            "text": "No hummus with hummus order. Something missing everytine. Fire the person responsible for checking orders."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMDZpUHBnRRAB",
            "text": "Yall are bugged I don’t even know how many people was touching this thing as a play thing and passing it around"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbzdYYmRREAE",
            "text": "Great salad, friendly service, and environmentally-conscious concept of the cafe!👏🏼🤍"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMGI3c2NBEAE",
            "text": "Loved it before but it before but it’s not as good now. Food is great but portions shrank as of late"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcnBEYWtnRRAB",
            "text": "This location’s particular issue is that the staff has to be very fast because of all the students coming. I understand that, but it has a negative consequence reflected in the food quality. I often just get the side, brussel sprouts and sweet potato and lately the potato is not cooked enough."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cS0zM1BBEAE",
            "text": "josh is da goat"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MXNYOXh3RRAB",
            "text": "Great customer service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MXM2M1RBEAE",
            "text": "Good"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NXNfNXRnRRAB",
            "text": "My food was soo good I forgot to take a picture beforehand but I got the Miso glazed Salmon definitely a 10/10"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cHBYdVlnEAE",
            "text": "Staff is very welcoming"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQcGNuTkp3EAE",
            "text": "First off I wanna start by saying the quality of service and food I received was excellent. From the smiles I received when I walked in the quick but yet patient service was amazing. I had ordered the fall harvest bowl and it was a mash of wonderful flavors. The sweetness from the apple and the savory contrast in blackened chicken pairs perfectly with the  tangy balsamic vinaigrette. The person I had taken care of me was Jarret he was so kind and gave me great  suggestions on my bowl. While doing it with a smile on his face and a positive attitude. The food is what got me in the door but Jarret is what got me to stay!!!!!\n#sweet green is awesome"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaGNmQ3V3RRAB",
            "text": "Been to this location several times. I usually get the caramelized garlic steak. The proportions are decent, the ingredients are fresh, the order is prepared in a timely fashion, and the staff is attentive. Haven’t had any bad experiences yet!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNW9pRjlBRRAB",
            "text": "Not worth it...they even charge extra for toppings like 🌶 chilli flakes."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdU96YnZBRRAB",
            "text": "always at least 5 people working here but only one on the line <\\3"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQza0l5T2RnEAE",
            "text": "Worst service ever in my life"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcm8tY2RnEAE",
            "text": "Great for to-go salad. It’s usually really busy so would only recommend for takeout."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdTdlaTBBRRAB",
            "text": "Looking for a GREAT salad! This is where you need to go! Fresh EVERYTHING!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYckl2ajNRRRAB",
            "text": "Good healthy dinner! A bit expensive but isn't everything these days."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubVBibTd3RRAB",
            "text": "Best place, I love sweetgreen"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIN1piRFB3EAE",
            "text": "Dont do it!! The receipt below shows what we ordered. Got home and opened the salads to find the carelessness & deficiency in these photos. Never again.$40!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bzd2ZWR3EAE",
            "text": "I’ve been here several times and each time there are issues.  Worst sweet green I’ve ever been to regarding quality and service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaU9LUjNBRRAB",
            "text": "This restaurant staff very rude, they don't let you use the bathroom"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNkstaFdREAE",
            "text": "Was sent clearly undercooked, pink chicken in the Buffalo Chicken Salad. That means they missed this problem at THREE points - undercooking it at the grill, not spotting it when cutting it up as it’s still connected with gristle, and when preparing the bowl. This could have seriously sickened my daughter. Gross"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyM011VG1RRRAB",
            "text": "This place has let me down too many times not to leave a review. Consistently missing ingredients to make a salad and the one time I did get a salad it tasted completely wrong. Same high price sadly."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlenMySFNBEAE",
            "text": "I would give this location zero stars if I could.  There is a lot to be unhappy with.  I will start with the fact that they seem to close early quite often. Like this weekend, when they closed before 8 PM.  I asked why they closed early and was told it was for Columbus day. I never heard of a restaurant closing early the day before a holiday.   I can tell that the workers are regularly pushing to close early or as fast as possible, because I've been in there 1 hour before closing and they are cleaning the areas where the food trays sit while consolidating them and saying that they are out of many things.  I see them spraying cleaning solution and using wash rags right next to the food trays that they are giving to customers.  This is extremely unsanitary, and they could use a health inspection visit.  When I saw what they were doing, I walked out.  This place needs new management and workers extremely badly.\nUpdate:  No improvements from my above reviews.  Also, on the credit card payment scanner, you are prompted for tip, with the extremely poor service, I don't want to give a tip, the selection for no tip, says press F, but I couldn't find the F key, only to realize that the F key on both scanners had been covered by white tape, so no one could see it to select it.  I'm pretty sure that illegal.  This whole location needs to be investigated by consumer affairs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOXFqbGt3RRAB",
            "text": "I ate my salad and when I was done I found 2 insects in my salad"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNV9LcFdBEAE",
            "text": "Didn’t have a single one of the options that I wanted and came in for. Very poorly stocked"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bzlhZ3ZnRRAB",
            "text": "I do not recommend this sweet green location. The service was very poor, the person preparing my food did not seem like they wanted to be there and my bowl seemed to be missing many ingredients in addition to having very small portions. I paid nearly $17 for the bowl below :/ I was very disappointed since I usually really like sweet green and this is my first time having such a bad experience there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6a2ZHd2NBEAE",
            "text": "Worse sweet greens location. Some workers always seem annoyed and like they don't want to be there. They always look like they are doing you a favor.  Location on 84th and third ave knocks this one out of the box tenfold."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUbnZfM3l3RRAB",
            "text": "Wow this was/is the most disgusting sweet greens I’ve ever had. Do not order delivery from here. I ordered twice and both times my food came: open, less than quarter full, and none of the additions I paid for .. on both occasions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUc3NMSjh3RRAB",
            "text": "Obsessed get the Cashew spicy dressing"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0b2NlX1B3EAE",
            "text": "주변 다른 음식점들도 그렇듯이 줄이 대부분 긴 편이에요. 근데.. 다른 샐러드 집보다 맛있어서 다른 데 갔다가도 다시 기다리게 되는 거 같아요. 직원들 활기차고 친절하고 좋아요."
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbF9ua2pnRRAB",
            "text": "Overpriced. 그냥 건강하게 먹고싶어서 가는거지 절대 서비스나 가격이 좋아서 가는덴 아니에요. 맛은 그럭저럭 괜춘... 그래도 차라리 여기 가느니 티씨 다이닝에서 샐러드 사먹거나 밀 플랜으로 패리스 가서 샐러드 받아먹는게 나아요... 라고 하기엔 그래도 스윗그린 샐러드가 훨 맛있음ㅜㅜㅜ(패리스 다이닝 샐러드 초비추)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsMDZlWkdnEAE",
            "text": "Good food, a bit slow preparation. For bowl or salad of protein plate you pay roughly around $15 and then tip if you dine in. With Miso Salmon protein plate you get half of 🥑 which is nice. So overall healthy choice I would say."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwOC1iZ0lBEAE",
            "text": "I always order from App for pickup so can’t comment on the wait time during peak hours or the service.\nMost of the time the salad is fresh and good portion, occasionally some yellow leaves and tiny portion. One time they got my mixed in dressing wrong, I reported in the App and their automated customer service system refunded me $12 credit right away."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjMmZEb21RRRAB",
            "text": "Enjoyed their Shroomami warm bowl.  Hearty, healthy and filling.  Friendly staff.  They have good choices for vegetarians.  The location we visited was close to Columbia University.  Conveniently accessible for person in electric wheel chair."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJaThxeG9nRRAB",
            "text": "Love this place. Amazing salads that you can customize as per your liking. They are also eco-friendly - they use compostable utensils and have a zero waste setup - love that about them!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NjRyYmFREAE",
            "text": "I visited this location today and I won’t be back again.  First I had to run back to my car to grab a mask, even though vaccinated because they stress safety. First the lettuce that was provided to me were the last scraps. When I arrived in for the second go round there were workers standing idle and with that being said they could’ve been changing the lettuce so I didn’t get the last of whatever was there. Fast forward I ordered a kale Caesar salad with tofu. My bowl wasn’t even full to the full line. Upset. Then I had to ask multiple times for a second dressing. The thing that topped it off for me was that this was my first time at this location so I asked the cashier to point me in the direction of the bags. She pointed directly at the last bag on the counter. I would’ve taken it if it hadn’t been USED. When I went back and asked for a new bag she kindly walked me over and fluffed the used bag and said it wasn’t used it had other bags inside it…. WHICH MEANS IT WAS USED. In this Covid world we live in, and mask required store, I didn’t want a bag that has been touched by customers all day, and if I ask for a bag give me just that. Anyway I left… and I won’t be back… SweetGreen isn’t so sweet."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBODdxTDBnRRAB",
            "text": "It's loud and hard to get a table, but the food is delicious, the portions are large, and the price (adjusted for the quality of the food) is reasonable.  I had the Shroomami, which was incredibly good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dE5lQjdRRRAB",
            "text": "WOW this was absurd...the portions were insanely small. 3 pieces of broccoli?? Additionally the fish was probably like 3in wide...like peek at the little dressing container for size reference. Do not go to this location.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwbF9QNkJnEAE",
            "text": "Placed an online order for a harvest bowl that arrived with no kale (key ingredient). Tried to call the store but they force you to text with customer service who can't put you in touch with the store also requiring customers to text you is crazy.\n\nChatted with customer service who informed me that the location was out of kale. Ok, fine, call the customer to see if they want a substitution, don't just leave out a key ingredient. What a terrible way to do business."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaZ1BlalJBEAE",
            "text": "best place ever! fresh, delicious, hearty bowls of joy. will forever and always be my favorite fast food chain :)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwOWN1VTVnRRAB",
            "text": "I went to this place twice and ordered Harvest Bowl and another bowl I forgot the name. Both bowls taste good and look healthy. But I think the food is definitely overpriced.\nNo cash accepted."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOUlQbEpBEAE",
            "text": "The staff who was wearing a beige cap with lovely dimples were really nice! ♥️ I can say that she is the kindest staff I have ever met in NYC! You made my day, Thank you!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNVBPUnFRRRAB",
            "text": "I love their warm bowls! try the chicken pesto parm!\n📲 order from their app if you want free delivery!…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3eXFxT2FBEAE",
            "text": "Food is good,  but not worth paying 12 dollars. Staff needs to be more courteous, they are currently overwhelmed by the number of people coming in at times."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDaDg2bG13RRAB",
            "text": "I ordered from the sweetgreen app. Ordered a chicken pesto parm- it was missing tomatoes and brocolli what did they take full price for? It looks half empty what a waste of my 14$!!"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcE1iZmlnRRAB",
            "text": "Tasty and healthy option! Despite being a little pricey and super crowded at lunch time, I like this place for its variety of choices, quality ingredients and large portion. Anyway, you should know beforehand that this place don't accept cash."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbXRyY013EAE",
            "text": "While they can make some delicious salads, their downfall is consistently poor attention to take out and delivery customers. Oftentimes you will order a specific item, and the store will run out of it. Rather than cancel the order, or offer a partial refund, this location has decided to simply deliver incomplete meals as a matter of policy. This has lead to some truly extraordinary salads being delivered, from an arugula salad with no arugula, to a bowl that was supposed to be seven ingredients, coming with chicken, sweet potato, cabbage, and no dressing. When sweetgreen is working, the food is good and almost worth the incredible price. but recently, I have received orders with missing items more than half the time, with no solution offered, and no change to the total of my charge."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzM3RtLW1BRRAB",
            "text": "Worm in Miso Bowl..and it’s moving!\nDid you wash it at all?... That’s it, never going to this branch again.\n\n** Images are deleted every time I upload **"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDOGRQSVNBEAE",
            "text": "Their salads are locked, loaded,& delicious! My favorite is the Guacamole greens as is- with the Green Goddess, highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNWRhdF9RRRAB",
            "text": "Found a full cricket in one of the salads I ordered. I’m so happy they saw the legs and didn’t eat it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteWQzMXlRRRAB",
            "text": "I ordered a BUFFALO CHICKEN BOWL and this is what I got! NO CHICKEN, NO CARROTS, NO ZATAR BREADCRUMBS. Only lettuce. 16 dlls for lettuce. Avoid this location"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5Z01ETjhBRRAB",
            "text": "I never thought tipping culture in this country to become more laughable. So after I got my food and got my card out to pay, I noticed that Sweetgreen has, quite literally, blocked out their “No Tip” option on the screen with a sticker simply reading “Please use keypad”. They also covered the bottom-left “R” button with the same sticker, which is the key (on the keypad lol) for the No Tip option. I thought this was just plain funny, but as I was deciding what to tip, the cashier (who probably thought I was going to press R) lunged over the cash register to try to tap one of the tip buttons, essentially trying to deceptively charge me more than what I wanted. I quickly realized this and hit the covered-up “R” button because that was just messed up of her. Seeing this, the cashier shook up my bowl out of spite and slammed it in front of me. She kept the lid on… polite of her to mix my salad for me.\n\nNow I go here sometimes, but it’s only been like 2-3 weeks since I last went… what exactly has been happening that would yield this kind of action? Well, I got my answer tonight. It’s no wonder Sweetgreen’s becoming one of the less popular places in the neighborhood.\n\nBut to play “devil’s advocate”… and I’m no economist, but if these employees have taken such an extreme measure when it comes to TIPPING out of all things, are they even being paid livable wages??? Why are server’s acting this erratically with what almost seems like desperation?? What is the manager there doing? I understand cutting costs, but if my hypothesis is true, that manager needs to rethink everything.\n\nThat being said, food was still good and it seems everyone dining in is happy… as always. But damn…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREal9EVEt3EAE",
            "text": "Damian at the Columbia University location not only snapped at me for complaining about the VERY sparse scoop of apples he put in my salad, but was screaming and yelling at all his coworkers the entire time I was in there (which was a long…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURleThmWHJRRRAB",
            "text": "I would give this place 0 stars if I could. I ordered a salad and it has been pending to wait for a driver. I understand that the orders may be high, so I was willing to cancel my order. I was not able to contact sweetgreen nor the courier that is assigned to my order. I want a full refund, not a stupid $5.00 credit. That’s not enough of a credit in my opinion. It shouldn’t be a hassle getting in contact with someone when there’s an issue with an order. The numbers are bogus, they redirect you to an automated service where the only option to contact someone is via text."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURscTRMR29BRRAB",
            "text": "I’d avoid this place if you’re epileptic. The lights flash on and off very rapidly and flicker almost constantly. It makes dining here very uncomfortable. The food is fine so no worries there but I feel like someone really needs to fix the lights. It’s off putting, distracting, and as someone who works as an electrician professionally occasionally enough where you’d need to put a strobe warning up. It’s a little crazy???"
        }
    ],
    "reviews_count": 76
}