{
    "name": "Sipsteria Morningside",
    "place_id": "ChIJARJ-KwD3wokRWZpGoho2Mjw",
    "grid": "MN9",
    "address": "1264 Amsterdam Ave, New York, NY 10027, USA",
    "rating": 4.6,
    "user_ratings_total": 261,
    "phone_number": "(917) 388-2200",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMFZHSmZZMGd6WXpCSGExbFNOekJuVlZkMlNIYxAB",
            "text": "We loved the atmosphere and the staff! Very detailed oriented and sophisticated experience. The other Sipateria in NYC has a larger menu, but we enjoyed being able to talk to the waitress in a closer and more personalized way. Although the options we chose weren’t our favorite, we truly recommend this place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeVltMXBMV3R1UTJaSVgyaHVlVzVFUVZORVpWRRAB",
            "text": "This spot is an absolute gem—a perfect blend of relaxed charm and refined taste.\n\nThe coffee is rich and expertly brewed, and their selection of wines is thoughtful and diverse, with something for every palate.\n\nThe restaurant offers mostly Georgian food and verify of cheeses and charcuterie boards!\n\nThe staff are warm, welcoming, and genuinely passionate about what they do. Their friendly service adds a personal touch.\n\nThe ambiance ties it all together—cozy and stylish by day, effortlessly elegant by night. It's the kind of place you want to linger in, whether you're working, catching up with friends, or just enjoying a quiet moment to yourself."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOQ1VsTnBjbFZTYkV4eVgzQTRNMFJtYVc5dVdXYxAB",
            "text": "The medium roast Americano is truly amazing. Latte is also pretty good.\n\nThe atmosphere and interior design is impressive too. You get a quieter and less crowded environment if your timing is right."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbFlrZFljMXBpVHpOVVIwWlhTemRHUkZVeVRtYxAB",
            "text": "I really enjoy this cafe and go here several times a week. The staff are friendly and the vibe is cozy without feeling claustrophobic. The pastries are pretty solid as well. The only reason I can't give it 5 stars is because the espresso drinks are unfortunately quite mediocre, several rungs down from the third wave coffee shops that you can find pretty much anywhere in NYC these days and often indistinguishable from Starbucks. That wouldn't be so bad if the prices weren't very high... $7 for a cappuccino before tip? Get some skilled baristas and this place would be perfect."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnejZIYzRBRRAB",
            "text": "With its sumptuously cozy ambiance and furnishings, Sipsteria was a wonderful way to start my first morning in this bustling city. My mocha was served hot and perfectly creamy in a home-like mug (not remotely commercial). I had a chocolate croissant (be sure to request it warm) and then chilled on one of their comfortable chairs and benches. Service was quiet and kind. Great way to start my day. ❤️☕️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdnF6eTdRRRAB",
            "text": "When my friend told me that Sipsteria serves a Georgian tapas-ish dinner, intrigued instantly. Brought a friend here to try it out. She has been to Georgia but my experience is with Cheeseboat at Hell’s Kitchen and Chama Mama.\n\nADJARULI KHACHAPURI\nTraditional boat-shaped khachapuri with our blended cheese, baked in yeast dough, served with poached organic egg & Local Butter.\n\nNice pillowy dough, more on the saltier cheeses side than a diary/milky flavor. I think it is due to the salted butter and the cheese blend variation. Cannot skip on this.\n\nBeef and Pork KHINKALI\nOversized hand-rolled juicy Georgian dumplings\n\nOur server was kind enough to add one more to make it 4 so my friend and I each shared 2 Khinkalis. These are non-yeasted doughs and are similar to giant soup dumplings. Also a bit salty to my taste and doesn’t come with a cilantro dipping sauce. Flavor is not bad： Actually quite good, just not 100% matched with my salinity tolerance.\n\nAvocado toast salad\nFelt the need to have some salad so we picked this. Just as you would’ve imagined, 4 mini avocado toast with a huge side of salad. Dressed well with acid and vinaigrette. Refreshing to have on the side of the other heavier food.\n\nIt is hard to find Georgian restaurant on upper west side, let alone a good one. This place will be a great start if you want to explore Georgian cuisine. The servers were superb about telling you about their culture. I can foresee myself coming here again for a quick craving."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfLXJhejVRRRAB",
            "text": "In a city with a million coffee shops claiming to provide the best coffee, the best pastries or simply the best environment to relax while sipping a drink and casually scrolling your phone, few of them nail the concept of a third space as seamlessly as Sipsteria does.\nLocated at the heart of Morningside Heights, these folks certainly put the “morning” in MorningSide Heights. The space has been open for a little over a year and in that short time they have managed to embed themselves into the character of the neighborhood. So much so that their presence on the stretch of Amsterdam Ave between 122nd and 123rd feels like the kind of “no brainer” people have come to expect from a neighborhood that is gentrifying at a steady pace.\nThe shop offers fresh staples like muffins, scones, pound cakes and croissants, along with a small but well-executed selection of sandwiches, salads and paninis. The coffee is fresh and flavorful, avoiding any bitterness thanks to their new espresso machine. It's clear they've calibrated it to deliver a perfect cup every time. In the summer they decided to turn the space into an espresso and wine bar venue. As the afternoons turn to evenings, Sipsteria transforms into one of the most exciting wine bars to hit the area in a very long time.\nThe wine bar concept serves natural wines from known natural wine locations in Europe and South America, with a few American and Eastern European options as well. The stars of the wine menu, and what makes it more interesting, is the inclusion of Georgian wines. These wines have garnered a lot of attention in the past few years and continue to entice wine drinkers thanks to vinification techniques first developed in Georgia more than 8000 years ago.\nThe regular jazz bands, usually playing on Saturday nights, are another big draw. Their live music adds to the vibrant atmosphere that keeps people coming back.\nOverall, highly recommended!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMG9PbnVnRRAB",
            "text": "Last Friday, I had the pleasure of dining at Sipsteria with my friends to celebrate my husband’s birthday, and it was an unforgettable experience. The venue itself is absolutely beautiful—cozy, inviting, and perfect for a relaxed evening. The food was incredible, and we made sure to try almost everything on the menu. That said, the Tolma truly stood out—it was absolutely AMAZING! The wine selection is top-notch, offering a perfect pairing for every dish. The overall atmosphere is warm and welcoming, making it a fantastic spot to enjoy with friends. Sipsteria is definitely a gem in NYC, and I can’t recommend it enough!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOODlDUEh3EAE",
            "text": "The neighborhood gem <3\nThe aroma of freshly brewed coffee greeted me as I entered Sipsteria. The medium-roasted coffee is a true standout, striking the perfect balance between boldness and smoothness. Each sip was a journey through rich, aromatic notes that awaken the senses.\nThe French baked goods: from flaky croissants to crusty baguettes are just delicious. As for me I could not help but be drawn to the captivating display of macaroons. These petite delights came in a variety of flavors, each meticulously crafted with precision and love.\nBeyond the culinary delights, the cafeteria's interior was a visual treat. Elegant and tastefully designed interior together with friendly staff made my day! They were so attentive, knowledgeable and equipped with a genuine smile.\nThe ambiance of the cafeteria was both inviting and inspiring. Soooo, whether you're seeking a quiet corner to work on a project or a vibrant atmosphere to enjoy time with friends, this cafeteria seamlessly combines functionality and enjoyment.\nCongratulations on a job well done, welcome to the neighborhood and thank you <3"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMzZydGNnEAE",
            "text": "This place is my coffee shop away from home. Every time I'm on campus from Chicago you will find me here. The flavors are fresh and scrumptious. It's always a great experience! See you there."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2emN2Q0JBEAE",
            "text": "One of the coziest spots in NYC and Upper Manhattan! The atmosphere is warm and inviting, with absolutely delicious food and some of the best Jazz live music events in the city. Their wine, mochas, and mimosas are fantastic, but my personal favorites are the Adjarian khachapuri and the Georgian salad. A must-visit for a memorable experience!\nThe best personnel and the owners btw 🩷"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcUtpTU5REAE",
            "text": "Located in the “college town” of West Harlem where Columbia University calls home, this coffee/wine cafe with an amazing small tapas menu loaded with traditional Georgian fare (as in the country South of Russia and South West of Ukraine…not the STATE of Georgia) like Khachapuri and Khunkali. Their wine selection is all organic and beyond good!!!!  The vibe is pillows, patio chairs, mosaics, sofas, and cool music. I love this place. I can’t wait to try their mimosas and quiche that’s served during the day!!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqc083UHF3RRAB",
            "text": "Cycling loops around Cental Park and happened upon Sipsteria by chance.\n\nAs I walk through the doors, I feel positive energy electrifying the room. This energy can be summed up as eloquence & intellect from the students of Columbia intermingling.\n\nMy Americano was a delight to drink. The apple turnover was a nice 👍 treat. Decent selection of pastries and sandwiches.\n\nDid not get the pleasure of partaking in the wine. Definitely do so on a return visit.\n\nService with a smile 😊 and a charming bathroom. What more can a cyclist ask for?\n\nHmmmm…. Perhaps a bike rack?  🙏🏻 🙏🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOOGFYd1pREAE",
            "text": "My new favorite place for coffee, I loveed coffee so much I had to get a bag for my mum,( she is a coffee snob ) she liked it so much she already asked me to get her more. Staff is very friendly, atmosphere is cozy, I tried pesto sandwich and chocolate croissant, it was delicious. Looking forward trying their wine. This neighborhood needed place like this ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMlgxVjJiamRCVlRkUVpGUmthREZ2V2pCcVFVRRAB",
            "text": "Ordered so called \"georgian salad\" = got 1 sliced cucumber and tomato. When asked for extra dressing I litteraly got vinegar instead of real dressing that they were probably out of 🤣 pathetic...."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdDlpOGNBEAE",
            "text": "I've been a regular client of Sipsteria Espresso and Wine Bar since it opened, and I have never been disappointed. They have the best coffee blend, and my favorite is the Sipsteria Latte and pistachio almond croissant. Now, they have added hours from 5:30 to 11:00 pm and serve organic and natural wines along with tapas, cheese, and charcuterie. My favorite is the salmon tartare and Stori Amber wine from Georgia. They have a wide selection of wines from France, Italy, Chile, Georgia, Portugal, the Czech Republic, and more. It's a must-try place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcmRlOW5BRRAB",
            "text": "I've been a regular at Sipsteria since they opened, and their coffee blend has become my favorite. I especially love their Cortado with oat milk and almond croissant. Now, they also operate as an organic and natural wine bar from 5:30 to 11 pm, offering affordable happy hours that I adore. Be sure to try the open-faced tartine and the Pissador from Chile. I'm excited for the upcoming jazz live event and hope it becomes a regular feature. Thank you, Sipsteria, for bringing new soul to the neighborhood with your excellent service and friendly staff. The decor is beautiful and welcoming."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeDgtWEJREAE",
            "text": "If you’re looking for a cozy spot to chill with friends, enjoy live jazz, sip on natural wine, and eat delicious food - this place is a go-to. The vibe is warm and intimate, perfect for a laid-back night out"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WR09WUTJObEZuTTNSYWQyRkxOVGxuTkZCYVUwRRAB",
            "text": "Avoid this place — very creepy employee. Sipsteria management, you should fire this employee. His behavior is obviously extremely predatory and uncomfortable: serving you alcohol with the intention of getting you drunk and withholding the check as a mechanism to keep a customer there “so [she’s] the last one in the restaurant.”\n\nThis employee typically works the evening shift (long hair, ponytail). My friend ate dinner there alone once, and he started giving her free wine and kept telling her to chug it (which she refused). He kept trying to bring her samples of wine and make conversation with her. She kept asking him for the check to leave, but he withheld it saying that he wanted her to be the last one in the restaurant. She asked multiple times and he kept withholding, keeping her there for THREE hours.\n\nThis was one case that was very egregious; I’ve observed several other cases where he gives a lot of free wine to girls to get them drunk. I’ve seen him serve wine to girls he knows are in college without carding them and also repeatedly asked for their instas.\n\nThis pattern of repeated inappropriate behavior is highly concerning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUclk3elN3EAE",
            "text": "What a fantastic gem in the neighborhood! Sipsteria Espresso and Wine Bar has become my go-to spot. I absolutely love their organic wine list, especially the Stori Kisi. Their selection of cheese and charcuterie is excellent. The atmosphere is cozy and welcoming, and the staff is incredibly friendly and attentive. Highly recommended for both wine and coffee enthusiasts!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdEx2em5nRRAB",
            "text": "This place is quality. Been here several times, each time getting something different and it’s always been top notch. From their quiche, pastries, sandwiches to coffee and tee (try their iced yuzu peach green tea! Great flavor, could be a bit more concentrated, but best I’ve had). Prices are super reasonable, you can tell they use quality fresh ingredients."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSR1pITTJWMXBJVTFwRVpYUnBaMWxIYURSVlRWRRAB",
            "text": "Great coffee, and unique macrons. I love how almost every time they have samples to try! I always spot people working or studying here which is nice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZUdxc0xJLU9Pd2N3EAE",
            "text": "The staff was so friendly and the service was warm! We felt immediately comfortable in this lovely atmosphere. I’ve never had Georgian food before, but it was absolutely delicious. We tried the Adjaruli Khachapuri and the Khinkali—both were perfect, but the khachapuri especially blew us away. They also have a great happy hour. Highly recommend this amazing spot!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ka1pERXpkbVl3VVVoRFluVktPWFpEYjJkcVRsRRAB",
            "text": "I wanted to specifically shoutout Kanji (sp?) who took care of us when we had a $15 price discrepancy between what was listed on the menu and what the other worker (possibly manager?) was trying to charge us. Luckily he adjusted our price quickly and discreetly so I'm grateful to him. The staff was able to accommodate our large party, which was good as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydGJMRGJ3EAE",
            "text": "Sipsteria has quickly become my favorite spot in the neighborhood. Their special Georgian menu is outstanding, especially the Adjaruli Khachapuri and the beef and pork Georgian-style dumplings. The quality never disappoints, and their selection of organic and natural wines is impressive—Suriel is my top pick. Highly recommend!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQX3VfUWNREAE",
            "text": "Whenever I'm in Morningside Heights, Sipsteria is my favorite spot. Whether it's for a quick coffee break or a relaxing glass of wine, this place never disappoints. The cozy vibe and friendly staff make it feel like home. Their wine selection is amazing, and the food is delicious. Sipsteria is my little escape in the city🏙️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdWRyN3JnRRAB",
            "text": "I live around the corner from this cafe and I was really looking forward to it opening. There is no normal coffee shop in our area. I am already a regular guest of this cafe. before the children go to school, I buy fresh croissants with ham for them and very tasty sweets and macaron. For myself, I always take their amazing coffee from Colombia and Ethiopian. They make a delicious and amazing latte with oat milk and I always take a fresh quiche for myself. I always go there with my dog, they are very pet-friendly. They even have a special water bowl for dogs. The atmosphere is very pleasant and cozy with a very good and attentive service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cVBUSndBRRAB",
            "text": "Sipsteria has become my go-to spot in the neighborhood. They have an excellent selection of wines - my favorite is Pissador from Chile, and of course, the special food selections from Georgia. I absolutely love the Adjaruli Khachapuri, and the Chakapuli, their green lamb stew with tarragon, is the best!\nThe service is always attentive, and the staff is friendly and welcoming. It’s truly a neighborhood gem - not just for locals! There aren’t many natural wine bars uptown, and Sipsteria stands out as something special."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2Z2ItU1ZREAE",
            "text": "My favorite neighborhood coffee and wine place! Exquisite coffee in the morning and surprisingly delightful organic natural Georgian wine in the evening, paired with a selection of fine dishes. My go to place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOeGJYeVp3EAE",
            "text": "I always had struggle finding a good spot in the neighborhood but say no more. I loved everything about Sipsteria! This will be definitely my to go spot. Their coffee is one of a kind, their blend is so smooth and so delicious. I have tried Vegetarian Caprese on Olive Ciabatta and it was delicious! and those baked goods- OMG so delicious! The place is well thought and love everything about it! Service is amazing! Can not wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOeWREWjBRRRAB",
            "text": "I recently visited Sipsteria Espresso and Wine Bar and was impressed by its delicious coffee and pastries. The short waiting time in line, coupled with a nice atmosphere adorned with intricate design details, made the experience delightful. Can't wait to see their organic and natural wine list and Tapas Menu.\nHighly recommend it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENjg3cmxRRRAB",
            "text": "Since Sipsteria opened, I've been a regular visitor, and I must say, their coffee and baked goods are unparalleled in the neighborhood. The Cappuccino and Lemon Cake are personal favorites of mine. Recently, they've expanded their offerings to include organic and natural wines from 5:30 to 11 pm, complemented by a fantastic tapas menu and an extensive selection of cheese and charcuterie. The Salmon Tartar was a highlight for me. I'm looking forward to returning in the evening for another experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reFJUTm1XVGxYYkhsRU5GZEdiR1JYYzJJMFgzYxAB",
            "text": "Tasty food delivered by knowledgeable, friendly staff in a warm, welcoming atmosphere. So fabulous for dinner and wine. Coffee and pastries are excellent too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINGZmNEhnEAE",
            "text": "I recently had the pleasure of using Sipsteria, and I must say, it exceeded my expectations in every way. From the moment I started, I was impressed with their service.\nAbout their team: Every interaction I had was smooth, and I truly appreciate the attention to detail.\n\nOverall, I would highly recommend Sipsteria to anyone looking for a pleasent environment. It has not only met but surpassed my expectations, and I look forward to continuing to use it in the future."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeVkycDNPRWsxVjI5SllqUjBWR1pKU2tndFdYYxAB",
            "text": "Mid coffee, barista’s don’t know where their beans come from or what roast they’re offering. Couldn’t froth milk for a cortado. If I was still in uni, I’d love this spot for studying and would tolerate the coffee."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaXBTM1VBEAE",
            "text": "I’m visiting area with friend and  found this great wine bar. Sipsteria has a great selection of wine from around the world, food was amazing as well Salmon Tartar was my favorite. Service and overall atmosphere is great. Highly recommend visiting and have nice evening with delicious wine ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWVFVOVVUMWt3U2xOUWNWVk5UV2RMVVU1aVdGRRAB",
            "text": "Great little cafe - the staff is so nice; they have treated my girls are their own. The pastries are delicious"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ19xWGlnRRAB",
            "text": "Not too far from the transit and not too far from a mindful crowd.\n\nA nice place to wind down amongst a modest atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N2R2RmZREAE",
            "text": "Excellent service and atmosphere. Great coffee and music. Must-try muffins (blueberry financier). One of our go-to spots in the area."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdk56aFZ3EAE",
            "text": "A wonderful assortment of wines. Those who love wine should taste it.\nThanks to Sipsteria for such a wide range of wines. I will visit you temporarily🫶🏽🥂🙏"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaXBTZXBBRRAB",
            "text": "Interesting Natural Wine list and great food, Loved their Adjaruli Khachapuri. Welcoming service and great atmosphere! Will come back for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNmNfUUFREAE",
            "text": "The best place i’ve visited so far in nyc!! Definitely must order avocado and shrimp salad, Xinkali and atcharuli… It is a cozy and welcoming spot, perfect for a relaxing meal.  With a wide range of wines and helpful staff to guide you, it's a dining experience that you won't want to miss, whether you're a local or just visiting!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYVhubzI1czVTZk9BEAE",
            "text": "Such a lovely spot!! The wine is delish, the decor and outdoor seating is so cute. Great chill spot to hang solo or with friends."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnd19xMXZBRRAB",
            "text": "This boutique coffee shop located in Upper West Side of Manhattan, became one of my favorite coffee shops near my neighborhood. The decorating is unique, simple yet classy, the service is very good and the coffee is strong. I also like their fine plates and coffee mugs."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdDRxZHpnRRAB",
            "text": "I walked in at 4:20pm and wanted have a quick espresso and a coffee for my father before attending a lecture at Columbia University.  I was met by the cashier who repeatedly told me that they close at 5 and when I asked for my order he was suddenly out of coffee, and gave me the feeling I wasn’t wanted there. I saw plenty of people there sitting enjoying themselves so I’m not understanding why I was treated this way.  I’m sure ownership wouldn’t like their business ran this way being that there was close to an hour of business time left."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUFdtbDJkVWN6ZVZWTk5YTkpOV2g2VURVM1pGRRAB",
            "text": "We loved it here! Great food (especially the Georgian dumplings) and we also had friendly service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWVYwUmxZVzlxV0RSNVRYbzFOVTB0VTJweGEzYxAB",
            "text": "Honestly the pkhali was not good, and way too expensive for what they give you. Better to just save your money and book a flight to Georgia. Can’t speak to their wines"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3XzRQWGRREAE",
            "text": "Lovely Georgian wines and space. Staff were extremely kind. The tapas I had were good, however perhaps a bit too small of a portion. But I would go back and try another dish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMEpLazV3RRAB",
            "text": "Such a lovely addition to the neighborhood! Great ambience and service. We stopped in for early dinner and were able to try a few delicious Georgian wines. The server was so charming, and he was very helpful with recommendations and interesting tidbits about Georgian wine and cuisine. Food highlights: the eggplant rolls and the lamb dumplings. I can’t wait to return to try their coffee/pastries and to swing through on a jazz night!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2LUpYOHJRRRAB",
            "text": "We've come by for coffee in the morning and for wine in the evening. The atmosphere is always cozy and inviting; there's both indoor and outdoor seating. The wine menu is organic and natural, with a few standout Georgian (the country, not the state!) bottles. Their sandwiches and khachapuri are excellent."
        }
    ],
    "reviews_count": 50
}