{
    "name": "Crispin's Hell's Kitchen",
    "place_id": "ChIJPej-FQD3wokR0prr8I9ftPE",
    "grid": "MN9",
    "address": "1792 Amsterdam Ave and, W 149th St in, New York, NY 10031, USA",
    "rating": 4.8,
    "user_ratings_total": 178,
    "phone_number": "(646) 666-0958",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdE4yWTRUSEpEZVhsWU9YbDRjMnhwU1U5RGNYYxAB",
            "text": "10/10"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OeVNWVk9YMU5aU0ZneVVrb3RSVWRoT0c1M2JrRRAB",
            "text": "Just home from a lovely dinner at Crispin’s in Harlem. Not only delicious, but a wonderful atmosphere and staff. Michael was charming and attentive. Destined to be our new neighborhood haunt for authentic Italian food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSU9XTTVWVGM1Vkc1WmRXazBiV05TUjNKU09FRRAB",
            "text": "Amazing experience! Mr. Michael was the best server  friendly, attentive, and truly memorable. He even remembered us from the night before, asked about our show, and knew our exact order. His professionalism and charm made our dining experience unforgettable. We loved the restaurant so much that we came back a second time, despite the countless options in the city. Huge thanks to Crispin for the special dessert — the perfect finishing touch. 10/10!"
        },
        {
            "date": "4주 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdVgzUjJkbTh5TW5OU1luTldTVk4zUzFWSk9XYxAB",
            "text": "Ladysnight war super 👍🏻 Service und Essen 👌🏻🤩"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sd0xVUTBaMnAyYm5oMU56ZGlSRzl0U2xKelpuYxAB",
            "text": "I thought this was a Restaurant? Karaoke??? Really? Some lady there blowing her loud hole all nite with drunk patrons who weren't even eating....as We tried to enjoy our dinner. The decor says glassy restaurant but the atmosphere says DIVE BAR!!. Last time we go there. Go NAVY!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaVIwUktORmxWTUV4eFYxb3hSR00xU1dGSFdGRRAB",
            "text": "Mussels were worth it, super big bowl with a ton. Lobster ravioli was al dente and done well, pink brandy was delish. Octopus on a potato salad was also yummy. Octopus was cooked well, and the beans paired well with the meat. Good service, would come back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScVpuUklia3d5Tm5GTVdHb3hSMWd4YURkWVUwRRAB",
            "text": "Get. The. Crab. Cake. Period.\nThank you Michael for a lovely time!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWVdGOXNUSGczZVVFMk1VVmpia3BVWldOeFlsRRAB",
            "text": "My friend and I went here on a Saturday night and the food and service were incredible! I have a feeling that once the word gets out it’s going to be hard to get a table."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUFRrZzBjbTFwTm14RGMzTjNORlJRYWtoeVRVRRAB",
            "text": "Honestly everything was fantastic. If I lived here this would be my neighborhood place. Incredible service and food. 5 stars +"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psemNqUnFlRkJsY0UxVlNIWnhUREV5U0dwbkxXYxAB",
            "text": "Amazing place! The food is absolutely incredible, one of the best bolognese I’ve ever had! Carbonara also amazing and the squid ink rice is also delicious!! The waiter was super nice. 10000/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxc2VXRm9YM0pmVUhKNVVETnRORjlVV1dVM2NuYxAB",
            "text": "I enjoyed delicious gluten free Pasta Primavera  in this beautiful, cozy eatery.\nThe food was fresh, tasty, and I'll definitely be back\nCan't wait to try the Eggplant Rolatini,  mussels, and a glass of wine on my next visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUE1tWkxWa1JsUTFveFFsZFBTbVZDVjFBM1JFRRAB",
            "text": "Great food and it's hard to find perfectly cooked pasta for $18! Gorgeous decor and Michael our server was over the top great! A new favorite place! Will definitely be back again soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JemFESkRXSGRmVGkxT09ITlBXVTFMWmpod01XYxAB",
            "text": "Today I came in with my family and my server Walid was extremely nice and professional. He provided us with the daily specials and was very informative. The food was delicious and the atmosphere was nice and quiet. I would definitely be coming back for dinner"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRVZGSnFZM2h0ZDFKM2NHcDNZWGMyYkhCMmNYYxAB",
            "text": "Walid thanks for you exellent server, and the food its Amazing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKQlpubzBjV1pEUVZaMlpIVk1iVkZHZEhrNVZGRRAB",
            "text": "Amazing spot, great food, fresh, fast service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCU1ZscGliVXM1UmxVMFZuRllWM1JJV0d0NWIzYxAB",
            "text": "My girlfriend and I recently had dinner here last night and we couldn’t have been more happy with our experience. Walid was very accommodating and we were truly impressed with his knowledge and attentiveness which made our experience that much more enjoyable. Both the food and the service were a 10 out of 10 and we will definitely be back in the future!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRGFtbE1ZbXA0ZUhrdFgzWjJhREJZTnkxSlVGRRAB",
            "text": "La comida es muy rica y Exelente servicio muy amables recomendado"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjME1XTm9VbEpUTURGWk0wNUdiVWxrVlhveGFVRRAB",
            "text": "The food and ambience were amazing. I came here for brunch and I ate everything that was on my plate. The Prosecco was  amazing ! I would keep coming back here!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkaGJIb3hZMFZJUlVsUGVuSmFSM2xTYkZWbVZIYxAB",
            "text": "La comida extremadamente rica y el servicio espectacular . No pierdan su tiempo en los demás restaurantes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xc09FbFljWEF4VTAxUVVHWnpjR2xzZW1KZlVIYxAB",
            "text": "The best !!! We had 4 different items everything was amazing 🩷"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVlIwMVVWelV4ZEZSaGFEWkJiR3hoV1U5eVpuYxAB",
            "text": "I have known Crispín for over 30 years. He has consistenty show his live for food and community. I recommend coming to the restaurant do you can experience the vine yourself. Once you come, you will leave satisfied and looking forward to…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OcFprbDVUMFEzZVRGQ1YwOVlWR1JUY2pZNVpFRRAB",
            "text": "The  experience and food were great!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WYVRHNXJUbUpPVW5SQ1pYVm1NRzFxVkVGSFVFRRAB",
            "text": "Delicious food, very attentive staff and great atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSExYbGhZeTF0WlZoUWMyRmtWRlV4WWxaWFlVRRAB",
            "text": "Our gang of friends loved this place. The food was great! The waiter won our hearts. We didn’t catch his name but shout out to our waiter he’s a part time Broadway singer and does movies here and there !!! If you get him as  your waiter ask  him to sing your dessert menu you won’t regret it !!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNlJXNDNSa0owUzI5ak1WQnhVa3c0VjJSamFuYxAB",
            "text": "Amazing place i can't believe there is not more coming as it's pretty empty when i came around lunch time. Ordered skirt steak and it was crispy and savory on the outside and really juicy inside. Recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVVUyeE5TM0pGV1hGeVREZGFlRWxyWldoT2JYYxAB",
            "text": "This pasta place is amazing! I always get the spaghetti alla pescatora, the sauce is rich and flavorful, and the noodles are perfectly moist. I love it here and will definitely keep coming back.💯😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaFExUXRlWFUwZGxWVVUwcERVRkUyV21aVlZHYxAB",
            "text": "Loved it here. Great menu. Great service by Paulette."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSmJGUnJYekJ5WVRoa1kwcFpabE5mUkRFeGNXYxAB",
            "text": "Food was great. Very nice customer service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSFVrWlNVbEpwWkdaMmJGaDVSekJXVDBwcFUzYxAB",
            "text": "I love coming to Crispin’s. The atmosphere is lovely & all the pasta is homemade. My bf had the steak which was amazing. Highly recommend for a date night or even solo dinner!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWGRUWjBPVkYzUzBoVk56bFdRWGhuV0VObFIwRRAB",
            "text": "súper"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kc2FHRnVZM1JZWmxKdlJUbHBPSFYxV1ZZNE9GRRAB",
            "text": "Absolutely love this place, all the staff are super friendly and welcoming, and the food was incredible. I had the squid ink risotto, followed by a pistachio cheesecake and I would definitely recommend it and have it next time I return. We were even lucky enough to meet Crispín himself, it was nice to be able to personally compliment the chef."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeGJYbFBkWFV6VG1ocFdFTXhlbFpITldOV1pVRRAB",
            "text": "Very friendly staff, and Crispin is awesome :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKNzJ1cGZXNzUtOGp3RRAB",
            "text": "Great local spot for Italian food with nice staff. It wasn't very busy on a Thursday night, which was ideal for a nice quiet evening.\n\nMy favorite dish by far was the carbonara, which was very creamy and came out piping hot. The mussels were good--I loved the broth but with the mussels themselves were a bit bigger. The pork chop was good as well, especially around the fatty areas, but still a little dry in the middle.\n\nThe price is also very affordable which really makes this a great value restaurant for me."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLTDVtNTd3cEpHZFZBEAE",
            "text": "Really cozy environment. The wait staff are very attentive and the food is really delicious. If you’re looking for an intimate evening this is a great choice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKUG8zTmJXdUxQaG9RRRAB",
            "text": "Great food jazz and service. Really enjoyed"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKSHd5YVBVdDhxVU9REAE",
            "text": "Great atmosphere, wonderful service, friendly staff, the music was good the appetizers was delicious we order the Bruschetta sadly both of the main entree were disappointing. The fettuccine Alfredo was bland, and even so was better than the lamb shank that was unsavory, flat the whole plate was tasteless."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYU5vcnJSd2FmMk9nEAE",
            "text": "Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdW83NFROLVlxOHhBRRAB",
            "text": "The food was delicious and amazing. Better than the one I had in Rome! The jazz music was fabulous. Had an amazing night!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQUzl3X3U5N3ZPTUVREAE",
            "text": "Best Italian restaurant uptown!\nThe seafood is out of this world!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJWEQ0NDZtd2RYSTZRRRAB",
            "text": "This is an amazing restaurant! I had chicken Alfredo here and it’s amazing i’m addicted. I either eat in with my mom or I get take out from here. There was one meal, forgot the name, but it was bread topped with fresh tomato sauce and some cheese; it was incredibly delicious. I hope this stays open forever so my great great great grand children can enjoy it too 😂"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOT3UyT3pkcUsyelpREAE",
            "text": "Beautiful place, magnificent food, even better customer service! 10/10"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMRDh2dlBmcXRxWWdRRRAB",
            "text": "The food is absolutely phenomenal. Giving superb quality at a fair price. The portions are hearty without being overwhelming."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQSFI3WU8tamZTRDh3RRAB",
            "text": "Simply delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMSy1tLTd5NVptX1h3EAE",
            "text": "the food is  😋😋😋👌👏👏"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd3JPSkFREAE",
            "text": "Food was absolutely delicious! Lovely atmosphere in the afternoon. Service was superb! We would highly recommend this restaurant."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNVByUmdBRRAB",
            "text": "My first time here and I loved it! I wanted to spend some quality time with my boyfriend before his trip so we wanted something intimate and relaxing. This was it. The ambiance was cool and chill. It wasn’t jam packed like the Broadway situation, thank god. (They also offer outside seating) Btw, the food was BOMB! (I had the lobster ravioli which I lovedddd, and the meatballs!) + the wine was super cute. (Meaning we were tipsy off of one bottle!) loll.. we drank white wine (Vermentino to be exact) however,  we will be back. Can’t wait! My boyfriend is also looking forward to going back. I usually snap photos but I was so excited to try this place that I just gobbled everything up as we didn’t have much time together to spend before his flight. When I come back, I will most likely re-order the same thing + more, so photos will be provided! *wink* long story short, if you’re looking for delicious authentic Italian food, this is it. Anushka was our waiter and she was knowledgeable and sweet! Thanks for the hospitality everyone - great job 👏🏼"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaXRpSjV3RRAB",
            "text": "If you're looking for an unparalleled dining experience in the heart of Manhattan, you can't miss Crispin's Hell's Kitchen.  This restaurant stands out not only for its exquisite food, but also for its cozy atmosphere and the top quality service it offers to its customers.\n\nFrom the moment you set foot in Crispin's Hell's Kitchen, you realize you're in for a special experience.  The decoration of the place is modern and elegant, with a warm and sophisticated atmosphere that makes you feel at home.  The soft lights, finely decorated wooden tables and artistic details on the walls create a perfect atmosphere to enjoy a memorable meal.\n\nThe real star of Crispin's Hell's Kitchen is, without a doubt, its food.  The menu is carefully crafted to offer a wide variety of dishes that reflect a perfect fusion between traditional Italian cuisine and contemporary touches.  The ingredients are always fresh and of the highest quality, guaranteeing that each dish is a delight for the palate.\n\nTo start, the starters are wonderful in themselves.  I recommend trying the tomato and basil bruschetta, crunchy and full of flavor, or the beef carpaccio with fresh arugula and parmesan cheese, a classic combination that never fails.  Caprese salad, with juicy tomatoes and buffalo mozzarella, is another excellent option to whet your appetite.\n\nAs for the main dishes, the options are as varied as they are tempting.  The pastas, handmade and cooked to perfection, are a true work of art.  Spaghetti carbonara, with a creamy sauce and crispy bacon, is simply irresistible.  If you prefer something lighter, ravioli stuffed with ricotta and spinach in tomato and basil sauce are a sublime option.\n\nSeafood lovers can't miss the seafood risotto, a creamy and flavorful dish, with a generous amount of shrimp, mussels and squid.  For those who prefer meat, filet mignon is an excellent choice.  Cooked to perfection and served with a red wine reduction and truffled mashed potatoes, it's an experience you won't soon forget.\n\nAnd, of course, no meal would be complete without a dessert worth remembering.  The tiramisu at Crispin's Hell's Kitchen is, without a doubt, one of the best in Manhattan.  Creamy, with a perfect balance between coffee and mascarpone, and sprinkled with cocoa powder, it is the perfect finishing touch to an incredible meal.  Panna cotta with berries is another delight that you cannot miss, light and refreshing.\n\nThe service at Crispin's Hell's Kitchen is impeccable.  The waiters are attentive, friendly and always willing to recommend the best dishes and wines to accompany your meal.  The chef, a true master of the kitchen, frequently comes out to greet diners and make sure everything is to his liking.  It is evident that there is a passion and love for cooking that is reflected in every detail.\n\nIn short, Crispin's Hell's Kitchen is not just a restaurant, it is a culinary experience that celebrates rich gastronomic tradition with a modern and sophisticated twist.  Whether you're a foodie or simply looking for a memorable evening in Manhattan, this is the place to be.  Don't miss the opportunity to visit Crispin's Hell's Kitchen and be seduced by its unmatched flavors.  I assure you that you will want to return again and again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcjZ5RUVREAE",
            "text": "This is the best place, they were so kind and the service was amazing. I would recommend this place for special occasions. The food was amazing and fulfilling."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvemFEcldnEAE",
            "text": "Such a nice place. Splendid food. Home made pasta- chicken with some really delicious sauce. Amazing good live jazz 😉👍🎶"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbzV2TndnRRAB",
            "text": "Food was delicious and fresh. I do wish the server checked on us more often, we had to kind of flag them over often to ask for additional drinks etc. they were very sweet and brought out a complementary bday dessert."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeXNEdHlRRRAB",
            "text": "I had an amazing experience at this restaurant. The place is beautiful, with a lovely atmosphere that makes you feel relaxed and welcome. I ordered the black tagliatelle, and it was absolutely delicious—easily one of the best dishes I’ve had in a long time. They also serve a fantastic sangria that perfectly complemented the meal. The dish was so good that I would definitely eat it again. It was worth every bite! I’m already planning to go back and try something new from the menu. Highly recommended for a special meal or a nice night out."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNUl5a3V3RRAB",
            "text": "I’ve been eyeing this spot for a while & am so happy that I finally decided to dine in. Our server Zack was very sweet & attentive. Our water glasses were never empty throughout our dining experience. He checked in for our feedback during every course. We ordered calamari to start, pollo al limone & orchette pasta for entrees & finally tiramisu for dessert. The pollo al limone was stellar with the most luscious sauce that I wanted to bottle up and take home with me. The tiramisu was spot on & overall we loved everything we ate. Crispin’s checked all the boxes for service, food & ambiance. This spot exceeded our expectations & we will definitely be back to try more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbWFuZGhnRRAB",
            "text": "I saw Crispin’s appear a couple months ago and I was excited as it seemed like a nice new Italian option in the neighborhood. Luckily my expectations were not only met but exceeded! The food, service, and ambience here are all fantastic. I highly recommend Crispin’s Hell’s Kitchen and have now eaten here about 6 times in the last two months.\n\nMy favorite dish is the carbonara - so delicious. But I’ve had multiple dishes by now (and most desserts) and it’s apparent that they place a very high focus on quality and flavor. I just asked my server who mentioned that all deserts and pastas are homemade, and I am not surprised. So good!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMnRmcTB3RRAB",
            "text": "Update: tried this restaurant again and had a great experience. Our server Luis was knowledgeable and helpful in choosing some new dishes to try. The favorite was the whole branzino. It was delicious. We also tried the chicken Alfredo and the bolognese pasta. Both did not disappoint. To wrap up our meal we had the lava chocolate cake. Our daughter loved it. Everything was made fresh and to order. So if you are looking for quick service, this may not be the place for you.\n\nDecided to try this restaurant to celebrate our friend’s 50th birthday. From the moment we walked in we were greeted by our waitress Valentina. She was super sweet and though it was just her 2nd day on the job, she was able to answer all of our questions about the menu. To start we shared the eggplant rollantini and the crabcake. Both were delicious! We each had a different pasta dish- the lobster ravioli, the black tagliatelle with crab meat, and the linguini all vongole. We loved all of our dishes but the black tagliatelle was the favorite. We can’t wait to go back to try more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydGFfeFVREAE",
            "text": "A small restaurant, but good enough seating, decorated beautifully, playing old school Italian music, the waiter amazing. I went during a time for lunch, it was not crowded, I was in there by myself. I gave it 3 star, i simply was not impressed with the dish. Granted I only ordered one thing, but I just felt the dish  didn’t have enough flavor I had got linguine carbonara. The bacon wasn’t crispy. Pasta was Al dente. Maybe on a different day I will try something else."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucTdMcDlRRRAB",
            "text": "It was a magically wonderful evening, having dinner with my\ns🌞nshine and his beautiful lady, Jacqueline..\n\nMichael is an amazingly attentive \"dining assistant or dining guide\"\nI never liked the terms: waiter, waitress,  barmaid, 🤢.\n\nThe ambiance was perfect.  I didn't have to shout over my food for my guests to hear me.\n\nIt was a lovely rainy Sunday afternoon for dinner with loved ones in a cozy & warm place.\nPriceless-💓💕🙏🏽😘\n\nThank you for the memories, Crispin's. 😊📷"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUXy1TMkZREAE",
            "text": "Exceptional dining experience!\n\nFrom the moment we walked in, the ambiance was inviting and elegant. I started with the barbietola which was exquisite, then the linguine alla vongole, it was divine and ended with the pistachio cheesecake. Not only was the food outstanding but the service was impeccable. Our waitress was attentive and knowledgeable, ensuring that our dining experience was nothing short of perfect. I highly recommend it, I will be back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMXA2cWpBRRAB",
            "text": "Let's see...where do I begin?  Today was a perfect day for Crispin's.  Why, you might ask?  Becuase it was a lovely autumn, gloomy, cool day!  I love autumn, btw.  Anyway, and as usual, I've seen this place quite often, whilst in the neighbourhood, and told myself to go and go I did!\nThe restaurant is one of the most comfy and cozy; the ambiance, décor, everything was so soothing! Anyhoo, I was the first and only customer there.  The music was at a relaxed volume and I loved the tunes!  The bathroom was clean and had soap!  (I'm a stickler when it comes to restaruants having soap.)   There were so much I wanted to try, but ordered brussel sprouts\nsautéed with hot sausage and honey and the eggs benedict\nwith hollandaise sauce with Canadian Bacon.  Food was flavourful, nicely seasoned, I just enjoyed all I had!  I ate EVERYTHING!  Nothing was left on both plates, lol!\n\nMr. Crispin and Mr. Blanco were simply the best! Service, food, professionalism, friendliness, hospitality were all 💯💯💯💯💯💯   I enjoyed being in there by myself, but I hope this restaurant continues to thrive!!!  We had pleasant conversations and the vibe was just perfect!  There aren't many or any restaurants like this in this neighbourhood, on Amsterdam Avenue in upper Harlem and I've been here all my life.  Keep up the great work, Crispin's!  You get a lot of stars!⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNHN5MU1REAE",
            "text": "Best Italian food, I highly recommend this restaurant. We had calamari and bruschetta as appetizers. For our main dishes we had polpetti and linguini alla vongole it was phenomenal.\nSo delicious!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ai1UYlN3EAE",
            "text": "The food was fantastic. Could have used a sprinkle of salt in general, but we loved what we had. The salmon was great, as was the calamari, the eggplant rollitinis, and the chicken parm. The sage butter tortellini had room for improvement, but we still ate it all. No liquor, only wine, and not a massive selection of that. Still, great food and friendly service. Oh, and the ambiance was fantastic but also, there was live jazz as of around 7 pm. It really was a delightful atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3al9DMXh3RRAB",
            "text": "I’ve been here several times and it’s always a vibe! The food and ingredients are fresh and very flavorful. The pollo al limone, braciola, and carbonara were all delicious. The ambience is pleasant with cute decor and nice music, and the service is very kind and attentive with great recommendation's. I would definitely recommend Crispins for any brunch or dinner plans."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5M3VPSnJRRRAB",
            "text": "We have enjoyed Crispen's cooking for years, but his new location, \"Crispin's Hells Kitchen\" in West Harlem, is his best venture yet! Located on Amsterdam and 149th, This cozy, romantic venue has menu replete with Crispin's specialites: fresh homemade pastas with delicious sauces, delicate fish and seafood, delicious pork, veal and chicken dishes, with generous portions and incredibly friendly service- it's a winning combo! This is now our \"go to\" Italian restaurant in West Harlem. Bravos Crispin!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURid3RQbzhBRRAB",
            "text": "I’ve been living in Harlem all my life and never have I been this disappointed in an establishment. I had ordered food to go because the images of the food look like authentic Italian but it certainly was not that. The salad was over dressed in dressing (wayyy too many croutons). Both seafood vongole and tagliatelle pastas were over cooked and had no flavor, (may I suggest using more garlic). And the vongole dish was drenched in clam sauce and olive oil. This place is WAY too pricey for the quality they are giving. I really wanted to enjoy it as a person who loves pasta and has been to many Italian spots but I must say this is probably one of the worst pasta dishes I’ve tried. The only thing I can say was decent was the bread and calamari."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaTd6a1ZBEAE",
            "text": "The place has a really nice vibe, good music and a good food selection. Perfect to take someone on a date!\n\nI ordered the Stinco and it was delicious, the meat fell right off the bone. I accompanied it with a glass of Pinot Noir and paired pretty good.\n\nThe place was full of people and the service was good and fast, would recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2b0lXZW9nRRAB",
            "text": "I recently hosted our office holiday party at this outstanding restaurant, and I couldn't be more pleased with the experience. The ambience was perfect for our gathering, with a festive yet sophisticated decor that set a cheerful mood. The lighting was warm, and the seating arrangements allowed for both mingling and comfortable dining.\n\nThe food was nothing short of exceptional. The catered menu featured a variety of delicious options, each one crafted with care and attention to detail. From the appetizers to the main courses, every dish impressed our guests with its flavor and presentation. The standout was definitely the seasonal special, which received rave reviews from everyone.\n\nThe service was exemplary as well. The staff was attentive and friendly, ensuring that everything ran smoothly throughout the event. They were quick to respond to our needs and went above and beyond to accommodate any requests, making our celebration even more enjoyable.\n\nOverall, this restaurant was the ideal choice for our holiday party. It offered a perfect blend of great food, inviting ambience, and outstanding service that left a lasting impression on our team. I highly recommend it for anyone looking to host a memorable event!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqX08tVElREAE",
            "text": "It is a jewel in Upper Manhattan. The food is amazing. I had the Irvin’s Homemade Polpetti. Exquisite flavor and texture. No heavy at all for a dinner choice. Superb attentive service, atmosphere great, music wants to make you dance but goes along with the theme of the restaurant and atmosphere. Great place to meet with friends, first date or just to relax and enjoy a delish meal! Reasonable prices - High quality overall."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQza3ZUbTJRRRAB",
            "text": "Absolutely loved this place! The service is amazing, servers and owners are kind & efficient people. The quality of ingredients and taste of food is one of a kind, it is definitely one of the best Italian restaurants I’ve every visited. I’ve never ate food so fresh and flavorful in an Italian restaurant. I was there for a total of five hours ordering plates, trying desserts and enjoying the ambiance. The prices were extremely affordable for the amount of food and drinks ordered. 10/10 recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NEtieUx3EAE",
            "text": "We just had a great dinner of four at Cristin’s . We started off with the fried calamari fritti which was great but the crab cake was my favorite!  For the main course I had was the Braciola the meat was so juicy and flavorful! And for dessert the tiramisu was delicious Everyone enjoyed their food ! Great attentive service from our waiter Zack. We had the pleasure of meeting Crispin a very kind and humble person. We found our new favorite place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydzZ5eXZRRRAB",
            "text": "Amazing food and service from this great new neighborhood spot.\nCan't wait to try a different dish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6M09yUTd3RRAB",
            "text": "A great new restaurant in Hamilton Heights! The taste and presentation of all of the dishes was immaculate and we were pleasantly surprised at the fair prices, especially for such quality Italian. The ambiance was inviting and not too loud. A great place for a nice meal where you can talk. I took my parents who were visiting from out of town and we loved it. This would also be a great option for a date night! The brown butter and sage pasta was a favorite of the night, but everything was great. We will definitely be coming back again! I only wish there were more people in the restaurant for their business. I’ve lived in the area a few years and the location can be tough to get filled for some reason, but don’t miss out on this spot! It deserves to be filled every night!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eF8zRFBBEAE",
            "text": "we had a lovely server named alvaro who definitely charmed the entire resto -- they were so so so sweet to all of the tables and just so extremely patient (even as a young toddler was running amok) and communicative. they told us they had only recently started in the food biz, which was such a shocker since they had such grace and professionalism. I saw them help another table with a very last-minute holiday catering order, which is never easy.\n\nthe food was definitely... ok -- it tastes like what it's supposed to, if I had to write something about it. the other table said the spaghetti was the best they've ever had, so maybe a visitor would agree more with them than with me. I'll leave the food review at that...\n\ntldr: service was great ♥️"
        }
    ],
    "reviews_count": 71
}