{
    "name": "El Porton",
    "place_id": "ChIJ7wBO30H2wokR1yFm2_zfDVE",
    "grid": "MN9",
    "address": "3151 Broadway, New York, NY 10027, USA",
    "rating": 4.1,
    "user_ratings_total": 567,
    "phone_number": "(212) 665-7338",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sweldUbFVZa1p4VjIxUVMxWlRWVlJZYURVMWJWRRAB",
            "text": "From a Long time loyal regular customer- I don’t like bugs in my drinks. From the server or the owner - I would replace the drink . Or take it off the bill. Nope. This establishment doesn’t care."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dE0wcDBVRnBWUlVseWFYRjNUV0ZNTlU1b1NFRRAB",
            "text": "First time with family.  Enjoyed the food, drinks, and service.  It's relatively small in terms of size  but cozy.  They played good music.  Overall, we had a good experience.  Will definitely visit again."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMVVUQktNVVkyYjFCU1dtUTJYM2MzWWpkTlkxRRAB",
            "text": "Cute restaurant for a date night but food and prices aren’t great. The portion of food is really small compared to the expensive prices unfortunately. Also very cramped inside so be prepared if you come with a bigger group. Service is quick though and margaritas/ sangrias are good."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSFNIUllYMk5YTlUwNE1IUXpaWEZqYkVOM1RXYxAB",
            "text": "This place must display some kind of sign about their preferences of customers who are welcome here, the crew let you truly feel the Latinos are not welcome"
        },
        {
            "date": "1달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVlpIQm5WM1ZsWlVnemJHMTRORmwzZEdGblkxRRAB",
            "text": "Amazing caipirinha!!!!!!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNlNucEVSWEpvV1d0dUxVVm1UM0JtTlVNNFprRRAB",
            "text": "Reasonable price great food. Had steak fajitas delivered so can’t speak on atmosphere and service. Rice was a little dry. But Guacomole and salsa were very fresh. Steak perfectly seasoned."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSU1UwSXdSVTV6U1Y5WWVuWllRalJSVEZCT1lYYxAB",
            "text": "Ordenamos enchiladas suizas verdes y tenían demasiada SAL no fue mala la experiencia con este platillo tal vez no se quejan mucho y el dueño no se entera de cómo preparan su comida o tal vez ese día fue un descuido del chef. Espero y tomen en cuenta  los comentarios de los clientes. Gracias"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUFJ6UkRVRE42U1d4cWVXeDFkUzFWZFVOc2NXYxAB",
            "text": "Recently, I visited with my family and found the food to be just okay - not particularly tasty. However, the service was outstanding, with a wonderful atmosphere and attentive staff, but I've had better Mexican food, sorry. On a scale of 1-10, I'd give the food a 5 or 6."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRWFGaFRMVGd0WlUwMU0xbzBNbVZPTUdWMGRFRRAB",
            "text": "Service was horrible, Waiter never came up to us we had to get their attention from the moment we got seated, All food came out wrong and they acted as if they didn’t want to fix it. 1/10 never again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVE5rUlJRM05qVWpoc2FqUnVRbTFIZVRGQ1JHYxAB",
            "text": "The food I had here was up to what I expected for a fajita. My sister also enjoyed her food and we generally enjoyed the excursion. the establishment felt a little dingy, and the seating was the best, but the atmosphere was still well kept. Only real issue was the condescending servers who seem bothered by questions about our order, but loudly gossiped by my table the entire time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUFJtSXhZbE0wUkVaT01qaGlZbXRIU2toWmNuYxAB",
            "text": "I've been at many places, but this one it's not as great for the price of everything,  we were 5 people 3 adults and 2 kids only regular food , tacos, burritos, grill chicken with rice and beans and NO alcohol,  $236"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMFZUVXlaVzAwZEVkclZ6aDZlbmx0U0ZvdGFuYxAB",
            "text": "Really solid food.  Great people, comfortable atmosphere."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSLTVLeG9RRRAB",
            "text": "I’ve been to El Porton so many times previously and was a huge fan. That’s why it’s so sad to leave this review.\n\nMy colleagues and I placed a to-go order a while ago. There were numerous things wrong with the order, unfortunately. One of which was that one colleague received the wrong item completely (received tacos instead of a taco salad). The other one was a piece of green thread inside the food of my other colleague. Truly disgusting.\n\nI went back to the restaurant that same day and showed them the photo and also explained all of the various other items that were wrong with the order. They acknowledged the thread was the exact type used to tie their tortilla bags. I explained that I understand things happen, but we just needed to let someone know and make things right with us. I was advised to leave my phone number and someone would call me back.\n\nI never heard back, so I went there once more a few weeks later (actually placed another pickup order) and let them know that no one had gotten back to me. Once again, they apologized and asked me to again leave my phone number so someone could call me back.\n\nI never heard back from them and it's been awhile now. Truly disappointing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VObXV6ZGI3eEl1SlVBEAE",
            "text": "My wife order a nachos plate with ground beef and everything else that the plates brings except sour cream, that taste nasty.  We also ordered hard tacos the same way, no sour cream, also two bags of chips. The nachos were made in a bath of sourcream,  the tacos we made with sour cream And the missed a bag of chips.  They always do this.  We ordered around 8:30 pm and we kept calling no one picked up. At 10:50 the lady said you never called and we don't do delivery past 11:00 pm.  Nasty food and they stoled a bag a chips.  So nasty on their part.  I know our dumb president has  immigration so hard now but it's not my fault.  Do they have to steal ONE bag of chips? And make nasty food? Wow they used to cook good and attended customers with respect, now they have a horrible cook and people who answer the phone like tou bothering.  Like I always say the owner get what he pay for.\n\nThank you for the attention."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKZnpuSkNCN2RMU1F3EAE",
            "text": "Our delivery order is always wrong - missing salsa or wrong beans, etc. but the food is delicious!!"
        },
        {
            "date": "5달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJVE84YXJQdTgyWVlBEAE",
            "text": "Sehr authentisches mexikanisches Lokal. Laut und hibbelig aber auf eine angenehme Art. Wer also lecker und verhältnismäßig günstig mexikanisch Essen möchte ist hier richtig. Absolute Empfehlung! Und die Margheritas ... mui bien.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMblktZTNYaU8tTjlBRRAB",
            "text": "A hidden gem in the neighborhood. Fantastic guacamole and great for a nice dinner as well as a bar night. Three margarita selection is an adventure in itself but they've got something for everyone."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLeUt4dnF2aF91TjNBRRAB",
            "text": "Had lunch with a friend , they have a good burrito selection on the lunch specials with a small drink.."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJODgtTnpBRRAB",
            "text": "Great vibes"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OU12eTVBRRAB",
            "text": "I am a regular at El Porton and have introduced the restaurant to friends & family, but I WILL NOT BE COMING BACK.  While enjoying our meal there with my family, my mother-in-law found a HUGE FINGERNAIL IN HER FAJITAS. We call our server and showed her our finding. She took the it and said: give me a second, I will be back. Then a lady(manager or owner) showed up asking what’s wrong with the food?\nWe re-explained the situation to her and then she rudely and dismissively said the best she can do for us is to take off the one dish of our check. NO APOLOGY what’s so ever. We have already lost our appetite and left. The manager(or owner) was at the door when we were leaving, again with did apologize and didn’t even wanna acknowledge us.\nTerrible experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ME5iMEtnEAE",
            "text": "I ordered one of their brunch plates. The description was something like scrambled eggs with jalapeños, peppers, onions, rice, and beans, so I didn’t have high expectations. But wow—they seasoned those eggs so well. I was genuinely surprised. It was such a great value too because it also came with some avocados, corn tortillas AND a cup of coffee (or mimosa). A 10/10 meal—I left so happy and satisfied."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnd19DWWhnRRAB",
            "text": "The Fajitas & sopes were delicious! The owner was very attentive, the servers were helpful and welcoming"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcTlPVzZRRRAB",
            "text": "We ordered a few dishes and margaritas. The drinks were full of cheap mixer taste, which didn’t make sense for the price we were paying.\n\nWe also ordered a lot of takeouts from this place just because it is convenient and close. But there were coupe times when the delivery or orders were messed up, and we called, whoever picked up the phone really love to hang up on the customers!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbmFQakx3EAE",
            "text": "I like everything. The drinks, the food and the service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcW9ycHhBRRAB",
            "text": "Food is meh- uncle Ben’s parboiled rice (a real cheat).  Pork in my enchiladas was dry.  Beans lacked flavor."
        },
        {
            "date": "9달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOV9UazBnRRAB",
            "text": "Choisi en pur hasard et très bien accueillis ! La déco est chaleureuse  ambiance lounge.  Les.assiettes généreuses et franchement on s'est régalé ! Mais vraiment régalé !"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQb19QZTVBRRAB",
            "text": "Al principo  todo  muy vien con la mujer que estaba trabajando en la barra .   despues tod@s.  Oh  tod@s   L@s   de la cocina    salieron ala barra a tomarse  un trago  durance el trabajo  despues un@ se quedo en la barra  ya casi dumiendose   y la mujer de la barra la estaba atendiendo mas a ell@ oh a e@l  que ya estaba tomad@ que al costumer  eso  es una Mal servisicio"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubHRXYXd3RRAB",
            "text": "Awesome lunch special - great enchiladas!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNILXBlT0h3EAE",
            "text": "Great staff, amazing food. Wonderful dating spot and or brunch spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eVBtcjFnRRAB",
            "text": "Very bad service, not only were the waiters rude, but they ended up adding extra drinks in our bill and asked us for tip without telling us that gratuity was included.\nNever coming again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eU5udGx3RRAB",
            "text": "Really rude tipping policy and charged for things we didn’t order"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaUktY3pnRRAB",
            "text": "Been here many times, first time picking up. Ordered the $13.95 lunch special over the phone and told the lady it was for pick up. Confirmed the price with her over the phone.\n\nUpon picking up, the total was $17.95. When I asked her why, she said take out for lunch was an extra $2, which was not disclosed and does not make sense because I confirmed over the phone the price. Even at $15.95, tax is 8.85%, yet the total came out with an additional 13%. Not sure how they do the math, but seems like a cash grab for lunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeEtIaWlBRRAB",
            "text": "There are not very many good Mexican food spots in New York, but this was solid! The lunch specials are great considering the price, loved my fajitas with a frozen margarita."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNTgtcTdBRRAB",
            "text": "Greatest food I have had in a while loved it. The drinks were on point. I will return again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdE9xLXJnRRAB",
            "text": "Got an order delivered. Food was not good. Ground beef taco was so dry."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMZzZ5YzZBRRAB",
            "text": "Food it’s pretty good and drinks are good and strong friendly staff I being there for a few times already recommend for good food and drinks and to have a good time with friends or family"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaGRlNnZ3RRAB",
            "text": "the best mexican food I ever eat!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6a2Y2LVh3EAE",
            "text": "Do not go here. This place overcharges is an INSANE way. You’d think it was a Michelin star based on their prices. Unbelievable. I got a margarita and it was $19. Automatic 25% tip that was definitely not earned. What a ripoff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUc3NtYXpRRRAB",
            "text": "I would live here if they would let me.  THE. BEST!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbnR6MDlnRRAB",
            "text": "Small restaurant, fast service, hard to find parking, overall ok location."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOHBLWkRREAE",
            "text": "Good marg, but no happy hour on Fri... :/"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5XzVtSTRnRRAB",
            "text": "Moved out of the delivery zone for this place and it was like losing a limb. Glad to be back. The best Mexican delivery in upper Manhattan and trust me I have tried them all. My love of their enchiladas and tacos and salsas cannot be overstated. 100 percent worth visiting in person too they're fun and nice. Would pay good money to watch their cooks for an hour."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bnNtLVVnEAE",
            "text": "From Texas so might be a little bias about Mexican food but it was good/okay. Server was nice and attentive. Only first bowl, small, of salsa and chips are free?? Had a couple of burritos which were pretty good, both the veggie and chicken. Guacamole was good. Mole Enchiladas were good, but sauce was more spicy than what is usual for mole. If in area and crave Mexican food, not a bad choice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkOWNHLW5nRRAB",
            "text": "The food is great and the margaritas are strong! Definitely recommend the mole sauce"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMVk3QXhBRRAB",
            "text": "Wonderfully authentic Mexican food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkb0xtbnlRRRAB",
            "text": "The food was great, great taste!, the service attention could be better, the service size could be better, but the ambience is gorgeous! The Frida Kahlo paintings are great!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0aEkyXzV3RRAB",
            "text": "Love it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdTVmYktBEAE",
            "text": "Charged $4 for a tiny scoop of sour cream to go with my super spicy burrito🥲"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWa1kzYnp3RRAB",
            "text": "The best mexican restaurant in NYC hands down, me and my partner lived in the city for a few years and nowhere else compared to this place!\n\nAlso the price is really really good for NYC so 100% worth it, you can get a banging huge burrito for like 13 bucks with free chips and hot sauces 🤩\n\n100% one of the best restaurants I've ever been too! Also the staff are friendly and it's a cute little place\n\nDEFINITELY COME HERE YOU WILL NOT REGRET IT!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsNjZ2ZDRnRRAB",
            "text": "A nice local spot.  Nice cocktails.  Very down-home Mexican and the food was delicious.  My daughter lives nearby, so I'll definitely go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScjQzQ2J3EAE",
            "text": "Delicious Mexican food, better than anything in Hells Kitchen.  Might be my new favorite in the city. Starting off with some free chips and salsa of very high quality, perfect really, like in the south. The shrimp Diablo are amazing and the sauce has a homemade taste, not too spicy. I ordered the chicken enchiladas which were nothing special but on par for top notch, great sauce. Both dishes came with homey rice and beans, very filling. We sat outside and enjoyed the fresh air. We did ask the waitress that brought our mains out (not that took our order) for more free chips and salsa and she said yes, but then the other server gave them to the wrong table, which was unfortunate because we wanted to use them to scoop up the accoutrements.  Oh well everyone makes mistakes. It was annoying to see the other table immediately grab and start munching away on our chips though - they didn’t ask for them and knew they weren’t theirs and could’ve said something but didn’t. Our server did bring us three different kinds of hot sauces that you can see in the photos.  But when they finally brought our chips and salsa we were finished with our meal. I just overhead a guy who seems like the owner offer free chips to the table next to me.\nAnyway, overall strong recommend."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBOV9qa3J3RRAB",
            "text": "Good Mexican restaurant. Flavors are very bold and you will enjoy them. Our waitress was very attentive. Prices could be a bit more competitive. Although the food is tasty, I've had tastier. That's why it's only 3 stars. Definitely worth trying though"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURod01Pc1p3EAE",
            "text": "The food and service is decent, but you have to watch out when you order your drinks to ask for the price because there is no price on their menu so ask before ordering as the price for the drinks is a bit expensive. The restaurant is nice and cozy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwOHZ5RVFREAE",
            "text": "I went to this restaurant 3 days in a row, that is how good the food here is. The echiladas are to die for, highly recommend the green sauce if you can take spicy, and for the meats pulled pork or steak. Large portions and the best Mexican food. This will definitely be a regular place of mine!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdEx2TXV3RRAB",
            "text": "It’s a great place to enjoy authentic Mexican food~ reminded me of home. Food was so good that I forgot to take more pictures! Must get The Alambre and desert! Buñuelos, Michoacán fried Ice cream or Flan with coffee~ must get!\nIf the food is made with so much love, their service and attention will make you feel at home and relaxed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaenAzcjR3RRAB",
            "text": "I’ve been to El Porton so many times previously and was a huge fan. That’s why it’s so sad to leave this review.\n\nMy colleagues and I placed a to-go order last month. There were numerous things wrong with the order, unfortunately. One of which was that one colleague received the wrong item completely (received tacos instead of a taco salad). The other one was a piece of green thread inside the food of my other colleague. Truly disgusting. See attached photo.\n\nI went back to the restaurant that same day and showed them the photo and also explained all of the various other items that were wrong with the order. They acknowledged the thread was the exact type used to tie their tortilla bags. I explained that I understand things happen, but we just needed to let someone know and make things right with us. I was advised to leave my phone number and someone would call me back.\n\nI never heard back, so I went there once more a few weeks later (actually placed another pickup order) and let them know that no one had gotten back to me. Once again, they apologized and asked me to again leave my phone number so someone could call me back.\n\nI never heard back this time around either and unfortunately have to leave this review. Truly disappointing. Due to them ignoring us, it will prevent my colleagues and I from ever stopping by again, which makes me sad as it was the opposite of my intention. I just wanted them to make their mistakes right."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4My1MVFp3EAE",
            "text": "This is my favorite place in the whole wide world!! The service is always great and the staff has become my family!! They have the best drinks in Harlem!! Go big or go home!! My personal favorites are the Peach Mama on the rocks (22oz Margarita) a coconut Long Island (created by me) and of course shots of tequillaaaaaa!!! The food here is always amazing; personal favorites would be the buffalo wings all the quesadillas the SKIRT STEAK..\nAnd the chicken salad with onion vinaigrette! I come here multiple times a week for 7\nYears and always bring people with me and they also get hooked!! Thank you to Sumay Marisol Mirna Samantha Gabino (chef) for always making this our place of fun, celebration and good times\n\nDenise"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcV9TNXJRRRAB",
            "text": "Great service on a Friday night. Food is always great.  Love the margaritas here.  My only disappointing factor was there isn't any happy hour on a Friday. Happy hour only consist of Sunday thru Thursday.\n\nSmall restaurant. Very tight seating, but worth it! Bathrooms available too."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwNDdXMGJ3EAE",
            "text": "One of the best Mexican meals I’ve ever had.  The food is delicious.  Service is good. Restaurant clean with friendly staff.  Food is very tasty.  I had the enchiladas suizas with steak and tomatillos sauce.   Plus some green hot sauce.  A side of yellow rice and black beans.  Very good too!\n\nChips and salsa were also provided for free.\nEnjoyed the atmosphere very laid back.  Obviously a secret jem in this area.  Good music too!\n\nDefinitely a place to return to!!!\n\nIf you find my review helpful, please click like."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5anV6YUF3EAE",
            "text": "It was our first meeting from the opening of the indoor eating.  Sistha's On The Go!!!.  The food and drinks were good and we had a good time!!!!! Thanks"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NjVtb29nRRAB",
            "text": "Restaurante mejicano a un gran precio y calidad.\nLa atención muy buena de ambas camareras, atentas rellenando el agua constantemente, y pendientes.\nTe traen una salsa roja con totopos nada más te sientas, que se agradece mucho.\n\nPedí una chimichanga de chorizo y estaba buenísima, para nada aceitoso, y con mucho sabor.\nMuy recomendable en general."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzOHRTWDJnRRAB",
            "text": "Great lunch set! Lunch sets come with choice drink for 10usd; I bought the burrito giganto and chose sangria for 11usd! Also a free set of good chips and salsa. Burrito was delicious and big with lots of good salsa choices and a dollop of homemade guacamole. The sangria was homemade and sweet with real fruit bits. Lovely staff!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCc3FXMG1RRRAB",
            "text": "asco 🤮 total! ordene entre otras cosas una torta y en repetidas ocasiones le especifiqué a la persona que quería la carne bien cocinada\nme mandaron una torta con la carne todavía roja ni cocinada estaba\ntengan cuidado revisen bien su comida eso es una infección estomacal segura\njamás vuelvo a comprar 👎"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMS1XTHRRRRAB",
            "text": "Can never go wrong! So tasty! My go to’s are  the taco salad 🥗 and the chicken enchiladas. The customer service is also top notch 👌🏼"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnc3JDY0VBEAE",
            "text": "Decent mexican food at the subway stop.\nI ordered chicken flautas here.  The problem here is the chicken filling has no seasoning. So you just taste the chicken and fried tortilla.  Basically bland…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcHNfNHhBRRAB",
            "text": "El Porton pandemic adorned views\nDelicious meals to be had in their outdoor Casita. Satisfied and cozy in Harlem."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhcVk2TXBRRRAB",
            "text": "Food was good, server forgot to bring silverware after reminding a couple times, but they were pretty busy when I visited and due to the server shortage I know everyone’s slammed. Margarita was refreshing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsX0tDM3R3RRAB",
            "text": "I visited this establishment on a Thursday afternoon, so there was only myself and two other customers there at the time. I ordered the Chicken, Shrimp, and Steak Fajitas. It was delicious and well seasoned! The waitress was well attentive and very kind, often refilling my water and regularly checking if I needed anything. The meal came with complementary chips and salsa, but I ordered a serving of guacamole.\n\nThe guacamole lacked flavor (in my opinion) [I’d give it a 3 out of 5 stars] and the salsa was underwhelming with too much cilantro [I’d give it a 3.7 out of 5 stars].\n\nOverall, my experience was incredible, the food was mostly delicious and I would definitely visit again."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMzg2OTZBRRAB",
            "text": "Great food, great atmosphere and excellent service. Loved the enchiladas. I ordered the steak enchilada with salsa verde and it was delicious"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4XzlDOEdBEAE",
            "text": "If I could give zero stars I would the owner has been terrible food wasn't good at all drinks was over priced before the pandemic use to be a ok place"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTdnBPS2lBRRAB",
            "text": "This place has the best Margaritas uptown! Every single friends or family member I’ve brought here to try it out has loved their Margaritas and food! It’s a small and cozy place. The owner is usually at this location and always happy to…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdG8yTl93RRAB",
            "text": "The lunch special was good and has a lot of drink options that are included in the price. The restaurant is well air conditioned and has a really nice ambience. My waitress was great too! I’ll definitely come back."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNGVLLTdRRRAB",
            "text": "very good and real Mexican food, awesome guacamole and salsas, tacos, quesadillas, and good tequila options."
        }
    ],
    "reviews_count": 73
}