{
    "name": "Nikko Hibachi Asian Fusion",
    "place_id": "ChIJu3iXyGr2wokR29wWAqLfn8Q",
    "grid": "MN9",
    "address": "1280 Amsterdam Ave, New York, NY 10027, USA",
    "rating": 4.3,
    "user_ratings_total": 1478,
    "phone_number": "(212) 531-1188",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjNVdFUkJabDloVUdKeWJEbDBOR3ByUnpGWE5GRRAB",
            "text": "This is my fav spot always a spot for the Hibachi grill, good food always get the seafood combination with double rice is so delicious. The only thing I usually dine alone and you need atleast 2 people for hibachi"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201eVlUbFZNWE5uZDJWWlFtOUpZVWRzVTBWM1VVRRAB",
            "text": "Fun hibachi 😋. Food was great the place is kinda small."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNmVYRmthMWs0TVdReE0wVmhRek5JVEc5S01IYxAB",
            "text": "Food was really nasty. Broccoli wasn’t done. The salmon tasted nasty. The vegetables was nasty. All the sauce spilled out. It was the worse hibachi I ever had in my life. Even the miso soup was nasty like how do ya mess up your own food. How I don’t get it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seFdIbHNaWE5PUWtoSFkxUTNlVE50TURCTmFIYxAB",
            "text": "Played  out experience.  Go somewhere else that's exciting.  Subpar food. No flavors.  The servers.  Meh\n$35.00 wasted."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNE5uVXpWMjA1TkZkbFNWQm1aM2RpWlVrdExXYxAB",
            "text": "Closed - live roaches in food area"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNVVqTkVWV2hHT1VZMU9WQndWRnBZTURNM2FsRRAB",
            "text": "Food was fine but nothing to phone home about. I got food poisoning here in 2023"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcllWaG5PRlJaUmtkUlZtYzFTRmd0Vm5sU1ptYxAB",
            "text": "Excellent Service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwb2NYSk1abWRGZFVGRVRGQjBkWGd3ZFY4MVdFRRAB",
            "text": "Dimly lit chill atmosphere, service is great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSGJWSTRiVEpTVURCNk1HVldXV0pmVWpWdFVrRRAB",
            "text": "Let me tell you about a place that exceeded what I hoped to find. Their food was unexpectedly amazing. The whole place is very clean. Workers were exceptionally helpful. I would return gladly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TU5tcEVXRW96Y0ZkaGREaFdOMHBOTjFkbVJGRRAB",
            "text": "My friend and I enjoyed our time. The food was very good and they kept me from ordering more than necessary. Enjoyed the margaritas as well and the waitress spent time taking our photo. Much obliged. Would go back, any day of the week."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV2IySXRiSHByZVZCSGNHVktTMEZDVW5jMVNWRRAB",
            "text": "Love the food. Love the service. Some place that's not to far from home. Great 👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYVFrUlNNVlp3TnpOd1ozRTBUVTVyYkMxUU5XYxAB",
            "text": "Love this place!! It’s actually my favorite!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzN3VtUjd3RRAB",
            "text": "Updated: Happy Hour Review: Nikko Restaurant\n\nNikko delivers a standout happy hour. The Golden Dragon Roll—spicy crunchy salmon, avocado, mango, and tobiko—was fresh, flavorful, and beautifully plated.\n\nThe K-Tus Ojitos-Tini was a smoky, citrusy mezcal cocktail with a stunning flower garnish—definitely a highlight. Drink options are wide-ranging, with mojitos, margaritas, and specialty cocktails from $10–$12, plus apps and sushi rolls from $7–$17.\n\nGreat vibes, friendly staff, and excellent value. A solid addition to the happy hour rotation."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMVNUTm1NUzFDY1VObGVFdFZPVVJsT0RaS01rRRAB",
            "text": "A neighborhood staple for me"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQ0xUVjROWEl0YUZsU2RVMUJhSEZhZVMxQ2NGRRAB",
            "text": "Very expensive and the food was a little bit salty; however, the atmosphere was nice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMVdIZDBZbk14ZHpORmRWWXRhMlZYYzB4d1UyYxAB",
            "text": "Very loud music especially Friday and Saturday"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQ1VXZE5jM3B2TUhKNlprZDFRWE0zZDJoaVRXYxAB",
            "text": "Love this place Amazing food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeVNHTjZPVXR0VTJGNmJEZE9iaTFxY25kWVJHYxAB",
            "text": "I ordered a miso soup, vegetable sushi and fried rice via delivery. Miso soup was flavorful,  vege sushi was just avocado & Cucumber,  but the fried rice was utterly disappointing.  If you like rice fried with soy and a shred or two of egg with no vegetables then this is the place to get it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUWRGOTZlbFJLT0RKNlh6ZG9URkpvVUdOcU1HYxAB",
            "text": "Honestly the food was good but, even better was that it is kid friendly. They have a lemonade “sake” experience so the kids aren’t left out and he made my daughter a balloon animal. That alone made the included 18% gratuity worth it."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndXAzRW1BRRAB",
            "text": "Great food service and hospitality"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPeXotSnpvNy0tSDFBRRAB",
            "text": "Denise is our waitress, we found this place a couple of months ago and fell in love, she is great, food is fantastic, portions are generous, atmosphere is both lively and lovely, we remember Denise, she remembers us, 5 times and counting, the chicken ,shrimp and scallop Hibachi are highly recommended!!!!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZMU0zSm9BRRAB",
            "text": "Nice quick spot on the low"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcVdrSTJxaUliWEx3EAE",
            "text": "Great food.  Great service. Happy hour to die for"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNVzV6OEx0OFBxQUxBEAE",
            "text": "The food was delicious. I only had a complaint about my spicy tuna rolls they were not as tasty as I remember. The boneless spare ribs were delicious. The drinks 10/10 are so strong and good. We were seated at the hibachi tables, so the experience was great and funny. The food was a lot . I was able to eat there and had plenty to take home. I would definitely go again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQclg4cHpTcGJMMnZ3RRAB",
            "text": "Hello!\nI took my Mom here for a Belated Mother's Day brunch. It was one of the best dining out experience ever. Wonderful Service, Delicious Food  !!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0lsODNMbWQyWG53RRAB",
            "text": "It was our first time visiting that establishment, and although my coworker had recommended it highly, we unfortunately found the food to be unappetizing.  The dishes had an unpleasant, stale odor and taste, suggesting they may have been stored improperly.  None of us enjoyed the meal. 🙄🤦🏿‍♀️…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaU03V2lRRRAB",
            "text": "I really enjoyed this place. This place has hibachi which is nice but i’m not a fan of. I jus sat at a table. The food was good. Staff was good. I would recommend and i would come back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNXNPX0RBEAE",
            "text": "Great spot vibe and food a bit pricey but is cool"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdWJYaTRnRRAB",
            "text": "Great great great never disappointed"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJM2ZyTUZ3EAE",
            "text": "Great food! Great performance! Great drinks!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMHVHYjVBRRAB",
            "text": "Great food... Service was excellent...Thank you..."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eF92ZVZBEAE",
            "text": "The veggie dumpling soup was good! Loved the warmth and flavor, especially given I ordered when I was sick. The maki’s fish was not incredibly fresh though, which left a marked impression for me."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBM3R5NEF3EAE",
            "text": "I called over the phone to reserve a table for a group of 5, when i arrived i was given a shared table with random people. The restaurant was partially empty with a lot more space to accommodate others. I requested to speak with someone like a manager or someone upper label . Then a lady showed up which i didn’t expect to be the owner with such a nasty attitude and unprofessional behavior towards customers. I simply asked that if we could have a table only for 5 since the restaurant was empty . She was just screaming  nonsense like a crazy woman and blasting left and right for no reason. At that point i had to walk away from this restaurant with my family . I don’t know who to make complain if the owner it self misbehaves like that, she really need to fix herself so the employees can learn something from upper label . I would never gonna want to come back to this restaurant, also I wouldn’t recommend any of my friends to go there either. I hope this review doesn’t get deleted."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbXB6VGZREAE",
            "text": "Andy on hibachi was really cool"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaDZuNzdnRRAB",
            "text": "2025 Update:\nStilla great place for a party or intimate dinner. Just hope their fried rice can include bean sprouts moving forward.\n\nGreat place to have a hibachi get together and best to plan ahead to ensure your table is ready (and yes, you can order items from the hibachi menu without th bsnoke show as well).\nThis is an Asian Fusion spot consisting of Japanese z Chinese, and Thai.\n\nThe only reason for a 4 instead of a 5 is because the ramen was just ok. But their Japanese fried rice is excellent."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmalpESVRREAE",
            "text": "Food was salty. Hibachi chef was not that entertaining. Drinks were mid.."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdnJPTTJnRRAB",
            "text": "My son and I enjoyed a nice sashimi dinner either plenty of the specialty rolls. We had the best waitress Denise who we enjoyed very nice conversation with while she shared her favorites. My son and I decided we wanted to try the Uni (Sea Urchin) sashimi and just as Denise advised you either like it or you don’t, I really liked it and my son didn’t lol. Our favorite was the scallop sashimi due to its extreme tenderness but the yellow tail and salmon did not disappoint.\n\nIf you have the opportunity please check out Nikki’s and ask to be seated in Denise’s area for great conversation, service and recommendations. My glass of sake was never empty with Denise ensuring my glass was full and putting my bottle of sake on ice to ensure it remained cold. There is also a hibachi section as well as a full service bar."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aElleHN3RRAB",
            "text": "I love this spot. I have been going here for years with different groups of friends and family."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQN1lYWkVREAE",
            "text": "I love Nikko! I first discovered it while I was attending Columbia and lived a few blocks away. Now that I’ve graduated and moved to another neighborhood, I still visit Nikko any time I’m back by Columbia! The sushi is absolutely delicious and so fresh. The service is always so friendly and they are always quick to fill up your water or take plates away. Plus, you can’t beat the lunch special. I don’t drink but they have an exciting drink menu and I can imagine it gets fun here at night. I’ve taken so many people here and everyone finds something to enjoy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQOWZTUFJ3EAE",
            "text": "Fantastic experience."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQa3VheV93RRAB",
            "text": "Everything was a downgrade. We were rushed to order. Massive portions of rice and noodles, but baby sized portions of chicken steak etc.sonly ONE of the servers were kind and courteous."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtczlIS1lnEAE",
            "text": "Always pleasant and quick."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNWZ5WTd3RRAB",
            "text": "The service is amazing. The chef had a great sense of humor and was extremely talented, he even made balloon animals😎."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdk9TcDRnRRAB",
            "text": "The chef was friendly.  The food and service were good. The hibachi space could be a little more spacious.  My back was turned to another hibachi station and I felt the heat on my back/neck when the chef was working."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYLXYzcnl3RRAB",
            "text": "Great Hibachi experience. Lots of laughs and joyful moments. Cocktails tasty. Food is good too but overpriced. Family of 7."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNV9tMUd3EAE",
            "text": "I went here for hibachi on a Wednesday afternoon for my birthday. We had the whole hibachi table to ourselves and got probably the best portion of fried rice I ever got at a hibachi place. It was excellent!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeHNUbFBREAE",
            "text": "Hibachi was delicious. Great portions size. Frozen drinks were good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNG9HQ1J3EAE",
            "text": "One of my favorite neighborhood eateries for Happy Hour, Brunch and Lunch. The staff is great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MmE3STNRRRAB",
            "text": "Great service, good prices for NYC, awesome ambiance. We sat at a table rather than hibachi. The food was very good but a little uninspiring and a bit on the salty side (even for asian food). The vegetables were super fresh and cooked…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbUtIUENnEAE",
            "text": "My wife and I were looking for something to eat and fond this place and was very pleased we did. I had the General Tso Shrimp (pictured), and my wife had the asparagus with Shrimp. Both were delicious, and we left full. The service was great, and they brought our food quickly.  The only issue I have is that I did not know about it sooner.  We would definitely be back when in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueXEzWFVBEAE",
            "text": "Food was delicious and you really get your money's worth. Recommend their lunch bento boxes: entre, rice, California rolls, soup AND salad at a reasonable price. Will  be coming back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJdHZTNUl3EAE",
            "text": "Went to Nikko restaurant with my family twice. The service was excellent. The food sushi, General Tso's Chicken, Schezuan Beef, soup, deserts, drinks were excellent as well. I love the ambiance, the lighting was perfect. Only thing is that people at the bar and hibachi area can get loud and annoying but have some warm sake and you will fit right in. I really like this place since Hunan Balcony and our other favorite restaurant China Fun closed, this is definitely my family's new favorite restaurant.\n\nThis is an Update: July 9th 2023***\n\nMy family and I have ordered Nikko for delivery through UberEats several times but today my family member ordered two different dinners soups and salads including an appetizer crab Shumai. Food seemed a bit unorganized and shuffled in the bag but bag was stapled as usual, everything was spilled and leaking that was unusual generally when when we received an order every thing is organized and no soups leaking.  Upon eating two  bites of the shrimp and broccoli and General Tso's and crab Shumai. I immediately threw up, this food was completely rotten and had a chemically taste. I cannot believe we ate some of this rotten food, everything had to be thrown out immediately after consuming a bit of the food we all became ill from the chemically taste and realized the putrid smells fumigating from the bag it was delivered in this is definitely a food safety issue  and I hope the food inspectors will investigate thier kitchen and cooks  Unfortunately we will not be ordering again. I hope this restaurant will realize just how fast they can lose great customers by not checking the quality of the food they send out to their loyal customers. I'm very disappointed in this place as we have been ordering here for a while now. But fortunately for us there are many other great Chinese/Thai restaurants who  have better quality control and will not deliver rotten/chemically tasting food  to their customers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad1ptWEtnEAE",
            "text": "Good lunch deal, really liked the sashimi as they were thick slices! However I think the miso was a little greasy. Loved the dragon roll too amazing combination. Not bad for affordable-ish sushi!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxZ29MM19RRRAB",
            "text": "Nikko was AWESOME! It's a great place for a date night or family fun. The Hibachi chef's really put on a great show! It's very entertaining. Lots of laughs. It's very interactive and engaging. The food is superb! The drinks are amazing! You definitely get a bang for your buck! It's totally worth it!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbTdUbjRRRRAB",
            "text": "Love the atmosphere here. Great place to take the family. Decent prices, and the chef will you entertained. I suggest you get the Hibachi food instead of a booth. That's when you get the full experience. Glad to have a restaurant like this in the area. Love Hibachi style food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLUtTNGFBEAE",
            "text": "Great rice and portions. I would advise having 1 meat instead of the combo. The meat was cooked well but unfortunately was drenched in the sauce. Lastly as soon as the cooking was done we were being rushed and monitored closely in regards to the bill. Although it was a good local Hibachi experience because of the rush after I may just go next door for a meal."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNFluRjZBRRAB",
            "text": "This spot gives extraordinary service and delicious meals. One of my favourite restaurants around town. The food is served rapidly and the rates were reasonable. The staff is amazing and the drinks are great.\nHighly recommended.\n10 out of 10 ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aXBiN1NnEAE",
            "text": "The hibachi experience was wonderful and quite entertaining. You must order 2 entrees in order to get the hibachi started. We ordered the sirloin steak and the shrimp entrees with a lobster tail on the side. The yum yum sauce was tasty."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxdkt6anBBRRAB",
            "text": "Omg,  I will definitely come back again. The food and the service were excellent.  It looks like a small place from the outside but it's huge inside."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLcnNEM0l3EAE",
            "text": "Looking for a hibachi restaurant and found Nikko. I enjoyed the grill show and the food was just as good. I ordered hibachi and kitchen my preference and prices were pretty descent. I ordered filet mignon and shrimp (2 meat, seafood) combo…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpMnB6RjB3RRAB",
            "text": "A lovely place to dine. The staff and chefs are pleasant, courteous and absolutely. wonderful.. and very COVID19 efficient..\nFood =10\nDecor=10\nService=10\nPPE =10"
        },
        {
            "date": "수정일: 3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcTZmakhBEAE",
            "text": "Un lugar perfecto para tener una cena en pareja o para acer una fiesta de cumpleaños ofrecen hibachi bebidas HAPPY HOURS 12-6 pm\nLunch especial 12-3:30"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdE5TeWtBRRAB",
            "text": "Wonderful place, decently priced food, even better drinks. Only issue was the portion of food.I was a bit unhappy with; it was A LOT! I was somewhat turned off by the large portion serving. Regardless I pushed through with my meal and everything was cooked perfectly. I would definitely recommend this Asian-fusion restaurant."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJc3RtdTd3RRAB",
            "text": "Great sushi. Wasn't fishy and definitely tasted fresh. They have some good, unique rolls to try as well. Staff is friendly and on top of things. Would go back again for sushi!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0LTdDU1dnEAE",
            "text": "My family and I visited this restaurant while visiting in New York! The service when we walked in was very pushy. The manager was very pushy… We was like we a black family with money and here for a great dining experience. But after he calmed down we ordered. The drinks were spectacular I got a passion fruit margarita (top tier). My husband got a mango it was still pretty good. The food was okayyy. We got the hibachi I also got sushi and my husband got crab Rangoon (it was\nOnly like 3 for 8 bucks. Buttt Heyy. The kids loved the cook he even did a balloon performance (never seen that before) but he was nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3by1mUkpnEAE",
            "text": "Amazing ambiance, tasty food and drinks. Staff members are so kind and so talented. Can’t wait to dine again!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNX3ZHUGZREAE",
            "text": "A solid hibachi spot. A fairly standard menu with meats, seafood, and vegetarian options. Our Hibachi chef was incredibly friendly and funny, doing tricks and making jokes through the whole experience. Service was fast and continuously…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcHREOUp3EAE",
            "text": "I've gone here a few times now and have not been disappointed. Grilled eel dish was fantastic and the sushi is great quality."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJNFA2YVBnEAE",
            "text": "Great fun, ...and also pretty decent teppanyaki.  Great for parties - up to 18 people around a cooking station - ...and a bit of theater to keep everyone entertained :-)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCZ2NuUzFnRRAB",
            "text": "Nice place. The food was fresh and tasty. The chef made it fun too! Happy hour drinks are delicious as well. I would definitely go back."
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3Mk0tNXJnRRAB",
            "text": "I like this place to have lunch around 1pm. Good Japanese, Chinese and Thai food. I always order the lunch box. Prices are fair.  Pad Thai is good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCM1BtMU13EAE",
            "text": "Asked for the bathroom and they let me use it without asking me to buy anything. I only had 15 minutes, so I got the lunch special with two sushi rolls and a salad. It was delicious, and I was out of there in 13 minutes. Good service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXXy1HbDFnRRAB",
            "text": "Great food, great company, just an overall great time! Great atmosphere for couples, families or celebrations! I'm a returning customer. This time I ordered the seafood combination and it was dee-lish! I love the habachi presentation too!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1czVDYjJnRRAB",
            "text": "Today we celebrated my son’s 30th Birthday  along with 9  family members & the turnout was great!! From the host to the hibachi cook & the rest of the staff ! The cook very entertaining funny & definitely on point!! Food was great! I bought a cake & they cut and served us all!!  Awesome time at Nikko Harlem we will definitely recommend and be back! Thanks for your hospitality & amazing service!\nBest ,\nOrtiz family 8/28/22"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNMy1ibEFREAE",
            "text": "Found this place near Columbia University. They have an excellent lunch menu with many fresh options. The lunch comes with soup, rice, salad and four small sushi rolls. Perfect for like 11 bucks."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdW9yeTFRRRAB",
            "text": "Food is always the bomb, love the ambiance and this is the only place I know whose clear soup taste like a meal."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJbVpPMG9BRRAB",
            "text": "The soup was very watery. The Thai Cashew rice was really good though! Good ambaince."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdlBiYl9RRRAB",
            "text": "Wonderful afternoon at Nikkos Staff was wonderful. Food delicious\nBathroom very clean. Had a Long Island Ice Tea nicely made."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMU11TjRnRRAB",
            "text": "We had a guy cook our food in front of use the food was so good I would definitely go there again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyeWVfY1hBEAE",
            "text": "Love this place so much!! Everything was so good!!"
        }
    ],
    "reviews_count": 80
}