{
    "name": "El Tina Harlem Restaurant",
    "place_id": "ChIJMRtWS2r2wokRu_wtCMfge6Y",
    "grid": "MN9",
    "address": "511 W 125th St, New York, NY 10027, USA",
    "rating": 4.6,
    "user_ratings_total": 1320,
    "phone_number": "(212) 222-1104",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ka1JuaENVRmx5YW1kVGQzWmxRbFZxZFZWNFRsRRAB",
            "text": "Found this gem through Reddit, came to get out of the tourist traps and try some Domican food.\n\nAnd yeah, it lived up to everything.\n\nThe chicken is tender, flavoursome and falls off the bones. The beans are in a world of its own and the salsa is tangy, so and cuts through everything in the best way."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRVdFTXpaa0ZSYUd0eFpFMXdPREF0V0VOZlJFRRAB",
            "text": "very comfartable"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSc2EyOW5XVTg1TURSeFNqUnNaa3hJYjNwTFpWRRAB",
            "text": "La comida exceptional con muy buen sabor y cocción. La atención excelente gracias a Ms  cris por  Su atención. Al chef  Edward lo\nMáximo ! Su sazón!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnd01WRmlZakJ1Ykd0emJGOVBSMnRJZVZSMFVXYxAB",
            "text": "We were looking for some home cooking and Tina’s hit a home run. Loved everything. The price was so low, we left a big tip."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdVNGaFhaV0UzY1dGbWVYWmZOVjgwUVdKc1NuYxAB",
            "text": "One of the best Spanish food restaurants I’ve ever eaten from! I was skeptical because I’ve never eaten from there before and I put\nin an order for delivery due to the rainy weather. It lived up to its name! I had soncocho and their pepper steak with yellow rice. Incredibly delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNeloxTXpTMWxXT0c4M1MyWlRTR041T1hsR1gzYxAB",
            "text": "I literally travel miles just to get their chicken soup! It’s the best thing EVER"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMVZrZFJVVmswZHpSTVlYZDVZMTkwWjE5a1drRRAB",
            "text": "The food is delicious. I hope they don't use msg. The seating is tight. It's a great neighborhood eatery."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ka1FYSmxSV1l4ZEVWQ2VVMW5ibkZ4UmxkbWJFRRAB",
            "text": "I order here all the time. The food is great. I had an issue with a delivery once but management quickly resolved it. I appreciate how they handled it. Highly recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200dGNscGlUMjh5VGpkdVFsQTFXazFwUVVobWVsRRAB",
            "text": "Best food ever!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVVlUWlFOM2RPU1hoamNHOWZhV2w1Y0RCRloxRRAB",
            "text": "We love it here!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUFFucFVaMUZRU1VSTk1VWkNSamcxZFVWdWEzYxAB",
            "text": "Food was expensive and no flavor (had pork w/ rice n bean) beans was really good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRdFVsb3RMV1JCVW1kcU1WVldYM1ZQV2xGNVEyYxAB",
            "text": "A very good experience!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURROGVmWGp3RRAB",
            "text": "La mejor comida tipica Dominicana. El mejor mofongo que he comido."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeGFYTk1OakZmY0dGVGRVbDRNbms0ZGpGd2QxRRAB",
            "text": "OMG Tina's the best Dominican food ever in the Harlem area.\nNice dinning and delivery services and delicious food... I really recommend it... 👌 💯"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVmNXOWhTVUpETjAxUVltOW5WMEZqWVdsUlEyYxAB",
            "text": "Excelente y La comida es super buena"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GdE5tWnNkVnBFWDNGQ2JHUkxSRkp0U2preGNFRRAB",
            "text": "Se come de maravilla, Alejandra un 10, excelente se portó con nosotros fenomenal y es lo mejor que hemos encontrado en Nueva York. Excelente"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMVZHZEJOQzAxZUVScFFXWkdNbFl6Y1VkUFExRRAB",
            "text": "Espectacular! Todo riquísimo! Y el servicio una maravilla. Recomendable 100% para disfrutar. Alejandra muy atenta y agradable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVFpGaGlNbU5tWm14NWFGcFNabVpEVmtKRlkwRRAB",
            "text": "Small spot but has a few seats available. The staff is friendly, everything was clean, and the food is great fresh hot and perfectly seasoned,\nThey have a simple but very good salad dressing,Their pork mofongo was amazing, and so was there oxtail, rice, and beans\nparking was not great but found a spot 2blocks away."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25remIxRmFhbVoxVTFOelZFRmFiVGRtVm5CT1dsRRAB",
            "text": "That may have been the best food I had my entirely life! These potatoes are delicious—so tender! And the meat is insanely good! Very sad that I don’t live here and can’t come more often. 5/5!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYnBrYXk2dS11aDdBRRAB",
            "text": "Best Dominican food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKNlp3X3Zqak5Yc0RREAE",
            "text": "The food is very delicious and the server was quick and very nice to us. The restraunt is small but you can sit and eat and taste the amazing seasonings."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNQ1N5YXZYbk9DWXRnRRAB",
            "text": "Definitely recommend. Not that big of a place but great people and awesome food!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNM1g0S2lRaGNPaHVnRRAB",
            "text": "This is my favorite spot for Spanish food. 😋 It’s always fresh with fast and friendly service. I always feel welcomed and full."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPdkd2Zkh0dEtMOHJBRRAB",
            "text": "Katherine was awesome at her job. She made us feel like we were home with her charisma and attention."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcmd1TURtcGRibVNREAE",
            "text": "I had the oxtails! I also tried the beef and the chicken empanadas. And for dessert I had tres leches 😋.... Everything was so good! They give you large portions! I live all the way in Jersey and I will make that drive to Harlem to eat here again,💯"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcUF3dmJlcmVpOUtREAE",
            "text": "Huge portions!! Friendly & fast service. Food was very flavorful  & very affordable , less than $10"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYmItcnpvcmFiM09nEAE",
            "text": "La comida y el ambiente es muy bueno en Este lugar."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveDgtLTJRRRAB",
            "text": "I feel like the oxtail dish should be the test for how good a Spanish restaurant is. If you can't get oxtail right, it's hard to trust the rest of the menu. Sadly, the oxtail here wasn't tender or all that flavorful. Kinda disappointing,…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvanUzc3JBRRAB",
            "text": "Busy place they have table for dine in parking in the street"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOE9meFlnEAE",
            "text": "Todo muy bueno\nCafé exelente ....\nComida fresca\nMuy buena atencion\nY muy muy ....buenos precios"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMDZYX0dREAE",
            "text": "Amabilidad, buen precio y comida buena\ntop, recomiendo y volvería siempre que volver a NY"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc2ZyRWx3RRAB",
            "text": "We ordered the chicken dish with rice beans and avocado mixed salad. It was all so delicious!!!! The portions are phenomenal for the price. Definitely coming back <3"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdG9fTTFBRRAB",
            "text": "Too much salt 😔😔😔"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNWVIakRREAE",
            "text": "Have you ever tasted Dominican food? In New York we call it Spanish food!\n\nEl Tina food will give you the experience to explore your inner spinish self!\n\nThe rotisserie chicken falls of the bone, which is so delicious and tasty its delightful putting it in your mouth. I don’t eat pork but i was told the roast pork is a must have.\n\nGet this, island food it’s like your mama’s kitchen."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNWVtaEZ3EAE",
            "text": "Overpriced… dishonest people! They charge different prices to everyone!"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaWJ6ZkR3EAE",
            "text": "Exelente la atención y muy buena la comida lo recomiendo"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdHMtWGN3EAE",
            "text": "Great food great service viva la Tina"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdG9fNTlnRRAB",
            "text": "Great food, Great Service!😇"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRZ3JEMUlREAE",
            "text": "The food was excellent.\nWell cooked chicken falling off the bone, flavourful rice, and exceptional service. S/o to the servers. They’re sweet and gave me free dessert!"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRX0xpLWxRRRAB",
            "text": "Excelente servicio muy amables, recomendado 100%"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNFl2bHJ3RRAB",
            "text": "Muy riko todo la comida y excelente atención"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBaTU3eHZnRRAB",
            "text": "The food was very tasty😋. I would recommend going and giving it a try."
        },
        {
            "date": "9달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeDVHeVF3EAE",
            "text": "Perfektes Essen. Super authentisches Ambiente!!! Garlic Prawns- really delicious.Try the Steak as well."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcnFDTVpnEAE",
            "text": "Excellent food and service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbF9qdklREAE",
            "text": "My go-to, the pepper steak, and the chicken with pepper steak are so good. Very seasoned!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqci11X1JBEAE",
            "text": "What can I say, it's a great Spanish spot we saw on the way back to the hotel. Service was great, the staff was helpful and the portions were like your Spanish friends grandma over feeding you. It was all delicious, and very tasty, chicken was amazing, as was the chicharron. Loved it and the piece was huge. We ordered dinner portions by accident, but still ate quite a bit.\n\nWould not hesitate getting food from here again."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNILWRibWxnRRAB",
            "text": "Dios mio pero es que no puedo!\nDesde que comi aqui la primera vez, no puedo de parar y desgustar esos sabores latinos tan espectaculares! La verdad una delicia y entre los mejores restaurantes latinos en los que e comido. Esa salsa de ajo! Dios me muero. Demasiado bueno u siempre gasto mas de lo que debo.\nLos empleados muy amables aunque hay un niño ahi que como que no es muy feliz en el trabajo. Pero las senoritas, todas un amor. La verdad recomiemdo esto 100%\nOh dear lord, please take the wheel. It's one of the best Latin restaurants I've eaten.  Since the first time I walked in, I can't help but to think and taste the amazing lating flavors! The garlic vinagreta is to die for. I doubt there is a bad dish in here. I always spend more than I should, but I can not help it. Trully highly recommend it. Ladies are way friendlier than the guys. Maybe it is because I'm a guy. Whether you dine in or take out... you'll fall in love and will continue to come back. Highly recommend it. A gem and best kept secret in Harlem. Bravo EL TINA..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cVpTUkhnEAE",
            "text": "Food here is amazing! Options are endless and authentic. I moved to Texas a year ago and while visiting this weekend I HAD to stop here and get lunch and orders to take back home. Cariña took very good care of me. She was so sweet. I went to a different place yesterday and it did not deliver the way Tina’s always does. Love them!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiX3MtYklnEAE",
            "text": "I was doing my walking routine with my walking partner, and we ended up walking farther than we expected. We were hungry and wanted Dominican breakfast. We were going to get an Uber to take us to Washington Heights. As we were looking for an address to put on the app, we noticed this location. We got the breakfast we wanted and the passion fruit juice that was delicious. The servicer need to work on their customers' service policy. All credit goes to the kitchen staff for their delicious food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMGFyOWRREAE",
            "text": "It is a busy place. Fast pace. Food waste tasty authentic Dominican flavor🇩🇴. The waitress was friendly. Space is tide. Yet enough table & seats to enjoy your meal.\n\nWe were too hungry forgot to take a picture of the food. I show you the receipt for ideas of pricing. 😄💖"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNid0lteTd3RRAB",
            "text": "I love this spot. They have amazing oxtail and they’re generous with the portions. The black beans have so much flavor, and the service is always friendly and welcoming. I really feel taken care of every time I come in. I love Karina, she always wants to make sure I have everything I need and is very attentive. I can’t wait to come back and try everything on their menu eventually!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeV9PTjVnRRAB",
            "text": "Absolute best place I’ve been in a while. Personal and warm service, impeccable soups, chicken and shrimp, rice, juices, empanadas, tostones, or whatever you want. Sit down with friends or takeout made easy. This place is good. 🩷"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcXFueDRnRRAB",
            "text": "Amazing authentic food from buffet. Service is very quick but also fresh and delicious. The atmosphere is very comfy and welcoming and the staff is incredibly responsive and caring. Overall my favorite dining experience in NYC. Incredibly affordable especially given the quality. If you want great Dominican food you don’t want to miss this place! I’m coming here every time I’m in NYC, a new family tradition."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaanZ2cVhBEAE",
            "text": "Amazing people, amazing food. My first time. An experience I will not forget.\nKarina was so good, beautiful smile and made sure we were happy!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeUpTZFFnEAE",
            "text": "Firstly, I’ll start by saying that I’m a Dominican woman who grew up in Washington Heights going to Dominican restaurants is not a big thing for me and my family because it’s just a part of our day to day, right? Well- here’s the thing…El Tina was something of a treasure to us in Washington Heights so when I moved away- I missed my food from El Tina. While walking to the hotel above the Apollo from my yoga class at Method Collective on 12 ave I stumbled across this NEW AND IMPROVED location for TINA in HARLEM 🤩😩thank God, because it was looking grim for me in the Sunday brunch department. I wanted robust, and flavorful foods that would satisfy me enough to make me “clean the plate! My daughter and I ordered our favorites. For her- TRES GOLPES & of course CHICHARRON de cerdo. For myself- I was craving MONDONGO con ARROZ BLANCO. I promise you that it was JUST LIKE MY CHILDHOOD crept back into my life for one Sunday afternoon. For drinks my daughter immediately ordered a MORIR SOÑANDO 🥰😩 it was so nice that it wasn’t sprinkled with cinnamon powder the way unauthentic places tend to do it. I ordered a MODELO ESPECIAL beer and I absolutely PROMISE you that the beer was SO ICE COLD that I was glad I didn’t have it until after eating all my Mondongo & rice- otherwise I wouldn’t have had any room for all that delicious food! TEN OUT OF TEN!!! I absolutely recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbE9EOVN3EAE",
            "text": "Loved the food and atmosphere. Everything is fresh, even the buffet style take out options. I dined in for lunch with my girl, Karina served and translated, it was fantastic. We got camarofongo, carne guisada and lots of beers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M2QzMThnRRAB",
            "text": "I was really disappointed with my order. I had (chicarron de pollo con hueso chicken pieces with bone) with a side of (Madurao sweet plantains). The chicken was fried dried mostly bone pieces, some parts were burnt 3 pieces even still had chicken feathers on it. The plantain was very greasy they gave me most of the plantain ends and pieces of plantains soaked in oil. I was very disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxcVBIS0lnEAE",
            "text": "I ordered on uber eats. & this restaurant did NOT DISAPPOINT. The food was hot and fresh. I ordered the rotisserie chicken combo.\nThe chicken was juicy and flavorful!! The rice was slightly bland however the red beans brought it to life with so much flavor. The plantains were a little too thick for my liking however they were very sweet. Definitely will be ordering again."
        },
        {
            "date": "1년 전",
            "language": "uk",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbkk3cUlBEAE",
            "text": "Дуже дивний вийшов досвід. Ми завітали в це місце на сніданок. Замовили домініканський суп і тушену курку з картоплею, курки дві порції. Дівчина записала все у блокнот. Після чого нам спочатку винесли курячий суп (пізніше замінили, після претензії), а потім одну порцію курки з картоплею. Мені здається, треба або вчити мову, або уважніше ставитись до своїх гостей. Курки на тарілці було два шматки, один з них - частина спини, на якій були лише хрящі і кістки. Смачно, хоча і жирно на мій смак. Ціни дуже бюджетні, справді."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MGEyM3VRRRAB",
            "text": "This place is great! The food, company and service is 💯.  Very welcoming. It's a revolving door with with customers coming and going. The food is just as the picture shows. Thank you. I will definitely be back. God bless 🙌 🙏 ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMTZPdmxBRRAB",
            "text": "Omg! When in NYC make the trip up to 125th for delicious authentic Mexican food...just like momma cooked it herself! And the server Karen's is amazingly attentive and sweet! We will be back El Tina!!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2anRQak1REAE",
            "text": "Good food good service and open late. Be sure to try the all-day lunch menu. In the winter, the draft will hit you, like most NYC restaurants."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dTlmdUhnEAE",
            "text": "The food here was absolutely delicious !! I ordered the chicken, rice, eggs and black beans. Staff super friendly. I would definitely recommend this place !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIaXZ5RjJBRRAB",
            "text": "Always a great experience when I go a Tina’s. Great job for those hiring managers to find nice and friendly people to help us. Love the coffee, avena and guava con queso pastelito"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicWRMOS13RRAB",
            "text": "Gracias por el servicio, la comida exquisita y a Karina por su excelente disposición de servicio 💖 la mejor comida en esa zona"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dklUblZ3EAE",
            "text": "The food here is perfection. Everything is so fresh, flavorful, generous portions. My go-to place whenever I'm in Harlem ! The staff is friendly, attentive, and truly understands the value of customer service!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdExhMVBnEAE",
            "text": "Teníamos antojos de comer acá y nos fue muy bien! Quedamos leños y la comida exquisita, Cris fue excelente sirviéndonos, fue muy atenta en hacernos sentir cómodos y comer rico! Gracias! Definitivamente me doy una vuelta otra vez"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCLTcyWmJREAE",
            "text": "Nothing is better than a good bowl of Sancocho on a very rainy day and El Tina restaurant is where I decided to go.\n\nThe restaurant is small but has ample seating for diners to sit. On entrance, you’re warmly greeted with a smile. Servers can be seen wearing netting over their hair as they serve the food from a buffet set up. This is a big plus for me.\n\nThe food portions are very generous for the price. Equally so, the taste is out of this world and well seasoned. I added a little bit of hot sauce to give my Sancocho a little umph as i like my soups spicy.\n\nTry El Tina if you want good Spanish food and great customer service. You will be treated like family."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OTZtU21RRRAB",
            "text": "AMAZING food. Their food is so authentic and their tres leches is phenomenal. Karina was such a sweetheart too and gave me sweet platanos to try. Will definitely be coming back :)"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydnFHYlJREAE",
            "text": "Fantástico restaurante en Harlem. Comida recién preparada para comer alli o para llevar. Las camareras más amables y simpáticas de todo New York."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdDcybXFnRRAB",
            "text": "Excelente comida caribeña en harlem. No duden en ir y disfrutar del rabo con arroz moro.\nAtencion excelente de las chicas. Voy a volver pronto."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5M19tUzB3RRAB",
            "text": "Ordered a shrimp ceviche/Ceviche camaron. Wayyyyyy too much lime. It was extremely salty. To the point that it was inedible. Also it was supposed to be a camaron style ceviche and it was not!!!! Very upsetting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsM3VLakdBEAE",
            "text": "Food is delicious and prices are fair. I had the oxtail which was delicious. My friend really enjoyed her breakfast platter. I’ll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidDUydTNRRRAB",
            "text": "Karina provides a great service. Food was great with a real Dominican flavor 10/10. I would definitely come back."
        }
    ],
    "reviews_count": 74
}