{
    "name": "Sapps",
    "place_id": "ChIJD5sIbkj3wokRLoC5phmbWlU",
    "grid": "MN9",
    "address": "2888 Broadway, New York, NY 10025, USA",
    "rating": 4.3,
    "user_ratings_total": 116,
    "phone_number": "(646) 454-9622",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCR1VHVnhhRmR0Y21GMlVVeHhXbVY1VG5aR09VRRAB",
            "text": "Honestly AMAZING meal! Food, service, atmosphere were all 10/10!! The teriyaki tofu was unreal and the sushi was delish!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSFZXbFVhRzlZWTNvemVXSjZjWHBQUkVzeVdtYxAB",
            "text": "I ordered guydon and tonkotsu Ramen. The food is rrealy nice. The real flavor of Japan. I lived there for tree years and miss the food so bad. I visited bunch japanese restaurants but all of them was far from real japanese cuisine. But this one got me back to those amazing days when I lived in Japan. A hundred percent must visit place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNFZrWjFiVzQ0ZUhWT09FdEVUa3R2V1VGRk1YYxAB",
            "text": "Food was great! I enjoyed the tempura and takoyaki. The servers are very nice and the bathroom has a ton of anime and manga references :)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pST1QyaGhVVkp4UjFOd00wNW1iV05sWDBSMVEyYxAB",
            "text": "The taste of the food is fine. But it’s not authentic Japanese food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4R1ZUUXRhVmhzTlZZMFZYZEliVEpwV2pOU1YxRRAB",
            "text": "Seated immediately and had great service. The first time I came here I had ramen and it was mediocre/ a bit bland, but that’s not necessarily what they’re known for. Looking forward to returning and trying some of their other menu items!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kZlQzSkhiRW93UWs4MmNVMUtNVk5MZVhsNGFFRRAB",
            "text": "I ordered the lunch special. The spicy tuna was very strange in color (yellow to gray), had no taste, and was not spicy. I would not recommend it. The eel avocado roll looked like a skin-ell avocado roll. :) The phyladelfia roll was okay. The food deserves 3 stars."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNFdIaEdMVXBrU1RSSFVqWjNOMjkyWDI1YWNrRRAB",
            "text": "Fantastic food in a great spot, but service was a bit aggressive. Ordered a drink and received the check minutes later. I did end up ordering food which was delicious, but the rush service ruined my experience."
        },
        {
            "date": "2달 전",
            "language": "ja",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaVVYVlFhR1pxUzJ4MFVGWkhWVTF1VDBKdFNrRRAB",
            "text": "可もなく不可もなし。\nまた行きたいかというとそうでもないかな。\n\nTuna Tataki$17.00\nSUSHI & SASHIMI Combo$36.00\nTax$4.70\nTotal$57.70\nチップは18%,20%,22%"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNFlsQXhZMHhXYlZSUlFVaDBVemRDYTBWRWRIYxAB",
            "text": "the eel on rice and sashimi were all very good. would recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMFlrUmFVVzlKTkRGck5XaGZWbk51VUZWdFJWRRAB",
            "text": "My favorite neighborhood spot in LIC. Staff remember you, your order and are great people. Food-wise - I don’t know better sushi at this price point in the city. Is it omakase counter level? No. But, for a causal spot, this place is excellent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVd2NqWnVhbE5JWkVOb2NsTkthRVpHT0ZjMlFrRRAB",
            "text": "Sapps is the best for Japanese food. Good environment, good price and a lot of space! Specially if you wanna do birthday party or celebrating something special for your special moment and with special person."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMVV6QjBXSGxmWmpJNFZsSkVRV1ZvVlROd01YYxAB",
            "text": "Fast service, cute place, but sushi is pretty mediocre for the price."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbloyZENhamRKUW1abVMyaE9Talk0UjBaQk0xRRAB",
            "text": "Good sushi and service!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPTGFuTHEteFlHcnp3RRAB",
            "text": "Sapps ha sido una de las mejores recomendaciones que he recibido de mi amigo y antiguo profesor de Inglés. Él es muy fiel a sus restaurantes tradicionales pero sé que cuando se atreve a probar cosas nuevas y me sugiere que lo haga yo luego, es por que es muy bueno! Es un conocedor y confío en su paladar. Está vez, como siempre, acertó. Me gustó mucho Sapps no solo por el indescriptible buen sabor de su comida sino también por la cuidadosa presentación,  el excelente trato, y el muy agradable ambiente. Familiares y amigos que han venido conmigo opinan lo mismo!\nSapps has been one of the best recommendations I've ever received from my friend and former English teacher. He's very loyal to his traditional restaurants, but I know that when he dares to try new things and suggests I do it myself, it's because is very good! He's a connoisseur, and I trust his palate. This time, as always, he was right. I really liked Sapps not only for the indescribably delicious food but also for the thoughtful presentation, excellent service, and very pleasant atmosphere. Family and friends who've come with me agree!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMMjc5YnV5dkludklREAE",
            "text": "This place is a 10 out of 10. The food was amazing and the service is superb. Can't wait to go back."
        },
        {
            "date": "5달 전",
            "language": "cs",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOLWRvdWpYdDZ1U3RBRRAB",
            "text": "Skvělé jídlo a pití, obsluha milá. Frozen margarita nemá chybu!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOU2J6N2E0enZUR3R3RRAB",
            "text": "This place does not allow their uber and doordash drivers use their restrooms 🤔🤔🤔🤔"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcTltM3lnRRAB",
            "text": "Service was friendly and attentive. Sashimi/sushi are pretty tasty. The Sapps roll is delicious. The sashimi selections are reasonable, but the slice is slightly thicker than my liking."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM1oyUmdnRRAB",
            "text": "Sushi and fried rice were overall disappointing - rice was bland and sushi was not anything special for the price. However, service was very fast."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM01QZEtREAE",
            "text": "After a long day of walking, this was the perfect spot to rest and refuel. Great value for their $19 lunch options. High quality sushi, wonderful vibe from the service staff, good music and awesome sake. Try their premium cold sake! Wow! So glad we stopped here on our trek to get a pic of Tom’s diner (Seinfeld)."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNlBQODlRRRAB",
            "text": "My Sister and I went to Sapps for dinner and liked it so much that we went back a few weeks later.  The interior is very nice with lots of seating. Both times we went we had no issues with being seated quickly.  From our two experiences we had the Sashimi Dinner, Firecracker (Yellowtail topped with yellowtail Jalapeno, Seaweed Salad, Yellowtail Serrano, Karaage (Japanese style fried chicken), Salmon Skin Salad, The Thunder Dome (Cubed tuna or salmon, wrapped with avocado and topped with spicy mayo, eel sauce, and tobiko), and the Matcha Churro for dessert. The sashimi was some of the best I have ever had.  It was extremely fresh, flavorful, great quality, and the portions were larger than I expected.  All of the dishes were great.  The Thunder Dome was very unique and I have not seen (or tasted) anything like it before. The wait staff was really attentive and took great care of us.  My sister and I are huge sushi fans and this place ranks near the top of the places we have been.  We had two awesome experiences and would definitely come back when we are back in the area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dEtmdGtRRRAB",
            "text": "Wasn't too busy on a Sunday night but still a good lively atmosphere. Ordered multiple appetizers and some sushi rolls and everything came out absolutely perfect. Not only did the food look beautiful, but it tasted amazing. Got the Ginger Mojito and it was delicious!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dnRLYmVREAE",
            "text": "Average Japanese restaurant in nyc."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBeWQ3MjRnRRAB",
            "text": "Mt family received food poisoning from their ramen two consequent times."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaE56MjZBRRAB",
            "text": "I recently dined at Sapps on the Upper West Side, and it was an absolutely fantastic experience! This charming Japanese restaurant offers a delightful selection of sushi and sake that truly impressed me. The ambiance is casual yet inviting, making it perfect for both a laid-back lunch or a fun dinner with friends. Each sushi roll was expertly crafted, fresh, and bursting with flavor, while the cocktails complemented the meal perfectly. The staff was attentive and friendly, ensuring we had everything we needed. With a great atmosphere and delicious food, Sapps is a gem that I can't recommend enough. Five stars for an unforgettable dining experience!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNnMtZnBnRRAB",
            "text": "This place is pretty solid as far as a sushi restaurants go. Pieces are fresh and decently sized, cocktails are fun. However let’s address disability/accessibility. It’s like how do you say you aren’t really wanted here without saying you aren’t really wanted here. Here is the answer; Take a seemingly accessible restaurant and put only high top tables on the ground level where the accessible bathrooms also happen to be located and then put all the regular height tables in the back on the elevated level that is only accessible by 4 or 5 steep steps. This is backward and most likely in violation of the NYC building code because accessible tables need to be placed in or on the accessible route. There are plenty of good sushi restaurants on the UWS that are accessible for people with disabilities. This restaurant should know that people who use wheelchairs have money to spend and would prefer to frequent establishments that welcome them. So unfortunately no need for us to return. But hopefully they figure it out."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ak5uSXNnRRAB",
            "text": "Great food, came here yesterday for lunch and we were very satisfied. The best sushi in nyc, and selvi is the best server, she always smile and checking on us whether we need something even at busy time and she was alone. Great job👍🏻. We will come back for sure"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbjdPLUF3EAE",
            "text": "Really unimpressed after dining in for dinner and takeout lunch. Lunch special is hardly a special at $17-$19 for plain udon noodles (no veg) and katsu bowl (again, not a veg in sight) missing accompanying soup. Green salad only included cucumber WHICH ARE UNDER RECALL. Nice vibe inside and friendly staff but won’t be returning"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQa29HM2J3EAE",
            "text": "Ate here with a friend recently and it was such a great deal/experience. The lunch specials are great. They have a three roll combo for 19 dollars that is pretty remarkable. I got the salmon/sweet potato/tuna rolls. Also, the lunch special sashimi looked great!  The only small issue is that my friend ordered ramen which came out in about five minutes. My sushi was taking a lot longer. After ten minutes of waiting, he asked the server what was up with my order/did they forget about it and the server was pretty snippy and rude to him about it. FWIW I told my friend that it was taking longer because they were rolling and cutting the rolls to order and wasn't thrilled he asked. However, the server could have handled it a little more gracefully. He could have even said \"Don't worry; it is coming\" or even \"it is coming\" instead of being a bit rude.\n\nThat said, I will absolutely come back to this restaurant as soon as I possibly can! It was incredible."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbEpUVlNREAE",
            "text": "the sashimi rice is good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeHRfaXlnRRAB",
            "text": "Great food and drinks, wide selection of Japanese food, From ramen, donburi and sushi. Great happy hour and cocktails also. Service is fast also, even on lunch hour rush"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuay1EeU5REAE",
            "text": "Great drinks and food for great prices. Margaritas are on point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMGJhVjRnRRAB",
            "text": "the lady who served us was absolutely wonderful, she made our day"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaTRDMjZnRRAB",
            "text": "I thoroughly enjoyed my experience at this restaurant, my waiter Matt was amazing, and the food was absolutely delicious. I absolutely go back again. Nicole"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidC1MRzVBRRAB",
            "text": "Very good. Comfortable environment and fresh food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeks3ajlnRRAB",
            "text": "Service 6 stars. Thank you Christian for helping us explore the menu.\n\nSushi and seafood is great.\n\nAlso, the Onsen egg is fire, get it on top of your donburi bowls.\n\nPleasant little July 4th meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOXNpXzl3RRAB",
            "text": "Very good Japanese restaurant.\nHad lots of sushl and all of it was very good. The highlight was the shrimp and vegetable tempura . I'll be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdGJMVVRBEAE",
            "text": "I went here with a friend a few weeks ago. The food was fantastic. We were so happy with the food that we even ordered dessert. And the price came out great! For two rolls of sushi, drinks, an appetizer and dessert, it was $70 in total. That’s really great for the area and unexpected too. The waiters and team were amazing! Everything was clean and well maintained. It’s a great place to go and I’m actually hoping to get some takeout from them today, lol!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcWJEZHFnRRAB",
            "text": "Wonderful ambiance, amazing sake and delicious grilled Japanese seafood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREejdYbnpRRRAB",
            "text": "The food was spectacular, with the bento boxes and sushi being incredible. The service was terrific, and the atmosphere was also very good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREekxXek53EAE",
            "text": "Really awesome spot in Morningside! I got takeout, but the whole restaurant is a fun vibe and there’s heaters! The service was really friendly and my food took around 15 minutes to be ready. The noodles were delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkamZ6ZUJBEAE",
            "text": "Eh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURON2J2VDZBRRAB",
            "text": "Tempura was too heavy and oily. Specialty roll and chirashi were fine. Service nice and efficient. The noise was hard to have a conversation with even though the restaurant wasn't all that crowded around 7:30. However, there was a group of several girls, maybe 10 years old, who had something like a birthday party with all the attendant laughing, jumping and horseplay, totally uncontrolled by the group of adult women (their mothers? teachers?) sitting at the next table. Not acceptable."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxZ1k3X2N3EAE",
            "text": "A lot bigger than I expected it to be! There’s a bar out front and the dining area in the back. Loved the decor as around the holiday time, one of their walls was fashioned into a giant gift box haha. Waiters come around quite often and quickly. My only gripe would be that I asked for the appetizer first but they served everything at once so the table got a little crowded. The food was good, I had the tuna entree, my boyfriend got the salmon entree. The kaarage was okay, it wasn’t dredged in rice flour the way I expected most karaage to be but it was decent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxd3JDeERREAE",
            "text": "It's a really lovely restaurant. The food was delicious, and the service was excellent. I recommend ordering some green tea with your meal: good quality tea, matched the food in the bento box menus perfectly.  The decor is beautiful and cozy, the chairs very comfortable, the restroom is spacious, very clean and beautifully decorated.  The place was suggested to me by a friend and was an amazing find!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWMThhV0ZBEAE",
            "text": "Very cute date spot, not very expensive, and the Sprite is suspiciously good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWcHR2bkpnEAE",
            "text": "They have charging outlets. Great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWaHFhSmd3RRAB",
            "text": "Reasonally priced Japanses food with excellent tastes.\n\nWent in for a group of 10, and they have a large round table perfect for large gathering.\n\nOrdered a lot of things and the ones I am very impressed were the Hamachi Kama, Black Cod Miso, Chicken Karaage, and Takoyaki.\n\nBlack cod miso was grilled to the right doneness: tender and with a bit char on the edge. The meat just melt in the mouth.\n\nHamachi Kama tasted without fishyness. The fish collar is quiet a cultivated taste item and it can be too much for someone who never had it before. I loved kama so I really liked it.\n\nThe chicken karaage is juicy inside and crispy outside. Exactly how you would expect for a fried chicken.\n\nThe takoyaki tasted like indulgences. Fluffy dough with cubes of octapus inside. The contrast of texture paired together with sauce is so good.\n\nThe sushi rolls were also great. The Salmon is my Game is perfect for anyone who loved salmon. The Selfish, Sapps Futomaki, and Pico De Salmon stood out from the rest of the rolls we tasted.\n\nThe desserts were average. The matcha churros and fried cheesecakes are quiet rare to find. All desserts were somehow paired with ice cream.\n\nThe service was superb, and for 10 people we only spent 350ish. That is very decently priced and portioned."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdDZ6UlN3EAE",
            "text": "Excellent food quality; authentic Japanese food; friendly and attentive service from a largely Japanese staff. Good atmosphere in a pleasant dining room where guests are not on top of each other."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdlo3bW9nRRAB",
            "text": "Recommended place. The price and food are good. Love it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeU8zYzR3RRAB",
            "text": "I love poke and started eating poke in Hawaii. This restaurant had one of the best poke bowls I've ever had. The color presentation, and the addition of \"crunch\" in the bowl was delightful. The house sake tasted great, and was enough to share. My wife ordered the pork tonkatsu, which also tasted delicious. The service was accurate and efficient. The atmosphere calming and conducive to a relaxed meal. One of the best restaurants I've visited in NYC thus far."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtc2RySHB3RRAB",
            "text": "This place is a bomb !!\n\nService : Front Host and servers were extremely knowledgeable and friendly. Made some great recommendations. Always in the small details like my water cup was never empty.\n\nStarted with grilled octopus , miso cod . The cod was flakey and grilled to perfection. The octopus was charred with a hint of smokey flavor, grilled to the perfect tenderness.\n\nDrinks - had a frozen margarita Perfect balance of sourness from the lime juice. Compliments to the bartender. I'm not a huge drink fan but there is an extensive list.\n\nCurry Pork Kastu and sashimi for entrees. Super fresh fish would definitely order again. The curry was out of this world. Amazing depth of flavor to cover a juice pork Katsu.\n\nLastly we finished with matcha churros and ice cream.\n\nOverall compliments to the chef and the staf . We had an amazing dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCeHRxcU93EAE",
            "text": "Ramen is great on a rainy day and Sapps hit the spot. Mg group got the tonkotsu ramen and the shoyu ramen. The ramens came with  a side salad which was a nice plus! We also got 3 rolls, the eel avocado, tofu skin, and spicy tuna which comes with either miso soup or side salad. Our group got the seasonal tea to drink which was flavored with strawberry and vanilla. The meal ended with hi chews which was a nice sweet after finishing our savory ramen. A bonus was the decor in the bathroom. It included manga pages from one punch man, slam dunk and one piece!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldDlLeENREAE",
            "text": "Have been a few times to their LIC location, here is also up to their standard. Really excellent sashimi but still at a price point that doesn’t finish off the food budget for the next 6 months. Trendy decorations and bar atmosphere. A worthwhile addition to the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcGMyQW93RRAB",
            "text": "I love this place!! The sushi is amazing, super fast service, and everyone who works there is so nice. Amazing lunch specials. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdXFMLXlRRRAB",
            "text": "I loved my experience. Lots of choices. My sushi loving companion treated himself to raw fish eggs and urchin. I had a deliciously cooked eel bowl. The server was very attentive coming in to refill our water and noticing when we were at the end of our meal to offer the dessert menu. She even made some recommendations based on her favorites. I loved the atmosphere and music. Very otaku-ish. I am totally going to go again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcHRDeGhBRRAB",
            "text": "I recently dined at Sapps and had a great experience. The ramen was excellent, particularly the smoky pork flavor. The sushi was also good. The tea was a standout, especially on a cold and snowy day. The atmosphere was cozy and the service was friendly. If you're in the mood for some delicious Japanese cuisine, I highly recommend giving Sapps a try."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNHREYWN3EAE",
            "text": "Fast, good portions, friendly staff, amazing happy hour."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCcjYtOUtBEAE",
            "text": "Food 4/10\nOrdered the udon, definitely overpriced for what it is. I could definitely make this at home, but wanted to go with a couple of friends. A lot of the dishes are hit or miss.\n\nAtmosphere 4/10\nIt’s fine, just felt a bit icky inside? Can’t really describe why, but it was a very mid space.\n\nService 4/10\nEven though the restaurant was practically empty, we weren’t allowed to get seated until the entire party arrived :( Also didn’t love the attitude of our server."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlX043dE5REAE",
            "text": "This place is a great new addition to the neighbourhood.  We tried their sashimi platter, various kinds of sushi, and rice with unagi and they were all fresh and delicious.\n\nWe love the ambience of the place, esp at the front.  The back of the restaurant seems to be a legacy of the previous French restaurant, but having talked to one of the waitresses, they said it is in the process of being updated too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeGEzY1p3EAE",
            "text": "Went here for lunch midday near Columbia. Super friendly and nice staff. Service was prompt. The food was delicious. I had a tempura bento box and loved it! I will be back for sure. It's rare to find a place that has great service, food, ambiance, at a reasonable price. I appreciated the host and waiter for making the experience awesome. Thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMDVIUmR3EAE",
            "text": "Very disappointed, I been the their LIC location, it wasn’t this bad.\nTempura platter: over fried, no flavor, and where is the grounded daikon?\nEel bowl: the eel is extremely dry, the rice is not hot at well, not enough eel sauce (it’s not even eel sauce just soy sauce….). The frozen eel I bought from H mart is even better than this…..\nAgedachi Fried tofu: the fried skin is too thick and not that much flavor either\nMaybe I should have order sushi?!\nThe service is good though…."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtXzZHZFJnEAE",
            "text": "We really love this new sushi restaurant. It is located close to home and has by far some of the best Sushi on the UWS. A little pricey, but it is very tasty and elegantly prepared. We love the shumai, Sushi pizza, Miso Cod, and the Steak Terriyaki.  As well the staff is very friendly. Alex the bartender is awesome! Looking forward to more visits!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKb0tpcDRnRRAB",
            "text": "One of the best affordable Japanese restaurant in NYC. I love that they put dried bonito flakes between the poke filling and the rice. I like this kind of small but nice technique to make the plate flavorful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdnNhbzFBRRAB",
            "text": "I had a really humiliating experience at the restaurant and would really advise others to tread with caution. As an international student at Columbia, I have lived in Morningside for a couple of years, frequenting all major restaurants. My experience at Sapps today was a major outlier - extremely rude and shockingly racist. Upon request of the cheque, our host - Mr Randy informed us of the minimum $15 cap per person. We ordered another item and recommended to our host that he inform the other guests of the minimum commitment before they place their order, given that the menu never mentions anything of that nature. We were surprised to find our host, Mr. Randy, rebuke us that we are probably new to the city because everyone in NYC knows of this unsaid rule and nobody needs to remind guests of the minimum cap. He also mentioned \"This is not a snacking bar and we do not get guests like you come here to try out a couple of rolls!\". We realized that this behavior needs to be highlighted to the management such that other guests do not receive such disservice. Randy introduced us to his colleague who clarified that we need $30 minimum commitment to swipe a credit card, and informed us that the manager is unavailable. Even after our multiple requests we were not given any details of the manager or a mechanism to raise our complaints."
        }
    ],
    "reviews_count": 65
}