{
    "name": "Bless Bar & Kitchen",
    "place_id": "ChIJmdsiqK_3wokR1lEvmzhY5nc",
    "grid": "MN9",
    "address": "3496 Broadway, New York, NY 10031, USA",
    "rating": 4.7,
    "user_ratings_total": 178,
    "phone_number": "(646) 719-1155",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NFZHaHlkRVJHU0ZWb2NreFdlRzVGTFd4S1kwRRAB",
            "text": "Always a vibe"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdGJHdHFYemx1UjFOdlQybGtSV2hvTTFwM1YzYxAB",
            "text": "I quickly became a regular, my cousins DJ here on Wednesday & Thursday nights. My first time was April 2024 for my birthday.\nNow when family or friends celebrate an event my whole family comes out to have a great time. I even had my daughter’s 25th birthday celebration. Here April 2025, I luv it here. I usually order, lamb chops with rice or mashed potatoes whatever is in the puréed sauce he put over the lamb chops. It definitely elevates the meat. The wings is my next favorite and cheese burgers with fries is right up there in my top three.. we usually get a picture of Red  and white sangria.. after we eat have a few drinks smoke some hookah and dance the night away… every Wednesday and Thursday.\n\nThe whole menu is actually good, but these three are My favorite …"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdVEyVkllR3RvWHkxak1XTklWRWhNYWpadk9YYxAB",
            "text": "Bar I love the service. The manager is fabulous. I also received a promotional offer in my Facebook messenger for a buy one get one free meal and I took advantage of that today enjoying the weather in the city and when I tell you the lemon butter salmon mashed potatoes,  zucchini along with the lemon chicken was so good. I ate the entire plate. I was so stuff the flavors are fresh. It takes like something out of a cuisine restaurant. It was so delicious. Nothing is made out of a box. Everything is fresh ingredients made with love. Every bite was so amazing. I give it 10 stars. and the happy hour drinks was rocking you’re not gonna find a five dollar margarita that’s strong that good. This is a great spot for karaoke. This is a great spot for after work. This is a great spot to go to just kick your feet up and lay your head down outstanding service today."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocVgzWTBWQzFOZFdkbWREaEhUVzFuVTJoQmNWRRAB",
            "text": "Cannot Say Enough Good Words About This Restaurant Down To The Food 😍 The Salmon Was so Delicious very amazing customer service , ASK FOR JENNIFER 🤍 phenomenal hostess . Proposed To My Girlfriend They Went Out Of There Way To Make It Happen For Me. Very Happy And pleased made my entire month the owner and her husband is phenomenal let me play any music I wanted 10/10 for birthdays and any events🩷🩷🩷"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sZk0xUmxOWEZVTUhKRE0zQjRSbTB3YVZaNVdVRRAB",
            "text": "#whereisweekes.....having a great time at Bless Bar & Kitchen.  My daughter and I went to eat afterwork. We had these coupons and they worked out just great. I had the buy one meal get one free, so i had grilled Pork Chops n Mashed Potatoes  and my free Bacon Cheeseburger n fries.  The Cheeseburger was sooo good and juicy fries tasty too. My daughter Kemia had the free Appetizers with the purchase of $20. So, she had the wings which was good and the grilled Pork Chops.  She said the chops needed seasoning  but still good and juicy. Erick Tejada was the only host with the most...he did his thing, the owner Daisy was very down to earth and very grateful that her customers enjoyed her establishment.  The Dj was good music on point with Old Skool n R & B....The first drinks we had was not to good, my daughter had the Margerita. She said it was too sweet and I had the Long Island Ice Tea.  The Tea wasn't Teaing but we moved on to the Rum Punch. Now the punch was 👊 lol. I definitely recommend Bless Bar & Kitchen. Oh, they have hookah too if you smoke."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVVJESllUamw2TUV0RVFXaHJWbUYwZWpVM1VYYxAB",
            "text": "Last Monday, a friend and I were looking for somewhere nice to eat when I remembered a friend and colleague of mine referred me to Bless. I was in the neighborhood and decided to stop by. We ended up choosing the tables outside since the weather was nice and the neighborhood was thriving for a Monday.\n\nWe were greeted by Daysi who I assumed was both the host and the bartender. We were given menus and ordered drinks first. I had a double shot of Johnnie Walker Red and my friend had a Margarita. After we had a few sips, we were ready to order.\n\nThe Red Fried Snapper peaked my interest so I ordered that with some Tostones. My friend ordered a Skirt Steak with some Fries (Steak Frites). Another friend of ours ended up joining us and ordered some Wings and Fries with a Frozen Margarita.\n\nNow I must say, I've had fried snapper before, but this was different. At first bite, I felt like I got sucker-punched by the immense amount of flavor the snapper had. I literally melted every time I went for another bite. The Tostones was excellent as well. I tried a piece of my friend's Skirt Steak and it was just as flavorful as my snapper. Juicy, tender, everything you would enjoy about a Steak. Whatever the Chef did, they knew what they were doing.\n\nHats off to both Daysi and the Chef for cooking us such a phenomenal meal. I will definitely be back for more!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vM2VFcHNibk51V1Uxc2FISmpNa1p4TlRrNVozYxAB",
            "text": "Muy atenta excelente y todo muy delicioso, vengan y prueben estas comidas recomendadas"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vd1Z6VTNWMkYyVDFoaFluVk1TbTEwZURoeVYxRRAB",
            "text": "The BEST… I’m not even exaggerating, the BEST burger and FRIES I’ve ever had. I ordered via uber eats and did it again 3 more times. Same quality EVERY SINGLE TIME. Literally delicious.\nWhen I get over these delicious burgers I’ll try some other things on the menu. But from now I’m hooked on the Bliss burger🔥"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkd1RFNWthbEpmZERCUVJVUmhTbWRmVUZwaWMyYxAB",
            "text": "Good 😊"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbVdtNUhPRFZZV0RaWFgwcEpjRkZaT0ZrMU4xRRAB",
            "text": "I was truly impressed with the way the food taste."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKUDk5SUs1X1BTWF9BRRAB",
            "text": "The food is good. What I had was the pechuga de limón with mashed potatoes and it was amazing. The waitress is cool, it’s a calm place. I recommend to come through If you wanna chill have a drink and some\nHookah nothing crazy 🩷🤞🏽"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdW9Db3ZBRRAB",
            "text": "Service was OUTSTANDING at Bless Bar and Kitchen. Appreciated everyone's kindness. Outdoor seating was a nice way to enjoy the food and weather."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbUpiSk1nEAE",
            "text": "The service was perfect ,  the food was awesome\ndeliciousssssssssss u need to come here , my firths time , I had the best time, I enjoyed my self and left well  satisfied ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbU5yNE1REAE",
            "text": "Hospitality music very good atmosphere awson"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvZ3ZtSzJ3RRAB",
            "text": "Came in off Chris's recommendation and we had a nice time. Nice vibe solid food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cHBPSmZBEAE",
            "text": "You feel like you are in your living room with family. I will go back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMUx6SElnEAE",
            "text": "Loved it here. It was a vibe here and it was a Monday ."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbl82UFpBEAE",
            "text": "Food is delicious 😋"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eTctcmd3RRAB",
            "text": "The fried wings and French fries were tasty and not greasy.  The waiter was attentive and very respectful,  I had a wonderful  time there. Please try the Sea food rice dish.  Sorry didn't take photos."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2b05YWVF3EAE",
            "text": "Luv the place cozy and very nice atmosphere"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cGJ1WV9RRRAB",
            "text": "Had a great time with family and friends"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cGJ2UVFREAE",
            "text": "👍"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cGJHZmpRRRAB",
            "text": "Loved the vibes, music was on point."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cGRiRGZBEAE",
            "text": "Grateful"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cGRiV2dRRRAB",
            "text": "The promoter Litty Liv was great hostess."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cGJ6a1lBEAE",
            "text": "I was in the neighborhood and decided to stop by Bliss Bar & Kitchen for happy hour, and the experience was fantastic! The ambiance was inviting, the food and drinks were absolutely delicious. I was served by the bartender Daisy, who was incredibly attentive, and both Daisy and Olivia brought great energy and top-notch customer service skills. The margaritas and wings were especially excellent. Highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eFpfMUVnEAE",
            "text": "Very cute place and good wings!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eGNfNlFnEAE",
            "text": "DJ abebaby fire with the music, I love this DJ"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eGFmWWRBEAE",
            "text": "I love having a good time with friends and FAMILY ESPECIALLY LITTY LIV 🖤"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eGZ1UnBnRRAB",
            "text": "Great atmosphere!  Drinks and hookah were amazing! Litty Liv was the life of the party!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eFl2SmlBRRAB",
            "text": "Shout out to Liv for suggesting the spot!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aE1DMkJ3EAE",
            "text": "The food is delicious!!! It’s my birthday weekend and the server blessed me with playing aventura! I would definitely return ! It’s a small intimate spot! But defy worth coming in"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQenBhVFJBEAE",
            "text": "Friendly,  Smooth & Cozy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeUtHRnJ3RRAB",
            "text": "The place was good it is a little small but they have outside seating. At the time which was happy hour that goes from 4 or 5 pm till 9 or 8 pm not sure. But there wasn't a lot of people but it was a Wednesday so you can't blame them. Overall the bacon cheese burger was pretty good considering I was drunk already might go back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbmRqNVpREAE",
            "text": "It was great I had fun!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueGRXWVRBEAE",
            "text": "The Food is great there! As well as the service!! Daisy who served  me is wonderful. Always great and a good time when I go there,Rum punch is a must!!!😉"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubk5xVlpREAE",
            "text": "I went recently and order a paella! DELICIOUS😋 and the service from Daisy was excellent👍👍👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudU1MNHF3RRAB",
            "text": "Came here for happy hour with my girlfriends. We purchased a bottle of Rosé and order 3 orders of wings and 2 orders of fries. The waitress delivered 3 orders of wings and only 1 order of fries. One of the wing order was incorrect.  She took the incorrect order back to the kitchen and never came back with the wings or second order of fries. She never even check on us after 15 mins we called her to the table and canceled our order. Horrible service, I would never come back here."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudHI2SkpnEAE",
            "text": "Excelente Lugar! La comida me encantó y además la sirvieron super rápido. Ambiente acogedor, con música agradable; pero lo mejor de todo es la atención, te hacen sentir como en casa. 100% recomendado."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURickxqU0JnEAE",
            "text": "Place is small but the atmosphere is great, service is great, and the place is clean. The neighborhood is uncharacteristically friendly, and whether inside or outside, you will have a great time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiXy16bDZBRRAB",
            "text": "Ordered food online. Google listing has them open. Money and order processed. Get to the restaurant and their not open\n\nCall to find out what gives. They don't open for another 4 hours! I ask for the charge to be reversed and he says arrogantly,  call your bank. I would recommend NO ONE order anything from them online"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUN3VqWFVREAE",
            "text": "Food is good and vibe is amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdWRXOTNBRRAB",
            "text": "Great place great management great atmosphere excellent vibes !!!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ1BTWXZ3RRAB",
            "text": "I won't rate the food since we stop by for another drink after leaving Mama Sushi, plantains were only ordered and they were prepared excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcHJIVzVBRRAB",
            "text": "Amazing spot love the loud music"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaWZuY1ZREAE",
            "text": "Platino frys with garlic sauce is delicious/ Humberger one of the best in manhattan"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NDd1YWlnRRAB",
            "text": "Great finger foods and great drinks\nService gets tougher as the crowds grows . Also has hooka to smoke"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aHZMaUxBEAE",
            "text": "Daysi was the perfect host. She was very attentive and friendly. This was my first visit to Bless up and it was a great experience. Food is good, atmosphere is chill and the happy hour hits every time.  I'm going to post my review on tiktok"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMmZfSC1nRRAB",
            "text": "Love this place, they are very welcoming, the food is excellent, and the music is great. They play everything. The Decor is great for pics."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMmItZkF3EAE",
            "text": "Its amazing place! Nice, great food and Daisy and Jennifer and the crew are just so welcoming. It’s definitely my go to spot after work. The music is great! I would definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcG9EaHlRRRAB",
            "text": "By far the best food PERIOD!!!!! The chef is called Mr Perfecto along with his make magical dishes from apps to entrees.The staff is through the roof courteous and attentive.I frequent here every chance I get.I’ve even had events here,nothing but spectacular and a few business meetings.The lady in charge Daisy is a drop from heaven who moves mountains to make guest and patrons happy and never afraid to get her hands dirty. The Decor is also eye catching and festive for all holidays.Bless is also very in tuned with the community. Bottomline you can’t beat Bless for quality of food and good tasting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0c3F2ODdnRRAB",
            "text": "Came here for the first time and loved the place, I ordered a ribeye steak and it was amazing for the price point only 36 bucks. And it came with mash potatoes and vegetables. I sat at the bar with Jose he made me an amazing margarita and gave me outstanding service. See him and treat him well"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlb2VYNjl3RRAB",
            "text": "I’m sorry but I have been coming here since they open and since then gave nothing but good reviews and praised ownership. THEY GOT ME MESSED UP I ORDERED 2 rounds of drinks and appetizers $200. SERIOUSLY. I understand the whole small…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbGRIeHR3RRAB",
            "text": "lived in Harlem for year can't believe I just came across this gem!\nGreat service!\nEric the bartender made the best drinks for my friends!\nLoved the mixed of music!\nThe food was delicious!\nMy new regular spot!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMk5HcU93EAE",
            "text": "Hands down the best restaurant/food in the community of Harlem. Not only is the food delicious, but the service is incredible. Amazing quality and quantity.  The owner daysi is such a kind and loving person she makes you feel right at home! Come and experience what i experience y’all!! :))"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNWU3STRBRRAB",
            "text": "They are just starting up. At the time of writing (mid Sept 2022), they do not have their liquor license yet, but expect it by the first week of October. That being said, the staff is so friendly, welcoming and professional, the food is so good and the place is so nice and clean that they already deserve a 5 star. Hopefully they'll be able to keep it up when things ramp up, I might have to revisit then, but for now it is the perfect place for quick bite and good music"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOGY2dG1RRRAB",
            "text": "The customer service, welcoming and professional staff, clean lines, decor, aesthetic and above all the food, blew me away. Hamilton Heights is blessed indeed with this new addition adding to the growing roster of uptown stars. Highly recommend this buzzworthy restaurant and chill bar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadGJTVmRBEAE",
            "text": "I love the Food, the service and the music, I visited on a Wednesday night. #BlessUpWednesdays Hosted by BabyDoll, its definitely a vibe BarbieTingz beautiful ladies, . The drinks 🍹 mango margarita Is everything the service is excellent and the waitress was attentive the host walked around checking on the guests. I will definitely come back on a Wednesday night"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaFlQemt3RRAB",
            "text": "Wow!! Me encanto ese lugar. La comida muy rica y el servicio y las atenciones. Bless Bar & kitchen es un lugar que recomendaria y no te arrepentiras de tratarlo. Pa comida es un plus. Gracias Daysi por tus atenciones. Always, Sonia and Wanda"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbHMzaHp3RRAB",
            "text": "I love everything in this place, the food, service and decoration. I totally recommend them for any event. The paella is amazing!!! Best one ever."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOGFiWGV3EAE",
            "text": "It was amazing dinner the food was so good and the place have a great costumer service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbzdtall3EAE",
            "text": "Had diner there tonight, it was super quick and fresh.  The good there is made to order. I had the fish sticks and fried rice, which is a perfect combination of food! I was just enough.  There is a special sauce that comes with the fish sticks that will change your life!  I recommend this is you are around 143rd and Bway"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobDZHLTNBRRAB",
            "text": "A guest at my job recommended this restaurant to me. I made reservations for 5 and they accommodated us. The server was nice and attentive. I ordered the calamari, which was seasoned, fresh and delicious. For my entree I had the seafood paella. It was loaded with seafood, nothing was overcooked. I love it and finished the rest at home. For my drink I had the Henny Love. It was sweet and tasty but like most restaurant drinks it was kinda weak. The wait time was kind of long."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkOEp1c2pRRRAB",
            "text": "I went here for my sister birthday, it was actually very nice the food was good and prompt, the service was good. And they were playing some really good music. There was a DJ and a MC and it was kinda fun. They gave my sister a birthday shot out and free shots"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMnRTTTF3RRAB",
            "text": "Honestly I would not recommend if you are big on service. Unprofessional. The gratuity is automatic so you will get the bare minimum. It is a cute little spot. We were the only table seated and I waited over 5 minutes for limes as my server chatted it up with a friend. The servers children were running around tearing stuff apart. They got food before us. No communication whatsoever. No sushi on weekends but they won’t tell you that until you order it. Being ignored in an empty restaurant is just rude. Glad I didn’t spend much, mad I’m not given the option to tip for service. Servers earn money for service, I know because I am one!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMWZPMU1nEAE",
            "text": "So good, and the owner is lovely! I had the Gamba, and tostone fries, friend had the churrasco salad. Also the ginger margarita  was tasty and enormous. Will definitely by back to work my way through the menu. Great addition to Hamilton Heights!! (Constructive criticism - they could be better about getting the check served and handled.)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlOGRYYjNRRRAB",
            "text": "0CT. 11, 2022, I tried BLESS, Sea food Paella. It was DELICIOUS!!!\nFrom the time I walked in, I was warmly greeted! I was massaged with streams of Blues, Jazz, plus!!!I I had to remind myself, to place my order. The Paella , order for 1 person, could easily feed 2! You can listen to the music, watch soccer, baseball, basketball. There were, I believe, plus the sound system. The managers, are SO Engaging & Charming. Wonderful conversations, feeling as if you are home with great friends! You can dance there if you wish. All while enjoying your delicious meal! The Menu leaves you , having CHOOSE, what & how many dishes will you order! I leave you with my wish to all!!! ENJOY!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdnFpWF9RRRAB",
            "text": "Showed up with a party of about 20 consisting of adults and children. Staff was very accommodating the food drinks was vwry tasty t. They have their liquor license still updating their menu. Waitress suggested some options not on the menu. I really enjoyed their hamburger and I don't care for Swisscheese."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbXJPNHZnRRAB",
            "text": "Searching for places to eat in the local area and Bless Bar & Kitchen  popped up. I don’t normally leave reviews but I feel compelled as the food was absolutely exquisite. The ceviche may be the best ceviche I’ve ever had. The staff was so welcoming & inviting including the chef. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwb3JuNGZnEAE",
            "text": "Food was Simply Amazing, While You May Have To Wait..It Was Well Worth It Since Each Meal Is Cooked To Order, Portions Were Nicely Sized, Great Music & Great Vibe! Overall Had A Wonderful Time...Daisy Is Awesome!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldG9yS3J3RRAB",
            "text": "Great place! Delicious food, great service, banging music, big TVs, chill happy vibes all around.\n\nBless bar feels like coming home. We had a great time and will definitely be back. So glad to have such a great place uptown!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1OUozZXZBRRAB",
            "text": "The Aura/Ambiance/Atmosphere- The Food/Service was Absolutely Amazing!!!! This Establishment's Decorative Build Brings Life to A Once Aging Neighborhood. I Definitely Recommend This Place as The Place To Be!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMmRfUnlnRRAB",
            "text": "Very nice place. Great atmosphere. Great music and food. Excellent drinks and hookah. Would definitely come here again. Chill vibes"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleHJQMEJnEAE",
            "text": "An excellent place with amazing food. Paella is a madness ❤️❤️❤️❤️. Amazing service! Congrats"
        }
    ],
    "reviews_count": 74
}