{
    "name": "Tartina",
    "place_id": "ChIJz9tb0FNYwokR_Ge2LeC4E1A",
    "grid": "MN9",
    "address": "1034 Amsterdam Ave, New York, NY 10025, USA",
    "rating": 4.3,
    "user_ratings_total": 435,
    "phone_number": "(646) 590-0577",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Q2FWaERlbVZSUlZWVmNqTlVhRFl0UjJOM1dHYxAB",
            "text": "Love this place. Fortunately, it is local to me. Have been a number of times and highly recommend the branzino. Staff is pleasant, helpful and have truly enjoyed each visit."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaVFVcG5OalkzVUhSYWNtWlZOa1pIUjBOTU0wRRAB",
            "text": "La comida deliciosa y el servicio excelente. Es un poco elevado el precio. Recomiendo este lugar"
        },
        {
            "date": "3주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205ME1tMUdhRGxUUWtKWVRWSXhjMGN0U2tSU2JFRRAB",
            "text": "Adresse sympa, prix abordables. Le plus : les spaghettis dans la meule !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVFQyTjNVekJ4VjFCbFRrOXpPV280T0hNemFrRRAB",
            "text": "Best Salmon Burger with Perfect Fries....And Sparkling Non Alcoholic White wine. Everyone at my table was very pleased. I'm definitely coming back to try the Pasta rolled and tossed in the middle of the Huge cheese circle. 💖😀"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeWN6TjRkazlJWDNoTFdtWjFlbTFYZEZCbVFrRRAB",
            "text": "Enjoyed Saturday brunch with friends. Avocado Toast with Salmon and side salad was well-presented and fresh. Appropriately attentive service, and live jazz trio provided a nice backdrop. Will return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQ2VYTkpabFpGT1ZFd2VrUllUbEZXVUhadFpFRRAB",
            "text": "Not sure about the food, however owners seem very entitled and bullied very talented street musician to stop playing because according to her she was interfering with the “atmosphere” inside and was bothering their musicians instead of just closing the door. Only for that reason will never go there."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRlJYUjJPREE1ZFVkclRFcHlZbG94UTJWWWVVRRAB",
            "text": "Lovely brunch music on Sunday!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORVpESXhZVUpyVUROSFUxTndkVjh3TTFaSWJXYxAB",
            "text": "Super cute and affordable place! Loved the food here!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMFZUVTRhM1pXWVhCU2NtTkJhMjFyUkhONU5HYxAB",
            "text": "We had a beautiful brunch for my daughter’s engagement at Tartina. We had a party of 14 and the ambience was lovely , food was delicious and the servers were attentive. I highly recommend Tartina!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cb05VNUlkVms0YXpReldHWnBTVXhCT1VremVrRRAB",
            "text": "The food around Columbia is always really disappointing this restaurant isn’t an exception. Didn’t taste great"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMFl6Um1abkpSTFRsUFZVazRWM2RVUWpsbFJFRRAB",
            "text": "This place needs a higher rating, I’ve come several times and loved it every time. Amazing drinks, food and service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWU2RXNDJSV1k1U25CSVJqZzVWV1I0V2tsRVJHYxAB",
            "text": "Delicious and authentic Italian food. Fast service and great jazz music. Will definitely return."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKVHI2ZWlWanBmMXlnRRAB",
            "text": "Great atmosphere with live jazz.  Delicious food served with bread and water.  No wait.  Would recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNX0RtLXlWcTVHRjZ3RRAB",
            "text": "Great music Sunday brunch !!!\n\nVery nice service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MDlXdVBBEAE",
            "text": "A hidden gem around Columbia! The Branzino is really decent and they make it in a Fish en Papillote way, also fairly priced, which I’ve never got in most of the Italian places in nyc, highly recommend! The starter bread is fresh. I will come back!\n\nThe dessert is also great, love the pistachio cheese cake."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNk1PLTdnRRAB",
            "text": "Went twice in two days because I was so impressed with the food. The best pasta I have had in Morningside Heights!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNDZ6bXNBRRAB",
            "text": "Been here 3 times now good food nice wine fair service but always so cold it’s not enjoyable.\nEvery time the front door open more cold air on you. They said heat is in full but it doesn’t work very well.  I suggest wait until warm weather to go to this place"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbGRhWW1BRRAB",
            "text": "It was very delicious!! Recommended 100%!!"
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNm9HUTJnRRAB",
            "text": "Par hasard je me suis retrouvée ici le soir de Noël. Ambiance discrete mais très chaleureuse. Le plat de carbonara était magnifique! Le service attentionné et courtois ! Une belle adresse"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdUluTFVBEAE",
            "text": "Excellent food in an attractive ambience with considerate staff. They accommodated us despite our not havng a reservation, fitting us in and not rushing us even so."
        },
        {
            "date": "1년 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaGNPVEF3EAE",
            "text": "这里的意面很好吃！"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYX3VUU1F3EAE",
            "text": "Cozy, great service, wonderful food. Particularly liked the melograno salad, fragola dessert, and piccante cocktail."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYM0lQRWxnRRAB",
            "text": "So impressed with this place! The service, food, quality and cleanliness, all exceptional!\nA must visit for the UWS!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYb1BxdjVBRRAB",
            "text": "Great food and a great location\nThe bartender, Josway was amazing\n🥰🥰😋"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwbXVXNG1nRRAB",
            "text": "Good food and jazz music on sundays lunch"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIOTlENTlnRRAB",
            "text": "Wonderful place with a relaxed, welcoming atmosphere—a rarity in this city! Everything we had was flavorful and delicious, a cut above typical NYC Italian fare. A gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIaGFTa09nEAE",
            "text": "Went for the 3rd time, 1st time for dinner.  Went for brunch twice & the food was great.  Dinner was even better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMXNMZDJBRRAB",
            "text": "Tartina is by far my favorite rest in New York City. Best service, food, music.. EVERYTHING! Just perfect. Can’t wait to be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dDRuSlJ3EAE",
            "text": "Food is alright, ambience is lovely ♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycHRTRVl3EAE",
            "text": "My long term partner and I reunited in the city that never sleeps, the big apple, the empire state, and experienced an outdoor seated array of pasta and juices. Food was not our favorite as pasta was more al dente than hoped with limited sauce and some shredded cheese. The dinner crowd had not rolled in so it was peaceful and the waiter(s) were very nice."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMkxYNTN3RRAB",
            "text": "Update: I can confirm they charged me twice. The transaction posted. And I again would like to say I am very disappointed in the fact that I was not given back my card after I SHOWED them that their original charge had been approved by my credit card company, and instead was charged again (with no effort on their part to actually figure out what THEY did wrong). I’m a student, and I’m not made of money. Being charged twice, totaling an amount of 325 dollars, is unacceptable. Cannot recommend this place.\n\nFood was good and I was ready to decide that I might come back, and then they had “machine issues” and charged my credit card twice. Regardless of whether the charge is dropped, I really disliked that they went ahead and charged me again when I had already showed them the confirmation from my bank, because their system had not registered the transaction. Having eaten at thousands of restaurants all around the world, I can say this has never happened to me.\n\nNot to mention, they added a “manual gratuity” to my bill, when my party was only of 3. I was ready and willing to give more of a tip, but was very taken aback by the fact that it was put on the bill without me being able to choose."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN1A3di1nRRAB",
            "text": "I would’ve given it five stars but as soon as they brought the sizzling hot plates the restaurant stank and I now I I feel we have to go home and change our clothes. It was perfect until then. The vibe was perfect. The food is outstanding, and the service is outstanding but as soon as they brought the sizzle plates out the vibe was dead, and people started leaving. The restaurant was covered in smoke. Such a pity. 5 stars until the sizzle plates."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNU56emF3EAE",
            "text": "Excellent brunch, been here multiple times always a great place for brunch, will be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENnEzSE53EAE",
            "text": "They have some homemade pastas here. The ambiance is excellent and the flavor is delicious. I ordered the Paseo pasta and it was awesome just wish they took the tail off the shrimp."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEX2Z6SERnEAE",
            "text": "The food was great. But we got our food only an hour after we set at the table"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMHZXR2JnEAE",
            "text": "Visited on a Sunday, they had live jazz guitarist and band, very good live music. The food was good but my dish needed salt. Service was satisfactory but It wasn't outstanding."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N083NDdBRRAB",
            "text": "A real treasure. Beautiful interior, great live music  and the food - utterly delightful. Everything we had -the spinach omelet, chicken cutlet and the parmigiana sorrentina was exceeding well done showcasing a care for high quality ingredients and real culinary craftsmanship. The espresso was a true italian espresso too. Lovely service on top of it. Thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNka1AyTXF3RRAB",
            "text": "I went for brunch. The first time at the restaurant. It was full. So best to make reservations.\nI ordered lasagna on a whim. I am very picky about my lasagna. It was absolutely DELICIOUS!! I had to stop myself from eating too much. There was plenty to eat.\nMy husband ordered spaghetti and meatballs and ate it all up.\nMy parents ordered pancakes and \"french\" toast and then shared them. I say \"french\" because it seemed not to be ordinary french toast with some fruit and powdered sugar.\nThe pancakes were two of the fluffiest ones I have ever seen. And my parents had enough to take some home.\nSo, all in all, I DEFINITELY WANT TO GO BACK!\nOh and there was some live music in the corner near the door. A little jazzy.\nIf I were you, I would give this place a try!\nPlus, there were some toddlers with grown-ups and a small dog in the corner.\nAs a first-timer, I will DEFINITELY be a second-timer, if not more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOeVllZE13EAE",
            "text": "Nice atmosphere, good food and great service a must visit in New York 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOMm9pUTh3RRAB",
            "text": "This beautiful restaurant that, happens to be across the road from the Magnificent St John the Divine Cathedral of New York. Is spectacular the food is exceptional. Enjoy 😉."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeExfMC1RRRAB",
            "text": "A very high standing for an affordable price. The seafood pasta were particularly good, but because the portion was rather small I had to subsequently eat a burger, which was more standard but still completely correct. I was so full I came home rolling, thanks Tartina!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeU9yWGtBRRAB",
            "text": "Excellent food and reasonable prices. Lovely atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNWb2N3RBAB",
            "text": "First time at Tartina and we had an enjoyable time. The vegetarian lasagna was very good, the service was on point along with a cozy environment and good drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsMzZ5a05nEAE",
            "text": "We had a wonderful meal here last night. The pear salad and the ravioli were delicious but the best thing we had was the fragola dessert. We had to order a second one it was that good! The tiramisu was also delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbk1HV0t3EAE",
            "text": "Great service..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdUtHY0hnEAE",
            "text": "Tartina is an Upper West Side refuge. It's got a warm, casually elegant atmosphere and superb food and service. I've never had a bad meal here, and the wine list is reliably good. Also, the manager Josue is just lovely. He's professional, accommodating, and kind, and right now, perhaps more than ever, we could all use a little kindness."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aXZuenl3RRAB",
            "text": "Excelente 👌 todo"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1X01TNXFBRRAB",
            "text": "Went here for the happy hour. Even though they have a sign outside, no one working there knew they had a happy hour. I ended up leaving without ordering anything, which worked out cause the food looked unappetizing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1c1BDZ2RBEAE",
            "text": "I had a nice meal - Bronzino w. shrimp / clams / mussels.\nUnfortunately they *don’t support Apple\nPay*.\nI won’t return due to the inconvenience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1aWRqVV9BRRAB",
            "text": "The manager will look at you condescendingly and roll his eyes at you if you decide you just want coffee and desert at the bar"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNnVpX1d3EAE",
            "text": "Excellent food. I had the salmon burger and it was delicious. The lentil soup was hardy. It was a good way to start my dining experience.\n\nIt was a quaint and lovely atmosphere.  The host and waiter were wonderful. There weren't any families with children like other Italian restaurants on the strip. So it is lovely for a nice date.\n\nA well-designed decor made it feel open and cozy. A good place to linger after a meal 😋"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1NS1Ma0lREAE",
            "text": "Food is absolutely delicious. Service is excellent and friendly This italian eatery understands italian pasta and dishes.\nThe portions are favorable and price points are comfortable.\nDrinks are prepared well.\n\nThe evening we had dinner the establishment was empty so I’m not sure what the experience is like when it’s packed but dinner while the restaurant is half empty was actually a delight.\n\nThe music selection could improve but other than that definitely recommend this excellent italian eatery."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOEt6TndBRRAB",
            "text": "My hubby and I had a great time, delicious food and great atmosphere. Loved the Bell’s Two Hearted Ale American IPA draft beer. Our waiter Bryan was the best ever!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMWFIR29nRRAB",
            "text": "Very cozy place. We had really good time and food (especially lava stone steak) was great. Only french fries just okey not perfect. Wines are tasty and service was so kind and fast. See u soon…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKd0xDMGdRRRAB",
            "text": "Most importantly the food was good! The service could be a bit improved imo. We went during brunch time, but when we ordered something from the brunch menu he said we can’t because it’s only available certain days, in a way that was implying that we should’ve known that despite it not saying anywhere. No problem, but he could’ve just said so when telling us to scan the QR code, that it’s not available today. So we had to find something else and wait for him to come back. Also paying the check took a while, cause we couldn’t get his attention. The restaurant was less than half full, so kinda surprising."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJd2UyWktREAE",
            "text": "Stunning restaurant, impeccably service and incredible food with irresistible WOW gasps. Pastas are unique recipes, you would never find anything like that in the city. The octopus is a masterpiece of food artistry.\nThe wine list is one of the kind. Unique italian wines from all over Italy. Ask your servers about pairing and recommendations. They know what's the deal and do wonderful job.\nThe decor is cozy and with very nice taste and touch of rustic and old fashioned fleur."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVME1YQlhREAE",
            "text": "I live in Philadelphia and thought we had great brunch places, but this place supersedes them all. Our server, Alexey, was polite and encouraged us to split entrees as they are family style, and we were thankful that he recommended this.…"
        },
        {
            "date": "5년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzeEtyYkZBEAE",
            "text": "Pour l'endroit et la qualité des plats, les prix restent tout à fait correct... L'ambiance est sympa, jazz live pour le   brunch du dimanche...Un bel endroit avec une touche italienne moderne mais authentique!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMXAzVDNRRRAB",
            "text": "Had brunch there this past Sunday afternoon. And it was a lovely space there was a musician playing Spanish and Italian melodies with his guitar. I had the pancakes, it was so filling. I will definitely go back for dinner."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvcDZHOU93EAE",
            "text": "The food is good. I ordered the chicken leg which was stuffed with spinach and ham, it tasted really good. The price was fair as well, and I loved the atmosphere. There are plenty of wine list on the menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeVo2S2NREAE",
            "text": "Conveniently located near the Columbia campus, great spot for a family dinner or date. Cacio e pepe was fresh and delicious, served in parm wheel. Also enjoyed the veggie lasagna and arancini"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeWN1c1NBEAE",
            "text": "Nice Italian food and gelatos.  They have nice selection of\nWines and mix drinks. Definitely recommend this place."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJeEtYUHJRRRAB",
            "text": "This is a GREAT place! Service is right on point, timely and friendly. Italian done right with a spin. Gnocchi Speck was great, profiterole, tiramisu and creme brule were fabulous. Was with a party of 5 with no issue, just reserve."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHMU5PS2FREAE",
            "text": "I met a group of friends last Saturday  night 11/13/2021  for dinner and the whole experience was amazing. Some of the highlights of our meal were the Rice Balls, the pasta with swordfish and Pistachios.\nThe linguini with seafood in a lemon sauce.\nThe hot stone Steak and the Pistachio encrusted Lamb.\nTo top it all off the Italian Cheese cake and Tiramisu  are worth every bite.\nI will definitely be back"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bmZtS2pnRRAB",
            "text": "Enjoyed a really delicious brunch here! Ambiance is great, service is excellent and food was amazing, would recommend this place if you’re in the area."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbEtQRFp3EAE",
            "text": "The service was great. However the food was a little simple. On the other side, the dessert was AMAZING, it was a tiramisu, I totally recommended."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDN28zOWtRRRAB",
            "text": "I rarely like every dishes being served in a place and this is one of those places. I enjoyed everything. Food were delicious, service was professional and place was clean."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJNEkzS0lnEAE",
            "text": "Delicious! Felt very authentic and had lovely waiting staff who were knowledgeable and recommended great wine! Have the gnocchi or the seafood pasta... delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocGNEOWhnRRAB",
            "text": "I hosted a birthday brunch for 12 people at Tartina this past weekend, and the experience was amazing from start to finish. When I emailed to inquire about a party menu, Maria Teresa called me personally to put the details together, and I got a quote quickly. Tartina had the best prix fixe price of any of the restaurants I reached out to, and being a neighborhood local, I knew the food would be amazing as always. The day of the event, our table was beautifully set (one long banquet for 12 people), and the service was professional and efficient. They put so much food out! For the price per person, I was shocked by the generous portions--it was served family-style, and we couldn't finish everything they put out. It was a gorgeous 3-course spread, and everything was cooked consistently and very well-done. Everything came out hot and fresh; the tables barely had enough room! Everything was truly authentic Italian. My guests raved about the food (the arancini and the pancakes were crowd favorites), and we enjoyed the live jazz music throughout the afternoon. Our table was set up on the \"upper level\" (a short step above the main level of the dining room), which felt like a semi-private experience. I cannot say enough good things about the day, and I will definitely be hosting more events here."
        },
        {
            "date": "2년 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aHB5MUp3EAE",
            "text": "المكان جميل وهادي والأكل الإيطالي لذيذ والخدمة ممتازة 👌🏼😋❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocHBmNW5nRRAB",
            "text": "Pleasantly surprised with the dining experience. Came here with a partner and while the environment was nice, the vibe was kind of off due to the fact that it was 7 on a Saturday and there were only a few parties in the restaurant. Despite this, the staff was nice, and I really enjoyed my lasagna. My partner's dish was a little lack-luster, and I'm not sure this would be the top of my list to try again, but its proximity to Columbia is hard to beat."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLck0yei1BRRAB",
            "text": "We recently were there for brunch and dinner. Each time the food was excellent and the portions large.   Our dinner experience was particularly nice as the restaurant had numerous and varied specials and the service was phenomenal. We will…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMDRTMWZnEAE",
            "text": "The food here is mediocre especially for NYC, but the price point is much lower than other Italian restaurants in the area (although still not inexpensive.) We ordered the gnocchi and it was just okay. It did not seem very fresh; the tomato sauce tasted a little bit sour, as if it had turned. However, it was definitely not inedible, and our server was kind to us during our dinner."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0MnB1LVlREAE",
            "text": "Very good!  Great neighborhood spot that just opened up. Food is excellent!  Service is good. Following this up as it continues to be wonderful.  This is a lovely spot for dinner with friends, a date, celebration, and for a casual meal. We…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1M0xubFJ3EAE",
            "text": "I ordered the Branzino filet and it was absolutely amazing! My service was excellent and my food was fantastic- I'll defined be back."
        }
    ],
    "reviews_count": 75
}