{
    "name": "Patrick's on the Hill",
    "place_id": "ChIJfUS56KH3wokRO-TqEypfUUw",
    "grid": "MN9",
    "address": "1627-1635 Amsterdam Ave, New York, NY 10031, USA",
    "rating": 4.9,
    "user_ratings_total": 41,
    "phone_number": "(646) 682-7243",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dWJ6aFlSRFpKTjBWUllsVlVTR3hCYkVvemQxRRAB",
            "text": "I’ve been to this restaurant twice in the past week, and both visits were excellent! Gissel, our hostess, was friendly, welcoming, and very attentive.\n\nI ordered the oxtails, mac and cheese, and plantains — everything was seasoned to perfection. The oxtails were tender and flavorful, and the baked mac and cheese was delicious. I also tried the Blue Island Splash, which was refreshing and nicely balanced.\n\nGreat food, great service, and a warm atmosphere — I’ll definitely be back again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MGQzUlFUREZpVkcxWlEzTXpiV2Q0WHpKaFlrRRAB",
            "text": "My brother and I were deciding between a couple of options and I pushed for Patrick's since I wanted to support a Caribbean business (we are both born and raised). The vibes was nice and the space was definitely classier than most island joints, there was a jazz band there that was decent and not too loud. My brother warned that the food pictures didn't look too good, but again, I wanted to support someone from the region. The food was just not good. We had the wings appetizer and those were literally old wings that had been re-fried/reheated with sauce slathered on. You could taste in the wings that they were not fresh. I don't know how many days old they were, but they were dry and hard and not moist (IYKYK). I was very disappointed that for $18 we were getting wings that were not fresh. They were also not heated through all the way, they were too cool  for the inside temp for freshly done wings. The wings were also too saucy to try and hide the lack of freshness. The sauces were also too similar. That was the first sign that the food would be worse than going to the hole in the wall place. The mains were ok; again, the texture of the rice and peas was too mushy and everything except for what my brother had was obviously reheated. The bowl was hot but the food was luke warm. My brother wanted dessert with the hopes that it would redeem the place, the bottom of the rum cake was slightly burnt and it took about 15 minutes to bring out a slice of cake. The server was nice and there were several touch points with who I am assuming is the owner, but they were also comically slow. Each round of food took so long to come out for food that was not being freshly prepared. I was hoping this would be the place we could go to for special occasions with the parents and the rest of the family, but this was sadly not it. They were definitely not catering to Caribbean folks with the quality of the food. I will stick to the smaller/ we no have dat places and get not only better tasting food, but more value for my money."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNVUwUlpaR1o2UjBoQ0xUUnFTbVprUzFKQ2JIYxAB",
            "text": "Host/bartender/waiter was very very slow. Food was delicious though"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Q2FYSmZXa2hHTmt4Q1VXbENZVU5IU0U1TVJXYxAB",
            "text": "I went for an evening function and the restroom was nice. The food was really good with great portion sizes! The few criticisms I had were about the washroom, that is an open concept, and the wait time to order, receive and pay. The stew chicken with rice & peas with Brussel sprouts was so delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaVRWY3hURjlXZGs5S1IyTndlRzExVEZCSWNVRRAB",
            "text": "I have to say, I had the trio appetizer, zucchini fries and a taste of rice and peas and roasted Brussel sprouts.   The fried shrimps were not seasoned.  Neither was the Cod Fish cakes.  The chicken wings were tough.  The ginger beer, was not great ginger beer.  I come from a west Indian and nothing was good at this resturant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NWJYbFNkakZUWDJvMUxVNHRWVFZPUmxWSGIwRRAB",
            "text": "The food was delicious and the staff was super friendly and there’s live music on Sunday! Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMU5qaEZjVkZSWldkRFYweDJTRzFQWm5kSE5WRRAB",
            "text": "I thought the portions were generous but taste wise it left a lot to be desired"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V1YzZHJabkJIVjI1RlZqaHVXa05UT1ZaUGMwRRAB",
            "text": "Had an amazing evening at Patrick’s on the hill during restaurant week with the pre-fixe menu. We tried the oxtail, stew chicken and everything was 10/10. Was the best meal I have had in awhile. Service was wonderful and drinks were strong and tasty. Can’t wait to go back and try some more from the menu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxM1dIcG1ia2hrWjBJeWRWTmtSMHRvVmpSdVUxRRAB",
            "text": "AMAZING! Great Jamaican food. The chef is on fire with his array offerings. The Rasta Pasta with salmon was delicious and Mamas Oxtails fell off the bone. The portions were generous and the sides really complement the main courses. The cocktails rocked. The staff was outstanding, friendly, and patient. In the words of the terminator, “I’ll be back.”"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sYU5tbHdRVWx6UzFWS1kyUldkM1ozVEMxYVNHYxAB",
            "text": "Patrick's on the Hill is the best carribean restaurant I've ever patronized"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcFRVVlNXa1F0TUV0alJETndURGN4Tm5Cb1ptYxAB",
            "text": "Great food and service. My husband and I shared the pineapple jerk salmon and oxtails. Both dishes were excellent and I’m picky when it comes to Jamaican food. Our server, bartender, and chef were all really nice, and accommodating. Nice vibe. We’ll definitely return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RlYya3RXRkV5ZDIxUlEzZG9VRzFuWTBoQmRVRRAB",
            "text": "We've been going to the original Patrick's for years, and I'm really impressed with how this swankier location preserves the true neighborhood feel in a stylish but approachable setting.    Food and cocktails were as good as ever and the jazz was outstanding."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweGJrMHhRMjFGWkdJMGRXc3RjVmxEWDBSSVZrRRAB",
            "text": "Fantastic! It was our pleasure to show up here on Saturday and experience delicious food with live Jazz wow.... awesome experience and we will definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVGNsOVVUM2hJY0hkNVVreElhRTV4WmpKeE1IYxAB",
            "text": "The drinks are VERY well made 😊\nHad the wings. A DELICIOUS TREAT!!!  I will be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPVE14ZG5HMk9tVzNRRRAB",
            "text": "Outstanding in every way! We came for Sunday live jazz and it was fabulous. We had the Rasta pasta, which the chef turned in to delicious Vegan option upon request. Also, we inhaled the yummy corn and avocado salad.  We'll be back soon to try the desserts, which look amazing! Family run. Festive. :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLN3VnWkxLOWFqQVRBEAE",
            "text": "Service was great. Food was delicious. Will definitely return.The owner is very personable"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obFlXSnhhVTVoT1dKME5IQm9iWGxHT1Rrek1sRRAB",
            "text": "The chicken and waffles was incredible! Best I’ve had!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLT1VzWVhfN05hS1V3EAE",
            "text": "First time eating the ox tail... Omg it was great"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNmU3ZE53EAE",
            "text": "I will simply say...comfortable,  friendly,  knowledgeable and above all, food quality. The staff and owners went out of their way to welcome me. I will be returning for the Sunday jazz night. Had an awesome experience"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvb3FLc1JREAE",
            "text": "Me encantó la comida totalmente llena de sabores"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMTZ1UXZBRRAB",
            "text": "Nice staff and coffee !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbDZUZ0p3EAE",
            "text": "Food was excellent, music is great, cool, friendly atmosphere... worth giving a visit!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJamItSkZ3EAE",
            "text": "Delicious food, delicious drinks and a fantastic vibe!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdEwzSzdBRRAB",
            "text": "Great place - excellent food and drinks, and very friendly service"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnZzhUczdBRRAB",
            "text": "Patrick's on the Hill is a welcome addition to Amsterdam. Drinks are well made with love and care and so is the food. Had the oxtails which are made to fall off the bone. Wray and nephew rum punch if you know you know.\n\nShout out to Sharita who is definitely the host with the most gracious personality and great sense of humor!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfamRudEFnEAE",
            "text": "Great addition to the neighborhood. It's in the spot where The Grange used to be, a really excellent dining room/bar that's super pleasant. The foods Jamaican now and legit. Really good oxtail and jerk chicken, and the rice and peas and plantains were top tier. The bartender was very cool, checking on the quality of the drinks and rooting for the Knicks. Just a good vibe. No shortage of good Caribbean food up here, but it's a place you can take out of towners and inlaws etc to. Fancyish but not expensive."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcWFDMmRnEAE",
            "text": "Patrick’s on the Hill is amazing! The food, the ambiance, the staff! Sharita was my waitress and bartender, and she was superb! The owner Patrick is present and will check in on patrons. We had a great time listening to the jazz performance on Sunday and eating the food and the mint virgin mojito is excellent! Highly recommend!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeXFpUkZREAE",
            "text": "Jerk and Oxtails are amazing. Great food and service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbk9iOGZBEAE",
            "text": "Is was absolutely awesome felt like home.. nice warm cozy atmosphere..\n🥰🥰would definitely recommend.."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMWNIalRBEAE",
            "text": "We were greeted enthusiastically by Brandon at the door.  Nelly provided quick, cheerful table service.  I enjoyed the bite-sized Jamaica patties with their slightly spicy flavor profile and flaky crust.  We both loved our entrees:  my Brown Stew Chicken and her Pineapple Jerk Chicken were good sized and delicious.  The steamed cabbage & mixed veggie side was wonderful.  The house salad was lightly tossed with a flavorful dressing and she enjoyed the roasted brussel sprouts (2 sides per entree).  Drinks were full pours and moderately priced.  All in all a wonderful experience and we'll be back!  The only reason I gave a 4 star atmosphere rating was it was early and empty! Our bad, not theirs."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQc3FfSElBEAE",
            "text": "The food was really good & reminded me of the food I had in Jamaica. We tried a few happy hour dishes and a couple off the main menu, everything was delicious. The warm bowl was a nice way to try several dishes in one, and the jerk chicken with it was so good. The beef patties were also great & well-seasoned, and the chicken soup was hearty and perfect on a cold night. We also tried the carrot cake that reminded me of the kind my grandma used to make. A great addition to the neighborhood."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaGM2cWRnEAE",
            "text": "Had such a sweet date night here with my husband! We sat at the bar to watch the game and fight. We loved our server. You can also sit at one of the tables for a more date night dinner feel.\n\nWe ordered the Oxtail and Jerk Chicken, both entrees come with two sides. The garlic mash potatoes, mac and cheese, Brussels sprouts and sautéed veggies were so good!\n\nIt recently opened, you should give it a try if authentic amazing Jamaican food sounds good to you. Oh and amazing drinks!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaGJhSjVBRRAB",
            "text": "Oxtail+jerk chicken+rum punch = happiness"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzczZMdk53EAE",
            "text": "Had a fabulous time. I will be back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzN2NYRFVnEAE",
            "text": "This is a great new place in Hamilton Heights! Good food, good vibes, generous portions, excellent staff. The Caribbean pineapple drink (their take on the pina colada) is delicious."
        }
    ],
    "reviews_count": 35
}