{
    "name": "Arts and Crafts Beer Parlor",
    "place_id": "ChIJ_WSvdD72wokROnegxbxj37I",
    "grid": "MN9",
    "address": "1135 Amsterdam Ave, New York, NY 10025, USA",
    "rating": 4.6,
    "user_ratings_total": 483,
    "phone_number": "(917) 675-6835",
    "reviews": [
        {
            "date": "6시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUllqbHNMWGx5UVZCTE5rNVljbXcxYWpVNFdsRRAB",
            "text": "The food was very good and the atmosphere was super chill!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRM00yZEJNM05WYzJWcFJrbFpZak5wYjNSSlptYxAB",
            "text": "Excellent vibes, and great selection of stouts"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBemNGQnRUWEJrU21KWmVXNUxVMVY0TlRSdFJIYxAB",
            "text": "Love this place. Shawarma tacos and a kombucha is magic. Niece had chicken flatbread. Delicious food and lovely team that work here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3dE9VWndVMUpuTTB0amRVbFVkblExTVZKZldtYxAB",
            "text": "Great place to meet up. It can get a bit crowded, but the place has a good vibe. A great staple in the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treGJtNXROV0ZUWWxaZlozWjFjbWhHYVZoNllWRRAB",
            "text": "Need more places like this that make vegan/plant based pub food that you normally wouldn't make at home. Had the BBQ burger myself and it was amazing. My only gripe was the texture of the \"bacon\" was eh, however the flavor was the closest I've ever seen to actual bacon. Came here while while I was travelling through the area, but I'd be here often if I lived closer.\n\nRe: The prior review, how the heck do you get food poisoning off vegan food, and in under 20 minutes? Whether the manager was dismissive or not, I highly, highly doubt this establishment gave that person food poisoning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUGJsUjRXRFpHU1V4clVUTkNOR0ZtV0ZFemJYYxAB",
            "text": "FOOD POISONING (!)\n\nWent here with friends and ordered food (shawarma tacos and cheeseburger) and drinks. The food itself was delicious, so much so that I finished my husband’s burger when he said it didn’t sit right with him. But within 20 minutes, both of us were violently ill. My friends convinced me to alert the manager before we ran out home, not just for us but for the next unsuspecting diners. I began by making it very clear that we were not seeking compensation; just wanting to flag the important issue before we headed out.\n\nHere’s where things went from bad to appalling: The manager proceeded to gaslight me, giving me a bizarre, longer-than-necessary lecture about how “food poisoning takes at least six hours to manifest” (wrong), insinuating I didn’t understand vegan food (I eat Impossible burgers constantly) and was somehow lying because only REAL MEAT can make you sick (also not true, when it was likely bad lettuce or something), and dismissing my concerns entirely. No apology, no acknowledgment, not even a hint of concern that their food had just made TWO people sick. I just left disappointed and very ill.\n\nBottom line: If you want to roll the dice with your health and be condescended to on top of it, this is your spot. Otherwise, steer clear. I will be submitting a formal report in the morning, since they clearly aren’t interested in taking responsibility or basic precautions. All it would have taken was a “sorry.” And to be clear: the food and the drinks were very good, and service was fast and good up to the manager…. so you may have better luck than us."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoV1UyVnhVSGhFY2xZM2FqRktVMkYyZDNFeFVWRRAB",
            "text": "They seem to have a great beer and cider menu but we come here for the fully plant-based menu. They use amazing plant-based \"meat\" and the pub food is truly stellar. The burger is out of this world, the shawarma is phenomenal, and their soft pretzel is heavenly. The  atmosphere is lovely, both inside and in the outdoor seating area. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMlZtVlNSbVpOVjJ4cldFVlZlSGR3YnpGNVpsRRAB",
            "text": "Delicious food and beer with great indoor and outdoor seating at decent prices. Can’t beat it IMO!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nelJuTm9RbnBsYjFwM1gwbFRaVmxYTTJwWkxWRRAB",
            "text": "Could not recommend any higher. Indescribable quality, staff, and cleanliness.\n\nWill absolutely be coming back with my wife and children when I return to the area. Do NOT listen to anyone who gave this place a one star review. They don't know what they are talking about."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSVdtNXNWM0ZKWkZaUlkzQnBaVzVsVFVKaE5HYxAB",
            "text": "Great spot for craft beer. Happy to see so much plant-based pub food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQXzIxSjNYZ3VTejNnRRAB",
            "text": "Excellent highly recommend we had 2 types of tacos beer brat and burger all were delicious should have took pics but we just devoured it all so fast"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQS3RfdUcybnVuc2ZBEAE",
            "text": "quiet pub vibes are hard to find in the US and this place delivers. great beer. fav in the area"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMTDh1Y1N1LU9xTXF3RRAB",
            "text": "Bit loudy and crowdy place, but worth to be visited. They have realy nice taplist, and hey, lot of beers in menu."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMNjBqN2pjb3JIZ3JnRRAB",
            "text": "College bar very chill!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYnpsdVRLenVUa0tREAE",
            "text": "Place has a great vibe.   Hidden Cellar with exposed brick.   Great beer selection,  food was served quickly,  great to look at, and tasted awesome.   Bartender/ waiter couldn't have been nicer.   Chill crowd.  I will be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPeXQ5X21jNGNYT2d3RRAB",
            "text": "Kinda loud for a Tuesday but that kept it feeling alive!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaTR2RHVBRRAB",
            "text": "Amazing beer selection!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJanJXWlVREAE",
            "text": "The best vegan food and beer place in the city! Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdHZiM2Z3EAE",
            "text": "The Korean Barbecue sandwich is delicious!! It is plant based but you would never know- it satisfied this meat eater!! And the owners are the best!! Kind and generous!!! A small town charm in the big city!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdG8ybFd3EAE",
            "text": "Great food from passionate people who created the vegan dining experience they always sought out! Go here, you won’t be disappointed."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcXJiU2xnRRAB",
            "text": "The food was pretty awful but dessert was pretty fire. I'm not a vegan & I have eaten my share of vegan food but everything I ordered, I ended up taking one bite of & ended up throwing away. The bar was pretty cool, very friendly atmosphere & inviting."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaWYzY25RRRAB",
            "text": "Excellent vibe, great place to have an excellent beer and rub elbows with academics."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRd0pYZ01BEAE",
            "text": "Awful service and knowledge around the non alcoholic drink selection. I asked about apple cider only to be told that cider is made with apples. I got a disgusting version of a diluted sparkling drink that’s apple flavored"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQd0xpRHVRRRAB",
            "text": "Scary story\nand bad networking experience"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNmR6aXJRRRAB",
            "text": "Nice beer list and service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNTVtRVJREAE",
            "text": "Excellent craft beer selection, solid IPAs, and fair prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNy1xR1FBEAE",
            "text": "I really liked this corner parlor. A nice quaint basement and street side outdoor tables. Read three papers and the bartender was pleasant to speak with."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNTd1MHFRRRAB",
            "text": "A cool parlor near Columbia University to get a craft beer. Good beer and quick service. The only downfall was it smelled a bit damp and undesirable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuZzd5aUNBEAE",
            "text": "“A Nacho-tastrophe in the Best Way Possible”\n\nIf you’re like me and have a deep emotional relationship with nachos, then you’ll understand the skepticism that filled my soul when I heard the words “vegan chicken nachos.” But folks, I’m here to tell you: those nachos are straight-up wizardry.\n\nFirst off, the vegan chicken? It had me questioning my life decisions, like, have I been eating real chicken all these years or just a vague concept of it? This stuff was next-level. Seasoned with what I can only assume is unicorn dust, and layered over a mountain of crunchy tortilla chips like a golden retriever’s love — endless and comforting.\n\nThen there was the toppings. They didn’t just slap on some sad, watery salsa and call it a day. Oh no. We’re talking avocado/Guac (for a bit extra) on top that tasted like it was picked by angels, jalapeño flavors that hit harder than my therapist’s advice and vegan cheese that actually melted like real cheese — something I was starting to think was a myth.\n\nAnd now… the craft beer. This place takes their beer more seriously than I take my Netflix recommendations. They had a selection that would make even the snobbiest of beer enthusiasts weep into their artisanal hops. I paired my nachos with a hazy IPA “Fidens Vegan IIPA” #8 on the draft list, that was so fresh I’m convinced it still had dreams of becoming a cloud. The flavor was a perfect blend of citrus.\n\nSo, in conclusion: If you’re looking for a meal that’ll make you question reality, taste buds, and whether or not you can be best friends with nachos, look no further. I’ve found my happy place, and it’s covered in vegan chicken and craft beer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuekl1OXJBRRAB",
            "text": "Great place for beers and (non meat) snacks - very cozy, nice folks, and good beer selection."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOElHc1hREAE",
            "text": "The staff at is establishment are awesome. Best beer ever. Come see YAV and you will be in good hands. Food is vegan and the atmosphere is phenomenal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuc05md2FnEAE",
            "text": "I used to love this place. Until tonight. Staff was more interested in talking to each other  than in taking my order. The nachos used to come with lots of vegan chicken. Not anymore. They serve you a big slop of stale tortilla chips with barely any chicken at all. In the past, we’ve stayed till closing and would be able to order more food. Tonight, when I went to order more food at 9:15P, kitchen was closed. No warning. Last couple of times I was here, they were out of buns and tortilla chips. Tonight, they were out of tater tots and customer service was also off the menu."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINVBmNDdRRRAB",
            "text": "Superbe choix de bière de microbrasseries. Nourriture végane excellente. Bel endroit avec un look typique pub."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cnNXNUVREAE",
            "text": "Unfriendly staff"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bExfc01BEAE",
            "text": "콜롬비아대학 구경한 뒤 잠시 쉬고싶어 들렸는데, 분위기나 맛이나 빠지는 것 하나 없는 맥주 펍이었다. 주인아저씨 픽인 20번 OEC Americana는 라거 좋아하시는 분이라면 꼭 드셔보시길… 미국에서 먹은 생맥주 중 가장 맛있었음"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NVBDZ2lRRRAB",
            "text": "Reasonably priced drinks for being on Columbia campus. The pretzel was great, however their jalapeño queso was not my favorite."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXNXBTNUxBEAE",
            "text": "Arts&Crafts Beer Parlor in Manhattan’s lovely Morningside Heights neighborhood is literally one of only a handful of best craft beer bars in all of New York City. If you enjoy really crafty craft beers or just want to explore what Amazing beer is out there, this place is definitely for you!! With that said, they still have wine, hard cider, light lagers, and pilsners for people who don’t want to explore. Further, their 100% plant-based menu is excellent. Arts&Crafts is definitely one of my all-time favorite craft beer bars in New York City."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqX0pIZ0p3EAE",
            "text": "I was amazed with the brisket sliders. My daughter absolutely loved everything. The staff is knowledgeable and helpful. Thank you for your hospitality."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURELWRyblpBEAE",
            "text": "Nice and ample selection of beers. Tasty small bites."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5enRqdDdBRRAB",
            "text": "Twenty-five CB are on tap, predominantly sourced from the East Coast. While the counter seats cater to quieter adults, the tables might be occupied by jubilant birthday groups of children."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aE91NWVREAE",
            "text": "Literally the bartender sold me two beers and didn’t make it clear they were non alcoholic"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURONklIc0xBEAE",
            "text": "A must if you visit or study at Columbia,  great vegan food as well as a huge selection of beer, ale, mead and more.. love the cozy tavern/pub vibes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaHYtd1dBEAE",
            "text": "Love this place! The drink selection is great; the first time I came we got a beer flight with 4 different kinds and this time we got mulled wine. Food is also good, we have gotten the pretzels and tater tots and they were the perfect snack to subside us. Vibes are great, music is awesome, not too crowded and so much space to play a card game or two. Once the football game was over they put Bob Ross on the tv"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxOGZyTEVREAE",
            "text": "agradable lugar demaciado acogedor me encanto sobre todo la vibra del lugar y lo relajado de todo la decoración es elegante y rustico . la cerveza 🍻 muy rica y los tacos 🌮 wow son una pasada probe 3 tipos diferentes y la \"carne\" realmente buena definitivamente volveremos mas seguido"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxOFlyZjBnRRAB",
            "text": "Amazingly tasty tacos and great kombucha"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeGJlZ3JRRRAB",
            "text": "Un clásico post clases en Columbia! La comida es vegetariana y los no vegetarianos difícilmente lo notarían, ¡es muy buena! Sólo le pongo 4 estrellas por la poca variedad, pero 100% vale la pena. ¡La buena onda y el servicio son lo mejor del lugar!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWcmRhQXN3RRAB",
            "text": "This place is a gem of a hole in the wall. Easy to miss because the entrance is sunken off the sidewalk, but the bar itself is absolutely worth a visit. The weekend bartender is a gem of a human, leaves you the right amount of space to chill and drink while being vigilant enough to refill any empty glasses. They have a great beer list, very sizable and accommodating for any preference. Didn’t try their tacos on this first go around but they all sound delicious, highly recommend stopping in for a pint and a chat amongst good company. Check out the cool artwork one of the bartenders makes and sells off the wall too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURseGVIZjdRRRAB",
            "text": "Had a delicious Peach sour beer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsd1ptMHBnRRAB",
            "text": "Really chill spot with great staff and a pretty extensive (and rotating) selection of craft beers. I didn't order off their food menu but will definitely try it next time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsN3FHNnRRRRAB",
            "text": "Some of the best beer selection anywhere on the Upper West Side, excellent relaxed atmosphere"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadUt1Ykd3EAE",
            "text": "Came for Sunday bar trivia as a group of friends in our late 20s (attended during the back to college weekend). Had really good cozy craft beer bar energy. Trivia/bar crowd was fun, not too rowdy. Craft beers had tons of variety, the sours were particularly delicious. Bar also had sangria and ciders as options (no hard alcohol). Prizes for trivia were first and also second place - $30 gift card to the bar and a flight of beers respectively. Overall, great time, great beer. Didn't get any food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdjdXN1lnEAE",
            "text": "Lovely place. Friendly and knowledgeable bartenders. Nice variety of beers. Tasters were $5 each, so a 4-beer flight was $20. The Prairie Tiny Esses Sour was my favorite. The Rotbier (smoked rauchbier) was different/odd."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVMnJySTR3RRAB",
            "text": "Amazing staff... gorgeous food absolutely delightful well-presented, gentle chill atmosphere. Clean Corners relaxing amazing cold AC!! the inside design is actually quite pleasurable everything is sustainable minded and the beers on tap are stunning and rotating constantly.  they also have a large array of bottled and canned Originals!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCczVpallBEAE",
            "text": "Hidden gem near MacDougal Street. It's located below the street level, so easily missed my a lot of people passing by and probably that's why we could find an empty table at 9.30 on Friday night.\n\nGood selection of beers. The online menu has ratings as well pulled from one of the most famous beer app called Untappd.\n\nYou can also take cards or broad games to play there. Tables are quite big so that you can easily play games."
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBeDRhU3p3RRAB",
            "text": "Great local beer pub. I like the selection here - wide variety and tastes are pretty fresh. Staffs are very kind and nice too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdWFLcDBBRRAB",
            "text": "Good selection of brews but prices a little high. Crowd appears to be mostly students from Columbia University which is nearby."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybk1HeXRnRRAB",
            "text": "Has an amazing beer selection and has trivia once a week that is quite fun"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbUp2Q1FBEAE",
            "text": "One of the best curated tap lists in the city sits squarely on the middle of a vast (in nyc terms) desert of good bars."
        },
        {
            "date": "2년 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dThYaFB3EAE",
            "text": "Hele leuke bar met veel verschillende bieren op de tap. Gezellige sfeer en leuk personeel."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLaVBISXBRRRAB",
            "text": "What a great service! Everyone was so nice and knowledgeable about the craft beers, ciders and all they offer.  The food is beyond amazing!!  Best vegan menu I've ever had, every dish was outstanding, yummy and delicious.  I'll go back because I'm craving the food already. 😋 Absolutely cozy and fun fun spot. ❤️❤️❤️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1aDdTbDZnRRAB",
            "text": "I checked out ACBP during Check-in Weekend for Columbia. My kind of place! I plan to visit whenever I'm in the neighborhood, for the next four years at least."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdEllc0F3EAE",
            "text": "Columbia University hang out with a Great beer selection & some vegan selection. Only, expect to wait an hour for your food order. A pretzel should not take an hour to cook. Whatever you do DO NOT order the  pastrami as it is tough as shoe…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROGRuUU1nEAE",
            "text": "Pretzel with beer cheese is litttttt\n\nBeer selection is great, I usually come for lunch and prefer to have cider rather than beer with food, and I’m pretty sure they’ve always had two ciders to choose from. Sometimes the menu isn’t entirely up to date but the bartenders have always had excellent alternative suggestions.\n\nMake a reservation if you want to come after 6pm! It gets CROWDED in the evenings. Lunch/early afternoon is always chill though.\n\nThey switch up the art a lot, which is cool.\n\nBartenders are nice. Bathrooms are clean.\n\nThey have a few vegetarian food options and at least one vegan option. I appreciate that."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBLUluUkl3EAE",
            "text": "Good selection of beer on tap with a friendly staff, at prices that are reasonable for the area. Also, has trivia nights"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRM2RDT1lBEAE",
            "text": "This is a really great place to hang out- unique to the area. The bartenders are very friendly and interesting and I really enjoy the selection of beer and cider. The food is great- I recommend the hot pretzel and any of their pizzas. I've…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcU1xXzJBRRAB",
            "text": "Good ciders but wouldn’t recommend sitting outside unless you want to be targeted by the bouncer repeatedly and be rudely spoken to (not sure why just our table was being watched and why the same rules did not apply to other tables). Yes I…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdGFXeGVBEAE",
            "text": "Lively haunt with low ceilings, energetic student body vibe, and plenty of brews to choose from.  Indoor and outdoor seating.  Got the chips and salsa which was good but I can't comment on the food beyond that."
        }
    ],
    "reviews_count": 67
}