{
    "name": "314 - pizza,pasta&cocktailbar",
    "place_id": "ChIJx1MYBV_3wokRjeYHCXgKrJ8",
    "grid": "MN9",
    "address": "3143 Broadway, New York, NY 10027, USA",
    "rating": 4.7,
    "user_ratings_total": 406,
    "phone_number": "(646) 682-7645",
    "reviews": [
        {
            "date": "수정일: 3주 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNNXI2UGdRRRAB",
            "text": "Io e la mia famiglia siamo in vacanza a New York. Dopo aver fatto una lunga passeggiata in Harlem, abbiamo provato il celebre  Brunch 🍾 super raccomandato! Il cibo é di ottima qualità e l'atmosfera é accogliente. Adatto a famiglie e chi vuole trovare un angolo di Italia anche nella Grande mela! Pizza ottima con opzione senza glutine! Ottimo!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaWMyZEdaR2d4T0drMU9HaDVORkpQVUdkc1ZtYxAB",
            "text": "Best restaurant in the neighborhood by far. Pizza is amazing, food authentic and delicious and I love seating at the bar to try all of their crafted cocktails. Great experience every time"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrNFRqQlhZVFpPWjFSNVFYWTBRa0ppVnpGQ2NtYxAB",
            "text": "Great food, great music, great drinks, friendly staff! Highly recommend."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TE4yWldTbmx4VTAxTlJEZFhVRE5LY21OQ1lYYxAB",
            "text": "One of the worst pizza deliveries ever. Did not come as described at all. Instead what I received was cold, stale, and dry dough with toppings (some of which are missing) thrown on top. Tastes like crap obviously. Packaged with no seal which I’m sure didn’t help. Just pitiful"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNFdIbERaR2RNZUVwQ1ZUSXdjVVJ5WDFoVFlrRRAB",
            "text": "Both orechiette and carbonara very bitter."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWWRUQnJNbGg0T1RFNU0ycE1lR1V3UVhkUmRsRRAB",
            "text": "Great pizza and pasta.  Tiramisu is light and fluffy ( amazing ).  Bartender is one legit dude and wish him the best!\n\nHighly recommend 314!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMElMZTJ3RRAB",
            "text": "This is such a great neighborhood spot  excellent service , welcoming vibes and outstanding neapolitan style pizza, highly recommended!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSmJIZElhVTV3YkVwWUxXSjJaVzAzZW1KaE9XYxAB",
            "text": "Amazing food. And everyone was very friendly...  😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneVExaHljbEJwYVVsdU9XcFdhRkphVHpJNWNWRRAB",
            "text": "Our favorite of many great meals in NYC!  Sitting on the porch was great people watching in a vibrant neighborhood. Lasagna was outstanding as was the margarita pizza."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSmVtdHVibXBIVkdoWVZVOWtSV05RUmpJM1QyYxAB",
            "text": "Had Calamari and Orecchiette with sausage. Perfect. The pasta was amazing, the pesto ricotta mixed with grated cheese, sundried tomatoes, and especially the deep fried mushrooms (a bacon-like flavor) created a well balanced flavor profile which was incredibly delicious! The Calamari was nice and lightly crunchy.  Not very busy on a Sunday lunch, service was great.  (I know the photo looks gross but thats after I made a mess of it!) Its really good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeU5tTTVSWEExY0ZkNk5qRkVUa3RwYVdKellYYxAB",
            "text": "The food was good and unique however the train passes by every 5 minutes and drowns out everything which lowers the atmosphere by 3 points."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMGN6RlRaRXBsYlVOVE4zTldiV3BYT0dWVVpVRRAB",
            "text": "This restaurant provides complete satisfaction. Their staff member explained everything without hovering. The cuisine maintains excellence throughout with good value. All their offerings maintain high quality. Workers gave quality service and meals were fantastic! I'm definitely coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbVIyUnhVVVk1UzNWTE5uSjNVVmxhUWpCeFVrRRAB",
            "text": "I must say 3 1 4 was such a pleasant surprise, I sorta underestimated it.  I came here to grab a cocktail after having some ramen not too far from this location. I must say the cocktails 👌🏽 perfect, amazing, delicious and so well balanced. I enjoy cocktail bars with mixologists that blow your mind away & don’t leave that brick oven pizza out everyone raves about.\n\nThey have live jazz every Wednesday at 7pm ! ✨"
        },
        {
            "date": "수정일: 4달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMXBEMVJ3EAE",
            "text": "La miglior pizza in città!Ho ordinato una 314 e una sweet cheeks ed erano entrambe ottime! Super consigliati anche i cocktails:originali, gustosi e unici!!Posto perfetto per una serata tra amici e in famiglia!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMk1HcExRa3h2WlVscFVuQkZOa0pMVlZwWWRuYxAB",
            "text": "Nice neighborhood place for Italian food. Gluten options available. Many options to choose from including lasagna and pizza."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMX211cmI4cnVDWFpBEAE",
            "text": "Food was very delicious! The staff were also very friendly and overall a great experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQLWctTkdLNnNleURREAE",
            "text": "Very good Neapolitan style pizza!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMlgweEhVR1ZpZWpVNGRXSlZNWFV4Y0ZJeGVWRRAB",
            "text": "Been here 3 days in a row, staff is super friendly, food is amazing (recommend the prosciutto or chicken focaccia bread sandwiches during lunchtime)."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOT2ZwUEhpNnMyVEp3EAE",
            "text": "I was at 314 and ate the spaghetti meatballs. They were amazing ! Pasta cooked perfectly al dente and the sauce really tasty. The cheese platter that I took as starter was also so good.\nMy boyfriend took a salad and a pizza and I got a bite as well. Almost made me regret my choice but, then again, I am a pasta lover so it was all good. A place definitively worth the stop.\nPs: took a cocktail and made me feel like I'm on an Italian terrace"
        },
        {
            "date": "수정일: 4달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdk5pQXhnRRAB",
            "text": "Je suis tombé par hasard et je n’ai pas regretté. La qualité de la nourriture est top, en général je ne bois pas de cocktail mais j’ai trouvé la sélection des cocktails très innovante et pas du tout banale. Je recommande vivement"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKWFJ2b1NvNVBPVmx3RRAB",
            "text": "Loved this place. It has a great ambiance, it is cozy yet lively, perfect for both a date night or a night out with your friends.\n\nFrom the moment we stepped inside to the moment we left—the staff was enthusiastic, friendly, and attentive.\n\nThe food was delicious. We started with the artichokes and the fried Brussels. Both incredibly tasty and flavorful! However, the portion of the artichokes is quite small, we were left wanting more!\n\nThe pizzas were the highlight. We shared the 314 and the columbia pizza. The crust is thin and crispy while the center was soft and full of flavors.\n\nWell worth the price and will be returning to try something new. Add this to your must-visit list!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMU242ZWk2eGJtOUp3EAE",
            "text": "Amazing 😻"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eFUwRm1aVkJGWlhKRFZucFpjMWgxV1ZCdk5VRRAB",
            "text": "I rarely leave reviews, but I felt compelled to share this terrible experience. As a pregnant woman, I’m extremely mindful of what I eat and always check ahead with restaurants to make sure they can accommodate basic dietary needs – especially when it comes to food safety.\n\nUnfortunately, this place showed zero care or flexibility. When I politely asked if certain ingredients could be cooked more thoroughly. I was met with complete indifference and even a bit of attitude. The staff made me feel like I was being difficult just for advocating for my health and my baby’s.\n\nNo effort was made to help me . No empathy. No solutions. Just a shrug and a suggestion to order something else or not eat at all. I left hungry, upset, and honestly shocked by how little regard this place had for something as basic as food safety for pregnant customers.\n\nThis is NOT how you treat people, especially someone who is expecting. If you are pregnant or have any dietary restrictions, I highly recommend avoiding this restaurant. They do not care, and it shows."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKdlYtcUx1bmZydXZBRRAB",
            "text": "I love 314! They have an amazing atmosphere. Staff is extremely hospitable. And the food and drinks are 5/5!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOVB2TEJnEAE",
            "text": "The gnocchi al fungi was 10/10. Very filling and delicious. The pizza was okay, wasn't anything unique or amazing.\nWe went on a weekday so it wasn't crowded. The place is clean and quiet, and the service is great. We didn't like the small table they had us at so the server moved us to a larger table. The cozy and dim vibe would be perfect for date nights."
        },
        {
            "date": "수정일: 6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRLXMyMW9BRRAB",
            "text": "New York, ovviamente, è ricca di locali che professano cucina italiana, ma trovarne di veri è un'impresa ardua. Su consiglio di amici dei proprietari abbiamo scoperto il \"314\" nella magica Harlem! E per non mancare di rispetto alla cultura americana abbiamo voluto provare il piatto per eccellenza italiana rivisitato in veste yankee, spaghetti con polpette...eccezionali! Si respira e si gusta Italia. Bravi! Accolti oltretutto dalla bravissima e giovanissima Silvia che con ottimi consigli sulla città non ci ha fatto mancare nulla. Consigliato a tutti, ai nostalgici italiani in terra lontana ma soprattutto per chiunque voglia gustare una cucina sapiente, in un ambiente ricercato e perché no anche un buon caffè!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvenN5SEZBEAE",
            "text": "pretty good pizza and espresso is Italian"
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLXJHeWl3RRAB",
            "text": "Pizza fantastica, personale cordiale e sempre disponibile. Ad impreziosire tutto, degli ottimi cocktail. Super consigliato!"
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd0phbV9RRRAB",
            "text": "Pizza super buona e italiana per davvero!!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOXZDa1BREAE",
            "text": "My fav place is back!\nTheir pizza is PHENOMENAL. My new favorite is the La Salle! Amazing pasta and all the food is genuine and traditional!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMzk2TDFnRRAB",
            "text": "Fantastic pizza, FANTASTIC cocktails, great service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBc1oyRmVnEAE",
            "text": "Delicious meal experience, recommend their pizza and salad and meatballs"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOF8zWU9REAE",
            "text": "Very good place for Neapolitan-style pizza. We started off with grilled artichoke hearts with lemon vinaigrette & shaved pecorino toscano - a nice antipasto - and then shared two pizzas: the spicy Picca (tomato sauce, fontina, hot sausage, red onions, chillies) and the Norma (tomato sauce, fried eggplant, ricotta, pecorino, garlic & basil).\n\nBoth were really good - with soft, pillowy, lightly-charred Neapolitan-style crust - but the zesty Picca had the edge (the Norma was slightly bland / under seasoned).\n\nNice service and a convivial, mellow vibe."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2djlPN0h3EAE",
            "text": "Great food & atmosphere, super friendly staff."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eUxtRnN3RRAB",
            "text": "Really fun place to hang out with a group. They often have local artist bands. Once, the lead singer changed the lyrics to reach home safe when we were leaving:) Orecchiette Pasta and Aranchini were absolutely awesome, and the next level dishes. Would highly recommend to anyone around the locality to try it for the first time they visit. The service is quick and nice for both indoor and outdoor."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LTRHVG1RRRAB",
            "text": "Hands down our favorite local dinner spot! Also great for lunch too. The food is consistently delicious and staff are warm and caring— we are super regulars and have been coming for years. Highly recommend 314!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQLXJTa3JBRRAB",
            "text": "This is a lovely intimate restaurant. We are all so familiar with Italian food in that it can be hard to standout. Yet, they do."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM2J6NnhBRRAB",
            "text": "Yummy pizza, good price. Dough is really good especially if you dine in. Ordered the Bari pizza and will totally recommend. MSM students get 10% discount! Gnocchi specials was very soft and tasty too.\n\nLove their cocktail illustrations in their menu!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzLWFHR3pnRRAB",
            "text": "Terrible experience, short menu with questionable italian dishes. For starters almost all dishes included feta cheese… excuse me? Was it an Italian or a Greek restaurant again? And a pinapple salad? What kind of italian dish is this? Continuing with the main dishes, there were 4 types of pasta and we ordered the rigatoni alla vodka, the only good part was that the pasta was al dente but the sauce was probably from the supermarket. So as the options were’t great we decided to go with an off menu dish as well: lobster ravioli… let me just say that my cat’s kibble might taste better, and is less expensive… Moving onto the service: slow and unattentive, and the place itself was too loud in the inside and also the terrace is noisy when a train passes by (every 3-4 minutes)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdEl5cDZBRRAB",
            "text": "Great neighborhood spot for pizza.\nTried it many times and my family loves it.\nFriendly staffs and good Atmosphere with a real pizza oven. Very delicious dough."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbUp5Y01nEAE",
            "text": "One of the best pizza places in New York.\nHighly recommend"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzXzk2dHVRRRAB",
            "text": "Nice food and service. Place is a little loud next to the subway."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbDUtWXNnRRAB",
            "text": "Best lasagna ever. It tasted like  grandma's 😋"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeGNfNXBRRRAB",
            "text": "Fantastic 🍕"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0eW8zZFRnEAE",
            "text": "This is a perfect little Italian date night spot! Totally a hidden gem in Morningside Heighs, it’s literally 16 minutes uptown on the 1 train and is serving up very high quality wood fire oven pizza and several legit pasta dishes! 🍝\n\nYou can seriously taste the difference of a wood fire oven pizza versus not and their dough is homemade, light and airy. And they even have gluten free options. Dinner at the bar is also an option, their drink menu is kinda wild.\n\nHere were some menu highlights:\n\n🍕 Columbia Pie: Vodka sauce, mozzarella, grana, double basil pesto\n🍝 Gemelli: Fresh pasta with shrimp, tomato sauce, burrata, spicy peppers, spinach\n🍄 Orecchiette: Broccoli rabe and ricotta pesto, sundried tomatoes, pecorino, fried mushrooms\n🥃 Trick or Treat: Rye whiskey with cinnamon, Campari, honey, and Nardini Amaro"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bHBfVkZREAE",
            "text": "314 is far more than the area code for St. Louis. This restaurant has great service and food. When ordering online, they have called to ask about acceptability of their preparation techniques as it applies to food allergies. Food ready at the promised time. Yummy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPcEthbEd3EAE",
            "text": "Pizza was excellent and the staff were very friendly and accommodating. Atmosphere was also very nice. It’s a tight seating arrangement and no air conditioning. I wasn’t too crazy about the baked clams appetizer. Not a lot of flavor and some sand. I was expecting more like clams casino and these were definitely not."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiamRMMlhREAE",
            "text": "Ottima esperienza, un angolo d’Italia in quel di New York, personale giovane squisito gentile e solare, ma soprattutto cibo buonissimo. Siamo stati accolti da un buon drink del Bartender Bruno.\nSe siete in zona, provatelo!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcFlpSDNRRRAB",
            "text": "The place is very nice for all kind of occasions.  But the food!!! The food is AMAZING! We have pizza Babba OMG it will blow your mind, brick oven definitely make the difference.\n\nWe had so many plates… frutti di mare, arancini, burrata, pasta and porchetta!! delizioso!! Delicious. Tks chef.\n\nWine recommend it by a lovely waitress: Super Toscana. Tks Roberta, So on point!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaUtXT3R3RRAB",
            "text": "Nice little restaurant. My partner and I went here for lunch on a rainy afternoon. We ordered the 12” Columbia pizza (delectable!) and the Brussels sprout starter (also quite good). A nice place to dine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdzdDVHVRRRAB",
            "text": "We haven't been to the place but we peeped at their menu online and their menu had us wanting to try their pizza so we had it delivered. The margarita pizza was beautifully done made with a tomato sauce base, mozzarella cheese, and fresh basil leaves. The mozzarella cheese was gooey, and overall a fresh margarita pie! We can't imagine what their other pizzas must taste like."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5NXE2NHJnRRAB",
            "text": "Haven't dined in yet, but so far this is our favorite place to order pizza in the neighborhood.  Our favorites are the Chicken Parm and Margherita pizza. I'm a simple pizza type of person. Only wish there was more sauce on the pizza. Very dependable place for us so far."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdktLNy1RRRAB",
            "text": "Excellent pizza and great endive salad.  Had it delivered and still tasted great.  Looking forward to dining in at some point."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtajgzaXp3RRAB",
            "text": "The best Italian food in town. From the starters till the desserts! And their cocktails is just WOW! My fav dish is the fried artichokes with lemon: very simple but so tasty!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bWNMdHZBRRAB",
            "text": "I can’t count how many times I’ve driven by this restaurant without noticing it. Finally, last week, a friend introduced me to one of the best-kept secrets of the Upper West Side. I started with an appetizer of focaccia, mortadella, Castelvetrano olives, and stracciatella, which was excellent. I would definitely return for the outstanding cauliflower steak and busiate. The experience at the bar was also great—friendly staff and clientele, likely connected with Columbia University. The wine selection is very good, with reasonable prices. This place is now at the top of my favorites in NYC."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlN2RLQktBEAE",
            "text": "I went here with my husband and some friends, Lorenzo and his stuff were very friendly and best quality price!!! We got pizza and bucatini pasta plus tiramisù desert!!!! 🇮🇹🇮🇹🇮🇹 You must step by!!! ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cmNpdkhnEAE",
            "text": "We order some appetizers and pizzas. The food is really tasty. The service was friendly and the place is cute. Also they have an open space outside."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdk1fRklREAE",
            "text": "Had one of the best nights of the year here! Amazing cocktails and a great bartender who /diagnosed/ us with drink recommendations that were all perfect! Some of the best Italian food I’ve eaten in a while, perfect for sharing and eating individually. Great ambience without seeming forced. Staff all lovely. I’ve already been back once again and hope for many more amazing nights here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScXJUX253RRAB",
            "text": "This is a cool looking place, with great vibes. The staff is friendly, very helpful and respectful.  My drink was yummy and strong, and the food was delicious."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURreV9ERklnEAE",
            "text": "First impressions were good the server was nice the place looks very cozy modern and a little swank in a good way the food on the other hand definitely needs some work my fiancé and I both order the chicken parm which was extremely bland no…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoejZhelVREAE",
            "text": "I am very picky on Pizza and rarely order Pizza. But 314 ‘s Pizza is the best! I never thought I would like Pizza until I tasted here! So good food and service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MnQ2Q1lnEAE",
            "text": "Stumbled upon Bar314 last night, and it was an absolute delight! From the moment we walked in, the cozy atmosphere and friendly staff made me feel right at home. The dim lighting, chic decor, and relaxed vibe create the perfect setting for a casual night out with friends or a laid-back date night.\n\nNow, let’s talk about the pizza! Easily some of the best I’ve had in NYC, and that’s saying something! Perfectly thin, crispy crust with just the right amount of char, topped with fresh, flavorful ingredients. Every bite was a reminder of why pizza is a true art form, and Bar314’s take on it is nothing short of masterful.\n\nPair that with their impressive wine list, and you’re in for a real treat. The selection is carefully curated, offering something for every palate, whether you’re a wine connoisseur or just looking for the perfect glass to complement your meal. I was thrilled with the bottle our server recommended—it paired beautifully with the pizza and elevated the entire dining experience.\n\nOverall, Bar314 has everything you could want in a bar—great drinks, possibly the best pizza in the city, and a warm, welcoming atmosphere. Whether you’re looking for a spot to unwind after work or a new place to become a regular, Bar314 is worth checking out. I’ll definitely be back soon!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDaDg2azBRRRAB",
            "text": "314 Pizza,Pasta&WineBar is my happy place. The pizza is terrific and every time I spend at least 20 minutes debating about which pizza I should get. I am usually a fan of red pies but the sweet cheeks (in the pic) conquered my heart. The…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScGM3LUNBEAE",
            "text": "I recommend the 314 pie and gemelli pasta. We two pork ate about $50 for lunch. However, not worth coming here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqaEktUS1BRRAB",
            "text": "The 314 pizza is very good & was the only thing worth its price on the menu. They tax you on mid appetizers which they’re also very stingy with- 10 dollars for a little bowl of fries"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ajRTZVVBEAE",
            "text": "Fantastic service, food, drinks, and atmosphere! Great patio and something on the menu for everyone! Put it on your list."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieC0zVS1RRRAB",
            "text": "First time trying here and ordered a $34 pizza and it was, um BURNT.  Doesn't say much for the quality of this restaurant.  I want my money back!!!!  This is $34 taken from my family."
        }
    ],
    "reviews_count": 67
}