{
    "name": "Marlow Bistro",
    "place_id": "ChIJtSHevTz2wokR1jY59paKMww",
    "grid": "MN9",
    "address": "1018 Amsterdam Ave, New York, NY 10025, USA",
    "rating": 4.5,
    "user_ratings_total": 989,
    "phone_number": "(212) 662-9020",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSFJWcE9aM0ZUV0ZodWNISmFUbWhLVkZocGRGRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ 5/5 — A Hidden Gem Nestled on Amsterdam Avenue: Marlow Bistro\n\nMarlow Bistro is the kind of place that reminds you why dining in New York City is so special. Nestled along Amsterdam Avenue, this charming neighborhood spot delivers a dining experience that feels both elevated and comforting from the moment you walk in.\n\nWe started with the Autumn Soup, an apple rutabaga soup served with toasted brioche and pomegranate. It struck the perfect balance of sweet and savory, beautifully layered and full of fall flavor.\n\nNext, the Cappellacci Ai Funghi was absolutely spectacular, filled with shiitake and white mushrooms, tossed in a luscious truffle butter, and topped with Parmesan cheese. Every bite was rich, earthy, and perfectly crafted. Honestly, if I had more room, I would have ordered a second serving, it was that good.\n\nThe Burger was equally impressive, juicy and perfectly cooked, topped with bacon onion jam and Gorgonzola, all tucked into a soft brioche bun. The side of shoestring potatoes was crisp, golden, and addictive, the ideal complement.\n\nWe also enjoyed the Margherita, mozzarella, cherry tomato, and basil on a thin, flavorful crust. A timeless classic done flawlessly.\n\nTo drink, the Green Giant was the perfect refreshment, Seedlip Garden 108, soda, cucumber, and mint, light, crisp, and aromatic, beautifully complementing every dish.\n\nEvery element of our meal at Marlow Bistro reflected care, creativity, and genuine warmth. The service was attentive without being intrusive, and the cozy atmosphere made for a relaxed, memorable evening.\n\nIf you’re looking for a true neighborhood gem that celebrates seasonal ingredients and thoughtful flavors, Marlow Bistro on Amsterdam Avenue deserves a spot at the very top of your list."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcU9FdGZVMHQ1TFVJMWNtRndUalI1V0c4ME9YYxAB",
            "text": "Super tasty and very intimate setting which was perfect for me and my dad. Jelena and Antonio were great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWlF6WlVRbVJGTVhoQ1dtMXhSa2xCV0VkNVZsRRAB",
            "text": "Servers Jelena and Antonio were great!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcWVmRDRRRRAB",
            "text": "Great wine and great service From Jelena and Antonio"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWWJVbFpkSEJ3U3pCQ1MxQlZZVzVWZVROelkyYxAB",
            "text": "Delightful happy hour and great restaurant! Beautiful and comfortable atmosphere. And excellent service from Jelena and Antonio. One request- can you add one non-alcoholic cocktail to the happy hour menu? ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abFVtcERXamhQVVZkcU1tRkViSGR1WjFoSFRIYxAB",
            "text": "Literally incredible. Went here with my best friend for happy hour. The drinks&food were delicious and Jelena and Antonio are so kind & friendly. ☺️☺️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRlRFSm9Reko0TlZWcFozZEhXR1ZMUlZObmQwRRAB",
            "text": "So lovely and cute ! The outside patio is to die for and our servers Helena and Antonio were so nice!!! I will be coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMlZqVnNlakJoYVVjM2JGSk9VSFJxUTA5UVFuYxAB",
            "text": "One of my favorite dinners that I’ve had in the city. The food is amazing, all of the flavors mesh together in a new and wonderful way. Highly recommend the tuna tartare and lamb pizza! Jelena and Antonio were great - warm and attentive, always making sure we were set and the food was good. And the environment of the restaurant tied it all together with great lighting and low music so that people could still talk. Will definitely be bringing friends and family back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNFFVWmFTMkZQZWxadVFXRTFUSE5WVUVWU05WRRAB",
            "text": "Great food and service. Jelena and Antonio were fantastic."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKeVRGazVVM1pxVlMxWGFuRXdTMk5pYTIxbldtYxAB",
            "text": "Delicious and very attentive service from Jelena and Antonio"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRk4xRkhNVkYwZG1aUVYxRm9jRTFpYlRSdFJrRRAB",
            "text": "Great good. Jelena & Antonio were excellent servers"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MlRtWkJRMW94U0VkU1pUSnZVVlJ6YVd0UE5FRRAB",
            "text": "Jelena and Antonio are great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnM04zVnFaMHBoTld0VFZtNW5VMVoxUVdvelpuYxAB",
            "text": "Have been coming here for a while and it’s better everytime! Jelena and Antonio have been our servers a couple of times and they are always super attentive and sweet! If you’re ever around Columbia/Morningside Heights give this place a visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeVJVaFFXV3hIVmxVdFZVUnRUbXhWUzJsT1NVRRAB",
            "text": "Good pizza and quick service! Jelena & Antonio were great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5U04xZHZXVVU0TUdwVkxXZG5iV3RrVVdOWk5sRRAB",
            "text": "Lovely dinner fantastic staff served us Al fresco on Wednesday night; pizza, salad Amperol! We will be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UFQwcHliREpzYm1oQ1kwTm9iMFppUXkxd1owRRAB",
            "text": "Wonderful experience at Happy Hour! Great drinks and the service from Jelena and Antonio was exceptional."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTldWQTVTR3BCV21ad2JWQTBhbmxOU0c1UVJGRRAB",
            "text": "Jelena and Antonio were lovely - great food great atmosphere!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OblYzWjRPWEp2Y1d0TU4xUmxjVUZYWWt3MFNrRRAB",
            "text": "I absolutely love this restaurant, especially Jelena and Antonio. Service was spectacular and they were so kind. Food is fantastic"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRmIyaEZXSFJRVTNneFZYcHdPSGxyYW5kMVNXYxAB",
            "text": "Been here for 3 times in past two months, at brunch time, happy hours and dinner and all the experiences here was great! The dining areas, interior and outside are all decorated with beautiful plants and flowers, the food is reasonably priced. The staff Jelena and Antonio were nice and friendly, definitely will make Marlow a togo spot around Columbia."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbVMyTkJXRkpwYW1KNmFEY3pOVFJWZEdSd1IyYxAB",
            "text": "I had such a great time at Marlow Bistro. The atmosphere was cozy and welcoming, and it really felt like the perfect spot to relax and enjoy a meal. The service stood out — Jelena and Antoniio were both incredibly friendly and attentive, which made the experience even better. I ordered the Margherita pizza and it was fantastic: fresh ingredients, a nice balance of flavors, and just the right texture. Overall, it’s a place with great vibes, excellent service, and delicious food. I’ll definitely be coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRWJFOUdORXhTU1V4b1VWaDBMV3RvVW5sMVgzYxAB",
            "text": "A cute spot with a great interior and nice atmosphere for outdoor seating, my go to spot for a quick drink or bite to eat with friends! Jelena and Antonio are both very welcoming, charming, and attentive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnd1YyVTVXRVpWU0VSU0xVUm5TMHRMYUVwTlJWRRAB",
            "text": "Jelena & antonio were great! They were so attentive and the service was amazing! Would definitely come back and have them as my severs. :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRFZtWnBhRVZuU0ZrM1VrRjJMVlpqYzNkeVZWRRAB",
            "text": "This place is a big disappointment. We loved it for so long but honestly there was a big drop in quality. It is now expensive and the food is meh. You should pass."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWVNtRmZOakJEWmxsUU4wUjBlRnBNTUc1Wk1YYxAB",
            "text": "AWFUL. food was way undercooked and overpriced. \" Caesar salad\" was just a pile of wilted lettuce drowned in a bottle of sauce. SERVICE TOOK 2 HOURS. HORRIBLE"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWFUwSlhOa0pzTFRCTmFqVTFkRXBOTlRGaU1HYxAB",
            "text": "Really bad! Way overpriced. Tiny portions - a handful of romaine with crumbled crackers on top is a $23 Caesar Salad? $28 for a below average hamburger?  Brunch menu was very limited and service was SLOW: even though the restaurant was half empty, it took an hour to get our food. Had to send back steak because it was raw. Food was tasteless and so expensive. Save your belly space for a better restaurant. Would not recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R04yRkJTMjVmTXpZd1MwTnpVRFZMUkRaMVdYYxAB",
            "text": "Fabulous ambiance with food paired with great service. What a gem!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNd1IzSmFjMDk0TTFsUldGOWtWRkYwZFY5TVkwRRAB",
            "text": "Jelena and antonio were very iind and helpful"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMFFtSkxVa1ZSVW1OSWRWOURPREp4UzFCNmVrRRAB",
            "text": "Cute place! Appreciate the service by Jelena and Antonio :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORVoxcDJUa0pMWTNGaVdHeFlYMFJJZVVwYVpuYxAB",
            "text": "Great bites and atmosphere! Staff Jelena and Antonio are delightful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSFJ6TlVWM1JWZHpaSlQzVnJWMWR5UlhseU9XYxAB",
            "text": "We had a vey enjoyable dinner. Loved the scallops/sausage/gnocchi dish.\nJelena and Antonio took excellent care of us!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVWJGRkJkMkZDZUVNNGFUWXlVMGc0WXkxSWVtYxAB",
            "text": "Antonio and Jelena gave us a delicious meal, taking very good care of us! A wonderful evening!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNM1NFNHhiV1pQZDJzeFRFbDNNWEU0YlVSUE5rRRAB",
            "text": "This is the most amazing food I’ve ever had in NEW YORK CITY! I have lived here my whole life and have never had food this good! From the cauliflower, to the pizza, to the penne alla vodka. I loved our server Jelena & Antonio. They were so attentive and the hostess was the sweetest. 10/10 restaurant. I will take and share with everyone."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeVFXMVZka1ZWVWtKMWMxWkNabXczVG1Kc1VXYxAB",
            "text": "Great meal with awesome outdoor seating. Jelena and Antonio were fantastic"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaMWQzSk9hRGhVZGpRemRXbFhSRFZrWlhKbFpFRRAB",
            "text": "I have been coming here for a couple of years (since I moved to the area) and cannot recommend it enough! Great bites any time of the day. The restaurant has a beautiful view of St. John Cathedral — bonus points if the weather is nice enough to eat outside!\n\nWhen you go, ask for Jelena and Antonio — 11/10 will be coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toQmRHUm1ZbEpsY0V4V1JscElWRkpyTUU1bWFIYxAB",
            "text": "The food &drink was very nice. Our service from Jelena and Antonio was very good! Definitely would recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214M1JHZHFOV1JZWnpKTk5teHdjSFpSZFRGb2IwRRAB",
            "text": "Had a delicious meal! Jelena & Antonio are the best!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkZmVWaGZhVXR6WDAxb04wTjBhSFEyYWtoWE4wRRAB",
            "text": "Jelena & Antonio are the best! Great vibes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWlQzSTVZbFpZYkRoWlgxSkpiVjlzT0dzMGNIYxAB",
            "text": "We had such a nice evening. Jelena and Antonio provided amazing service and were so sweet:)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SWIxSkhjRVkwZEU5MVVXVnFMVVl3YzFKV1YwRRAB",
            "text": "Jelena and Antonio were superb servers! They were both so attentive and provided excellent customer service throughout our entire meal. The cauliflower was perfection but honestly everything we ordered : fries, pizza and artichokes were incredible. The Aperol Spritz drinks were the icing on the cake. Thank you making our girls dinner the highlight of our week. We will be back! Cheers!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toQlRVNHdRbFJYYXpoNFEyWlFWRzVIU2tRMmMwRRAB",
            "text": "Jelena and Antonio were fantastic! So kind, punctual, and accommodating. I have zero critiques. Such an amazing experience & I can’t wait to return. Order the cauliflower, there’s nothing like it! If you want the perfect Aperol Spritz, run here!! Thank you again, Jelena & Antonio for the perfect late summer afternoon on the patio! 🧡🧡"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VE0ydDJNVkJMWWxsQlFrSTFMWGhPV2xkdGRtYxAB",
            "text": "We stumbled upon this place while looking for a place to eat near Columbia campus. We had a pre fix meal 3 courses just $45. Excellent food amazing price. Service also excellent, Jelena and Antonio were so nice and attentive, couldn’t ask more. Location and ambiance perfect settings, corner of 110th st, very pleasant to eat out on a nice day or anyday. If you’re in the Morningside area, definitely check this restaurant out you won’t be disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neldEVXRXR0oxVG5SRFVHeE9Rek5rTWw5R01FRRAB",
            "text": "We had a great experience with Jelena and Antonio!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZME1qYzJNMEl5VldONk5GWmhOekZLZFVsRlJXYxAB",
            "text": "Jelena and Antonio were gracious and helpful from beginning to end.  The food surely met our ecxpectations, and the service was outstanding.  Kudos also to whoever made the playlist!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVd1puTlpOakUyZDBSd04zQllUVmR0TjAxb2JFRRAB",
            "text": "Very relaxing outdoor atmosphere - great for happy hour! Jelena and Antonio were especially friendly and helpful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSFVtcERNMUJCWlVGeWNqTjNUV1ZCUm1ndE0zYxAB",
            "text": "Jelena and Antonio did an amazing job! Had a great time at a late summer NYC happy hour"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTFkxQjBXVkU1VTJad2FXY3ROMDV5WkZOWmJrRRAB",
            "text": "Best hosts Jelena & Antonio"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkalJrRkpWMVU1TnpObVdtTllRV3MyUkc5a1NGRRAB",
            "text": "Very nice experience! Jelena and Antonio really made us feel like at home🥹🥹 Look forward to next meal here~"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoak4xZFJkRWszT1hsMFRXVlVOVzVRT1dwa1FXYxAB",
            "text": "Excellent meals, super warmhearted service, nice environment. Definitely will come back again.\nReally appreciate Jelena and Antonio🥰🥰"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabVdUVlNZMDV6ZDI4MFYzVnhPVXhYWTNGWVgxRRAB",
            "text": "Good experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNWIxaG5MVTVVVkZCM1VVTlZYell5TW14RVozYxAB",
            "text": "I made a reservation for one and arrived on time. There was no waiting in being led to my table. The bistro was quiet at that time on a Friday, right before 7 pm.\nSoon after that, it got very busy.\nThe atmosphere was most welcoming and the staff friendly and professional.\nI loved the decor, somehow wintery, but warm and romantic. I also loved that so many of the tables are close to the big windows, thus you can enjoy the view to the cathedral outside and all the beautiful vibes of Amsterdam avenue.\nThere is plenty of sitting outside, but I didn’t like the idea of the noise from cars and pedestrians for my dinner this time. Thus, sitting in the warm interior atmosphere was an excellent choice.\nI had a huge meal, and everything I tasted was a very good portion and very nicely cooked. The cauliflower as a starter was delicious but then my mushroom tortellini and my tiramisu didn’t disappoint either. Actually, the tiramisu in particular was almost as good as the one my Neapolitan husband makes! :-)\nI accompanied my starter with a nicely prepared Spritz (which I believe could have been a bit stronger; a bit less ice in it) and enjoyed a strong and flavourful Montepulciano red wine glass at the end of my enormous meal.\nIn all parts, I was served at an excellent pace, and it seemed as if the same was the case for other tables surrounding me, whether with small or larger groups.\nI would strongly recommend Marlow Bistro, a beautiful spot in the area."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVWJsQlJiRzE0Tm1WVlgwaHllRXQxTUd4blpYYxAB",
            "text": "I have been coming here for years. When my oldest, who now lives across the street, graduated college, we came here for brunch. Since then (2020), we have met here for many family dinners. In fact, we are here tonight celebrating my other son’s bday. A few months ago, I had a less than amazing experience. Had nothing to do with the food, which is delicious always. But I have to say, Jelena turned that all around. She’s probably the nicest/warmest server I’ve had here, in all these years. Antonio, too, was great. Tonight we started with the tuna tartar, which I recommend. Followed by the cauliflower dish, the gnocchi, the burger, and the beef fillets. Which we also recommend. The gnocchi is different from the last time I was here—I like the seasonal update. I started this all with the first crush [drink], and am still here about to have an espresso with our dessert…gluten free chocolate cake, and carrot cake. This has been a wonderful experience. The windows are all open, the fan is on, great music, the place is full, everyone seems happy, and the [separate] bar area is hopping xx"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVVVIaGxUa1ZtUjBWV1dESllhVnBhZVhWU01WRRAB",
            "text": "Marlow Bistro offers a delicious happy hour menu, with friendly service in a delightful atmosphere that feels like a beautifully decorated oasis. The food is vibrant and fresh, a stellar example of how plant based offerings can be exquisite and full of flavor. Jelena was my server, and she exuded the best customer service, alongside Antonio. I'll definitely be coming back for more! A new favorite."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMU5tdEJRekkwVldObk0xTjFXRFJQTkdKbFgzYxAB",
            "text": "Review for Marlow Bistro – Amazing Experience!\n\nMy friend and I visited Marlow Bistro during NYC Restaurant Week, and everything about our dinner was outstanding—from the food to the ambiance to the exceptional service.\n\nThe menu offered a fantastic variety, and every dish we tried was fresh and flavorful. We shared the Little Gem Salad and Cauliflower appetizers, followed by the Cappellacci Ai Funghi pasta and Margherita pizza. Each bite was delicious, and we ended the meal with a rich and creamy Tiramisu. During happy hour, we also enjoyed a couple of refreshing Aperol Spritzes, which were the perfect complement to the meal.\n\nWhat truly made the evening special was the outstanding service provided by Jelena and Jean Paul. Jelena was our main server, and she was incredibly welcoming, kind, and attentive throughout our visit. She never made us feel rushed, and her upbeat energy added to the warm, inviting atmosphere. Jean Paul was equally helpful, making sure our experience was seamless. Together, they created a relaxed and enjoyable dining environment that made us feel well cared for.\n\nThe restaurant itself is beautiful stunning flower arrangements hanging from the ceiling—perfect for a cozy and elegant dinner setting.\n\nBetween the exceptional service, delicious food, and lovely ambiance, I highly recommend Marlow Bistro—and I especially want to thank Jelena and Jean Paul for making our visit so wonderful. They absolutely deserve recognition for their hard work and hospitality!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxd2EwaE1WVzAwWldWalVUYzRXVTVvUm1WaGQyYxAB",
            "text": "Excellent service paired with delicious food and well-crafted cocktails. The staff was friendly and attentive throughout. If you’re in the area, this spot is a must-visit. There’s plenty of seating both indoors and outdoors, making it perfect for any occasion."
        },
        {
            "date": "5달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVEhzdENwNmJuNFFBEAE",
            "text": "Bellissimo ristorante, personale gentile, cibo buono e genuino. Molto bello sedersi fuori in primavera e ammirare la vista. 100% recommended!\n\nSiamo andati il giorno della festa della mamma e regalavano una rosa a ogni tavolo, molto dolci."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdGVmMUlBEAE",
            "text": "Came here for brunch on Thursday & absolutely loved it. Such a serene spot, beautifully decorated, calming vibe, & great service. My server was Mirko & he was excellent, very attentive & gave me great recommendations. I was in the mood for something light so I had the beet hummus & Salmon from their brunch menu. The beet hummus has a strong flavor but comes with a house made flatbread that compliments it well. This picture is not how it came but what it looked like after I had already dug in. I would say it’s more of a shareable portion than a single portion but I ate what I could by myself so that would be based on your hunger level. Asking for more bread is totally reasonable too since the hummus is a large portion. I also got the Marlow burger, I’m a sucker for a good brunch burger & Marlow’s did not disappoint. The stack is a beauty & the fries are great, like really great. I am a big fan of the homemade sauce that goes on it, very light but strong of the flavor. For reference I included a picture of their steak and eggs that I have had on a separate occasion, the hanger is so juicy and we already know how I feel about the French fries. Marlow Bistro is a much visit in the area, don’t miss out!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNqaF84RBAB",
            "text": "Beautiful restaurant with real flower decoration on each table and cute cozy vibe. Food was good though nothing out of ordinary. Staffs were friendly though did take a while to take our order and get the check (had to wave to get attention a few times). Adequate street parking nearby with paid meter along main street and free in surround neighborhood.\n\nOverall, a positive experience and good place to come for a chill night out. Their oven was broken so no pizza available for ordering and will be curious to try next time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcC1PeFBnEAE",
            "text": "Came here with my girlfriend for brunch. Ordered an omelet and eggs florentine. Top notch would recommend 👍\nService is great too"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMDZlaXdRRRAB",
            "text": "Very pleasant atmosphere. Nice service. And the food was delicious and huge portions.\n\nWe got mocktails, butternut squash gnocchi, fries , and this massive amazing cauliflower roast.\n\nI think this place has something everyone would like"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWamJVWmpjbmx1UVdSMU4yOTJYek5CWWtoVk9YYxAB",
            "text": "We went to Marlow’s for restaurant week and had an absolutely delightful dinner on a Friday night. The food was delicious, beautifully plated, and well portioned. Selena and Antonio provided excellent service and everything was timed well despite a nearly full seating! We could not have asked for a better dinner!"
        },
        {
            "date": "4달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TFEyRndiSGRRVEhZdE1VNU9hRUpXY1hwelRtYxAB",
            "text": "Ce bistrot est un endroit agréable pour se restaurer. Jelena et Antonio nous ont accueillis avec chaleur en cette fin de journée pré 4 Juillet. Le service était efficient sans être trop présent.\nLe poulpe était frais et parfaitement cuit. Les gnocchis étaient savoureux.\nLe carrot cake a clôturé cet agréable moment.\nMerci à Jelena et Antonio. En espérant vous revoir."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcDVIZXJ3RRAB",
            "text": "Beautiful restaurant! Came with a friend for a mid-day brunch cocktail and sat outside. The interior is gorgeous, drinks were delish, and the vibes are perfect! Gamza, our server, provided excellent service. Would definitely come back to try the food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdkt6NmRnEAE",
            "text": "One of my favorite local restaurants to hang out at... Malbec & meatballs are always a great choice...the \"spill the tea\" cocktail is tops & they make a fabulous espresso martini (by every bartender)..also, Sunday brunch on their cozy sidewalk bistro!!! My favorite server is Alex, she is always smiling, friendly & attentive 🤩"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSR05sVnpWak13UzJwTFVXbFZWbmszY2xRMlJrRRAB",
            "text": "I came to New York for a week and ate out every lunch and dinner. Marlow was my favorite by the widest of margins. The food and drinks were so good. I love their sparkling rose. The prices are reasonable for this quality. And Jelena and Antonio offered the highest level of service. I cannot imagine a better experience in New York City so I highly recommend. OK so that they just done"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNGNXTjBSRk5GYTBjMmRFWmljRUZQVjFwdlZVRRAB",
            "text": "What an adorable quaint restaurant. Food was served hot and quick. Jelena & Antonio were so attentive and friendly. Can't wait to come back. Tip- get the branzino!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSWRUVmhVRXcyZWtSYWVVeDZVSEV5WDJaSGVIYxAB",
            "text": "I’ve been in New York with my wife and son visiting from San Francisco. We’ve been here for 10 days and by far the best meal we’ve had is at Marlow. Jelena and Antonio were very gracious and knew their menu and wines inside out. The service was on par with the nicest restaurants in San Francisco and the food was A+++++. I highly recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXbHF6N2VnEAE",
            "text": "Great ambiance! The restaurant is beautifully decorated inside with flowers and has a cool rustic vibe. Service was great.\n\nBeen meaning to try this place forever and finally came here for brunch. Food was good depending on what you ordered. The eggs Florentine was absolutely delicious. The burger on the other hand was dry and not very tasty.\n\nDefinitely would come back and try more of their dishes, especially for a romantic date night, but I'm not chomping at the bit to do so."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxd2RIX1ZBEAE",
            "text": "Good place back in summer of July! Tasty gnocchi and steak and eggs for a brunch. Though service was a tad slow, she was absolutely lovely. I did get charged the wrong bill and ended up paying 25 dollars more but when I called they were very gracious about it and returned it back when I swung by again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRE5XbElOMEpIUlZkQ1QxSm1jR2R4T1VFMVVuYxAB",
            "text": "Great local spot! Jelena and Antonio were excellent. Attentive. Helpful. Great service through the meal. Cocktails were delicious and the food was great!  We got two pasta dishes - gnocchi and penne vodka. Will definitely come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZelNFUjFjM0pqTW5wMFpuaEZXbk0zVkcxRGRYYxAB",
            "text": "I had the best experience at Marlow Bistro for their restaurant week menu. The tune tartar, chicken Milanese, and tiramisu were phenomenal Jelena and Antonio provided the most top tier service. They were both attentive and added to a great dining experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scFJGTTVaRWRsWjNGNFRtOVZNeTFPT1hKT01rRRAB",
            "text": "Beautiful restaurant with outdoor seating, great staff, a special shoutout to jelena for her welcoming service and Antonio for being attentive.\n\nThank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1a0lQWXZ3RRAB",
            "text": "Beautiful atmosphere, delicious food. Salmon was perfectly cooked, moist and crispy skin!! I didn’t like the ravioli fillings but the sauce was great! Overall, nicely flavored."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZMzRyOFpnEAE",
            "text": "Updated, October 2023:\nReturned for an actual dinner (vs a party 4 years earlier), the food was good but the service has significantly diminished. Our two waitstaff serving us were not very attentive, and one ignored our request for a drink menu. The drinks were very slow to materialize after ordering.\n\nMarch 2019:\nWent for a party, where the whole restaurant had been booked, so my experience is likely different from most. The bartenders were quick and accurate (and gave a good pour). The waitstaff had accurate orders, but weren't good at remembering who ordered them (30+ people is hard). Food was good, though underwhelming based on the menu's descriptions."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWZlpEUkNNVk5uWldvdGVYaHFMVWhJTVZCMWFuYxAB",
            "text": "Amazing experience!  Probably the best pizza I’ve ever had and in NY that’s saying something. Jelena and Antonio were attentive, friendly and made perfect food and drink suggestions. This may be my new favorite place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNGJXUlVUV3g2UzI1VVdYZHVNVkpQVTJaa1NYYxAB",
            "text": "That was a great new cauliflower discovery for me, love it! P.S. Antonio and Jelena are the best!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTGVYVm5lV1ZqTkZsVVJXYzFlRlU1VFZoUkxYYxAB",
            "text": "LOVE Marlowe’s - I’ll definitely be back here. Jelena and Antonio gave us the absolute best service; my friend and I felt so taken cared of from the beginning. Highly recommend getting the prosciutto pizza - yum!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidjQ3TWhRRRAB",
            "text": "Walked to this restaurant in the middle of a storm, so arrived damp, cold and a bit grumpy.  It was going to take something special to cheer us up, but the food and staff delivered.  Really good food, with what felt like very fresh ingredients, and a staff who were friendly and brilliant cheered us up.  Only shame was that we had to walk home in the rain - wish I could have stayed longer."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTVJFSlljMGRETjNONWNUTkZRbXRsYVhaME5YYxAB",
            "text": "We live nearby and Marlow is our go to place!  We’ve been coming here for years - consistently great food and service and atmosphere. Jelena was our waitress today and she is so incredibly pleasant and attentive each and every single time we come here. When I’m alone I sit at the bar - Antonio is excellent. Always pleasant and so inclusive! Marlow will continue to be our go to place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMk56TkxNREl4ZGtOMWJVeHNObGhRYURacVNIYxAB",
            "text": "A beautiful seating for Al excellent fresco dinner . Jenela and Antonio were excellent host. Service was fast and the food excellent"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cVVGbzRXblowVkdWMVpVbGxOVWN5UXpGUkxXYxAB",
            "text": "Absolutely loved our experience at Marlow Bistro! The atmosphere was warm and inviting—perfect for a relaxed evening. The food was outstanding, with every dish thoughtfully prepared and full of flavor. A special shoutout to Jelena and Antonio, who provided exceptional service were attentive, and friendly. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoQ1F5MVZTbVE0UmpJM1NDMUJjbHAwUXpNM2QxRRAB",
            "text": "Attended Marlo’s for my 26th Wedding  anniversary with my family. I am so thankful I did!! My Branzino was great, service was great(Jelena & Antonio) were very pleasant! Thank you!! Beautiful place. Always a pleasure to visit, this is my third visit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keWN6TnNaRUV3YVdjeE5tWkljM0JwWld4MFozYxAB",
            "text": "Such a great spot to stop by! Very nice vegetarian options. Jelena and Antonio were fantastic and very attentive throughout our time dining. There was no wait and the outdoor seating is pleasant despite being near the road. Very beautiful place."
        }
    ],
    "reviews_count": 82
}