{
    "name": "Maison Harlem",
    "place_id": "ChIJd3H89mz2wokRdk5JHB3Aino",
    "grid": "MN9",
    "address": "341 St Nicholas Ave, New York, NY 10027, USA",
    "rating": 4.4,
    "user_ratings_total": 1486,
    "phone_number": "(212) 222-9224",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGd2NFb3phM1pJV0hrelZsSnJiMk00WlRONlNWRRAB",
            "text": "I came in just now and I ordered a drink with the bartender a Mexican man or South American and he had me waiting for 15 minutes while he kept serving other people that ordered after I did. I will never come back to this place Ever again. Bartender sux"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cVJFaGFaREYzY1ZkelNHeHBNVlp5Wm1rNWRYYxAB",
            "text": "The french onion soup was great as was the duck I had and the roast chicken my partner had.  Lots of other interesting menu items that I'd come back for. It's a little loud inside so might not be best if you really want to have a conversation."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUlprUlVPRzAyUzJwR01sbGlkMlpvWldKSFlrRRAB",
            "text": "Incredible food, great staff and the live music is really nice!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGM1J6WlZSMTh4VEhvMVZUazFkRFk1WWpNNVVGRRAB",
            "text": "Dining Experience at Maison, Harlem – September 20, 2025\n\nOn Saturday, September 20, 2025, my party of three dined at Maison in Harlem, New York, between 6:00 and 7:15 p.m. I ordered the Soup of the Day, described as a purée of mixed vegetables. My colleagues selected lamb and beef entrées. Unfortunately, the overall experience was disappointing, and I cannot recommend this establishment.\n\nThe restaurant appeared unclean. The tables were only partially wiped, and the interior felt neglected. I found myself checking for rodents, avoiding the water, and wiping my own utensils before use. When I asked the server what vegetables were in the soup, they were unable to answer. Whether for reasons of allergy, food safety, or basic transparency, a restaurant should always be able to identify the main ingredients in its dishes. Based on what I observed, I question whether the ingredients—or any food served there—were properly washed or handled with care.\n\nThe music inside was uncomfortably loud, prompting us to move to an outdoor table. Shortly thereafter, cigarette smoke from nearby patrons made dining unpleasant, and a passerby began smoking a blunt (weed) just steps away from our table. At one point, a man approached our group and directed unwelcome remarks toward me and the other woman present, ignoring our male companion. By the time I finished my lukewarm soup, I was already feeling unwell.\n\nAs a U.S. Marine Corps veteran, athlete, and advocate, I am deeply aware of how what we eat affects our health and performance. I own a business focused (in part) on combating discrimination and inequity—particularly those affecting law-abiding African-American descendants of U.S. slaves. Initially, I did not plan to share this review, but after being invited to dine in Harlem again and having to decline, I realized it was important to explain why.\n\nHarlem holds a rich history and vibrant culture, yet it continues to struggle with inconsistent standards in service and food quality. My own journey reflects this: I had to leave Harlem to train and run marathons, and upon returning, I noticed a decline in my physical performance—something I attribute in part to the quality and handling of local food.\n\nI pray sincerely that Harlem will rise again, restored by integrity, care, and respect for its people. Only God can heal Harlem, New York, USA—and I pray earnestly that He does."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGV2FsTlRlakZXTlc5UVRWZFpZMWhVVTBsVmRIYxAB",
            "text": "I’ve had the seafood risotto for years. Last night, not only the price had a steep increase, but the portion was MUCH smaller. It used to have many shrimp, now 3; 3-4 bites of salmon, now 1 plus a couple shreds. I used to finish half and be full.. last night I finished it. I know prices are up, but choose one or the other, raise prices or reduce size. It’s not worth $44 + $20 wine. Still like the vibe, but no longer doable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSmNtbEdRM1E1TkU1SFZrRlhRMGhXYzFoalFsRRAB",
            "text": "Had a burger. Ordered medium.  And overly well done burger arrived. Dry, and not much flavor. Very expensive for the quality, which was mediocre at best."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMlJIZ3lUMDB3Wm14QlVteFRVMUpsVGsxYWFtYxAB",
            "text": "Excellent service and food was delicious"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtX0p2WDl3RRAB",
            "text": "Been coming here for 5 years. Finally introduced my family here for my birthday this year. Gabby and Max are awesome managers. The bartenders are nice & awesome as well. This is a local spot for the community. It can get a little wild during payday or certain days, but that how much people love this spot. The food here is delicious and rarely disappoints. Couldn't ask for a more caring loving team that you will not find anywhere outside downtown."
        },
        {
            "date": "1달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVVJHRldkRlUzTkZaMGFGTlFTbEJxZFhSRmJGRRAB",
            "text": "Świetny klimat, jedzenie i koktajle doskonałe, muzyka najlepsza w całym NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weFFrRnliMm80YUU5NFZtcDJWMVJHYVVWcVNVRRAB",
            "text": "Im recently retired from law enforcement! and haven't been out much ! we checked out a club down the street! 4west lounge! not my kind of crowd! left there in 15mins! walked up the block to this beautiful lovely friendly place! the MUSIC…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GQ1ZESkVZMkp0Y1c5bFgwTlVTbkp5WldkaFRXYxAB",
            "text": "Honestly this place has a great location and great vibes (music and set up). Food is above average. It’s very unfortunate that their service is REALLY bad. Ive visited this spot 4 times by now (i live really close by and this indeed is one…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkT00ycFVkbDlmZVVKRlEwTmpSMHRFVEMxMFZXYxAB",
            "text": "Good food and nice atmosphere. The prices have dramatically risen over the past years though and it is really expensive now, especially for the location."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aVVDMUpibXRLZEc5Wk9IaHBVbVE0WlhOTlZtYxAB",
            "text": "I like Maison Harlem for the vibes (Happy Hour in particular). Always an interesting crowd and random conversations. The drinks are strong and the music is usual good. The food - eh. It’s fairly expensive and not that flavorful. I don’t known if I would suggest dinner, but it’s definitely good for a bit while you grab a drink at the bar area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWZldVRkdWa1JqWm5vd2QxSTVWVVV5YWtSMk9YYxAB",
            "text": "The muscles and seafood pasta were amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gb2RFcG5ja0ZrU2s1UFJGUlROR2hEUTFKQlpVRRAB",
            "text": "Excellent! I randomly stumbled across this place looking for food after leaving the braid shop. I had a lovely glass of red wine. The crab +shrimp cake, marinated olives , and salmon with ratatouille. Everything was top tier . The whole place is a little vibe. Great music, great food, great atmosphere. I’m leaving with no complaints. My waitress Miranda was amazing and had great recommendations. Overall I give this place a 9/10. Would definitely come again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNlFUY3pSMEpVVFU1dlRYRTVUR1YyVWxwMVoyYxAB",
            "text": "Very clean and wonderful food very friendly atmosphere relaxing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNeE5IbDRlVzlmWkhRMGRXTjFWM3BDVGtGcFgzYxAB",
            "text": "The food and wine We’re good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSVFYVk9kbkJtZW5KSU9XazRjV0pWU1RWV1RtYxAB",
            "text": "I enjoyed lunch very much BUT $6.00 for a fountain soda is insulting if not abusive.  It's water wth syrup!\n\nVery nice waiter.\nNice atmosphere."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Nm9tSFpBEAE",
            "text": "Their bartender Pancho is great. Good food, good vibes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMU0zcEhUVEYwUkVWVE9VdDVOMjV2T1RSMVIwRRAB",
            "text": "Great music and best happy hour."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GT01URk5kalprU0U0MFVVczRTbkJ3UVRGM2VXYxAB",
            "text": "Nice cute place. Serving up delicious French cuisine. Reasonably priced. Great for a Sunday brunch. Would have given 5 stars for the atmosphere but the back room on a sunny day had a lot of flies."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdFoyVmtiekJQT0c5SVpFMW5kMUJ5V2xGMVYyYxAB",
            "text": "I been to many French places but Maisons  menu is extensive but the casoulet was to much vinegar and the beans too mushy also no beacon and the sausage was not good I've had way better on the upper west at French Roast all their food are too notch"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWGQydGpOa05zTm01eVdXMTFhUzFXT1ZGbmExRRAB",
            "text": "Great service---if you like local dive feel the bar has you covered further back a French style eatery awaits--- sliders were amazing, fresh ingredients paired and prepared very well"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMU5qWkpZVWhTYTBvM1gzVjRhMmx1ZFVsdlkxRRAB",
            "text": "My recent visit to Maison Harlem was extremely disappointing, primarily due to the service. While I had hoped for a pleasant meal, the manager failed to provide a decent experience for our table. We observed other customers receiving hot, delicious-smelling bread; we waited, anticipating we'd get some too, but we were never offered any. When I directly confronted our waitress about this, she unconvincingly claimed that for brunch, you do not get bread. However, every other table around us was also having brunch, and they all received bread. There was absolutely no valid excuse for this disparity.\nFurthermore, my friend's request to substitute the clams and calamari in her seafood pasta for extra shrimp was utterly unacceptable. While they did remove the unwanted seafood, they only added a paltry two shrimp. For a seafood pasta, and especially after a requested substitution, we rightly expected a substantial amount of shrimp.\nTo add insult to injury, on our way out, she handed us a single, hard, crumbly croissant .for two people. It's inexplicable why she wouldn't offer two.\nOverall, the service severely detracted from our visit, and I will absolutely not be returning to this restaurant again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKS20xYkRRbmNqZmJ3EAE",
            "text": "Currently my favorite place in the neighborhood. Everything I’ve had is great - Niçoise salad, brunch/Croque Madam, muscles with saffron cream broth!!! Love"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQcUR6Zkx2b2NucFJ3EAE",
            "text": "Hidden Gem, well not so hidden bar was packed and drinks were fantastic.   Had the Mussels and a steak, everything was perfect.   Great atmosphere and service was outstanding."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPTG8wSnlvZ2N1c3Z3RRAB",
            "text": "Best merguez in the city, couscous, fries, wine selection, cocktail, staff, ambiance, service, desert etc...everything is wonderful! Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VObU5yOEtrMmFxVy13RRAB",
            "text": "So sooo delicious!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYTZsOXp4aWNHTWN3EAE",
            "text": "My sister and I recently had dinner here and it was a lovely experience. Our server's name is Jean and he was the absolute best (mailleux!). He is very knowledgeable about the menu, wines and desserts. Its classy but not stuffy. Will definitely be returning."
        },
        {
            "date": "5달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNNlZsTW5WdmJmcERnEAE",
            "text": "Nach dem Besuch eines Gospelkonzerts in Harlem der ideale Ort um den Tag / Abend in faszinierendem Ambiente ausklingen zu lassen !"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcHVpd253RRAB",
            "text": "Excellent food, friendly vibe, terrific wait staff, interesting cocktails. Gluten free and vegetarian options."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKcUMzUHFDZzRDWlVREAE",
            "text": "Quite pricey for what we got. Four burgers, two beers and one cocktail came up to almost $200.00."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeTZfWDZnRRAB",
            "text": "Delicious. Best muscles. Great wine. Crispy French bread."
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveWNubEVnEAE",
            "text": "Restaurant tenue par une française avec une cuisine correspondante à des plats traditionnels français\nAmbiance brasserie conviviale"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvczVQNmJnEAE",
            "text": "Amazing open air atmosphere with a delightful exposed brick vibe. Food was phenomenal, but the Mac n cheese took a minute (it was cooking and with it ) the French onion soup was soulful and thoughtful flavored. Mac n cheese was Divine! Drinks were pricey but heavy pours and delicious. Would be back!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2anEzdE9BEAE",
            "text": "Always the best on ny without pretense."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsejlDWTdRRRAB",
            "text": "Update: The last couple of times I’ve ordered delivery the speed has improved significantly. I’ve noticed that the sauce is a little different (less creamier than before), but it isn’t wildly worse and the portions are still perfect.\n\nThis makes me so sad to write this review. This was one of the first restaurants I tried when I moved to the neighborhood and I have since brought friends to this restaurant and continue to frequent it myself, as well as order delivery and pick up regularly. The last two times I ordered food have been quite disastrous (with wait times over one hour) with the most recent being today. I ordered food for dinner after a long, exhausting work day and expected the food to arrive within an hour to an hour and a half. It’s been over two hours and I haven’t gotten any tracking or delivery updates. So now I’ve just been waiting here, starving, for my dinner for the past three hours. I called twice with the last phone call ending in being hung up on. I’ve always tipped very generously on meals including delivery orders and I’m so sad to see the service plummet down to this point."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcWM2bkhBEAE",
            "text": "Great drinks and French food! The staff are wonderful! ✨"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3XzR5bkpnEAE",
            "text": "Delicious food\nOld school atmosphere\nBusy but the wait is worth"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MHE2T09BEAE",
            "text": "Great food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3b01HZnZRRRAB",
            "text": "Never a bad meal in over a decade!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3d05xMHRBRRAB",
            "text": "7 dollars for a horrible coffee 👎👎"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN3JfN1RREAE",
            "text": "Everything was excellent. The brunch menu options were classic French and amazingly delicious. Highly recommend for lazy meals, catching up with an old friend for a couple of hours."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOHFPSzh3RRAB",
            "text": "Remarkable spot in an unexpected location. Highly recommend the croque moinseur. Just the right thickness of meat, with the right saltiness. The cheese was really tasty as well, melted onto bread that was rustic enough to keep its shape. The resulting combination was very tasty in its different parts: the meaty and spiced middle, the tangy and savory topping, and the bready and nutty middle. The feuille de brique was able to keep the phyllo dough strong, crunchy but slightly bready so that the phyllo didn't melt in the presence of the meat or the vegetables. I also loved the portion sizes, enough for a solid meal but not so big you're collapsing at the end. I also really respected their use of lightness, both in the dressing of the salad for my croque moinseur and in the sauces for the feuille de brique.\n\nThe surprise, at the end, was the croissant. I didn't get the croissant at the beginning as there were no baked croissants. At the end of our meal, we did get a chance to take a croissant to go. What a find for the walk back to central Harlem. Flaky but not falling apart. Moist but not doughy. Buttery but not heavy. I didn't know somewhere made croissants like this in the States. I'll definitely go back for those, and I'll definitely go back for the rest of the brunch. Maybe the next step is to try their dinners ..."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc0plcTdnRRAB",
            "text": "good!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfay1fYnZRRRAB",
            "text": "Ordered the seafood pasta to go and it was disappointing to say the least. It’s support be flavored w saffron but tasted like yellow color comes from food coloring. It was a watered down mess. Also the seafood itself was not properly washed. There were a lot of grains. On top of that I sat at the bar while I waited and was pickpocketed. Be careful if u walk in and someone immediately offers to buy you a drink. It’s a set up."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmajRfNlFBEAE",
            "text": "Great spot to meet the locals. The food is good and the staff are very friendly and attentive. The only thing is that it is a little tight to walk between the bar and the seating across the bar. Other than that, it's great tío chill 😎.\nBtw, the frozen pink drink is very tasty that packs a PUNCH!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaFpqMk53EAE",
            "text": "Love the cloud and the ambiance."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX3JLb1JBEAE",
            "text": "I was deeply disappointed with my recent visit to Maison Harlem. This used to be one of my favorite restaurants when I lived in Harlem, and I was excited to share the experience with my family during a trip back to the city. Unfortunately, the visit did not live up to my past experiences.\n\nFrom the moment we walked in, the service was unwelcoming. We were barely greeted and then directed to sit at a middle table. When I politely requested a different available table, the host responded with visible annoyance and rudely refused the request. It felt unnecessarily dismissive and set a bad tone for the evening.\n\nAfter sitting down, we waited for someone to acknowledge us as their table, but no one came. I had to get up and approach the host again, who seemed uninterested and reluctantly said he would take our order when he had time. To make matters worse, my family noticed him in the back laughing and smirking with other staff members, which felt unprofessional and disrespectful.\n\nAt this point, I asked to speak with the manager, hoping to salvage the experience. Unfortunately, the manager seemed irritated that I interrupted her cigarette break outside. Instead of addressing the issue with empathy or urgency, she appeared indifferent to our concerns. I asked for a different server, but the overall treatment left us feeling so unwelcome that we decided to leave altogether.\n\nIt’s disheartening to see how far this restaurant has fallen. I had heard rumors that the service had gone downhill, but I was hoping they weren’t true—unfortunately, they were. Maison Harlem used to be a gem, but based on this visit, I cannot recommend it anymore. I sincerely hope they address these issues, as the decline in service is a real shame for a place that once felt like a neighborhood staple."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OFl2eG1BRRAB",
            "text": "Upon arrival the chaotic and hectic pathway to the back of the restaurant was a challenge. The menu offered an array of dishes that often seem on the high spectrum of cost.\nOrdered the steak with mash potatoes however the mash potatoes looked like a folded blanket that was semi tough and lacked the texture of a true mash potatoes.\nThe calms were decent and the fries were tasty. I personally wasn’t a fan of any of the dishes.\nThe entry way of the restrooms has this old plastic like material hanging from the frame that seems dirty and slaps you in the face as you attempt to enter and exit the restroom area."
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNReWVycG1BRRAB",
            "text": "오랜만에 할렘에서 찾은 괜찮은 프렌치 레스토랑.   가격대비 훌륭한 음식과 서비스."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLTdlQThRRRAB",
            "text": "Called and made a reservation with ease. Arrived early (party of 2) and was seated right away. Please note every table cleared their plates before they were taken away. Nothing was left on anyone’s plates. The food is this good.\n\nFood\nEverything was delicious\nWe got a spinach quiche and it melted in our mouths. Even the green salad that came with it was good.\n\nWe both got duck confit. My sister modified her side and I kept mine as is. Delicious! The duck was a good size, crispy, and well seasoned. Whatever sauce they used was great. The sides was delicious as well.\n\nWe also got the lamb sausage. It was okay. I wouldn’t order it again.\n\nI’m going up have to come back to try a few other things on the menu.\n\nAtmosphere\nThe space isn’t very big, but they make the most of it. I’d say it’s a snug atmosphere. When full it can get loud, but overall we felt comfortable at the table we were seated at.\n\nService\nService was good. Attentive and fulfilled all our requests."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1M3ZQOHp3RRAB",
            "text": "A hidden gem in Harlem! French cuisine with an extremely reasonable price. It looks like a bar but the restaurant is in the back. Their menu cover was old album covers. The food was delicious. We had the grant platter. Meat, cheese, apple slices were high quality and fresh, but one of the grapes on the plate was unfortunately molded. The lighting was so dark and we almost had it. For entrees, I had the duck leg confit, and my husband had the steak special. For me, the duck was a bit too salty, but it could a personal preference. The steak was so good - one of the best we have had, even better than most of the fancy steak houses we tried. The sauce in every dish was all so impressive - the shine, the flavor, and how each sauce compliments the meat item. I loved how they didn’t put too much ice in water, and I could actually enjoy my water. And the complimentary bread was also good - warm, crunchy outside and soft inside. The decor and furniture was a bit too old (the bench was shaky), but overall we liked the style and the vibe of the restaurant. We had a great time. We will definitely revisit next we are in Harlem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3a05pNGpnRRAB",
            "text": "The host was less than hospitable. I didn't really care for the menu. All of their pastas come in a white sauce when I asked if they can make it in a red sauce they did which I appreciate it but it was bland."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScTU3MlF3EAE",
            "text": "The Escargot was great. The duck breast was a little rare for me but my friend ate hers and said it was great. I ordered the mussels and steak. Amazing 🤩"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwN3Y2Wll3EAE",
            "text": "The vibe here is good. Music is a good mix as well. The food was good. The menu is so unique in regards to aesthetics. They use old record albums for the pages.\n\nService was a little slow, it was a Friday during happy hour. But it wasn’t crowded so.\n\nEither way, I’d go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNTg3QlhREAE",
            "text": "We were given a recommendation to try this place and we are so glad we went.  The food, atmosphere and service were excellent.  We would pass this recommendation along to anyone!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQN282clFREAE",
            "text": "Fantastic brunch.  The only problem was that we wanted to order the whole menu.  Eggs Benedict, the Brique & chicken ratatouille sandwich were all excellent.  Service was perfect. Ambiance excellent.  Loved it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOThUMnl3RRAB",
            "text": "It’s a cute place that says it’s French. However the menu seems a little bit confusing. I ended up getting a risotto that got a dry consistency very quick. Also the dessert was… not good. 🤷🏽‍♀️ Interesting wine selection though.\nStaffs were super nice. I didn’t have a reservation, but I was quickly accommodate to a table even the place being busy at the time I got there (around 1:30pm)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaHB1bWJ3EAE",
            "text": "On 4th April 2024, I entered the bar area, I did not find a seat at the actual bar, I sat on a bar stool located behind the actual bar.  Before ordering through people at the bar, I walked over to the left side of the bar to greet the bartender that serves me most often.I asked him, did happy hour end at 4 p.m.?  He said: “No, everything until 7.”  I ordered a froze’;  The reason the 'froze’ was ordered was because I was just told, by a trusted source, that it was happy hour.After having been told that happy hour ends at 7 p.m. I observed that we were getting close to that time. I order a 2nd froze’ this would make two drinks at what I believe is $7 per drink. After sipping a single sip from the 2nd drink, it becomes apparent that I can not drink this massive 2nd drink, I request a to-go cup as well as the check.  I was given both, I immediately alerted the bartender that there was a mistake, because the check read: $34.84.  “He said: no, that’s the check.” I told him that I ordered those within the parameters of happy hour.He said: “Happy hour ended at 4. I then attempted to tell him about the conversation I had with the bartender that preceded him, “he said: talk to the manager.” The manager is a black male,he said nahh the glass sizes are different.I asked him, should the general public know the different sizes of a single restaurant's glass sizes?He said: “Wait, calm down, you are about to not have to pay this check and never be allowed to come in here again.”To which I replied: Nahhh I’ll pay the check, then never come in here again.This was a question in leadership and training.Leaders are taught, when trained properly: A) understand what the customer is saying.   I repeatedly asked him if I, a consumer, who doesn’t normally drink this, has the burden of knowing the difference in glass sizes based on happy hour or regular pricing.He wasn’t concerned with understanding what I was saying,he was concerned with being right, which is a TEXTbook error in leadership, particularly when dealing within the service industry. B) leaders are taught to deescalate the situation, because you never know who you are talking to.  I was so appalled when he said what he said that I decided, in my head, not vocally, that I would review this place and take my time doing it, to get it exactly right. After he threatened me, I found myself in work mode, I kept saying to myself, record this if you can or hang on to every single word this guy is saying.He then placed two glasses side by side, I took a picture of it, once I did this, he went to get a senior manager.  She was pleasant, very well trained in dealing with people. I explained to her, this was not an issue of paying, I would pay it regardless, this was an issue of policy.  She offered things, I declined, I looked down to the check, placed the tip amount, and signed it.I looked closely at the line items described and noticed something I have never seen at this restaurant in my life.I noticed that the bartender added automatic gratuity. I informed the more senior manager. I then took all appropriate pictures and started to develop a narrative for this review.A picture of my receipt at 5:01:38 p.m. on 30th March 2024 with my normal bartender, you can clearly read that no auto gratuity was added.A picture of my receipt at 11:19:35 30th March 2024 with the bartender in question.  No auto gratuity was added to the bill. A picture of my receipt on the day in question 7:13:28 p.m. 4th April 2024. Clearly showing the bartender adding $6.40 gratuity to the bill.A picture showing the glass comparison shown to me by the first male manager and his belief that a member of the public should know the difference between the two of those.A picture of the 'froze’ in the to go cup, I’m showing this, because it would be unreasonable for one to believe that this 2nd drink would have been ordered had I believed this was not on the happy hour menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaEs3cWlnRRAB",
            "text": "My experience at Maison Harlem was quite pleasant. The ambiance was quite tranquil, especially when I arrived early and dined solo before the crowds poured in. The food was quite good, though the bacon was slightly dry, it still had a delicious flavor. Moreover, the restaurant's proximity to the B/D train station makes it all the more attractive.\n\nOverall, I would definitely recommend Maison Harlem and look forward to returning soon for another visit."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNNFpIMzdnRRAB",
            "text": "What a great first time dining experience! We didn't have any reservations but we still tried. Lucky for us, we got seated quickly on a Saturday evening.\n\nThe vibe was really chill. Great for a dinner date and drinks or with a group of friends.\n\nThe truffle mac and cheese whetted our appetite. It smelled really good. It was sublime.\n\nI ordered the Demi Poulet because I saw the other table being served and the scent just wafted to our table and I just had to have it. Great choice! It was very tender, juicy, and seasoned well.\n\nMy Bub’s New York shell steak was cooked Medium Rare. He complimented how the crust outside was perfect!\n\nThe serving portions were just right for the price and quality. You won't feel short-changed.\n\nService was pleasant and quick! Our server was very affable.\n\nWorth trying their brunch menu next time!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2cWZqMHJnRRAB",
            "text": "Love the vibe here a lot. Great place to chill with friends. I was expecting a lot from their dishes but it didn’t turn out great. The sea food definitely was not fresh. We ordered shrimp cocktail, seafood pasta and steak. Got free dessert (creme brûlée) by posting and tagging them on instagram"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dmV2dEZ3EAE",
            "text": "First time trying this place, early dinner on way to Apollo Theatre. Didn't look as good as I thought it would but looks can be deceiving and by the end of dinner i was not disappointed. Very good French food, nice wine selection, and great service!! They offer outdoor seating. Had a cocktail at the bar waiting for my girlfriend before dinner and had a good time and conversation, everyone was very friendly and seemed to know each other. Will definitely go back. Parking is hard to find."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyemI2U0VBEAE",
            "text": "Delicious bistro in the heart of Harlem! Came here for weekend brunch with a party of 6 and got seated right away without a reservation. The staff are super friendly and helpful. I got the eggs Nordic and it was delicious! The poached eggs were slightly over cooked but the smoked salmon paired so nicely in the fluffy English muffin and the potatoes were seasoned so nicely. The space inside was larger than I expected with a bit of a separation between the bar and the restaurant seating with a comfy and casual atmosphere. They were playing football on the big screen in the back but the TV volume wasn’t loud so we could still enjoy our brunch conversation. The prices weren’t super cheap, especially with the 20% added gratuity, but pretty standard for most NYC brunch places."
        },
        {
            "date": "7년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNy15SUZBEAE",
            "text": "Cadre sympathique, notamment en «terrasse-trottoir», aux petits soins, 3 personnes sont venues nous rendre visite en cours de déjeuner pour savoir si tout allait bien !…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2N1B5OFlREAE",
            "text": "I love French food. The owners are from France and the food excellent. Service was great too! Very attentive and easy going. Note: every Tuesday from 6-9pm they have live music and that made my dinner with my friend even better. I had duck leg and she the risotto which was excellent. Dessert was lovely. The price of the place well priced for such quality food. It’s a great place to go and hang out. The drinks were good too. I had a red sangria and it was well done. A favourite place that I will be returning too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtczRuTXdnRRAB",
            "text": "A typical French bistro in the heart of Harlem where it is non uncommon to meet french speaking people.\nThe food was very good and the quantity followed the American standard (meaning a lot). We took provencal mussels and Croque Madame as well as a crepe and a tarte tartin. A little bit disappointed because it was the way they made it in France. The dough was too thin and it was more apple sauce on a thin dough. The service was very good."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDNjRUaUVREAE",
            "text": "Rain or shine we will be here. We love Nabu and gave her our raincoat during Thursdays rain storm. By far this place is the most authentic French cuisine. Service is outstanding and food beyond belief. We just moved here and found our French home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsajV1N2hnRRAB",
            "text": "Delicious food and great servers. There’s jazz music in the evenings too. The food is well priced and very tasty!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZX01USUFnEAE",
            "text": "Easily one of the best spots in Harlem for a drink and a bite. The Angus steak is absolutely gorgeous and a must-have. They have a limited but good selection of wines. The vibe is fantastic - it's a great place to hop in once the sun goes down and an give the biggest watering holes in NY a run for their money! Check it out!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3cHFXbXdRRRAB",
            "text": "This was my first trip to Maison Harlem for breakfast/ brunch. I have dined here several times since moving to NYC in 2005, even “dined” at the bar a few times.\n\nII ended up here today (at 2:30 p.m.) “accidentally.”  I made the reservation with thoughts of my favorites: escargot, duck, cauliflower au gratin, and of course, lava cake.\n\nLet me start at the end. The manager, a most gracious woman with a tender broad smile picked up my check for a rather minor issue with service.\n\nThe Christmas music was popular tunes and the volume perfect for enjoyment and conversation.  The speed of both being seated (I did have a reservation) and the speed of the food arrival were impressive as always.\n\nRealizing I had booked too early for dinner, I settled on a ham, Swiss cheese, and mushroom omelette.  It was unremarkably and not hot off the grill but tasty enough and the proportion was spot on. The cauliflower au gratin was very tasty and not overly salty as is the case in many restaurants “experimenting” with potato conversion dishes. The lava cake was as I remembered excellent, savory, soft cake, warm chocolate with just enough sweetness.\n\nNeedless to say I will be back  A guy has to have his escargot and duck."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaWNubXNRRRAB",
            "text": "They had a really good reggae band performing when we were there, the food comes in big portions. It’s small and cozy, nice place for a girls dinner date."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRX2VDWDVRRRAB",
            "text": "One of the nicer sit-down places in the area, but the brunch is mediocre. When the place first opened, the French dinner was good and comforting. A plus is that the decor is cozy and nostalgic"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydXYzSExBEAE",
            "text": "The place has own charm, the service was great. Very nice athmosfere. The food was so delish but with not  perfect presentation The burata cheese was almost like mozzarella and the lava cake was with no lava:) however the margret duck was superior. The drinks were bad. Negroni was shaked wine was old. I would give another chance because the steak tartare was fabolous"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRXzZEcHFBRRAB",
            "text": "This very cozy neighborhood restaurant has great array of French dishes. The service is very good. French onion soup is delicious, although too cheesy for how it should be. Coq au vin has nice thick sauce, duck confit was surprisingly good. It is good for French grub, but not for refined French cuisine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeXBHazVBRRAB",
            "text": "Went here for my birthday.  I was very happy with the dinner options.  I only eat fish if eating non vegetarian options, and the branzino was incredible.  Also, try the truffle Mac and Cheese.  For drinks, just ask for what you want if it's not on the menu.  My Long Island ice tea was on point."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxaWZLSmpnRRAB",
            "text": "Amazing place, AMAZINGLY AMAZING FOOD!\n\nService could use a little update but the overall experience overpowers the hiccups.  The Frozes are really good, not too strong but can deff sneak up on you.  As per the food, just what I wanted.  Thinking about it as I write this review.\n\nGreat place for casual meetings, dates and quick bite.  Do not recommend this place if you are looking for a night out."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPc0lEcDFnRRAB",
            "text": "This is the second time we've come. The tuna tartare was fresh andbwell plated. The carbonara is rich and very interesting, while the spicy lamb burger is also delicious and quite filling. The dill sauce was a great condiment on the burger. The chocolate mousse is some of the best in the city. Prices are reasonable for portions and quality.\n\nConstructive criticism: Service could have been improved; our waiter was fine at first, but quickly forgot about us. I had to wave my arms enthusiastically multiple times to get his attention after our entree was served. After that point he was very gruff with us, as if he saw his tip as a lost cause afterwards. I overheard another woman sat nearby complaining about the slow service as well. We also wish they had the steak tartare, which is one of their signature dishes.\n\nIt also would be a good idea for the management to update the little menu cards on the table that claim you can get a free dessert by downloading an app and posting about them on Instagram. Our waiter gruffly informed us that it's only one dessert per table, which is not in the fine print. That probably would have been a totally fine revelation, if he had been nicer about the clarification."
        }
    ],
    "reviews_count": 79
}