{
    "name": "Cocina Consuelo",
    "place_id": "ChIJEyoj-4f3wokRYFZu3Lywqd8",
    "grid": "MN9",
    "address": "130 Hamilton Pl, New York, NY 10031, USA",
    "rating": 4.7,
    "user_ratings_total": 259,
    "phone_number": "(646) 250-7172",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOS2NXUkdUbTl6UVd4RmRFSk9PV05xVjFKSlYzYxAB",
            "text": "If you ever want to feel like you’re in Mexico City walking through Roma Norte - this is the spot!\n\nBefore you even walk in, the colors from outside is already pulling you in, even if you didn’t plan on stopping here. The ambiance and vibe was amazing. A bit cozy but I don’t mind that at all.\n\nStarted off with the fennel salad which was tangy with a little kick. Nice and refreshing to start the meal off with.\n\nWe then followed up with the bone marrow Birria and the mole negro which is a confit duck leg. Besides my spot in the south Bronx, this is next up on the mole list. It was delicious and savory and not too heavy.\n\nOnce the bone marrow dish is done, you get a shot which is cilantro infused vodka! Salut!\n\nFinished with this deconstructed tiramisu which wasn’t too sweet which is the way I love my desserts.\n\nI will definitely come here again to try some other dishes just because this spot deserves it.\n\nShoutout to the owner saying she only works there and was being humble, but I do my research before hitting up a spot so thank you for being yourself and providing this wonderful experience with your staff."
        },
        {
            "date": "3일 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNlpURjJSelp1VFhwTU1tZHJhV2xIUldOMk1uYxAB",
            "text": "Todo esta muy bien, pero la misera flaka fue una persona muy mal educada penso k no traia dinero para pagar cuando le pedi el menu y me miro de arriba abajo se dio media Vuelta y me cerro la puerta..."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMGQyUmZMUzFtTTFWeVZFZGxTR2R3VUZkUWMyYxAB",
            "text": "I don’t think I have ever felt welcomed in a place as I did. The person helping us - a woman in a black suit, was very friendly and warm. The food was great! You may have to wait for seating but it was worth it. The pancakes were excellent! A must-have!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOS1RXODVVRkkxTjFWd1N5MHljV0ZITUdFeVZrRRAB",
            "text": "Best Mexican food in NYC. Breakfast was fire"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TVlUVkNWVjk0U2s1aFZXYzVaVXhLTlZreWExRRAB",
            "text": "For a Mexican who was born and raised in the east north of Mexico, it's really important to have barbacoa for breakfast on Sunday. So , here is a place that you can eat delicious barbacoa tacos 🌮 with blue tortillas."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWVVWbGhNWEkzVWtKUGVHODRjbmx1WnpSblRXYxAB",
            "text": "Tasty food, not that many options. Very spicy! We had to wait like 30+ minutes to get a table inside, outside was very chilly"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRWFqSnlOMjFsU2xrelpVODFVSEYyU1dkeVpGRRAB",
            "text": "This place is an absolute delight and I feel so lucky to have found it for brunch today. First, the food: from tortilla to chorizo to fennel salad to pancake, to the warmth of our welcome and service… we couldn’t be more grateful.\n\nAs a Mexican American with roots in Toluca, I was so happy to see quesadillas de chorizo verde on a menu. And though my family might disown me, this could be the best quesadilla of my life. The chorizo was Michelin star worthy, even in Toluca I’ve never had chorizo this good! And the tortillas… as good as any I’ve ever had. I will travel two hours for this quesadilla I swear to la Virgen de Guadalupe.\n\nThe masa pancake is a revelation. Some fool complained that they couldn’t get it without the honey butter. Go elsewhere and pass me your pancake with honey butter my friend, because you do not deserve this food.\n\nThe fennel and chayote salad with pepitas (I think!) was just the citrusy freshness we needed with our decadent sweet pancake.\n\nAnd then the torta de pierna, juicy and fresh - not some sandwich meat out of a plastic wrapper… this is home cooked pork leg.\n\nAnd again, the service - warm and kind and attentive. Everyone seemed happy to be there, the vibe all around was so good.\n\nA perfect morning, we are so grateful."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkalIzWndZMEZUVkRKamIycEVVbmxMV2tZdE4zYxAB",
            "text": "Great food, good price point, very well composed dishes! Loved the masa pancakes and tacos de barbacoa for breakfast. Mostly gluten free and safe for celiac."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWVZsTjFZMGxuWDJNM01tczBOemRHUlhWVVVYYxAB",
            "text": "Best authentic Mexican food in New York. Uptown Manhattan hidden gem!\nCan't wait to be back to try dinner menu. Keep it up!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGYWJHRkNiekJTTXpsT2RVWjRTbTkyUlZweVJWRRAB",
            "text": "Best mole poblano chicken I’ve had outside of Mexico…"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUU5UVnJaa2xtZEVSaU9UZEtkREUyVmxCcVJYYxAB",
            "text": "One of the best places in Hamilton Heights!  ❤️"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RVVtVlZVVmR1TUVFeVZXRXpiVUo2UmxwRE1GRRAB",
            "text": "Every dish was incredible. A must try in NYC. The team here is kind and has mastered their craft. The interior and music are just as good as the food. Will be back to try the breakfast! Thank you"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWFVUSlRZVjh5WTJaemExQlNTRGRPWVVkVVNHYxAB",
            "text": "Mmmm buena comida"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Q01sVXdiV2R3WmsxRFdIcHFOR1pEZUhWdUxXYxAB",
            "text": "Small and cozy spot for Mexican eats! There are separate morning and dinner menus. The masa pancakes were the most memorable meal to me. The chorizo quesadillas were decent too. Very very friendly staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRVNVcHZlSGs1YzBoUVZqSnBRamt6TVVkMFZXYxAB",
            "text": "Very tasty, very atmospheric, the owner personally cooked for us, great job"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFM09HcFNOMGx4ZVVkbFpHbFdhVkl3Y1ZsWlRHYxAB",
            "text": "Beautiful restaurant with a stylish decor and cozy touches. It was delicious, we had breakfast after our Harlem Run, so it was packed with all the runners at 9 am. We were seated right away, but we had to wait a while for the food, which was totally understandable.\nThe food was worth the wait! We shared a sandwich with pork and a pancake, and we loved them both. The pancake was giant and so yummy! Loved the sandwich too. Will definitely come back to try their dinner menu."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210M1dIZDJiMXBTYkdsVVlteFhUemxoUWxOck0wRRAB",
            "text": "The food was amazing and will definitely come back!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201T1JWWnplRmRaWWt0YWVtZGFiWEJTTURsMFRVRRAB",
            "text": "The food is always fresh, flavorful, and made with love. Super friendly service and cozy vibes—definitely a 5-star spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMmEybzFkazFVYzNjeFJGY3RVamx4TTFSS1lWRRAB",
            "text": "Was transported to Mexico this past weekend while enjoying brunch at this intimate and festive spot. Between the incredibly warm service, the impeccable food (barbacoa tacos and masa pancake!!) and wonderful music that kept my head bopping with every bite, it was hard to pull myself away. Can't wait to get back - next time for dinner!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeVFUSmZPVmhrYjIxM0xXa3dObWhhVnpkSGNWRRAB",
            "text": "Simply a lovely getaway in Hamilton Heights."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sc2JDMUJWbWxrY3pSelVuRmpabTV4TlVkTVYyYxAB",
            "text": "Hoy tube un poquito de recuerdos , cené con mi esposa , aquí en cocina  consuelo , y no tengo palabras para poder describir lo que pasó. probé con su mole , y  unas lágrimas me bajaron  , recordé ese sabor  que alguna ves probé con en mi pueblo algo que no sabía que extrañaba hasta que lo comí , fue un sentimiento muy lindo  de nostalgia , algo que jamás me avía pasado en un restaurante, todo fue muy bueno el servicio, Salomé la mesera muy linda persona muy atenta , el lugar muy bonito , claro que regresaré , es un lugar sin duda muy especial"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nemJqVkRkSEoxVkd4bFVsODVORGxaTFhGbWVVRRAB",
            "text": "This was my second time visiting this restaurant, and unfortunately, both times I had to leave early because of the way the owner (who is also the chef) treated her employees in front of customers.\nThe first time, she apologized for slow service by saying her “maldita” employee had called out and left her all alone. I decided to give it another chance since my mom really wanted to try it after walking by so many times.\nUnfortunately, the second visit was even worse. Before we even received water, the owner was scolding her employees loudly in front of guests, saying things like they needed to do their jobs or she would just close the restaurant and go home. She even said she didn’t care if the restaurant stayed open.\nIt was uncomfortable, unprofessional, and made it impossible to enjoy a meal. We ended up leaving and went to Oso nearby instead, where both the staff and food were excellent.\nI really wanted to like this place, but after two bad experiences, I won’t be returning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSd1VFMW5RM2hVU0dKT1VHSmpTMDV1ZW0xM1dWRRAB",
            "text": "+Get $25 off your bill through the link on my profile!\n\nThe kitchen opens at 6pm for dinner orders and you can’t order anything other than drinks / guac / jalapeños till then. The seats get filled up quickly, so the best move is to go at 5:30pm and have a drink while you wait.\n\nAs for the food, the bone marrows were really good! The mole negro was more split in opinion, but I personally enjoyed it. I got the green tomato marg bc some reviews were raving about it. It wasn’t bad but the flavors weren’t very well combined; interesting to try, but not necessary. Overall, the prices seemed pretty high for the portions and what it’s worth, but after the discount we came out content."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseGFIRlNWamxWWTNGVGJEQjVVR1pIYzJZelQxRRAB",
            "text": "Lovely addition to the neighborhood. Not cheap but extremely high quality. Prefer the dinner menu over brunch."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTmNrbHBaazFvWjBsdFZUTTRlbWhyUnpka2ExRRAB",
            "text": "Great food. Get the fluffy masa pancake, where the corn is the star of the show, contrasting the browned flavors against the gentle sweetness. The tortilla were delightful as well.\n\nA few nitpicks: my pancake was underdone in the center, and I tasted aluminum from the baking powder. Please look into aluminum-free products as some people are really sensitive to the taste! Still delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVGRYTk1SSEJxVVhscmNqVjFVRUZMYlZKSlQxRRAB",
            "text": "Have a wonderful life"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaE5WcHNkVmxNZVVFd2NGZHZNMk40TVMxaGVIYxAB",
            "text": "Cosy and quaint venue. Only had time to get a for a drink and try the stuffed tuna poppers- will definitely go back for full experience"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MlRGWlVabVZxU1hKbGRtRm1aekYwYUdkRlJuYxAB",
            "text": "Masa pancake was fluffy and delicious! Vibe inside and outside is awesome. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMVlrOUpURVpTZFRZeE5XRk9UR2xXVVZGT1VXYxAB",
            "text": "Best pancake of my life 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVGNVNWpOMDVmYkhORk16QklTWFZJVlVwclZGRRAB",
            "text": "So incredible and truly a gem in Harlem. Can’t wait to come back. I have to try everything they have to offer"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscGRqWkZOMDFOUjBkaVRVOHljV2hxV21sNmVuYxAB",
            "text": "Great spot, authentic food. I highly recommend this place. Note: might need to wait an available table since this restaurant doesn’t usually accept reservations"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214T1YxTkRaVkJhVVhoWFZYbzBMVWRaVW1wR1dYYxAB",
            "text": "Friendly staff, fabulous food. The coco coffee is what I always wanted a coconut coffee to taste like and their traditional spiced coffee is exquisite. The pork torta was to die for, a perfect balance of savory and spicy. Corn pancake in a honey butter sauce was what I have always wanted sweet cornbread with butter and honey to taste like. The staff is super friendly and as someone that doesn't speak Spanish or know much about their food culture they were happy to help me understand the food offerings and pick things that would serve my heart's desire."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdWNFaDRhM2xmU0U5d05YZzNZMjVSV1hwQ1MwRRAB",
            "text": "Lovely service and tasty food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUFRGY3hURE5yVW5NNGRVczNVSFJpY2tacFVYYxAB",
            "text": "Beautiful perfection"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMmNYUjBjMUpmZW5oM1VWWjRPQzF5T1doTVUzYxAB",
            "text": "Amazing - for brunch or dinner, you simply can’t go wrong. I personally enjoyed the brunch menu the most (note: it gets very busy after ~11:30am). We arrived at 5 for dinner and were seated immediately. Personal favorite dishes were: endive salad, duck mole, barbacoa tacos, and masa pancake. The only thing that didnt blow my mind was the cafe de olla (could’ve been stonger)."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvLXJhdkdnEAE",
            "text": "The best pancakes in NYC, and maybe the best tacos as well. The bone marrow is a must order, and the brunch is absurdly delicious. This is one of the most special restaurants in NYC and a place we constantly come back to try.\n\nSome highlights - the green tomato Margarita is among the best cocktails I’ve had, and almost certainly the best margarita. The spritzes are fun, the coffee is very good (all devocion, I believe), but absolutely the\nMargarita has been the highlight thus far.\n\nDinner is great, with a wider variety of dishes and a great blend of traditional and inventive dishes - the tataki has been a particular highlight recently.\n\nBrunch is my preferred choice, and every dish is so well done. The quesadillas are incredible - more like a closed traditional Mexican huarache. I plan to order one every time. The Barbacoa and tortas are rich, juicy, spicy, flavorful. I strongly recommend any dish that means you try the tortillas which are hand made, but also get another dish as well. Don’t hold back, a few dishes for 2 people is something you won’t regret."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWldFSnBhRkpxTlc4dE9ESmthMHQ0WW5aNWNVRRAB",
            "text": "Nice place. Tasty food. Small and intimate with great live music (A young lady singing with her guitar)."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UU5TMXZZbWwyUmpGUmJVZGZhbFZSWmxZMVpIYxAB",
            "text": "Karina, our incredible chef and restaurant co-owner, does what 6 people might struggle to do, and flawlessly. The small space is cleverly organized to allow for enough people that neighborhood consumers aren’t left jonesing for too long before getting a seat, as they wait briefly near the hypnotic aromas of food normally reserved for Ghibli films. Since there’s only one chef currently, all staff must expertly multitask when the space gets busy, which is why it’s a scientific anomaly that someone so focused and quick could produce dishes that taste like they were made slowly and gradually; like their ingredients were hand-picked minutes before; like songs of love were whispered to the dish between each step.\nThere’s more to say, but the thesis is, simply: eat at Cocina Consuelo."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZM2NuRlJMVkp6TkV4MU1YVjFRamxHUm5aS2JsRRAB",
            "text": "First of all, I want to mention that the restaurant had a cute ambiance. I visited with a party of four, excited for authentic Mexican cuisine after reading many glowing reviews. As a Mexican food enthusiast—having traveled extensively across Mexico, including Oaxaca on several food tours—I had high expectations. Unfortunately, Cocina Consuelo was a bit underwhelming.\n\nI usually wouldn’t write a review, but after a $260 bill (including tip and one alcoholic drink), I felt compelled to share. Each dish was very small, and we left feeling a little hungry. Our visit was quick, taking no more than an hour from start to finish.\n\nSome specific points: I ordered a tequila cocktail and was told they had no lime — surprisingly odd. The guacamole was underwhelming, with using no more than half an avocado, little flavor, and four tiny homemade tortilla chips for $18. The filet mignon was tender and cooked rare but came in just six thin slices for $40. The duck leg mole was mediocre at best: one duck leg with very little meat, and the mole, which is usually a favorite of mine, was bland and sour. The tiny piece of branzino could have been fresher and was quite bland, especially lacking salsas to enhance the flavor—Now that I think about it there was absolutely no home made salsas at all which bring such flavor—a key element in Mexican cuisine. We had one other tiny dish that I won’t even go into as it's not worth it.\n\nWhile I appreciated that the dishes had no carbs other than a tortilla on the side, adding some options might help guests feel more satisfied. Overall, the food was bland and somewhat odd for a place claiming to serve home-style Mexican cooking. After visiting, I really don’t understand the five-star reviews—where have people been eating?\n\nI wouldn’t quite call it a hole in the wall, but the space is definitely modest—just 8 to 10 tables tucked into a small dining room. That’s not necessarily a bad thing, but at these price points, I expected a more elevated experience. Living in New York, I’m used to paying premium prices, but for $260, I was hoping for more depth, flavor, and attention to detail on the plate. Sadly, Cocina Consuelo didn’t deliver the complexity or soul I associate with true Mexican home cooking."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaVMyZFNaSFZGT0VKSVNHZFVRek5SUzJ0clFtYxAB",
            "text": "The Quesadilla de Chorizo is TO DIE FOR-- absolutely delicious. The cheese, the chorizo, the tortilla, and the sauce were mm-mm good!!\n\nThe tortilla is handmade in-house, using nixtamalized corn and the chef's own recipe. Far superior texture and taste to any store bought tortilla. Plus the tryptophan in it is more bioavailable (due to the nixtamalization)!\n\nThe Agua Fresca was nice-- not too sweet and beautifully garnished with a fresh flower.\n\nAnd the *free range* (!) egg (huevo con Tortilla) was cooked wonderfully so the yolk was runny and custard. Happy animal products always taste better.\n\nCocina Consuelo is truly one of the best breakfast places in NYC!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kYU9VdHVNblJHT0VaNU9EUkxkbmRRTkZsWVZrRRAB",
            "text": "Everything was perfect! The atmosphere, the staff, and especially the food. Huevos rancheros and corn pancakes were incredible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQlZUYzNPVEJxUnpKRk1IZG9UbkYzTlhwc1VYYxAB",
            "text": "Excellent food and staff. Highly recommend"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jelQyaENkRU5YYkhSUlpHMDNVa2x4TVRBNGRFRRAB",
            "text": "Sin duda uno de los mejores restaurant del neighbor, la hospitalidad de lo mejor.\nPor algo esta en los mejores restaurant por New York Times"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTFZFaDNlVE5DU0c1TGFraDBOemd5WkVaU1FVRRAB",
            "text": "The food is SO good. We got guacamole, beets, and bone marrow birria and everything was perfect. 10/10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MU1FMXVNVzFzVFdFeFVFcG1hQzFsTWxoeFNGRRAB",
            "text": "My sisters and I went on a brunch date all the way from Jersey, and it did not disappoint!! Truly worth the traffic getting across the Lincoln Tunnel!! From the tortillas con huevo to the masa pancake, everything was stellar. The flavors were authentic, the portions generous, and the vibe felt like a true taste of home. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sV1NHUkdURWxzWWxwclNYQnhObVpWZW1oMFIyYxAB",
            "text": "This is some of the best food I’ve ever had. Super creative combinations of ingredients but also with a home cooking, family restaurant feel, which feels very unique in the NYC restaurant scene. The birria was absolutely out of this world. The people running it are incredibly kind and I wish them all the best. I’m so excited to go back and try the rest of the menu!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUGEwUmxMV2xzYVhWM1pYRkdNak5ZY0VKbFpFRRAB",
            "text": "I cannot comment on brunch, which I’ve heard is excellent. But dinner was mediocre, especially at this price point.  When we were seated by 7:45 pm on a saturday, we were quickly informed that they were out of virtually every meat dish — the bone marrow, the filet mignon, and the lamb. I dont need to eat meat, and i’m ok with improvising even where the restaurant’s best dishes have run out, but what was left i did not enjoy.  Nothing bad per se, but certainlu nothing approaching the level i would expect from a bit sized 40 dollar duck mole. The guacamole was surprisingly bland and the tres leches was anything but - it lacking on both the sponge (there was none) and the leche (also none, just whipped cream, essentially). I would definitely go again to try to breakfast and the bone marrow, but would go right at opening, because two hours in who knows what will be left."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNWNIcGhPVUoyZUVZMllsaFpOSE53UWxwaFJIYxAB",
            "text": "Tldr: Food ranged from  incredibly underwhelming, to just disappointing, and to finish it off with dessert, just inedible. This restaurant should not have outdoor seating if the staff cant keep up with tables. Try Oso or literally any other restaurant nearby.\n\nI was extremely disappointed by this restaurant after all the great talk and reviews i had some high expectations that were let down from beginning to end.  Walked in on a Saturday night and were quickly seated by the hostess. After being seated we waited 15 mins to have our order taken and then another 20 mins for the first dish to come out.\n-Guacamole & tostadas: lacked seasoning and tostadas were rubbery and not crispy nor toasty at all!\n-Candy beats: the yogurt and sauce were delicious, but the beets were beyond burnt.\n-Birria bone marrow: this dish was not bad, but the tortillas that came with it were tough and rubbery. (You should be able to at least get that right)\n-Duck Mole: duck was dry and overcooked and the mole sauce only tastes of bitter chocolate and no other flavor.\n-Dessert was the worst thing I’ve ever had a restaurant. It’s as if the cook went to Ctown in the corner, grabbed a bag of frozen berries,  covered them in whipped cream, and decided to call it a tres leches and charge $15 for it. Do better.\n\nReally wanted to love it. Maybe they’re better on a slower day."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcmFXdEdOVXRaTXpnNE1YcFFNR3hmVlZSYVoyYxAB",
            "text": "El Final , definitivamente volveré. Pase por casualidad y vi una persona corriendo fuera en una mesa y vi comerse un taco en una masa diferente.. solo entre por curiosidad…. Y booom.. ocurrió el milagro.. ahora estoy atrapado… súper limpio . Gente latina trabajadora..: esta gente trabaja señores .. estoy fascinado…. Tenerlos en el área es una bendición….le daría estrellas infinitas"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSaVNIWjBNV1Z6YkcxdE1VNVRjSFF4TXpGRlpVRRAB",
            "text": "Really good authentic yet creative Mexican food. Best one I have had in Manhattan in years. Can't wait to check out for dinner."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOTlyTnR3RRAB",
            "text": "The food was absolutely amazing! We ordered the Barbacoa Tacos and the Masa pancake, both of which were delicious. The meat in the taco was super tender and the salsa was divine. The Masa pancakes were also really really good! Not too sweet or heavy with amazing texture and flavour! Will 100% be coming back for dinner."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KT1gyeDVWbmQxTlVsNGJVTlBhbUY1ZVdkelpVRRAB",
            "text": "Pancakes were good and large, 1 order is good for 2-3 people. It may look overly sweet but it wasnt. The restaurant is smaller than expected and it does pick up during brunch. At 11am Sunday we got the last free table. After that everyone who arrived had a substantial wait time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbEszQ2J3EAE",
            "text": "Shtaaaaahp, this food was so good.  They were busy, I mean full-busy.  Regardless Chef Karina was on every order as it came up and her staff were on it every call for “Manos!”  If you want the full “FoodNetwork” experience, sit at the end of the bar and watch the Chef/Owner work her magic.  So special that a local got an idea, manifested the vision, and executed it so well.  Bravo!!! 👏🏼 👏🏼👏🏼\n\nI had the guacamole, clever with the house-made tortillas and fresh cilantro. I also had the beet salad which was made with “candy cane beets”. Never heard of it and it was sooo good. Tres leche l, gluten free with corn flour?! Ok just stop it already 😩🙏🏼. Next time I come I’ll have this beef the marrow, looks good!\nOverall, an elevated experience.  Filled the belly and, considering her story, the soul.  Pay a visit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcXVTN1FnEAE",
            "text": "We used to live just around the corner, they officially opened just a week before we moved away. We only had time to pop in once to check out the space and grab a coffee, but we’ve been dying to come back and experience a full meal. And wow it was more than worth the wait.\n\nWe had high hopes going in, especially after reading about the story behind the restaurant and the owner’s background in the culinary world. But somehow, the experience still exceeded every expectation.\n\nThe food was absolutely phenomenal. We ordered the Guacamole, Romanesco, Birria Bone Marrow, and Mama Chelo Jalapeños, and honestly, every single dish hit. But the Birria Bone Marrow was the clear standout. It was insanely flavorful, and when we scooped it into the homemade purple corn tortillas, it became what might just be the best taco I’ve ever had. Plus, the little bone marrow shot after was such a fun and clever touch. Loved it so much!\n\nThe cocktails were also a pleasant surprise, delicious, strong, and definitely worth the price. Each one was basically the size of three standard NYC cocktails, and beautifully balanced.\n\nWhat made the experience even better was the atmosphere. The space feels warm and personal like home, but elevated. Every detail was clearly thoughtfully chosen, from the handmade-looking Mexican fabric napkins, to the little plants, hanging pictures, and art that give the place so much character.\n\nThis isn’t just a restaurant it’s a full-on experience. The vibes, the food, and the kindness of the staff and owner make Cocina Consuelo feel truly special and divine. We’ll definitely be coming back, especially for that bone marrow and we can’t wait to try everything else on the menu."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMmNtTENnEAE",
            "text": "Cocina Consuelo is a special new addition to the neighborhood. The food is rich in flavor and love. The owner/chef, Karina, her family, and staff have created truly something special. When you are there you feel like family and you eat well. It’s a place you want to stay a while and enjoy just being. I would highly recommend trying everything and coming for both breakfast, brunch and dinner. The bone marrow and duck mole are exceptional. It’s truly a magical place with beautiful food and soul. A special addition and blessing to the community!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNV92b0dREAE",
            "text": "The food was absolutely insane. Even just starting with probably the best guac I've ever had. The duck molé was absolutely incredible and don't sleep on the romanesco - whatever magic they do to it will make even not veggie lovers dive in.\nDrinks are great, but light as they don't have a full liquor license. The margarita lite is 👌🏻\nThey don't take reservations so I definitely recommend going early or being ready to wait."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeDh5cG5RRRAB",
            "text": "Went in for a coffee last night after a run, and couldn't have been happier that I did. The food is prepared with so much love and nuance of flavor, and the people who work there make you feel like you're dropping by an old friends kitchen, rather than just going to a hole in the wall restaurant. Can't recommend this place highly enough."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnck9pTEZREAE",
            "text": "The Caesar salad was shockingly small for the price—$16—and had a slightly bitter taste. There was nothing special about it, which was disappointing, especially since the server recommended ordering appetizers while we waited 20–30 minutes for our main course.\n\nThe bone marrow was just okay. The portion was too small for the price, coming with only three tortillas, and the taste was average. Perhaps our expectations were too high based on the reviews.\n\nOn the other hand, the duck mole was alright—the flavor was rich, and the duck was tender."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdE1yMGF3EAE",
            "text": "Tucked away in the heart of Hamilton Heights, Harlem, NY is the 4-month new jewel-in-the-wall Mexican eatery Cocina Consuelo.\n\nThe quaintly and colorfully charming restaurant offers a expertly creative menu of seemingly humble dishes that, if my lovely masa pancakes is any indication, boast fully layered and rounded flavors.\n\nMy masa pancakes—made with a heirloom corn batter—were comfortingly homey, airy yet slightly custard-y, and richly savory and sweet. Topped with spiced berry compote and drizzled with a honey butter glaze, and full forkful provided a nice blend of flavors and textures that cycled most pleasingly with each mouthful.\n\nCo-owned by chef and Harlem-raised Dominican Karina Garcia, Cocina Consuelo seems to be destined for widespread appreciation and possibly avid fandom, and deservedly so."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eXB5TE13EAE",
            "text": "Take this as your sign to go—and I bet you’ll go more than once! Cocina Consuelo has a charm and offering that is not easily found elsewhere. What we ordered: Mama chelo jalapeños, Tortitas de la calabaza, Romanesco cauliflower, and Mole negro. Everything was delicious and service was excellent start to finish. I always appreciate a restaurant that can highlight and incorporate their produce (love my veggies). The sauces, especially the mole and Romanesco, were divine. Love the mama chelo jalapeños (stuffed with tuna) amazing flavors and a dish I haven’t encountered anywhere else. Generous servings of tortillas were provided, of course freshly made and delicious.\n\nI had dined with Cocina Consuelo before they had their dedicated location, and I know first hand the care they put into everything they make. The menu beautifully displays Mexican heritage while offering dishes and ingredients you won’t see at other Mexican establishments.\n\nThe ambiance was very cozy and intimate, and the space and owners are incredibly  welcoming."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cmIzMW9RRRAB",
            "text": "This little Mexican restaurant is as tiny as it gets—no traditional kitchen, just a counter where you can see everything being made right in front of you. It’s a unique setup that gives the place an intimate and casual vibe.\n\nI tried their masa pancake, and it was the highlight - soft, fluffy, and absolutely delightful. On the other hand, the tortilla con hueva didn’t quite hit the mark for me, as it was rather tasteless and lacked seasoning.\n\nWhat stood out the most, though, was the staff. They were friendly and welcoming, making me feel right at home. While the food had its ups and downs, the warm hospitality definitely left a good impression."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMUpuMlBBEAE",
            "text": "The most homey and inviting restaurant in New York City. The experience of eating here alone is addicting because of the warmth of the owners and staff and the enthusiasm of other guests - but the food is incredible as well. I’m more partial to their breakfast (the heirloom masa pancake is honestly divine and I never describe things as divine), but their dinner is also innovative, fun, and delish. We went twice in two weeks, and both times we sat next to folks who had done the same…need I say more?"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvanZQcVZREAE",
            "text": "Amazing food, service and ambiance! Consuelo is a wonderful intimate dining experience. Carina makes everyone feel at home and welcome. The food is to die for. A wonderful dining experience!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzek9XdUN3EAE",
            "text": "Delicious spot for dinner with a cozy atmosphere. Would definitely come back!\n\nEdit: breakfast is just as good! Truly amazing spot. Arrive early you might have to wait."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmd2RpT0tBEAE",
            "text": "I could not love this place more. We came for breakfast and ordered everything on the menu. The pineapple espress-o and the cacao flower drink were amazing. The pork sandwich was a must order. Everything was so good we came back 7 hours later to eat everything on the menu for dinner. The bone marrow and duck confit mole tacos were delicious as was the cauliflower romanesco and the zucchini fritters. Plus the owners are the nicest folks. You definitely feel like they welcomed you into their home."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdlBENXlBRRAB",
            "text": "We had a great time at Cocina, although we were very lucky to have found a parking spot a block away and arrived seconds earlier than another unfortunate couple who had to wait an hour plus before being seated. The food was excellent thankfully, every dish a winner, from the zucchini cakes, to the birria, to the mole, to the romanesco and tres leches, all very flavorful and spot on, including the red malbec. The service very good as well but quite slow, maybe it's the unique pace, but again we were very lucky."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2X01uLTVnRRAB",
            "text": "Another amazing dinner at Cocina Consuelo. I first ate with Karina and Lallo when they still offered the opportunity to dine with them via Eat With and I counted the days until the Cocina Consuelo restaurant opened. This is my second time trekking to Hamilton Heights (or is it West Harlem) from Jersey City since they opened over the summer and they again reminded me why the journey is so worth it. My partner and I ordered  my favorite and their menu staple, the tuna stuffed jalepeno for appetizer. Then, we enjoyed the duck in mole, the romesco cauliflower, and the tortitas de calabaza. It was all divine. The energy in the space is remarkable. There's never a moment I didn't feel at home and comfortable while eating. The service was great, I never felt rushed. The server was knowledgeable about the menu and helpful in making choices. I'll be back as soon as possible for breakfast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYM2NMUU13EAE",
            "text": "This was by far one of the most unique food experiences I’ve had in a while. The food is James beard or Michelins star quality. This a Mexican restaurant with food that has been elevated to a CULINARY EXPERIENCE. The Masa pancake was fluffy…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdk12VHhnRRAB",
            "text": "This quickly became my favorite Mexican restaurant in NYC. The line was a bit long, and I almost considered leaving, but then the gentleman behind me said, \"It's so good, I come here by myself.\" That was enough to convince me to stick around.\n\nThe staff was incredibly kind and welcoming, offering everyone in line a complimentary shot of rum as a thank you for our patience.\n\nThe pancakes and torta are an absolute must-try, and don't miss out on the margaritas! The aesthetic of the place was the cherry on top of the experience. I can't wait to return!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPdWs5LUczZ1pfN3V3RRAB",
            "text": "Don’t walk, run to Cocina Consuelo. The food is amazing. The chef is phenomenally talented: she raises familiar dishes to a whole new plane of culinary sophistication."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfd1pPYnJ3RRAB",
            "text": "You truly feel at home at Casa Consuelo.\nKarina & Lalo have created a beautiful ambience and delicious authentic mexican food!! Can’t wait to come back for the Mole."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfa1A2clFBEAE",
            "text": "My son was raving about this place.  He said it was probably the best food he’s ever had.  We decided to give it a try for my birthday.  The warmth of the owners was unmatched.  You felt like you were at their home for dinner and each plate was served with love and care.  We ordered almost the entire menu and one plate was more delicious than the last.  A great dinner and birthday spent with family and two of the nicest people, the owners.  Thank you for a great night with family and for cooking with love, flavor and intention.   : 10 out of 10!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzOGZhVWpRRRAB",
            "text": "It takes me over an hour to get here, but it’s absolutely worth it. I almost can’t decide now if I’d rather go for brunch or dinner because both menus are so thoughtful and creative. Lots of gluten-free options too. But as good as the food is, the vibe and staff may be the best things about this gem of a restaurant. The owner/chef cares about making everyone feel welcome, and you leave feeling almost like you just had a meal with friends. My only fear is that other people will find out how great this restaurant is, and I won’t be able to pop in for an impromptu meal, but it’s too good of a secret to keep to myself."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdUtIZWlRRRAB",
            "text": "Cozy new spot with fun vibes and delicious food! We loved the potatoes with egg, the masa pancakes and the Caesar salad. Great coffee and friendly staff too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3d3RtMkZnEAE",
            "text": "This newly opened spot, run by a lovely family, feels truly wholesome. The colors, intimate atmosphere, and thoughtful touches with plants and decor make you feel relaxed and welcomed.\n\nFor all the Austrians and coffee aficionados out there, this place offers Einspänners(!). I don’t know of any other spot in Manhattan, and certainly not in Harlem, that serves this historic and unique coffee!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzemFEcGtBRRAB",
            "text": "Karina and Lalo make you feel at home! I had an amazing conversation with them the first time I visited the restaurant for Brunch. The food is amazing and authentic Mexican! Then, I had to come back for live piano on Friday. Highly recommend Cocina Consuelo for the food and ambiance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3Z3E3cHNRRRAB",
            "text": "Very delicious and unique spot for breakfast. Masa Pancakes and the Tortilla con Huevos (pictured) were amazing as well as the Hibiscus Tinga Quesadillas which we gobbled up before I could remember to snap a picture! Coffee drinks very yummy as well!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2el9tM1Z3EAE",
            "text": "Went for brunch and was frustrated by the staff seating my friend and I at a four seat table to share with other patrons instead of an empty two person table (where they placed a party of three surprisingly). I can understand wanting to maximize profit but it sucks that it comes at the expense of customer’s comfort. Besides that, the food was great, the masa pancake was a highlight."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzOHJUUHZBRRAB",
            "text": "Consuelo is a new addition to Harlem’s culinary scene, and it’s clear that the passion of its founders, Karina and Lalo, is woven into every aspect of this restaurant. I first discovered them by attending their intimate dinners in their home earlier this year and their dream has blossomed into a  restaurant that is both a labor of love and a testament to their incredible talent.\n\nFrom the moment you step inside, the decor captivates you with a warm and inviting ambiance. Each detail feels thoughtfully curated, reflecting their heritage and the personal touches that made their home dinners so special ♥️ they even had an ofrenda where I was able to put a picture of my grandma 🥺\n\nThe menu is a delightful exploration of authentic Mexican flavors, including passed down recipes from Lalo’s grandmother. Every bite showcases the quality of ingredients and the care that goes into preparation. You can taste the dedication in every dish. Standout items include the Birria Bone Marrow (in attached videos) and Mamá Chelo Jalapenos.\n\nService is equally impeccable. The staff embodies the warmth and hospitality that Karina and Lalo are known for. It feels like dining with family, where every guest is treated with the respect and kindness.\n\nConsuelo is more than just a restaurant, it’s an experience that resonates with the heart and soul of its founders. If you’re looking for an unforgettable meal, make sure to pay them a visit—you won’t be disappointed!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcmFMNmZ3EAE",
            "text": "Such an amazing addition to the neighborhood! We had the masa pancakes, quesadillas, and chorizo picaditas - everything was amazing 😍 and don’t sleep on the pineapple rosé mimosa - must try! Definitely our new go-to brunch spot."
        }
    ],
    "reviews_count": 80
}