{
    "name": "Massawa",
    "place_id": "ChIJizsMQxX2wokRSD5_pzmhaYg",
    "grid": "MN9",
    "address": "1239 Amsterdam Ave, New York, NY 10027, USA",
    "rating": 4.5,
    "user_ratings_total": 710,
    "phone_number": "(212) 663-0505",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cVdEWlhTSGxpZFVaelpGTTNXbHBFUkdKVlNuYxAB",
            "text": "The whole time here was worth remembering. Staff members are consistently pleasant throughout the meal. The food deserves perfect evaluation. They prepare meals well and they treat guests well. I vouch for the tastiness of the food and the pleasing surroundings."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MldrMUlVRXhyWXpCMlVFRnNaemhzVlhwWlNIYxAB",
            "text": "Delicious and authentic food and the portions are reasonably priced and reasonably sized. Attracts a diverse clientele, not only students from the University. They have gluten free njara for a small extra price."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMFYwdEhlQzFGTldFNGJFSmhUalJKZDBsM2RHYxAB",
            "text": "Great restaurant with excellent service! The staff are so friendly and quick. The food was also really tasty. This is a great neighborhood joint that I’ll definitely go back to again."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NFgzbG1abXR4TjJONmNFWmZZVkZWV2t0bVlVRRAB",
            "text": "We went there Sunday night, waited for a whole hour for our food but nothing came. The servers were chilling there and just chatting. I am super disappointed, never come to this restaurant."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvdFpUbHFWbW93VFd0VVEwRTRjRWM0YWtGUmNrRRAB",
            "text": "Expect an hour and more before you get the food. Environment is nice but the slow service leaves a sour taste…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUE1uTnZlRVZMZFZoRVpIWnhPVU5HZURkYWRtYxAB",
            "text": "Lunch rush extends well into afternoon at this busy eatery. I was especially impressed with their dessert quality. Employees notice subtle customer signals. Massawa impresses with its thoughtful little extras. Strong backing for this place."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjd01XSkJXVFU1T0dOb2VsUlVVSFZLUVVjMFUyYxAB",
            "text": "Casual but chic ambience. Excellent food.  #NYC #Manhattan"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWFMwUjVYMk5DYkRabFNtTjNYMGRuWVRKWFVGRRAB",
            "text": "I loved it so much!! All the food was so delicious and it was probably the best Ethiopian food I’ve ever had! Everything comes on a massive platter of ethiopian pancake. I suggest the vegan sampler, the dahab Beghe, and the Zegeni"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdlIzRlBVbU5ZVFVoaVFYQnRObTVvUjNOVVZXYxAB",
            "text": "I came here for a Sunday night, dinner and really enjoyed the food. For our first experience of Ethiopian food, I enjoyed the flavors of my salmon dish and the red lentils. Ingera bread was tasty and something different. The Samusa was really good, but I did not care for the sauces. My Agave ginger lemonade drink was ok."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVVQyOXRVR2xsYzNsMWVVaFdRMlpqUmpsclgxRRAB",
            "text": "I did not have a good experience with ordering for delivery (through Uber eats). The food did not match what we ordered (they replaced duba with veg sampler). The food came 15 minutes later than estimated (~55min from order to delivery). And the portions are not worth the $26 per dish. (I'm assuming the portions are larger when you eat there.) The food was tasty enough."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NVYxSnBTblZHUVdWVmQySjBhR2RVZG1ZeFQwRRAB",
            "text": "Yelp reviewers were right about how good this place is. Kind, friendly, amiable, qualified. Their menu combines quality and service with sensible pricing. The meals satisfy alongside attentive staff. The experience here is excellent!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcmR6RTVjSGg0U1ZaRFpVUjFZVlJmTlVac1VYYxAB",
            "text": "After hearing great things about Massawa from a dear friend for years, I decided to give it a shot. Last Friday, the two of us shared a trio of sambusas and an Alitcha Beghe entrée. Everything was delicious! We even had to order another pair of fish sambusas, as that was our favorite of the trio. All of the food is 10/10 though we never received napkins, a must when eating injera with your hands.\nOur server was kind and pleasant, but slow and inattentive. She did not give her name, but volunteered her young teen age when we asked for drink recommendations. I received the tasty agave ginger lemonade, instead of the alcohol-based ginger lemonade I ordered. When I did get it, it was pure completely unpalatable. After dinner, we ordered pumpkin lattes with oatmilk. After 20 minutes of waiting, our server returned to tell us that the bartender left to buy oatmilk from a local store and scurried off before we could cancel. It took about 40 minutes to receive lukewarm lattes.\nMy friend loves this place and wanted to share it with me. The food was wonderful, but the service dampened the experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoaVp6RjBSSEZKYkVaSE1VSXpjWFp0WjFOdlVHYxAB",
            "text": "The experience merits many repeat visits. The five-star limit can't express this quality. Workers here delivered outstanding attention additionally. They provide recently prepared food displayed skillfully. This place has become my favorite and could be yours."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CclN6ZDJTM2RDZUZac1dIcGhTSFV3WlZWNFRtYxAB",
            "text": "Very delicious Ethiopian food. We were a group of four, including one vegetarian. The very nice server recommended the goat stew and roasted chicken dish, along with the vegan sampler. This allowed us to try many of the top flavors. It was all delicious. Would recommend to all looking to have a fun experience with Ethiopian food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZek0zQXdaMnRvZVU1RU1sSmlOek40UlRCbmJrRRAB",
            "text": "This is the only Eritrean restaurant in New York City. It serves authentic diaspora cuisine that reminded my Eritrean wife of her childhood food. Can’t wait to go back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UVprRkdTbXgzUlc1aWEweFVXRE0zT0VaMVIyYxAB",
            "text": "This spot had unexpected character. The restaurant delivers consistently. Hospitable, warm, inviting, qualified. The food quality went past merely great. This spot balances all elements perfectly."
        },
        {
            "date": "1달 전",
            "language": "zh",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RU16SnJOWE40TFRZNFdWbE1NMVJqY2tSSGMxRRAB",
            "text": "上菜很慢，食物味道有点特别。"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaVRGOUpVREI0WkhZdGJYYzRUMnhFY2tKeFpXYxAB",
            "text": "Food was out of this world. Vegan sampler for two!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veWJYQTVRazVMTURSUFVDMVNZVEF3WjBvM00wRRAB",
            "text": "everything on the menu from the ginger agave lemonade to the amazing stews and lentils is delish -cannot go wrong. the use of berbere spice is just right. literally cleaned my plate"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoQk1UaHZibUZhV1VSSllVd3pOVnBuZVdneVRHYxAB",
            "text": "My meal here left a positive impression. The informal setting and friendly faces make dining pleasant. The workers here really care about good service. My future plans definitely include more visits to Massawa. Best wishes for your dining adventure."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sd1V6TnBWa0ZVV0c0d05qZGxjRFoyWkRJMlMwRRAB",
            "text": "First time trying Ethiopian food and it was delicious. Only downside is that the wait time to receive the food and coffee we ordered was long."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMk0zZGZkR2xuYkhCaVpFNHpjMFppWWpoR1puYxAB",
            "text": "Perfectly solid Ethiopian restaurant. I enjoyed the food but fairly standard overall"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMkxVWndTRkkxUlc1aVZWTkhibEV0YmxCcFpXYxAB",
            "text": "Delicious food. Had Shrimp Tebsi w/ Shiro for lunch. Carrot cake for dessert. Did not disappoint. Never does. Consistently delicious for years."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kb1NqbExOamRNTW5ZM2RsVjVNR1pSUVVkalNWRRAB",
            "text": "Best ethubian food\nZegney great\n\nCoffee wow macitto"
        },
        {
            "date": "3달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MGIyRlZObmN4VUZCTE5GOVRkWFpUYWpOV2IzYxAB",
            "text": "以前住んでいた所に近くて久しぶりに行くと懐かしい気分になれる場所。高級感も味わえるので、知人やお友達を案内してあげるのも良し、味共に良し。"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MlRIbG1kV1ZGWVd0MFkxSmpkVk50WVhBeVFsRRAB",
            "text": "First time visiting and trying their food. Was super excited, the food didn't disappoint And the ginger lemonade was delicious. Service was not the best and it took time for someone to take our order, I approached them when we needed something."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMlVTMW9hM2RXWW1GMVV6TkZaazlLWmtReGJFRRAB",
            "text": "Extraordinary food, great people and unique experience. Highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJNFEzbEVRWGxQVWpkQlFXRlVOa3MyT1ZVemVYYxAB",
            "text": "Nice place for authentic feel"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201R1JVbEVWekZ1WkdObVkweDVVWGwxUkc5MmRYYxAB",
            "text": "One of ten average Ethiopian places. Definitely have had better more fresh Ethiopian food than this one."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odFQyTjRjMWszWmxKUWRHMDJTVmxvUVhkU2NYYxAB",
            "text": "OMG we visit from Texas I was nervous n skeptical but it was so delicious..if your every in NY give them a try and the service and hospitality is superb."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLSE5pNFNoenF5Z0N3EAE",
            "text": "First, do you think this is worth $26 (without tax and tips)? Plus tax is $28.31, and this still doesn’t include tips yet…\nSecond, maybe they just like to take things slow or they don’t have enough waiters/waitresses, because the wait time is very long. It took me about 20 minutes to order my food and another 20 minutes to see my dishes (totaling around 40 minutes before I can actually eat)!\nThird, maybe it’s just me, but that “bread like”thing is really sour.\nFourth, this restaurant is said to be a halal restaurant. However, they do sell alcoholic drinks. So, I don’t think this restaurant can be considered as halal."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKSzhrTW5WazVXcjF3RRAB",
            "text": "Have loved the Shiro and other food here for 30 years.  One of the first  if not the first, Ethiopian restaurant in NYC."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQV3pxNFdVN3JYd2pRRRAB",
            "text": "I love their food. I also love a restaurant where you're able to hear yourself talk. The food does take time to cook, but who doesn't like their food fresh. While you wait, you can have tea or a  drink. Appetizers if you like. The restaurant has a  dim light setting. The Mgr is always on site. The waitress down to the host is very welcoming. I've been coming here since I was a kid. The food has always been amazing. The weekend is crowded, so reservations are a must."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMLWRnTktYdzlHcFRREAE",
            "text": "I’ve lived on this block for 10 years, I’ve been in this Massawa many times before they expanded, after they expanded, and at their Broadway location many times as well.  My meal today was not at the level I’ve experienced in the past, in fact not even close.  The salmon dish, which I’ve had over the years several times, is always very fishy (only at this location…never fishy at the Broadway location, strange!).  The turmeric lamb is in a sauce that’s very bland and honestly not enough of it, the lamb is tender but very dry, and generally speaking the portions were really not good today…it’s just too little for the price.  The lentils were undercooked and didn’t have good flavor, not near as flavorful as the Broadway location.  I can’t explain it, I’m very sensitive to these differences, something isn’t right about the recipes here.  Not to mention, I distinctly remember having to select two sides per entree and now they only do one.  Why is that?  Idk.  This location needs to step it up because their other location on Broadway is MUCH better, by a significant amount.  Service and atmosphere are still great here though."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWEw0S25pOTZ6MW1BRRAB",
            "text": "My children and I had a wonderful Mother’s Day dinner here. The food is delicious, as if you’re eating a homemade meal and my Aperol Spritz was equally impressive. Excellent service, friendly staff, Mathilda, Gabby, and another server whose name I didn’t get were all so welcoming.and pleasant atmosphere. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPMkZ2OWVHOUptRDh3RRAB",
            "text": "As a Habesha person, I cannot overstate how deeply disappointing this experience was. I had been patiently waiting for my turn to order when I watched a staff member invite someone who arrived after me to order first. After waiting for over an hour—during which I saw multiple people who came in after me get served—I finally asked a staff member about my order. They went to the back and handed it to me without even an apology. No acknowledgment. No accountability. Just cold food that had clearly been sitting around, completely forgotten. Time is valuable, and this kind of service was not only disrespectful but incredibly inconvenient.\n\nBut what really makes this worse is the food. As an Ethiopian, I know what these dishes are supposed to taste like—and this wasn’t it. Not even close. I truly believe injera wasn’t made from authentic teff flour. It completely bland and missing the signature sour bitterness of true Ethiopian injera (which is unstable to any Ethiopian!!!!). The dish I ordered tasted like a watered-down, gentrified, whitewashed version of traditional Ethiopian food. The rich, distinct spices and flavors that define our cuisine were completely absent. It felt like an imitation made for people who’ve never had the real thing and wouldn’t know the difference.\n\nGiven the cost, the quality is downright insulting. I’m genuinely upset and cannot recommend this place to anyone. It’s a waste of money, the service was unacceptable, and the food simply sucks—trust me."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOQzc1WUNNd2NHWXB3RRAB",
            "text": "The veg sampler was delicious and very filling!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQcnJrYjMzMS1mSDZRRRAB",
            "text": "Portions too small for the price"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbU5DekpnEAE",
            "text": "Here’s the thing: the food is always tasty, the server was very polite; WE WAITED AN HOUR FOR THE FOOD. My father is visiting from out of town and we both had plans we had to get to. We ended up getting our food to go because we needed to leave by the time it came. So I’m very conflicted because I’ve had a great experience in the past. Again, the server was very nice about it and didn’t seem to have any control over the situation. I’m very hangry."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOVlTYlp3EAE",
            "text": "Amazing service. Beautiful decor. Incredible coffee."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc2ZPSDRRRRAB",
            "text": "Really cool vibe and the food was amazing. So we're the drinks. Definitely coming back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMWYtRWRREAE",
            "text": "I specifically asked for a super-spicy lamb stew and the dish came very bland, plus we had to repeatedly ask for water and the ordering by phone was painful and unnecessary"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcW9EMEdREAE",
            "text": "If you like Ethiopian food this is the place to go. Food is divine. Good cocktails too. Go before 7 for $9 specialty cocktails. The meat and vegetarian combos were both excellent. The Fava bean dip is divine."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3al9yUUx3EAE",
            "text": "The food is bland and very expensive - especially compared to the fantastic alternatives nearby (Awaze and Abyssinia). It tastes like bland gentrified indian food - none of the intense flavourful spices you get elsewhere. Feels inauthentic. I guess it caters to gentrified tastebuds, but is definitely not my thing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NlBtMHdRRRAB",
            "text": "I’ve been dining at Massawa’s since the 1990s. My husband and I loved the original restaurant (except the bathrooms). We were thrilled the place reopened after a long hiatus for renovations. Overall, the food is still very good — but portions are considerably smaller; the spiced tea is bland and barely tepid; and some prices are too high (a bottle of sparkling water is $7.50 and two tiny sambusa are $9). The atmosphere is nice but lacks the warmth of the old place. Service was also lacking, especially as we ordered through the app — which I do not recommend as we ended up having to mix our additional sides onto the injera tray.  $120 for two was more than we expected to spend (no alcohol or dessert) but will go back as the food is well-prepared. We will just order differently."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNGZpOVJREAE",
            "text": "good service and food. a bit on the expensive side so don't know if I'd come back. it's more of an elevated dining experience"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURna29MMmNBEAE",
            "text": "delicious, I had the Tebsi Derho"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNmY3Zm1nRRAB",
            "text": "Abraham is a remarkable host. Generous in his hospitality and warmth.  The food is exceptional.  A must stop every trip. Every offering is a banger! You must go again and again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcU96ZkhREAE",
            "text": "Great food. Eat with your hands off injera. Good date idea. Nice ambience"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmeUlya2N3EAE",
            "text": "Never misses"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNk9Yc1JBEAE",
            "text": "the restaurant is SO CUTE. would be good for dinner dates. each table has each flowers and the dotted floral decorations to well with the woody feel of the atmosphere. so worth coming by if you’re in the neighborhood.\n\nthe food overall was rlly good. i particularly enjoyed the samosa (2 sauces were very flavorful) and the garden salad (the dressing is light and goes perfectly balanced with the watermelon blocks and arugula). the ginger coffee was interesting and very strong."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cmVxakNnEAE",
            "text": "Nice restaurant, food delicious  - the items we ordered were actually similar to (home cooked) Indian  - but less spicy - especially the lentil dishes and the Sambusa (similar to an Indian Samosa).\n\nLovely drinks  - especially the Honey wine and the cocktails we ordered were decent too (see the picture of the receipt for the details).\n\nOnly feedback would be:\n\n1. The Chicken and Veg Sambusa - we are existing mixed Sambusa (instead of one chicken one and one vegetable one - if we knew we have just ordered the chicken ones.\n\n2. The Veg sampler was delicious but we felt a little pricy for the amount of food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbnJEcXdRRRAB",
            "text": "Such a lovely place with tasty food! Has an outdoor protected from the wind area and quite large indoor space. We ordered a vegetarian sampler with lamb and salmon and it was way enough for two people. We could not finish the food but it was so good, especially spicy lamb! We also tried a rum cake which was just ok but then i do not have a sweet tooth so perhaps sweet lovers would appreciate it more. I have to say that the menu has many drinks options ranging from mimosas (for those who like festive brunches) to different teas and coffees. I highly recommend this great food stop and will be back myself for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqc2R2MXlnRRAB",
            "text": "I never tried Ethiopian food until my girl put me on a few weeks ago. This food slaps my taste buds around in so many ways lol. It’s a unique cuisine and I would def recommend trying it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb3Y2QUlREAE",
            "text": "My friends and I went there for drinks. They have a decent selections of cocktails. We got the African rose, Bellini, and Mangotini which didn’t disappoint. 🥂great service and atmosphere. Plus, you can order and pay on your phone!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobWRlTFhBEAE",
            "text": "Food 5/5. Everything was flavorful and big portions. The space is nice and good for a date night or a bigger group. -1 star as some of the items on the paper menu were not on the digital ordering menu but our waitress was great and helped remedy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGcXNyM3hnRRAB",
            "text": "Very delicious and affordable Ethiopian cuisine.\n\nWe went in as a group of 4 for the lunch special and food was delicious. We had the spicy beef and the spicy lamb with collared green, potato stew, cabbage, chickpeas, and red lentils for sharing. You have the option to have individual plate or sharing a plate.\n\nThe fermented injera is fluffy like steamed rice cake and with a bit sharp sourness to cut through all the spices to balance the taste.\n\nI think our favorites are spicy beef and chickpea. I ordered ginger coffee, which was quiet unique.\n\nAlso an highlight: the rum raisin cake is very very very strong in rum. It is a huge piece soaked in rum and alcohol lingers on the back if the tongue. It is very delicious but I won’t eat it if I needed to work in the afternoon.\n\nService is a bit slow. You scan QR code for ordering and for paying. Price is very affordable for what you get. It is on the side of Columbia campus and it is one of the best Ethiopian places to eat in the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOMnBPV1lnEAE",
            "text": "Incredible Ethiopian food in a beautiful restaurant. If gluten free make sure to ask for the pure teff injera - soooo good. We had the vegan sampler, ful (fava beans) and spicy lentils, as well as spicy tea, coffee and rum cake. Everything was delicious and enough for 3 people. So many vegan options!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNk96Q253RRAB",
            "text": "Fantastic food. This is my first time enjoying ethiopian food and I have to say, it was worth the wait. I really enjoyed eating with my hands! The protein plate to share was amazing.  Definitely coming back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacExmdldBEAE",
            "text": "Wonderful, well-spaced ambience with beautiful Ethiopian food. I was ambitious and had the Ethiopian iced coffee for dinner & did not regret it at all.\n\nWe chose all of their sides, and had both the chicken and veggie sambusas as a starter. Heavily recommend either or a combination of the two. Wonderfully lit at night and excellent service near closing time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtOHVuT1NnEAE",
            "text": "The food was delicious! I would definitely return and recommend a visit to Massawa. My friend had the lamb, my son had the shrimp and I had the salmon. All came with with white rice and a potato dish that consisted of carrots and cabbage. My friend ordered  okra with her meal which I sampled and enjoyed. I had chick peas with my dish, it was pureed and spicy by choice. I sampled my son's shrimp and decided if I return I will order that, not that the salmon isn't worth ordering again. The shrimp dish had a somewhat sweetness to it. The restaurant setting is nice and intimate. We ordered just after 3pm and was still within the lunch window. The three meals and two cups of tea cost $61."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYajUyUDB3RRAB",
            "text": "Nice clean place with very convenient ordering and payment through Toast; everything we tried was very good, but a little on a spicy side"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsdzktWlNnEAE",
            "text": "I love Ethiopian food and this spot does it great. It can be kind of a trek to get to this Morningside Heights spot if you don't live in the neighborhood, but this place is worth it.\n\nThe best way to enjoy your meal here is with shared plates on top of injera bread, which is how Ethiopian food is best eaten. If you're a party of two, I would recommend getting the vegan sampler and pairing it with a meat dish. The tebsi beef is my favorite, but the other options are good too. Pair it with a Habesha Ethiopian beer and you won't be disappointed."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dnZHenZnRRAB",
            "text": "High quality and incredibly flavorful food. I was particularly impressed with their vegetarian and vegan meals. The freshness of their food was outstanding. It’s always a pleasure coming back to this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcV8zdDdnRRAB",
            "text": "Lunch plate was a great price for a healthy portion of rice (or traditional bread), meat and two sides. The lamb was just right with a bit of spice that added a depth of flavor but was t overwhelming. I would definitely come back to try some of the other items, I was interested in the beef stew as well! Very cute decor and ambience, good for dates as well"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcjlHYWdBRRAB",
            "text": "We have decided to quit going here because they stupidly change the amount of food you used to get. Just a joke portion of lentils and a small portion of meat is 28$ dollars. 🙃\n\nI mean are you serious? They also charge you for an extra side at 7$\n\nDinning here became extremely overpriced. Sorry but not coming here never again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OHMyNzdnRRAB",
            "text": "The atmosphere is beautiful and the wait staff are very nice.  The 3 stars are only for atmosphere and wait staff.  I have never had Ethiopian food before and I went here because of the reviews, but the food had no flavor at all.  I was prepared to have an explosion of delicious flavors and was extremely disappointed and actually very shocked.  It was honestly the most bland food I’ve eaten.  The person that came with me had Ethiopian food before and told me she’ll take me some place else for the real experience.  I ordered the chicken and she had the lamb."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeUpXLTBBRRAB",
            "text": "We ordered the spicy lamb and the non-spicy chicken to share. The sides and the Injera bread tasted great, and the place had a happy hour. The lady who served us said that the restaurant had been around for 35 years, and I can see why. The place is popular for good reason, and an excellent place to visit and enjoy a good meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIX19mYnZnRRAB",
            "text": "Wonderful and personal feeling. We got great recommendations from the servers in the 2 times we were there, and they’ve all been great! The split pea really stands out though!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHb3MtbjJnRRAB",
            "text": "Excellent Ethiopian food, I found it to be very close to Indian cuisine. The use of spice in the food was good and the Injera (was like dosa) was tasty as well. Good ambience and friendly host. I hear that the restaurant has been there for over 30 years. Good going, that 👍😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bkpySFlREAE",
            "text": "BEST ETHIOPIAN FOOD IN NYC!!!\nI have tried to find a better place in the city and this one is still my favorite. The food quality is beyond exceptional and the injera has an amazing flavor. Service is incredible as well! Highly recommend!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeTdLV2lnRRAB",
            "text": "The food was delicious!\nwe had Silsi Derho, it was really good and Ethiopian coffee was on point. Sambousa was good as well.…"
        }
    ],
    "reviews_count": 72
}