{
    "name": "Hamilton's Bar & Kitchen",
    "place_id": "ChIJfeGy52L2wokRzh1E8y2l2MU",
    "grid": "MN9",
    "address": "3570 Broadway, New York, NY 10031, USA",
    "rating": 4.3,
    "user_ratings_total": 551,
    "phone_number": "(646) 559-2741",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVlRGRm5UMWxUZUZFd01uazNVa0k1U21OQlMyYxAB",
            "text": "Hamilton’s Bar and Kitchen is absolutely amazing. We've been coming here for years, and they always treat us so well. The food is excellent, the drinks are tasty, and the staff consistently make you feel welcome. They recently hosted a birthday party for us, and it was an absolute blast. Everything from the atmosphere to the service was perfect. It’s the kind of place that keeps you coming back again and again!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQ2RVcHVZVXBLYUVSaGJXczVhbDlCVjNkc2RXYxAB",
            "text": "Their food makes you happy without making you poor. I enjoyed every bite of my meal. A well-kept interior with nice touches. The service people were attentive enough. This spot delivers a complete experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVNU9GWkxRVXhQV1dwZldXVnlXVnBvWDFsdFFWRRAB",
            "text": "Hamilton's is the best place ever! The drinks are great, the atmosphere is a vibe, the staff are truly amazing and the food is wonderful! I enjoy their wings, garlic truffle fries, calamari, and passionfruit margaritas just to name a few. Sometimes I even have the lemon drop martini which are also wonderful. Fridays I enjoy listening to live jazz there. I recommend Hamilton's 100%"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUVVIbGphV0ZhWTBkSlVFOXJRMU5aU1dkZlpsRRAB",
            "text": "Experience was wonderful, bartender was polite recommended this drinks ... I'm in love will be back for sure"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cWRGRjRia1ZITkZKbFpqVkxTbWhKTlhoWVRsRRAB",
            "text": "Very pleasant atmosphere good and friendly service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa1NucFpjbTQzV0VOWU0wWm5aM3A0YUZSSWRuYxAB",
            "text": "My expectations were met completely by this long-awaited visit. I had a fantastic time at this place! The team's service elevated our dining experience. The must-try items here deserve their status. Stop considering and start experiencing!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUFVucDVlVVkzVkZjMU4zWXRSR1I1WVVoTFMyYxAB",
            "text": "I had a really disappointing experience here recently. I tried to walk in for brunch, excited to try the place out and support the business, but was stopped at the door by an employee named Jorge simply because I had an iced coffee in my hand that I had purchased elsewhere.\n\nI was planning to sit down, order food, and be a paying customer — but instead I was told I couldn’t come in unless I threw away my coffee. That kind of treatment makes absolutely no sense. I understand if someone brings in a full meal or something disruptive, but a single iced coffee? That’s not a reason to turn away a customer.\n\nThe way Jorge handled it came across as unnecessarily rude and unwelcoming. There are far better ways to approach people if you have a policy — assuming there even is one — but frankly, policing someone’s beverage choice at the door is just bad hospitality.\n\nI ended up taking my business elsewhere, and I don’t plan on returning. If this is how they treat potential customers, I’d rather spend my money at a place that understands how to treat people with basic courtesy and common sense."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMDVmdmhBRRAB",
            "text": "A true amazing brunch place in Harlem! The stuffed toast and the home fried that they have are absolutly delicious. Get the ponche or hot apple cider with borboun if you don't have anything else to do after that. It will nicely hit you."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcUpySlRnEAE",
            "text": "What a great neighborhood spot! Came here for brunch this morning. The chilaquiles were amazing! Taste as good as homemade.\n\nLook forward to coming back to enjoy happy hour!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOHFhQTh3RRAB",
            "text": "We came for drinks and had an amazing time! I highly recommend the Morras—a special blend with secret ingredients that takes it to the next level. The bartender was incredibly nice, and the service overall was outstanding. Definitely a must-visit!."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2anNDNVNBEAE",
            "text": "TOP TIER, EXCEPTIONAL cocktail quality.  The bartender is truly one of my favorites in all of NYC.  Food quality is also good.  As long as the main bartender is here, HB&K will be consistently an uptown go-to for me\n\nAlso, 12-8 happy hour 7 days a week doesn't hurt!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcHA3LVdBEAE",
            "text": "I came here from out of town with my best friend and it was absolutely wonderful. The margaritas were one of the best we’ve ever had. And the food was to die for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNTlEbElREAE",
            "text": "Hamilton’s is my neighborhood spot.  The coffee is amazing, plus they have a great selection of beer and wine, as well as an outstanding cocktail menu.  Their food is fresh and delicious.  They get their seafood fresh daily and the veggies are fresh and delicious too.  Also, they have amazing hot beverages, including espresso, chai, and hot cocoa.  Last but not least the staff are super kind and friendly.  Hamilton’s is my home away from home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcWJQLUhBEAE",
            "text": "Awful food . They keep getting different chefs - how difficult is to cook a hamburger ? ( meat questionable ) . At this pace - difficult . Well done and burned . Quacamole - soaked in lime, sour."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURua2ZfTWpRRRAB",
            "text": "Super buena atención por parte de los chic@s,variedad en mezcales lugar muy cómodo y acogedor recomendado 100 %."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudkpMS1pnEAE",
            "text": "Happened upon this spot by accident, jazz on Friday night's make it worth dropping in. Happy hour til 8pm. Going back soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURILWZmZVVBEAE",
            "text": "This has become one of my go to spots in the neighborhood. Great food and ambiance, and they have an amazing mezcal/tequila selection for tequila fans like myself. They also have really good happy hour specials. I definitely recommend checking them out!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNEttX0F3EAE",
            "text": "Good food, excellent service, low prices, cozy tungsten hues! Independently owned and the best happy hour on the block."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dFpTZ2dBRRAB",
            "text": "Before I ordered, I asked my waiter if he would give a glass of water to the singer who was performing at the restaurant because she had made a request for a glass of water. The waiter returned with a menu and I thought maybe he had misunderstood me and I repeated if he could get a glass of water for the singer. The waiter told me not to worry about it.  I told him that I was not worried. I'd simply asked him to get a glass of water for the singer. To my knowledge, he never got the glass of water for the singer.\nNext, I ordered a Mexican Mule drink(which was great ) and a spinach and artichoke dish which I did not like (there was very little spinach in the dish and it just did not taste good). When I told the waiter that I didn't like it, his response was \"No one else had ever complained about it\" and then he took it away. Not asking if there was something else perhaps I would like. Actually he did not engage with me again until I asked for the bill.\nBETTER BAR THAN KITCHEN!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyX2JEZUtBEAE",
            "text": "Hamilton Bar + Kitchen is such a hidden gem!! They have the BEST cocktails and you can’t beat the daily happy hour. Their bloody mary mix is homemade and is one of the best i’ve had in the city, and the margaritas are so refreshing. The bartenders are very kind too, and the vibe is great whether you’re with some friends or alone. I can’t wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMek1UdkZnEAE",
            "text": "Hamilton’s Bar & Kitchen is a gem of West Harlem. This is my go to spot in the neighborhood for drinks. This bar focuses on a wide variety of cocktails with an unbeatable happy hour from 3p-8p everyday. Took a group of my friends here for my birthday and they raved about their espresso martinis. Service is great here. They will take care of you, so feel free to introduce yourself."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MXFDUmRREAE",
            "text": "Nice Jazz music"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1ejkyNTlnRRAB",
            "text": "Great brunch menu on weekends. New cocktail menu. Live local jazz every Friday evening."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENTRmZVRnEAE",
            "text": "Nice people, cool vibe, I had a good time! Will come back for music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MU1hWk5BEAE",
            "text": "Not a bad spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROa08zU2VREAE",
            "text": "Came for an afternoon delight. Great  service and good company"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdW9qLXNRRRAB",
            "text": "It’s been a bit empty when I’ve gone, but that has been during the day. The staff and service is great, the drinks are perfect and the food is really good. Even the mocktail they serve (pictured), which is a cucumber something, is very delicious. I got mine with alcohol this time and it’s perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscy1uNGJnEAE",
            "text": "Good food and drinks"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGaDcyVUdREAE",
            "text": "This was the first time my coworkers and I went to have lunch here and it will definitely not be the last one. The food was delicious; quality, presentation and service. Keep the good job!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1d3NydHlBRRAB",
            "text": "Calm and comfortable atmosphere, friendly and attentive server, food came out timely and beautifully presented. My spicy margarita was exactly what I wanted"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacjVfdTZ3RRAB",
            "text": "I usually get takeouts at this place and it's usually hits or miss. I advised you to not go here expecting good service if you're a black person. The way me and my sister were treated on multiple occasions was disgusting. They treated us awful and were blatantly racist. There is one server who's simply amazing. She's great. But besides her, from the multiple instances where I went hoping to see her and unfortunately seen other employees, I had awful experiences. I will never set foot there again though their food if decent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweFB6b2NnEAE",
            "text": "Food was good and the service was lousy. I was the only one in the restaurant in the late afternoon and was paid no attention.  Went to the bar to order drinks and food.  Self service atmosphere while waitress sat at the bar on her phone. Expected more. Disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeGFYV2dBRRAB",
            "text": "This place has really declined and it has the most bizarre no laptop policy so if you are going for a working lunch I highly recommend going somewhere else, great options nearby"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKa2VidjBBRRAB",
            "text": "Muy profesionales y atentos"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMXZ1bkVnEAE",
            "text": "Delicious brunch - the blueberry pancakes and omelet with potatoes were perfect!\nDefinitely coming back! Thank you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdmNXSUx3EAE",
            "text": "Quiet spot in a row of other restaurants and bars. We had the BB Lemonade, crab cake sandwich with mashed potatoes and string beans.\n\nThe drinks were delish, could taste the alcohol but still sweet. The food was decent but my preference was for it to be more flavorful.\n\nThe waitstaff were friendly and attentive. On the bar is a huge sign that includes the post “no laptops”. 🤷🏾‍♀️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKemVlaFFBEAE",
            "text": "Burned Waffle's, pancake's &  no syrup. under cooked chicken. I would never order from here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKN3VPeXVRRRAB",
            "text": "This place is a best kept secret.  Located in Harlem on the far west near Washington heights.  146th & 147th and Broadway.\nThe food is exceptional the staff is wonderful, Vanessa, Marianna, Phillip and the Chefs/BOH.  Forgive me for the names I didn’t mention.  This place and the staff as a whole deserve many Thanks.  I began coming here in May, 2023  The drinks are great and the food is delicious.  Thank you BOH/Chefs, Thank you FOH staff../.\nPlease, give this place a try, from a expert, I have been in this business of hospitality the past 20yrs, Server/Manager in fine dining.\n\nThank You,\n\nMrs. Jones"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bmVPT3R3RRAB",
            "text": "Great spot raising the bar in the area"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aGNYX2dRRRAB",
            "text": "Really good food. Great coffee!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5eWNfNGR3EAE",
            "text": "Great staff"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMTc3U1FnEAE",
            "text": "Great space, staff, food and beer. Loved the specialty cocktail for Cinco De Mayo. Decent prices and portions."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMkl2ZV9nRRAB",
            "text": "The ambiance is calm and refreshing, very clean space. I love the music. The staff is friendly. However, the service is on the slower side. I sat at a table (3) and we got our food in 40minutes. That seems like a long time for the anticlimactic flavor of the food. I got the soup of the day, which was nice. The smoked salmon club is okay.. needs work. :( — Mimosas are yummy, I got the hibiscus flavor! :) My favorite part of this meal was the toast that came with the soup. I personally wouldn’t recommend this place to friends, but it’s nice to maybe get a bite and catch up with someone."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0eU0zOFRnEAE",
            "text": "Came in here for a quick treat for the kids. Did not have more, so I cannot give a full review of the food or coffee. The cinnamon roll we had was good. I can say that this place has a ton of room. It is also very cute and clean. It has bathrooms. Oh, and the staff is friendly. Prices are average."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MXVqVjVnRRAB",
            "text": "This is a nice space to chat with friends over brunch or to spend some time working in their cafe area. They are very friendly and their service was quick. The atmosphere is comfortable and friendly as well.\n\nTheir menu is varied and has many different options, which is always good.\n\nTheir hot chocolate was phenomenal.\n\nTheir meals were a bit small for their price, and the taste wasn’t as great—but still good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5akxHT01BEAE",
            "text": "A cute little spot! While these aren’t the biggest breakfast portions you’ll find, you can taste the attention everything got. The potatoes are soft and crispy, not at all like the wet, mushy ones you’ll find around. The French toast is…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNCdnRBNxAB",
            "text": "It was a nice small vibe set up. Wooden floors and tables. Service was a bit slow for a place that was practically empty but well worth the wait. Staff was very friendly. I had a Broadway Burger. Was pretty good. Blackberry Bourbon lemonade 🍋 was on point. Had 3 of them. Overall excellent place to dine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdUlXUDl3RRAB",
            "text": "My longtime friend Celebrated her birthday there on October 27th. It was really nice,the waitress was Amazing 🤩. She took care of the Party people as well as the other patrons that were there. The music and drinks were really good. I even took a picture with the Halloween setup ,who we named Roger 😉. We're definitely coming back soon."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnellPUDd3RRAB",
            "text": "Ummm let's be real, a cafe/bakery with awesome food, beaucoup space and wifi for paying customers... Gold. The staff is friendly the space is beautiful. Had one of their cold sandwiches but wishing I had tried one of the pastries- perfect reason to return. Definitely recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1czZmUDhRRRAB",
            "text": "The sign said live jazz every Friday and they weren't kidding!! I stopped by last week and they had the best live music I've heard in a while. The atmosphere itself was nice and lively, it really was a great place for jazz. I was also pleasantly surprised with the drink menu;  I got the mezcal and recommend it! Definitely coming back soon!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcnJYTjhBRRAB",
            "text": "A great little bakery in upper Manhattan.\n\nDelicious concoctions include nutella cinnamon bun, babka, and bundt cake\n\nThey also have a great space for working right next door.\n\nIf you stick around for happy hour there are beers too!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJalptRENREAE",
            "text": "Usually a favorite but despite checking online they are still closed. They took the notice off their website but don’t be fooled. They are closed.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZOTRYNkZnEAE",
            "text": "Fantastic barista and crew. Made us welcome straight away in a new neighbourhood where we were staying only a day. We tried the ‘nest’ assortment of bacon/egg breakfast and was great. The coffee was gooood!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXb0puSUN3EAE",
            "text": "I had breakfast there today and it was beautifully presented and tasted good.The server was also nice and the place looked clean and beautiful.I would come again"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbTRmTDRnRRAB",
            "text": "I've been here several times for coffee and baked goods. The cinnamon buns are amazing. Quite a bit of seats and tables including a nice little area upstairs."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNzlTcEZBEAE",
            "text": "A wonderful place with a great menu: my personally favorite is a breakfast menu! Very attentive staff and lovely music."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbUtfa1VBEAE",
            "text": "Ordered the Filled French Toast with Sausage and it was great! Great staff.  Shaded outdoor dining and dog friendly."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRazRHaDB3RRAB",
            "text": "Buen café y buena pastelería. Ojo cuando pidan capuchino solo lo sirven en tamaño pequeño"
        },
        {
            "date": "수정일: 3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1Ny1qaEhnEAE",
            "text": "Todo muy bueno. La comida estuvo buena y es en el área. Buen ambiente. Hermosa decoración!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtOWVuMFJBEAE",
            "text": "Jazz music every Friday and good food. If that doesn't make you happy, I don't know what else will."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2dnBfeGFnEAE",
            "text": "Had a very delicious lunch here. I enjoyed the egg white and veggie omelet while my friend had the Texas burger - the burger patty was huge! I was pleasantly surprised at how good the food was. Only downside is our server forgot about us…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSalBlOFJ3EAE",
            "text": "The atmosphere is good and the vibe during the day is good but the service and food are substantially worse compared to environment. I order the steak n eggs and my son got the French toast. Not only did the food take very long to come with only three people at the restaurant but the waiter was very disrespectful, and didn’t’ care about my request literally turning their head away when I asked for some sugar. My steak was over cooked while my eggs were under cooked. My sons French toast as he described it,” awful bread choice, not soaked enough, and cooked at to high of a temp”. Wouldn’t recommend this place to my worst enemy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlazkyVTZ3RRAB",
            "text": "A new gem I found. I can say I love this place. Literally everything about this place. The staff is exceptionally friendly and attentive. I will take the 20 minute drive for some a lemon drop and calamari with a side of blue cheese. I’ve…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMllxQ0dnEAE",
            "text": "Today was my first time coming into this bar/kitchen. After living in this neighborhood for more than 20 years. I can honestly say that from my brief encounter everyone should avoid this place. I had an honest human emergency and asked to use the bathroom. I stated to them that I would buy something but I needed to use the bathroom urgently. They made me order something from the menu and pay first before allowing me to use the bathroom. All while speaking very rudely about past customers doing the same and not paying. If you are looking for humanity and good customer service, this place is not for you. Maybe if they had let me use the bathroom and then pay for whatever service I’d chosen, I’d feel better and stayed for an actual drink."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNXM2MU9nEAE",
            "text": "We stopped by for some breakfast, but this is also a great place to sip on a coffee and work. The decor and staff were wonderful. The \"bird's nest\" was really delicious, and I'll be coming back just for that. We also tried the sticky…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlN19HSjN3RRAB",
            "text": "This is honestly such a hidden gem in this neighborhood…I hesitate writing this review because I feel like it’s my little secret but I also need everyone to know how lovely, clean, peaceful, and REASONABLY PRICED this place is. It’s actually difficult for me to walk past here from the train and not detour into the bar for their insane daily happy hour on liquor, wine, and beer, (which lasts until closing every day of the week except Friday). Anyway, highly recommend sprinting here because it is the best. Yummy food too."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxd2VfYTlnRRAB",
            "text": "I loved this restaurant!  The outdoor dining is perfect - well-shaded and dog friendly.  Excellent wait staff who are very personable and attentive to everyone's needs.  I had the Hamilton's Omelette with fried potatoes.  The sausage in the…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlX2Q3U3pBRRAB",
            "text": "Me encanta ! El servicio, las bebidas , el ambiente , la comida. 100 !!"
        }
    ],
    "reviews_count": 68
}