{
    "name": "Pisticci",
    "place_id": "ChIJxXmxz0H2wokRwYJIJ7aBB3s",
    "grid": "MN9",
    "address": "125 La Salle St, New York, NY 10027, USA",
    "rating": 4.5,
    "user_ratings_total": 1478,
    "phone_number": "(212) 932-3500",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cUxXVnVVV2hXWmpWTlJGOXRTazlXWjBWUmVGRRAB",
            "text": "Bad vibes. The food is okay and the service is bad. They treat us with disrespect every time we come here. I asked if they had fries and our server said “no but you can try McDonald’s” that was just one instance of bad service. Have given it multiple chances and tonight was our last straw. They seem to prioritize the older guests. It is a treat to eat out in the current economy and experiences like this make you regret wasting money on a place that treats you disrespectfully."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWZldqVjBORnBQZFRSd01IWmhWV2xETUZCTVdIYxAB",
            "text": "My group (total 12, all around 60 years of age) and I have not been there for a while, at least a couple of years, but everything was great, really great: the ease of making the reservation by phone; the friendly greeting we received when we walked in; our sensational waitress (Grace?); the other servers and busser; the space is not too noisy; very good house wine can be ordered by the carafe; and the food across the board was terrific. I had the ravioli special and it was one of the best dishes I’d had in a long time.\n\nMy only beef? Specials are mentioned without prices. I think that should change.\n\nBut really a great experience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVVFYbzJabGgyYXpOTmRVc3piRWxFYjNOUlRWRRAB",
            "text": "We came with a party of three to Pisticci on a busy Wed eve but were seating right away. This was our third time trekking uptown and boy is this place worth the trip. We had the garlic bread,  steamed mussels in spicy tomato sauce, and a special salad with Goat cheese feta and prosciutto for appetizers (all mouth-watering delights). We also had two artichoke appetizers which were disappointing after they were lovely on a previous visit. Our mains were all fantastic: Halibut special, Chicken in Sage and Orecchiette with Broccoli Rabe and Sausage. I’m a huge lover of the Orecchiette dish and have ordered it many times in many restaurants all over the city. This one was possibly the best I have ever had!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeVVHVjJXVWgzZEhkRlkyRm1TbkUzU0ZKcE0zYxAB",
            "text": "A decent Italian restaurant near Columbia University. Convenient and good food. The dishes were mostly delicious, not at the level of some midtown/downtown Italian restaurants, but certainly great for this part of town. Service was mostly good, except that I had to wait 10+ minutes at the front while the hostess was on the phone taking orders of a takeout. She could have easily muted the phone and told me to wait a while to be seated. But whether if it was the lack of experience or that she just didn't care about customer service, she just ignored me until the take out order was done, all  without a word of apology."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weWEweFVSRGt6UW1NMmVHTnJTbDlxYmsxT01rRRAB",
            "text": "Very cozy vibe with amazing food. Our server Katherine was a delight. My partner and I had a wonderful time eating here!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRE1tZEtkME5hVURRelMzcGFjMEpCU3psTldWRRAB",
            "text": "I love this place so much. Top 5 NYC restaurant in my book. I've been coming here for at least ten years, and I regularly make the trek up from Brooklyn just for this place. It's got the perfect friendly neighborhood feel, and every single thing that I've tried has been fabulous. They've got the best garlic bread in the city (the goat cheese is a must!), and their simple tomato sauce is SO good. A small menu that's done so well. I've come for brunch, lunch, and dinner, and I've truly never been disappointed. I love that there aren't any bells and whistles; it's simple food in a relaxed environment that might not impress the influencers, but satisfies the locals every time!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wb1dUZEpObEoxYWxJeU5XOU9TRnBKV1hWRWFXYxAB",
            "text": "Some colleagues and I went for dinner on a Sunday night and had a lovely experience. The space is warm and inviting with a pleasant noise level (conversations could be had and heard, and the music was a whisper in the background). Service was friendly, funny, and knowledgeable. Food was yummy! Dinner items ordered included:\n\n• Beet Salad (baby arugula, beets, toasted pistachio, goat cheese, tomatoes & drizzle of balsamic reduction)\n• Seafood Special (Spaghetti Provençale – Served with mussels, clams and shrimps in a garlic white wine lemon spicy sauce)\n• Rigatoni alla Vodka (vodka, cream, tomato, parmigiano and a little bite of spice - substituted gluten-free penne)\n• Maltagliati With Ricotta, Spinach and Lamb (broad noodles coated with a juicy lamb ragu, kept light with ricotta)\n• Desserts (sorbet, tiramisu, coconut cake, and cheesecake)\n\nAll I can say is, every plate was scraped clean!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWR1VUWlNXVlJNVFY5V2JGRlVPRnBPVjJ4NVowRRAB",
            "text": "One of the best Italian restaurants in New York City. Excellent service, comfortable atmosphere and exceptional food make this a real find. It is reasonable to."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRVFtUnJUMlZ2VVRkM1JUaHZPR1pYZFZKYVlXYxAB",
            "text": "Never disappoints! After 11 years in NYC Pisticci remains one of my top restaurants here. Spaghetti with red sauce is always perfection."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poT1puRk1VVzk0TlVoVFQwdEJkelJrYjFORGRGRRAB",
            "text": "The food is SO GOOD. We have a hard time choosing and always make sure we all pick different things so we get to taste a bit of several dishes. There's a peach salad special that we just had this past weekend that was incredible. The maltagliati is something we have to order every single time we go, without fail, because it's delicious. And the steak is always cooked perfectly. They're very accommodating whether the group is big or small, and the atmosphere is really nice for a gathering."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUlpEWndRWE5tWXpOMFIybENYM2x4WkUxc2NIYxAB",
            "text": "Everything was good here! We had the seafood pasta, the mussels in sauce, the tiramisu and margaritas. The waiter was super friendly and it had a nice atmosphere. Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMWVYQktiV1ZJTkZaR2VHZDJZVEI0YWt4c1FtYxAB",
            "text": "Amazing restaurant ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWM1JsRTRiMEUzYm5sVk5ISm5lbFZMY2pSYWFrRRAB",
            "text": "Close to my son's college. Easy to be seated, food was delicious.  Service was great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdExYWk9TREF4TFU1WVoycDJjREJqUWpab1QwRRAB",
            "text": "Had dinner there over the weekend and the service was great as was the pasta special with seafood. The first room was a bit too bright so they graciously dimmed the lights. Only thing that dampened our mood were the loud girls at the next table. All the other tables were filled. Wish they could dampen the noise but as I live on the block I will always call this place home. 23+ years running! Keep up the good work!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toS2EwcGZhMUkwYlhCRmQyaHpjbWx3VUhSVU9YYxAB",
            "text": "The mussels looked amazing when we were there, but didn’t order. The peach salad was very nice, a special. Don’t hesitate to ask the prices of the specials. The recent chicken parmigiana was $35 as a special, very high for a pretty ordinary…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKclN6aHRSM1ZrWTNGbVpWWm5WazAyVlRaNlMyYxAB",
            "text": "One of my absolute favorite restaurants in all of NYC. We even travel in from Brooklyn when we're visiting!\nThe atmosphere just feels like Italy and the food is straight out of someone's Nonna's kitchen for sure."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JdE5rcEpkMVJuVWw5bGQyWXdVaTFaY0dOTkxWRRAB",
            "text": "Food and atmosphere were great.  Super fresh ingredients. Topher, our server, made our visit that much better!  Only wish North Dakota was closer."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTlpuUlVlRTlqWTNoTmJIZEpkWGxJUlZCT1lXYxAB",
            "text": "Generous portions, fun atmosphere, attentive staff. Great find and so glad we couldn't find parking at our planned dinner location."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBamNxUzJRRRAB",
            "text": "Very calm atmosphere setting the stage for a lovely and relaxing evening. Sick of the noisy high school cafeteria atmosphere of so many restaurants.\nOur food was well prepared and delicious. Particularly loved the Pasta con Funghi ! Cocktails were well made particularly a well made Negroni.\nThoroughly enjoy an evening out here so we've returned often."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSeVNIbEVhR2MzYmxoUlFXODVSV0YwWWsxTWJYYxAB",
            "text": "Best food on the block and some of the best Italian food in nyc. Such a lovely cozy restaurant. I’ve lived next door for 4 years and one of the highlights has been being next to pisticci. Amazing dinner, lunch and brunch service and the atmosphere is to die for."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUVpuTjRkRE5FTkRseWMwdG5jekZZT0ZCVVMxRRAB",
            "text": "Amazing restaurant - great food and service every single time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNVUxWnJlREZ1YkZVMFpVNUlPVll4WDNGck5GRRAB",
            "text": "The ravioli mesto special was interesting because each piece had a different filling which was nice. I preferred that to the fettuccine funghi"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNk9HRlNTRU14Umt0UmRqQjFjVVpPWDJOdWFsRRAB",
            "text": "This is now my new favorite Italian restaurant!!  My boyfriend and I were in for dinner last night. Highly recommend the minestrone soup!! Fabulous food and atmosphere. Excellent wait staff and service!! Will definitely be back!!❤️❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gd0xUUm5TRFJLYzBJNGRWQkZibXBPWHpSRmRuYxAB",
            "text": "My coworkers and I came here for lunch. The ambiance was chic and inviting. The wait staff was attentive and pleasant.\n\nThe food was delicious! I had the fettuccine ala vodka. The sauce coated the pasta without being heavy or overpowering. It was full of flavor and savory. The pasta was tender, but still provided a good bite feeling. I had the opportunity to try the parmesan crisp that comes with the house ceasar salad, a fun addition to the meal!\n\nOverall, I highly recommend and I will definitely come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMlJVTmlNbmRUWm5KWE1YTk5RVEJEUWxrMFdGRRAB",
            "text": "It was our first time having brunch here and it was great. The ingredients were fresh and delicious. We had the lemon ricotta pancakes and the uova. The service was fantastic, super friendly. Will definitely be back. So happy to have this gem so close to our apartment 💛"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dmVqTk9TbWhJVHpOUFVuWnBjMGxCUWpoTmJsRRAB",
            "text": "I’ve been going to Pisticci for almost 20 years and in the early years sometimes would go once a week. I often take large groups there from work, and generally have a decent experience. Last night (7/20), on a slow mid-summer dinner visit for the first time in a few months, it became clear how far the quality had dropped: the food, the service. The staff offered tables only so near others that it would have been tough to hear, so we opted for the bar, where an off-duty staff sat and talked to the bartender and other staff. The drinks were fine but we had to ask twice for some bread, and then actually had to get up and interrupt the staff’s bar conversation (a couple more joined, and they were pretty loud) to ask for some utensils. I think a restaurant runs well when the staff know and like each other, but is it too much to ask for them to have their eyes on the diners? On the other hand, it was refreshing not to have someone coming by to ask how everything tasted before we had a chance to try it. If they had though, I’d have said the fennel salad was dry and tasted as if it had been sitting uncovered in the fridge for a while, the pappardelle was as good as ever (the ragu is good), but the broccoli rabe ravioli special could be improved by leaving out the sausage and going much lighter on the cheese to make it more like the summery dish it seemed to promise it would be. It did not taste as if someone familiar with Italian food had made it. In contrast to the lackadaisical wait-staff, the runners (the “amigos”) were on top of their game, nimble, friendly, and tireless as ever. Hope to get back sometime for a better experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wb2QycDNRV1J2ZUdwM1oyWkhjSGhNUTNkVFMyYxAB",
            "text": "So good so cool so all the time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psYVdWTkRUVUp1WXpjNGVtUmFTWGR6WVZaWU1XYxAB",
            "text": "Hidden gem restaurant that should be on every “top restaurants” list in NYC. Always have the best service here (shout out to Kathleen who was lovely from the second we sat down to the moment we left.) Perfect for an outdoor summer brunch, cozy dinner, and everything in between."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keFVFMTVTazFuVUVOelFrMVZPVFpZWDFwMmJXYxAB",
            "text": "Really cool atmosphere.  Pasta was delicious.  Service was fantastic.  Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veFdrUk1hRXhQZDIxd2NGaGxaR0ZGV1hJNGVWRRAB",
            "text": "Food is simple, elegant and delicious!  Muscles and sauce is to die for.  Garlic bread dipped in sauce, yes please!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNFFrcEdURTlZU2xwcWFEbERNRFU0Y0dSQk5XYxAB",
            "text": "Great atmosphere. Food overall was good. Tiramisu was great but coconut cake was as a little dry. Supertuscan wine was delicious. Would definitely go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreFp6RkxVMjV4VlZCeVNWY3dZVlp3VlVVMFRWRRAB",
            "text": "I got a chicken panini which wasn’t great the sandwich was really dry. I also got a ceasar salad which had hair in it unfortunately."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abmEwOWpOVjlMVlhOVVUxRTROR3R3UWpBM2RuYxAB",
            "text": "I must share some personal observations regarding my dining experience.\n\nRegrettably, I detected a wild game flavor in the meat, which I found somewhat off-putting, and I had to set most of it aside. Even more concerning was the metallic taste I experienced, which made me realize the significance of the utensils used. I suspect the quality of the provided utensils may be the primary issue, as I possess very old utensils with numerous scratches that do not impart a metallic flavor to my food. The main point I wish to convey is that I tasted a metallic flavor while using the provided utensils, which significantly detracted from the overall dining experience. Even after finishing the meal, the metallic taste lingered in my mouth for some time. Aside from the wild game flavor in the meat and the metallic taste, the meal itself was quite enjoyable. Perhaps I am overly sensitive, but this experience has made me realize the importance of utensil quality. I am leaving this review with the hope that the restaurant will make improvements. I intend to return to sample different pasta dishes and offer a more comprehensive assessment, and I am contemplating whether I should bring my own utensils.😅\n\nOn a more positive note, the staff members were quite pleasant, and the restaurant itself was super charming. I feel somewhat conflicted about leaving a negative comment.🥲🫠"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJWDRsWVdadkllbXFBRRAB",
            "text": "Great place with good food and a welcoming staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNWJtTkhSUzFxUzNWd2RYUm5YemhWVldndFgzYxAB",
            "text": "Very good food, wonderfully intimate atmosphere w beautiful back room and more space than it seems from outside. Had two different waiters, but overall recommended"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOanJtTnpEcFlMa3pnRRAB",
            "text": "What happened at Pisticci last night?  The most inattentive service I have had anywhere in a long time. We spent most of the meal trying to flag down our server - to order, to help with a kitchen error, to bring water when the carafe was…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYWVydkhNanVPQldnEAE",
            "text": "Foods, services are good. The prices are reasonable. Recommend place to go."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJN3c4SVhGd2JMUDRBRRAB",
            "text": "Came here tonight for the second time ever and it was awesome. My friend and I both had the pasta special which was pasta stuffed with pear and cheese, tossed with tomato, kale and more cheese... Holy crap, please put this on the menu!!! Amazing and the perfect amount. Great service even though they were busy. 10/10, no notes."
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLVlHY2RREAE",
            "text": "Incroyable,parfait"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMGNYYjRRRRAB",
            "text": "Perfect place for outdoor seating when the weather is nice. We were 15 min late to our reservation but they sat us immediately. Food was delicious, especially the orechiette broccoli which had a nice spice and lemony sauce. They initially gave my husband the wrong dish and the server graciously apologized and very quickly brought out the right one, and we said it wasn’t a problem at all but he still insisted on covering our dessert. Great tiramisu and excellent customer service! They must have been understaffed because it took a long time to get our check but we weren’t in a hurry."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN05IV1pnEAE",
            "text": "The penne alla vodka was good, the pasta was al dente and the sauce was balanced. The atmosphere was really nice."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbjdQNzVRRRAB",
            "text": "Great pasta options. The cheesy pasta was awesome. Ice tea is not bad"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNva2RDUHpBRRAB",
            "text": "Savoureux et accueillant !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLXRDd2d3RRAB",
            "text": "I hosted a 25 person dinner at Pisticci and we had a wonderful time! We had a birthday party event and everything went so smooth. We enjoyed planning with the staff, all the different menu options, drink options, kind service and wonderful server - Chloe! My guests were over the moon about choosing their drinks and their delicious dinner! The restaurant was able to pace the meal so that everything was seamless. Perfect location for an uptown event!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaXRhV0lnEAE",
            "text": "The staff is professional yet, warm, thoughtful, and non-intrusive. They allowed us to sit and talk for almost 2.5 hours! I will go back soon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMU1USFVnEAE",
            "text": "Absolutely blown away by the incredible hospitality at this amazing family-owned restaurant! Our group, which grew to about 23 people after a nearby recital, walked in without a reservation for Sunday brunch. Despite being short-staffed, the team went above and beyond to accommodate us. They opened up a back room just for our group and managed to take all our drink and entrée orders quickly and efficiently—the food came out impressively fast given the size of our party.\n\nEverything was delicious—from the entrees to the cocktails to the coffee. Everyone was so happy with their meal. We’re so lucky they welcomed us in yesterday, and we can’t thank the entire team enough for pulling it off so smoothly. Highly recommend! I will definitely keep them in mind for private events in the future. Thanks so much, Pisticci!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMkthdm9BRRAB",
            "text": "A little neighborhood gem with a fantastic, creative, beautifully-executed menu. Best thick-cut bacon I've eaten in a very, very long time. Great drink menu."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbUsyZjZnRRAB",
            "text": "Great food and outstanding jazz. Even the house red wine was very good! Will definitely return."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcU5DaWh3RRAB",
            "text": "We were there for both lunch and dinner. The food was good, especially the fish soup and the steak. Dinners can ve hectic though, 2 drinks and 1 side dish we ordered never arrived."
        },
        {
            "date": "7달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNkxQdUxREAE",
            "text": "İtalyan restoranı. Değişik makarnalar, salatalar, tatlılar… Her şey çok lezzetli. Şarap ve biralar özenle seçilmiş. Tatlı ve makarnaların sosları ev yapımı. Michael ve ailesine teşekkür ediyoruz. Her şeyin fotoğrafını çekemedim çünkü yemekleri görür görmez tatmak istiyorsunuz :)"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNE9PbUlREAE",
            "text": "신선한 재료와 맛있는 스테이크 그리고 스파게티는 잊을 수 없는 맛이다! 나의 집 옆이라 자주 올 수 있어서 좋다"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6akxTU2RBEAE",
            "text": "Pisticci truly has something special in a city corrupt with rudeness and the hustle and bustle. This restaurant is a gem tucked away in the upper west side with the most amazing staff. Julietta was our bartender/server and she made us feel so welcome and special. She told us what was amazing to order for drinks and food. Everything tasted amazing and we spent hours just hanging out at the bar talking to Julietta. One of the best experiences I’ve had at a restaurant in a long time. Will definitely be back to visit this place and the wonderful people in it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuLVpIQUlREAE",
            "text": "If you wanna have a great brunch atmosphere, come here especially when the weather is great. Food is not exceptionally good but it is great! French toast was fluffy and soft, paired with fresh fruits. The spinach omelette is what you would expect from a spinach omelette."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bHU2NW9RRRAB",
            "text": "The good reviews are spot on. We had a wonderful lunch at Pisticci. It's lovely inside and out. It was a beautiful day for the patio so we choose to sit street side under an umbrella. Service was perfect from start to finish. Our lunch was sensational! I had the Insalata Pisticci (minus the potatoes) and added grilled salmon instead. The spinach was fresh, the dressing divine and the salmon was flaky yet firm. My husband had the Seafood Pasta special. It was loaded with shrimp, mussels, clams and a white fish over linguine. There was more fish than pasta which thrilled my husband. If you're wondering if he enjoyed the sauce, I can tell you he alone ate the entire basket of the crusty Italian bread, dragging every piece through his leftover sauce and finally spooning the rest on his last piece of bread. We will definitely eat here again!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbUktQml3RRAB",
            "text": "Absolutely phenomenal meal. Came here on a Friday night shortly after they opened with no reservation and they were kind enough to squeeze us in - it was packed by 6:30pm. We had two drinks each, shared an app, each got a delicious entree (swordfish special was to die for) and two deserts, all for $180 with tip. All of the staff and our server, Stephanie, were friendly and extremely attentive. Cannot wait to return - what a gem of a place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdDQ3YUJREAE",
            "text": "My partner and I have been coming to Pisticci since 2014. We’ve spent several anniversaries there, including one yesterday. The food was great as usual and the service was decent, but my partner and I felt that Pisticci has lost a lot of its magic. The neighborhood restaurant used to be a magical place, especially under the management of Pam and Scott. Back then, the managers as well as the entire staff would charm you and make you feel special, especially during special occasions like, anniversaries, graduations, and even birthdays. None of that is there any more. The magic has gone. In its place is a more corporate feel. The interactions with staff are merely transactional. We’ll still come back occasionally for the food, but the place has lost something truly special. Pisticci used to make you feel as if you were a part of a family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5Z05IZUF3EAE",
            "text": "Fantastic restaurant with such romantic flair,  super cozy and the food is served in large portions for one person! We had the Garlic bread with goat cheese which was splendid, the butternut squash soup is a must try and the rigatoni/bolognese were delightful. Our waitress Madeline was stupendous and super patient to our party with 4 kids. Very grateful for her continuous attentiveness. the only thing I would say or take the subway or an Uber as parking is so scarce. We’re here on a Wednesday night!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMLTY3UWlnRRAB",
            "text": "Brunch date with bestie for his bday.  Got there early-ish for brunch - before noon.  Lots of tables were available.  I did hear a couple of people check in with reservations though.  It did get busier by 1pm for sure.  Ordered the lemon ricotta pancakes and the uova contadine, both of which were very good.   Also ordered a side of sausage and some coffees to round out the meal.  They did have a drinks menu with alcohol and a few non alcohol options as well as a very decent looking dessert menu that we did not partake in.  They have some outdoor seating available in these warmer months."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueTlhZl9nRRAB",
            "text": "The beet salad was very nice but it is a lot for one person.  Definitely a share dish.  The vodka pasta was delicious.  Nice little place.  They have outdoor seating."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcksyNUtnEAE",
            "text": "I missed lunch so I treated myself to an early dinner. I love this place because you can eat a vegetarian meal that is as good or better than the meat options. I finished with sorbetto. The only (minor) misstep was the bread. It was not very good. But, having missed lunch it came quickly and kept me from drinking on an empty stomach.\n\nThis restaurant is so great that when someone suggests somewhere else I sometimes feel a little disappointed, even when I know I'll enjoy the other place too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0Mk9TenpnRRAB",
            "text": "Came here for a date night. First, food came out so quickly, and the food was some of the best Italian I’ve had in the city.\nGot the ravioli and the skirt steak and both were so flavorful and the pasta sauce for the ravioli was incredible! Had the affogato for dessert and all I can say is wow 😍\nLovely atmosphere, music was a nice mix of different genres but the volume was just low enough that you can easily converse and still enjoy the music. Love the restaurant itself it’s very homey and relaxed.\nService was also great, once again food came out quickly and everyone was very nice and helpful. 10/10 will go back to try more dishes :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCci1fUGh3RRAB",
            "text": "Food 7/10\nGenuinely quite impressed by the lunch pasta menu. Ordered the rigatoni alla vodka, and it was better than I expected. Super creamy and rich. Very large portions, extremely filling, and not so bad at all. A solid Italian spot in the neighborhood, would return to try some other pastas. Pricing is relatively okay for New York, but obviously that’s not saying much because it’s New York.\n\nAtmosphere 7/10\nCute little spot with plenty of seating, more than I expected when observing the outside.\n\nService 7/10\nNice server, good stuff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMczRDazdnRRAB",
            "text": "Pisticci is a true gem in our neighborhood! The service was exceptional; the wait staff and chefs were very accommodating, even when I requested a slight deviation from the menu. The staff was incredibly kind and communicative, making the dining experience feel both personal and welcoming.\n\nThe food was delicious; I had the bolognese with pappardelle, which was cooked perfectly al dente. The sauce had a bit more tomato than a traditional bolognese, but I found it delightful and rich in flavor. I highly recommend Pisticci for anyone seeking a fantastic Italian meal with great service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4d0tiQ2t3RRAB",
            "text": "We had Brunch at Pisticci in Upper West Side with family. The decor is adorable with cozy & relaxing ambiance.\n\nWe ordered most of the items available on the menu and they were overall decent with reasonable price. The portion of the avocado toast was impressive, it’s generous to see Pisticci serving 3 slices in one plate.\n\nMy roommate had Fettuccine al Funghi and it was amazingly good. It’s flavorful and the noodles were chewy. We still got a tiramisu as dessert & it was a perfect ending even though we were extremely full."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbHZ5WW5BRRAB",
            "text": "Fantastic experience.  I had the smoked salmon special along with the clams and linguini special and a side of garlic toast.  Almost too much to handle.  But you combine that with some lovely wines and the great live music on Sundays and I had a blast!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSXzhic3NBRRAB",
            "text": "My photos did not justice of how great this meal was. Great low key spot for pasta and great vibes. This place is a gem for the area.\n\nService 10/10\nFood      9/10\nAtmosphere  10/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M2RhOU5nEAE",
            "text": "Top Notch,\n\nQuick service and attentive staff. Luke was kind and knew the menu. $20-40 a plate.\n\nNice atmosphere and would visit again many times over."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxNVAzUmNBEAE",
            "text": "The service started out great then it declined after awhile. Overall the food was  good, but not worthwhile. And the dessert sounded better than what it tasted. The environment is nice and big, did not feel overwhelmed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCLWJmaVJREAE",
            "text": "I came here with my friend for her birthday. We ate so good! The salad we got in the first picture had crispy potatoes and bacon - absolutely delicious. The burrata was also fresh. We ordered the ribeye special with potatoes and chickpea salad, as well as the f\nFettuccine Ai Funghi. We loved both. The ribeye was well cooked and went really well with the chickpea salad, which added freshness. We loved the fettuccine, it didn’t have a protein, just the mushrooms. Lastly, we got the tiramisu and the gelato. We loved both but would definitely come back for the tiramisu. Service was great and the ambiance is perfect. Would totally recommend to anyone!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXcXZLanFnRRAB",
            "text": "A true neighborhood gem! Great homemade Italian food! I always walked past this restaurant, especially in the spring/summer time and saw their vibrant outdoor seating.\n\nLast night, I was looking for a new spot for my friend and I to dine. We decided to check out Pisticci and we didn't know it yet but we were in for a treat!\n\nThe restaurant is actually spacious. There are three dining spaces. We did not have reservations however, the hostess was able to seat us right away at one of the hightop tables in 2nd room (main room). It was a great table along the left glass wall and out the way of other tables and the business of the waitstaff. It is such a cozy and cute restaurant with a home-y feel.\n\nThe food was AMAZING! Variety of dishes on the menu to choose from. Our food came out fairly quickly. Our waiter gave us great recommendations, in which we ordered. The pasta was cooked to perfection. We ordered Spaghetti Al Pomodoro and Meatballs (they also have a vegan ball option), Prosciutto E Spinaci (MUST TRY, ask for extra spinach), Burrata Caprese with cherry tomatoes and pesto which was average (too much olive oil on plate and lacked taste), toasted garlic bread with fresh garlic was good however kind of oily but the regular bread served to table isn't as tasty, 2 scoops of vanilla Gelato with strawberries, and a tiramisu with a scoop of vanilla Gelato. Dessert was good but I've had better Tiramisu. Can't go wrong with Gelato.\n\nWe had 4 drinks total. 1 Champagne, 2 Grapefruit Martinis and 1 Pomogrante Margarita. We tried the waiter's drinks suggestions as it is the most popular drinks served at the restaurant. The Grapefruit Martini which wasn't too tart and is balanced out by a sugar rim and simple syrup. The Pomogrante Magarita is more on the sweet side. As we sat there we saw at least one of these drinks being made at all times.\n\nAll in all great restaurant, I can't believe I waited this long to try it. Price range for each item was between $7 (garlic bread) and $17 (Prosciutto e Spinaci).  Great service, waiter was attentive and friendly, great for one person, groups, or family. Great place to celebrate a bday or celebratory dinner, especially in the room in the back. I'll Def be back. Almost forgot their Minestrone soup is super tasty!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcUpEaHdnRRAB",
            "text": "Love this place! I recommend sitting outside as It’s a really cute neighbourhood. The food was amazing, highly recommend the mussels and bolognese parpadelle, literally some of the best things I’ve ever ate. 10/10 recommend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyc28tVmN3EAE",
            "text": "This is an excellent Italian restaurant, conveniently located near the Jewish Theological Seminary and Columbia University. We had excellent service snd had outstanding salads and the house specials! I loved the wallpaper in the dining rooms as well as in their spotless bathrooms!"
        }
    ],
    "reviews_count": 72
}