{
    "name": "The Inn by Fumo",
    "place_id": "ChIJq4t5g9j3wokR42KjTV_To2A",
    "grid": "MN9",
    "address": "3508 Broadway, New York, NY 10031, USA",
    "rating": 4.4,
    "user_ratings_total": 395,
    "phone_number": "(212) 234-3084",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zd1lVdEdkRGR0TmxoUGRGRjVaMDFmUzFkTWJWRRAB",
            "text": "This spot combines all the elements that matter when eating out. Distinctive tastes matched with superior service. These foods create lasting impressions. Staff handle requests with grace. I feel fortunate to have this spot available."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeFNDMTBlRmN5ZFRWalYyUkNYMHRzV0V4elVtYxAB",
            "text": "server took a long time to see if I wanted anything while I waited for my friend but other than that service was decent and the food was great. Drinks were good too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVlEwVjVlRTE1TFRKMmJsbGhVbEp1V2toRlRWRRAB",
            "text": "I love the experience at The Inn ! Calm & relaxing, the areas amazing to sit outside & enjoy the views ! Staff are welcoming & serve the best drinks in town ! The vodka chicken parm was the best thing ever ! Amazing & enjoyable time here !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMFluZHFVa2x0ZFZCSmNISmZlWHBFWlRoYVdsRRAB",
            "text": "Delicious food: great Mac n cheese, cauliflower bites and amazing chicken sandwiches too!  Service was great as well.  Support this local place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxa1NXOHpXVU5vTVhWa2NVOWlNRkoyWWxwMldYYxAB",
            "text": "We spent some time at Inn by Fumo from 12 p.m. to 6 p.m. and had a wonderful experience. The atmosphere was relaxing, the service was excellent, and everything was well taken care of felt very welcoming and enjoyable. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTmFtcE9PRkpVVUcxM2R6RkZXakl5TFhwNE9IYxAB",
            "text": "Came here once when I lived around and the food was generous and tasty! Highly recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WlVVRmxZMnhpTmtOYWVHTlFibmRqVDJ3dFJVRRAB",
            "text": "I had a great time. The owner Israel and manager Verne are very attentive and go the extra mile to make your experience even better. Definitely recommending this place to all the people I know."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCelpFcHlkalZ6VGxKUkxUTk9RalYzWWxCV09XYxAB",
            "text": "Buenas noches, ya me ha pasado 3 veces lo mismo, la pasta no sabe a nada y la pechuga súper amarga, debo de cocinarla nuevamente en mi cocina a ver si se arregla pero el amargo es tan grande que no se puede comer, el manager que se ponga para los cocineros y le apruebe los platos, porque literal, está horrible y casi 50$ perdidos\n\n."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psM01YcHdVSEZyYW1KVk1XdHVha0p5V2sxVGVrRRAB",
            "text": "Casual eatery that for this satellite of Fumo Harlem.  Uncomplicated but tasty food.  Has vegan options and carnivore options to satify everyone."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aZldHUlFVekJKWDNwdVlqUlBlVmRaTFRoWFNXYxAB",
            "text": "I was having a bad moment in my day when I walked in, but the food and atmosphere was really reinvigorating :) The staff were incredibly kind and friendly, would absolutely recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJelRtcDRjSGxtUXpGRVYyRnZSalkzYlY5VGVsRRAB",
            "text": "I ordered the chicken and waffles. I tasted the waffles and it was completely salty even with the syrup. I told the waiter that it was salty. It seems like the mix has been sitting there because it was so salty. I’m not the kind of person that complain, but it was not swallowable. I asked my sister just to ensure that it was not me. However, she also found it salty. I understand that the mixture sits for a while it gets salty. I told them and the manager wearing the navy blue short sleeves shirt  and he made it sound like I was making a big deal saying that they “try every food that comes out of the kitchen.” What a reason did I have to lie about this salty waffles?! I even told him to try the salty waffles. I don’t eat salty food and I’m not interested in eating salty waffles. To be safe I told them just to replace it for the chicken tenders. But that attitude was just not what I was looking from this dinner with my family. I would have just rather not eaten anything. Obviously this is not the same chick in that was here before. A nice presentation but that was all. A customer experience with a restaurant is important and listening to your customer is not such a hard skill in such an industry."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVFRUVTNhbTVVVlRCQ1dHRkRaVUpUYm01VFNHYxAB",
            "text": "The Inn by Fumo holds a special place in my heart.\nBorn and raised in NYC, and now splitting my time with Florida two weeks out of each month, I make it a priority to visit The Inn every day when I’m in the city.\n\nBreakfast here is to die for—the perfect way to start my morning. Lunch is a delicious preview that always leaves me excited for dinner. And dinner? It’s the perfect way to end a busy NYC day, especially with their incredible pasta and perfectly breaded chicken.\n\nJerry and Israel embody true hospitality. Their warmth and attentiveness make every visit feel special.\n\nIf you’re ever in New York, I can’t recommend The Inn by Fumo enough. This place deserves to be known and loved by the world."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbU5IaHpVazFYVXprdFJrVnZUVU5hY1VsV05WRRAB",
            "text": "Literally disgusting,  flavorless shrimp only has flower on them and the cauliflower is filled with oil. Nothing but oillllll!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdU4xZ3hiM0UzY0daTU1HdHZabkpZVGtWR01WRRAB",
            "text": "Disappointing Experience – 3/10\n\nI’ve given The Inn by Fumo a few chances, but unfortunately, the food has seriously gone downhill. I recently ordered the chicken sandwich, which was advertised as a regular sandwich (with a buy-one-get-one-free deal), but what I got was more like an overcooked chicken schnitzel—tiny, chewy, and mostly just breading. It felt like a complete rip-off, even with the deal.\n\nThis wasn’t an isolated experience either. The mac and cheese I had a while back was so overwhelmingly cheesy yet completely lacking in flavor—it was basically inedible. I also tried the meatballs, which were oddly soft and unpleasant in texture.\n\nThis used to be a decent spot, but it’s fallen off hard. I wouldn’t spend another dollar here. Disappointing all around."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNVMzQlNaVE50Y0doVlRFRk5PR05aY2xjdGFrRRAB",
            "text": "Food is quality. Their waffles are phenomenal. Love the price of their half chicken and 2 sides. I enjoyed La Chicka drink. My favorite appetizer is their chicken cheese balls, not for the flavor but for the texture.\nAlthough the food is quality and fresh, I will admit that seasoning does lack. Expect food to be a little on the under seasoned and under salted side, but I get the feeling that it is on purpose so you can enjoy the food with their sauces.\nTheir vodka pasta tastes better than the one in Fumo, although this restaurant is their sister location.\nAll in all, this restaurant is top tier quality food. Very light on flavor and seasoning but great on variety of textures and freshness."
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNWQwWkNSWFppTmxWSGQwNTBhRmxJTTB4bE4xRRAB",
            "text": "Très bon restaurant"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaFNuTkJPV3gyZHpVMmNqVlVabDlLTlRSUlNsRRAB",
            "text": "Saw a deal on Uber eats about this restaurant for vodka rice and chicken. This is how it arrived to me, it looked and tasted really bad. Please do not order this. It’s disgusting. I unfortunately cannot get my money back, but this is my warning to you to not order this. I didn’t take a picture of the mac & cheese I ordered, but the portions were tiny, and it was not great, despite the fantastic reviews about specifically this dish."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nME5WTTBTRFU1UmtVNVUxSlhVR1JvVTBkR01sRRAB",
            "text": "Food was amazing, so was the service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTVRqUm9TbTg1YkdaeFYyTmFRakV0Y25CM1VHYxAB",
            "text": "We enjoyed our food for the most part but service was lacking. My daughter had the buffalo wings and said they were the best she ever had. I had the BBQ wings. My husband had chicken he wasnt thrilled by but had a unique spicy vodka rice. The fries were yummy and crispy. The service, however, was lacking. Things like waiting a long time for our order be taken to getting the wrong sauce with our wings. Once we were seated the waiter completely forgot about us and proceeded to take someone else's order ahead of us when they'd arrived after us. We probably will go back because our daughter loved the wings but I hope we have a better service experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWR05YZzVPV1YzUkY5MFJGSm5hbEJyZVc5WmNYYxAB",
            "text": "The spicy vodka rice and rotisserie chicken with the green sauce are some of my favorite things! Consistently yummy every time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKV1Q1Y19yd3RYeURREAE",
            "text": "Just ordered two whole chickens with sides. This is our favorite peruvian place now! Delicious and fast."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYjh3TDJ4M01DeXFBRRAB",
            "text": "Food was good. I ordered a salad that was pretty tasty. My other friends ordered chicken dishes that were pretty dry. The taste was good though. The service was exceptional. Doesn’t feel like you’re New York while in there."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYXQ2SUgyNC0tVHNnRRAB",
            "text": "Fantastic place - atmosphere is cozy and very charming, food is delicious (any chicken sandwich is a go-to), and because it’s on a busy strip of broadway, it is never too crowded.\n\nBottom line, if you like high quality, not greasy fried chicken, this place is IT! Don’t miss out going to the nearby hole-in-the-walls, this place here beats them all!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcXluNm1BcjVYVjBBRRAB",
            "text": "Yoooo the chicken and waffles were great. Specifically probably the best waffle I’ve ever had. The hot sauce is also really good! Def worth going to for Brunch. Wished there was one more chicken strip on it but loved it regardless."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ1o2MkF3EAE",
            "text": "Delicious food, efficient ad caring staff... definitely coming back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZX3E3ZEZBEAE",
            "text": "Great place!  I enjoy eating out or just grabbing a couple of drinks after work here.\n\nShout out to employees Jerry and Izzy -- both really friendly, funny, and make you feel very welcomed.\n\nAlso, I know this is a chicken place, but can I just say that their Caesar salad is delicious?  You don't need dressing at all."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNklyRElREAE",
            "text": "Happy hour Mon-Fri 4-7pm.   Wings, fries, fried pickle, Mac and cheese.\n\nDecent experience as they are not very attentive\n\nLots of space with outdoor dining."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd1BhaDZnRRAB",
            "text": "The moment you step inside, you're welcomed by a warm and inviting ambience that sets the perfect tone for an unforgettable dining experience. The decor strikes a perfect cozy charm, creating an atmosphere that's ideal for everything from date nights to group gatherings.\n\nThe food? Absolutely phenomenal. Every dish is thoughtfully crafted and bursting with flavor, clearly made with fresh, high-quality ingredients. Whether you’re a fan of classic favorites or adventurous plates, the menu offers something to excite every palate.\n\nAnd the drinks — expertly mixed cocktails and a curated selection of wines and craft beers — elevate the entire experience. Each sip complements the dishes beautifully, making it clear that great care went into the beverage menu as well.\n\nAttentive service rounds out the visit, making you feel like a truly valued guest. Highly recommend this place if you're looking for a dining experience that delivers on every level: taste, atmosphere, and hospitality."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMDZEYTdBRRAB",
            "text": "This has became one of favorite brunch spots. The food is bombbbb, affordable and they have a good range of meals. Even the lemonade is great. The atmosphere is so calm and it’s a perfect place to have a good conversations and catch a nice break. I highly recommend the sweet chick sandwich and the Mac and cheese (truffle sauce included)!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcGVMcy1BRRAB",
            "text": "RAW burger sent. Not rare, raw"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNHRIbGtnRRAB",
            "text": "Atmosphere and ambience were great (the lighting was a bit too low in my opinion, but still very nice decor/overall ambience). I ordered the soy protein sandwich and potatoes---so incredibly flavorful! I was really impressed with the taste. Israel was great, and I'll definitely be back again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJX1lyWVJnEAE",
            "text": "Chicken Sandwich Yummy! Fun staff!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOXVIdHZnRRAB",
            "text": "I have ordered from them many times and it's usually pretty good. Tonight in my Caesar salad I got this weird Brown chunk, which was kind of gross and did not taste good."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MTlfamVBEAE",
            "text": "Great atmosphere for family, friends and colleagues. Food is worth it, very tasty. I had the sweet chick sandwich minus bacon my side was roasted potatoes and la chicka drink. You will not be disappointed"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dC1MOE9REAE",
            "text": "I spent my weekend in Harlem and this was a great choice. Such a great choice I ordered multiple times that weekend lol. Both orders were to go orders and both were very delicious. So let's start with the items we picked. We ordered bbq wings, chicken parm a la vodka, mac and cheese plain, chicken balls, a house salad , and vodka rice. All were so very good!!! I am not big on take out food I like to dine in but this was a good choice. I was very pleased with the food. Service during our pick up was pleasant as well. This will be my spot when in Harlem . Baby Fumo lol!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MF95Y19RRRAB",
            "text": "Ive been visiting this spot for a long Time- it feels like family; Jerry & Israel treat all clientele with the ultimate respect & delicacy, delicious food & DRINKS"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNmYzQUpnEAE",
            "text": "This place has gone way downhill, the wings used to be some of the best I’ve had in the city and in the last couple years they’ve just turned into soggy broken pieces. The restaurant did a change over and now the majority of the food on the menu is mediocre Italian, the chicken sandwiches are mostly breading and you won’t get through one with chicken in every bite. Really disappointing."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOU1XYURREAE",
            "text": "Solid Italian American food. Ordered delivery and the rigatoni with vodka sauce, Caesar salad and bread was pretty perfect. Excellent salad dressing and sauce. Will definitely be in the rotation."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXFYNHRnRRAB",
            "text": "This place used to be my favorite before Fumo took over. Food and service have both diminished since then. Especially disappointing because the prices have gone up!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOHMtWGVBEAE",
            "text": "A wonderful experience always.\nThe music is always a vibe and the food is always good.\nI always enjoy sitting at the long table.\nAlways can find someone to chat with or have your own space. 10s across the board.\nTo Izzie and Jerry."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMnMyQk5BEAE",
            "text": "Visiting friends in NY over the Jan 11th weekend and they took us here. WOW is all I can say. The food, the service, the owners, the atmosphere ... A+. There are soooo many choices in NY City and it's quite hard to maintain standing in an incredible food town. The Inn hit it out of the park!! We had apps (chicken cheese balls,  drinks (incredible bartending and drinks were spot on), entrees (rotisserie chicken with rice & beans and spinach, chicken & spicy vodka rice, vodka chicken parm), and dessert (they were kind enough to recognize my friend's birthday ... attention to detail noted). EVERYTHING was incredible. Can't say anything bad or even remotely critical. So happy with our night at The Inn! Thank you staff, thank you owners for a GREAT night."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cWNYYnJnRRAB",
            "text": "Pleasant atmosphere, kind staff, exceptional food. I got the salmon"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MjdPS1pBEAE",
            "text": "Ordered uber eats for the first time & last time under Shaka colon food caused nausea and diarrhea to my fiance he still feels throw up in his throat never again no wonder the wings were very dark probably not fresh or old and its terrible to use it"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbWF5b1NREAE",
            "text": "The best grilled chicken"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeDRMTVpnEAE",
            "text": "ISSY ISSY THE MANAGER HERE ITS KEY AND HIS CREW HE REMEMBERS HIS CUSTOMERS AND ALWAYS DRESSED TO IMPRESS."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzODl5Q2J3EAE",
            "text": "Delicious food and friendly service! We loved the brunch!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNnRhbF9BRRAB",
            "text": "Came into New York looking for a good place to eat found this place on Google looked at all the good reviews they had and decided to try and boy are we glad we did we came there yesterday on a Sunday during their brunch time My boyfriend got the barbecue chicken wings and some roasted potatoes and I got the chicken cheese balls and the half roasted rotisserie chicken a house salad with roasted potatoes I love how attentive the servers were and how they greeted us when we first came in the door it's a beautiful atmosphere it's small warm and homey like a close knit family with beautiful pops of color we will visit again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYa19tSFVBEAE",
            "text": "I got a super yummy lobster roll with fries. It all comes in one order so that’s good. They mixed some veggies in with the lobster which was a good delivery of flavor along with the butter. The fries were good enough to eat without sauce so that’s above average if you ask me.\n\nThe server was very attentive granted it wasn’t busy when I went. The place is pretty.\n\nP.S. my friend got the chicken parm. It looked like a full meal but it wasn’t all that tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYLTl5bW5RRRAB",
            "text": "I usually go to this place for breakfast and I especially invited my friend to have brunch with me here but I must say that I was really disappointed. Right from the moment we stepped in the restaurant, we met this server who had a very unwelcoming attitude. She wiped our table with a very wet towel and when she was ready to go inside the restaurant, my friend said to her, ”can you please bring some dry cloth it’s very wet” to which she turned and literally said in a rude voice “yes, I know this already”. Her manner was very rude and aggressive. Then she brought our coffees after about 15 mins and my friend’s black coffee was cold and the foam on my cappuccino was thick, full of bubbles and looked like a peak beaten egg as if it was sitting there for a long time. She didn’t come out for a long time to check on us so I went inside to see if I could find someone to replace the coffee but there was no one at the counter so I came back.\nThe food was good as usual but I was highly disappointed by the quality of service today. We just wanted to finish our food and leave and I don’t think I will recommend this place to anyone in the future. Servers are the face of any restaurant and she didn’t even care about that. Although I didn’t want to add the tip but we did tip her."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYd3A3V2hBRRAB",
            "text": "Great place to eat especially for brunch. We got lucky as they had a peach salad special & it was divine. As well the chicken vodka parm & spicy chicken sandwiches were major hits. Fried pickles and mac & cheese were fantastic & our server was super funny. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5LXMyWmh3RRAB",
            "text": "Visited family and had a quick bite before my flight back home. Large portions - flavorful food. Open yet cozy atmosphere with really cute details and decor. Unlimited mimosas or Bloody Mary for $20 offered. Full menu sounded delicious. Attentive and accommodating wait staff. I’d recommend 😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaOElPc2xnRRAB",
            "text": "So happy this place is in the neighborhood!  Super tasty food, awesome people and great atmosphere!  I went with my friends and we all had a fantastic experience.  I had the spicy chicken ranch sandwich and the waffle fries which was delicious!  Cocktails were also tasty!  You can get great deals here on Monday and Tuesday and the prices are great!  I can’t wait to go back and try some of the other offerings in the menu!  Thanks for making our first experience here flawless! :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbHZlWUV3EAE",
            "text": "We’ve been eating from here for a long time (even before the acquisition) and have always loved it. Excellent for any meal (esp brunch) and has a very down to earth but modern vibe in terms of aesthetic. Very good drinks and great food. Always get the Mac and cheese, chicken tenders, chicken and waffle, buffalo cauliflower, or vodka rice, and have also tried numerous other things - but those are our favorites. I also cater from here a lot as they have a great selection available and make it super easy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodXVyRFJnEAE",
            "text": "My first encounter with this restaurant was negative. I tried to place an order online and it wouldn’t go through. I called the restaurant and asked to place an order for about an hour from the time of calling. They told me it wasn’t possible because the order would be made immediately and then just sit for an hour.  It’s amazing to me that the ability to place future orders over the phone is not possible.  Anyways, I really wanted to try the place so I did eventually get the online ordering system to work. I got to the store about 15 minutes early and my food was already sitting there. (Kinda worried about how long it had been sitting there now based in my prior conversation). The inside is beautiful!!  We got the sweet chick and the Buffalo chicken sandwich with waffle and seasoned fries. Both had really good flavors. They both did have a section of bad gritty chicken. Luckily it was on my last bite but kinda gross.  Overall I enjoyed the food and would try it again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxenBXZDVRRRAB",
            "text": "Friends of ours said they go here all the time so we checked it out and understand why they love it so much. The chicken is SO GOOD and the sides they came with blew our expectations away. The vodka rice was unbelievably delicious as was…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdGZDQU93EAE",
            "text": "Absolutely phenomenal brunch. Best I've had in the city in awhile.\n\nWhat a cute vibe! Definitely unique for the neighborhood. Easy to get to with the 1 train.\n\nThe prices are extremely reasonable and the food was absolutely delicious. The waffle fries were 11/10, so crispy and delicious. Highly recommend the chicken cheese balls!! What a unique dish and the dipping sauce was so tasty. Got the market salad and added two fried eggs on top, not on the menu per se but would highly recommend this modification.\n\nThe aesthetics of the restaurant were fun and quirky, from the tabletop decorations to the curtains to the taxidermied deer. The bathroom was itself was its own vibe with mirrored walls and music blasting.\n\nThe drinks looked delicious even though I didn't try one during my visit. The bottomless brunch option was very reasonably priced.\n\nWill definitely be back sometime either for happy hour or brunch!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMko3Vl9RRRAB",
            "text": "Stumbled on this place through reviews while I was looking for a spot to grab a quick lunch, and definitely found it to be worth it!\nThe $15 lunch special is a lot of food for the money with a half grilled chicken and two sides. I got the shoestring fries (a bit on the salty side) and the coleslaw (absolutely amazing). The chicken itself was quite flavourful and delicious, and I’d definitely recommend this place!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMktXU29BRRAB",
            "text": "So this was a lunch takeout and delivery with Uber eats (great job as always with delivery). The food was pretty warm when it arrived. I did not order fries with any of the sandwhiches. I ordered from this place two days in a row. The food is good. My first order was the"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNzlTUlZBEAE",
            "text": "The food is so delicious, the service is amazing and the prices are great. Just the right place where to go and enjoy the food with your friends and family. If you love roasted chicken, Chick Inn is the right spot. Every time I go I just…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSanRYaFhBEAE",
            "text": "Amazing service! Staff is warm and attentive. Food is always good. Had the BBQ wings with comeback sauce, tenders with fries, black beans and rice, and roasted corn. 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNWJldFR3EAE",
            "text": "Invited to a Sending off of the bride and groom Brunch and had such a great time. The vibe of this place is chic and trendy. The drinks are great. Had the mezcal mule, tropical punch, and mimosa--- all were superrrr tasty!! The tropical punch has a woody smoky taste so if that's not your vibe than skip out. Brunch me u had a great variety-- not a person complained about their meal. I had the avocado toast but I tried other plates as well and honestly everything was tasty. We were also able to decorate slighty for the event. (I am not sure if that was an extra cost as I did not organize the event) but it gave the celebration a special touch. STEVEN  was so attentive to our group of 9, such a great person! The bathroom was clean and well stocked (lots of mirrors (super trippy).\n\nThe only thing I wish they did -- maybe not allowed anymore but we were not able to finish the last pitcher of unlimited mimosas and we wanted a to go for the quarter of the mimosa that was left but couldn't be done. Just a wish but understand if it can't be done.\n\nWould definitely go back again!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeHZlSm1nRRAB",
            "text": "I highly recommend this slow roasted Peruvian chicken. Half-chicken portion with two sides. Good value and fall off the bone. The green sauce was good and the chicken taste great!\nThey replaced my boyfriend’s beer too with a colder one at their own initiative. Nice quaint and bright vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxc2ZTSnJ3RRAB",
            "text": "My go to order is the spicey vodka rice with black beans and chicken!  Great service.\n\nI suggest going in person because once I ordered ubereats and both my, and my friends orders were made incorrectly and tasted off. In person, it's been consistent every time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbUoyWm1BRRAB",
            "text": "Absolutely amazing food and service. Will be back for more!! Manager Izzy went above and beyond. Chicken cheese balls, spicy vodka rice with pulled chicken were amazing!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtX2N6TlNREAE",
            "text": "Delicious food and great atmosphere. The service was exceptional with friendly and attentive staff. Highlight of the night was the Mac N Cheese and the Harlem Mule for drink . The quality of food, portion and serving was well worth the price."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHa3NXa2hnRRAB",
            "text": "I accompanied my roomie, just wanting to check out the atmosphere, but upon looking at the menu, seeing the prices and delicious food selection, I was sold.\n\nLucky enough to walk in on Sunday after 4pm, where the $12 lunch special runs during as a dinner special.  The half chicken came with 2 sides both which were amazing.  The green sauce that comes with the chicken is wonderful, and suits the chicken well.  For a total of $19 a piece, my roomie and I had a filling meal, complete with a half pint beer.  Service was also good — knowledgeable and quick with good recommendations.  I’ll be back!\n\nSorry, pizza.  You’ll have to wait for another night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dTh2VTBBRRAB",
            "text": "Popped in on a whim one afternoon after picking up something in the neighborhood. Attractive outdoor setup, but I opted to sit inside for the AC (which wasn’t too strong). I only had the kale salad with added grilled chicken and an aperol spritz. Salad was delicious and adequate portion for an entree salad. I wanted to try some chicken wings but wasn’t too hungry to eat 8 wings for the $15. Kind of hoping they had an option for less # of wings for less $, more so to try with other bites. Great addition to the neighborhood and great music also."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtX2VXWlVREAE",
            "text": "The Chick Inn has become my new favorite spot for all things food. Whether it’s brunch, lunch, dinner or drinks, you can’t go wrong with one of the best spots uptown. The staff there is truly kind, gracious, and top notch. The food, well let’s just say, I haven’t found a dish I dislike. The setting is intimate and gorgeous and the music playlist is always on point. Do yourself a favor and visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOXBPS0V3EAE",
            "text": "Omg this place was sooo good. My friend invited me to brunch to celebrate my promotion. They take reservations. There is parking available but I'd suggest you try getting there before 1pm. The food was sooooo good. I had the chicken and waffles and the chicken was so tasty. The waffles were so crispy and delicious. Omg. I also had the unlimited mimosas and they were not shy with the champagne! Our server, Luis, was great. My friend had the chicken sandwich and cheesecake. She said it was very good. I'd definitely come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N3YyMm9RRRAB",
            "text": "Lovely location on Broadway in Harlem. Inside is cosy. Outside is cool for people watching and a tan. Neighboorhood vibe, but more trendy than other chicken spots like Charles Pan-Fried and Amy Ruth (both great!). The daily offer with 1/2 chicken plus two sides for 15 bucks is a GREAT deal. Friendly and relaxed service. Will come back with friends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeXRQakpnEAE",
            "text": "After sooo long passing  by here and looking at the menu, non stop, I decided to come in and try an after work happy hour. I can simply state that it has been such a big mistake on my end not stopping by earlier.\n\nAmbience just perfect. Background music on point and noise level is LOW.\nService is pretty good.\nDrinks are good enough for a small bar.\nCHICKEN just perfect.\nTried the happy hour options and I can see myself coming back here for the chicken wings( guilty pleasure ) can’t just get enough."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbE9uSUhnEAE",
            "text": "Sharisse provided exceptional service! She was so nice and had incredible patience throughout the meal. She truly made our dining experience enjoyable. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eUx5NXlBRRAB",
            "text": "If you’re looking for a low-key brunch vibe to be at peace after a wild Friday & Saturday… this is the place to be. Their signature chicken & waffle whether it’s for brunch or dinner is FIRE. Weather is also getting better so eating outdoors is ideal too. I can come here twice a month and never get over it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOHBia1ZnEAE",
            "text": "This meal (chicken and waffles) was $21... there was more breading on the chicken then there was chicken and it was super dry!! Very disappointed in the quality of food, I got 2 other meals and just as disappointing for there pricing! I ordered to go and it was done in 10 min, that's a red flag to me. This food was not freshly made.. only this good was the waffle fries and honestly they were more soggy then crispy. If I could get a refund I would but I will not be coming back."
        }
    ],
    "reviews_count": 74
}