{
    "name": "The Vale Public House NYC",
    "place_id": "ChIJLc6nSAr3wokRdF20n0J8Eko",
    "grid": "MN9",
    "address": "3473 Broadway, New York, NY 10031, USA",
    "rating": 4.8,
    "user_ratings_total": 235,
    "phone_number": "(646) 559-8253",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNVZVSnpWVGt0ZDNnNFRUaFBjalJvWDFOcmJtYxAB",
            "text": "The full experience addressed all five senses. The meals contain surprising combinations that work harmoniously. The employees display true warmth. The setting encourages relaxation and the staff is friendly. I back this spot with certainty."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMk1rUlBNMGRGTW5GdVdtRjNSaTFFZVhCVVEwRRAB",
            "text": "Buen trato"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pob04wb3hWa1J1ZURkRFVUVTVXbkJ4VG5obU5XYxAB",
            "text": "Can’t tell if it’s a gay bar or not? Seems chill if that’s your scene"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcWJqQkpkekE0WDFFMVpWUXhlVXhQTVdsVU9IYxAB",
            "text": "Venturing into this spot showed me what I'd been missing. You can relax here while being well taken care of. Our wait time was very reasonable. The staff shows friendliness too. Another meal here is surely happening."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQ1kwRTVWblZTWTFSMWRVcEpXazFtUkZCTlpVRRAB",
            "text": "Fantastic friendly bar. Will be back next time I’m in New York!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdGVVdEtYM1psZEhveGVERXpNM2hzVkU5MWEzYxAB",
            "text": "The staff here is amazing, the food is always 10/10 and you meet some of the best people.  Never had a bad night here and they stay open till 4am which is rare these days in the city"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1c2FXWnRhbkI0ZUVOSWFGcDFkWFJUUTJSNFpsRRAB",
            "text": "Shoutout to Ryan and Swag at Vale Public House—these two made my night! Their hospitality and energy were off the charts, turning a quick drink into a 3-hour hangout. Amazing drinks, even better vibes. Definitely coming back for more!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNT0l5WkRVajVXU21RRRAB",
            "text": "The bar tender Ryan is excellent he always is very personable with the guess. Gives a hey what’s uppppp vibe! The bar is nice they play really good jams for the millennials. It’s in a great location in historic Harlem. Great seating inside and outside. Take a visit it’s really a great experience and the time stops there lol."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQLV9tdmpzd0pteThnRRAB",
            "text": "A great spot for Hamilton Heights locals."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPdWwydnJWX2NfeUpnEAE",
            "text": "My friend and I came here one evening and a bartender name Ryan with glasses was a jerk. He was rude and his attitude was atrocious. It wasn’t even warranted. We left right after"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaWV1OVhnEAE",
            "text": "Screamed at by bartender threatened by staff or people that claim to be staff that the staff did not stop physically harassed, etc. not a good place I live a couple blocks away and I’m disgusted by the way that they physically and mentally treat people whether they’re drunk or not even as a bartender on a weekend you should be able to handle yourself without taking out your frustrations on innocent people when there’s a fire in their building and they’re the only place that’s open. Every time I go there, I try to tip more than 20% and me that they had people there treating people horribly For whatever miserable reason that they have I was threatened had someone that claimed to be the manager try to physically throw me out the bar and hurt me and I have bruises and as he likes to tell everyone, yes I have bartended and I’ve never put anyone through that much pain and stress I don’t know if it’s the fact that I am black and they just generally let people that aren’t black physically harassed people even though I have injuries, but I’m disgusted. I’ve still been waiting on the reply because apparently the substitute manager knows me and is having everybody harass me, so I can’t feel comfortable living in my own home"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdFAzbnd3RRAB",
            "text": "Very cool and comfortable neighborhood bar! Great selection of beers draft and bottled. The wings were awesome as well as the fish n chips. The service was incredible. Matt is an excellent bartender and server!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Njdpekl3EAE",
            "text": "Super cute and very comfy bar with friendly staff ❤️"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua1pEMWh3RRAB",
            "text": "Great place to have a quality drink surrounded by the extended family you've chosen. Drop by for a beer, karaoke, trivia, jukebox bingo, or just that warm feeling of being welcomed by people who know your name."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeU9TdldBEAE",
            "text": "Went there yesterday and loved the spot. The bartenders are really great. The beers are also good. New spot to go to in the near future. Great work guys!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzci12TmhRRRAB",
            "text": "It is a disaster. I went with my girlfriend and a one guy started making trouble. I got hit inside and outside the bar with no reason. A bartender there even sided with aggressor after I was clearly hit. I highly discourage anyone going to this bar."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdHBDUEN3EAE",
            "text": "I came here for a quick drink before getting dinner with my partner, ended up staying here for hours and eating dinner here! The music was great (volume and selection!), the caesar salad was by far the best I've had in my life, and the cauliflower bites and burger were great too! The bartender (Chenee) was also so fun. Will definitely, definitely be coming back here again.\n\nReally though, the caesar salad. Absolute must."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcXF5dVRREAE",
            "text": "Chicken wings are delicious. Array of beer selection.\nOffers happy hour and daily evening bar activities/games.\nAlso great oldies played"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeWZTN0ZBEAE",
            "text": "Bonnie Bites with Mango Habanero sauce are awesome!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicFkyQW1BRRAB",
            "text": "They had 1 decent sour beer, went during karaoke night, was a little rough hearing people sing, but was very lively"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6c1p2MjZnRRAB",
            "text": "Great atmosphere, good Scottish beer and really good burgers!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMU9UVWFnEAE",
            "text": "Amazing bar, Amazing staff. Great vibes From the cook, to the bar back to the bartenders. RYAN and CHENEE are amazing they know how to take care of their customers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbElUOWRBEAE",
            "text": "Best happy hour ever! Amazing drinks and food. Definitely come and tip at least 40%!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENU92MTNRRRAB",
            "text": "Great local gem and excellent service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEXzhYanZnRRAB",
            "text": "They doing the dang thing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEXzhYa05nEAE",
            "text": "I love this spot! Great food, great drinks, great vibes! Trivia on Wednesdays is awesome."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEXy1teEZBEAE",
            "text": "Came here during trivia and had a good time! The service was great, Ryan was very attentive and friendly. Even though my fiancé and I didn’t win trivia , we still had a very good time. We recommend trying their Scottish beers since you can’t find them anywhere else around here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEXy1LeWFREAE",
            "text": "Played trivia here on a Wednesday and had a great time!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEXy1LeXFnRRAB",
            "text": "Trivia on Wednesday was Excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEXy1LRVR3EAE",
            "text": "wonderful service, great trivia, amazing onion rings!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEXzlTVmF3EAE",
            "text": "I just started going to this bar and I must say the atmosphere is absolutely cool!!  Great people with a mix that is perfect!  Mason and Gabriel are awesome!  With all of that said, HAIL TO RYAN!!  This dude is absolutely AWESOME!!  He can give classes on customer service.  Wednesday Nights has Trivia!  Heather rocks!!  Thanks for an amazing experience Ryan!!  Will definitely be back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdjk3T0lREAE",
            "text": "Ryan was SPECTACULAR!! Made our visit WONDERFUL!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEamRQNENBEAE",
            "text": "A wonderful experience, Ryan was wonderful as a bartender and making the atmosphere of the bar shine. A great hang-out bar with great prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEamRuZGNREAE",
            "text": "Had many a great night. Fantastic drinks, fantastic staff, just a great spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEamNURGdRRRAB",
            "text": "I love coming here especially if Ryan is working. The food is really good and the beer selection is really good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEamNqM3hnRRAB",
            "text": "Pub Burger was so delicious and juicy ! Definitely will get a second time around ! Vibe is chill !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEamNqQk5nEAE",
            "text": "I love and enjoyed Ryan’s hospitality and his great aura, deff one to have as we enjoy a night out. The pub burger and wings are to kill for !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEOVpiQWVBEAE",
            "text": "Love this bar!!! Literally my fav, all the bartenders are so kind & the vibes are so good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEOVliNVpREAE",
            "text": "Bartender takes care of you and everyone around you. Very chill place to visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdFpfQTZRRRAB",
            "text": "Great food! Ryan was super sweet and hospitable - will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdGZXVS1BRRAB",
            "text": "Great music. Awesome food. And music is a vibe"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdFlUVzNnRRAB",
            "text": "Great drinks better bartender."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMWYyRF9BRRAB",
            "text": "Had a great time with bartender Ryan. Great music and dope vibes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMVozYTJ3RRAB",
            "text": "Amazing experience and the bartender Ryan took such amazing care of us! Love him!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMVozeTdnRRAB",
            "text": "Chill. Cool staff. Only good vibes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMWUyOVB3EAE",
            "text": "Love this spot! Welcoming 🌟…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMmQ3aFNnEAE",
            "text": "Ryan is an amazing bartender! I will definitely be back!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMmVqYk9BEAE",
            "text": "Ryan was the best bartender ever! So patient and so attentive!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbVlmQzJBRRAB",
            "text": "The vibe is truth! Inclusive and welcoming I come religiously cause I feel the bartenders make this a local bar feel and take the time to get to know the patrons! Everytime I step foot in here I feel as if I was meeting old friends!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbWNuVlpREAE",
            "text": "Great service. Ryan is the best!!! So is the fish and chips!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5djR1RERREAE",
            "text": "This is a great neighborhood Harlem spot with a warm and inviting ambiance.  The food is prepared to order and quite flavorful.  The bartender, Ryan, was personable and employed extraordinary hygienic practices when preparing our drinks.  The happy hour was a great deal, and the location had a diverse clientele.  Vale Public House afforded us a well-balanced, engaging, and enjoyable night out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENk1UdzNRRRAB",
            "text": "I’d give atmosphere 10 stars if I could. This is my all time favorite bar. It’s chill. The staff are incredible, and there are regulars that all know each other and talk. I love this place so much I rented it out for my wedding reception.\n\n11/10. Couldn’t recommend more."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1a1l5a3JBRRAB",
            "text": "In was in the area last night and decided to try this Scottish classic pub. At the beginning, I thought the kitchen will be closed because I stepped in so late but it didn't. Surprisingly, my orders were delicious! I had veggie Vale Haggis; it wasn't traditional haggis but I like it. John From Paisley Pie; Is big! I love the top part of pastry crust so crispy and soft inside.\n\nThe bar has plenty of room, back room has drats game you can play with your friends. Next time if I bring more friends I will probably try this room.\n\nBartender was friendly, easy and enjoy taking with customers. It was a nice chilling out weekend and I'm glad I the bar."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MHN5dVB3EAE",
            "text": "Great bar with a huge beer selection, creative and delicious vegetarian options and fun staff. The vegetarian haggis and the corn fritters are a must have! Also a very fun spot for brunch on weekends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNU5uam93RRAB",
            "text": "Fantastic bar - great choice of drinks and also a few local Scottish delicacies on the menu - veggie choices too. Friendly and welcoming bar staff. Well worth a visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbFlqY1FnEAE",
            "text": "Ok. Really cool. Chill atmosphere. People very genuine and nice. First real warm day and came in for refreshments. Can definitely see this becoming a goto after work or kicking off the weekend. Thank you for opening and being so cool!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1Z2J6eWdBRRAB",
            "text": "Went on a Friday night. The Bartender was rude about my music selection although they have a jukebox, so you should be able to play as you wish. He was rude on everything that wasn’t he’s taste of music. Also not interactive with the customers. Rude in front of your face :/"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWOWRXNzZBRRAB",
            "text": "A very friendly and cozy neighborhood pub with a Scottish flair! Be sure to eat as well as drink the carefully curated food and drink selections and don't neglect the desserts. The small menu features many surprising delights including vegetable haggis, authentic Scottish fish-and-chips, sourdough grilled cheese and tomato bisque among other fine touches. Happy hour incentives include reduced prices on beer; late-night incentives include trivia, music and other regular events."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEZ1o3NWNREAE",
            "text": "Amazing food and super warm service. Came here for a first date. We got the burger and the wings. It did not disappoint and in fact exceeded expectations!! Hidden neighborhood gem. Will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5eV9iQzBBRRAB",
            "text": "Top notch bar!  Have the wings or Bonnie bites to start.   Sweet Thai chili is my fave. Any of the pub classics are work it.  I have 2 or 3 friends that really like the tuna melt. Pair with a tennents lager!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNVlTdl9nRRAB",
            "text": "This is the best burger in the neighborhood. Hands down. Simple, well cooked, and absolutely delicious. Great beer list too, and the vibe is perfectly chill."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5Xy1tVVZBEAE",
            "text": "Perfect stop to hang out with friends, good food, awesome drink menu and the people always make you feel welcome 🫶🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eTdIckJnEAE",
            "text": "Ryan is one of the best bartenders I’ve had the chance to get to know. This bar is like everybody’s living room, and all walks of life come through. There’s real community here. It’s affordable. There’s great local and international beer offerings, nice cocktails. And most importantly - the music is always good. Always. And the food is ridiculously tasty! I can’t say enough good things about this spot. It’s a neighborhood staple, long live Vale!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eTdlNENnEAE",
            "text": "Walked in to such an accepting vibe. Ryan was the bartender and he was so knowledgeable and kind. I got the veggie haggis, but the menu was so exciting and inclusive I wanted to try more- the haggis was phenomenal. Ryan suggested the cider when I was unsure and he was on point. The atmosphere was so inviting and fun, I loved ended up dancing on my way to the bathroom! On my way I found that there’re darts! I’m excited to come back and dive more into the experience. 20 out of 10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5ODctRHVRRRAB",
            "text": "This is a great bar with kind staff and friendly regulars. Ryan is a fantastic welcoming bartender and Mason cooks great bar fare.  Drink prices are reasonable and the food is delicious. There is karaoke on Tuesdays and trivia on Wednesdays. I’ve lived in the neighborhood for 7 years and haven’t found my spot and this is it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5di1fOVpREAE",
            "text": "A neighborhood bar at its best- if you’re looking for a bar with good vibes, affordable well made drinks in a welcoming atmosphere with the best bartenders in town this is definitely it. Ryan is why we come back every Friday and mason is always doing something amazing  in the kitchen. We love the trivia on Wednesdays as well! This is a place to meet locals and have a nice chat"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bTlPNkV3EAE",
            "text": "The Vale Public House offers a variety of people a relaxing community bar experience . They have events  nightly.  The food is very good and the service , outstanding ! The bartender , Ryan is especially talented in the service industry , making you feel welcome .\n\nIt is a place I will always visit when I’m in town !\nThank you for continuing to care for the neighborhood ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0a1AzMzFRRRAB",
            "text": "Happy hour is a crazy good deal. Tuna melt every time. Thanks guys."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cThxM3d3RRAB",
            "text": "Had an amazing time at The Vale House last night.  We had a party of 10 and took over the back lounge room. Back room great place to hold court with a group of friends. The owner and bartender made sure we were well taken care of. High…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5aTdhWDB3RRAB",
            "text": "First off, the weekly events that continue are one of the reasons my friends and I can plan what we are doing throughout the week. Trivia to karaoke. Anything is possible.\n\nSecond, Ryan and Chenee are some of the best bartenders in this neighborhood.\n\nAll in all. The drinks are great, tenders are awesome and the food crushes. Can’t go wrong."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeU5PbWJBEAE",
            "text": "I love this bar. I am from Scotland and I am always looking for an authentic Scottish Fish and Chips. The vale has the best one I have eaten in the USA, it is delicious. They also have a great selection of beers and a really friendly bar staff!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5aV8yRkd3EAE",
            "text": "Vale Public House has been a great addition to the neighborhood. My friends & I come here every Wednesday for trivia & we’ve fallen in love with the spot & the staff. Can’t say enough lovely things about the drinks, the food, & the service - shoutout to Ryan! Come for the weekly events, stay for the great prices & greater vibes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdHBMWUFnEAE",
            "text": "Great liquor selection, bartenders have fabulous music taste, $5 PBR, PAC-MAN MACHINE IN THE BACK, also a dart board, very friendly energy, and deep fried cheesecake ??? so good!! I can always tell how much love goes into the food and the service ☺️\n\nI've eaten a lot of bar burgers and theirs are FANTASTIC (w fries that are crispy on the outside and mushy on the inside which is the best kind imo) - corn chowder is to die for also\n\nAlso lots of great events - trivia, karaoke, live music"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMXRuQU5nEAE",
            "text": "Came on a Wednesday afterwork. Ordered the Vale Cocktail and Big Apple Cider, both tasty and affordable. Was able to order the Tuna Melt during the Happy Hour time, very hearty sandwich with fries included, would recommend. Later in the night they started a fun game of trivia, no fee to participate, just use your phone to scan the QR code. Would recommend for a chill night with friends or coworkers after work."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5djVPNzFBRRAB",
            "text": "Thanks to Gavin and Chris, the owners of The Vale have brought one of the very best uptown pubs to the area.\n\nLove the wings and burgers. Great beer list, full bar and he coolest staff ever."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadU9teHZ3RRAB",
            "text": "The chef went to war In that kitchen! You can taste the care and love he puts into his food with every bite! I'm a huge fan of the Edinburger. I would have taken a picture with him but he was far too busy. Very clean kitchen, great atmosphere to have a beer hang out, and enjoy some food. YOU NEED to check this place out best spicy margarita around. =)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtN2J6UU5nEAE",
            "text": "Went here last night for a few drinks with a friend, but ended up staying all night for their Trivia Night as well! Great time, awesome staff (esp. Gavin the bartender), amazing food and just a cool atmosphere. The neighborhood and the city are lucky to have a unique place like this... I'll definitely be back!!! :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbE4zWUVnEAE",
            "text": "What a fun place! The room and  dart board in the back is a nice touch. I was a nice diverse mix people there and the night we went it was karaoke night!\nThe have great window that open to the street - The only problem was the outside noise - cars, people, music from next door, and smokers cause the bar to have to close the great windows"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEd0l1UnRBRRAB",
            "text": "5 stars… I’ve lived in this area for a few years and finally decided to stop in the vibes were very chill….as a female looking to get out more solo! it was comfortable/easy going, and the pasta!!!!! might be might my fave. I will definitely be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlX3Z5OUxREAE",
            "text": "Stopped by here Sunday for the first time. Really cool bar with lovely private booth, back room, out door seating as well as the  welcoming main bar area. I liked that they had options of 10z drinks ( as well as pints) for those who might…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5ODUzeEJBEAE",
            "text": "The bartender Ryan is incredible. He’s bartending during trivia on Wednesdays and the vibes are immaculate. If you’re looking for something fun to do mid-week, their trivia night is perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcWM3bTZ3RRAB",
            "text": "Super chill and fun bar! Excellent happy hour. Very cool vibe and lots of fun regulars. Great bartending - Ryan is amazing! And lots of cool beverage and food options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMXEyZE1BEAE",
            "text": "Had a ball at Wednesday trivia night at The Vale! Everyone is super friendly. And Ryan was awesome, letting me taste and then land on the Bellhaven Black Stout from\nScotland."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCak5UT3VnRRAB",
            "text": "Knew Gaven from my old hood. Loved him then.  Love his new place.  All the staff is professional and welcoming.  This is my home away from home.  The food is comforting  and there’s live music and trivia (if you are into trivia)! It has a juke bod and bartenders that make you feel like family. Cant gush enough"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZ0p5a3p3RRAB",
            "text": "Not enough words to describe the best bartender in Harlem Ryan @ the Vale. If you wanna feel like you are in an environment that appreciates your presence,  your  time  comes to the Vale. You  wouldn’t wanna miss a night there. Come and enjoy it like I always do!"
        }
    ],
    "reviews_count": 85
}