{
    "name": "cha menya ramen(茶麵屋）",
    "place_id": "ChIJVb-ag9qJwokR7cfpSYTb0K0",
    "grid": "QN11",
    "address": "251-20 Northern Blvd, Douglaston, NY 11362, USA",
    "rating": 4.7,
    "user_ratings_total": 176,
    "phone_number": "(347) 235-4775",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbldFMXBja3M1Tlc0MGJrVTVUbFkwUm1vM2VrRRAB",
            "text": "The tonkatsu ramen here is absolutely incredible\n\nThe broth is made in house, they have my favorite style of noodles with are straight noodles\n\nThe chashu is by far the best i have had, it was so tender that it fell apart in my chop sticks\n\nAnd unlike most ramen restaurants, their chashu is made in house\n\nThe look of the chashu is unique compared to any other ramen place I have eaten at\n\nI had to drive 50 mintues to get here\n\nBut I am coming back because I really want to try their Tsukemen ramen\n\nI love this place"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRemQyRlZjalptVlY5blgySkZPRTVTVG1jeVIxRRAB",
            "text": "Classic ramen very delicious, tonkotsu broth rich, egg creamy and whole egg included for good price"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WT1ppMWtUVnBCU1ZCWlFWTmhORGhXY1VoT2RuYxAB",
            "text": "We tried Macha and Shoyu ramen. They are pretty good. The flavors are classic. The price is reasonable. The restroom is also tidy and clean. It is comfortable for family."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UWMzQTFkblpwUWtNNVpERlpjVmRvTjNwRWMyYxAB",
            "text": "Very disappointed. Won’t go again even though it is in the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twb1VVdFZWRlJtVWxsWldESTFiMGt5YURKaFRtYxAB",
            "text": "This is some of the best Ramen places I have ever been to. While the restaurant might seem small, the Ramen options they serve are carefully crafted each with their own unique vibes. The Hojicha Ramen is my personal favorite as it infuses pork flavors with roasted tea. Pricing is decent, especially considering the innovative menu design."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdE4ycDBiWFZwWTJwRlpXOVVNMVZtVVROcE4wRRAB",
            "text": "When I stepped in there was a strong smell… I couldn’t put my finger on it. It was strong enough where we thought about leaving but as soon as we were thinking to a whole family came in to eat. So we gave the place a chance. There were three pesky gnats flying around stuck on the curtain which threw off the whole date vibe 🥲 we ordered four things on the menu and the bamboo shots tasted off so I stopped eating them. Ramen was overall pretty good. Orders came out pretty fast. Atmosphere was family/ date vibe. Bathroom in the back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UWVXTTJiREIxVVZGaFVGQlRNWGRMYVZWQ1ptYxAB",
            "text": "Amazing authentic japanese food in Great Neck! I was surprised at how good the broth and tsukemen were. Also the karaage and miso black cod are solid as well. A bit pricey but definitely worth a visit. Fast and friendly service as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWFpuTXhVRmRTTkU5TlluVldkbGhHVlhWbGRtYxAB",
            "text": "Ive been here a few times awhile ago, but recently dined for dinner to try a few things I hadn't. Everything I had here was amazing, and it makes up for the price being a little high. There was only one waiter when I went but she was tentative to every table and I enjoyed my meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nemRWSXRXRWRhZVdGcGRtUklibGh6TjNGTlEzYxAB",
            "text": "Went there for the ramen, only thing is that the portion was a bit small. They gave us an entire egg each though, service was quick, and the food was relatively cheap and affordable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVlJXSnJNVzFtWWxOZlVGQkdVemwwUVc1Q01FRRAB",
            "text": "My favorite ramen in Queens. Delicious classic ramen. I go at least once a month."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNlYxTlpaa3RIYjJRMmRqTnBNbVpYVEdkS05WRRAB",
            "text": "Ordered a classic ramen. Really enjoyed it. The pork was tender and not overly fatty. The noodles and broth tasted great. I liked that they added veggies in the ramen to make it healthier. Just a great little place for ramen.\n\nThe place can be hard to spot. They don't have a big sign, so you can easily miss it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWclpqZFBOMjgwVGpGU1JuZzJYMUk1TkcxdGQyYxAB",
            "text": "The fried chicken was great but I wasn’t a fan of the tea broth but I guess it turns out I don’t like tea and noodles together"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MVgxWXlla3RpTlV4ZmQydDNkM2t0YTBGZk1rRRAB",
            "text": "Best ramen in NYC."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RFJsRlpWbW8yYm1oUFEwTnJjRVpRYTBSVGMwRRAB",
            "text": "What a great cozy local Ramen spot for Little Neck. Simple menu however everything is on point especially the authentic Japanese style Gyoza 🥟. I have nothing but praise of their food ,service and low prices for today’s standard.\n\nI will definitely be back sooner than later and advise all to do the same."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neE5VUmhkbk5wV1ZGeU1HRlJRVFV0VUVacmEwRRAB",
            "text": "The waygu Ramen and the hojicha ice cream and latte were out of this world. Will definitely be coming back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKVG5vdmZqeU9ybHhRRRAB",
            "text": "I usually go for their ramen but they recently added rice to their menu :) and it did not disappoint!!!!\n\nI got the Miso cod dish & it came with purple rice, miso soup & 2 sides (a konjac jelly side & spinach/seaweed salad) SO good\n\nTheir ramen & apps are also 10/10. Service is also incredible!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNZnVnYXFSbjZEeWRnEAE",
            "text": "The ramen tastes very good and the atmosphere is relaxing. most importantly the food is clean and feels good after eating. Thank you."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKVEZ2OEh6akxyZDJRRRAB",
            "text": "Was really craving ramen with the rainy weather and this spot did not disappoint! The broth was incredibly rich and the chashu was very flavorful. The karaage was also really good. Service was top notch and friendly. If you’re looking for a ramen spot in the Little Neck area, do yourself a favor and come here!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc1ppby13RRAB",
            "text": "A wonderful place for ramen!\n\nWe started with the karaage. The chicken was crispy, juicy, and tasty.\n\nThe classic ramen was excellent. The broth was rich and creamy. The noodles had a nice texture. The pork was tender and juicy.\n\nThe matcha mont blanc was a delightful end to the meal.\n\nService was excellent.\n\nDefinitely would recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdE5Eb3NRRRAB",
            "text": "Delicious ramen especially the brith made from green matcha tea."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRckwzWVV3EAE",
            "text": "Authentic Japanese ramen with rich flavorful broths"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRekktRmtnRRAB",
            "text": "Authentic Japanese ramen with rich flavorful broths"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRek9HWFZ3EAE",
            "text": "Authentic Japanese ramen with rich flavorful broths"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReklDdHpnRRAB",
            "text": "Authentic Japanese ramen with rich flavorful broths"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURROFBfR1h3EAE",
            "text": "Authentic Japanese ramen with rich flavorful broths"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnblpYOEtnEAE",
            "text": "Authentic Japanese ramen with rich flavorful broths"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMXFmeFR3EAE",
            "text": "This is one of my all-time favorite ramen spots in NYC. It's hard to believe this restaurant is placed in inconspicuous Little Neck and not in Manhattan because of how high quality the dishes are. Ramen lovers must come here.\n\nIt's very quaint and quiet, which brings traditional Japanese shop vibes. There is always only one server handling the entire floor but the service is never subpar. My favorites are definitely the tsukumen and classic ramen. The yuzu shio is great when I'm craving a clean and lighter broth.\n\nDon't sleep on their starters however, like their kaarage and fried enoki mushrooms!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBZ3NfTDB3RRAB",
            "text": "Cozy restaurant but filled with unique and delightful flavors. Perfect for a cold winter day. We had yuzu tea to start and liked it a lot.\n\nWe tried the shrimp, tea and vegetable ramen, all delicious. The vegetable ramen was slightly salty for my liking but the flavor was good. The appetizers were fantastic as well. We ordered the fried enoki, gyoza, squid and kaarage.\n\nFor dessert we got the chestnut Mont Blanc with hojicha ice cream, definitely recommend.\n\nWould return, great local ramen shop"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfeHVtXzBBRRAB",
            "text": "TEA/RAMEN lovers must come!\nThe matcha ramen is absolutely amazing, flavorful and hearty especially with the chicken slices simmering in the matcha tea broth.\nFor tea we got a pot of Yuzu Matcha and it was delightful:)\nStaff is friendly and the atmosphere is small/cozy\nYou won’t find ANY other place that does it like Cha Menya"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOThyUjR3RRAB",
            "text": "Little neighborhood noodle shop with good quality classic and shoyu ramen. The chasu and pork belly were both tender, the sous vide eggs perfectly runny, the noodles were not overdone and the star attraction would probably be the rich broth bases for both. We ordered a side of the fried chicken karaage to accompany our noodles. Not greasy, fried thigh meat. Good ramen by ladies that probably work here 10 hours a day to offer simple, well-prepared comfort food. No congestion pricing drive into NYC, easy parking on Northern Blvd, and about $70 for lunch for 2 people with tax, tip and a soft drink, pretty fair for nowadays."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dWVLLVhBEAE",
            "text": "Great ramen and a modern chill environment. Tailor made for the colder months."
        },
        {
            "date": "10달 전",
            "language": "zh",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2b2IyWVFBEAE",
            "text": "最难吃拉面 而且进店吃不能乱带东西 各种汤都很咸 🇯🇵最难吃面🍝"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzc1lhZF9nRRAB",
            "text": "Great! got the dipping ramen. clean restaurant; Kind staff"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzN0lpN1RBEAE",
            "text": "My daughter love their classic ramen’s broth and I had their tsukemen and love the texture of their dipping noodle with just the right “bounce” and perfectly a dente. Yummy and unique dessert to finish off our very satisfying meal. Everything just hit the spot just right."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMkpULXBBRRAB",
            "text": "Every dish is delicious\nAttention to details\nClean and cozy space"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxZ2JLOUtREAE",
            "text": "Every single ingredient is delicious! I’ve been coming every week since I discovered this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMHJhWFhBEAE",
            "text": "Best Japanese Ramen"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMUxUR1JnEAE",
            "text": "We loved our Tuesday night dinner here. The ambience was cozy and homey. It was not too busy when we came, and the service was warm and friendly.\n\nThe food was so good that I didn't want to leave any behind. I took leftovers home and enjoyed them again the next day.\n\nWe will definitely be coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdmNDN2RREAE",
            "text": "The server was unfriendly and did not make us feel welcome throughout our visit. The hojicha ramen was particularly disappointing—bitter and lacking in flavor. My friends tried other types of ramen, but they also fell short considering the price. I would not recommend any of their tea ramen options. 2-star is all on the bad service.Food was okay."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURib3BESG93RRAB",
            "text": "It's a small japanese restaurant but it's comfortable when you dine in.\nWe pass by many times but didn't go. It used to be another japanese restaurant that have Japanese servers many years ago. We decided to dine in because we didn't have an idea what to eat. Surprisingly it's good.\nIt's a ramen restaurant. Matcha ramen, Hojicha ramen, shoyu ramen etc. I ordered tsukemen because I never had it before. I like it (I have never had it at other ramen place, so I don't have a preference to compare). Not salty. I also like Ika and the Azuki Matcha espresso.\n\nIt's good place to dine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENE5leFVREAE",
            "text": "The server was very friendly and kind, and the service was quick and attuned. The ambiance is very comfortable, where although the seating are a bit on the tighter end, it's still distanced enough where you're not on top of each other. The hojicha latte was delicious where it was perfectly sweetened and thoroughly mixed without tasting any grains of undissolved powder, highly recommended! The Karaage was very tender and juicy, with a nice crisp and delicious aioli to pair perfectly with it! The Tsukemen Ramen, although flavorful due to its rich dipping broth, was a bit overly simplistic where the ingredients didn't really add much to its overall flavor profile. Adding some corn or seaweed may enhance the dish further by giving it more pleasurable contrast in terms of texture and flavor, but that's just my personal opinion and preference. However, the noodle had a nice bouncy texture and the egg was flavorfully gelatinous, which were both delicious. Overall, it was a good experience and I look forward to returning to try their other ramen selections!\n\nThank you for reading and best of luck! (:"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMG9ib0t3EAE",
            "text": "Love the ramen here!!! The broths they offer is not your typical ramen broth that you find in almost all the spots opening up everywhere in queens and LI but it’s amazing. Can’t go wrong with the classic ramen or the shoyu ramen. If you want to splurge, their wagyu ramen is def something to experience.\nAsk for hot chili on the side if you want a little kick to the flavor.\nWe always leave with matchapresso in to-go cups after our meal. Delish!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dFpMZUl3EAE",
            "text": "This is my all-time favorite ramen place. I like getting the classic ramen because the broth is so silky, and the toppings are nicely balanced. Their sides and courses are both tasty and not too heavy."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeTU3Q29BRRAB",
            "text": "Love this little noodle house. Store made noodles with special soup (tea) base.\nWe went in party of 5. We were welcomed and seated right away. Karaage was light and juicy inside. Ika was tender and flavorful. I had the Hojicha Ramen, it's both light and full in flavor. Not the kind of flavor from salt. It feels comfortable to eat. The best part of our meal was the dessert... Chestnut Mont Blanc with hojicha ice cream. Not too sweet ...just delightful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaWJ1a1lBEAE",
            "text": "2023.08 they have classic ramen and mocha soup ramen.  They have many Japanese beer to choose from.  Regarding the ramen, only if you like mocha or like to try new stuff. Otherwise you may not like their signature mocha soup ramen.  It is…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eHM2MF9RRRAB",
            "text": "I was hesitant to go here because of the drive. It was at least 50 minutes away because of traffic. But my daughters want to bring me here for Mother’s Day, and so we drove, and it was actually worth the drive. The food was great, I like the Ika grilled squid and the triple shrimp Ramen noodles. Our server was really nice. And after all that, my daughter pays the bill, overall it was a great experience. Thank you!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2djduVVdnEAE",
            "text": "We were searching for recommended & top-rated restaurants in the neighborhood. Cha Menya popped up and we love ramen so much, so we decided to give it a try.\n\nThe decor is adorable and authentic but super tiny with limited indoor seating. The wait for a table wasn’t too bad but the wait for ordering & food was really bad due to the lack of staff.\n\nOptions on the menu weren’t in a great variety but decent enough, 5-6 kinds for appetizers and about 7-8 flavors for ramen. We had their Fried Enoki Mushrooms, Karaage, Tofu Salad and Wagyu Ramen to share with a group of two.\n\nThe food was amazingly delicious especially the crispy Enoki and the broth of Ramen, which is super creamy & rich. It’s definitely one of the best spots for Japanese Ramen we have had recently."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtbjhyUzFRRRAB",
            "text": "How often do you hear of tea and ramen together? Well this is your place if you enjoy trying something different than your typical tonkatsu ramen.\n\nThe ramen texture was pretty good. Not overcooked and has a pleasant chewy texture. The pork chasu that comes in these bowls of ramen is very generous compared to most other ramen places. The only thing, is that it was a little salty for my taste. As for the ramen broths, out of the three I tried. I would stick with the classic ramen. The matcha and hojicha are very interesting flavors, and not something you can get everywhere. But they were not my personal favorites. The tea flavor is very strong but I personally feel like the tea flavor and the meats don't go well together but that is just my personal taste, other people may really come to love it. The squid (Ika) was really good. I loved the sauce that came on it and the texture was just right. It was not overcooked and super chewy. Overall this is a great places to get a bowl of ramen without breaking the bank. The staff is very friendly and nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXZ2J5ZGp3RRAB",
            "text": "Cha Menya\n\nAs of 2022, Cha Menya is placed #1 on my personal “Best Ramen in NYC” list.\n\nEating ramen will leave an impactful experience. It’s one of those rare experiences that you will remembering the taste of their ramen broth forever and knowing any other ramen you have afterwards cannot parallel their authenticity until you find the next “best” ramen.\n\nWagyu Ramen - $32. If you had never been to Japan to eat wagyu beef, this is probably the best time to try their wagyu ramen.\n\nBroth - 5/5. It’s very concentrated in flavor and I rarely use this word - Divine. Another thing I will say that the chef uses truffle paste in this broth as well. While I initially went to look for the “best tonkotsu ramen” this ramen truly is in its league of his own. Every slurp of the broth isn’t salty that makes you want to sip water. In fact, it makes your cravings and hunger even stronger (if that makes sense).\n\nCha shu - 5/5. In this particular case, it’s not cha shu but the wagyu itself. The wagyu is thinly sliced, with an egg yolk resting in its center. The meat itself melts in your mouth without having to chew on it at all.\n\nNoodles - 5/5. The noodle has a very nice bounce and chew to it. While thin noodles aren’t my preference, I have a newfound appreciation for it as it absorbs the delicious broth as I’m slurping the noodles.\n\nSide note: every other items I’m about to mention is highly recommended on trying. The chef here has truly mastered the skills in culinary and will make you appreciate everything and anything he cooks.\n\nClassic Ramen - $15.00.\n\nKaraage - $9.00. Japanese fried chicken.\n\nHamachi - $16.00. Thinly sliced sashimi with yuzu jalapeño dijon mustard.\n\nRose matcha latte - $6.00. It was so good, we got a second one to go!!! The flavor is very concentrated and not watered down like other places that would sell rose matcha latte.\n\nAzuki matchapresso - $7.50. Japanese green tea with expresso and red bean.\n\nChestnut Mont Blanc - $9.00\n\nTotal - $109.42"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURtNXBBWBAB",
            "text": "Very cozy ramen spot on Northern Blvd. and 251st. Limited seating and quaint. The ramen here is not as packed with ingredients as the typical ramen houses but the flavors are on point. I tried the Wagyu Ramen (A5 Wagyu) and my friend tried the Hojicha Ramen. Both were delicious and flavorful. I really enjoyed the Wagyu - tender and so tasty. Tried the fried enoki mushrooms too. Extra crisp and definitely deep fried. Nothing special - but still good. For dessert, I tried the chestnut mont blanc served with ice cream. Nicely plated and you can taste the chestnut in the cream. Service was fine as it was a quiet evening in. No wait for a table on a Wednesday night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNDdPTXBnRRAB",
            "text": "Went there with my daughter and both of our dishes were flavorful and fresh. You can select toppings to add , otherwise the ramen has few toppings but all excellent in flavor. They have a green tea ramen but we were not adventurous to try.…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOWFQb1dREAE",
            "text": "Ramen is so good. The broth is rich and clean. The place is quite small and easy to miss but try it you won’t be disappointed.\n\nEdit: Went back and tried the hamachi and wagyu ramen. Both were fantastic! The broth tastes exceptionally clean. Definitely my favorite ramen spot in queens."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdHViN2V3EAE",
            "text": "I’d consider this a specialty ramen house. Not the typical representation of ramen you’d find in more “mainstream” ramen places. It’s unique.\n\nThe inside is small. If every seat was full, I think they can seat 20-25 people. It feels homey.\n\nThe food was fantastic. All of it.\nGet the Ika (grilled squid). Just delicious.\n\nWagyu ramen was interesting. I wouldn’t get this all the time. You get one giant slice of A5 wagyu beef which will take multiple bites to finish. The added truffle flavor makes it a rich bowl. I thoroughly enjoyed it.\n\nThe chestnut Mont Blanc was very well done. The cake portion reminds of of chestnut cakes you can from Asian bakeries. And hojicha ice cream was a very nice complement.\n\nOverall I would return again and try their other ramen!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bnJPbkNBEAE",
            "text": "I'm so happy this place has opened in Queens. I'm an avid lover of Tsukemen, but NYC doesn't have too many places that do it well. When I saw that Cha Menya offered the dish, I knew I had to try it out. I've been here twice now, and I can confidently say that it's reaaaal good - get it, you won't regret it. Noodles perfectly cooked, seriously melt in your mouth pork slices, and really nicely seasoned, savory broth to bring it all together.\n\nThis place also has a really good drink selection and I'm really happy they serve chestnut mont blancs for dessert - a perfect end to a satisfying, savory meal. Lastly, the owner(?) is extremely sweet and service is always great/attentive even when it's busy. Safe to say I'll be a regular here whenever my ramen cravings hit!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNDVQakJBEAE",
            "text": "It’s great to be back again to see they have more choices in their menu with great improvements on their food. My favorite is Ksukemen Ramen!! The reason I gave 4 starts is I hope they can do better and better and keep on surprising us!! Highly recommended!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MXB1VGdRRRAB",
            "text": "The chef has worked at totto ramen and some other popular and high-end ramen restaurants in the city. His noodles are custom order 30% hydration. Which is lower than any ramen restaurant I know of. Generally, noodles with more water will have a chewier texture. Lower hydration noodles tend to have a bite, or a snap, in terms of their texture.\nLofi music. Amazing plating. Quality untensils. Great interior design. Just opened 2 months ago.\nSo much attention to detail. Drinks with pieces in them will have a boba straw so you can slurp all the yummy stuff.\n\nThis level of ramen is super rare in Queens. Especially the east side of Queens.\nHighly recommend hamachi for starter.\nThe Hojicha Ramen has a strong tea flavor which I like. I actually like it better than Nippon cha's tea ramen\nThe classic ramen is great and has a nice creamy like broth.\nThe Matcha mont Blanc was plated very nicely on a cold stone plate and was amazing."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhOHU3enhBRRAB",
            "text": "Ordered the karage app (8) and the classic ramen with chewy noodles (15). Karage was crisp and juicy with a very nice dipping sauce. Noodles had a beautiful elasticity and mouthfeel and the broth was very flavorful. The portion sizes are…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbVp6UHB3RRAB",
            "text": "OMG…… they’re open finally!!  This was a favorite for me and my family. The food is still like before, great appetizers and even better ramen. Flavor hasn’t changed and portions are good!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdlB6c0FREAE",
            "text": "Beautiful interior, awesome service, amazing food! Highly recommend. We’ve had the tsukemen, fried enoki appetizer, wagyu ramen, and yuzu shio ramen. Each dish was unique and delicious. This is a top notch ramen place that rivals restaurants in the city. Quickly became our favorite go-to spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeHRTUTlBRRAB",
            "text": "Went for lunch and before regular lunch hour. The place was small, got seated right away. Placed the orders through the QR code; however, asked for the check and paid regularly.  Ordered tsukemen for the first time, the separate broth and noodles style. The broth was a little too salty (so heavy on the garlic) and too much for the portion of the noodle, a little bit of a waste.  Before this visit, I came here and tried the classic ramen. It was good (didn't take  the pic of it)."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2LW9INVV3EAE",
            "text": "The place is a little cozy place, great staff but under staffed.  There's a wait, but worth the wait.  The broth is tasty, but not too fatty.  The noodles is a bit hard for my liking.  The fried chicken was very good and juicy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHcllDTDhnRRAB",
            "text": "I eat here once a month it's a nice cozy restaurant. There's sometimes a wait on the weekendso be prepared.\n\nThe ramen is good so far I've tried the Hojicha, Classic, and Tsukemen. Out of those I'd definitely recommend the Tsukemen it's super flavorful and definitely grab a karaage on the side.\n\nI got a ramen to go once, it's still decent but I'd definitely recommend eating in doors!"
        }
    ],
    "reviews_count": 62
}