{
    "name": "The Lazy Cow",
    "place_id": "ChIJgXmbLBZhwokRZs1yZZI0se0",
    "grid": "QN11",
    "address": "42-07 Bell Blvd, Bayside, NY 11361, USA",
    "rating": 4.3,
    "user_ratings_total": 148,
    "phone_number": "(917) 444-1790",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscWRuVmZUbkY0TTJKSU1WQkdTekJPVFdSellWRRAB",
            "text": "The Lazy Cow\nThe Lazy Cow is a cozy, casual restaurant known for its hearty comfort food and relaxed atmosphere. The menu offers a variety of options, from juicy burgers and sandwiches to salads and daily specials, all prepared with fresh ingredients. Portions are generous, and the presentation is simple yet appealing. The staff is friendly and attentive, creating a welcoming dining experience. Prices are reasonable, making it a great spot for a casual meal with friends or family. Overall, The Lazy Cow delivers satisfying food in a laid-back environment."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcE1sVmxlbEl6UVdWRFluRTFVMjh0UWxCT01sRRAB",
            "text": "Pros: the cocktails are fantastic, they are of high quality and you can tell there's a lot of pride when it comes to the art of making and mixing these drinks. TJ, our server was incredibly hospitable, when he noticed that my pants were dirtied from spilling a drink or sauce, he quickly sprang to action by offering me an alcohol wipe to clean the mess and was always at the ready when my friend and I had a question. The atmosphere is also beautiful as well.\n\nCons: the food isn't great. I ordered a pasta dish and it tasted like there was no seasoning or flavor, like the chef just dumped a can of ragu and meatballs, warmed it and sent it out the door. My friend and I also shared an appetizer of the wings and there was very little meat on the bones, the blue ranch sauce on it also tasted like the chef just squeezed it straight from the bottle. When you're spending a good amount on food, I would hope that the cuisine can reflect that price. I hope the owners/chefs can fix these issues and add some love to the dishes as this place has so much potential to be a great establishment, but sadly the next time I come, I'll come just for the cocktails and not the food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCV1YwSlZkek5aUjBOaFpFVlFSMGRTWnpaWE4wRRAB",
            "text": "Had some drinks and was fairly decent. Bartender was polite and helpful. I didn’t try any food so can’t comment on that.\n\nOverall good atmosphere, spacious and clean."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUE9UaFZSakZDUWxCQ1dsZHRVbFV6UkhORldWRRAB",
            "text": "The service was excellent which made up for the wait for the food. While understandable, this is a bar first and foremost, we were the only patrons there so you could have sped up the cooking. The food was average at best, but our Colombian server (who possibly could also have been the owner) was more than gracious comping us a whole pitcher of sangria and an extra guac when all we asked for is chips."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVlJEbGxVVm96Y3kwelpGZGZja1ZLV1RKSk5IYxAB",
            "text": "Our server Ash was attentive and friendly. 😄 We had a great time!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VM2Fsb3RSMkpQYjB4RGRUQnFRMUowZWtRd1JXYxAB",
            "text": "The food is phenomenal and Ash handles tables and the bar effortlessly I wholeheartedly recommend this restaurant"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UU9GQXRRbHBQVkY5dE4weHZURWN3ZEVwbFJWRRAB",
            "text": "Love the ambiance. Ash was soo accommodating to our 11 months old daughter. He put in her favorite show while me and my husband enjoyed our dinner. Definitely would come back again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd1lrMXZlRGRZYUdKeFNYbHJiWHAzY2xwTmRuYxAB",
            "text": "Amazing food, service and great vibe... shout out to Ash for accommodating my 11mo old daughter while dining here!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQlRsRnBXVkZ2TlhCRllVMXZZMnhzZWsxdVozYxAB",
            "text": "Stopped in for a quick drink but left hours later. Ash is a great bartender, gave exceptional service. Great music and very friendly. Great drinks !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMFV6WXhNRTEwVDBjNGRUWmpORWszY2xsVmRXYxAB",
            "text": "What a blast it is to hang out with ASH! Hope to see him when we come back. Thanks for the recs!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SemJUUkphVmM1WjBaeVltMU9NV1U0TkV4emFFRRAB",
            "text": "Though the food was good and the waiter was just fine my eyeballs almost popped out of my head when I saw 15 shishito peppers on my plate for $9.00.   In addition, the menu that they have online and even in the restaurant was incorrect and not updated so what I came to eat here was no longer being served.  I did come also for the peppers but COME ON  15 peppers for $10 including tax?  The waiter was nothing but a gentleman and he said it was on him. But I will not come back here again.   It is a shame because those peppers were delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveGVtc3dTbUZaZFZNd01qazBTMk5LV1dwWFlWRRAB",
            "text": "We visited a little over a month ago on a relaxed Saturday evening, drawn in by the good reviews and local reputation. We came as a small group of friends, expecting a pleasant night out. The place wasn’t busy at all—just a few people at the bar, and we were the only table seated in the dining area.\nSurprisingly, there were about 2–3 staff members on shift, but no one came to our table for the first 15–20 minutes. When we finally ordered drinks, it took another 20 minutes for them to arrive. After 45 minutes of sitting there, we still hadn’t had the chance to order any food, and ultimately decided to leave for another spot.\nIt felt like a frustrating waste of what should’ve been a golden hour on a weekend night. Given the experience, I didn’t feel it made sense to comment on the food, pricing, or atmosphere—because unfortunately, we never got that far."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCM2JUZFFVbDltYUU5cWVVUktWMU5FVFRWSlJsRRAB",
            "text": "We celebrated a birthday party at The Lazy Cow, and it was absolutely perfect! From the moment we walked in, the ambiance was warm, welcoming, and just the right vibe for a celebration. The layout and lighting created the kind of atmosphere that makes you want to stay all night stylish, fun but relaxed. It really felt like the kind of place made for gathering with good people.\n\nWhat truly made the night special, though, was the exceptional service. Ash, in particular, went above and beyond to make sure everything ran smoothly. He was attentive, helpful, and incredibly thoughtful  checking in with us throughout the night, making sure we had what we needed, and always doing it with a smile. You could tell he genuinely cared that everyone had a good time. His energy and attitude really brought the whole experience to life."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRE9IZDZTMnBXTW1WMVNuVktTalp1VDBvM0xVRRAB",
            "text": "This place was amazing our waiter, Ash opened the patio area for us, since we had our service dog with us. And even brought out an extra table and chair ( for our dog )for us. Our server recommended great plates for us also they were great. Oh our bartender TJ recommended us a s’more old fashioned which was to die for. Sucks it’s only for today tomorrow only( it should be on the main menu)\nWill def come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUlprUTNTa1Z6UnpSQmNtY3pNVmhNV21wUVJYYxAB",
            "text": "Amazing service from Ash & TJ\nThis was the cherry on top. The Lamb chops and ratatouille were so tasty."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SME5tNU1jbWt4UjNNeE1GazROWHBPTVRadGQwRRAB",
            "text": "I was looking for a place for a mini high school reunion. It's been 32 years.  Long overdue. I'm happy that this was the place for it. The location was easy for all of us to get to. The owner, Jee, was great in helping me coordinate with the planning. She gave suggestions and was very accommodating of customizing the food menu to serve. She was flexible going off the menu. Food was great. We did buffet style so we wouldn't have to be fixated at one seat for the night. We all had a great time. She provided a projector so we could show flashback photos. We had a private room and there were about 25 of us. The person at the bar making the drinks did a great job. I would definitely want to come back again to host another reunion. Thank you, Lazy Cow & Jee, for making our long overdue HS reunion memorable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMSGFsUHlrbkpEam5nRRAB",
            "text": "The Lazy Cow burger was amazing and the service was great 🤌🏼. Ash gave some great recommendations. Would definitely go back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNVGFzcnlPbWJUWS13RRAB",
            "text": "Great place to just chill and have a drink, or just talk and chat with the bartenders, Ash and T.J. who are both great at what they do, they make amazing drinks."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLeVZ1ZXFUN3Z5V1VREAE",
            "text": "From the moment you walk in, the vibe is awesome — cool design, cozy atmosphere, and a laid-back yet stylish feel that sets it apart from other local spots. The food is surprisingly great for a bar (definitely above average), and every dish we’ve tried has hit the mark.\n\nSpecial shoutout to TJ, our server and bartender — his drinks are amazing! Creative, balanced, and always served with a great attitude. Honestly, he makes the whole experience even better.\n\nThis place deserves to be way busier than it is. With the food, drinks, and atmosphere all being top-tier, it’s a hidden gem that more people should know about. Highly recommend for a night out or casual hang with friends."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJelZ2Nl9LZ00zNVVnEAE",
            "text": "Best drinks in the area"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOeWIwZno2aTd2UkxnEAE",
            "text": "Loved this place! Great drinks, food is good (really enjoyed the guacamole and the gruyere burger) but the service was the best part by far. Wonderful folks here who totally exceeded any and all expectations. Thank you!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHIycnl3RRAB",
            "text": "10/10 experience at The Lazy Cow! We came here today for my birthday and it was amazing! Food? Excellent! Waiters? Excellent (his name is Ash)! Would definitely go back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcHIySURnEAE",
            "text": "Ash was very attentive, and the food was really amazing! The short rib melted in my mouth, and the drinks were so refreshing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcHJHQVR3EAE",
            "text": "ASH is a great bartender. Makes every drink special and amazing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaHByamdnRRAB",
            "text": "Fantastic food, and excellent service. The gruyere burger was amazing. The bone marrow melts in your mouth. The churros were perfect and the creme brulee was top notch"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOUt1dHJ3RRAB",
            "text": "The atmosphere is great, the drinks are great! The food needs work. Even adding salt would help. Everything just seemed very bland and the prices are up there. The food needs to match the atmosphere. I had the branzino- lacked flavor, barely any dressing on the arugula and a small simple change could be cubing the apples so it mixes into the salad better."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbmEzS0R3EAE",
            "text": "Came in on a late Thursday night and couldn’t have hit a better spot. Food was really good and tasty. Drinks were fire and the service impeccable. Both the chef and the bartender were very kind and attentive to the details. If you’re down for a bar vibe with great food, this is the spot!\nDefinitely coming back whenever in the area. TJ and Segundo were the best!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aU1henBRRRAB",
            "text": "The short ribs were absolutely fantastic! Had great service and will definitely be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ME9hLVR3EAE",
            "text": "My friends and I stopped here during my travel to NY. The experience at the Lazy Cow was tremendous.\n\nThe drinks were great, the food very tasty, and the staff (AJ and TJ) were beyond nice and friendly.\n\nI will note to return to the Lazy Cow again when next I travel to NY."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3b0staWd3RRAB",
            "text": "My boyfriend and I stopped in last night for dinner. The food was pretty good, but the service was excellent. The waiter was attentive and the bartender was great. He does a cocktail of the day and he even makes his own bitters at home. He truly cares about what he does and was pleasant to chat with. Would highly recommend for a chill spot to have some drinks on a Friday night!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRa05LUzFBRRAB",
            "text": "Stopped by for a drink 🥃. I would like to go back to eat soon"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOHJ6dEdBEAE",
            "text": "First things first, I feel really bad I never went in Lazy Cow before tonight but I’m glad I did. I’ve passed by forever and wasn’t sure what it was. I liked that it was always quiet but busy enough. Tonight I decided to go out and treat myself after a long week. Just go out and chill and be mindful . I knew I made the right decision when I walked in great music playing cool rock art on the wall great light fixtures. Bruce’s born in the USA was playing I knew I was in the right place . REM followed.\n\nI was greeted by the bartender TJ who was super friendly and accommodating for me I don’t drink but miss the social aspect of bars. He turns out to be a super mixologist extraordinare. He said sure I make so many mocktails! What an experience it checked all the boxes. He even said he’d make me different ones when I come back . I will be back , TJ was maybe the best bartender I’ve ever had and I’ve lived all over NYC the last 23 drinking years of my life 😆\n\nI hope to be a regular listen to some tunes , the NY strip steak was phenomenal cooked to perfection nice glaze. I will return . What a vibe . Don’t hesitate don’t sleep on Lazy Cow!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2ajkyNVpnEAE",
            "text": "Waste of time and money. The name of the establishment describes the general attitude of the cooks and management apparently.\n\nThe ambiance at this bar is pretty good. Very chill, eclectic, laid back and artsy. clean. Kind of a sexy place. The food was not good at all and very overpriced. For the cost the quality was extremely below par.\n\nThe drinks were OK, they were also overpriced. Mostly mixer and Ice.  The chicken sandwich I had was very tough and gamey- like plastic.\n\nThe service was ok - nothing special. Overall- I wouldn't recommend to anyone nor would I return. Likely the place needs new management and cooks or to just shut down."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdU15TC1RRRAB",
            "text": "Stopped in for dinner one night with my niece. The food was delicious and the drinks were good. She had the lazy cow burger with a espresso martini and I had the short ribs with a henny tamarind. The waiter was attentive and the atmosphere was very nice."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMlkzal93RRAB",
            "text": "Pedimos pasta y costillas de cerdo, la comida estaba deliciosa. La persona que nos\natendió fue muy educada y amable."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeE9ybVRnEAE",
            "text": "Great food"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzc1k2bmJnEAE",
            "text": "Wonderful. the salmon was great; staff are friendly. Lovely interior & clean"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3amVpV0pnEAE",
            "text": "I had a terrible experience at this restaurant. I ordered the roasted chicken, but it arrived undercooked, so I sent it back. When they brought it out again, it still didn't seem right. I cut into the chicken and blood splurged out of the bone. As if that wasn't bad enough, I found a small metal string in my chicken. Shockingly, there was an even longer piece of metal string in my sauce.\n\nI was completely caught off guard by everything and immediately complained to the owner. She offered me free drinks and explained that her cooks were new. While I appreciate the gesture, that's no excuse for serving undercooked food and having metal in the meal. This was an incredibly disappointing experience, and I definitely won't be returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdGNUd3RRRRAB",
            "text": "Tj ones of the best bartenders in the whole city … love he’s drinks."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNHVyOHJBRRAB",
            "text": "La comida 10/10 deliciosa, el lugar es demasiado agradable y la atención de Cris fue espectacular, sin duda volveremos 👏🏼👏🏼Gracias Cris 🫶🏼👍🏼"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNHJ6a0xREAE",
            "text": "First time checking out the Lazy Cow\nVery laid back comfortable vibe\nStaff were friendly & attentive, especially Johnny, who gave us a little tour of the place, including the courtyard area, at the end of the night.\nDrinks were good, we had a painkiller & a strawberry margarita\nTo start, we had the crispy calamari appetizer. It was melt in your mouth tender and went perfectly with the sweet chili dipping sauce.\nOur entrees were southern fried chicken and the braised lamb shank, with the chili garlic eggplant on the side. Portions were decent.\nThe chicken was great, crispy skin and tender meat. The lamb shank was delicious, rich and tender, with oh so good buttery mashed potatoes on the side. Loved the eggplant as well, the chili garlic sauce added great flavor.\nWould definitely recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdktybTVRRRAB",
            "text": "Went for date night with my boyfriend and had an amazing experience. We had the salmon tartare tacos, lazy cow burger, ribs, and sweet chili green beans. The food was fresh, flavorful and delicious… and those green beans…. OMG😍 We also each…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhcFl5S0NBEAE",
            "text": "I saw that this new restaurant opened up in the area and decided to go and check it out! Overall I must say I was really impressed! The ambience with the lights and decor was really neat and unique for the area. Our group first got a couple of appetizers which was all really good. The fries and beef carpaccio in particular stuck out to me. We then all got different entrees and the overall consensus across the group was that the food was delicious. I personally tried the clam linguine. The proportions were generous and we all left feeling very full and content. The drinks were also great! I tried the one with the watermelon. Lastly the service was spot on. The waiters consistently asked us how we were doing, if they could get us anything, and overall were very attentive. I had a great time and will definitely be back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhZzdUN1N3EAE",
            "text": "Love this new spot in the neighborhood! The food, service, music and decor is amazing. Felt like we were in Manhattan and the space is perfect for date night, girls night out or just to hang out at the bar. My boyfriend and I ordered some tapas: hamachi carpaccio, bone marrow with garlic bread and salmon tartare tacos. It was delicious and paired perfectly with our drinks. We were warmly welcomed in with smiles and found out it opened only 3 weeks ago. We will definitely be coming back! A big thank you to Johnny for showing us around and giving us some history of this new spot. Amazing vibes and energy here.. you won’t be disappointed!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2MzZ1MUNnEAE",
            "text": "Just had date night with my husband here on a Friday night and it was really great, especially because of our server Johnny. He was so friendly and even showed us around the restaurant. The food and the drinks were amazing. Just look at the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNWZ5dDNRRRAB",
            "text": "Passing by and found this Gems! TJ made awesome cocktails 🍸 and your own mini flex. very chill and relax atmosphere ☺️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaLVBEU2tnRRAB",
            "text": "Great place for late night drinks. We enjoyed the food, cocktails and atmosphere. The staff’s service was top notch. Definitely recommended for an amazing date night on Bell!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2djdMdi1RRRAB",
            "text": "Johnny was our server and he was great, made the experience better. Food was really good as well. Bone marrow is yummy. I do wish they heated up some of the food more, temperature was below what would be ideal for items that are prepped in advance like ribs and bone marrow."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeHBuNUFREAE",
            "text": "Tell me how they cut little bit of watermelon and put some feta cheese and charge u $13. For $13 u can buy a whole watermelon and a pack of feta cheese. Completely rip off and over priced for no reason. This is just the appetizer. Go to Wild Fig next door and u can get a big salad for $14."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEc3R1SjRRRRAB",
            "text": "I have no idea why this isn't one of the more popular places on Bell Blvd. They have amazing cocktails, unique concoctions that provide quite the kick. Get a nice little buzz going and then order the BEST fried calamari I have had. The other food I have tried has also been really good.... all the salads are great. Just a heads up...  the food is a little spicy so if that's not your thing, you might be turned off.\n\nThe decor is awesome. Really unique design that is intimate and also has a retro lounge feel sprinkled with some modern elements. Real comfortable place to have a drink or bring a date.\n\nGive this place a try."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdU9uc1dREAE",
            "text": "We went in for drinks and appetizers the week they opened and we’re so impressed by the atmosphere and the cocktail selection. The staff was incredibly friendly. The food was great too. Excited to see a place like this in Bayside!"
        }
    ],
    "reviews_count": 51
}