{
    "name": "Little Dumpling",
    "place_id": "ChIJIdXV4O-JwokR1jtxckH_DrM",
    "grid": "QN11",
    "address": "252-20 Northern Blvd, Little Neck, NY 11362, USA",
    "rating": 4.3,
    "user_ratings_total": 895,
    "phone_number": "(718) 225-1178",
    "reviews": [
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWGFIUTVNbFI2TVVaVVRrTnFhRGx6VFhaT2VtYxAB",
            "text": "Went for dinner on a Friday mid October.  It was packed but the wait time wasn't crazy and the service was still excellent.  The soup dumplings that day were extra incredible! I love this place and the amazing staff."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GclNqVnFNbTFCUnpoTGNXTXdSbDlOVGxweGEyYxAB",
            "text": "Everything was delicious! Had 3 types of dumplings. All yummy especially the chili peanut wonton.\n\nA bit of a hike from brooklyn, but absolutely worth it.\n\nI am HAPPY!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRmRESlFhWGRYVTFoNFJWUm5kVWRZYkU1VmVIYxAB",
            "text": "Good soap dumplings"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWVJEVjZTbGhDYjB0RVF6WlhkakJvZGtoUlkyYxAB",
            "text": "Best place for soup dumplings, absolutely delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sd1gyOXJZMlV4U0hCdVJtOVpTMGcxTUhKNlRuYxAB",
            "text": "So good these prices are so good and food is great service is very good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xamNHWjZhelp3WkdaQ05FNUNYMmxVZWtkZlJHYxAB",
            "text": "The soups dumplings are divine."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aa1QyaFhXWG96V1RGb1ZuZGxSWEphUkVGcVdGRRAB",
            "text": "Awesome Shanghainese restaurant in Little Neck. Very good wait service and food.\n\nJust knocking off a star for being cash only. Very inconvenient"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taa1dta3hSMnAzZHpaZlJqTXdPSE42WXpock0yYxAB",
            "text": "My favorite place to eat. Wheelchair accessible, free parking in the small outdoor lot and large underground lot (entrance on Browvale Ln). Excellent service. My go-to dishes: crab and pork soup dumplings, eggplant and beef in garlic sauce, deep fried chicken in chili sauce."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVFVUTk5WbTltZFRGdGFIcE5OVTVUY0UxcWRFRRAB",
            "text": "Great soup dumplings!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNE4zbFlabWcyUVcxVWRXNDNWMjU0U1VjNGEwRRAB",
            "text": "Not only was the food delicious, but my favorite part was the service. From the moment you walk through the door, everyone speaks to you patiently, so kind, and has the biggest smile you've ever seen. I wanted to hug them all. Thank you so much for an amazing evening. (We ordered pork soup dumplings, scallion pancakes, bok choy, and Shanghai style U-don noodles)😍❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMVIyUmhiM0pqWDI5b1pFaFFVbEpqVEVwUWJWRRAB",
            "text": "Stopped by Little Dumpling on Northern Blvd in Queens for lunch and had a great meal. Started with the wine chicken and of course, the pork soup dumplings. The soup dumplings, despite the kind you get, are an absolute must every time you come here. Perfectly soupy and packed with flavor, that will really hit the spot.\n\nFor my main dish, I had the Snow Cabbage with Pork Noodle Soup, which was super comforting and full of flavor. The noodles had great texture, and the broth was light but satisfying.\n\nI paired it all with a kumquat lemon green tea, which was cold, citrusy, and really refreshing. A perfect balance to the warm noodle soup and dumplings.\n\nThe service was attentive without being overbearing, which made for a relaxed dining experience. The atmosphere was casual, and while there was a moderate level of noise, it was never too loud to hear the person sitting across from me.\n\nIf you’re in the area and craving soup dumplings and a cozy lunch, Little Dumpling is always a solid choice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cFpVaHhMWEpLV1RSbFRrVjVWR3RQVkhsSFNuYxAB",
            "text": "The food, especially the soup dumplings, is great. The small and cozy space is very clean. The staff is friendly and efficient. Those who conquer the parking challenge will be greatly rewarded."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRWFYWmZlSGxmYWxBNVYxTnhlVlEzWW5oRFZYYxAB",
            "text": "Very sweet waitstaff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWVlYWm9kRE5wVlVwR1kyWjBlREJmVDJwVVNVRRAB",
            "text": "I really didn’t come here to dislike this restaurant. But after actually trying the food, I have to ask the reason why is this place so popular?\nThe soup came out looking so unappetizing — cloudy, bland broth that looked like it came from a defrosted pack. The wontons themselves? Thick wrappers, the meat inside tasted slightly off, under seasoned. Honestly, I’ve had better from a freezer pack.\n\nI’m not here to blame your restaurant. Right now, the food feels rushed, poorly seasoned, and carelessly presented. This isn’t just about taste! It’s about maintaining professional standards in the kitchen. I believe every kitchen has room to grow!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjemF6WTJOakV3U1VvNU1tcEhkR0pyU21SaGMxRRAB",
            "text": "Reliably wonderful.  My go-to place. Cash only!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcVU5LV9pdi1xZWl3RRAB",
            "text": "Cash Only"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMTGZ3ZlcxdU52ZGhRRRAB",
            "text": "I have to really praise this spot. We’ve come here only a few times and have to visit more often. Their food was fresh, on point. Their staff were very friendly and service was great."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbGFHLXFnRRAB",
            "text": "Went back again for my father's birthday and service was phenomenal and food came out surprisingly really quick for how busy it was there. Everything we ordered was delicious. We'll be back again for sure"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLQ0l2Wmo5MVBYTTRnRRAB",
            "text": "We recently ordered take-out from Little Dumpling due to our go to place recently disappeared. Little Dumpling was so good! Loved the variety of dishes especially the dumplings of course! Was very busy when went inside to pick up Order but the service was great! A little bit pricey but the portions were great. Also was a little hard because it is cash only so make sure you have it on you!  A new go to for our family!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKM3hfc1RmbklUajh3RRAB",
            "text": "Every dish is delicious！I recommend the chicken and shrimp.It suit for Chinese tastes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOLVYzNUtNeGY2U2FREAE",
            "text": "Best wonton soup I've ever had, traditional dishes, fresh food and it was worth the price.\nCASH ONLY PLACE, for my 2 friends and me, it was 60$\n\nWORTH THE PRICE"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMGZtaFh3EAE",
            "text": "Best soup dumplings anywhere!\nGreat sesame chicken too.🤗"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZ1A3Q0x3EAE",
            "text": "I was expecting good Shanghai with all the glowing reviews. Unfortunately this is probably the worst Shanghainese food I have been served. Disappointing soup dumplings. Pepper and beef with almost no peppers. Waiters were great though."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOHRQSXJ3RRAB",
            "text": "First time trying this place out soup dumplings are delicious but when you order a main dish don’t expect to much meat on the plate it will be 80 percent all veggies. $18 bucks got all broccoli and 4 small pieces of beef."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bEpPa0RnEAE",
            "text": "Always amazing and by far my favorite. Wish they had a location closer to where I lived. Best orange beef, general tsos, fried wanton, fried dumplings."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d0ppT2NREAE",
            "text": "Really like the scallion pancakes with beef here"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNTZpSG93RRAB",
            "text": "The steamed pork dumplings and the shrimp dumplings were the better options. The pan fried pork and turnip cakes buns were ok"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRai1UREJ3EAE",
            "text": "We come here often. Food is great and service is very good. Seating for around 70 people. Kids welcome here"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdk9LcldBEAE",
            "text": "The best Chinese food in LI. We love the wontons with chili peanut sauce. All the dumplings are delicious. Young Chow Fried Rice is the best. Pea Shouts are cooked to prefect !  Love the lobster with ginger scallion."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbUo2RGV3EAE",
            "text": "Me and my family went to the little neck location. It was absolutely amazing. The host was super nice and welcoming. The restaurant itself was clean and inviting. The servers all worked together to give us a great dining experience. The food was AMAZING. We ordered the pork soup dumplings, pork fried dumplings, wontons with chili oil and peanut sauce, pork fried rice, and sesame chicken. The food was delicious. Can't wait to go back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNDhESnBnRRAB",
            "text": "Always great food. My kids love the soup dumplings."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnazd6R1JnEAE",
            "text": "This place has been a go to for a while. This has been the most eastern soup dumpling place for a while. The food is delicious, the staff is unbelievably friendly and helpful and it is served convenient."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfb2N1M2dBRRAB",
            "text": "Excellent soup dumplings 😋"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmb3VEbmdnRRAB",
            "text": "Little Dumpling is a fantastic restaurant with a delicious variety of dishes. My favorite is chicken and eggplant in garlic sauce prepared mildly. It has a distinctive taste. I always order it along with pork soup dumplings. Everyone is so kind, understanding and helpful. I have taken out and brought many friends to this unique restaurant. Evelyn Silverman"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5dU5qUUp3EAE",
            "text": "Very good soup dumplings. Everything else was very good too."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnOVBQWUxBEAE",
            "text": "Soup dumplings are great"
        },
        {
            "date": "수정일: 6년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnOHB6a01nEAE",
            "text": "한나디로 별로\n무엇보다 마음에 않드는점은\nonly cash"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIODdHakhBEAE",
            "text": "Made a stop here heading out to Eastern L.I. Very glad we did 😊. The food is good and the dumplings are delicious.\n\nEach dish was cooked with pride. You can taste the quality & efforts in each bite. 👍👍\n\nMy favorite was the pan fried beef dumplings, shredded beef with peppers, and spicy shredded potatoes.\n\nOur group finished everything that was served on the table. Nothing was left to spare.\n\nThe price is very reasonable. CASH ONLY"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREdV92bGZREAE",
            "text": "Really liked this place. The soup dumpling was very flavorful and delicious. The spicy wonton was okay, I wasn’t a big fan of the thick skin but the sauce still made it very good. We also tried the mince pork with rice and spicy fried chicken. Overall a good experience!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeXYtM1JBEAE",
            "text": "If you're in Little Neck and craving an authentic taste of Taiwan and Shanghai, this restaurant is a must-visit. The soup dumplings alone are worth the trip - each one bursts with a savory broth and tender filling, leaving you wanting more.\n\nBut let me tell you about the chicken eggplant in garlic sauce. It's a flavor explosion! Juicy chicken, perfectly cooked eggplant, and a heavenly garlic sauce that will make your taste buds dance with joy.\n\nThe best part? You won't have to wait long. Our orders were prepared and served in under fifteen minutes, despite the bustling atmosphere. Quick service without compromising on quality is a rare find.\n\nLocated in the heart of Little Neck, this restaurant has become a local favorite. The warm hospitality and cozy ambiance make you feel right at home. Just remember, they only accept cash payments."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaTYySlN3EAE",
            "text": "My partner had highly recommended this place but hadn’t been back for over 7yrs so we were excited to come back but gosh so so disappointed with the food. The pork soup dumplings had a small but detectable and porky stink to them which made me question the freshness of the meat used. At least the truffle pork soup dumplings were tolerable because the truffle flavor hides it. The texture of the filling is also off to me. The pan fried pork dumplings had barely any filling and the wrapper almost felt like it was double wrapped given how thick it was. This left the pan fried pork dumplings being very flavorless. Finally also ordered the deep fried chicken with chili because of the past reviews recommending it and I dunno if we got a bad batch or this place is cost cutting but all out pieces were small and it felt like I was eating just the crunchy shell of a Popeyes fried chicken. Literally hard to tell if we had  chicken in the majority of the bites unless you look at it but even then the layer is too thin. Service was great so leaving 2 stars but will not be coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NW95cklBEAE",
            "text": "Absolutely incredible cuisine! We went at a busy time and the food still arrived quickly. The cumin lamb was super tender and the spicy peanut sauce over the wontons was to die for. I’m already looking forward to my next time eating at this restaurant!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaXRENmtRRRAB",
            "text": "Good food but cash only. Parking van get crowded often. Get the 10 percent coupon to reduce cost. Food is fresh, hit, and delicious almost all the time. Eggplant and noodles and of course the soup dumplings are always on point. It's a local winner to enjoy. Go eat some today."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcnVMbVdnEAE",
            "text": "When I’m in Queens, I always go to Little Dumpling for their soup dumplings. Their prices are reasonable, especially their lunch special. They are a cash only business. There’s a small parking lot out front and more parking in the rear."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMTZTMWFBEAE",
            "text": "This is our go to for soup dumplings.\nThe skin is thin and holds in a lot of soup. It's amazing flavor when you add a bit of the ginger vinegar.\nThe jellyfish appetizer was surprisingly well proportioned. A lot of places use a lot of pickled carrots and turnips instead of jellyfish but this one has a good combo of both. The Shanghainese fried noodles look underwhelming but again flavorful and the noodles are chewy (good chewy). String beans and Drunken chicken both very well done. We enjoyed everything"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtODRiMkNREAE",
            "text": "Delicious soup dumplings! Delicious flavor to these dumplings, but I do wish the skin was thinner. The pan fried dumplings were a bit sweet on the filling which was odd. Everything else we ordered was very good. Something I always gave to try at restaurants is fried calamari and this one did not disappoint. The squid looked spongelike with extra cuts that made the fry crispier - I have not seen this done before! The stir fried rice cakes were kind of chewy almost as if they have not been pre-soaked long enough. Pea shoots were okay, it did have some tough parts that haven’t been removed during prep. Overall, an okay meal, just not my favorite Shanghainese restaurant."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMWNDVmVnEAE",
            "text": "When you’re In Nassau, take the time to find Chinese food...it’s so much better!  “Little Dumpling” fits the bill....all the regular favorites, plus plenty of authentic Chinese. The favorite among other reviews seems to be the “Soup…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdl8zcGdnRRAB",
            "text": "The food is always great however the last time I visited I ordered a plate to-go and a different waiter sent my order to the kitchen and later came out with the wrong order. I told them about the misunderstanding and they said I was still responsible to pay for it. I am a frequent customer and have introduced this place to my family and friends. I was disappointed about the way it was handled, especially since the misunderstanding was over $6, keep in mind I was spending $100. I had no problem paying it and I had no choice but to also pay for the correct item. I was surprised by how they treated us 😔"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMmZYc3NBRRAB",
            "text": "Great soup Dumplings ... The real reason to venture here. That is if you're avoiding the trek to Flushing. Their noodle and Rice dishes are good, passable for the value. The main entrees while pricier are worth trying, sauteed string beans…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVd2RLRTBnRRAB",
            "text": "Known this place in Little Neck for a long time and haven’t try at all. It’s busy and had people waited for tables at 8:30pm Saturday night. My friend suggested to try it last night and it was ok, somehow authentic but definitely altered to…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRM28yX2Z3EAE",
            "text": "Hot water or tea was offered once we sat down. The pork spare ribs and tofu fish in sauce were fantastic tasting. Also had the Taiwanese noodles and soup dumplings and oyster pancake (not a fan but that's me) and scallion pancakes and more. Not sure if worth the prices but delicious. We came early so no wait."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncTVhdVpnEAE",
            "text": "I've come here a few times and I'm glad I gave it a few tries. Straight to the point, you need to come a few times to know what you like. I find their soup dumplings to be ok for when you have the craving but thinking about driving all the way to Flushing makes you want to hurl. While the taste is good, I find them a bit smaller and less soupy. Plus they seem to tear a little more easily (this losing the whole raison d'être). My absolute go to place is Nan Xiang Xiao Long Bao. However, this place does have some good alternate dishes. Beef with peppers (spicy, not bell) is very good. The family always likes to get the beef with pan fried noodles. Plus they have bubble tea. The negatives: parking is tough, sometimes the place gets packed and there's is a tiny waiting area, and worst of all, cash only. And, the place is in Little Neck so I expect it to cost a little more than Flushing, but still, seems a little steep for what you're getting."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvbmFyWFRnEAE",
            "text": "I have not been here for a year. the food quality was considered good.  the wrap of crab meat soup dumpling has improved. it is now thin and soft.  the soup was just ok. I also had the beef noodle soup.  the meat was tasty and tender. the soup was just ok. probably just not my style. worst of all as usual,  you have to pay cash."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRNGF6a01BEAE",
            "text": "Great food for soup dumplings. Authentic Taiwanese food. I can’t speak for Shanghainese cuisine b/c of my unfamiliarity. But this is a popular place. The decor is modern. One bad thing is no parking space or very hard to find in front of…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5OXJUNTV3RRAB",
            "text": "Love this restaurant.  We called no reservations and we to wait 15 minutes to be seated.  Food amazing,  but they only take cash."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzam9DTm1nRRAB",
            "text": "The food was excellent and the service was attentive. It was a fresh, well seasoned, and well cooked.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNk1lTU1BEAE",
            "text": "Really nice dumpling place that has so many choice of dumpling, bao, and appetizers! It’s a good place for grab and go or just dine in. There are so many choices that you can just order all the small stuffs if you are in the mood to try everything, but not so hungry or you could order a big meal as well!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRLUxpTWpRRRAB",
            "text": "Their signature soup dumpling is flavorful and well seasoned. Unfortunately the dishes are on the pricy side due to small portions. Parking in the front is extremely limited, so be prepared to find parking else where.\n\nFun fact: The restaurant's Chinese name has the same pronunciation as Bruce Lee (Lei Siu Long)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcm9Dd2x3RRAB",
            "text": "Best soup dumplings! Great lunch special! I love coming here with my family. I thibk its the best Chinese food in town."
        }
    ],
    "reviews_count": 59
}