{
    "name": "La Baraka",
    "place_id": "ChIJmf02Qe6JwokRSuKrC18NEQU",
    "grid": "QN11",
    "address": "255-09 Northern Blvd, Little Neck, NY 11362, USA",
    "rating": 4.5,
    "user_ratings_total": 280,
    "phone_number": "(718) 428-1461",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMWJIazVSVEJvVUZWUk1YTlhibWQxWVVaaVdXYxAB",
            "text": "Great food and excellent service. Family run and quality well maintained"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTFRWaDZiaTB4Tm5welFuTXhiRTVhY0ZwTWRsRRAB",
            "text": "Fantastic little French gem in Little Neck! I used to work in a French restaurant when I moved to NY’s East Village 20 yrs ago. This wonderful place brought back so many flooding memories upon first taste of the French Onion Soup.\nIts original owner and daughter in law were there for lunch.\nWe spoke briefly and I know if I lived closer I’d become a regular.\nThank you for your beautiful smile and hospitality pumping a sea of new restauranteurs that don’t know the charm of an honest conversation to accompany great food. The front of the house is as important as the back. Thank you!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aFJFbFNTa0UwWDA1dU5UTkZhamx5TUZoMVdGRRAB",
            "text": "All of the food is phenomenal.  We get the buffet at lunchtime.  They have a nice selection of music too.  The people eating next door at HK cafe don’t know what they are missing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VWRubFNiMkkzVlRCdE1tTkRhMnhTTnpjelNIYxAB",
            "text": "French onion soup. Wow!🤩"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taT1NFZGFTamRqVlVaVVdXcHRjMFoxTm5sMGVYYxAB",
            "text": "This quaint, little French restaurant in Little Neck is absolutely amazing! I just had an amazing meal for lunch. They have a lunch buffet, a prize fixe or you can just order from the menu. The French onion soup is to die for! I will be adding this place to my weekly rotation."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWmJVeHhjRTV0YzJNNWJYZzRjMDB0VW0xWmRXYxAB",
            "text": "A local gem with an old-school French vibe, this restaurant has been around for 46 years. The food may not be mind-blowing, but it’s consistently good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVelNIb3lTMU40Wm1GelNuRlNhbmh5UVhsU1JrRRAB",
            "text": "I'll start with the service. Service was absolute 5 stars. There were two people who helped us with seating as well as orders. Both were very sweet and great with explaining the menu. Our main waitress was very attentive. Came frequently to fill our water and when asked if there's hot water she came back to us with that in less than 3 min. Even apologized when the Fruit tart I ordered was not available and offered other dessert options that's not on the restaurant week menu as a substitute. Shame on some reviewers for saying the more senior waitress is mean to customers. She was nothing but sweet to our table as well as others. When she's observing the tables in the corner she's not smiling profusely 24/7 like she's high on something but who is? When she's actually interacting with customers she had a nice calm tone with a gentle smile. What more can you ask for.\n\nAmbiance was nice. This is a nice small restaurant with a very comfortable homey feeling to it.\n\nAppetizers\nQuiche Epinard (spinach quiche) - Not a fan. My single complaint was that the spinach flavor can be more potent. The pastry itself was very buttery and flaky yes but I would've preferred more spinach flavor as spinach was maybe.... 1% of the taste.\n\nMoules Farcies (stuffed mussels, garlic, parsley, butter) - This was great. Even my wife who normally does not like mussels loved this one. The mussels themselves were light and did not have that sea/seawater flavor. The combination of garlic, parsley, and butter gave them a great upgrade as well. Can't wait to try their escargot next time.\n\nEntrées\nOnglet Grille (hanger steak with bearnaise sauce) - My wife asked for medium well. It seemed more like we'll done. Ironically the steak was still extremely tender and not dry at all so we did not raise the concern. The portion was nice as well. We couldn't finish and had to bring the rest home. The next day I reheated it with a small bowl of water on the side in the microwave to prevent it from drying out. It was still just as tender as the day before. Steak itself has a really nice fresh beefy flavor to it. The bernaise sauce was okay. Not much flavor to that. Could do with or without.\n\nTruite Almondine (filet trout, almonds, lemon) - Starting off the fish itself is very nice. It reminds me of the deep fried flounders served in Chinese seafood/dim sum restaurants. The nice crispy fish skin on the outside while the fish meat on the inside is tender and flaky. Very very nice. Some parts towards the center was a tad dry but the almonds with the oil completely solves that issue as long as you eat them together. Lemon also adds a refreshing taste to it. Great combination.\n\nDesserts\nGâteau au Chocolat (chocolate truffle cake) - Personally not a chocolate person but my wife liked it.\nCaramel Flan - It's hard to review this one. I want to say this was the least sweet caramel dessert I've ever eaten. Coming from a Chinese person that's probably the best dessert compliment one can give lol. Typically with caramel anything out there the item would be on the much sweeter side compared to non caramel options. Ironically this flan had a very light caramel flavor all around while being even less sweet than the chocolate cake if I recall. Also at the bottom the crystallized layer was a tad bitter. Almost as if I was drinking coffee while eating caramel flan or maybe wine?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201a1VHSnVOVGR4TXpoVlpVdzJNVEIwYWs5a1JHYxAB",
            "text": "A Cozy, Heartwarming Spot in Queens!\nMy partner and I found this little gem today, and we can’t wait to come back. From the moment we walked in, we felt like family. The owners are incredibly kind, and the service was amazing—everyone was so friendly and welcoming.\n\nThe atmosphere is something special, too. The place has an old-fashioned charm that feels nostalgic, like stepping into a cozy storybook. It’s warm, inviting, and makes you feel right at home.\n\nNow, the food—wow. We started with escargot, and it was rich and buttery, just perfect. The lamb chops were tender and full of flavor, and the pudding for dessert was a sweet, creamy delight. The coffee was the perfect finish to a great meal.\n\nAs a young couple, we left feeling inspired by the owners' kindness and the cozy, heartfelt vibe of the place. We’ll definitely be back and recommend it to anyone looking for a delicious meal in a welcoming, unique spot in Queens."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNM1dsSUNSMlllTGpnRRAB",
            "text": "Place is old and worn out.  Food is merely passable.  Would never go back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bEs3Q3JRRRAB",
            "text": "Charming neighborhood gem! Great service, food, atmosphere. Twilight dinner is awesome value."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndHMyOWlRRRAB",
            "text": "Love this place!   My favorite.  We go several times a year.  Always special.  Food is excellent. Duck, Filet mignon, boeuf borgenoune, escargot, muscles ….pastries everything.   Jewel box Bistro atmosphere; enhanced by the delightful Lucette & Jon Luc, her granddaughter and a superior wait staff.💕"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNU1faDFnRRAB",
            "text": "We came here for restaurant week, 3 courses for $30 which wasn’t a bad deal. The food was OK - cooked decently and good size portions, but everything tasted under seasoned and a bit bland. The béarnaise sauce helped the steak a little bit, but we found ourselves adding salt & pepper to each of the courses. The best thing we ate was the sesame bread, which was piping hot and came with a generous portion of butter. The atmosphere was very cute and nostalgic, and service was prompt, but I don’t see myself returning soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuemFPS2tnRRAB",
            "text": "La Baraka is one of those special places that feels like home the moment you walk through the door. This family-owned restaurant, cherished by my girlfriend’s family for years, has a warm and welcoming atmosphere that instantly draws you in. We had the pleasure of celebrating Rosh Hashanah there, and the experience was simply delightful.\n\nThe owners and staff are incredibly dear, treating every guest like family. You can tell they take pride not only in the food but in making sure everyone feels at home. The service is thoughtful and attentive, and you can see why this place has such a loyal following.\n\nThe food is rich with tradition and flavor, perfectly capturing the essence of heartfelt home-cooked meals. Every dish is prepared with care, making it a perfect spot for special occasions or a cozy dinner.\n\nI can’t recommend La Baraka enough for anyone looking for a true family-style dining experience with a personal touch. It’s the kind of place you’ll want to return to time and time again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIb3ZfQndRRRAB",
            "text": "This was my first time having French-Tunisian cuisine and I was pleasantly surprised! I have a spicy taste palette, but the food here was savory and flavorful. Excellent, delicious food and the restaurant is very cozy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3d2YyZ2FREAE",
            "text": "A long time family favorite.  We chose to celebrate our 52 anniversary with family. Great food. Great service.  Fair prices. Street parking.  I strongly suggest you go here and have a great time ..."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dXQzQ2JREAE",
            "text": "We went back for restaurant week.  $30 for dinner is a steal. Spinach quiche, hangar steak, and chocolate cake were all absolutely delicious.  Service was pleasant.  My only complaint is the tablecloths.  They clearly have seen better days.  Time to replace them ."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNTVUYjZRRRAB",
            "text": "Terrible food led to a terrible stomach ache"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNVBiT0FREAE",
            "text": "Hello, would you consider any of your food Tunisian ? Any Tunisian dishes?"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNV9HMkpBEAE",
            "text": "Mi primo ves aquí y me encanta la comida.  Comí onion soup y veal chop. No tomo fotos porque olvidé pero si me voy a regresar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMM3FiMnBnRRAB",
            "text": "Went here on Father's Day and had the Twilight Menu (salad, appetizer, entree, dessert, coffee/tea).  We had the Quiche Lorraine, Escargot, Trout Almondine, Veal w/ apples, Strawberry mousse, and cheesecake.  Everything was delicious and portions were good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbmYycFVnEAE",
            "text": "The food is great!  Nice atmosphere."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzOHZ6emRREAE",
            "text": "Nice boutique  style restaurants\nNice ambience  n food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdlphOVpREAE",
            "text": "Food is amazing, very welcoming, I loved it and I would 100% would want to come again to enjoy this wonderful food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdmFyZm1BRRAB",
            "text": "Amazing experience, great service, Food is amazing, 100% recommend for any event or simply for an evening dinner. Amazing atmosphere 100% coming back!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0ei1mSjR3RRAB",
            "text": "Ate here with a friend last night and from the warm welcoming owners and staff, to the delicious made from scratch food and cozy decor, it was a stellar experience. Cooking and creating a wonderful dining experience has truly been the family’s mission for three generations! We started with the garlicky delicious escargot (don’t shy away, live with a spirit of adventure!) and the French Onion soup. I could eat that soup happily everyday it’s so comforting and delicious. The pate is homemade and the flavor and consistency is lovely and on par with anything you can taste in France! Duck l’orange! Duck l’orange! You’re a silly goose if you don’t try the duck, which comes with three homemade sauces, raspberry, orange and peach and is perfectly crispy and delicious. The couscous and kabobs and veggies in the tangine were delicious as well. We finished the night with some desserts and the pear almond tart and strawberry mousse cake will absolutely make you forget life before this dining experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0a1pqSkZBEAE",
            "text": "Charming and cozy.\nPersonable staff.\nA little neck gem for decades ✨️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROay12aDh3RRAB",
            "text": "I absolutely love eating here for my birthday every year. The only issue is I never know what I want to eat! This year I tried their new steamed mussels provencales and it was so amazing. We also enjoyed their strawberry souffle which was pretty and sweet. I would definitely recommend trying this place, especially as we approach valentines day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbk9hQmt3RRAB",
            "text": "Delicious, authentic, and fast!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnLTRESVhBEAE",
            "text": "Probably my favorite restaurant.  Incredibly friendly staff and amazing food.  Menu is small but everything is perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdzdySGxRRRAB",
            "text": "The atmosphere and ambience is just warm and welcoming. Love the decor of the place and friendly staff. French onion soup was amazing. We had the duck and lamb specialties. They were both flavorful and great, duck could have been better. We wanted to try the chocolate soufflé but this needed to be ordered when we put in our entree order but we weren’t informed of this until we were placing our desert order. We ended up getting a chocolate cake which wasn’t too bad.\nI would go again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcDlPVFdREAE",
            "text": "Just a nice, home-y place with great food and great folks!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1ak9xVVBREAE",
            "text": "First time awasome food and service.  My family enjoy it too. Thank you"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOHFEOFBREAE",
            "text": "Totally enjoyed a prix fixe Rosh Hashonan  dinner. Excellent food and service. Extremely reasonably priced."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabzY3UGNnEAE",
            "text": "We had a wonderful family Rosh Hashanah dinner. Delicious food; wonderful service. Couldn't be better!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNac1l1dE53EAE",
            "text": "Might be a bit pricey but it's totally worth it. If you're looking to celebrate a special occasion at a really nice small restaurant this is the place. Been coming here almost a decade."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMi1pUWxnRRAB",
            "text": "I'd say this is a hidden gem, a rustic French restaurant with plenty of options.  Service can be a little bit less friendly especially when you're not familiar with French culture."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOVpySld3EAE",
            "text": "The food, unfortunately, was not fresh. Quiche was definitely frozen store bought. One dish was served ice cold to us. I was very disappointed. However, the owners seemed polite."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnaHRLQWx3RRAB",
            "text": "Great place. Amazing food. Awesome owners!! (Try the duck or the veal with apples)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeDRqQ25BRRAB",
            "text": "Love this place. The owner couple are very cool and charming. I really need to come here more often. I love the classic French dishes, (even if they're clichéd since I don't get that a lot), like especially the escargots.  I enjoy the food.  I like the calm, almost romantic ambiance.  Service is prompt and friendly.  (Sorry no pics cause couldn't find them on my phone just now.)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaDVqUEpREAE",
            "text": "Food was okay. Interesting flavors. Definitely more on the subtle side. For my palate, it was a bit bland. Duck was cooked really well. Lamb chops were probably the best thing we had ordered. Would definitely order the mussels again as well. Service was excellent, very friendly and welcoming staff. Seemed like they get a lot of regular customers. I'm glad I tried it once."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NmN2ZlpnEAE",
            "text": "Lovely restaurant.  Have always passed by but have never gone before today.   Really enjoyed.  Old world charm and truly delicious.  God bless restaurants like this.  You make life worth living."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJajdEai13RRAB",
            "text": "A very classic and family style restaurant. The staff and boss are very friendly. The union soup is a must order. The duck dish is good too. So upset my phone didn't take the soup picture. Time to update one. 🤔…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoa2NyTjNnRRAB",
            "text": "It was my first time coming here and so glad I came. This family run restaurant is so different from how I'm treated at other restaurants. Each family member came over separately to see if everything was ok and chatted up a bit.\nI had the filet of sole with seafood on top, french onion soup that was superb, and a fabulicious chocolate mousse all at a reasonable price.\nCheck them out, you won't be disappointed!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2djdLemRnEAE",
            "text": "Amazing food & superb service! The owners are extremely friendly and provided an excellent experience. All of the desserts are made in-house as well! Definitely check this place out if you're in the area!\n\nHighly recommend the escargot, duck confit & lamb chop."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcDlpc0VnEAE",
            "text": "Lovely owners, everyone is so cheerful and accommodating. Good selection of set meals as well as a la carte."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBaWJEWE5nEAE",
            "text": "Love this place , family owned and operated , the host was extremely friendly . Try to make a resevation before going because it was packed when i went . Food was scrumptious ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyOXZYSnFnRRAB",
            "text": "I solely went to try the French onion soup and let me tell you it’s DELICIOUS 🤤 you have to try 10/10. Great flavor and cheesy the way I like. Staff was friendly.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCak5pRDRRRRAB",
            "text": "Best French onion soup on the planet . They sung happy anniversary to us .. fantastic staff superb food"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdHRUeWtnRRAB",
            "text": "Lovely, charming place with good service.  Excellent duck, but the star of the show was certainly the French  onion soup."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bm9xQ21BRRAB",
            "text": "We were so excited to find fine French food without having to go to Manhattan. The staff was very nice, accommodating and friendly. The food was mediocre at best. My mussels appetizer tasted burnt and my husband’s quiche tasted store bought. My duck entree was okay  and my husband’s beef was okay. Nothing was really good, just “eh.”  The restaurant is quaint but dated. There is carpeting throughout which we absolutely don’t like, hides dirt and didn’t look clean. Disappointing and we won’t be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobWYtd09REAE",
            "text": "This is a review of a delivery order (though we'll definitely be visiting in person ASAP after this!).\n\nThe food here is phenomenal. My husband and I both got the prix fixe option, and each item exceeded expectations. I was briefly confused by why the French onion soup is a $10 upcharge, but they actually send it in a really nice glass bowl, which was a first for me with delivery. The soup itself was delicious. The mussels were also incredible. For entrees, we had the salmon and beef bourguignon, which were were both tasty, and the deserts--a fruit salad and a strawberry mousse cake--were light and refreshing.\n\nHighly recommend and we will definitely be repeat customers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNWVDZXh3RRAB",
            "text": "We have been coming to this restaurant often on for a number of years. Although not a frequent customer we always enjoy our time here.  Tonight I was publicly insulted by another customer for not feeling well. She berated me for several minutes while our waitress just looked on.  As my wife and I rarely get out this was a rare treat that was ruined. Any other restaurant would have at least bought us a cup of coffee. The only thing we were told is that the obnoxious customer is a judge going through a tough time. On the way out we were told that they hope it didn't ruin our experience and hoped this year's back.\nNormally I would not leave a review like this. But I was so taken aback by the lack of any consideration that I don't think I'll be returning here again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeTRicUpREAE",
            "text": "I've been going to this restaurant for the past 20 years. It's not a fancy French restaurant, but it is a good one. The price is extremely reasonable and the food is always good. I love their pâté, onion soup, escargots and homemade…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtczktRlNBEAE",
            "text": "This is a family run restaurant and there is personalized service and attention as a result.  The food was fresh.  I ordered the Tangine which I wish had more Moroccan spices and beef that was more tender and moist. I would go back to try another dish because my friend's dinners tasted delicious."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRLUp6S0d3EAE",
            "text": "This place is a gem!   The food is outrageously delicious (try the duck!) and the presentation is exquisite.  The decor is charming, like an old fashioned French bistro.  The restaurant owners are delightful, and strive to make every diner…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpdVltUTF3RRAB",
            "text": "I’m actually quite appalled by the review below, I’ve been dining at La Baraka for years now and it is by far my favorite restaurant in queens and quite possibly my favorite French restaurant generally speaking. They have the best salad…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNTRIOWZnEAE",
            "text": "This is one of my favorite places to eat of all time. The fresh baked hot crusty bread is one of the highlights. I was introduced to escargots here-- and I've never had better. My hero took me and our whole class here in 7th grade. That was…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpeXFyUFRBEAE",
            "text": "One of the worst dinners I’ve ever had. Went here on a saturday night - 6pm reservation. From the start, the quiche Lorraine tasted like it came right out of the microwave; duck was horrible, skin not crispy at all, very dry. And lastly,…"
        }
    ],
    "reviews_count": 58
}