{
    "name": "Marbella",
    "place_id": "ChIJN57WvuJhwokRSJvUHq360O0",
    "grid": "QN11",
    "address": "220-33 Northern Blvd N/A, Bayside, NY 11361, USA",
    "rating": 4.5,
    "user_ratings_total": 858,
    "phone_number": "(718) 423-0100",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNGJVcHJkbEJsVFZCTUxYQnJlRVZ6YVRoUWEyYxAB",
            "text": "Excellent place to eat"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ka1dVMWtWMGxpVERGWldVNVpkelJKY1hOUVIyYxAB",
            "text": "My wife and I went there for the first time. The food and the service was excellent. It is now going to be our go to place for Spanish cuisine. I highly recommend this restaurant. Can't wait to bring friends and family there."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aM1gyRlZiVXhsV0ZFeU1IQlBVVGQ1ZGpOa0xYYxAB",
            "text": "We enjoyed the lunch special.\nFood delicious"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VlMwVjFXSE5EWjFoblNEQk5SRlZEWkdoSE1WRRAB",
            "text": "The best Spanish food in Bayside!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWc1VuVXdWakEwYVVwdGF6bE1NbVJFVlVaeE1FRRAB",
            "text": "Must try very authentic"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UGJWbEVMVVZRUzNKTlVHOUpWV1E1ZDJWWFNHYxAB",
            "text": "Great food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeGFqVm9TRjlyTlV3dE1tcGxRMHBDWVRGb1VHYxAB",
            "text": "Marbella has done it again. We have been coming back for eight years. A chance encounter set the stage for all the good things Marbella has to offer. A harpist, flamenco dancers, good food and atmosphere. The wait staff is attentive and friendly. There is on site parking."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eGMyOVJlRjlTU0hSWk1VOXdWME5tY1U1Vk5XYxAB",
            "text": "BEST KEPT SECRET IN BAYSIDE! A hidden gem in the Best Western Hotel on Northern Blvd. This is an authentic Spanish restaurant. The decor makes you feel like you’re in Spain and the food and service were excellent!!! Paella a la Valenciana is my favorite dish and it’s consistently outstanding. Everything is fresh! We also enjoyed Gambas en Salsa Verde, Croquetas, and Empanadillas con carne.  If you like sangria, go for the red with medium sweetness. As for dessert, profiteroles with ice cream is heavenly. On Thur and Fri there’s live music. We enjoyed a guitarist during our meal which was just loud enough so we can enjoy catching up with friends. Perfect in every way. There’s a party room which I have to check out for a future function. There’s also parking behind the hotel. I HIGHLY RECOMMEND this delicious place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201d2VWaFJha1pMVGxkemJWSmtSRWxZV21adWJsRRAB",
            "text": "On behalf of The Center for the Women of New York, I want to extend our deepest gratitude to Marbella for their incredibly generous and delicious donation to our Taste of the World at Fort Totten gala.\n\nThey provided a seafood jumbo jambalaya that was absolutely spectacular. It was packed with generous portions of fresh seafood and had the most amazing depth of flavor. The spices were perfectly balanced, making it a truly memorable dish that had our guests coming back for more. It was clear that this was made with great skill and care.\n\nIt is because of incredible local businesses and caterers like Marbella that we are able to successfully raise vital funds for our mission of supporting women in the New York community. Their commitment to giving back is deeply appreciated and truly makes a difference. This kind of generosity is exactly why I am passionate about supporting businesses that care.\n\nWe highly recommend Marbella for their outstanding food and their tremendous community spirit. Thank you for your generosity and for making our event such a success."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwdE5GZHRkVk54UmxZM1RFZzBlV2d4Tmt4dFQyYxAB",
            "text": "-where do I start, came here for a wedding celebration\n-limited appetizers !!! for a table of 9 people one plate of calamari, one plate of mussels, one plate clams, etc like really ?? I gave up my piece because I felt bad for the rest of the people in the table.\n-once the limited amount of appetizers were done, the servers picked up the plates and Cutlery, they forgot to gives us new cutlery !!! once the main dishes were coming out, we had no cutlery so we had to wait even more for them to give us a new set of cutlery.\n-my mom and brother BOTH ordered STEAK\nit took 1 hour+ for the food to come out after the appetizers were done\nmy mom got a big piece of steak but my brother got what looked like a pork chop, a small piece of steak smh\n-the servers are very limited in giving water/sangria, I ended up telling my dad to give me his water because I was thirsty.\n-the server got water on my husband shirt, he didn't even say sorry\n-To me this place is not worth it for a big group! so watch out, I say this because imagine your celebrating something special and then comes a place like this to ruin your celebration, avoid having to get upset and your group tell you what went wrong with this place its embarrassing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKcldqWlJiVVpEYVZaTFIzWm1RVVp3TUdaa00yYxAB",
            "text": "Great classic style Spanish restaurant. Very nice"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaVFUTm1NVTFVVDJoSlNsaFllalpZWjNFd1dHYxAB",
            "text": "Great party place, staff is extra helpful, food was good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabFRIWnphM0p3T1ZRelJWOUVSa1pQUkZwc09HYxAB",
            "text": "The \"come here\" finger gesture from the server to a long time customer says enough"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaE5EQnRkMVZHUkRCeGRVOW9Ua2RpWVhaNFNIYxAB",
            "text": "Great restaurant and the food was AMAZING DELICIOUS"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdmFYRlpUbmxYUWtGSGNWTlRUMDlxYXkxaFNtYxAB",
            "text": "Amé la comida, el servicio y todo ❤️‍🩹"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMk1rRnlhWGsyZG1oemVGcHdUR1ZuT0ZwYWQwRRAB",
            "text": "Good service and food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KeVN6WlNVekZKV1RsWGRGOU9TVEIxY1VwT1JsRRAB",
            "text": "Good service, excellent service, and good food. Would definitely recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdU9YbG9aVXRhY25FeVduUlVXRk00TmxWVFkyYxAB",
            "text": "On July 26 2025 we had a family reunion the dining hall was extremely hot due the ac was very low and female restroom was hot as well, our Spaghetti pasta was raw/cold I ask for ice by the time it was brought to me it was melted down. You guy’s need to do better okay. I will not highly recommend this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNGNqaHBNbU16YWpsUk0yMVNlV2swVEhaNVkxRRAB",
            "text": "Marbella is truly authentic Spanish food, great quality, lovely dining room, wonderful service, good value entertainment on certain days definitely a must try"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cVMxaDFTVVZOZGpKdWQyTTRaRGhpUlZaTWRYYxAB",
            "text": "An amazing experience. We ordered the octopus, the seafood paella, and the Valencian paella — everything was incredibly delicious, full of authentic flavor and perfectly cooked. The service was outstanding, friendly and attentive throughout. Definitely a place we would return to and highly recommend. Thank you for a wonderful meal!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NVVIYzJNMnBMZURGWFpreGZXWEU1VWpGcmFFRRAB",
            "text": "It's been a while since I last went to this restaurant, which used to be good then. Now they not only serve Spanish food but also Italian, something that caught my attention.\nTwo waiters were “serving us”, but they had such a bad communication and some disagreement between them, it honestly, made me feel uncomfortable. One of them, Miguel, when I asked him for the garlic bread, I ordered he said: \"You're not at McDonald's,” it was disrespectful. It took some time to bring the garlic bread, the squids and even water.\nMy brother ordered something from the other waiter, and the waiter told him: \"the other waitress is the one taking your order, ask him” really??? Then WHY was him also serving the table? I never understood what was going on! They were both tangled up with a table of 10 people. After a while, I asked about the appetizer. Miguel told me I didn't order it, my sister-in-law, who was sitting across from me, stared at me and said that even she heard me ordering the squid, even that, he continued telling me that I never told him anything.\nThe bill was the worst, where they practically charged whatever, they wanted adding 20% of tip to each check (3 checks) explanation were weird, they never gave us the reason, they were very bossy all the time.  Unfortunately, and after many years, I won’t go back there!\nIf you want to eat truly good Spanish food, I recommend El Centro Español in Queens, where not only the service is excellent, but the food is also delicious and no pricy, also, a wider variety of tapas."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMFNUQjFOVUp0VjJaV2QwaEdTelJsZGxweFluYxAB",
            "text": "I was invited to a party there and it was amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcFF6RnZhVVZuYm5JemRtSkhNV1I2UjFvd2NtYxAB",
            "text": "Wonderful experience! Celebrating Father’s Day at Marbella was the perfect opportunity to finally visit — my stepdad has been a loyal customer for years, but it was my first time.\n\nFrom the warm service to the delicious food and fair pricing, everything exceeded expectations. It’s rare to find a place that delivers on all fronts, and Marbella did just that.\n\nAfter this experience, I can definitely say it will be one of my favorite places to celebrate special moments."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJX1p5cFBnEAE",
            "text": "Great food, great service. Just an awesome experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc3ZxOU1REAE",
            "text": "first time here. came to celebrate a retirement for someone who greatly deserves to enjoy the rest of her life without worries. but let's get to the food and drinks. Arrived by 740pm. Seating was pretty quick. Waiters, Runners and possibly the Manager not sure we're very polite and extremely professional. Asked the wife and me for what we would like to drink and then awaited for to be asked what we would like to eat. meantime we were moved and seated with the retirement party afterwards where we gave the table waiters our peference of what to eat. 810pm we gave our orders and drank water and a Raspberry Margarita. The wife preferred if her meal (appetizer: Aguacate Relleno De Mariscos & a side of Fried Bananas ) could come out with my dinner a Paella A La Valenciana. Food started coming out to the table around 920pm. Waiters were a bit confused serving the table of 30+ individuals and weren't sure as to whom order what. which was a bit shocking when they wrote it down. my wife and I didnt receive our food until 940pm. At this time they also forgot the second choice my wife wanted and wasn't served to her until close to 1000pm. As far as my Paella A La Valenciana. the surrounding of my plate were colder than the AC that was pumping in the room. All the shrimp, mussels and shapes were cold as if they just pulled it out the fridge. The paella itself was tasty and delicious. which came with 2 small pieces of chicken legs who's legs part was cut off. Overall: The music was good, staff was great, food I would have to maybe try again. but for now I don't think I will visit anytime soon. unfortunately. thank you for the service."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNEpmNENREAE",
            "text": "Great service from the staff. Very customer friendly. Great food also"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJc2EyS1J3EAE",
            "text": "Serves Italian dishes, too! I The chicken parmigiana was plentiful & outstanding and husband said chicken cordon blue was the best he's ever tasted. Harpist (check days/times on website) was talented and the music added to the romantic ambience. All staff were dressed in suits. If you let them know that you're staying at the attached Best Western, you will receive 10% off your bill. The only thing we ordered that didn't wow us was the garlic bread. We went there twice during our two week stay in the area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJam95VHhBRRAB",
            "text": "Excellent sevice and delicious food !!!! Rare restaurant well done !!!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVdWNpRjNnRRAB",
            "text": "Great Spanish food. Service was good. Just took to long to get the check."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNROTcyZXFRRRAB",
            "text": "Second time back to NYC, spending g time with Family at Marbella/ Best Western,  above Restaurant."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReHN6czBnRRAB",
            "text": "So I keep asking myself why do I wait so long to come to this great place and when the bill comes then I’m reminded they add extra drinks to your bill and pump up the prices of your dish every single time! Other than that, the service is really good and the food is good as well, but please pay attention to your bill."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnci11clB3EAE",
            "text": "El mejor chef y mesero Emilio de este lugar. Buen servicio"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOHV6TzR3RRAB",
            "text": "2-21-2025 the 7 of us had a great time.\nThe food was great. The only lost star is because of the very few non-fish options. {one of us isn't a fish eater).\nEven though the smallish place was pretty full, the service was fast, pleasant, and efficient. The whole staff was friendly and helpful."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOXVUbk13EAE",
            "text": "I went to celebrate my dads 70th birthday. The treatment here is outstanding and they go out of their way to help you and make it an enjoyable evening."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXMzRQMGhRRRAB",
            "text": "숙소내에 있는, 레스토랑 입니다.\n깔끔하고, 분위기 좋아요~~^--^"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfLTRQakN3EAE",
            "text": "Great food, great service! Ordered the lamb shank (tender fall off the bone, delicious sauce), cod with lobster sauce (fish was cooked well- good texture, very yummy unctuous sauce), octopus appetizer (tender and good), Marbella salad (fresh), veal chop (very tender, the guys devoured it), and table side crepe service where they do a flambé in front of you (even in Europe… not a lot of places do this so it’s kind of special). Came for my friend’s birthday and the restaurant was kind enough to write happy birthday on his dessert plate. Charming traditional Spanish medieval feel - is different from most places. Excellent service! I really like this place!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aE92ckdnEAE",
            "text": "I came here for a Spanish project with my friends, and the waiter was very nice and patient with us since we had to speak Spanish (for the Spanish project). The food was very good, everyone loved their dishes and I would say it left a good impression of how food from Spain tastes like to me and my friends. I would definitely come back. The atmosphere of the restaurant was very friendly."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmb3RYbHFBRRAB",
            "text": "It's our first time to dine in these places. We actually went for our friend's birthday party. So we experienced their private dining area. Quite big, we love their decorations and location. Another good part is they have parking in front and rear area for free. Their food is also good and their service is nice."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURULTgzYXV3RRAB",
            "text": "We went there to see the flamenco show and had the prefixed dinner. I had the paella 🥘 valenciana, and it was good.  My husband had the salmon 🐟 and he really liked it.  My daughters had pasta🍝, which they enjoyed.  Their sangria🍷 is good. It actually had fruit in it. We enjoyed the flamenco🕺💃 show, it was great. I really recommend seeing it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0a0tPWXBnRRAB",
            "text": "We were greeted like family and treated like royalty.  We were here for the first time to celebrate my mom's birthday.  The food was delicious, the ambiance was like being in Spain, and the service was excellent.  I loved listening to Victor play our favorite tunes on his harp.  I was mesmerized by his talent.  My mom was so happy and they even had Victor sing happy birthday. We didn't even order dessert because we were so full and they thoughtfully brought a piece of flan  with a candle for her to make a wish and for us to share.  They made the best first impression!  Thank you for the great service and  for making my mom's birthday so memorable!  We already plan on coming back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtLXJ1aXN3RRAB",
            "text": "I am not writing this review to tell you what to do with your hard-earned money. I am going to share my thoughts and you make your own decision if you would like to try this place or not. The seafood always tastes fresh and not frozen. The paellas are amazing. The paella valenciana is the best for me. Also, their appetizer is great. The fried calamari and shrimp in garlic are a must-have. Furthermore, I love their homemade sangria. It is made to order. They make the sangria right before your eyes. I will add more pictures ASAP. However, one the best things about this restaurant are the friendliness of the staff, the manager Marcos and the owner Juan. Always attentive making sure everything is to your satisfaction."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd2NmT0F3EAE",
            "text": "Great atmosphere. The waitstaff are fantastic. The live harp music was an absolute delight. The manager was friendly and made sure we were well taken care of.\n\nNow the bad part. Apart from the Paella and the apps, the surf and turf was very dissapointing. The filet mignon had that supermarket low grade meat taste to it. The lobster tail was very bland. My friend had the same dish and did not like his either.\n\nNext time I will stick to the Paella which was flavorful and moist.\n\nWarning, the parking garage at the hotel has so many pillars with super narrow parking spaces and lanes that I scratched my car against a pillar trying to get out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNm91SWF3EAE",
            "text": "Threw a surprise 90th birthday party for my grandfather this past weekend inside the ballroom at Marbella. Service was spectacular. The staff was very attentive and communicative with me throughout the entire event. I live in NC so I had to communicate everything we needed/wanted through phone and email prior to our arrival the day before the party. Juan was extremely patient and attentive to all of our needs throughout the whole process. Pricing is amazing for everything that is included. Food was delicious! I would definitely recommend anyone looking to have lunch/dinner or throw a party/wedding to have it here! You will not regret it! Staff is amazing and all the guests cannot stop talking about how lovely everything was. I look forward to returning one day. THANK YOU! I will forever be grateful to Marbella staff for making my Grandfather’s 90th birthday a special one"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eE5yeGxRRRAB",
            "text": "Marbella, nestled in the heart of Bayside, is more than just a restaurant—it’s an institution, a culinary cornerstone that’s been anchoring the neighborhood’s dining scene for decades. When I first encountered their paella in 1987, it was a revelation, introducing me—and countless locals—to the deep, saffron-infused joys of Spanish cuisine. Since then, Marbella has evolved into the go-to spot for everything from intimate family gatherings to small wedding rehearsal dinners, all while maintaining an unwavering commitment to the fundamentals of hospitality.\n\nThe service here is impeccable, a throwback to a time when dining out was an event, and every guest was treated like family. It’s not just the food, though that’s reason enough to visit. There’s something magical about the ambiance—whether it’s the gentle strains of a harpist, the passionate rhythms of flamenco, or the soulful strumming of a Spanish guitar. Marbella doesn’t just serve dinner; it serves culture, enriching Bayside’s already diverse tapestry with a vibrant taste of Spain.\n\nBut let’s not forget the main event: the food. The dishes are crafted with a meticulous attention to detail, each bite a testament to the chef’s skill and the owner’s dedication. Speaking of which, the owner’s presence is felt throughout the meal, as he moves from table to table, ensuring that every experience is nothing short of perfect. In a borough as vast and varied as Queens, Marbella stands out—not just for its longevity, but for its unwavering quality and the genuine warmth that defines every visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdWJ6dTZRRRAB",
            "text": "In the 5 years I've been back in the USA since living in Barcelona. This place has the best Paella I've found. Anyone that knows good paella, knows that it's not easy to forget. Marbella provided exceptional food and drink that delivered day after day. I have been in town for work and found myself returning to Marbella 2-3 times a week. The staff has been very friendly. The drinks are strong and flavorful."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDcnZxRjFnRRAB",
            "text": "Nice service, live music and delicious seafood. Coconut smoothie is so fresh and I can’t stop it. My friend got two glasses of it! I recommend every seafood dishes in Marbella cause it taste juicy and fresh. I also like the sauce served…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfemR2a0NREAE",
            "text": "Marbella is a fantastic spot for authentic Spanish cuisine! The food is fresh and full of flavor, especially the paella. The live music creates a lively and elegant atmosphere, perfect for any occasion. The staff is friendly and attentive, making you feel welcome from start to finish. Highly recommend for a great dining experience!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeHV1Vl9RRRAB",
            "text": "Service was awesome very friendly and efficient! I loved my octopus and seafood salad but my fiancé tasted the lobster bisque and she did not like it…. Thinking of having our wedding there!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLekxPNzJBRRAB",
            "text": "I love this place, from the manager Juan is just a pleasure to deal with. He’s beyond polite, well spoken, professional and super helpful with any questions you may have. The servers are all also very professional and kind. The food is…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNHEyUFh3EAE",
            "text": "Wow, I have to say this place was fantastic. The staff was amazing and the food was even better. The salmon melted in your mouth and the shrimp was perfectly cooked. Finished it off with an amazing crime Brule. If you're in New York you have to try."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dTUzYktnEAE",
            "text": "Place is old looking and in front of hotel !!! Walk down\nthe stairs to no hostess for a long time and thought I was\nin the wrong entrance at first. The manager came over\nand I told him we have reservation and he look like\nsurprised and just walk us to a table!!! Bread came out\nfast but the waiter took about 15 minutes or more till my\ngrit was like where is he!?!? He come over and ask for\nthe drinks and got that and then ask if we ready to\norder!?!? Told him the order and he ask if we wanted the\nsalad and banana the same time and I told him yes and\nhe keep trying to explain to me together or banana with\nmain course like I don't speak English and he coughs on\nme!!! Then he ask my friend the same question WTH!!!\nSalad come tossed in front of u. We had the Caesar\nsalad the dressing was way to salty!!! Banana came 10\nminutes later!!! Main course my friends at the paella was\njust OK!!! My chicken with mushroom was nothing write\nhome about!! Really over cook chicken breast!!! When u\nask the waiter for drink and lime he will bring u a lemon\nand when u ask for lime he makes a face!!!\n\nAnd look at pictures they leave all the utensils on cart they wheel around and leave on the side where everyone is talking and coughing and sneezing with the Covid-19’s still around !?!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSd3FPb0hREAE",
            "text": "Tonight Marbella had a special event Flamenco show. It was fantastic! Food & show. I was with my family. The sangria is to die and the paella is a must. It beats going to the city when you can go in your neighborhood. Thank you for a beautiful evening."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhODVxa2xRRRAB",
            "text": "Amazing food, great ambiance, music, great service. Sangria was amazing. They make it to your liking for those that like sweet like me. Omg all the food was so great that we ordered. The Avocado with seafood is a must. The escargot was one…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbGItS0dnEAE",
            "text": "I wish I could give more stars! I recently had my wedding here and when I tell you this place was absolutely amazing in every way I truly mean it! The staff are all so amazing and they made that day extremely special and memorable. They did…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NHBQRDZBRRAB",
            "text": "The food was great. They bring out warm bread with butter. The drinks was perfect. I watched the The flamenco show. The show was  Is spectacular. The service was good. No long wait times. Waiters were  attentive. The margaritas🍹 was $11 a glass.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdkstVktnEAE",
            "text": "Fabulous paella and sangria. The waiter was very attentive, the food incredibly fresh. They have dessert flambay, which they cook on the roll-up table old style.The look is retro Spain.  Highly recommended sunday they have music/harp flamico show must see."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHMWE3UDRBRRAB",
            "text": "Beautiful restaurant. Classy. Beautiful decor. Food was simply delicious. Service was great. Must try!"
        }
    ],
    "reviews_count": 57
}