{
    "name": "Thai social",
    "place_id": "ChIJgQzDlIxhwokRqJMNGas85fo",
    "grid": "QN11",
    "address": "215-01 73rd Ave, Bayside, NY 11364, USA",
    "rating": 4.6,
    "user_ratings_total": 674,
    "phone_number": "(718) 395-3666",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWFpYSlFOekJxUmtzemIxOUxNR3BZWW1sc00xRRAB",
            "text": "everything was delicious and great atmosphere but the big wall painting in the corner is a bit creepy. A thai women with blood dripping from her eyes and ears. it's very disturbing and they should replace it with something more pleasant"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTE5XSmZhMVZ1VDBnME5tVnlYMEo1VEhsMlpHYxAB",
            "text": "A trusted local spot of mine for lunch or dinner. Food is tasty, staff is friendly, and service is on point!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MlFrMUtSMHhRUkVwaFVXVkxPVlpWWjJsR1pXYxAB",
            "text": "The food was delicious! Everything was fresh, flavorful, and perfectly cooked. Great service and comfortable atmosphere."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGS2RqSjRaa2xEVVhnNFJtaFNlVzVRU2pWVU0yYxAB",
            "text": "A lovely place. Ordered twice here and the food was great.\n\nDefinitely would recommend this place to anyone."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4M1YydHRjakpWVUMxblIxWlNkMVZ1ZEhGZloxRRAB",
            "text": "Food was amazing service from ally was great, presentation was spectacular will be back!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldUk3ZlhREAE",
            "text": "Nice little local Thai restaurant,  now with outdoor sitting,  noddles pad Thai 😋,  duck dishes,  mushrooms , all good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MWIzQlpWMjlqVUVKblIxUmFOMDlwVTBaM1YyYxAB",
            "text": "Yummy 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxZmRXaG9NRmhKUmtFdE5IWnFibFJYYjA5TU9WRRAB",
            "text": "I came here for a date night and expected good food but it ended up being FANTASTIC! the curry puffs and stew roti (special) were so juicy and delectable. The khao soi noodles and chicken curry were also fantastic. Tyler our incredible waiter gave us suggestions, explained the menu when needed and was very attentive. Would recommend to anyone"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVFFtSXhSVkV5YzNJNFRVWjROekppYzI1bU4xRRAB",
            "text": "Great food, very tasty"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTE56QlJjVmx4UlRGTE5uSkNaekJNV1RadFduYxAB",
            "text": "They are more than a normal neighborhood Thai restaurant. They have unique and interesting dishes and they have yet to disappoint! The service is quick, but not at the sacrifice of quality or taste. Highly recommended"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNVowaE9hMnBaWTFweFdXUkJjbmhKVkhOTFZIYxAB",
            "text": "Very nice atmosphere and very good customer service, our server Rain was very attentive and kind. Overall me and my bf had a great experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBM01USnhORXg2YW5kUlJVSkVOWEo0WjBSRVVsRRAB",
            "text": "This review is long overdue because this Thai restaurant is exactly what our neighborhood needed. Before they opened, there really wasn’t a spot that had both the cute ambience and the great food. The vibe here is perfect for date night especially the outdoor seating, which is tucked away from the avenue so you can actually enjoy a quiet meal.\n\nThe staff are always so kind and attentive. My husband goes through water quickly and his glass has literally never sat empty. That level of service says it all.\n\nFood wise, you can’t go wrong. My husband is loyal to the pineapple fried rice with chicken, while I am partial to the pad kra pao with tofu and extra veggies, this time I got it with shrimp (bonus: they offer brown rice). Spring rolls, dumplings, calamari all consistently great appetizers. And if you’re lucky enough to snag mango sticky rice for dessert, don’t skip it.\n\nDrinks are another highlight. Every single cocktail is as cute as it is delicious. I usually go for the passionfruit mojito, but the frozen passionfruit margarita I tried last time was just as amazing.\n\nThis place deserves way more than 5 stars. We’re so glad it’s here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSk9FOVlTbWQyTm5ZMWVsTlNhSFpLYW1GcmFHYxAB",
            "text": "Great atmosphere and excellent customer service! The food was absolutely delicious. Our server recommended a tofu dish, which I enjoyed, but since I was craving curry, I also ordered the vegetable red curry - it did not disappoint! The presentation was beautiful, the flavors were spot on, and the service was wonderful. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKcVRWRnFOR1p5UmtaSmNUazRWWFZrYWxKS1NtYxAB",
            "text": "Best Thai food in the area! Always consistent and great service. Our go to Thai ❤️"
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sU05HbFhiak0yY1RRdFZUWm9jVkZEUjJWa04zYxAB",
            "text": "Gutes Essen, guter Service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTlJrUnFNbTk1WW5sUWNVaFhiRWh5VTFocVIxRRAB",
            "text": "The best service ever ! Food was AMAZING 🤩! Drinks was great ! 10/10 must come !"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcjhybFd3EAE",
            "text": "This place is the best!!! The food is FLAVOR FULL! They've got all the Thai classics that most will know by name but they also have delicious specials that might not be so familiar but yummy all the same. Portions are perfect and you could definitely fill up on the varied appetizers but TRY AND RESIST...because your gonna want to have your dinner unless your a leftover kinda person which also works because this food totally travels well and the flavors don't die in transit. Honestly this place is my new favorite...wait did I mention the drink menu??? No? Well just know they've got something for everyone, even the kids my daughter had a coconut water(drink) and it was so refreshing I almost took more than a sip. My Passion fruit Moijto was amazing and its gonna be hard not to order the same thing evwrytime. Service is great and attentive food comes QUICK which is perfect!!! Bottom line you gotta check out Thai Social, you just have to!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aWRXeG5TakI0ZVVOcmR5MWhZMkZ0VVdJMlRGRRAB",
            "text": "Food is either too salty or too sweet. Wont come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNFpsbGxYMEUxY1ZjeGJsUkhiRFpQUm5Rd1IyYxAB",
            "text": "Excellent food and service for what you pay for. Great portions. Friendly staff. Great lunch specials until 330pm that come served with an appetizer, choice of soup or salad, and select entrees. Plenty of street parking, paid and free. Happy hour cocktails too. Overall amazing experience. Will be coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toelgxa3lUV3hmV25KM05FaGtWbTFpZEVvMk0yYxAB",
            "text": "Good calamari, massaman curry, pad see ew (kind of salty), mango salad, scallops"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdGRGZEtjbXByTkV4YVNEUmpiMU0xUkdFMVptYxAB",
            "text": "Amazing food local gem service was spectacular and drinks were 10/10!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbU0xVkpaR041YzFwbE0wOWplRWxRY0RGV2FXYxAB",
            "text": "I love, love Thai Social. The food is always delicious and the staff is warm and friendly. We're absolutely happy we live right in the neighborhood! The Cocktails are very delicious! I suggest the watermelon Slushie or Margaritas, are both great for a hot Summer day or night. We just had dinner there! Always a great experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRVIyazJPRlpuVmxJeldVVlRRazVVUW04elRIYxAB",
            "text": "Food is amazing. My husband and friends also agree. We have gotten an array of different menu items from Thai Social and everything is incredible. You will not be disappointed!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aVRUVTFWMFYyZEhscWRFNHpYMWxFVXpNMWFHYxAB",
            "text": "Words can’t even describe how amazing this place is! Our server Rain was so welcoming and kind, already giving us a great experience as soon as we walk in. The place was very clean and was very pretty on the outside and inside, The food and drinks were so delicious and they have a lot to choose from on the menu which I LOVED! I will definitely be back!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tveE5WaEpaMGRRTTAxRldVVkZNSE5KU0dSUFkxRRAB",
            "text": "I used to love this spot but the flavor changed a looooot! The flavors were on point I’m unsure what happened but kind Thai is just a few blocks away so I don’t think I will come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pac04wZEdXRTh4WDFsdlpXaEhkMGRHU3paZmRrRRAB",
            "text": "I’ve been coming here regularly and have always loved everything about this place. Unfortunately, this time the experience was disappointing. The food was really bad—I’m not sure if the chef changed or if it was just because we came close to closing time.\n\nWe were really hungry and had to wait quite a while, so it was frustrating to receive food that didn’t meet the usual standards. Honestly, I wish I could get my money back.\n\nI’m giving 2.5 stars only because of my previous good experiences, but I truly hope this was just a one-time slip."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQeXQyTV9tc05uaDB3RRAB",
            "text": "Me encanta este lugar , el servicio , la comida es fenomenal demasiado buena , el lugar"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaWQzWjBYMWQxUkZsWFZXaHNibXRyZURodmNVRRAB",
            "text": "What a beautiful diner. The atmosphere and the food was beautiful. Clean restaurant and great workers too as they are kind and professional. However the foods are meh. Despite looking very nice the glass smelled funny and the pork was a bit hard. Peach mojito Pad Thai was good as always. But the chef special scallops are lacking coconuts and too many grapefruits instead! SMH Nonetheless it’s a humble, fine restaurant that you could use the hang out with your friends."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMUDNzZW1Tb091bi13RRAB",
            "text": "The food was not great. We ordered the Thai wings for our appetizer, and it tasted as if they air fried them. I actually had better wings from my 15 year old daughter. The wings were nothing special.\n\nThen, the fried rice lacked the Thai authenticity and flavors we've come to enjoy. On the other hand, my wife did enjoy the drunken noodles.\n\nThe waiter gave us lackluster service, with little sense of care."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbXBnLXV6ajdYRHJ3RRAB",
            "text": "The flavors were authentic, the cozy atmosphere makes it a great place to gather with family and friends"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLREMzcG5BZ3JyR0NBEAE",
            "text": "Great little Thai restaurant definitely a go to if you’re craving"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLV3NtN1RaLXFhN3Z3RRAB",
            "text": "So crowed... place is so tight."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOcmU0WmJGd2VPVEVREAE",
            "text": "Drinks and food were delicious from here. Was too full at the time of dinner to have the mango sticky rice dessert at the restaurant, but ordered one to go so I could have it back at home. Honestly glad I did - cause it was super delicious!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLTEM1OXFidzZTTHRBRRAB",
            "text": "This place is so insane, I ordered squid fried rice today and recieved chicken fried rice, as v had to throw it as v dont eat chicken.. It was a waste of 38 dollars.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPUzAtNU9fLXFqNzRRRRAB",
            "text": "I love this place. The food is the best and the service is even better!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPSFJ5SzJvdXMyYkxREAE",
            "text": "Tasty big portions"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPdUR6LW5FNXNiZExBEAE",
            "text": "Delicious quality Thai restaurant. Perfect spot to end the day and enjoy a casual dinner after playing tennis nearby. We ordered medium spiciness for a couple of dishes (you can order not spicy, medium, and hot) and the medium was just enough to make me sweat a little but not too overbearing--perfect amount. Everything was delicious. I'm excited to return!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLT2h6T0dMMTVLNjV3RRAB",
            "text": "Me gusto mucho el servicio y la amabilidad y paciencia del personal de trabajo la comida es otro mundo para mi sabor diferente para mi paladar cocteles muy ricos y con buen alcohol 😅 sirven muy rapido los alimentos."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJVF9sZlMyb1BYWlJ3EAE",
            "text": "Tried the place for the first time, real authentic thai iced tea attracted us. Food presentation was beautiful from the cutlery and plating. The coconut curry was spiced well and warmed my soul, summer special salad made me consider coming back again for other specials. Some appetizers are a bit smaller than assumed, compared the price however the flavors were big and satisfying."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcHR6SmZ3EAE",
            "text": "Food was just ok. A bit pricey, especially cocktails. Staff were friendly and professional. I’ve wanted to try this place for a while but don’t think I will return any time soon as i didn’t love the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc3FIQmJREAE",
            "text": "One of the best authentic Thai places in this part of city. Food was on point including the flavor. The ambiance has a cozy vibe to it which makes it perfect for intimate gatherings. It can get busy late weekends so I highly recommend that you make a reservation. There is ample outdoor seating once there is good weather. My recommendations are the Turmeric Chicken and a regular Thai Iced Tea. Make it a point to visit this spot at least once, you won't be disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbE1HdU1REAE",
            "text": "Best Thai place in the area. We were seated quickly upon arrival. Their menu expanded with new items but we can’t help but order our go-to’s. The appetizers came out in a timely order. And only when we finished the appetizers, the entrees came out. The food is super flavorful, fresh and colorful. The service is great. The atmosphere is vibrant and trendy. Not sure if it’s women owned but it was all women at the front of the house - hostess, bartender, waitress, everyone!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncW9TM3p3RRAB",
            "text": "First time at this new Thai spot, and it definitely won’t be the last. We started with some well-seasoned chicken wings that hit the spot, then dived into a steaming Tom Yum seafood hotpot packed with flavors, just the right amount of spice, and fresh seafood. To top it off, we had a couple of beautifully crafted cocktails that looked as good as they tasted. The atmosphere was warm and inviting, and the service was top-notch. If you’re a fan of Thai food, this place is a must-try. Can’t wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc3ZfX2pBRRAB",
            "text": "This place was packed. We ordered a couple of appetizers, the curry puffs and papaya salad which was a bit overpowering with fish sauce. For our main dishes we had the crispy pork belly and the beef short rib penang. It was fall off the bone tender and the sauce seemed like it was added after the ribs were boiled tender. Our waitress was really efficient, maybe a little to efficient. She was quick and pulled stuff off the table even though we were finished using it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbU15MHR3RRAB",
            "text": "Absolutely lovely little bustling restaurant in queens. Worth a visit. Everything was delicious. The service and good food make a solid combo. Thank you to the manager Jane and server Luna who made us feel welcome and well taken care of also. Will be back! Bravo to the ladies who run the show ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqamNIVXZ3RRAB",
            "text": "I have been ordering takeout here through DoorDash for a few months. Everything is delicious. I decided to use them to cater my mom's 91st birthday dinner. Placing the order was easy. When I arrived to pick up the order, I was greeted by a warm, friendly staff. The restaurant is cozy and quaint. I ordered the pineapple fried rice, Thai wings, fried dumplings and mixed vegetables in garlic sauce. The food was a hit with my family. I will definitely use them in the future and look forward to  dining in there soon."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudDhmazZRRRAB",
            "text": "My husband and I stopped in to eat last night. We had the honey BBQ ribs and Tom Kha Guy soup for apps. The ribs were good, but they give you an odd number and for some reason we’re not able to make them spicy. Which would have entailed adding a sliced chili pepper to the sauce but they couldn’t figure that out. Also asked if they had chili sauce or chili flakes - no, they didn’t have that either. The soup was too sweet. It was totally missing the savory element. It’s just a bowl of white liquid with white chicken and white mushrooms. Devoid of color and spice. My husband got a spicy seafood dish that was delicious and had heat. So they do know how to add spice to a dish. My red curry was also too sweet. They never asked if I wanted it spicy, but I feel that wouldn’t have happened even if I asked for it. Service was excellent, very friendly, checked on us a few times. Food just needs a little something more to make it authentic tasting. Maybe more fish sauce, ginger, garlic and lemon grass."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bEl2OUd3EAE",
            "text": "I had a phenomenal experience dining at  Thai social. The food was really, really delicious and tasted authentic. The servers were very attentive and knowledgeable about the food. Beautiful decor and great ambient. I will be back for sure if I go back to NYC"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOcnRLemNREAE",
            "text": "Love the decor and bar. However I felt rushed dining in since I arrived around 8:15pm and note, they close the kitchen at 10pm. We were brought our appetizers and before we were done, they were asking to remove our plates. Skip the grilled scallops on skewers, it was overcooked. Must try the fried fish with mango. Beautiful dish and had a great balance of flavors and textures. Fish on its own was flavorful but the sauce made it less dry. Coconut pudding dessert was good but way tiny, for the value."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ai02bmV3EAE",
            "text": "Lunch special was a good deal. The spring rolls and dumplings were good. We also liked the curry puffs. Peanut sauce in the salad was amazing. Was not a fan of the soup that came with the lunch special. Drunken noodles were average. Basil Chicken needed more basil flavor, a little dry, as well. Servers were courteous."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPcC1MZTNnRRAB",
            "text": "Thai food is my hands down favorite and this place will not disappoint for anyone else who enjoys Thai food.  From what I saw, it's entirely run by women and man do they do a fantastic job! My visit was with a group of 7 and we tried almost every appetizer including both types of wings, dumplings, curry puffs, calamari and others, drunken noodles, fried rice, pork chop, salad, and red curry.  Thank you to the ladies at Thai Social for making it a great evening.\n\nQuality of Food - 5: Definitely fresh and authentic\n\nService - 5: The staff was extremely attentive and super quick with food service.\n\nPrice - 4: Can be pricey but if you want good stuff you tend to pay for it and in today's world, everything is quite expensive. We left a cash tip for the service but the staff was very quick and honest in pointing out that a tip / gratuity was already included in the check amount.  For their honesty, we left the cash tip as well.\n\nAmbiance - 4: Clean, Small place, outdoor dining available and more of a dating setup than a family night out but they can accommodate a small group (call ahead and make reservations if you have a group).\n\nNY Parking: Metered street parking is available right in front and to the side but if you park a block ahead or a block after (where the condos are) - parking is free!\n\nWill definitely return.  Enjoy!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGc3AzTXB3RRAB",
            "text": "Thai Social is a great restaurant that serves authentic Thai food. The menu has a wide variety of options to choose from, including appetizers, soups, salads, noodles, and stir-fries. The food is always fresh and flavorful, and the portions are generous.\n\nThai Social restaurant\n\nI have been to Thai Social several times, and I have always been impressed with the quality of the food and the service. The staff is friendly and attentive, and they are always happy to make recommendations.\n\nThe restaurant is also very clean and well-maintained. The atmosphere is casual and relaxed, and it is a great place to catch up with friends or family.\n\nIf you are looking for a great Thai restaurant, I highly recommend Thai Social. You won't be disappointed!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOS1QVmdnRRAB",
            "text": "Wow. We came here last night and all I can say is WOW. The food was amazing. Our server was sweet and super adorable. The fried rice was so good. And the service was really great. We had a good time. This spot felt so warm and welcome. We will be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxX3ZyQWVnEAE",
            "text": "Atmosphere: lovely area, not too crowded. Restaurant was very welcoming and friendly.\n\nService: Just great! Let’s just say my glass of water was never empty. Staff was always attentive.\n\nFood: you can tell by the cleaned out plate how amazing it was. Food was filled with so much flavor and the presentation was on point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNU9QUFJ3EAE",
            "text": "Good spot for classic Thai. The basil fried rice and drunken noodle was amazing, the fried fish didn't meet expectation. The appetizers were regular. The service is fast. The saddest part was sticky mango rice not being available, mango mouse with coconut icecream saved the deal!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcFptOU93EAE",
            "text": "Food is fresh and delicious. Great variety and special seasonal items are always amazing! Service & Wait Staff are kind, energetic and friendly. It's a warm and trendy vibe inside. The bar is well lit & centered. We regularly order take out and enjoy dining in as well! Lunch specials are great too. Some things we love:\nApp: Curry Puffs & Mango Salad\nGreen Curry, Pad Thai, Pineapple Fried Rice & Vegetarian Dishes\nDessert: Mango and Sticky Rice & Coconut Vegan Pudding"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfM1BxX0RBEAE",
            "text": "Attentive, pleasant, thoughtful service, with all your expected Thai fare, but certainly at a quality only outmatched by Michelin Star restaurants. At this price point, it's gratefully a location that makes it easy to get a spot to sit in on a Friday night with minimal wait. One of the best spots for Thai in Queens for sure."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGamZ2MW93RRAB",
            "text": "All of the servers are very attentive even if they aren't your server.  My server Fon kept my glass full and even replaced my dirt place.  Great waitress.  Great service.  Food is very tasty.  Very relaxing atmosphere. Beautifully decorated inside and out.  And Don't forget to leave room for dessert."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcXFXMldBEAE",
            "text": "I recently ordered delivery from Thai Social in Oakland Gardens, and let me tell you, their Chicken Fried Rice and Basil Fried Rice were absolutely amazing! The flavors were on point, and the heat level was just right. Even though I couldn't personally experience the restaurant's ambiance and service, the delivery was prompt, ensuring the food arrived in great condition. Yet, I can only imagine how much more amazing it would be to dine in and savor these dishes straight from their kitchen. Looking forward to checking them out !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMElLZzVBRRAB",
            "text": "I recently dined at Thai Social, and it was a nice experience. The restaurant is small and the atmosphere inviting with well-thought-out decor making it a perfect spot for any occasion. The service staff was friendly and accommodating and they were knowledgeable about the menu.\n\nThe menu is pretty big and they offer a diverse range of dishes. For appetizers, my group shared calamari, Zaab wings, crab Rangoon, and curry puff. The calamari was nothing special, but it was crispy and had enough flavor. The zaab wings were a dry seasoning, which made the wings a bit dry overall, but was still spicy and delicious. Crab Rangoon had more cream cheese than crab meat, which was disappointing. The curry puff was spot on though. The puff was flaky and crispy and it was stuffed with a good amount of curry. For entrees, I tried the Khao Soi Chicken Curry Noodles and Roasted Duck Drunken Noodles. The curry broth in the curry noodles was rich and and fragrant. The chicken was tender but lacked flavor. I think my favorite was the roasted duck drunken noodles. They did not hesitate to top my dish with a bunch of duck. The noodles were flavorful and has a good kick of spice.\n\nThe pricing is pretty average compared to other restaurants nowadays. I would say the quality of the food and the dining experience justified the prices. Overall, Thai Social is a good option for anyone craving for some Thai cuisine. Another great addition to the Bayside/Oakland Gardens area."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MVpUS3pRRRAB",
            "text": "This is my second time visiting this restaurant. Very friendly servers. Food is consistent and delicious. You can request based on spice level. Variety of options to chose from as well as drinks."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNk96VmNnEAE",
            "text": "Authentic Thai food is not rare or hard to find in New York City. But finding one with great service and atmosphere is a challenge.  Thai social is in a quite neighborhood with good food, affordable prices and fast service. We ordered from the fish and vegetarian items and the food was very good. I would strongly recommend the mock duck. We will definitely have to come back to try the rest of the food.\n\nUpdated on Aug 23 - still very good service and food freshly prepared with authentic spices."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNDlpcS1BRRAB",
            "text": "The service was great. The chicken was great. The calamari is not bad but the oil taste old. The fried rice was too sweet. Overall the experience was nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0ck4yS2JREAE",
            "text": "Indulge in the vibrant flavors of Thai cuisine at thai social in Bayside, Queens. This restaurant’s charming decor and cozy atmosphere create a welcoming environment. Each dish and cocktail is not just a treat for your taste buds but also a visual delight, showcasing vibrant colors and meticulous presentation.\nWe started off with the irresistible grill scallops with Thai chili sauce. It was so yummy. Next we had the steam Branzino , immersed in a fish sauce and fresh lime-based broth, creates a harmonious blend of umami and acidity. This is a-must try. The lime broth is so refreshing and just WOW. Next was the silky egg mixture with squid and shrimp, a magical fusion of textures that captivates the palate. Don’t miss The beef short rib in Panang sauce . It is a masterpiece of tenderness and savory delight.\nManager GIG’s friendly demeanor adds a personal touch to the already impeccable service. From start to finish , this spot promises a journey through flavors and ambiance that leaves you craving more.\nHighly recommended this spot. If you are in this area , please check it out, you won’t be disappointed.\n\nFeaturing :\nFried crab meat Roll\nGrilled scallop skewers\nSteam fish with Thai herbs\nKang Pu ( coconut crab curry)\nKai Toon Talay ( steamed egg )\nBeef short Rib Panang\nKhao Tom mud ( Thai banana in warm sticky rice)\nRose Cocktail"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScl92X2dBRRAB",
            "text": "I’ve been to many Thai restaurants. This spot definitely ranks high on my list. Food is delicious, service is great. I got zaab wings and dumplings as appetizer. Basil fried rice with chicken which had a unique but great flavor profile…"
        }
    ],
    "reviews_count": 65
}