{
    "name": "Picciotto",
    "place_id": "ChIJR0eiLrWLwokRLukvCHO1h-I",
    "grid": "QN11",
    "address": "42-34 235th St, Douglaston, NY 11363, USA",
    "rating": 4.7,
    "user_ratings_total": 192,
    "phone_number": "(718) 233-8213",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMWRVUlRlRWx5UVhFellUSlhWVmx5ZGtKdlpsRRAB",
            "text": "A wonderful hole in the wall place"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OQk5VdHpaRVZtWjFaTFEyZHROMlZNYUV0ZlpYYxAB",
            "text": "Very good service abd the pizza was amazing"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSVlYZFNVM2g1UW5oNGRIbEtSM1J0TTNOVE9WRRAB",
            "text": "This place is so wonderful I can’t adequately do it justice. First the food is amazing. Everything I have ever ordered was just absolutely delicious and much reminds me of my trips to Italy. Second, the atmosphere is relaxed, cozy and often has really fantastic live Jazz performances from very talented musicians. But the best part of the restaurant is the owner, who is legitimately a truly special and kind person with a warmth you rarely find in NYC. We celebrated a birthday there and the kindness he showed in preparing a special dessert for our friend was over the top. I would go just for the food but it is nice to support a really good person who takes immense pride in his craft. One thing all the food is made fresh and not pre-prepared AT ALL so you sometimes have to wait. But sit and enjoy the music and have a great time. This is not fast food, but a quality meal crafted with care by a great chef. Can’t recommend this enough!!!! I don’t even live in Douglaston anymore but make special trips just to eat here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeU16WktTVlo2VGt4ck5HWk5kbE4xYTNFNFNYYxAB",
            "text": "My favorite neighborhood pizza and Italian spot. Very authentic taste and high quality food. Worth the wait!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200dFZFUk5NbDluYUd3NU5FOW1XVmRsTTNwUldsRRAB",
            "text": "We over ordered and couldn’t finish the prosciutto pizza after an app, bread and pasta.  Looking forward to leftovers for lunch"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOS1J6VlBXVmRWTjJKVU5FTnRhRVZRZWxkRWJuYxAB",
            "text": "Alessandro is awesome - great guy with some serious Italian pizza making skills. Hope this place is here to stay forever, wouldn’t be surprised if they end up on a food show at some point."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5eE1ubHZUbWRtYkdSU2NGQTBkVTlzVmtscU1HYxAB",
            "text": "We went to Picciotto a couple of times already, and the quality of the food and service were superb!\n\nThe pizza is a gem. Every pizza lover should make this place a destination. Located in a charming street in Douglaston, the first thing you’ll see in the window is the chef making the pizzas.\nThis is not your typical fast-paced fast food pizzeria. Everything is done with precision, attention, care and love. You will wait for your food, but it absolutely worth it.\n\nService is great and kind, and prices are fair.\n\nHighly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMk5sTmFUMk10WW1RME5GcEVNWEpaWVRWRGRHYxAB",
            "text": "On behalf of The Center for the Women of New York, I want to extend a heartfelt thank you to Picciotto for their generous and delicious donation to our Taste of the World at Fort Totten gala.\n\nThey provided panelle (chickpea flatbread) and mini pizzas that were truly special. The panelle was wonderfully savory and tender, with a delicate texture that delighted our guests, while the mini pizzas were topped with flavorful ingredients and baked to perfection. Both offerings showcased creativity and authentic Italian flair.\n\nIt is because of dedicated local businesses like Picciotto that we are able to raise vital funds for our mission of supporting women in the New York community. Their commitment to giving back reflects a genuine care for the neighborhood, and it’s exactly why I’m proud to support businesses that prioritize both quality and community.\n\nWe highly recommend Picciotto for their unique and delicious offerings and their tremendous generosity. Thank you for your kindness and for helping make our event a success!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcFdUWkNUblJrZFdweE5WZEhNM1JITmpac1puYxAB",
            "text": "Authentic Italian cuisine in a warm and inviting atmosphere. While you may wait a little longer for your meal, this is actually part of the charm—every dish is prepared fresh, and you can even watch Chef Alessandro in action. A truly worthwhile experience. Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScE9EWmZhM2xMUlcxNE1WRnVkR2RWWTNGUUxXYxAB",
            "text": "Came there on a whim with my little kids during the day. The pizza and pasta were great for them and watching the chef fill the cannoli was very fun for the kids. And not expensive - looking forward to come here with the whole family soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abVJsTnlTbmM0WDBwVVNIUjZXWGt5ZFdaRlJXYxAB",
            "text": "Delicious food,  sit inside or out.  Outside is wonderful in the summer time under large shade trees.  Great atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxamF6azFUbkZyUkVaSlEza3pPVWgzV25wTE1FRRAB",
            "text": "Alessandro teleported me to Sicily with his “Quattro Stagioni” pizza. This place is an absolute hidden gem. REAL AUTHENTIC Italian/Sicilian dishes. No chicken parm on the menu and that’s the way it should be. My new favorite pizza spot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZemRrRlpXblpXWkdjdFFYVkpjRmR1TlU1VlYwRRAB",
            "text": "Incredible food and experience!! Alessandro was so kind and welcoming, definitely will go back and recommend!! Felt like I was in Italy 10/10 recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRVZ5MVlUazFmU1Zad1dXWjBhM0IyU0ZwTGRGRRAB",
            "text": "we waited 1 hour and 15 minutes for 2 pizzas. my entire family finished their food and my pizza had not arrived yet. good pizza, nothing special, not worth the hour long wait."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cWJqSm9SVEZGZDJSMFVGTklXVWRGVWw4eFprRRAB",
            "text": "Why it took over an hour and a half to wait for my food is beyond me. First when I placed my order it said it would be ready by 8:03p. Then on arrival, I’m told to wait another ten minutes, which is fine. I’m waiting around for 20 minutes and I have to approach the waitress to even get a status on my food for her to just say “ well the app doesn’t say it’s ready”.  I understand that it is one person making the food but at least be honest about whether or not the food is being worked on instead of gaslighting me to saying it’ll be “ 10 minutes “ or “ the app doesn’t say it’s ready yet”.  You shouldn’t be basing it off your app, you should be checking whether the food is even in the process or not and actually provide me with an accurate wait time. Providing empathy and updates to someone’s order as they’re standing around waiting for their order is important for the service. Maybe it’s because they saw I wasn’t one of their typical clientele and they felt like they could provide me subpar service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWlRtcHNiazk0ZFUxSVZGTXhOVk5KTUhBMWMyYxAB",
            "text": "In Douglaston there is a hidden gem, you feel just like you are in Italy 🇮🇹. I am a foodie to put it lightly!!! Alessandro is a wonderful host, he does it all. Everything is made to order, delicious 😋!!! We started with the spinach salad, then we had Gamberetti all’aglio an amazing tapas shrimp with garlic and cherry tomatoes. We had an Ian Special panini a margarita pizza and topped it off with an affogoto and gelato. We have been here 4 times in 3 weeks. I was almost afraid to spread the word of how delicious everything is here. We will most definitely be back to try more!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOakloZXVuODg3WjFnRRAB",
            "text": "Wondeful Sicilian Pizza, Great Deliciously.\nNapoli Pizza recommended!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJeko4YTJrbF91TW9RRRAB",
            "text": "Went here last night for first time. Amazing service. They have outdoor in the front and nice area in the back. As soon as you walk in the wood fire stove if clear to see and it smelled amazing. Fresh warm bread is served at the table and the pizza was perfect and tasted even better. The cannolis were fresh as the shell was still warm. My daughter enjoyed watching Alessandro make the Nutella pizza at the end. Nice hidden gem in Douglaston. Can’t wait to come back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLR3hyZVhtcHZMM2VREAE",
            "text": "Authentic Italian food, nothing else to say."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLSHhrNDNxd2FUM25BRRAB",
            "text": "Pizza was burnt. Theres some Alesandro guy that was just screaming at the kids working in front of every customer, horrible food AND service.\n\nMy niece avoids this place because the manager is very creepy as well. Beware!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcW9EYVhREAE",
            "text": "Picciotto is the most authentic Italian food I have had in New York and Alessandro is an amazing and warm host! We truly felt at home and experienced Italy through the taste of his dishes! We came all the way down from Southern Italy for an academic research project about Italian food in America and can guarantee that Picciotto is the best in town! His Margherita pizza is like a very good one in Naples where I come from, his lasagne, arancini, panelle and cannoli are delicious, and her pizza con Nutella and fragole was such a blast! We highly recommend this restaurant and will be back next time for sure!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvZzhXU3Z3RRAB",
            "text": "If you’re looking for an authentic taste of Sicily in Queens, Picciotto Restaurant in Douglaston is an absolute gem. From the moment you walk in, you’re welcomed with warmth and hospitality—especially by Alessandro, the owner, whose generosity and passion for Sicilian cuisine truly elevate the entire dining experience.\n\nThe dishes are rich in traditional flavours and made with incredibly fresh ingredients that you can taste in every bite. You can tell each recipe is deeply rooted in tradition and has a story that Alessandro is more than happy to share it.\n\nHighly recommended for anyone visiting Queens—this is not just a meal, it’s a true cultural experience. Bravo, Picciotto!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveWJmWkhBEAE",
            "text": "It feels like home ! Little Italy experience in Douglaston! The food is cooked with soul!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRczdxZWJBEAE",
            "text": "Pizza..excellent\nFood...excellent\nService..excellent\nAtmosphere..excellent"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaXBYNEN3EAE",
            "text": "Went here to this restaurant yesterday after many people recommended this place in Douglaston. I tried to send back the pizza as it was completely raw in the center. My girlfriend is Italian (born and raised in Trieste) and clearly the buffalo mozzarella is not the real stuff he’s trying to pass it off as. Waited 40 minutes for a basic pizza that anywhere in Italy would take 5 minutes to make. The best part is the restaurant wasn’t even half full and when i complained i was told the chef/owner didn’t want to talk. Will never go back again"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndEtiRlVBEAE",
            "text": "I found this place just yesterday on Google Maps as I was craving pizza. I saw the online menu and thought what a nice selection they have.\nI ordered the smoked salmon pizza to go.\nWith no exaggeration, this was one of the best pizzas I've eaten. Crunchy crust, lightly cheesy, nutty flavor from the arugula and the smoked salmon was delicious.  The capers added a nice touch.\nThe people who work there including the owner were very friendly.\nI will be back!\nBuona fortuna!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBenBpeTRRRRAB",
            "text": "I came for lunch with the fellas while the ladies had a baby shower and we loved the food. Everything came out delicious and was worth the wait. The waitress was attentive and checked on us constantly. The restaurant is small but creates a cozy and quaint dining experience. Would definitely recommend coming here. Also, Alessandro is an incredible owner."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dC02T3dRRRAB",
            "text": "the best ever"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMGJ6TE13EAE",
            "text": "Probably the most authentic pizza in this area"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcElyMGVREAE",
            "text": "La pizza es deliciosa. Alessandro es genial y cocina delicioso. Altamente recomendable. No te vas a arrepentir. Será una de las pocas cosas que extrañare de NY"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeFpfdWdnRRAB",
            "text": "I placed a takeout order. It took longer than I anticipated, but it was worth the wait. The food was so good! I'm definitely going back for more!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOGVTQzJRRRAB",
            "text": "I love this place! The food is always excellent. Alessandro, the owner, is always so kind and takes great care to provide excellent food and service.\n\nI cannot recommend this place enough."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmLWMyRkNREAE",
            "text": "Stopped by to pick up pizza. It was running a little behind so stuck around andgot some wine as well while a jazz band played. The pizza is authentic and super high quality. Will be back to dine in"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmOXE3QURBEAE",
            "text": "When I looked up a place for wood fire pizza, I saw that Piccootto had great reviews but I was not prepared for how well they would live up to the hype. It is such a small, unassuming pizza spot in the middle of nowhere but ALL the food we ordered was AMAZING! The lady that served us was so down to earth and sweet.\n\nWhen we ordered the Pollo e Broccoletti , they didn't have brussel sprouts but graciously substituted with broccoli rabe which turned out so delicious with the garlic and chicken. The focaccia that came with the order was so soft and chewy with a great crispy crust that went so well with marinara.\n\nWe also ordered the 3 meatballs as an appetizer and, I have to say, it was the best meatballs I've had. They were so flavorful and tender and the outside was nicely browned which gave it an amazing texture.\n\nWe went simple for an entree and got the Margarita pizza and was not disappointed. The sauce was perfectly seasoned and the cheese was not too salty or overpowering. The dough though. Something about it was just SO tasty! Thin and soft in the center from the sauce and cheese but crispy and chewy when you get to the crust. Tasted great dipping it in their marinara sauce for extra flavor. One of the best Margarita pizzas I've had.\n\nFor dessert, we got cannolis and tea which was a great way to finish off our meal. The cream was fresh and not too sweet and the cannoli shells were crispy.\n\nOverall, this was a 10/10 meal and will 100% come back to try other pizzas and entree dishes. Will definitely be back for more of those meatballs too."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aE5Pakx3EAE",
            "text": "First timer.. really authentic Italian! Pollo e Broccoletti and veggie panini (best ever) with light instrumental jazz! Our server was spot on for our first visit.. Definitely worth the wait. Hats off to the owner chef Alessandro!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2d1A2Z0lBEAE",
            "text": "This is by far my family's favorite restaurant in the area.   Alessandro is wonderful, always saying hi to me by name when I come in.  The food is delicious, the Ian panini is insane, and my kids are convinced that it is the best pizza they have eaten.   The strawberry Nutella pizza is a star."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNmVHZVp3EAE",
            "text": "If you're looking for a cozy place with top-notch Italian food, Piccioto is the place to go. The combination of their wood-fired pizza and the chicken cutlet panini is a must-try, and the staff makes you feel like family. I can’t wait to come back and try more from their menu.\n\nHighly recommend! Piccioto delivers an authentic and delightful Sicilian dining experience that will leave you craving more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMHV6V0p3EAE",
            "text": "I just want to share my experience. I placed an order for 2 pizzas, they told me it’ll be ready in 20 mins when I arrived they had me waiting an additional 40 mins then to discover the Chef was not in the building he went out to the store. When he arrived he had strawberries in his hand. He made the pizza In 5 mins. And it was very undercooked and was not eatable I would never recommend this place to anyone. Terrible service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdExIcXBnRRAB",
            "text": "Part of me wants to gatekeep, but the owner/chef deserves all the success. The restaurant is situated on a quiet tree-lined street and is lovely for both al fresco and indoor dining. The food is delicious and exceeds Italian places we've tried in NYC and Italy. It can get busy and food might take a little longer but rightfully so; each dish is prepared with utmost care. Great spot to enjoy good food and company. Highly recommend the origanata."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaE16UGdBRRAB",
            "text": "Had the linguini with shrimp in a white wine sauce. Delicious 😋…"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcl9lYUF3EAE",
            "text": "마치 드라마 세트장 같은 .... 귀여운 이탈리안 레스토랑 🍕🍝💕"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MU5IYXB3RRAB",
            "text": "Hidden gem 💎\nTraditional Italian restaurant,  loved the authentic experience here.\n🦋The atmosphere definitely reminded me of being in Italy,  especially the owner who made everything from scratch.  It was an amazing experience.\n🦋make your way here if you truly want an Italian experience,  with no rush, sitting, and socializing... and the food will come when it comes.\n🦋the service was on the slow side because it was a full house, so it was understandable.\n\n🦋My favorite  was the Buffalo, basil,  cherry pizza. It was delicious.\n🦋the nutella pizza with strawberries was perfect for dessert & sharing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdnRpN0lnEAE",
            "text": "A pleasant experience! We got there at 730pm and even though they close at 8pm, they welcomed us to come and have dinner. Food was excellent! Pizza was delicious. The ingredients were just right, the brick oven flavor was distinct. It truly is a hidden gem in the town of Douglaston. Pleasantly surprised we have such an authentic pizza experience here in East Queens! Love it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOFlQMkd3EAE",
            "text": "The chef and owner Alessandro is absolutely wonderful and you can tell he puts TLC into everything he makes. The pizzas are so fresh and made to order. Tried them after seeing Dave Portnoy went and rated them high and they definitely deserve the score, it was delicious and super authentic Sicilian style cuisine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGOGR2a1ZREAE",
            "text": "Pretty good Sicilian style food. The chef is Italian and they make all pizza in a brick oven. The pizza was good, but a little oily for my liking. Salad was decent but the eggplant appetizer had too strong of an olive taste for me. The portions aren’t huge for the pizza so expect that. Overall, it’s a pretty good place with alright prices and good pizza for the area. Street parking available."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPM3BHSUhBEAE",
            "text": "So far I have gotten just the Lasagna bolognese but I am definitely gonna go back to try the pizzas and order the lasagna again. Let me just come out and say it, the lasagna is bliss. The second the food went into my mouth I actually made a 'yum' sound and felt like I was in Sicily. The Lasagna gave a full mouth feel. You can taste the tomato sauce like its homemade, the cheese and meat giving such a fluffy and full feel texture, the pasta nice and light just combine to make this beautiful delicious symphony in your mouth. I cannot stress enough how good it was.\n\nThe service was impeccable. Hazel is such a kind and courteous woman, who makes sure to go out of her way to ensure everyone is having a great time. She is very nice and friendly to customers which makes the food feel that much better. The chef/owner Alessandro is also nice and friendly to customers, and you can see that he puts passion and love into his craft.\n\nThe atmosphere is also very beautiful and gives off a small European cafe. On a nice clear day its definitely a nice choice to come by and get some food and sit and enjoy the sunshine.\n\nI am definitely going to come back with my parents and friends. This is an amazing place to get a more authentic pizza and lasagna experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobmRQWGNnEAE",
            "text": "Every single dish our large group tried was 5 stars. Including appetizers, pizzas, pastas, wines, gelatos, etc.\nWhatever you choose will be delicious and very authentic Sicilian.\nThe atmosphere is excellent. Everyone is very friendly and caring.\nEverything is very clean and decorations are fun and authentic.\nThe wood fire oven gives everything a delicious flavor.\nAlessandro, the owner, is an excellent host and a master craftsman.\nDefinitely try the Nutella pizza!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMEpDN1dREAE",
            "text": "This spot is a small jem in town. Just a blocks walk from the train station, Picciotto is the perfect place to sit down or grab a bite on the go.\n\nI had to eat before catching the train and this was the right place to come to. You walk into the kitchen, nice looking brick oven piping hot ready to go. The owner of the spot (I believe his name was Allessandro) cooks the food himself.\n\nI ordered a margarita pizza, and while it was being prepared, I mentioned the train in ten minutes. \"I'll be ready in five\". The restaurant had just opened af 4pm, I had no idea. \"Time it!\", he says, and I do.\n\nNo joke, 5 minutes from prep to finished. Fresh, delicious ingredients. I will be back again. Great talking to the owner and eating some of his food. Check this place out!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPN05yWWVBEAE",
            "text": "Perfectly located right off the train, this amazing little street side pizza / cafe spot is a gem. The food is excellent; ive been here half a dozen times with my girlfriend, we have tried almost every item on their short but perfect menu…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1anByY0pnEAE",
            "text": "Want to give them 10 stars or more.\nOh my!! This is the best Italian (Sicilan) restaurants in town.clean kitchen, nice people  and tasty Food!!!!\nNo Hawaiian pizza. Haha\nI recommend to others!!!!!\nSupper nice!!! Must try!!!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLXRIYjhnRRAB",
            "text": "I came here twice already and have been meaning to write a review for this charming place. Its a small neighborhood  restaurant thats got both great food and lowkey vibe. Service is great and food is made fresh!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNmRLWklBEAE",
            "text": "Amazing wow. Actual chunks of Parmesan cheese used. Traditional Sicilian Calzone was great too!  Get the pie we’ll done you won’t regret it !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMWEzVXNnRRAB",
            "text": "Amazing pizza with thin, chewy crust that can hold its own! Wood fired oven, premium ingredients… Super happy this place has opened near me!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMk1tUElBEAE",
            "text": "Excellent food and service, can be a bit slow because the chef works solo, but prepares authentic Sicilian dishes and excellent pizzas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcFoycWhBRRAB",
            "text": "Really brings me back to Sicily. The food is very good and authentic. Unfortunately the only issue was the service was slow. I get that they cook fresh but I hope they can work out the kinks in their process because I would love to come back. Staff were very nice and the head chef came out to say hello to people. That’s the right way to do it. Best of luck to you!"
        }
    ],
    "reviews_count": 55
}