{
    "name": "Il Bacco",
    "place_id": "ChIJXTketu-JwokR6rcaxvQrrOY",
    "grid": "QN11",
    "address": "253-24 Northern Blvd, Little Neck, NY 11362, USA",
    "rating": 4.4,
    "user_ratings_total": 1243,
    "phone_number": "(718) 224-7657",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ST2RFVkZSM2hLUm10ZllUSkJNelJ2WlRkc1psRRAB",
            "text": "Good place"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacU9HTmxlR3BzYjJKaGFTMUhTSGR6Y1ZodWEyYxAB",
            "text": "If you are Italian, don’t eat there."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWU9UaFJZV0Y2VUZkbk1qTmpRVWgxVGxWd1MwRRAB",
            "text": "I need to start this review off by saying that the owner, Joe, told my mother to “Smile.” She is here attempting to celebrate her father’s life and this insensible owner had the nerve to tell a woman to smile. Disgusting. Boy was this far from anything celebratory. I personally felt like a waitress myself, as I needed to go find someone who works at this place to tell them how many more dishes were required. Out of 5 tables, no one got the same assortment of appetizers. The single waiter for a party of 40 began taking dinner orders before a single drink was served. They attempted to tell us “it’s a lot of people” like they were clueless a large party was coming for a funeral luncheon.  Having worked in the service industry myself, I know this is far from acceptable. My mother was told to pay in pay in cash because somebody “knows a guy at Il Bacco” and we would be treated right. Ha!\n\nIf you happen to be reading reviews looking for a place to host a large party, please keep scrolling and move on to the next… unless you’re looking to be disappointed and extremely underwhelmed. Hope this was helpful!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcVVFc3dka1YxV1hwR1VEUTVMVGd3YkdsRlMyYxAB",
            "text": "All 5 stars 🌟\nThis is the most authentic Italian restaurant in Queens\nNothing beats this place\nThe mushroom ravioli in white sauce is the hottest dish here"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcWJWTkRaM2t3TUdWMFJ6ZEhNRWhtUkc5blRYYxAB",
            "text": "Can't go wrong here. Bar is great. Service is great. Food is great. Prices are reasonable. Come in for an excellent Italian experience."
        },
        {
            "date": "3주 전",
            "language": "it",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcmFXaFVhM280VmsxUGRYQmFWMUF4UW05cmQzYxAB",
            "text": "Maestro! Perché hai chiuso la pagina instagram! Ci mancano le tue fiammate!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMWQxaGpPVVZYVFdSemNqWlRaM2wwYURSRVNsRRAB",
            "text": "We did not enjoy our night at this restaurant at all. The atmosphere was uncomfortable from the moment we sat at the bar. George, an older male server, was acting extremely inappropriately—not just toward guests, but also toward the younger staff. His behavior was disturbing and crossed professional boundaries multiple times.\nIt wasn’t just awkward—it felt unsafe. He kept making suggestive comments and hovering around female staff and customers. Honestly, someone should call the cops. No one should have to work or dine in an environment like that.\nWe came out hoping for a fun night with friends and left feeling disgusted and disappointed. I hope this place takes action to protect staff and guests."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKR1ZXUjRhVEl6TUROaWRrMWpWMEZrT0Y5bWNHYxAB",
            "text": "The best, simply the greatest highest quality italian resturant in nyc."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRWVUUkVZbGhaVDJKQ1dtWnJObGx5VmxCUU5YYxAB",
            "text": "Went on a Sunday right when it opened and it was really fast service! Our waiter was very kind and attentive, and the food was AMAZING! We got the calamari, caesar salad, caprese, and spaghetti. Highlight would definitely be the spaghetti!\n\nWill come again! 😊"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeFpTMW1XRm90VVdwRlpFVXhkbkZCTjAwM1kxRRAB",
            "text": "Great ambiance , great staff , a must and an eastern queens staple."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSblFteE9NMWhJTm5od04yTlNSRk42YXpVMWIxRRAB",
            "text": "Authentic old school white tablecloth, Italian restaurant that could be a long planned family dinner or a last-minute stop before the airport. Much of the pasta is homemade and can be tailored such as skipping butter and using olive oil instead. I had homemade tagliatellini with mushrooms, tomatoes, arugula, garlic in olive oil instead of butter, hold the mozzarella, perfect in every Italian way. They start you with the real deal Italian bread, olives, first press olive oil for your bread dish and hunks of parmigiana Romano. Waiters are old school, professional and engaging. Memorable. Valet parking a bonus."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4d1MyZzBWVVJhTTFOamJFWnRSazFhVkdkSlpYYxAB",
            "text": "This is my favorite restaurant of all time. The menu, while a little pricey for a college student like me, is a wonderful mix of variety. There is no bad option in my opinion. The food and service is exceptional. The atmosphere is a lower-high end sort of vibe that prioritizes class and comfort. The bar tender is generous and the drinks were delicious. And the the desert: fantastic. I've never had better tiramisu"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVlJGcFdPV3N0UTNSa2IzQlZRWE5vYTFCdmNWRRAB",
            "text": "Always my go to when I am in little neck. Their veal Martini is out of the world."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacGJtMWZaRFpIZUhOYVFVVldTekoyUWxSbGVsRRAB",
            "text": "Wow, just wow. Polite, friendly staff. I celebrated my birthday and the restaurant made it very nice. Fantastic staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMmVIZGpka0pFY1RCUVl6VjRWa2RuVjI1WGRIYxAB",
            "text": "My favorite spot. It hits all the check in the boxes for my italin cravings and more phenomenal spot and great staff they treat you like family."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MVVpMVdOMmx4WlZWZmNYVkpRbmN0V25vMU5HYxAB",
            "text": "Been going to IL BACCO for 30 years!  Gets better with age.  Food is superb.  Wait staff are old pros.  You're treated like family.  It's a joy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWGJEazBaa1JqUlRaa00ySk5ZMXBUYUROdVJHYxAB",
            "text": "Outstanding food. Easy to find after the game."
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoV2VuSTVMV010VDJaUFpHVm9SSGQ1WkRSemFWRRAB",
            "text": "Non aprite quella Porta .\nPotrebbe avvelenarvi. Dangerous"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scGQzY3lla3BOT0RjM1FYSk9WV3MyYm1nelFYYxAB",
            "text": "Beautiful decor acompied by great Service and Excellent choice of Fine appetizers and entrees, reasonably Priced and the owner Joe is a Great Host whom always greets both new and old customers Highyly recommend for a nice evening out"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnM3B1cDVBRRAB",
            "text": "Good is not good, had spaghetti and meatballs, it was so bad"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNmVGbFNNRTlSV1ZwcVJrMVhaQzFKWjJOTlYxRRAB",
            "text": "Wedding reception. They did an amazing job."
        },
        {
            "date": "4달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoM1kyZE5jbmh1ZVZkbloyTlhZMUF5ZUZRMmVGRRAB",
            "text": "👍🏻"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WFVVSkhTbEpPYjFkSU9XcGtjWGhNZWtGeU9HYxAB",
            "text": "Excellent food, service and atmosphere. Great italian restaurant"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSlFYcEtZVzlpVmtNNGVVWjZSbFJUUm05SWFIYxAB",
            "text": "Large vibrant space. Sophisticated decor and the aroma from the kitchen is wonderful. The staff is very friendly. Service is crisp and a little frivolous. The food is great. Very nice dining experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUmJtNVBNRGRPVTFSV2J6TlBkbXR0VG5kdk5WRRAB",
            "text": "I recently had an event at Il Bacco and this place has amazing food and great atmosphere.  The staff was amazing. The planners handled our event with ease and everything turned out great.   I highly recommend this place for your events or even just to have dinner."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xZmRVaDRlVlpPTUcxU2NWTjZZMU0yUlVWVVgxRRAB",
            "text": "A delightful evening"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcUhyN2ZLbGQyY2lBRRAB",
            "text": "we attended a wedding reception there,the service was wonderful as well as the food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMSHB4T0swcWNMYjhnRRAB",
            "text": "Absolutely the greatest."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOSC0xc0t1bk9tdFZREAE",
            "text": "My white pasta was a little al dente, my kids loved their bolognese pasta which was perfect."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPREQ5cTdsdmQtZGZREAE",
            "text": "We had my daughter’s Sweet 16 upstairs and everything was great!  They did everything we asked and the maitre’d and staff took care of us all night. The food was delicious as always."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NXZPTnNRRRAB",
            "text": "Very nice atmosphere. The staff was wonderful and the food delicious as always. Can't go wrong."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKUDYyWnFub0ltZ1d3EAE",
            "text": "The service was truly outstanding, Bryan was attentive, professional, and made us feel very welcome. Unfortunately, the food fell a bit short. I had the seafood risotto, which lacked flavor."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURteVltQlpnEAE",
            "text": "자리가 너무 빡빡함. 음식은 보통이고 오래 앉아 이야기하기 힘듬. 자리값하라는 듯 다 먹지도 안았는데 재촉하듯 그릇을 치워 기분 안좋음."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNTd2LTV3RRAB",
            "text": "5 Stars!\nThe chicken, was unbelievable delicious, was served with vegetables,they were cooked perfectly.\nThe sauce was soooo flavorful,made of wine.\nTotally  recommend this place for a especial occasion!  And a great selection of music!\nEnjoy it as much aas I did!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUczRXaUJnEAE",
            "text": "Service was polite, attentive and welcoming.  The ambience is special given the high ceilings and spacious dining area.\nMy spinach and cheese ravioli was tasty.  My husband was satisfied with his salmon.\nThe zucchini flower appetizer was different from what my Nay & sister like but they both liked it.\nHowever, my sister was not impressed with the red snapper special.\nWith my Nay’s chosen appetizer for her meal, they did the right thing.  Il Baco is fair.  We just wish that her order was the real thing because it’s her 92nd birthday.\n\nThey have valet parking.  Their rooftop is only for parties."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMOElyeVlnEAE",
            "text": "A nice classy interior with mood lighting to enjoy your meal. The complimentary olives, cheese, bread, and olive oil was a great way to start our meal. The shrimp and scallop incazzato appetizer was delicious but a bit overpriced. The main courses we ordered were the Linguini Vongole and Zuppetta Mediterraneo, both of which were a good portion size for the cost. Overall, a nice restaurant to go back to and try other entrees."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIM2RHRzZBRRAB",
            "text": "Il Bacco is truly a dining gem! I came in for an early dinner around 5 PM, and everything was absolutely perfect— from the food to the service and the welcoming atmosphere.\n\nWe ordered a variety of dishes: Calamari fritte, Bosca pizza, Calabrese pizza, Insalata Caesar, Insalata Tre Colore, Penne vodka, Pollo Gelsomina, Pesto gnocchi, and Mushroom ravioli.\n\nEvery dish was incredibly fresh and bursting with flavor. The calamari was crispy and perfectly seasoned, the pizzas had an excellent balance of toppings with a beautifully baked crust, and the salads were fresh and crisp. The pesto gnocchi and mushroom ravioli were rich, savory, and cooked to perfection. The penne vodka was creamy and delicious, while the pollo Gelsomina was tender and flavorful.\n\nTo top it off, the staff was attentive and friendly, making the entire experience even better. If you're looking for fantastic Italian cuisine, Il Bacco is a must-visit!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4b2FQZW5nRRAB",
            "text": "Had lunch at II Bacco today for the first time. The restaurant is beautiful, the food was solid, and the service was great. We will definitely be back. This is one of the nicer Italian restaurants in Queens."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRNzd1WERnEAE",
            "text": "What a beautiful Italian restaurant where the owner Joe still greet customers coming into the restaurant. The ambiance and the service is phenomenal, I know people that have been going there for over twenty years and I can definitely see why.\n\nEver since I went there they've been in my top 5 Italian restaurants, the shrimp and pasta and the lamb chops being my favorites. I think I eat more appetizers and desert here than any other restaurant, its really an experience eating here. I highly recommend trying this restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNNmFqNmZHbUpPRmtBRRAB",
            "text": "So we haven't dined in the restaurant, but that's now on our list.\n\nWe attended a catered party in the upstairs rooms and everything was great, food, service, atmosphere.\n\nThe whole operation is very nice, the pay rooms up to date and laid out well, with good decor, the restaurant and bar area looked super nice as well.\n\nWould definitely like to try them for a special evening or if in the area!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eFBtSmVnEAE",
            "text": "Strange how tastes and sounds can transport one back decades to their childhood. It feels more like Giuseppe \"Joe\" the owner, is personally welcoming you at his home, albeit one with a magnificent dining room, for dinner. He sits at your table and then you catch up on all that's happened in the world. Pour a good Amarone and savor some excellent Italian food that Nona's prepared lovingly. All is well with the world again after dining here, a true respite from daily nonsense. Did I mention that ALL the food was really, really good too?\nApologies for the poor photos, we were too busy enjoying everything to worry about getting good pix.\nThank you Joe and Dorelle for a great evening!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaVBfWURREAE",
            "text": "Yesterday, I met my long time friend George (Owner of Casserino Photography Studio) for lunch at Il Bacco in Little Neck two blocks from where I grew up … George and I met in 1980 when he moved here from DC … we worked for the same photography studio, Barkley’s in Forrest Hills Gardens … we became fast friends … our friendship & connection has stood the test of time even when it years or decades that we do not see each other face to face … we talk on the phone and that’s been awesome … it was so good to see you George and you look fabulous … for lunch we had Caprese Salad, Baked Clams & specially prepared Pork Chops (I haven’t had one in over 20 years) … the food was outstanding … I met the owner John who was a terrific & hospitable guy … Jennifer who was the Hostess was also fantastic … the bartender & waiter are absolute gems … I also met Brad & Chris at the bar while waiting for George … we talked and I shared my story … Brad bought me a bourbon and we all toasted to life … it was such a beautiful experience … new people and my long time friend … a stupendous lunch … I highly recommend Il Bacco … you will absolutely be satisfied … LIVE LOVE LAUGH & EAT ALWAYS … 💙🇮🇱💙\n\n#CancerFree2024 #EyeOnTheFuture #LiveLoveLaughAlways #CancerWarrior #cancersurvivor #bestfriendsforever #diningout #ItalianRestaurant"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMy0zQ2R3EAE",
            "text": "This is very traditional Italian restaurant. When I entered the restaurant, two men, who seemed like have been working for a long time, welcomed me. The green olive and cheese were served with bread. I chose one of the special menu - Spaghetti with meatball and a Napoli pizza from the regular menu. Meatballs were very tender and tasty and pasta was good. Pizza was slightly salty for my taste because of capers but it was good in general. The price was also very reasonable."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDbkpHSVZREAE",
            "text": "FANTASTIC PLACE!!!!\nI 100% recommend coming here for a date or even a special occasion. Ordered the margaritas pizza pie as an appetizer, then I had the cheese ravioli. Amazing…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdE8tTmFREAE",
            "text": "My favorite restaurant in town. The waiters are always so great. From the olives to the pasta everything tasted fresh and delicious."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaE5LeVBBEAE",
            "text": "We hosted a bridal shower at Il Bacco and it was truly wonderful. The staff made us feel right at home and were incredibly accommodating with everything we asked for. Their warm hospitality made the day feel so special. The food was absolutely delicious—every dish was a hit with our guests. The atmosphere was elegant yet cozy, making it the perfect setting for such a meaningful celebration. Highly recommend Il Bacco for any special event!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDd3FISU53EAE",
            "text": "I am a Brooklyn based wedding photographer and I had the privelidge to photograph a beautiful micro-wedding at their rooftop. The team was very kind and followed all safety protocols wearing masks and being atttentive to the wedding guests.…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzZ0lPX3l3RRAB",
            "text": "The food and service were outstanding. We got the carpaccio de pez, diavola pizza , and the linguini with clams. I recommend all of them. Sebastian was our waiter. He was very friendly and helpful."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0dFpXV3ZnRRAB",
            "text": "Absolutely LOVED everything about this place - and I wound up here by accident! 5 STARS ACROSS THE BOARD - service, food, wine and wait time were all excellent and I would highly recommend this spot in a heartbeat.\n\n-- TLDR --\n\nMy boyfriend and I were searching for a nearby Italian restaurant and walked into here by mistake. The decor was upscale and beautiful, and we both felt under dressed but decided to get a table and checkout the menu anyway.\n\nWe were immediately welcomed in, seated and provided with water, fresh bread, olives and cheese. A wonderful waiter took the time to explain the specials (we got the stuffed mushrooms!) and review the house wines for us once I asked (I didn't want a full bottle). He recommended a Sicilian red wine that paired perfectly with my Rigatoni Bolognese and we sampled it before ordering 2 glasses. My boyfriend got the Ravioli in pink sauce and we ordered cannolis and tartufo for dessert. I attached pictures and was pleasantly surprised by how this dinner turned out. Considering coming back here twice in a week just to try more on the menu!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHaU9fVFR3EAE",
            "text": "Have n't been inside in years but recently I decided to do take out. I used the slice delivery app found on their website and was happy with the delivery time. The food was delicious everything was cooked perfectly. I ordered the friend…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MGRYTHpRRRAB",
            "text": "We visited the restaurant because it was the location of the reception for a wedding we attended. I came into the restaurant with questions about the quality of the food, not only because of the limited menu for the reception, but also because I know true Italian food and am not the greatest fan of Italian American cuisine.\n\nBut I was impressed with the care and attention of the food. Yes, it was Italian American, but leaving that aside, all the food was fresh, excellently cooked to highlight flavor and was provided by an attentive waitstaff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eUxlcnFBRRAB",
            "text": "Pretty good food with a very attentive staff. Parking on the street is difficult but they do have valet parking"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNTRyUG9BRRAB",
            "text": "Very weak. This is not good, authentic Italian cuisine. Baked clams were the most underwhelming I’ve ever had. Tortellini tortufata was overly greasy and sauce was inconsistent. The chocolate mouse cake was all mouse, no cake. Just so awful. Everything sucked.  Just go to your corner pizzeria store, it’ll be better and cheaper."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNjc3cXRRRRAB",
            "text": "We had our precious daughters wedding at\nII Bacco , my daughter and my wonderful son in law were married on the roof top and the atmosphere was the greatest.   We then went down to start the party and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNHFUVm9RRRAB",
            "text": "Amazing service and delicious food!! Atmosphere is top tier."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM0xuY01BEAE",
            "text": "I was at the rooftop for a Bday celebration.all okay\nJust a smell  of gas was very strong at some point. They assured us.It was the heat that it was connected.\nOtherwise this a fine place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdmFPbHlBRRAB",
            "text": "Great place. Very good staff. Makes you feel at home as soon as you get in. Food is outstanding 👌 will return back soon."
        }
    ],
    "reviews_count": 57
}