{
    "name": "Baraki",
    "place_id": "ChIJ34urN3WKwokRtNETlNoOOvU",
    "grid": "QN11",
    "address": "38-29 Bell Blvd, Bayside, NY 11361, USA",
    "rating": 4.6,
    "user_ratings_total": 599,
    "phone_number": "(917) 522-2131",
    "reviews": [
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtcTYzVlBnEAE",
            "text": "Best cocktails in Bayside"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bmVtZENRMWxpYWxGaVVEQnplWGxQYTNGNU5HYxAB",
            "text": "Not Bad, But Definitely need to realize they're in Bayside.\n\nThe place looks great—modern vibe, nice layout, and the drinks are decent. But for what they’re charging, it feels like they’re trying to be a trendy spot from Williamsburg or Midtown, not Bayside. That kind of pricing doesn’t really fit the neighborhood. Also, skip the “Filet Mignon” skewers—over $30 and it’s just regular beef now. Used to be filet, maybe, but not anymore. Overall, it’s okay, just not worth it so many better local spots."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUU4zUlNiM1YzVWtsc2JXSnBjbVJOWDI5MU1XYxAB",
            "text": "One of the best spots on bell. Between the menu options and cocktails it our favorite date night spot.\nOne of the best espresso martinis. Actual real mixologist!\nI crave the whipped feta!\nThe chicken and waffles from brunch are incredible.\nMelissa is so very kind and the owner is super friendly and accommodating.\nCan’t wait to go back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMFdYRlhTRTFSYlMwMmNqWm1Sbk4zTUU5MlVrRRAB",
            "text": "Food was excellent but just want to shout out the kindness of the staff for making my friend and her infant super comfortable and relaxed during our brunch when many other restaurants would act way less welcoming to children"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVVExbE1ZV2d3VlRkVVVGTlRhRTA1Wm5Wd1psRRAB",
            "text": "Appetizers were good. Milk and sugar needs to come with the coffee.\nFood was good. We filled up on the appetizers so they give good portions. The music was lively and good. They need more servers."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMVkzZGxWR0ZZZFRKMVJURjVUakYzTWkxMk1HYxAB",
            "text": "Great brunch experience. The loukaniko sausage egg and cheese was unique and their house made hot sauce is just right to elevate meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQlQzbHJiV3A1VGsxT1dUZHFUSGR1TVhOWlUzYxAB",
            "text": "This is one of our family faves. The food is amazing, the service is beyond that, I would go as far as saying it’s love and family vibes, hugs and dap when we go now. Yup, we frequent.\nWe’ve tried ah lot since first coming here and everything better than the last. The buffalo chicken sliders are amazing, the gyro bao buns are to die for, the feta cheese fries (gasp) cuz I don’t like feta and they are excellent. The Focaccia Burnt grill cheese and the Wings, outstanding!!\nThen you get to the drinks… Each made with love and precision, from my fave the Gold Fashioned to whatever my daughter and wife orders… 😂 Smash it, the Pretty Penny, they had one they used to serve in ah cat mug/glass; all of em excellent from taste to effectiveness.\nLove it here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMlVDMU1OVGx5WDJORk4xVnZObWswV0RsQ05tYxAB",
            "text": "Wowww I just found my new place to eat on bell…\n\nPopcorn shrimp are to die for…..\nGnocchi vodka… wowwww still can’t even explain… they ARE AMAZING!\n\nThe grilled cheese focaccia…. Jezz you’re crazy if don’t try it..\n\nVibes, music and service top tier\nCesar was our waiter 5⭐️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeGJYTTFTMVYyY0ZGdVVuQmhTbUZNUjBGWWMzYxAB",
            "text": "Absolutely delicious food with a talented & friendly bartender in the house making you uniquely hand crafted drinks!\nAn amazing place for me and my kids! So satisfying… will definitely go back again! Highly recommend it !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWmJsOW1lSFI1VjFsdlltRlZSR2RUTlZBelpGRRAB",
            "text": "Food was pretty good. A little pricey but very good for what it’s worth."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SU00zSlNNMTlYTkU5MU5XeFlRemx4V2tkNlJGRRAB",
            "text": "This place lived up to the hype! Everything from the food, service and drinks were excellent. Would definitely come back again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aS01XZHViVWxxUWsxRk5HcFZWRmRqU2tzM2JXYxAB",
            "text": "First time coming in ! Had a great experience with our server Kerri the food was delicious, drinks were good and the ambiance was perfect for a summer day on the patio"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRWRHVmhaazEzUjJaQ1FsWkVhRnBrVTFwRVNIYxAB",
            "text": "The food arrived cold, late and burnt. The waitresses are kind, but the food was not good at all."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLelp3ZEt0N0lyZ2tRRRAB",
            "text": "Such a cute hidden oasis. Was looking for outdoor seating and this populated in my search. The patio is SO cute and gives a reprieve from the hustle of bell blvd.\n\nDrinks are strong but well crafted, and the food is delicious. The bartender was so sweet. I will definitely be sneaking here for some more late afternoon escapes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQk1DMWhiWGhtTTFOTmExWk9NV3N6WDJSR2VrRRAB",
            "text": "I had the absolute pleasure of being served by Melissa at Baraki, and I can confidently say she is one of the best waitresses I’ve ever encountered. From the moment we were seated, Melissa made us feel welcomed and genuinely cared for. Her warm personality, attentive service, and in-depth knowledge of the menu truly elevated our entire dining experience.\n\nShe struck the perfect balance between being present without being intrusive — always anticipating our needs before we even had to ask. Whether it was recommending a cocktail, explaining a dish with enthusiasm, or making sure everything was just right, Melissa handled it all with professionalism, grace, and a smile that never wavered.\n\nIt’s rare to come across someone who takes so much pride in their work and makes every guest feel like a VIP. Baraki is lucky to have her, and we’ll definitely be coming back — not just for the food, but to be in Melissa’s section again. Thank you, Melissa, for making our night so memorable!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLQ3l1dERsNzRIR1R3EAE",
            "text": "nice place to hang, eat, drink and music..food nice.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJckhxTl9DM19HczdBRRAB",
            "text": "Great staff, amazing and very original drinks. Delicious food and very lively environment"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQZXY1OUxOM29EaEdREAE",
            "text": "Everything was amazing (5/5) except the DJ on this Friday night. The drinks, food and bartenders were amazing, especially Mona! The DJ killed the vibe and I would not be back if I saw him on the scene again. If I could I would I rate him negative stars if I could, DO NOT HAVE HIM BACK PLEASE!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLVHBoNERieTdqcTRnRRAB",
            "text": "Was walking to get some ice cream and decided to order the gyro bao buns to go. Best unplanned decision ever!!!! By the way it's Mother's day. Cesar made me thee best French mule and Christina was uber friendly. The owner was very apologetic and accommodating since he thought my order was taking too long. I'll definitely stop by every time I'm on this side of town"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxODhUTWRBEAE",
            "text": "Good food& drinks. Lovely interior."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJN2w3S25INXIyYmpnRRAB",
            "text": "Awesome food- their sliders were delicious, and they have a variety of fun drinks/mocktails. I’d go here for a casual date night with girlfriends, but keep in mind the music can get extremely loud. The last time I went, I left feeling like I strained my vocal cords from speaking so loudly to my friends seated right next to me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvak9POEh3EAE",
            "text": "Pretty place but very limited menu and pretty expensive for what they offer. Probably a better choice for a drink and an appetizer but not the greatest for a dinner. Service was okay at best, the server barely checked in on us. Food was okay, nothing special…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLU1pZU5BEAE",
            "text": "Amazing experience, all the staff was super friendly"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NGFlZm13RRAB",
            "text": "This place is so much fun. The girls amazing not just made great cocktails also good vibes! Love the litchi drink! The fish drink love the mug but it’s not for me.Shrimp  was really good! My friend already said we have to come back here again,next time we gonna bring our class here to get together l."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdjl1cWF3EAE",
            "text": "My favorite was the French toast waffles and spinach dip !! The owner and our waiter were so welcoming and I love the ambiance ! Looking forward to having brunch here again ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRLTdfUW5RRRAB",
            "text": "A Brunch Surprise with Great Vibes\n\nStopped here for a quick brunch and was pleasantly surprised by the decor—it’s a beautifully designed space that instantly sets the mood. The waiter was welcoming and helped us choose dishes that best fit our palates, which made the experience even better.\n\nThe playlist was on point, adding to the laid-back yet elevated vibe. As for the food, the pancakes tasted like home, and I loved that I could add chicken to the order. The Jasmine tea was a standout—the aroma alone was delightful and calming. We also tried the filet mignon skewers, which were flavorful and well-prepared.\n\nWe didn’t try the drinks this time, but the patron next to us couldn’t stop raving about them—so that’s on the list for next time. If you're looking for a chill brunch spot with great food and ambiance, Baraki is definitely worth checking out!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReHF6U09nEAE",
            "text": "Very flavorful and well balanced food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndEtMV0JnEAE",
            "text": "Food is fresh, portion are perfect , cocktail"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndE15eGhBRRAB",
            "text": "Excellent !!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMDVlM0VREAE",
            "text": "Finally a much needed trendy and modern spot in Bayside! Have been several times for brunch and dinner and they never disappoint; great food, perfect portions and amazing authentic cocktails."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeWZldTZRRRAB",
            "text": "For a Saturday evening reservations are recommended. I was running a little late but I still was able to get a seat. It wasn't long after we were seated that the restaurant got busy. We just ordered some small plates to share and that filled us up. I really liked the spinach and artichoke dip. The French onion soup was good as well. The drinks were good, not too strong. The restaurant had a good vibe with good music playing in the background. The staff was pleasant and checked in frequently refilling our waters. Looking forward to going again to try their other dishes."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOGQtZ0F3EAE",
            "text": "Lovely waitstaff, delicious food, casual pleasant atmosphere."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfeTVtdDVnRRAB",
            "text": "I've been here a few times, and my most recent experience was fantastic! I ordered a few rounds of drinks and tried several menu items, including the popcorn shrimp, whipped feta, spinach and artichoke dip, and buffalo sliders. Everything was delicious. The owner was incredibly friendly and even gave us a sample of the grilled cheese, which was a nice touch. Overall, it was a fun and welcoming experience. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdHR5ZDdBRRAB",
            "text": "Best kebaabs."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcE9IdTh3RRAB",
            "text": "The best restaurant on Bell Blvd! The food is so good and the service is excellent!! The owners are so friendly and accommodating. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcElibEVREAE",
            "text": "Great atmosphere. Excelent cocktails and impecabile service. Food is delicious."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdUpuX1BREAE",
            "text": "The staff is so friendly and attentive.\nThe food and cocktails are delicious!\nThey make a tasteful expresso martini :)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMFpxWUZnEAE",
            "text": "Food has no taste and sliders were terrible. Meat had no seasoning and too much onions made burgers soggy and inedible. Fries had 0 salt and also soggy. A total waste of $30 for sliders and fries, a hefty price for such bad food. Never ordering again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cjliZUl3EAE",
            "text": "Buffalo chicken sliders were phenomenal, and the waitstaff were really kind. I will definitely be coming back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2el92WjFnRRAB",
            "text": "My family and I (group of 7) had brunch at Baraki and it was outstanding. The standouts were the whipped feta, burnt grilled cheese, and the filet mignon skewers. Not only was the food incredible, but the service was impeccable. Our wait staff was beyond attentive, patient, and professional. Our waiter, Cesar, was very personable. The restaurant was very aesthetically pleasing as well. We will definitely be back. Grateful to have such a nice spot close to home."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bkpfajJRRRAB",
            "text": "Amazing Greek and American food. Their service was patient and superb. The jasmine tea was amazing and they provide a cute timer for you to see the flower open. The Greek churros were good for dessert and their gnocchi was good but I prefer pesto gnocchi than vodka gnocchi but their mango salad was delicious 😋 the spinach artichoke dip was ok,"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcmY2NVBBEAE",
            "text": "I recently visited Baraki and had an outstanding experience. The food was excellent, especially the burnt grilled cheese. It tasted like it had bacon, but surprisingly, it didn't. The Mediterranean eggs benedict was delicious, and the shakshouka was really good. Loved the food! Omg loved the food so much.\n\nThe beverages were exceptionally well-crafted. Unlike many brunch spots where drinks often taste like hastily mixed alcohol, these cocktails showcased thoughtful composition. We sampled Honey Honey and Don't Forget Your Veggies. Both drinks exhibited wonderfully balanced flavors that perfectly complemented our meal. Honey Honey offered a delicate sweetness reminiscent of honeyed water with a subtle alcoholic warmth, while Don't Forget Your Veggies presented a light, refreshing profile enhanced by Thai basil. It was evident that each drink was carefully designed to be a proper cocktail experience, not just an afterthought to the food menu.\n\nThe service was top-notch. Everyone was friendly, especially Foti, the owner. He made us feel welcome and gave great recommendations. We're excited about their plans to open a jazz spot.\n\nThe value was amazing. The prices were very reasonable for the quality of food and drinks we got. We went for brunch and felt it was excellent value for money.\n\nThank you, Baraki, for a wonderful brunch experience. The burnt grilled cheese was exceptional, and the \"holy water\" shots were a delightful surprise. We're already looking forward to our next visit!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaHRHaDRRRRAB",
            "text": "Manhattan on Bell Blvd. We went there for a late brunch today. The space is chic and modern, in an inviting way. Everyone was super friendly. I got the Honey Honey green cocktail which was delicious. The menu selection was well curated. Everything we ordered was excellent in flavor and execution. I loved my Benedict with the sweet potato home fries. Will definitely be back to check out their dinner service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5aHFuVExREAE",
            "text": "I went to celebrate my birthday with my family and friends and we all couldn't be happier with the food that we order but specially the personalized service. We felt so welcomed and appreciated that even before we were done, we were planning to go back. 1000/10!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwek9DNktBEAE",
            "text": "Attended the VERY CHIC bar, and it was superb. Perfect for date nights or ladies' night out. Or just a chance to relax with a glass of wine. The interior decor is sexy, mod, yet elegant. Their specialty drinks will do you no wrong. (Esppresso martini, anyone?!) Awesome bartender who is professional and friendly! Apps are highly presentational and delicious. Kudos to the chef! Give this spot a chance. You will not regret it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1X3BXeTFnRRAB",
            "text": "Delicious food, had the chicken and waffles and it was the right amount of sweet and spicy!\nThe host was extremely generous and attentive to me and my bf needs.…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbWRHQzBRRRAB",
            "text": "A beautiful new gem 💎  of a place in the area. Great ambience and atmosphere.  The waiter was attentive,  courteous & informative.  Great music playing in the background.\nWas very lucky to have come here during happy hour (blame day light savings). So came here on a Sunday evening.\nThe menu is pretty small,  the place provides brunch & dinner menu with very nice cocktails and drinks.\nThursday,  Friday and Saturday theirs a live dj.  So definitely have to return to experience this.  Love places that provide live music.  On Sunday during brunch there's a dj as well according to our waiter.\nI really enjoyed my sangria and the small bites (whipped feta & Sliders). The whipped feta needs to come with more bread though,  they charged extra for more bread.\n\nUpdate: there is sushi By Bae in this restaurant.  Make sure you make reservation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxN0tlZU5nEAE",
            "text": "My friends and I had dinner at Baraki on Friday night and after reading the wonderful reviews, we were very excited to try this new spot out. The restaurant itself is small but beautiful. After we sat down, the host greeted us and provided us with menus. We were very disappointed to see the limited options of cocktails. However, we all still decided to try out their signature cocktails. We ordered the scuseme while i kiss the sky, not your typical sangria & the clear negroni. The drinks came out in very small glasses and did not taste great, definitely not worth the price. The only drink that was good was the sangria. For appetizers, we ordered the bar pizza, saganaki cigars and focaccia burrata. The appetizers were more of frozen dishes that were heated up. For entrees we ordered the pita tacos, gyro bao bun and gnocci vodka. The gnocci vodka was amazing, the best dish of the night. Stay away from the gyro bao bun, the bao bun was stiff and dry, the lamb was cold. The tacos were also cold. As much as we wanted to love this place, we were really disappointed. The service was great but that was the only highlight of this dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWc2ZEUFh3EAE",
            "text": "This cafe is hiding on Bell Blvd. There are two names on the store, one is Baraki and there is Sushi by bou next to it. We wondered what the restaurant actually serve for so long. Last Sunday we decided to give it a try no matter what. I like the warm atmosphere and green plant wall. It's long and the front part is the cafe. One of the staff welcomed us. We waited for 5-8 minutes for the table.\nWhile waiting, we read the menu and knew what to order. We ordered chicken waffles, cappuccino, a cocktail, chicken Baraki, cyprian bec and panna Cotta. We like them all, especially the chicken Baraki.\nIt's good place for brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWM0syMUhREAE",
            "text": "Came here with my parents for a small bite and some drinks. Our server Michelle was so sweet and attentive. The food was delicious, we ordered the feta dip, the lemon potato croquets and the sliders. Honestly everything was amazing but the star of the show was the feta dip with the cucumbers. Will deff add to my fave local spots."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOaFplbW93RRAB",
            "text": "This is an incredible restaurant - especially for date night! The food is great, the staff is incredible, and the atmosphere is impressive.\n\nWhile we were walking to the restaurant, we ran into this incredibly friendly lady who happened to be the owner's mother - after witnessing how friendly she was, we were even more excited to try this place out.\n\nAlfonso (our waiter/bartender) was incredibly attentive and helped us feel welcome from the moment we stepped in. He suggested drinks, dishes, and even sat down to share his story and motivations with us around the restaurant.\n\nWe got the popcorn shrimp as an appetizer, it was delicious. For entrees, we got the chicken and waffles and chicken baraki - both were amazing. For dessert, we had the greek egg rolls which were amazing.\n\nAs for drinks, if Alfonso is making them, you can't go wrong.\n\nShout out to this incredible restaurant on a crowded street. They stand out, for good reason."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MG9faVlnEAE",
            "text": "We celebrated my uncles birthday there and he loved it. The owner and staff were very generous to us treating us to desserts on the house for no reason!!!! We loved the drinks and drink menu. Loved the filet mignon skewers with chimichurri sauce were amazing. We loved the fried chicken, gnocchi and bacon wrapped shrimp.  We will def come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWOHF2bTBRRRAB",
            "text": "Their food is very simple, just okay. There was a DJ playing music but the music was too loud for the environment. The server was kind and welcoming though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbDZiVXF3RRAB",
            "text": "My experience was amazing ! And Cesar the bartender was fantastic and and so so attentive. Everyone was so friendly and the music was on point and low volume so you could hear each talk. This place is so chill sexy and food is amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIN2QtVXNnRRAB",
            "text": "I've been living in bayside for a while now...I've been to almost every restaurant on Bell blvd. I'm in love with this place! The drinks are delish and beautifully presented. We had a few things but the gyro bao buns were top tier!!! Will Def be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXazR6NHVBRRAB",
            "text": "Food is always tasty here. I had the large Greek salad with chicken and it seemed like it was an endless bowl. Had so much leftovers. Love that the food is fresh and that it’s always consistent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURscTdYNktBEAE",
            "text": "Cesar was an amazing server. The food was magnificent. Mateo was an absolute saint. Took care of us the whole time. Michelle was super sweet and friendly. Ask for them on the weekends. These three will absolutely take care of you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURua3AzRFRREAE",
            "text": "My family came from DC to visit and we had an amazing experience here! The place was clean and asthetically designed. Our food especially the beef sliders and grilled cheese were absolutely fantastic. The cocktails were exceptional and so well crafted. Highly recommend pink penny. Alphonso our server/bartender was so friendly and welcoming the whole time we were there. Will definitely be back!"
        }
    ],
    "reviews_count": 58
}