{
    "name": "Il Toscano",
    "place_id": "ChIJ0TU6fQKKwokR3fMksF0h2kI",
    "grid": "QN11",
    "address": "42-05 235th St, Douglaston, NY 11363, USA",
    "rating": 4.6,
    "user_ratings_total": 448,
    "phone_number": "(718) 631-0300",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wd1JrMXBXazlWVDBSQ1NYcDVRMTlLYVhWemJFRRAB",
            "text": "Amazing food and service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sb05WZzJUbDkzVm5Jd00ydEhSRTB3T0U5ek5WRRAB",
            "text": "Food and service are always amazing. We hosted a rehearsal celebration for 25 people here and everything was perfect. Highly recommend having an event or dinner at Il Toscano."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMU5VOWtWRU5JVlZOM01saE5RMTgwV1U0M2MwRRAB",
            "text": "The best Italian food and such a special restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4M1UycHJiazVXVEVsSmVFSTVWbnBhV1Rkdk9YYxAB",
            "text": "Great food and staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5a2FqTm9XR2h2WlhCdlRYQTRSVlV0VUdSTFpsRRAB",
            "text": "Excellent Italian restaurant. As I'm from Istria, I think I can say that. My relatives live in the neighborhood and they love it too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSeGRHTmlVV2N6T1VGYVpUZ3hSSGRQV214bWJtYxAB",
            "text": "Amazing x 10.   Had a double bday.  Sat upstairs in the back semi private room.\nFood spot on as always.\nDef recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTlpHbGpXbXh6VUZBME1WRjNhRkU1Y0daTVZHYxAB",
            "text": "Been going to this fabulous restaurant for many years. The food is exquisite. The service is amazing. Their Napoleon Cake is like no other! I go in to pick up my order in the afternoon and the owner, Alex is sorting through the freshest and finest ingredients for his dinners that night which he hand selected himself at Arthur Avenue. Alex truly puts his heart and soul into Il Toscano and every dish he serves. Do not miss out on a superb dining experience at this restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeVkxZDRWak5WWVRoSE9EVkdXa1JMTm01WVJGRRAB",
            "text": "little cramped but good food. lychee martini was strong. appetizers and mains were great."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcTh2WjB3RRAB",
            "text": "We came here about 9 months ago with my husband and son (we have been here before but before the pandemic and with everything being closed obviously could not come during that horrible time and also for a private party many years ago too) and the food was outstanding. Gourmet homemade Italian food and homemade pasta, ravioli and lasagna nothing boxed.  Also, deserts are homemade and fresh as well. Superb service.\n\nSuch a gorgeous rustic Tuscan decor and very cozy too. A must try, you won't be disappointed. We'll be back again for sure.\n\nPS-We have been back and brought my mother recently for Mother's Day and my Birthday May 2025 along with my brother and they also are in love with the food.\n\nFather's Day my elderly mother went again with my brother, his kids who were also amazed.  My other nephew just brought my mother a week after Father's Day with his family also and they all loved the gourmet food; they could not have raved enough about the food and service. Il Toscano has gained not only us as customers but several of my family members with their family as well who are raving about the food, ambiance. decor and service.\n\nI can't say enough great things about Il Toscano, the owner, hostess and waiters. So personable, happy and delightful. Just fabulous restaurant all around."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKM1JpMHljekJGTWxveWRWcDVTbkZaWW1SVE1tYxAB",
            "text": "Such a pleasant evening.  Good food good service\nWill be back and we live in Suffolk county"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOX3lscTdibU9PVnpnRRAB",
            "text": "This is not your typical Italian restaurant from Italy. There's no primi or secondi separation in the menu. The menu has some typical Italian dishes, but 1/2 it is a mixture of fowls & fish. The music they played is mostly Gypsy Kings & perhaps 1 Italian song, whilst we were there. The inside of the place looks like a typical Tudor interior, nicely decorated. Nevertheless, the food is very good. My wife & I were there to celebrate our anniversary. We shared everything from salad (has manchego [too white to be more than 3 months aged], avocado,  baby spinach, red onion), lobster bisque (not as creamy as other places, however, what they have works well too), quails (deboned) stuffed with spinach, striper with asparagus (the tomato chutney was a great addition), peach cobbler topped with chocolate chip ice cream (we had better in Chattanooga, the streusel has granola, which is a pleasant surprise). I wished we've chosen the coconut panna cotta. Both the mains were cooked just right, not overdone. My wife had a cappuccino, which was not too fancy. It just has foam & a dust of cinnamon. Just like the pan gratis, the 3 or 4 varieties weren't even heated. We like our breads heated. We've also shared a raspberry limoncello martini. I'm not sure what to make of it, but it's not bad either."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ2NzSS1YaHB2a21RRRAB",
            "text": "The restaurant is much bigger than it seems when you just walk in. The service was great and the food was great.\nThere is free parking in the parking lot across for the restaurant once your ticket is validated at the restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLMzVuOVAyLTR6YTJ3RRAB",
            "text": "Great “old school” Italian at its best. It’s cozy and inviting. Friendly staff and a menu full of favorites."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMampqZHk4ajlqSWxBRRAB",
            "text": "Have been coming here for ages and we are impressed every single time"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdk52R0NBEAE",
            "text": "Amazing service and food !!!\nA must visit!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa3ZuWjJnRRAB",
            "text": "Some of the best italian food in NY, even if Stef doesn't think so..."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMXVHTlBnEAE",
            "text": "I have been to Il toscano several times and was very happy with the food, service and atmosphere.  I suggested Il Toscano to my two friends as a great restaurant to meet to celebrate our birthdays.  They stuck us in an alcove room attached to the main room which was cold and not very nice. We all ordered Cesar salad which was pretty good. They ordered the shrimp and said it was delicious. I ordered Lasagna and should have sent it back but HATE having to wait for them to remake the dish while my friends are eating their dinner. The dish was MUSHY and hard to tell it was Lasagna that should be firm and able to slice."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJb3JULXVRRRAB",
            "text": "I’ve been to many Italian restaurants but il toscano restaurant by far one of the best experiences I’ve had steak done to perfection homemade pasta definitely recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJZ3JhTm5nRRAB",
            "text": "My partner and I visited this past weekend and I have to say that the food, service and atmosphere were fantastic and all at a great price."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dTlLRXl3RRAB",
            "text": "The food was great.  But the waiter who took care of us on the second floor was unprofessional, which might cause us to not hold programs there"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3M0tHVGRREAE",
            "text": "Everything was delicious I can’t wait to return."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3N3BTOU5nEAE",
            "text": "Food and service   good, my 3rd time having dinner there. All of the previous times, plus this time, all food and service was good . From the lobster bisque soup to the lobster special, they have . Eggplant Parmesan is very good . The decor is a nice mixture of paintings plus pictures of places in Italy plus pictures of Italian people well know and not so well known Italian people"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdGFySWpRRRAB",
            "text": "Our waitress was great. Very friendly and attentive. Lasagna was excellent. Old school atmosphere which I love."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5a3VhYWFREAE",
            "text": "Just ehhh at best. Soup tasted old mozzarella was stale. Just sub par"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBb18tQjFBRRAB",
            "text": "celebrated my birthday here. enjoyed some of the most delicious dishes. Waitress was experienced and efficient."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMWEzaGhnRRAB",
            "text": "We’ve been living in northern Queens for over 30 years, and by far Il Toscano  by far is the best Italian restaurant in the area.  We’ve held several events there for our family and everyone was always satisfied.   Service is excellent, and it’s a very warm and friendly environment."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNnE2OUpBEAE",
            "text": "Return to this restaurant after almost 20 years. Still a warm and inviting atmosphere with service that is just perfect some of the most amazing pastas you will ever find and daily specials from meat to fish that are absolutely stunning"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cGZ1ZVdREAE",
            "text": "Great food"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNEpmWE5BEAE",
            "text": "First time dining here! Overall, the food was quite good, but the service could use some improvement to match the quality of the cuisine.\n\nWe started with the burrata with tomato, which was a special for the day. The fresh, creamy burrata paired perfectly with the tomatoes, making for a delightful appetizer.\n\nFor our main courses, we ordered the vongole pasta and the black fettuccine, another special. I wouldn't say they are the best pasta I've ever had, but they were still pretty good.\n\nHowever, the service left something to be desired. Upon arrival, we were not immediately offered menus and had to ask a busser for them instead of our server, which delayed our ordering. Additionally, as we were leaving, the host did not acknowledge us, even though she was not occupied with other guests at the time."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NkktaUl3EAE",
            "text": "Great food, service and atmosphere"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbEphSzRnRRAB",
            "text": "The food here is very hit or miss and very overpriced for the quality of dishes served.  We recently went for dinner and ordered several dishes to share.  Salad course was underwhelming and clearly not made at time of order (ice cold plate) and greens not fresh at all.  Reminded me of some store bought bagged salad mix.  Lasagna (signature dish) was clearly reheated in a microwave prior to service as outside was still lukewarm and interior was steaming hot.  Pasta was rather gluey in texture.\n\nFor the prices of the dishes being offered, I would expect a much higher level of quality for the finished product being delivered to the diners."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYODg2R21RRRAB",
            "text": "Rating this a 3 star bc maybe it was a one off, sat  down at the bar to have a drink while I waited for my Uber. A group sits near me, at the same time. He pours them wine, then reads them specials for food without even asking me about a drink or acknowledging me — pretty rude service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbDhuMFlBEAE",
            "text": "There are not many traditional authentic Italian restaurants left that pride themselves on both service and quality! Delicious and glad to see so many passionate staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeTRmMjFRRRAB",
            "text": "Amazing!  First, there was free valet parking which is a necessity in this area.  Second, we dined in a room that was quiet enough to carry on a conversation even though the room was crowded.  No background music to add to noise was a plus. We have not been to a restaurant this quite in any of the cities we have travelled in YEARS!! The appetizers and dinners were wonderful and compared favorably to a well known restaurant in NYC that we had dined in the previous week.  The wait staff was attentive although the kitchen was a little slow.  The only minus was that I had arranged for a birthday surprise (not sure what that was but you could request it when you made reservations) and was even reminded by the owner and staff when we arrived that it would forthcoming.  It never appeared."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCenNUQk9BEAE",
            "text": "Their special lobster dish is wonderful.  All the food is very good. Northern Italian. A real treat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURId1lqSTF3RRAB",
            "text": "Great food best lobster ever!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOV9UZkJnEAE",
            "text": "First time there ....food was delicious.  Will return"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMU5qek5nEAE",
            "text": "Overdue review. We came here in January and the weather was pretty cold that evening. The restaurant has a perfect location, next to the LIRR Douglaston's station for those who plan to come by train and they offer a parking space and valet service for those who drive.\n\nWe had a nice section in a small room just for the four of us. We had privacy but the table outside had an engagement party so they were pretty loud. Hubby's friend and his wife came to the restaurant many times. They recommended Lobster dinner.\n\nOur waiter, Miller, was a good waiter, knowledgeable and attentive. So both Hubby and I ordered the lobster. However, before the entree, we ordered two appetizers: asparagus mushroom and broccoli rabe. Both appetizers were nice but I didn’t think broccoli rabe was that great, it was ok. However, the lobster asparagus, and mushroom were very good. The lobster dish was tasty. Our friends had crusted shrimp. That looked pretty good. After the meal, we had desserts because we were worth it ha!\n\nThe manager came up to us to ensure a great service. Even the people from the party came up to us to apologize for the noise but that’s ok, the couple is getting married so we forgave them lol. Nice food and experience. Great service from the team. Thanks!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybkxXV3VRRRAB",
            "text": "I came here recently for Mother's Day and was greeted with a warm hello from the owner. Il Toscano provides that warm, cozy feel which added to our superb dining experience.\n\nSince it was Mother's Day, we were provided with a special menu. Normally I'm not a fan of holiday-centric menus, but this one provided plenty of variety.\n\nEvery dish was delicious so I'll definitely come back another time to try their full menu. Great job, guys!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaTh5U01BEAE",
            "text": "I came here for my friends 50th bday wanted to make it special for her, but unfortunately it wasn't as expected.  We read all the amazing reviews how great the food and service were but perhaps not for us, 2 Asian women. Our waiter was friendly but not polite. I made reservations online at opentable, and then they sat us down in a corner part of the restaurant by an up stairs view, we literally waited awhile for anyone to come up and greet us and when we asked for the menu, he told us to wait even more for it. We prob just sat there without a menu for over 30 minutes right when we got to the restaurant. It was just an unpleasant experience for us right at the start. Then, when he finally came by with the menu, we had to wait a while before he even returned to our table to take our order. There's no bell like some of the up to date restaurants. The restaurant is completely out of date, small space, and the tables are literally right next to each other. There is no space to walk around even.\n\nWell, when the waiter returned, we ordered lobster bisque soup, toscano salad, lasagna bolognase, and clam linguine. I have to say the only food that tasted good was the soup and salad. The lasagna looked and tasted horrible. It literally was all mushy, and just something about it did not taste good to me or my friend after she took a bite of it. We immediately let our waiter know this, and luckily, they did not charge us, but you need to let them know if something does not taste right. The clam linguini my friend ordered was completely covered in salt. We didn't return it, but we also didn't eat it either. The clams were not even washed it had sand and broken clam shells inside. Well, that was our experience. When I made the reservation, I specifically wrote it was for my friend's birthday, they didn't even offer a cake for her... I've been to amazing restaurants that provide a cake and song. This restaurant does not provide any special treatment for birthdays. I would not recommend this restaurant for a special occasion."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCek9xXzNnRRAB",
            "text": "The food is fabulous!!!! The lobster is my absolute favorite along with the Caesar salad and their homemade Napoleon. I just love this restaurant so much!!!! Lisa, our server is amazing and so professional!!!! I highly recommend!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdzVlamFnEAE",
            "text": "Local neighborhood gem. Everyone knows this place and the food is just quality eats. Wait staff is very hospitable and so is the cozy seating. Next to the Douglaston LIRR station, you can't miss it. Excellent food, run to get the foie gras while you still can. And try the lasagna, it's really a great dish."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPNHVmRmFREAE",
            "text": "We started with a lasagna “for the table”, because why wouldn’t we?  It is a very good, classic cheesy and saucy lasagna.  The perfect start to a “light” meal. We also had the Spedini special which they describe as an Italian grilled cheese with pears. It was really good, and far better than it sounds. The pear provides just the right amount of sweetness. For dinner, I had the lobster special, which is essentially lobster over linguini. It is so good, I get it every time I go. It’s even better now that I discovered they will take the lobster out of the shell so there is nothing to slow me down. We also had the Semolina Crusted Jumbo Shrimp. They were very tasty. Great flavor and just the right amount of crust. Finally, for dessert, a tartufo and napoleon were the perfect finishing touches. A delicious classic Italian meal. I highly recommend Il Toscano."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaFBYTkpnEAE",
            "text": "I can't say enough good things about this restaurant. From the food to the service, everything is exceptional."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMzRXVVV3EAE",
            "text": "Perfect old fashioned cocktail,  food is phenomenal excellent,  good time here will definitely be back"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNXIyVWlBRRAB",
            "text": "One of the best Italian restaurants in Queens! Amazing service. I also had the best pasta primavera ever! I'm vegan and my family loves Italian food so I've tried a lot of primaveras. It was the homemade pasta, along with the veggies that…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcF9tbDZBRRAB",
            "text": "Great meal last night. Top service. Great food. Fish, chicken, beet salads, Caesar salad. Never disappointed. Love the vibe"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NGE2a0VnEAE",
            "text": "Little pricey but love it. I arranged dinner for my family reunion and everyone enjoyed it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z2JfQjF3RRAB",
            "text": "Amazing food and great atmosphere. Would definitely come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCLTRUU0JREAE",
            "text": "Great service, delicious food. Can’t complain about anything there."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaGVTWFZ3EAE",
            "text": "The food is so fresh and delicious! I couldn’t wait to dive in!! Napolitano dessert is a must!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNb2NmSDR3RRAB",
            "text": "A real nice quaint place to catch a bite. Valet parking .. Very old school, some good food, service and the prices very fair.. Mangia!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaUxTazV3RRAB",
            "text": "Alessandro and his wonderful team made us feel like special guests from the time we arrived until we left.  They gave helpful and detailed descriptions of the menu items and specials. The advice on dishes when ordering and while eating added to feeling that the staff was there to ensure we made the most of our dinner. The food was immensely flavorful and the dishes beautifully presented. The level of attentiveness to every detail is unparalleled. Highly recommend everything but if they have the Swordfish special get it and of course save room for the Napoleon!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNF9lR2dBRRAB",
            "text": "AMAZING MEAL! Octopus was tender and delicious 🐙"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdWN5ZHZRRRAB",
            "text": "Visited on a Saturday night with roughly half capacity on the outside patio. The food was overpriced and honestly underwhelming. But that was passable until the working manager outside lashed out on the live performer they hired to perform. It was one of the most unprofessional and rude displays of misdirected frustration that I have ever seen. I would never return to an establishment that tolerates this level of mistreatment displayed towards hired workers. 0 stars. Do not recommend."
        }
    ],
    "reviews_count": 55
}