{
    "name": "Taverna Kyclades Bayside",
    "place_id": "ChIJuzR0VnWKwokRqz0Fx66UosM",
    "grid": "QN11",
    "address": "39-28 Bell Blvd, Bayside, NY 11361, USA",
    "rating": 4.6,
    "user_ratings_total": 1523,
    "phone_number": "(718) 631-2000",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeFFuWkdhbVJXTm5SRmNXYzBhRE13Tm0xS1MyYxAB",
            "text": "Taverna Kyclades – Bayside\nTaverna Kyclades in Bayside is a well-known Greek restaurant celebrated for its fresh seafood and authentic Greek cuisine. The menu features generous portions of grilled fish, calamari, shrimp, and classic dishes like moussaka and saganaki. Flavors are vibrant, with a focus on quality ingredients and traditional preparation. The ambiance is casual and lively, perfect for family dinners or group gatherings. Service is usually attentive, though it can get busy during peak hours. Prices are moderate, reflecting the quality and portion sizes. Overall, it’s a reliable choice for anyone craving authentic Greek seafood in a welcoming, bustling setting."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWc1lubzJTM1UwY1ZCeFRGUnZZekk1TjJneWNWRRAB",
            "text": "Absolutely amazing food and service.   The staff was very welcoming."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTVlVRmtkM2R4UTNaR01GUjBaRk53ZWpWeFFuYxAB",
            "text": "I usually go to the Astoria location, but this one is nice too, and the quality is just as good. It’s also quite busy, just like the other spot, so be prepared to wait for a table, especially on weekends."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204d00yY3pRazk0TWw5aGJqaEpTa1Z2TmtoTlMzYxAB",
            "text": "We had a great date and food was delicious!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSWFrbzNkR0ZaUWxSWGFYVkZlRUUwUmxOS1NuYxAB",
            "text": "I’ve been eating at Taverna Kyclades since the original Astoria location opened years ago and honestly, that first spot will always be unmatched. The energy, the noise, the constant rush of people waiting outside with a bottle of wine in hand it had this authentic, electric Greek charm that just can’t be recreated. I miss that place.\n\nThis newer location still serves solid food, generous portions, and good wine. The grilled octopus, saganaki, and fried zucchini are as fresh and flavorful as ever, and the seafood quality continues to hold up. The kitchen clearly still has pride in what they put out.\n\nThat said, the atmosphere feels more subdued and the service a little less personal. I dined alone this time and, to be honest, felt a bit invisible with no warmth or acknowledgment until I had to flag someone down. I wasn’t that hungry, so I just ordered four appetizers and a few glasses of wine, which were great, but the experience lacked that spark the original spot had.\n\nStill, it’s Taverna Kyclades and even when it’s not the same, it’s still better than most. I’ll probably go back, but I’ll always miss the old Astoria magic."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXb3FXSHpBRRAB",
            "text": "Always a good meal. Consistency is amazing."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVlUyUnhOV2xNUnpaSk5HUkNibU5hUzNZdFRtYxAB",
            "text": "Very nice view and ambient"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMVJuSk9ZbVZxTjJOSE9ESjBSMDFGY1Zwa1VVRRAB",
            "text": "The Food is Fantastic everything on the meun is outstanding everything is fresh and full of flavor abousetly delicious!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKYWJWOVhNV1ozZFhoTU1EQnZOSFpLT0ZVNWJWRRAB",
            "text": "Deliciuous got the grilled octopus and snapper. My only complaint is that they pack that place like sardines and is alittle to close to other people for comfort"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUlNtNXpWa3BXZUd4blRUYzBXbEpUWmxKMlNIYxAB",
            "text": "We were at Taverna Kyclades Bayside for a birthday dinner. Everything thing was just perfect the waitress, food and service, especially the waitress she was just exceptional. I would recommend this to everyone."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjeE1USlpaV1J6ZDBoWmFqVmxRV2xRUTNCcmRVRRAB",
            "text": "Great food, great service. One of my favorite restaurants in the neighborhood!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZdFJ6RjRXRTU1WkhaS1dUQlVUMWhtVjNkcVRIYxAB",
            "text": "I've been wanting to try this place but its always so crowded but I was in the area last Saturday and they had room. I was very disappointed with the food. I sared the grilled seafood platter. It lacked salt but had a wierd flavor in the seasoning.  I mean usually greek places do simple olive oil and salt.Not sure what the res stuff was in their seasoning but was so bland. The only well seasoned item was the lemon potatoes.  The side of Swiss char was also saltless and blan. I will not return here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcmIyaFFia3R0YkhBNVltcEJjMFp3U1RkRVkyYxAB",
            "text": "I’ve been to this location and their Astoria spot multiple times. Consistently outstanding authentic Greek food just like I’ve had in Mykonos, Milos, and Santorini. Oysters, octopus, chicken kebabs, muscles, olive dip, all excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeFdVcFRRV2RJTjFvd05YcFJRbXhKV0VFd1RYYxAB",
            "text": "The swordfish was so delicious and the portions are humongous. We also got half a dozen of oysters that were so sweet and went so well with the sauces they provide. We had so much food to bring home, and on top of that they gave us free dessert!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVlV6bENRM2RPUjFOQlNWOUZkbGxWTTFJM1VXYxAB",
            "text": "Everything thing was absolutely delicious,  limited cocktail options, though.  Will definitely go back to try other stuff on the menu.\nLoved the complimentary dessert."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNGFYTTBObUpNTTFGNmVVUXpSWEZ3YjBac1VsRRAB",
            "text": "Awesome all around, went there for my birthday dinner & have been a client for years, they always deliver the best food & service"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVdS02ajBRRRAB",
            "text": "Food qualities are getting bad"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sbk5sWjZUWGRmZEVONFIzZzFSalJmZURWbFRFRRAB",
            "text": "Seafood special had zero taste\n, DO NOT ORDER THE $50 STEAK.  Its super thin and not cooked right."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMU5XWlpUbnBUVFRkNk5YRjRWRzF0VDB0dk1HYxAB",
            "text": "Always fresh, great seafood at reasonable prices. Stick to the simple grilled selections and you will be coming back time after time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZM1dFTnZjSEJEUTFJNWR6VnZZbFV3ZWxaUFEwRRAB",
            "text": "Amazing food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTlNITlJjRTVtTkdkWlNXMVRUWEJ3VFhOb1ZrRRAB",
            "text": "Much better food & great value"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVVJHRTRibXhaWjNSeFIxVnJTRlo2V0VGNGNtYxAB",
            "text": "Such a shame. I used to religiously go to this restaurant as I LOVED it, but don’t go anymore. I’ll take my business to the Astoria location, much better there. WAITERS are UNPLEASANT. Service is horrible. Everyone makes a face when you ask for something. My last visit we came for a birthday we were about 10 people. Food came out COLD. What I wanted was sold out (this happened the last two times I was there. Extremely frustrating because I go there specifically for that) Waited over 10 minutes for a Coke- and quantity of food is not what it used to be."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabGRrSmlWemN4TUV0V2NWcFZla2RMTFhSNWVHYxAB",
            "text": "Great food, great service.\n\nEveryone was very attentive. The only thing I didnt like was the rice and potatoes. It was a bit too lemony for me."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcFgyUTFkbU5mVHpGQ09WZHNWakYyVURWaFIwRRAB",
            "text": "Seafood heaven even Poseidon would relish — a delightful experience from start to finish! Crispy zucchini/eggplant fries, and perfectly cooked anchovies, grilled octopus, swordfish, lamb chops, and spanakopita for our party. Service was impeccable and didn’t feel rushed, and the atmosphere was lively and fun. Only misery was finding parking in the area… but this place is worth the circling. Can’t wait to go back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCT1YzZHhTSEZ4ZUdWZlNFOUxTRkJPZDIxUFFYYxAB",
            "text": "Got food to go. I've only been to the Astoria location. Both were good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214V2NqWlpZalpCYzNWdFVHWkZWMkZ6UVdJNFNYYxAB",
            "text": "Great food great location great service and free dessert!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWGNuSjJjSGhGTkZSTWR6RTFVMVIyTFZSZldYYxAB",
            "text": "Very well ran place. Clean and fast."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdk0xSnlkakZ6Ulc1aGIwUXpORTlqZGpsdGFtYxAB",
            "text": "Too expensive!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacVZrbFJVRFphYVVsdmVtbzRUa0ZWUVZobk5tYxAB",
            "text": "We were really looking forward to our dinner, but unfortunately, the Service completely RUINED the experience. Our server was inattentive and seemed uninterested from the start. It took far too long to get his attention and we had to flag him down just to place our order.\nWe felt like we were a burden rather than guests. It’s disappointing to spend time and money out for a nice meal only to leave feeling ignored and frustrated.\nWe won’t be returning based on this NEGATIVE experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeWNIWk5iRzh0VUd0NFZ6RklSRzFHVUZKM1RuYxAB",
            "text": "You never go wrong with Kyclades! Every time I’ve tried something new it has been a hit! Love the seafood pasta, the pikilia, and the Greek salad it’s huge. Service it’s always attentive and quick and the restaurant it’s also kids friendly with a good menu for them 😄"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDaDhiUFdREAE",
            "text": "Had greek salad and shared a huge branzino.  Very good. Wish they served coffee and tea.  Very expensive!  $95 for the branzino!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWlpXZElNa0pmT0dGVFRDMDRYME53WDNGd2VsRRAB",
            "text": "the food was excellent, the reception service I received was terrible.  I left my sunglasses at the restaurant and called within an hour to inquire if they had been found. The lady who answered the phone immediately stated, \"nothing found.\" When I asked if she could check with the server, she put me on hold for only a few seconds before returning with the same response. I am very disappointed with the receptionist's attitude and the lack of effort to genuinely check for guest lost item."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTmNUUXdNV0ZQYldWM04xSmxiVGg1YTFjMlpWRRAB",
            "text": "Our fav Greek restaurant. Staff and owner are very friendly always makes us feel part of the family"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVWFFMHlUQzFIZGxGb1RUQklTR2hIYjBjMVNtYxAB",
            "text": "Good experience here for the most part. Fish was good and so were the appetizers."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMFpsWXRURzlmZVVWb1FUaExOak5KVjFGa1kxRRAB",
            "text": "10/10 Had a girl's lunch here and everything was delicious. Will definitely return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMlNuSkhlbWxIU1RCcmNpMHRkVkpFWDNOVVMxRRAB",
            "text": "Great spot.\nI’d sit at the bar and let Angel take your order.\nAwesome bartender.\nFish was fresh and the vibe was great"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwM1pFZHZWVFkxV0ZKUU9GUmxSbGhJZDBocVdHYxAB",
            "text": "Very authentic Greek place"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NzVQTTZ3RRAB",
            "text": "너무 맛있는 레스토랑입니다. 처음가본곳이지만 앞으로 자주 갈 것입니다^.^ 서브해준 분도 너무 친절했어요."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxck1UdlBBEAE",
            "text": "건강한 맛..\n해산물요리는 최고~"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSb1ZsSk1NbkpsWldVd1VXZDFTVk5aU1ZCSllWRRAB",
            "text": "Excellent food . I loved the Swordfish souvlaki and seafood pasta … . Only issue is it’s congested ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOE9LMVF3EAE",
            "text": "A wonderful venue serving up fresh seafood off the grill. The grilled octopus is definitely the highlight 🥇🥇.\n\nLet’s not forget the Spanaki & the branzino. 👍👍 Kyclades never disappoints. Nice vibes but hard to live up to the expectations of the Astoria venue.\n\nNonetheless, we are very pleased to dine here for a group of 7. The seating was a bit tight. I had to sit on the aisle & kept getting bumped as someone walked past.\n\nWill definitely return…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OE4tbTJRRRAB",
            "text": "We stopped by for dinner. The food was good, and the service was okay. We ordered the Grilled Octopus and the \"Kyclades\" special for two. The bread they served as a \"free\" item was stale. The Grilled Octopus was great! The \"Kyclades\" special was definitely a great choice, but I can't ignore the fact that they douse it in butter. The same thing goes for the baked potato—way too much butter. If you have to add that much butter to your dish for people to enjoy it, you're not doing it right.\n\nThe servers were a bit odd, and I do mean more than one. We initially ordered the appetizer and drinks and asked for a couple of minutes to decide on the main course. A different server stopped by a minute later to ask if we were ready to order, so that was a bit off-putting. Maybe they were trying too hard... I don't know. The store manager was nice. He came by our table, introduced himself, and we had a pleasant chat about the food and the dessert drink he offered at no additional cost.\n\nOverall, a good choice. We may try their Astoria location next time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidm91dzF3RRAB",
            "text": "Just had dinner with my family and the food was incredible! The service was outstanding and our waitress Marina was fantastic. The chef made it a point to visit each table to greet everyone see how everyone was doing (and it was so busy yet he still took the time to do so ) the ambience was modern yet classic. It was a Monday night and it was absolutely packed yet you still felt like the staff was incredibly attentive to all patrons\nI will be back for sure, and I must say this is now become one of my favorite restaurants. The food was outstanding. Even my two picky children left happy and full"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdjhDa2hBRRAB",
            "text": "This is my favorite restaurant to go whenever I am hunger for Greek food. They have PIKILIA, my favorite Greek appetizer, assortment of 4 dips you can enjoy with pita breads. Not to mention authentic Greek salads just like the way I had it in Greece myself. Their 'Grilled Octopus' and 'Seafood Pasta' and 'Britzola, the Rib-Eye Steak' were also very good.\nAt the end of our dinner, they served us with free Galaktoboureko, a traditional sweet that was also delicious.\n\nI strongly recommend this place who wants to go to a \"good\" Greek restaurant!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKMmxsc1hYb1lyY1l3EAE",
            "text": "The fish is fresh and I love the texture of the fish. Those grilled seafood are excellent for the appetizer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMkxtVmFBEAE",
            "text": "Best seafood restaurant in New York City and is on par with seafood I have eaten in Greece. The Chef is amazing and takes time out of his busy schedule to visit all of the diners to make sure they are having a great experience. Bayside is…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaGFhOXpnRRAB",
            "text": "Best of everything! Swordfish with lemon potato my favorite the best I ever had!!\nOctopus stuffed clams calamari wow Santorini cocktail must try . It’s one of the top place to eat in Bayside! I can mark and recommend the whole menu,step by step!\nService professional atmosphere I love it!\nIt was a best choice to eat the last day of the year! Thank you! Happy New Year!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeFA3dExREAE",
            "text": "The food here is very fresh and gorgeous,the portion is also amazing,I think I’d like to visit many time,as my favorite restaurant in bayside 🥰\n🤍Grill sea bass is delicious,with the lemon juice and olive oil, really good!\n💙Shrimpsantoniri with tomato sauce and cheese ~ amazing\nBy the way, the dessert is the my favorite part in the meal!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPYnZydHY1OEt1aTN3RRAB",
            "text": "The bell blvd place was a good restaurant at one time, say maybe 5 years ago. Purple tarama, have not seen that since the 80s on the Greek islands where the food they served then would be insulting to any Greek. And the Greek potatoes, really trying to keep margins$ up there. In Astoria they would chop the salad if you asked but in bayside they could not be bothered. Really, how long does it take to chop tomatoes, feta and cukes.\nI think the great ratings they keep getting is either paid for or the people reviewing never had a real Greek meal. Hands down bukhari, tellys Gregory’s and loukoumi still the best in queens."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bDRqRzFnRRAB",
            "text": "Ambiance, service and food were perfect. Grilled octopus which was good but I wouldn’t get it again.\nHad the pita with assorted spreads, always necessary. And the mussels… the mussels were to die for. The red sauce and feta mixture was something I’ve never had before and I would 1000% come back just for the mussels alone.\n\nHouse Chardonnay was very good.\nPerfect date night spot as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIM2JfQ2pnRRAB",
            "text": "Lots of space inside with a lively vibe and tasteful decor.\n\nWe were greeted and seated at a quiet corner, and were right away waited on.\nGlasses were filled, and a basket of olive bread, drizzled with oilive oil, served with olive tapenade materialized.  It was fantastic, and I sensed it was a harbinger of what was in store.\n\nWe were advised that the kitchen was busy and made aware of what selections might take a bit longer.\n\nAll that was unnecessary however, and while the octopus, greek salad, and dip selection kept us occupied, the entrees came out perfectly timed.\n\nEverything was very well prepared, and my steak was a perfect medium rare.  The whole branzino was nicely prepped, and the bones came off easily.\n\nOh yea, we were too full to get any dessert, but they came around with galaktoboureko and it was the perfect closer to a fantastic meal.\n\nThis will be on our short list of go-to restaurants when close to the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc2FLTVZREAE",
            "text": "This is one place I always look forward to. Delicious food and large portions is a bonus. I almost always forget to take a picture of the food when I come here. Food is always fresh and service is very good as well. I can’t wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINWRUTHlnRRAB",
            "text": "Went here with my coworkers, and at first the hostess led us to a table, but she must’ve mistaken us for another party because there was another one there. It’s fine, we didn’t have a reservation so we didn’t really expect them to fit a bigger party so quickly. We were about to leave, but then the manager saw us standing outside, figuring out where to go. He offered that he could help us get a table for our group. We were sat down in five minutes. The atmosphere is in general nice, though  despite it looking spacious, it did feel a little tight. The food and staff was great, and my coworkers and I had a good time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZ3ZtdDdBRRAB",
            "text": "An excellent experience! I went during lunch service, and enjoyed. My only gripe was lack of seasoning on the fish. However, the fish was fresh, and cooked perfectly. A little salt, a little seasoning,  and the food would be 5 stars. They did not offer salt & pepper with the meal, so it was a tad bland for me. But... The fish was totally fresh and cooked to perfection. I'll go back and see if this was a one time issue."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsdjlmdXl3RRAB",
            "text": "Yummy! I love it here. Very pretty restaurant.  Their grilled octopus is so good. Portions are actually really decent. I've eaten here a few times, and there is a nice wide variety of dishes. They have a bottle of white wine that is delish. I'll continue eating here. It never disappoints."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNna1pETENnEAE",
            "text": "Absolutely fantastic meal at Taverna Kyclades (Bayside)! The fish was cooked to perfection, with a beautiful crust and tender inside. The salad was fresh and vibra\nnt, and the bread with olive paste was a delightful starter. Every single element of the dish was delicious, and I would definitely return for another wonderful dining experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCc09tcVJBEAE",
            "text": "Great restaurant with staff. It was easy to tell how friendly and customer oriented the staff was from when my group first arrived, all the way to our departure. Our party of 8 had gone inside and was told we could wait 30 minutes for a spot to open up, or split into two groups and sit seperated in different areas of the restaurant. I'm really appreciative of the hostess at the front, who had brought up this option of splitting, which we ended up doing to avoid the long wait. In addition to giving us options, we were notified at seating about any specials that would be unavailable at that time. We were checked up on a good amount throughout the evening, and one of the waitresses even complimented my nails while taking away plates at the end! It was a cozy and friendly atmosphere the entire time.\nAs for the food, it was amazing. The bread they gave was on the harder side, which isn't my preferred texture, but still tasted good. For appetizers, I HIGHLY recommend the spinach pie(I forgot to take a photo before my table devoured it, oops!) It's great that the restaurant offers grilled and fried versions of different appetizers to fit different people's preferences. We got the fried calamari, which tasted really fresh. For the entrees, the food was seasoned very well, and tasted great even when we reheated the leftovers hours later. The side of fries came as little circle shapes, and they were also really good. In addition to all of this, my everyone at my table was given dessert before we left, which was a very pleasant surprise. Nobody had ordered it, so I assume it was complimentary. It was extremely tasty, and my only regret is not asking what is was!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaEtqMTBnRRAB",
            "text": "Lunch gathering for a birthday celebration was awesome. The seafood was all so fresh and delicious. The vegetable chips were nice and crispy too.\n\nThe seafood was all displayed next to our table like a fish market.\n\nWe stopped off the celebration with a cake from Martha's, the berry Napoleon.\n\nBEWARE - the do not take reservations and parking can be a bit tough."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SaVFVeHVZWGRaVlVwa1dVZGZkalJXYjNaTFMzYxAB",
            "text": "All I can say is WOW. The Mister and I were speechless. We had the Grilled Octopus, Grilled Calamari, Raw Oysters, and shared Lamb Chops with Lemon Potatoes. EVERYTHING was perfectly seasoned, cooked and fresh. Service was amazing and we’re definitely going back. I’m a chef with a pretty judgy palate and was thoroughly impressed. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva3E3UElREAE",
            "text": "Delicious Greek food served with perfection. They never disappoint.  Highly recommended and will continue to visit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMeUQ5ZTNSd3Fpb3h3RRAB",
            "text": "I recently had dinner at Taverna Kyclades on Bell Boulevard in Queens, and it absolutely lived up to the hype. From the moment we walked in, the place felt warm and inviting—lively but not chaotic, with that cozy Greek taverna charm.\n\nWe started with the grilled octopus and Calamari —everything tasted so fresh and flavorful. For my main, I had the Bronzino, and it was honestly one of the best I’ve had—perfectly cooked and packed with flavor. The portions were very generous, and they even brought out a little complimentary dessert at the end, which was a sweet touch.\n\nService was fast, friendly, and on point. Our server was super attentive without being overbearing, and the whole team moved like a well-oiled machine.\n\nOnly heads-up: it does get a little loud during peak times, and parking can be a challenge on Bell Blvd. But honestly, it’s worth it. If you’re in the mood for authentic Greek food and great seafood in a vibrant setting, this place is a gem.\n\nWould absolutely come back.  5 out of 5 for me!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNONk1DSi1BRRAB",
            "text": "This Greek restaurant near Bayside has captured my heart. Conveniently located, it tends to get quite busy in the evenings, so I highly recommend making a reservation.\n\nDuring a delightful late lunch with my co-worker, we were promptly served without a lengthy wait. The grilled octopus, a generous and tender appetizer, set the tone for a fantastic meal. My grilled calamari and my friend's grilled branzino were equally impressive, and the lemon potatoes were a perfect accompaniment.\n\nWhat made the experience even more special was the small, complimentary dessert at the end of our meal. It was a sweet touch that added to the overall charm of the place. If you're a fan of Greek cuisine and find yourself in Bayside, don't miss this gem. Plan ahead or secure a reservation for the evenings – you won't be disappointed. A five-star experience with delicious food and a delightful surprise at the end!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdjhiVU53EAE",
            "text": "Loved the food especially the mussels Santorini and grilled octopus. Quick and great service as well. Table for 2 is kinda tight though if you order 5 dishes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPR3UxYXFadzRIcERnEAE",
            "text": "We ordered at 4pm, picked it up at 535, they said that the food is not ready yet,  after 30 mins of waiting, they find out that our  order is not even ready at all and blame the Ubereats driver took it. They didn’t even bother to find out our order."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKanVxcl9nRRAB",
            "text": "Been wanting to try this place ... so many choices along this section of Bell Blvd.\nWe know this place can get very busy so we arrived at 4:30pm for early dinner (Sunday). We were greeted promptly at the fairly filled establishment. We were told the table will be ready in 10 minutes, but we were called in only after 5.\nOur wait staff was attentive and friendly. We ordered sparkling water to share and he came back and took our order timely.\nThe fried calamari was light and crispy while the Broccoli Rabe with Feta was tender and packed with flavor.\nMy salmon steak was perfectly cooked. Crispy skin and juicy steak. My parents had the Kyclades Special (for 2 people). Stuffed shrimps and clams, scallops, lobstertail and  lemon sole. They loved everything. We also ordered Grilled Shrimp and it was gone in no time. Even Grilled chicken was juicy and tasty.\nAll entree comes with 1 side. We ordered one of each...lemon potatoes, fries, Swiss chard and beets(marinate in olive oil). And again, they were all really good. My personal favorite was the lemon potatoes.\nWe were served a semolina pudding (dessert) after our meal. It was delicious.\nWill definitely be back again to try other dishes."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbWRlbmxRRRAB",
            "text": "I am not writing this review to tell you what to do with your hard-earned money. I am going to share my thoughts and you make your own decision if you would like to try this place or not. Not sure I can find anything bad to say about this restaurant. We had three plates, and all were well-cooked and tasted fresh and delish. I apricated that they did not give us frozen seafood. The staff is friendly and knowledgeable."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMEkzenFBRRAB",
            "text": "Taverna Kyclades in Astoria, NY, is a culinary gem that transports diners to the vibrant streets of Greece with its authentic Greek cuisine and welcoming atmosphere. Nestled in the heart of Astoria, known for its rich Greek heritage, Taverna Kyclades has become a beloved destination for locals and visitors alike.\n\nFrom the moment you step inside Taverna Kyclades, you're greeted by the lively energy of the restaurant and the tantalizing aroma of grilled seafood and Mediterranean spices. The décor is charming and rustic, with blue and white accents reminiscent of the Greek islands, creating a warm and inviting ambiance.\n\nThe menu at Taverna Kyclades is a celebration of Greek flavors, featuring a wide selection of fresh seafood, grilled meats, and traditional mezes. One of the highlights is the selection of whole fish, grilled to perfection and served with a drizzle of olive oil, lemon, and herbs. The octopus is another standout, tender and flavorful with a crispy charred exterior that perfectly complements its delicate texture.\n\nIn addition to seafood, Taverna Kyclades offers a variety of classic Greek dishes, including moussaka, spanakopita, and lamb chops. Each dish is prepared with care and attention to detail, showcasing the rich and diverse culinary heritage of Greece.\n\nThe service at Taverna Kyclades is attentive and friendly, with staff members who are passionate about sharing their love of Greek cuisine with diners. They are knowledgeable about the menu and happy to offer recommendations or accommodate special requests, ensuring that every meal is a memorable experience.\n\nPricing at Taverna Kyclades is reasonable, especially considering the generous portion sizes and the quality of the ingredients. It's an excellent value for the authentic Greek dining experience you receive.\n\n💙Taverna Kyclades in Astoria, NY, is a must-visit for anyone craving delicious Greek food in a lively and welcoming setting. With its authentic flavors, friendly service, and charming ambiance, it's no wonder this restaurant has become a beloved staple of the local dining scene."
        }
    ],
    "reviews_count": 67
}