{
    "name": "Bareburger",
    "place_id": "ChIJD1waiuBhwokRjKuhFE9PqVs",
    "grid": "QN11",
    "address": "42-38 Bell Blvd, Bayside, NY 11361, USA",
    "rating": 4.5,
    "user_ratings_total": 1078,
    "phone_number": "(718) 279-2273",
    "reviews": [
        {
            "date": "7시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOT04yWlhhbVpOWmxwMFpXeFRRamxGZVRGdlZVRRAB",
            "text": "Great food and customer service"
        },
        {
            "date": "수정일: 2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaHNITzdnRRAB",
            "text": "Owner&Entire staff is professional & flexible. Big support for 1st responders.Most food is organic & natural. I highly recommend this eatery which is family oriented & kids friendly."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNmVUWnFiek50VlVvelRuZG9ZVFZPVDJaZmMwRRAB",
            "text": "Overall we give this place a 3 out of 5 stars. We were disappointed with the service, the servers were polite, but It took 20 minutes to get water and we didn’t receive a refill until we received the check. The food was decent and reasonably priced for New York. The food was served within 20 minutes of ordering."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaVowY3Rjbk5ZVW1acGFHdGpWRTR4ZUcwMFVuYxAB",
            "text": "The atmosphere is ok but do not be fooled. I got food poisoning from this place twice. I came back again to give them another chance. I ordered the same burger I usually get with avocados, cheddar cheese, and the bacon on it. Just a regular bacon cheese burger, nothing crazy. I always ask them to make sure the bacon is WELL DONE. They use very thick bacon strips here. Idk why they do. If the chefs don't know how to cook them properly they shouldn't be serving it and that specific cut shouldn't be the only option. And I got very sick from food poisoning because they like giving people THICK soggy bacon. Even after you ask if they can cook the bacon well done they still give you soggy under cooked bacon. Even worse it's all over priced. Not even good quality food here. The beef is nothing special. They invest so much in rearranging furniture and costly ridiculous decorations but refuse to invest in better chefs that can cook and handle food properly. They charge all this money for food that gets people sick, shameful. I lost 5 lbs. My experience was so awful I couldn't eat solid food for a week and I was constantly in the bathroom and throwing out underwear :("
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzczhfUVR3EAE",
            "text": "Today I came down to bareburger to sit at their new beautiful bar.  Natalie was the lady of the hour.  She whipped up an amazing old fashioned that many bartenders get wrong.  Stephanie is a master bartender and made the best old fashioned I have ever had.  She is lovely.  She cares about her work and does it well.  The old fashioned was so delicious I had to endulge in a 2nd.  Come here for a cocktail and definitely ask for Natalie!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdGRuZ3paamc0WWt0UUxXZDNUMmxDUkVFM2IwRRAB",
            "text": "Sadie was a great server. Very friendly and easy going. Food and drinks were great! Will be back. Great spot!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MFNsUmFVREpIVDI0eGNIaGlTa3A1T0ZGWE1tYxAB",
            "text": "Love the Bayside location. Super friendly staff and food are always on point. The best burgers!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCM1ZXOHlhamsyV0hCSlJrUnpOV2RSTlc5ek5IYxAB",
            "text": "Great service, new foods to try and enjoy them"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMFVVWjVaRk5UYUVOR05Vb3hlbXhoYUMxek9IYxAB",
            "text": "Wonderful experience. The food was delicious and served hot! Family friendly as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUmEzVkpjbFIzUWtJMmVEaG1UM2RYWXpGTmVVRRAB",
            "text": "Online order. Food ready on time. Prepared correctly. Immediately acknowledge when I walked in. One server talked to other who gave me my food. Nothing missing from order when I got home. Perfect online order interaction."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSGFFRnpaVWhRWXpobk5HOTFNVVZ1V1U0MU4xRRAB",
            "text": "You can't beat their prices, especially if you want to grab a beer during happy hour. Food is delicious 10/10."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NM1FYZFhiRFJwYzFOWGRreFJiRU0yYjBsWFZFRRAB",
            "text": "The staff is great and always attentive to allergies and dietary needs. We love Bareburger! Just take care of the fruit flies."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WclMzQnhVREp4Y0dwRmRWYzNYMHcyZFd4MFpFRRAB",
            "text": "Basic Smash and a pint of Guinness.\nExcellent food service was adequate."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSE0zRkpNVGR5U0dVM1drWTBNRWhHU1VaUVVIYxAB",
            "text": "Underwhelming and overpriced"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWFdubENRMUl5WjA4NVpXcFdTMWhSV0ZOb0xWRRAB",
            "text": "This Bareburger needs to come to NJ and show them how it’s done! Burger was great, fries were good. I would return if I was in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeGVuSlFZVmMyTVdob2FEWXRjVXh1WjI1UVgwRRAB",
            "text": "I got it delivered and the burger was very dry🥹"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTE9GRmZhekZ0T1ZKSGJtbGlhMHBsVHpOblRGRRAB",
            "text": "Great burgers + Sangria 10/10"
        },
        {
            "date": "3달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVM01EWkhiV04xWVZjNFlVMWZYMkV4UmxFeE0zYxAB",
            "text": "사장님이 친절해요. 여기 5번째 방문인데 매번 맛있어요."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWlpIUmhTbE5LY1ZKbmJtZElRMHROTXpoMk0zYxAB",
            "text": "We are loyal and regular (weekly / bi-weekly) customers. The food at any Bareburger is top quality. We consistently have an excellent customer service experience with Sadia. The experience is haphazard with other servers. The kitchen can quickly become overwhelmed, we’ve had times when it takes 45min just to get fries. The owner of Bareburger Bell Blvd has hired some excellent people, and there is also room to train other team members. Honestly, if Sadia left and we stopped getting top tier customer service we may as well just choose a different Bareburger to go to since the food is the same across chains but the customer service is really the differentiator."
        },
        {
            "date": "3달 전",
            "language": "ms",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SmRqZFpXRk52UVRaSFdXSkNiVWhxVTJKT1RHYxAB",
            "text": "Goood"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMTRxTndBRRAB",
            "text": "Order was just right. Delicious and fresh. Really hit the spot"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGakxVMHpVVFpuV0dkT2EycERjRU5QTTJSdVJsRRAB",
            "text": "Great burgers and fries!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcUV3OWkxNWZPdUh3EAE",
            "text": "The server was very kind. I liked their various sauces. Spacious seating. Easy payment system through Inkind. All are perfect."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRU1ucFFOMDlHTmxwWmJIVm5jazFDUkY5TVJYYxAB",
            "text": "I’m a bit picky on greasy foods, but this was the best burger I’ve ever had hands down. So well cooked, not too greasy, and held together so well. Was cooked to perfect temp and had a good crust on the patty as all red meats should"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPZVp6T2F2cGFtOEFnEAE",
            "text": "Husband and I both got food poisoning from our order yesterday through ubereats.\nThink twice about eating here"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNUEt4X0xDZ3RXYjZRRRAB",
            "text": "Date night! Netflix and chill night with burgers from Bareburger! A perfect combination. 🥰🥰"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNeU1fU3F3RRAB",
            "text": "화장실이 남녀공용 하나 뿐이네요. 공간이 넓지는 않지만 서비스는 친절하다. 버거는 다 맛있어요."
        },
        {
            "date": "4년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhajU2Z3hRRRAB",
            "text": "너 먹어봤어, 맥과 킹은 이야기도 하지 말어...\nDid you eat Bareburger? Don't say Mac and King!..."
        },
        {
            "date": "10년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRa29tTml3RRAB",
            "text": "감자포테이토가 맛있고 햄버거도 크고 맛있어요"
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNXJxdXRBRRAB",
            "text": "정말 버거 맛있게 먹었습니다"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtX2NtUXV3RRAB",
            "text": "홈메이드 햄버거 같아요 :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPWEs4YnVkaVlyUThRRRAB",
            "text": "Let me start by saying this place is 5 stars hands down. Today’s experience was different. We came in. Clean cool place. Nice soft music. My family and I put our order in ,cool !, something must of happened in the kitchen. Small issue with our order. No hesitation management corrected the problem. And we got our burgers they smacked. Perfectly cooked , very savory. This one is on the definitely return again list."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhaVk2VGl3RRAB",
            "text": "I have to say this is my second location of the Bareburger I usually go to the one on Court Street in Brooklyn. I was very impressed by you quality and how everything was presented. My bison burger was so juicy and delicious. I had the the roasted asiago cheese brussels sprouts which I highly recommend also delicious.The servers were all friendly and attentive. I will definitely be back when in the area again."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzMllYV2xnRRAB",
            "text": "I ate here with my 2 week old baby and wife on a Monday afternoon. Was quiet, which was perfect. Lunch specials! So I had a beer. I got the buttermilk Santa Fe sandwich and my wife got herself a burger. Which she ate half of, then took back…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbnJwWjJfaWF5SHZBRRAB",
            "text": "From GA.  Wife is Celiac.  Food was amazing, salted caramel shake a d pickle chips were to die for. I would share a pic, but it is just empty plates at this point.  Staff were also friendly and helpful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eTRhcWh3RRAB",
            "text": "Rating: 4/5 for Food, 5/5 for Service and Atmosphere\n\nI recently had the pleasure of dining at Bareburger, and I must say, it was an overall fantastic experience. While the food was certainly enjoyable, there were a few minor areas where it fell slightly short of my expectations. I ordered by burger medium but it came well done. Nevertheless, the exceptional service and inviting atmosphere more than made up for it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScmVUTDNBRRAB",
            "text": "Nice location , I ordered a chesse steak . But it wasn't what I expected.  It didn't have enough chesse. The meat had favor, but they are not known for making chessesteak. I wouldn't recommend to order it. It would be better to get a burger"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxenB6VHFnRRAB",
            "text": "Excellent burgers and fries. The waitress was very nice and attended to us quite often to ensure we were having a pleasant experience. Water pitcher left at our table was great. Good spot to eat at with a friend, pretty quiet and good space…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVeUlMWVpBEAE",
            "text": "The burgers were very tasty—especially The Matador. The onion rings were ok. The onion slices were a little wide. Had the sweet fries. I liked it but my dining mate preferred regular fries. The ice cream milkshake was good but the straw was too thin. They need to invest in some boba straws with spoon end."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NFB6b0dREAE",
            "text": "It was a good experience in this place. They have vegan options and the portions are really big. I went with my partner and with our pet (only animal service)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdHZ1djdBRRAB",
            "text": "Service is excellent, but the food quality has drop at this location. Not sure if it's everywhere like this.\nI ordered a chicken sandwich and fries.\n\nThe chicken looked like it was refried several times the French fries had that translucent greasy look you can tell this wasn't fresh it been laying there for a while.  The food quality is equal to going to a bad greasy fast food joint. You might as well save your money go to McDonald's or Burger King and get the same quality for less money.\n\nI've been a Bare Burger customer for years and but lately, the quality that Bare Burger was known for is not there. It's sad that because I thought of Bare Burger as a top-notch place when it came to burgers\nbut now I will need to find a better place."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2M0lmNld3EAE",
            "text": "Place is a little pricey, even more so with delivery, but you'll be happy and full at the end of your meal. First time I ordered from here they had some amazing options for what meats you could get.. like ostrich. Now it a little more \"regular\". I just a simple burger for this meal, and it hit the spot. A bit messy but that's what plates and napkins are for."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdEtHdnRnRRAB",
            "text": "Great service. Relaxed atmosphere. Always great food.\nHad the new cheesesteak. Not bad for a burger place.  Presentation could be a little better."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bmV5YUlBEAE",
            "text": "I ordered the vegan burger and it came with the standard brioche bun (made with eggs). I asked the server is the bun vegan, he said “ya not vegan”, I asked why would you do that, wouldn’t you think they shouldn’t go together, he said it’s the standard bun. I’d love to know what the thought process was behind this idea ~ We’re gonna get the Vegans this time! They’ll never know! This is a sly fox move. You can’t out-fox a fox. I’m not sure if this is an issue at all Bareburgers or just this one. But this is a slam dunk for Shaq. This is a fastball down the middle for Bonds. This is a touchdown for Brady. Simple math. Vegan bun with the vegan burger should be standard. I took a bite of the non vegan brioche bun and my reputation has been destroyed. I am no longer B the Veeg. I’m just a jerk now. A non vegan wimp. My streak has ended. I’ll remember that bite for the rest of my life"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZc3AtQUVREAE",
            "text": "I have eaten at the Bayside location before and it was on par with all the other Bareburger’s I’ve been to. Unfortunately I was really disappointed with the quality of the food I received when I placed an order to pick up. Not only was all…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIb1l2MXJnRRAB",
            "text": "I’ve tried both the smash burger and chicken sandwich from Bareburger, and they are absolutely delicious. The fries are great too! What I love most is knowing that their food is real, organic, and healthier compared to the fast food options around here.\n\nPlus, their prices are amazing, especially since so many other places have raised their prices—some are even more expensive than Bareburger, and they aren’t even organic. I don’t trust the other places, and they charge way too much, so Bareburger is my go-to spot.\n\nOn top of the great food, the atmosphere is fantastic. The restaurant layout and theme are so unique and inviting—it really adds to the experience. Everything about Bareburger is perfectly amazing, from the service to the food to the prices, all of it is top-tier. I just wish more people knew about this place!\n\nPlease consider putting ads in colleges because we need more affordable, healthy, and tasty food options like yours.\n\nThanks for the great service!\""
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcV9qSkdBEAE",
            "text": "They use good quality ingredients, and their regular burgers are solid but not spectacular. If you splurge and get  the Wagyu burger, it is definitely an elevated experience.  Five stars for their vanilla ice cream shakes - the very best I've EVER had. Run there  for the shake, and why not get a burger while you're there."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eC1xTjhBRRAB",
            "text": "This Bareburger location is always a great experience and has delicious food! Sadie, the manager, is the best and always takes care of us, making every visit special. Been coming here for years and will definitely continue for many more!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNzVMTzhBRRAB",
            "text": "I had high hopes for this establishment, but unfortunately, my standards were not met.\nAfter ordering, the large fries took about 30 minutes to come out. The fries had a good salt level that kept you wanting more. Although 2 is the maximum amouny of sauces, the server saw the excitment in trying the many sauces that come on the side, so if you ask politely, they'll allow you to have 3. The 7 thai siracha ketchup tasted like a barbeque sauce and ketchup mix. We also ordered the special sauce, but that tasted like any other special sauce you find in a restraunt (Ketchup/mayo). The siracha mayo however was very pleasing. The lightness of the sauce complimented the salty fries very well. There are many more sauces to discover.\nWhen the burgers came out, the first thing we noticed were the cold buns. That put me off a little. The \"El Matador\" was not special. The guacamole and the pico de gallo all blended with the patty, so the individual flavors were lost. It all tasted like one small mess (The serving is quite small). I regret not ordering the \"American,\" but I would not come back to find out. However, if you support their mission of being wholly organic, than I feel like their are other items on the menu that are outstanding."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMlBTb0dREAE",
            "text": "I got the American burger. The patty was very juicy, and the veggies were fresh and crisp. The amount of sauce was just right for me (I personally prefer my meals less salty)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0cGJXaGJBEAE",
            "text": "Food was great lots of options vegan gluten free organic etc i loved the ambiance, nice decorations cute lamp on the table good vibe in general service was good Sadia was nice and attentive i will be back 👍🏻 5 stars ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cXFES3hRRRAB",
            "text": "I gotta say, it was great to walk around my old stomping grounds. It's been many years since I've been around Bell Blvd and came across this local franchise.  I had to see what the rave is about this place. As I walked in, I felt like I was walking in a new dimension of earthly like environment.  Great decor inside, various seating available. They offer various meat selections including Elk meat. If you are daring, I recommend their \"Elkasaurus\". I hope I spelled it right. It was my first time trying this meat as they do offer regular cow meat and bison meat. I forgot to mention, their meat are organic,  \"grass fed meat\". I took bites into my hamburger sandwich and it blew my mind away. It tasted so good and honestly you can't tell if it's cow or Elk meat. Their side portions are huge and shareable.  I recommend their onion rings. It's very crunchy and delightful. They do offer alcoholic beverages too. Pretty neat craft beer selections too. If you are adventurous, please check this restaurant out. There are two other locations within the NYC. I look forward going back to enjoy other delicacy they may have."
        }
    ],
    "reviews_count": 52
}