{
    "name": "Benares Tribeca Indian Restaurant",
    "place_id": "ChIJ6e4q1BhawokRWWDyNSiQ4yo",
    "grid": "MN1",
    "address": "45 Murray St, New York, NY 10007, USA",
    "rating": 4.2,
    "user_ratings_total": 2252,
    "phone_number": "(212) 766-4900",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGV05XNUpTVVZNWDJkMVNFVnFNVGwyWldVMGRIYxAB",
            "text": "The food was good, staff was good, but the person who attended us at the entry stopped us from choosing the seat, even when the restaurant was empty. He told us not to enter without his permission, we had a small kid with us, so thought to set him and his stroller in some place.\nAlso they charged us 15$ gratuity for 4 adults and one kid under the age of 3. NYC restaurants and other states charge gratuity for the group of 6 or more, he charged us for 5. Upon confrontation, he told it's our choice. Being an Indian, I thought it would be a good experience, but if this is what they do, they are representing India in a wrong way."
        },
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuamEyUnlRRRAB",
            "text": "Update- visited again in Nov'25. Amazing.\n\n2024- Loved eating here. Excellent food.\nHARISH IS A LEGEND, please take care of him. Amazing hospitality. We tried Malai Kofta seeing other reviews and it was too good. Even the Benarasi Kachori was so different (like Raj kachori). Mix veg pakodas were fresh and tasty (Aloo, Gobhi, Pyaaz, Palak). Could have added a Paneer too to make it complete :D.\nThe Naans/breads were also perfect. Yellow Tadka Dal was bland but fine.\nIn the end, Gulab Jamun was wowwww!!!! Definitely recommend and will come again whenever I'm in NYC."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRU1VZHlSWGN0VDFCT1lVUnhSa2hPYmtjdFlVRRAB",
            "text": "Tasty Indian food, great service, and a cozy vibe!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treVJVdGliVkpYVUhwamRHNXRVbEo1TFhwMk9XYxAB",
            "text": "Excellent atmosphere and the person at the front desk is very polite and accommodating us beyond 10pm.\nRambo was my server and he was super nice and his service is beyond match .\nHighly recommend this place."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTFZHVnJWVzU1YkhobFRsOVNWbEZDTUdsRE5sRRAB",
            "text": "The food was excellent service was great even though I was late a little bit the gentleman took care of us really well, so I highly recommended This place my server Mr. rainbow was a wonderful God bless."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMlRXeG1SRE51Y3pCbE5qUnBOMW95V2t4S1RsRRAB",
            "text": "We ordered catering (party trays) from Benares for an office event. The food was delicious and several of my coworkers asked where it was from so they could order from Benares in the future. In addition, Aankit was a pleasure to work with and very responsive."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RVkxcERSRzFQZDFWWVNVTTJiVlpMZFRoVVozYxAB",
            "text": "We had Benares cater our Indian wedding week with over 400 guests, and everything was absolutely flawless! The food quality, menu options, and overall execution were beyond impressive. Our guests could not stop raving about how delicious…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVFduUkJZalp5VTJ3M00xQnVUa1pPTW5FelIyYxAB",
            "text": "Extremely terrible host. We came with our team and had a reservation and he blatantly said I have a table of 25 that requested for 35 people just now so I can’t accommodate your reservation. He then tried to squeeze us in a corner table but the tone was very rude all the way through. We left and went to a different restaurant ( Tamarind) which was so much better. Never coming back to this Reataraunt."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5a1RrbEZYMGROWTBWMVVWTlpiRVJEZGs5U04xRRAB",
            "text": "Not even one review very worst restaurant don’t ever go it’s not clean also the service was totally worst. No one please don’t go"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aVptVTFOVUZTYldKRk5ucDBPWEJCY3pWSU5rRRAB",
            "text": "Wonderful experience. Food was awesome and the atmosphere was welcoming. Will definitely go again👍"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkQmRpMXZSQzFQVFVGeWNEYzVNWFJ0ZEhBMlFXYxAB",
            "text": "Veg food was good, non veg maybe not as much. Service was really good and so was the atmosphere."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0ek9FeGtiR2RZVFZkMmREQldNVXhuZEhkd2ExRRAB",
            "text": "It was okay, the food was good, the service average, and the restaurant itself could do with a renovation refresh."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQ2JXTTBRMWM1UkZsMVVYbFdPVlZMUWxWblYxRRAB",
            "text": "I had ordered Kolhapuri Misal, Dal Makhni and Benaras Kachori. Kolhapuri misal was the worst. No taste at all, not even salt.Dal Makhni was burnt and the worst dal makhni one can ever have. Kachori was mediocre. So I wouldn’t at all recommend this place"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVVltb3RaR016UW0xQk4ybEhZalprTVVSVU5uYxAB",
            "text": "Good service and food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYU5WZE9jVTR3WXkxTlVFdDZkM05rYVZOdmVIYxAB",
            "text": "Everything was great and the server was nice"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdGRYTnphVUprUXpSc04zcHlXVGhaZDNGNGFtYxAB",
            "text": "Disappointing Experience\n\nHad high hopes for Benares Tribeca, but the food fell flat. Most dishes lacked flavor, and the Amritsar fish—while vibrant in color—was overwhelmingly salty and hard to enjoy. Service was fine, but the food just didn’t live up to expectations. Not likely to return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padFZISlpURmhuZEhCdWJESm1VV290TlZOMkxVRRAB",
            "text": "Friendly staff and great service! The coffee was delicious and freshly prepared. The café has a nice interior and calm music in the background."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTWFGVlhMV05qTjJscFdWRk1VblpHUzE5UlVuYxAB",
            "text": "Amazing homely food. Freshly served."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ka2VtaDRObkJPZWxoTGF6RnJha05VZW5odGMxRRAB",
            "text": "Food and drinks were really good. The service was okay but could have been better. The atmosphere was okay nothing special though."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWWVYRTBjMHR5UzJnNVgyNDNSVVF5TVhWQ2VWRRAB",
            "text": "Really good ambiance and service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UWRUaG5WVEZQUW5wblZYRTNSMnhWUldKRlEwRRAB",
            "text": "Usually I don't have an issue with this place.  But for some reason while trying to pick up my order I was ignored. Then another party came in after me. The guy in the front completely ignored me after looking at me directly in the eye and greeted a family that just walked in. It was rude and I feel as if they were targeting me in particular."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eFFYbGFPR3hXUjNCZldVTkVXRUZtVEVOSVNsRRAB",
            "text": "Exceptional experience at Benares Tribeca! Server Fernandez was phenomenal - friendly, attentive, and gave great recommendations. The vegetarian options were delicious, expertly prepared, and generously portioned. Quality and quantity were both impressive! Warm atmosphere, great service, and outstanding food. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScFdYaFdRbU5mVkd4ak1rRm1iVFJNWDFsTldYYxAB",
            "text": "Absolutely wonderful experience! The service here is warm, attentive, and personal — they truly make you feel cared for. Every dish bursts with outstanding flavors, and you can taste the high quality in every bite. It’s easily some of the best Indian food I’ve had.\n\nIf I could add one tiny wish, it would be to see a favorite candle on the table to make the already cozy atmosphere even more inviting. But honestly, everything else was perfect. Super clean. Great date or family spot. The personal service and incredible food set this place apart. Highly recommended!\n(Thank you for the rice pudding!!:)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZeFZHNHpaWEJhUkRkWVlqbHhUV3BETlhCUFZHYxAB",
            "text": "We went for Dinner . Food and Service was good .\n\nWe ordered all vegetarian food , all were fresh and tasted Good .\n\nRoadside construction was a concern , but it's nothing to do with restaurant.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRlgwTnVZMU5ZYURrMGJWUTNkWE5uWTJOdVNYYxAB",
            "text": "Food is below average. Ordered Paneer Tikka Masala, Indian style spicy with Garlic Naan, however they served  sweet gravy made out of canned tomatoes and to make spicy they just added paprika. Service is good though!\n\nTotal Bill: $42"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMlJuSTNOVmhPZW1sSGRWRjNTRkl3TUdKR1pXYxAB",
            "text": "Worst service ever!! If you are hungry then better find a different place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaclNVRnphM05OUkcxVGVHNVJaWE5FTjB4bE9XYxAB",
            "text": "Amazing food. Great service. I will definitely recommend to go visit this place.\nThe chef makes very good food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWGQybHdXbWhSU21SSk5qaHBWMHN0WldSZlIyYxAB",
            "text": "Excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQmNXcERkV3hmUlU5MlVrTkZiR3RyYm05T1dsRRAB",
            "text": "Food was great. We ordered chicken biryani, butter naan. Arun was friendly and was prompt in taking care of us."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaE5XOUZSakZXY1VrNVREUldRMTltZUhSNVYyYxAB",
            "text": "Benares catered our wedding in Fall 2024 and did an amazing job! We worked directly with the owners and they did everything to welcome us and take care of us every step of the way. They were very accommodating and allowed us to adjust taste/spice levels of all the dishes. Everyone loved the food and some of my uncles and aunts were even asking who catered so they could use the same in the future!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRFRXcHFXRU5aU0U5bU5WTXpjRU5YT0dsVVlrRRAB",
            "text": "Felt the taste of home food. Food is really good and service especially by Arun is too good. Amazing place away from home"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTVpHVm9UbEZ3VmtwRlZHODFWV0Z6ZVRoeE9IYxAB",
            "text": "Great place for business lunches!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkM00wbG5VMnhJUnpoTFNHdFhUbGQwTmxRd1ZFRRAB",
            "text": "I would rate this a 10!! Rambo gave us the best service. My sister and I went in on a rainy day, it was pretty slow, but WOW was the food amazing.\n\nThey even packaged out leftovers to-go for us."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWM1lWVkVXbEZNVUcxM1YxaDRTMlF6TUVKMVNtYxAB",
            "text": "Best Indian food in nyc! Rambo is the best"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOS2FVdGpaelZFU0ZGclZYTkJZbXBQUW1oa01rRRAB",
            "text": "The food was good and also the Service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRWNGOWhNbk4wY2trMWVXbDNWM1Z6YlVaV1puYxAB",
            "text": "Excellent service. Food quality is very good. Rambo was my waiter. He took very good care of us."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b1pYaDFSWHB5YmtkalRYRnhRbWxUU0dORkxVRRAB",
            "text": "Perfect vegan and vegetarian options.  Lentil soup is outstanding! So is the garlic naan!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WR2RYVmlkM1ZOZEhabVIzSkxNM1ZHVEhObVVsRRAB",
            "text": "The best indian food around this lovely city #nyc.. Bhindi masala and Goat Biriyani are must try dishes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTFdqQmhjUzB3UlhZdGJFODJNMGhIU1Y5TE1sRRAB",
            "text": "Great food, fast service, good lunch menu with a variety of options. We came here as a group of ten and it was an ideal place for larger groups. Ample seating options indoor. The ambiance is welcoming and staff is very friendly. Will come back again! Thank you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNWRtUktlRlJKYTJvdGRqVnNhRWx1ZEZaTlZrRRAB",
            "text": "For the first time after months of going there for lunch in a party of 5 it took 25 minutes after we placed our order for the waiter to bring us our food, and they added 18% gratuity to our bill (a first for us at this restaurant) without letting us know that there was a change in Policy (was there even a change in policy?!). The food that did come out was fine, the Naan was cold and they brought out the wrong dish for one of my coworkers. This is the 3rd that that service has been off which is why I'm reviewing it. We will not be going back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVE1XWTBhVVp2VDFrNFRtWmhWMVYzWnpSdVYwRRAB",
            "text": "Great dining experience, friendly staff, good food. It is at a good location, to have lunch after spending day at one world observatory and 9/11 memorial museum. Their portion sizes were good too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMFJWVjBSbFpZWm5ZMGFFWm9XbGd0VjBsNVYxRRAB",
            "text": "Honestly, this place is such a hidden gem! The staff are incredibly friendly and welcoming, and the food is amazing, the drinks too. Plus, it’s halal.\n\nI love how comfy the seating is, and the whole atmosphere makes you feel like part of the family. They remember their customers and always go above and beyond. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT0xXTkZSazVGTlc4eGJUZEdXR1JTUkVWVmNsRRAB",
            "text": "At the venue Food Service was very poor once you paid them they picked up food for our whole family. We were trying to talk to team members they were very unprofessional."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aelltUk5Ta2hKVlZwWWJVZDZUMEpHV0VVMFlsRRAB",
            "text": "The food here is very tasty and fulfilling. The lunch pricing is very reasonable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdFEwUlNUa3hYZFhGYWJEbHlVbGx4WlZCSlRYYxAB",
            "text": "Absolutely amazing experience! I came here to reconnect with my cousin, and Parsad and his staff went above and beyond to make us feel welcome. They gave us all the time we needed and were incredibly sweet throughout our visit. The drinks were fantastic. Highly recommend the Lychee Love cocktail!\n\nThe restaurant is surprisingly spacious for downtown Manhattan, with very comfortable seating and a relaxed vibe. Portions were generous, and the prices are truly unbeatable for the area.\n\nI usually take pictures of the food and drinks but it was so great I didn't have the chance before we just ate it all up 😅 🙃\n\nThis place is a hidden gem. We’re already planning to come back for the lunch special"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200M2IwaE5OVzQxT1dNMFVUUTBXR2xJVjFwb1VHYxAB",
            "text": "Very good staff all the people made sure we were comfortable and served delicious hot food. The quantity and quality of food was amazing for price.\n\nWe had a baby with us and the staff was very helpful and welcomed the baby with warmth."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Q1NWVjVaWHBJU21KRGVYZG1iMUJoWkdreU1YYxAB",
            "text": "Hello! I am so sorry for the late review, but I wanted to keep my promise to the person I spoke to. I visited this restaurant on July 6th on my first trip to the city. I went with a group of 16 people, and I had a wonderful experience. This was my first time trying Indian food at all, and it was a wonderful introduction. The chicken tikka massala was out of this world delicious!!! I truly enjoyed everything that I ate, including the ice cream that was given to us for dessert. The service was wonderful, and everyone I spoke to and those who served us were kind and considerate, constantly coming to pick up our plates, offer us more water, and ask us if there was anything we needed. Thank you so much for the wonderful service! I definitely plan to go back the next time I am in the city. Much love!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWGRHZzJUR2xTZEVJNVgxb3RSMjR5VEdVdGNXYxAB",
            "text": "Their week day lunch food is pretty good. Staff is cordial, although the place gets really crowded Friday lunch time with delays."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWWRVeHBZbU4xWW5kc05VTjRNemd3YXpKU1ZFRRAB",
            "text": "Benaras right in the heart of the city, was amazing. Masala chai was the highlight after walking in NYC for the day. We had malai kofta and garlic naan - kofta was very creamy. Mr. Fernandez was very helping and welcoming. Will definitely visit Benaras again when I’m in NYC next"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCd0xUUTJjVUpvVkhrNU5FVnpZbTUzWldwa1ZFRRAB",
            "text": "The food here is genuinely good, and the service truly shines. The naans and rotis had that perfect kadak texture we were hoping for. Fair warning though - when you ask for spicy, they deliver! What really made the experience was Mr. Fernandez, whose courteous and hospitable service made us feel completely welcome. A solid choice for authentic Indian food with heart."
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMG9tTHd3RRAB",
            "text": "뉴욕에서 인도 요리가 먹고 싶다면 방문해보세요~"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJekpMWDZRRRAB",
            "text": "We had an amazing experience working with Benares for catering on our film shoot. They helped us organize food for a 30-person crew, and everyone was thrilled with the delicious spread.\n\nWe served butter chicken, white rice, and vegetable samosas—everything was flavorful, comforting, and super satisfying.\n\nThe staff was incredibly kind, responsive, and accommodating throughout the process.\n\nHighly recommend Benares for any event catering or to dine in! Great food, great people, great experience!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3azV2R3V3RRAB",
            "text": "Absolutely delicious Indian and Southeast Asian Cuisine! The butter chicken is moist and flavorful. The samosas have a flaky yet tender crust with a fresh and well seasoned potatoes & peas filling. The garlic naan is so fragrant and soft, the perfect vehicle to dip in the butter chicken. Oh and their sauces are freshly made and among the best we have tasted. Don’t forget their mango lassi, it’s a winner every time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIamRTV2lBRRAB",
            "text": "Went for my 25th birthday dinner and though it was a Friday night, they weren't too busy. The service was attentive, thoughtful, and honestly just a very pleasant time—not to mention the incredible food. Spicy, well-balanced, and probably some of the best Indian food I've had in the city. Definitely the best Chicken 65 I've ever had in my life. Also ordered a cocktail and the tropical flavors paired perfectly with the cuisine. Will be back, and I recommend you go, too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKRFlwTWlIa2NpRi1RRRAB",
            "text": "Great Indian food. Aldi was our server and very friendly service. Will come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMjVyczJRRRAB",
            "text": "One of the best restaurant experiences I've had in NYC by far! The food is delicious and full of flavor, the service is above and beyond, and the atmosphere is a perfect modern anesthetic. The drinks alone are a reason to go if you're not hungry but do yourself a favor and get something to eat even if it's to go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bGJpWllREAE",
            "text": "Dined in on a Friday and had the lunch special - samosas, chicken Andhra curry (curry leaves and coconut milk base), garlic naan and a small rice pudding for dessert. I was stuffed! I loved the atmosphere, it was calm yet lively. Lots of Indian families eating lunch (always a good sign) and it’s a huge airy space compared to most other restaurants in NYC. I felt very comfortable dining solo. At 3pm they have drinks specials and would definitely come back for that! The staff were kind, courteous and so sweet!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJTDZ2NlM4bl92SUFREAE",
            "text": "Benares has become one of our favorite places to dine, and every visit reminds us why we keep coming back. My partner and I have been several times, and each experience is just as special as the last.\n\nThe atmosphere is warm, stylish, and intimate. Would be perfect for a date night or a quiet evening out. The staff is always welcoming, attentive, and professional. Their hospitality truly enhances the experience.\n\nThe food is phenomenal. Every dish is beautifully presented, perfectly spiced, and full of flavor. Whether we stick to our favorites or try something new, the quality is always consistent and impressive.\n\nThe drinks are just as memorable. The cocktails are creative, balanced, and pair so well with the food. You can tell the bar program is thoughtfully curated. We’ve enjoyed everything from their signature cocktails to the well selected wines.\n\nBenares continues to impress us each time we go. It’s a place that never disappoints, and we always look forward to our next visit. Highly recommend to anyone who appreciates amazing food, excellent service, and a beautiful atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3c3JiZDBRRRAB",
            "text": "Decent Indian restaurant with some really good bar options to choose from. Went there on a weekday without reservation and was seated without any wait time. We ordered benaras kachori, chicken kali mirchi, paneer tikka masala, mint paratha, garlic naan and kathak biryani. Spice levels were decent. chicken kali mirchi tasted reallyy goodd! Would say paneer tikka masala was good. Both the breads were pretty decently prepared and tasted really nice. Kathal biryani was good but I personally felt it could have had more spices. Benaras kachori was really good and would definitely recommend it for apps! Atmosphere was quite decent and the service was okayish. Parking is not available in that area, it’s better to either walk there if you are nearby or take a cab."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaDZiNFBREAE",
            "text": "Exquisite Dining at BENARES: A Culinary Jewel on Tribeca, NYC\n\nNestled on 45 Murray Street, BENARES transports its guests to the rich culinary traditions of Northern India with a modern, upscale flair. From the moment you step inside, the warm ambiance, impeccable service, and vibrant aroma of spices set the stage for an unforgettable dining experience.\n\nFor starters, the Benarsi Kachori is an absolute delight. This traditional dish, masterfully crafted, boasts crispy lentil-stuffed pastries paired with tangy tamarind and spicy mint chutneys. Each bite is a harmonious blend of crunch, tang, and spice—a perfect introduction to the meal ahead.\n\nThe pièce de résistance is undoubtedly the Laal Maas, a fiery Rajasthani lamb curry. This dish showcases tender, slow-cooked lamb in a rich, bold, and aromatic sauce infused with Kashmiri red chilies. The depth of flavor is extraordinary, balanced perfectly with the heat, making it an essential order for spice enthusiasts and anyone seeking a truly authentic Indian delicacy.\n\nComplement your meal with freshly baked garlic naan and a side of aromatic saffron rice to elevate the experience further. The cocktail menu and wine selection also deserve a mention, offering thoughtfully curated pairings that enhance the flavors of the cuisine.\n\nBENARES is not just a restaurant; it is a celebration of Indian heritage and culinary artistry. Whether you’re a seasoned connoisseur of Indian food or exploring it for the first time, BENARES promises to captivate your senses and leave you longing for your next visit.\n\nHighly recommended for its bold flavors, elegant presentation, and the unforgettable charm of dishes like the Benarsi Kachori and Laal Maas. A true gem on Murray Street!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmb003SUd3EAE",
            "text": "Just amazing food. We were craving for Indian veg food during our NYC holidays. Benares popped up on Google search whilst returning from Staten Island. Excellent food with great service from all the Benares team. Your glass is never empty they keep filling. Super delicious food. Bernarsi Kachori was super se upper"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdE1IVHNBRRAB",
            "text": "The flavors were rich and distinct! Overall very delicious food and comfortable atmosphere. Lots of seating options, either cozy booths, spacey tables, or seating at the bar. The waiter was exceptionally friendly. The Lamb Kourma was my favorite dish. Dessert was on the sweet side, but delicious.\nHowever, the bathrooms were in a strange location and not very clean. Also, we had to ask for the water to stay at our table when we got our drinks."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcG9PSmlBRRAB",
            "text": "I've lived in NYC for 3 years and this is some of the best Indian food I've had. On top of that, the service was excellent. We were able to celebrate a birthday and  even though we were a party of 16 with 6 kids, everything went flawlessly. Thank you! Can't wait to return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNVZHSmhlRkl3U0ROM1NtNVBNR3AwV0ZkTlVWRRAB",
            "text": "We went to this restaurant  while visiting World Trade Center. Mr Fernandes provided great and friendly service. Other staff and manager were very courteous too. But most importantly food very good. We tried lunch special. The quantity was great and quality was super as well. We live in Texas and food here was much better comparatively. I will recommend eating here while visiting World Trade Center."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUd09MSTl3RRAB",
            "text": "Benares Indian Restaurant,  in Tribeca, NYC,\nLocated in the heart of Tribeca, Benares stands out as an exceptional Indian cuisine jewel in the vibrant culinary scene of downtown Manhattan. named after a city in northern India, the restaurant centers on the lush spices and abundant diversity of Indian cuisine.\n\nWe tried\nDrinks\n🍸 Lychee lover - alcoholic\n🥤 Mango lassi - non alcoholic\nAppetizers\n🥦Khasta Gobi\n🍢🍗Chicken 65\n\nEntree:\n🥬🧇Saag Paneer\n🍛Chicken Dum Biryani in clay pot with naan in top\n🥘Lamb Rogan Josh\n🫓Garlic naan\n🫓Plain naan\n🍚🫛Peas Pulao\n\nDessert\n🍨Rose ice cream\n\nThe robust menu is almost overwhelming, and yet authentic serving contemporary Indian cuisine. Do not skip chicken 65 , Lamb rogan Josh,  Chicken Dum biryani  or the saag paneer they have an ample selection for both non vegetarian, vegetarian and couple of vegan options like Khasta Gobi ( cauliflower) all are stand-out options that deserves attention. Finish off  with refreshing rose petal ice cream.\n\nThe ambience strikes a perfect balance of serenity and sophistication.\n\nStaff’s knowledge and recommendations are much appreciated.\nWith its flavorful food, attentive service, and tranquil setting, Benares has carved out a niche for itself as a must-visit Indian restaurant in NYC."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcmZQTXFRRRAB",
            "text": "The food was great and so was the service! Everything seemed very cozy and comforting. We got misal pav, kachori, naan, methi malai matar, laal maans, lassi, and fresh lime soda. Kolhapuri misal pav didn't really hit the spot but everything else was delicious and I would recommend it! We just probably made a mistake of going there when the owners had their own party ongoing. It distracted the staff and they understandably felt like they had to reprioritize their services to cater to the party. Would definitely visit if I am in the area."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldklUampRRRAB",
            "text": "My friend recommended this place to me and it did not disappoint! The wait staff was friendly and attentive and were happy to make food suggestions. Our three guests had never had Indian Food before - this was their first experience - and they absolutely loved it. We all enjoyed the flavors of the dishes. The naan was so fresh and yummy and I was able to box it up for lunch the next day with my leftovers - so good! However, my FAVORITE part of the night was the cocktails! Affordable, unique, and delicious! I know where we are going the next time I am craving Indian!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURob1B5T3NnRRAB",
            "text": "One of the best Indian food restaurants we've had in the city because the flavor of the food was actually memorable (so nicely spiced!). On top of that the service was attentive, especially our server Harish who had great recommendations and was careful with our dietary restrictions. Tons of vegetarian and vegan options and portions were generous. Look forward to coming back to try other options on three menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeV9LWUVnEAE",
            "text": "Benares Tribeca is a nice place to have simple and amazing Indian fare. The menu boasts the classics and the dishes remain very true to their origins. They are delish and sumptuous. Set in a retro and classic theme the place exudes sheer simplicity and exuberance."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcTh2T1BBEAE",
            "text": "My friend is from India and this is our favorite Indian restaurant in all of Manhattan. The food is very authentic, well-spiced, and delicious. I love their aloo tikki, shahi paneer, and kulfi in particular. The staff is incredibly friendly as well.\n\nI personally don’t understand some of the other negative reviews I’ve seen on here, and I wouldn’t listen to them if I were you. They don’t reflect my experiences in the slightest. I’ve done lots of hunting around NYC for good Indian and so far Benares is the best veg-friendly option I’ve had! Keep it up!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1NGN1cTdBRRAB",
            "text": "Came here on a Sunday night for a quick dinner.  Staff were friendly and let us decide for while from their extensive list of menu.  We got one butter chicken (one of the staff’s recommendations) and a vegetarian curry with bell pepper and cottage cheese.  Rice was included and the curry makes you full faster than you think since it’s quite dense and rather oily.  Want to try their appetizers next time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbXBUN2hRRRAB",
            "text": "We just loved the place. Food was amazing. We ordered vegetarian dishes and it turned out wow. We asked them to make a bit spicy and it was perfect. We will surely visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbUppUml3RRAB",
            "text": "My boyfriend and I spontaneously stopped in today around lunch time and we were so happy that we did! From the moment we stepped inside the service was A+. We had the pleasure of having Tere Naam serve us and we couldn’t say enough great things. The food was incredible and very fresh. The pricing was great as we got three meals but the price barely reflected such. We definitely will be coming back. 10/10 I recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbnZLdV93RRAB",
            "text": "Yummy yummy food! I'd heard a lot about this place and glad that we found time to squeeze this visit in. Reserved a table since it was Sunday but it wasn't needed as they had quite a few open tables. We were seated immediately and the order was taken super quickly. I primarily went there for the Benares Kachori and Kolhapuri Misal. The Misal was fabulous and the bread was super tasty. The Kachori was thin but yum. We got the prix fixe vegetarian platter. All the curries were flavorful and on point.\n\nKnocking off a star for the lack of ambience in terms of bad music choice and extremely loud cutlery noise while clearing tables and around the kitchen.  They had a wonderful percussion artist while we were there but couldn't hear a thing as there was blaring music in the background.\n\nIf you're someone who doesn't mind music choices, go here and taste that Misal Pav!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZbE9qemhnRRAB",
            "text": "I have to start with mentioning how AMAZINGGGGG the food is. I don't really write reviews, but place is too good to not review. I have been to many Indian restaurants in NYC, but this has definitely been my best experience. Everything about this place was great including the service, ambiance, and location. Also, the prices don't dig a whole in your pocket and the staff is very welcoming. It's very rare to experience that on a Saturday evening in NYC, and I was IMPRESSED. We took our friends there for dinner, and we were so happy to have picked this spot over anything else. Our friends loved the food and we devoured the dessert. If you have never been, do check it out! They mentioned they offer summer brunches - CAN'T WAIT!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaGRmVmNREAE",
            "text": "Benares offers a contemporary take on Indian cuisine, with a focus on good vegetarian options. The peshawari chole and kofta were flavorful, but lacked the authenticity of true Peshawari spicy chole. The gulab jamun, a popular Indian dessert, was a disappointment - it was overly dense and lacked the expected tenderness. However, the service was friendly and attentive. The paneer Tikka and papdi chaat starters were good. Overall, Benares is a decent choice for a modern Indian dining experience, but if you're seeking strictly traditional flavors, you might want to look elsewhere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJLTZDM09REAE",
            "text": "Juste coming back from my trip to Paris, I wanted to compare Indian cuisine in Paris vs. New York.\nBenares tribeca indian restaurant is the best I've tried.\nHarish is the best waiter."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZcjZ5VHB3RRAB",
            "text": "Our first visit here this weekend. Had a reservation as it was the memorial day weekend. It was crazy busy here but the staff kept up. The food was great... we really liked the smoked chicken and beet root tikki. I do recommend them and also making a reservation if planning over the weekend. The chicken makhani was tasty as well"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaGNpUmt3RRAB",
            "text": "This honestly has been my go to place this entire year. Everytime I go, everyone is so nice and the food is always amazing. The service is great, everyone cares about you and makes sure you have a great experience.  You should try their saag paneer and Paneer tikka. Also checkout their lunch special, it’s the most bang for your buck!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMDlfdkhREAE",
            "text": "Located at walking distance from one world, Benaras was our pick for the dinner spot. Their veg dum biryani was delicious. Misal pav was not what i was expecting ( had chickpeas),but still it was very tasty and flavorful. The other appetizer we tried were dahi kabab,papdi chaat and kachori. Kachori stood out the best. Desserts were not as great as their appetizer but still good  enough.overall good food and good vibe and friendly staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOMkpDVW9BRRAB",
            "text": "Recently visited Benares and was absolutely delighted by the experience. The food here is exceptional, particularly the Kachori, which was perfectly spiced and crispy. The Spicy Naan and Laccha Parantha were soft and flavorful, complementing every dish beautifully. The Amritsari fish and Chicken Kali Mirch were standout dishes, each offering a unique and rich taste that was simply unforgettable. But the highlight of the evening was the surprise from our waiter who brought out a delicious Gulab Jamun cake for my birthday, making the occasion even more special. The service throughout was impeccable, adding to an overall fantastic dining experience. Highly recommend Benares for anyone looking for exquisite Indian cuisine and top-notch service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPanZIYUVnEAE",
            "text": "We were 2 and ordered dahi kebab, malai kofta, 2 garlic naan and mango lassi. Everything was perfect and tasted so good. 1 garlic would be enough for us as after finishing 2 garlic naan, we couldn’t had rice."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcjdUM1ZREAE",
            "text": "I found this really nice and cozy spot for authentic Indian food. We had a fancy dine-in experience and thoroughly enjoyed the ambience,  service and the food!\nLoved the Kathal Biryani the most as it was so fresh and well prepared. It is hard to find that on a menu anyway.\nOur servers were also very attentive to our requests and extremely friendly to talk to. I’m definitely planning to dine here again next time I’m in the city."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwbW9QN0hREAE",
            "text": "Had a lunch at Benares recently and truly enjoyed my experience here. It’s a nice sit down Indian spot in TriBeCa. Has ample seating and the service was great. The menu is quite extensive but the servers helped us figure out everything. Also the meat here is Halal.\n\nThey start you off with fryums and some chutni that you will love as a light snack while you wait for your apps. In the apps we got the Khasta Gobhi, Galouti Kebab, Paneer Tikka. All were good but really enjoyed the paneer Tikka. For the mains, the Dum Biryani is amazing and then the butter chicken is a must. One of the best butter chickens I have had especially with garlic naan. So good! For dessert I would highly recommend getting the Atom Bomb, which is a lava cake with rose petal ice cream, you will love it!\n\nIt’s a little pricey tho that comes with the location, but the food and service is top notch. They also have really good lunch specials starting from 12.95. Def check this spot out for lunch or dinner if you are looking for a nice sit down Indian spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeVpYVk9XREEwVFZOeVVHRTBMV05mUVdSWlVGRRAB",
            "text": "Great food and even better service. Wait staff was super friendly and helpful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMGFTQ2tBRRAB",
            "text": "Decent food and ambiance. We ordered Benarsi Kachori, shahi paneer. Kachori was delicious however quantity could have been better for the price. Shahi paneer was ok. Nice place to try if you’re around the area."
        }
    ],
    "reviews_count": 86
}