{
    "name": "Le Gratin",
    "place_id": "ChIJj4fN7HBbwokRCB5xca3KF1E",
    "grid": "MN1",
    "address": "5 Beekman St, New York, NY 10038, USA",
    "rating": 4.7,
    "user_ratings_total": 533,
    "phone_number": "(212) 597-9020",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWVkyUTFNRWRGTFZWalFXNVhTRU5QV0ZKbUxVRRAB",
            "text": "The food made us sick.\nTasted like it wasn’t fresh.\nNo flavor, no presentation.\nStaff didn’t seem trained properly.\nThe place smelled weird.\nNo apology or refund offered.\nCompletely unprofessional behavior.\nWould never eat here again."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRVQyTmpZMGx2V2t3d1pGOVFSRFEyVnpSek5GRRAB",
            "text": "Food was bland and overpriced.\nWaited ages for our order.\nStaff didn’t care about service.\nNo water refills offered.\nThe portion size was tiny.\nCompletely not worth the cost.\nUncomfortable seating and atmosphere.\nWouldn’t suggest this to anyone."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNE1VMVFkMnhEVjNaRldtbFZObHBxTW5WVWVWRRAB",
            "text": "This restaurant was a disaster.\nThe menu looked better than the food.\nEverything tasted like old leftovers.\nThe staff didn’t even apologize.\nTables were sticky and dirty.\nMusic was too loud to talk.\nSuch a waste of time and money.\nNever returning again."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0clkzUm5aM2xNV2xGaFkzQjVkRmw0Yld0TWNFRRAB",
            "text": "I regret coming here for dinner.\nThe pasta was soggy and flavorless.\nService was painfully slow and unhelpful.\nPlates were chipped and not clean.\nMusic was too loud to talk comfortably.\nWe left hungry and disappointed.\nNever coming back again."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTlZrNXZWMFJ2VlVSU1VVSmlTazlYUVZsUmQwRRAB",
            "text": "Memorable food, from the freshly baked baguette with soft butter, to the lovely salade verte, incredible loup de mer and lovely creme caramel! Very nice Sancerre by the glass as well!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVWVtczNhWFJqVnpsRE4zSnpiVVJDZEVwUWRGRRAB",
            "text": "The duck was delightful. Great ambience, fresh produce, quintessentially French"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOeFV6WndaRTh3TlRVNE1EZ3hPRzlqUTBoeVYyYxAB",
            "text": "My wife and I dined at Le Gratin in mid-OCT 2025 for her 50th Birthday Dinner.\n\nSimply an amazing experience.  The decor/ambiance was impeccable, the food was inspired and the service was attentive and engaging--cannot say enough about dining at this venue...you will be pleased and you will be back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdGFHSnRTWEI1WjFaTU5IbFZYMjVqYjJKaVNYYxAB",
            "text": "What a disappointment! For such a big name as D Boulud I expected more..\nI orded escargot, all there was on the plate was mushrooms\nMy steak was un eatable, and I ordered it rare.\nThe saving grace is that the waiter was very accommodating and pleasant.."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRM1IzUldWM2RCUW5kVFMyZGpiVVZDVlVaeGVYYxAB",
            "text": "Loved the French feel of everything here from the interior to the authentic menu to the service. Quenelle is a must have, as well as the chou faci special (which was divine). Great wine selection. Don’t sleep on the creme caramel too."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaVpVWllVRVJDUTNwUmJXRnFaR056VlhKQlVHYxAB",
            "text": "Very pleasant restaurant, portions of main dishes are very large, but preparation was excellent. We sat at the bar before our table was ready and the bar staff were very attentive."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVmVpMUVaVGRqTW14VU1XRmhkbkZFVXpkNlpuYxAB",
            "text": "Excellent food, the service was really good too !! I recommed it"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUGIxSjJORE5yVmw5b2VWQTRSMnRTZDFnNVlVRRAB",
            "text": "We had such a great time ! Food and service were perfect !\nAs a native from Lyon, I deeply recommend !"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSlVuQm9aMkozUjBFdFFtSnBjR1kwUlhoUFFWRRAB",
            "text": "Great team and service thank you so much !! Superbe équipe et service"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4elExOXliVWhwWW0xMlpISkVWRkJpVVRoS05VRRAB",
            "text": "I had the best crème des caramel of my life here. Still thinking about it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veGJYcHdWM05KUldKU1lYTjJPVzVVYmxJd1NtYxAB",
            "text": "Le Gratin is a great French restaurant in downtown NY. I love the aesthetic and feel of the restaurant- it's a very charming white tablecloth French bistro vibe. The smoked salmon appetizer was a light and delicious start (although it might be seasonal because I no longer see it on the menu.) For our mains we got the duck breast which was super tender and flavorful, the roasted chicken which was juicy and came with an amazing gravy, and a white fish that was good but not super memorable. The fresh bread and butter and side of fries were perfect, the potato gratin was good but definitely under salted and under seasoned, and the green beans were sadly overcooked. I recommend the citrus profiterole and chocolate mousse for dessert. Drinks here are on the pricier end at $20 a cocktail, but overall great food and service."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmejdxY3hBRRAB",
            "text": "Le Gratin offers a memorable French dining experience with perfectly cooked pasta and expertly crafted cocktails. The fried escargot was a standout tender, and bursting with flavor. The cozy yet elegant atmosphere made for a relaxed yet refined meal.\n\nI’ll definitely return next time I’m in NYC 🗽"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMWRHRm1NM2R6VlhCckxWcFZWR0p6WlhkaE0zYxAB",
            "text": "The complete dining experience satisfies completely. They've avoided excess while achieving style. Workers showed exceptional attention to our needs. They used rare components and served quickly. Le Gratin delivered beyond what I expected."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKR1IwMVVSMnhUTW5CYVdsVlVUbXc1Vmw5VVlYYxAB",
            "text": "Le Gratin is such a lovely spot! The atmosphere is warm and elegant, with that perfect French bistro feel. The food is rich, comforting, and beautifully done — every dish feels classic and full of flavor. The staff are friendly and attentive, and the whole experience feels effortless. Perfect for a cozy dinner or a special night out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdFpVVkxPR1Z0TUhNdFRtTkJlRmhqTkd0WllWRRAB",
            "text": "It is a very small place so you are very close to your neighbor. The service and food was delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcFZqVnlRMHRaTjNaemVuTTNUMVJJT1VrM2JsRRAB",
            "text": "The mallard was fantastic. The quenelle was a bit cheesy and dense for my liking, but still worth a try."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJdE9IaFVlbGhsVUV3MlNXWXhPV1ZIYkVWNVRYYxAB",
            "text": "A bit stuffy, but I was a poorly dressed walk in and they took me.\n\nTartare was good, and the duck was great. I thought the cod was ok but my wife actually really liked it. Not crazy expensive but not cheap. Overall was a fantastic, satisfying meal. Slightly on the salty side so be sure to ration your bread."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUkxYZzBRVFZaV1U1NlJHSnFORGwzUVVFNVMwRRAB",
            "text": "One of the best French restaurants I've ever tried"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCd04ybDZXWE5TTlVwUmJHMXliVTV5UW1ZeFJGRRAB",
            "text": "This is from 5/16/23.\n\nMy wife took me here for my birthday.\n\nThis is not your typical experience but this did happen to us. Usually at an upscale place like this you receive the food you order.\n\nI don’t know whose fault it was but they never cooked our food. The waiter was clearly avoiding us after some time. After waiting two hours we asked to speak to the manager , Thomas. He apologized about the situation and did his best to make up for the strange reason why our food never made it to us.\n\nI will say the restaurant did make up for the whole experience in the end . They comped our whole dinner which was very nice. We were absolutely starving. We arrived hungry but then had to wait 2+ hours to actually eat.\n\nThe manager gave me his card and said to call him next time we came. I have never returned here and probably never will. I did appreciate what the manager did. I have never experienced the lackluster communication between waiters and cooks or maybe it was the waiter’s fault ??? I guess we will never know.\n\nThis was really the most bizarre experience I have had especially at an upscale restaurant.\n\nThe food is very good here. My rating is low because of the freak experience I had here not because the food is bad . This will probably not happen to anyone else. It did happen to my wife and I."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeFVXNUJZMDFuZUhwYUxWazBZMWxhWDNWa2JtYxAB",
            "text": "Great results and smooth process. Met my expectations."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneU0wNDRkVlYxZWs1amJVUTRlVEl5WWpadmEyYxAB",
            "text": "Outstanding service and food"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkQ2QwUkNOWFZqVkdocGFVc3RVSEJNVm04eFJuYxAB",
            "text": "Love this place!  Feels like you are at a classic, elegant Parisian bistro!  Delicious food, wonderful wine list, and fantastic atmosphere.  Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1QlZWcFVlRXRxYjIxRmFFbExVekJTVjB0cWEzYxAB",
            "text": "Dish temperature right"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMGNYaG9SVXQ0VTFaaFRsRm1SMjV6TkZJM2VGRRAB",
            "text": "Haven't had French food in a long time and I'm glad my first experience in a while was here. Went for the restaurant week prefix and not only was it a great value, but also incredibly delicious. The escargot was exceptional and the bream may have been the best piece of fish I've ever had. Finally the creme caramel was fantastic and I could have eaten 2 more. Great ambiance too and prompt service. Can't recommend enough!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTWQyOHpPRXR4U0doa05sQkJWMU5xV0haUlZXYxAB",
            "text": "This restaurant consistently impresses! My expectations were reasonably met. The team delivered outstanding help once more. Food tasted fresh. It would be nicer if it was bigger. This spot encourages friend gatherings with quality meals."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNFMyVm9PRU53U0ZwNVZHTldjMGxLZDJaSlpGRRAB",
            "text": "Such a nice experience! And surprisingly, they had RW on a Saturday?!!!!\nLoved their escargots but I forgot to take a picture. We also loved the sea bream and the baked cod ❤️ I felt a bit bad yesterday, it took me forever to finish my dish 😂 probably because I had a headache so eating super slowly, lol. But they were so kind and let us continue eating at the bar 🥹, and the bartender even helped us get some nice photos! 🥹🥹🥹\nIt was a really wonderful place to celebrate my friend’s new chapter as she starts her PhD! 🥹🥹"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWME9FaDVja3RpWTBOU1QxVTRkRU5EVTFkSlJWRRAB",
            "text": "We came for restaurant week summer 2025. Service was good (9/10) and the ambiance was very pleasant (9.5/10). We got the green beans appetizer (7.5/10), seam bream with rice pilaf (8.5/10), and the chocolate ganache cake (7.5/10) for $60.\n\nThe green beans in the app were a tad overcooked and soaked in a vinaigrette. It was okay. The sea bream was good but a light portion. I did feel like it was simple enough to make at home for cheaper. I thought the dessert was fine enough. I didn’t like the texture of the cream between the cake layers and it was too sweet overall for my liking.\n\nOverall I would say it’s not worth the price tag in my opinion, and I will not return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRmFWOHhXR0pDT1VkWmVteGhkbkZJUXpSMFpHYxAB",
            "text": "We saw Le Gratin listed on NYC’s Summer Restaurant Week and decided to visit. Every dish was wonderfully crafted and beautifully presented.\n\nThe escargot was phenomenal with a wonderful mix of herbs that made each bite soar. All our entrees were great as well. The Sea Bream was a very unique fish, the steak was perfectly charred, and the cod had a very nice citrus/acid note on it. The sommelier was also incredibly knowledgeable and kind.\n\nThe restroom is quite a distance away from the dining room, but you do get to go through the stunning restaurant/hotel lobby next door!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOemEwNTFRMGhCYVhOdVFsVnBkR2RRVDI1elZGRRAB",
            "text": "Amazing experience, it feels like France ! Super good food and kind staff ! Highly recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzdGEyRk5OREJEVjJwa2RXRktVRlJ5YWpWVldrRRAB",
            "text": "The main dishes are great. Seasoning and sauce on both the chicken and the fish was awesome. I didnt like the flavor of their escorgot so much. The appetizers and desserts are just mediocre to below average for a fine dining restaurant. The service was just ok, not too welcoming but wasn't rude either."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUGVVVmthVGRZT0ZsTmJGbzJUbDlqU0dsVFNXYxAB",
            "text": "5 Beekman Street, Downtown Manhattan (in The Beekman Hotel)\n\nWe visited Le Gratin during Restaurant Week and opted for the $60 three‑course dinner—an absolute steal for the quality and ambiance. We paid $60 each—3/4? I think you meant $60 for three‑quarter meals, but it felt fully satisfying!\n\nFor starters, I had the soup of the day, which was beautifully prepared—warm, flavorful, and a perfect opener. For my entrée, I chose the Dorado (grilled sea bream in beurre blanc sauce), which was delicate, buttery, and paired perfectly with rice pilaf. Finally, dessert was a classic crème caramel (caramel pudding)—silky and just sweet enough to round off the meal.\n\nAn interesting tidbit: the restaurant sits in the Beekman Hotel, built in 1883, and features a stunning atrium with wrought‑iron balconies—stepping inside feels like time‑traveling to 19th‑century Paris  ￼.\n\nHighlight summary:\n•\tCuisine & service: Warm, lively, Lyonnais‑inspired menu, connecting you to Chef Daniel Boulud’s hometown of Lyon  ￼ ￼.\n•\tMenu quality: During Restaurant Week, the three‑course dinner at $60 included soup du jour, a Dorado-style entrée, and crème caramel  ￼.\n•\tUnique atmosphere: Located inside a historic hotel from 1883, the dining room’s architecture and decor evoke old‑world charm and elegance  ￼ ￼.\n\nOverall, Le Gratin delivers soulful, refined French cooking in a gorgeous, storied setting—an excellent place for both Restaurant Week treats and memorable evenings."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vM2RpMTZjWGs0WldvME15MVFabmx3WTJKc0xYYxAB",
            "text": "Worst service I ever had in the city. Very upset experience from that disrespectful 40ish age waitress. It seems she didn’t want to  answer any questions from us, while turned into nice attitude to other table immediately. Very rude and disrespectful. can’t stand it. One more thing to add, our table is shaking at the first time we sat down, and we mentioned to that bad-attitude lady whether we can change the table, she answered as “oh that’s for VIP only”."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWblRGVldPSEkwWm1WZldpMUhNamhLY2pOeVUzYxAB",
            "text": "Another very solid offering from Daniel Boulud. I came to El Gratin for Restaurant Week and had a great time. The space is beautiful and the service was top notch throughout. I started with the soup of the day, a gazpacho that was refined and full of bright summer flavor. For the main, I went with the steak frites. Normally I’d opt for something a bit more adventurous, but I was curious to see what he’d do with a simple French classic—and it hit the mark. The beef was excellent, and the caramelized onion sauce added a rich, satisfying depth. Finished with a lovely chocolate cake and left feeling very happy. All in all, a great experience."
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcVQxTkJWVFpZTUU5MlIwVmpSM2MzZFRJeFpuYxAB",
            "text": "Meilleur restaurant français de New York !\nOn est tombés sur Le Gratin un peu par hasard en se baladant dans le quartier, et quelle belle surprise ! L’ambiance bistrot à la française est rare à New York, ça fait un bien fou de retrouver cette atmosphère chaleureuse et authentique.\nLe steak frites était absolument délicieux. La viande est parfaitement servie, loin des cuissons souvent trop poussées qu’on retrouve ailleurs aux US.\nUne adresse à garder précieusement et à recommander sans hésiter !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRVFYQmtObEZYV1dwWGRtdFRhV1pFTFZWZmIwRRAB",
            "text": "Absolutely outstanding. Le Gratin is a gem in NYC, refined, warm, and full of flavor. Chef Jules Recoquillon’s talent shines through every dish. French cuisine at its finest!"
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dlRWVm5ZbFpZZUU0M1EyZEpaWEkxWWpsSVEyYxAB",
            "text": "Pour mon anniversaire, j’ai eu la chance de dîner au Gratin, où le chef Jules Recoquillon nous a régalés.\n\nUne cuisine française traditionnelle exécutée à la perfection : cuissons justes, sauces sublimes, plats pleins de saveurs et d’équilibre du début à la fin ! Je recommande vivement de partager les plats pour goûter aux différentes spécialités au menu.\n\nLe tout dans un cadre élégant et une ambiance chaleureuse.\n\nMerci !"
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMVREaFNXRGhtUXpGU05HSldURWhpY21aUmNYYxAB",
            "text": "Les plats sont excellents, le service est irréprochable et le lieux chalereux. Le Chef Jules a fait de ce restaurant un lieu d'exception."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTk4wUXdZek5GTkdaUFowRldWamhXU21sWU4yYxAB",
            "text": "Immaculate experience at Le Gratin, huge thanks to international chef Jules for his amazing touch on French classics"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcWRqUk5ZVVZHT0hKa1FYVXRaR1pXZG1rNFJYYxAB",
            "text": "Excellent dense and tasty atm. Solid service but food is superb\nBeef tartare and chicken so beautifully done"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseFJUTkhlVnA0WVhwSmEyUXhaVkozY1ZKdFMwRRAB",
            "text": "We tried the French Restaurant Weeks menu. I had the escargot (the smell of garlic butter when it hit the table was divine), the sea bream (which was so good it has ruined all other fish dishes for me), and the gateaux chocolate (the quality of chocolate and butter is immediately apparent). An excellent meal with attentive service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaMmFISXlVREpwVURCWVRWa3dVMDVJUlRoaVJVRRAB",
            "text": "Le Gratin is an absolute gem. The ambiance is cozy and elegant, and the food is classic French perfection. The gratin dauphinois is heavenly—rich, creamy, and crisp on top. I also loved the duck.\n\nService was warm, attentive. A must-visit if you love French cuisine done right!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGamVrZFpPRXA1V0RSTGNVWTFhVXhKYzFwM1VWRRAB",
            "text": "One of the best dining experiences in NYC. We have lived in the city for 15 years. The food was delicious, the service was great, and the atmosphere was European. We enjoyed it a lot. Thank you."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWWFVNVBNbWhxZFhNMVZUSTBXRzl5YkhRellsRRAB",
            "text": "The atmosphere of the restaurant was absolutely amazing!!! the service was top tier and the servers were on top of everything without making us feel overwhelmed!!! food is an extremely good price point and very delicious. definitely recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOalRFZExUbDlyT1RsNmFGWXRTV0l3VUVSTE5IYxAB",
            "text": "Best restaurant I’ve ever been to"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xblUyMW1jSGwxUjI0MU4waFdVa014TW5WMFlXYxAB",
            "text": "Absolutely beautiful spot for our anniversary dinner! The fixtures, lighting, furniture all come together for a seamless & pleasing French bistro experience. The mixologist served up top-notch drinks, including a delicious take on an Old Fashioned. We started with an amazing beet salad with pistachios & goat cheese dressing. The poulet fermier (half a rotisseire chicken) may be the best chicken dish we've had in years, and it was paired with DB's Mother's potato gratin that was heavenly. We also had their steak frites, and the meat was cooked absolutely perfectly. We topped off the meal with an order of profiteroles (with Gianduja Ice cream & chocolate hazelnut) that was a delight to the senses. Service was outstanding throughout. Daniel Boulud has struck gold here and Le Gratin is one of our very top picks of NYC restaurants. Bravo!"
        },
        {
            "date": "4달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCU1VXVlFORTA0VEZGWGRsQlplV0Z1Y21wdVdYYxAB",
            "text": "Une superbe expérience ! Nous sommes venus en groupe et tout était parfait du début à la fin. Le service était à la fois chaleureux, attentionné et très professionnel. J’ai goûté le poulet et le gratin un vrai régal, parfaitement cuisinés et pleins de saveurs. Une adresse à ne pas manquer pour ceux qui cherchent une vraie cuisine française dans un cadre authentique. On reviendra avec plaisir !"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQamJEZTJnRRAB",
            "text": "Absolutely perfect! I have been there for Thanksgiving and besides the amazing surprise of having the Chef in person opening the door for me on his way out 🙀 everything was absolutely perfect!\nThey have Gluten Free and Dairy Free options so my kid was able to order gluten free bread, dairy free salads and steak with separate dressings and a choices of sorbet!!!\nSuper excited to share this with everyone in need of options without losing the quality!\nThe staff was incredibly professional and helpful in any way!!!\nHighly recommended!!! I will definitely go back and try more dishes!!! Enjoy"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMGNMNGZBEAE",
            "text": "Service was inexplicably horrible. I genuinely don't understand how expensive restaurants like this have such poor service. Our waiter was inattentive and had no interest in explaining or recommending anything off the menu. Our water glasses were never filled once; we refilled our glasses as our waiter walked by us. We were seated at a smaller table, so the dishes cluttered the table; we stacked and cleared our own table. Two waiters walked by, and we stopped a busser to remove the empty llayes. The bussers were great, though, and brought us more water when we asked; they were far more attentive than our waiter.\n\nAdditionally, the sommelier stopped by our table but realized he was at the wrong table and abruptly walked away when we told him he was at the wrong table.\n\nThe hostess at the front was pleasant; the decor of the restaurant nice. The food was great, and this would've been a nice meal and a great experience if there were even a modicum of hospitality."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcWRTbzlRRRAB",
            "text": "Came here to celebrate and treat myself to a nice dinner. My bartender Jon, made my whole experience. He was so engaging, friendly and attentive. I mean we talked almost the entire time about everything it seemed. He made great recommendations for drinks and food wine being in the industry we just had so much in common. Yes the place was upscale and fancy and French, but Jon made me feel very hospitable and comfortable. Honestly I wasn’t completely blown away by the food, but I enjoyed it for what French cooking is known for. I know they love butter, and while I also love butter I felt my rainbow trout was swimming in it and there was just too many almonds. I wanted to really taste more of the fish because it was cooked so well. But I did enjoy the cocktails a lot! Overall I had a pleasant experience mainly because the service was really great and that elevated my time there. Thanks Jon 😁"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBX2F1SUJnEAE",
            "text": "Beautiful french bistro feel with delicious food and good service. Beef tartare was presented unmixed and the server asked if we wanted it mixed. She went to a side bar to mix, wish she would have done it table side. The meat was tender and i liked the flavor but another at our table felt it was to heavy on mustard and too tangy. Bread was perfection, so crispy on the outside and warm and soft inside. Quiche was beautifully done, dark green from the spinach and very flavorful. Not what I am used to for quiche, it was not light and creamy but more dense, not at all bad just different. The omelette was a bit of a disappointment for the guest who ordered it. Was served open faced with some greens on top. We ordered it with ham and  a couple of pieces of ham were laid on top. It looked beautiful and perhaps this is a traditional French way to serve an omelette but it was more like a plain omelette with toppings.  Beet salad was great. Dressed well and the pistachios added the perfect texture. The profiterole was a little disappointing.  It was very dark, I’ve never had one baked as much as this. It was still light and airy on the inside but for me was verging on burnt on the outside.   The service was friendly and attentive and the courses were well spaced. I would like to come back to try more items from the menu."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNjYzb0FnEAE",
            "text": "To be honest, I was a bit disappointed with the bread at the beginning. We had the Restaurant Week dinner course, and the soup was really good. Overall, everything tasted great. Since it was a birthday celebration, they decorated the dessert with a \"Happy Birthday\" chocolate even added a candle, which was a very thoughtful touch."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOT19wYi1mMGZmaGhRRRAB",
            "text": "An amazing experience with Chef Boulud and French Chef Piege for an exquisite “Poule-au-pot” menu. Staff was incredibly kind and food very tasty."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcXBlOWdRRRAB",
            "text": "We celebrated my daughter's engagement with a group that started out as 7 people, then went to 9 people and then to 11 people. I had reserved an extra table for two but we had even two more. The staff was so accommodating and helpful even though it made the serving much more difficult. We had the best time and everyone loved their meals. I can't wait to go back when it is a regular meal and I can focus more on the food. I already know what I want to order. Thank you, Le Gratin for a perfect night."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnX2ZlWldBEAE",
            "text": "This is my favorite among all the Daniel Boulud restaurants in which I've dined, both in NYC and elsewhere. The level of professionalism, the authentic Parisian ambiance, the quality of the food, and the presentation are usually of a high standard. I really cannot recall an instance of having been disappointed with any aspect of the dining experience. The salmon I had on my last visit was truly amongst the best example of this common offering I gave ever sampled. I always order the tuna Niçoise, and have never been disappointed. Their wine list is quite nice, and one can tell it's been curated to pair with the menu selections. I have yet to tire of dining here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQTHMyWlQyOWZINW1nRRAB",
            "text": "An authentic taste of french cuisine in Manhattan. The poireaux appetizer and the loup de mer main course were scrumptious. They transport you back to France with the first bite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5NTZIRll3EAE",
            "text": "I visited this restaurant on two separate occasions.\nThe first time was an attempt at their restaurant week menu but arrived for their brunch. This French toast we amazing and so were the drinks; I knew I needed to come back for dinner and I was right. This fulll meal was so delicious, every part.\nThe bass skin was the perfectly seasoned with the right amount of crisp. The combination of the different flavors in the salad blended so well. And that chocolate sorbet 🤌🏾 perfection."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbFpENi1nRRAB",
            "text": "Daniel Boulud is a genius restaurateur. Every visit to one of his establishments is a delight, and Le Gratin is no exception. The staff here, like at all of his restaurants, are warm and welcoming, creating a dining experience that feels genuine and gracious—far from the pretentiousness sometimes found at Michelin-starred venues. My server at Le Gratin was attentive and kind, making the evening even more special.\n\nThe French onion soup was a perfect antidote to the chill of Lower Manhattan. The rich, caramelized onion flavor was beautifully balanced with just the right sweetness and bitterness. However, I did notice a couple of burnt pieces, which slightly detracted from the otherwise excellent execution.\n\nMoving to the main courses, the duck was tender enough to melt in your mouth and paired wonderfully with the green peppercorn sauce, which added a lovely depth. That said, the duck itself lacked a bit of that signature rich flavor and could have used a touch more seasoning.\n\nThe POULET FERMIER À LA RÔTISSERIE was a pleasant surprise. The roasted chicken sounded almost boring. But I was surprised to it is paired with the Gratin. It’s “Le Gratin”. It has to be great. And he added “DB’s mother” to the gratin. I had to order this dish. The chicken was perfectly cooked—juicy, tender, and infused with a subtle hint of garlic. The gratin, while flavorful, could have benefited from a bit more cooking time to soften the potatoes further and bind them into that luscious, almost creamy texture I prefer. I added truffle to the gratin but don't waste your money for it.\n\nTo end the evening, we were surprised with a complimentary chocolate cake with three layers of ganache to celebrate our wedding anniversary. This thoughtful gesture made the night unforgettable. The cake was rich, moist, and decadent, a perfect finale to an already memorable meal.\n\nOverall, Le Gratin delivers on the promise of its name with comforting, flavorful dishes and an ambiance that makes you feel truly cared for. A few minor tweaks would elevate it to perfection, but it’s already a gem in Lower Manhattan’s dining scene."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNVlyeHp3RRAB",
            "text": "They probably don’t need another glowing review but I have no choice!\n\nI had my parents join my wife and I after we had a our wedding ceremony in City Hall. We were the first clients at 11:45am and from start to finish the kindness of the staff shined through on this very special day for my wife and I.\n\nFrom the champagne to the food, every choice was spectacular. We had too many to document here. The main ingredient to this delightful brunch was the staff. Offering attentiveness and an appreciation for our occasion. We felt truly like a newly married couple having a special lunch with close family.\n\nThe words don’t do it justice. Forgive me for not remembering everyone’s names but the main hostess was a kind French woman who was truly so sweet..:even when my dad was asking if we were gonna receive anything for free. lol.\n\nTwo glasses of\nChampagne later dad is taking a nap.\n\nLoved every moment and dish of the lunch. We ordered so many appetizers and entrees. There are zero bad selections.\n\nKeep room for dessert!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibF9xcWFnEAE",
            "text": "Had a celebratory dinner with my old colleagues. The service was great and really enjoyed what we ordered along with the drinks. Ordered the July special which was highly recommended by the waitress. We finished it off with a few desserts to share and they were all good. The vibe of this restaurant was very fitting of what chef Daniel Boulud envisioned of the bouchons in his hometown in Lyon, France. Glad I was able to check off one of my saved restaurants."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dXMyVWxBRRAB",
            "text": "So, Le Gratin was alright. I love the Beekman Hotel and Temple Court and this is adjacent to Temple Court. This is a straightforward French Bistro and executed everything very competently. Everything was good, uniformly rich and not great which is what I was really expecting. I had the onion soup which I finished half of and the mussels. The mussels were okay hence the review. The other person in my party had escargot and chicken and they were likewise both good but less than we were expecting from a Boulud restaurant. One thing is they have an awesome room!!!  This all being said, if you’re in the mood for French Bistro food, this is the one in lower Manhattan."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MV9leFBBEAE",
            "text": "Food was absolutely delicious and service was amazing. The space was a little crowded for my liking but the overall experience was excellent.\n\nWe ordered:\nPlanche De Charcuterie - all of their pate was delicious.\nSoupe A L'oignon Gratinée - French onion soup was a must!\nEscargots et Pied de Cochon - this dish was my least favourite of the night. I did not like the breading of the escargot, but the mushroom and sauce in the dish were delicious.\nMagret de Canard - duck breast was cooked perfectly and so so tender.\nMoules Poulette Saffrannee - the white wine sauce paired perfectly with the fresh steamed mussels.\n\nI would do without the escargot next time but overall, it was a great dinner experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURid3I2WjRnRRAB",
            "text": "Great food I was impressed! This is a good option to go for a nice meal, we went for a birthday! We had the restaurant week menu, which had more items than the menu online which was a nice surprise. We ordered the charcuterie and the burrata salad, they accidentally brought us the soup instead of the burrata but they were quick to fix it. The burrata was melt in your mouth, and the charcuterie was different than I expected since it had pate but it was really good! The coq au Riesling was great I highly recommend! The chicken was fall off the bone tender and the sauce was super flavorful. You could taste the bacon, mushrooms and onions. There wasn’t a lot of gnocchi in the dish but with 3 courses I was okay with it since it was a lot of food already. The steak frites was good, but not my favorite steak frites I have had in NYC. The fries were hot but not super crispy. The chocolate cake was the star of the meal. We loved the rich chocolate flavor with the hints of coffee. Overall a positive experience and the restaurant week was a good deal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibXRlQW9RRRAB",
            "text": "A strong 5 stars restaurant. Location very classy. You travel immediately when you enter.\nService is very cordial and attentive, all work together. Food spectacular. Difficult to choose from the meal but top would be salads lyonnaise and gratin. But duck Magret was exceptionally melting in your mouth! Too difficult to rank!\nManager, she was very sweet and always checking on all tables. Nice interaction with the head sommelier too and the help servers.\nTrully a great experience last night."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NzVXR0V3EAE",
            "text": "Ordinary and vastly overpriced. I have lived in Paris, so when I was traveling through New York on Christmas Eve I thought I would treat myself to a nice French meal. I left disappointed. The highlight was the scallop crudo to start which was delicious. The sommelier also recommended a nice wine but all of the wines were obscenely overpriced, probably marked up 3x. I was really looking forward to the Dover sole for dinner, expecting it to come whole and sizzling to the table. But it was tepid! It must have been reheated and poorly at that. Then I had apple tart for dessert. A typical safe French dish I thought. But again it was lukewarm. Only the top layer had been heated. Most was cold and raw apples with a bit of apple sauce in the middle and bland pastry. I didn’t bother eating it. Given how expensive this meal was it was exceptionally poor value."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaVp6U3hBRRAB",
            "text": "Good hearty food.  Enjoyed the tuna Nicoise, fried escargot, and cassoulet.  Service was also excellent and great ambiance as well.  Only complaint is the seating is very tight."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOW9IYm13RRAB",
            "text": "Went here for our anniversary.  We love French food and this did not disappoint.  The décor is very authentic French of what you would see in Paris.  The food was great.  We had an ample choice of 1st and 2nd courses.  I highly recommend you get the chicken as it was prepared perfectly.  The soup was just right.  The Au Gratin potatoes are not to be missed, well worth the calories.  Our waitress was great.  She was able to guide us through the menu and ensured we had a great dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibWM2VVNnEAE",
            "text": "Really enjoyed my dinner there, the building is classy and the food is delicious, authentic French and with some creativity. It’s pet friendly too so I can bring my puppy with me. The bar next to it is also pretty, think I want to check it out next time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeUpITG9RRRAB",
            "text": "Great ambiance, great foods, great experience!\n\nThis French restaurant’s chef Daniel Boulod perfects his menu. I like that it’s next to a chic Beekman Hotel, with a lovely interior and live Jazz music to entertain in the restaurant lobby."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLX0s5N1AzN2VLWnJnRRAB",
            "text": "Had a fantastic dinner at Le Gratin, cozy, stylish, and full of charm. The food was spot on with a must to try: gratin dauphinois perfectly executed.\n\nA warm and attentive service. The wine list had some great French picks that matched the food perfectly. It’s the kind of place you’ll want to come back to relaxed, authentic, and seriously delicious. Merci to the chef and his whole team!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCM1pHSGZ3EAE",
            "text": "The executive chef is simply the best cook in NYC. The food we ordered was just amazing, super balanced and with extraordinary flavors. IMHO it's the best french restaurant in the city. The ambiance is great, you feel in France, and the staff is super welcoming. You can come here either for a date, with friends, or for business, this place is great for any occasions!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxek5YYWpBRRAB",
            "text": "Very charming place! The hostess is very sweet. The service was fantastic. Everyone is very polite, although a bit slow paced in general. The Scrabbled eggs with truffle were very tasty. Just keep in mind that because this is a French restaurant, these are not your typical hard scrabbled eggs; they are soft and a bit runny... Reminder me of polenta in texture. If you're ok with that, you'll like the flavor. The omelette was good. The French toast brioche was excellent if you're opting for something sweet. Loved my coffee."
        }
    ],
    "reviews_count": 75
}