{
    "name": "Chambers",
    "place_id": "ChIJ43KaxzxbwokRVjbWT05nZ_M",
    "grid": "MN1",
    "address": "94 Chambers St #1, New York, NY 10007, USA",
    "rating": 4.7,
    "user_ratings_total": 308,
    "phone_number": "(212) 580-3572",
    "reviews": [
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMmJVbHlWRkZLZVZRM1pFa3RhblJGWkhwMVUwRRAB",
            "text": "The cauliflower and scallops were like nothing i’ve every experienced. Unforgettable"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205amNHaEZiR1JrWjBwUmFuaHJXa28yYW01SmJXYxAB",
            "text": "The restaurant delivers on all fronts consistently. The staff performed well. I trust the quality of this restaurant. Each bite melted in my mouth with flavor. Friendly service, great food, and fun area!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRVVqUkdkMjVqUWpkbE0zWmlTRXhGT1ZNMWNYYxAB",
            "text": "Had NY strip wife had the porterhouse portions were great, steak cooked to perfection and the service was exceptional"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKYU4zWkxXR05IUlVZd1RqbGlURUZpTVZCM01WRRAB",
            "text": "This dinner was a night to remember! From the food and wine, to service and atmosphere... Every moment, every bite, every sip was to be savored and an experience in itself. The food was some of the best you'll find in the city, cooked to perfection. Our server, Ivan, took excellent care of us. But the star of the evening was Sommelier, Pascaline Lepeltier. She easily has the best palate in the world and no one knows wine better than she does. We did a wine pairing with our meal, knowing everything she would bring us would be again, perfection. She did not disappoint and brought so much culture and class to our experience. We appreciated so much learning about everything she brought us and it only made this experience better. One we shall never forget. We finished our time here, having dessert and tea at the bar. Even the tea paired beautifully with our dessert and just like everything else we had all evening, was mind blowingly delicious. We will be sure to visit Chambers and Pascaline again on our next visit."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxU1ZYQjVkVWhwZFZoUU9DMDVUMFZCZVhOdVZYYxAB",
            "text": "Absolutely fantastic"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSVZHUmpZekowYURCTGVHRnVkRlowTW1waE1rRRAB",
            "text": "Chambers is effortlessly cool. The menu is smart and flavorful, and the wine list is one of the best around — tons of unique, natural picks. The vibe is laid-back but stylish, with great music and energy. The staff know their stuff and make you feel right at home. Perfect for anyone who loves good food, great wine, and a chill night out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUGRGTTVjbWQzV1VKM1MzQjFRVmszYjAxVldXYxAB",
            "text": "Tucked away in the heart of Tribeca, Chambers exudes understated elegance and warmth from the moment you step inside. The inviting atmosphere immediately sets the tone for an exceptional dining experience.\n\nOpting for the chef’s counter was a highlight—there’s something mesmerizing about watching the team work in perfect harmony, crafting each dish with remarkable precision and care. The menu showcases a refined balance of flavors and textures, with every plate reflecting both technical mastery and genuine passion for the craft.\n\nThe wine selection is thoughtfully curated and complements the cuisine beautifully.\n\nIn my opinion, Chambers is thoroughly deserving of a Michelin star—an accolade I do not offer lightly, having dined at some of the finest Michelin-starred restaurants around the world."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMVpEbE1abU5MVTFWa1dXVkNNa0o2T1Y4dFVIYxAB",
            "text": "We went to Chambers to meet the som Pascaline Lepeltier.  Alas, she was off competing and winning the opportunity to represent France at the 2026 ‘Best Sommelier of the World’ competition.\n\nSo the wine list was extensive.  We went with one of Noella’s fine whites LBL.  If you know you know!\n\nGreat food.  It was my birthday so we also had cake."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFdGNFSkNPVkJhZFdGdldEbDRVM0IzY0ZOd1ZYYxAB",
            "text": "Stumbled upon this place, they fit us in without a reservation during the week. Unbelievable food, front of the house was the best service, hands down of our trip to the city."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWV09WTk1VbVpQWmpWTU1YaHViSFp4YjJOYWJsRRAB",
            "text": "Consistently blown away by every dish served at Chambers. The food is innovative, delicious, and the open kitchen counter seating makes it truly a one of a kind experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUVdVZFZWeTB5TjB4Vk5VVlpYek14YjBaelNVRRAB",
            "text": "Incredible evening with luscious food and cocktails."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRWMyUlhlbXRWZFcxM1prdFFORVZtU0ZCMFFrRRAB",
            "text": "Everything here is top notch. Esoteric and delicious wine that goes perfect with the ingredient driven menu. Service is perfect."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTFVtSkZRV1Z6V213MFJFd3pPVVJwTFRsSU9XYxAB",
            "text": "Couldn’t have asked for better. Felt welcomed the moment I walked in."
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQmNrVk5jbEZHV1V4TVExY3pMVEJzUVZCQ2FWRRAB",
            "text": "Un restaurant où l’on voudrait rester des heures. Tant pour les plats, que pour l’ambiance et le service. Quel bonheur de ne pas se sentir dans le rush de NY et de pouvoir se poser pour savourer des ingrédients de qualités magnifiquement assemblés. Le tout, sublimé par un Chenin Blanc minutieusement choisi. Pur moment de kiff.  Merci !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQ1lsVXRjMng2WlRoelIxRXdVbkF5YjIxTmFVRRAB",
            "text": "This is already my fourth visit—it’s my favorite restaurant in Lower Manhattan!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TFprbDZiVFZ1ZWxKRFFuTlNjRlk1WWtwV2IzYxAB",
            "text": "We sat at the chef’s table, and everything was amazing. Zucchini, shortbreads, pork chop, all the sides — and I’ve never been somewhere with such a focus on chartreuse. We got a flight of vintage chartreuse and it was so fun. I can’t wait to go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbVptRnNlalZxT1cxcWVtUnlMWGd6WTNsbFpVRRAB",
            "text": "The host was very accommodating and kind, and the food was flavorful and fresh. The ambience was excellent. However, the portions were on the smaller side, and the service was impersonal. Our server barely made eye contact and seemed to be going through the motions. She lacked the basic warmth one might expect when paying a premium at a top-tier NYC restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWE9EUjNRM0JHWlVadllWUlBOMjFxYzBkT2VIYxAB",
            "text": "Everything was amazing. We ordered the fluke crudo, sweetbreads, tilefish and bratwurst. All of which were cooked and seasoned perfectly. The sweetbreads were my favorite, they were perfectly poached and the grilled lightly on a plate of sauerkraut and turnips. The bratwurst was a close second with agretti and clams. At $40 some odd dollars for a sausage I was a little skeptical but it was sizable and a healthy portion of clams. I’d honestly prefer that bratwurst to most bistro style steaks around that price point.\nService was courteous, prompt and unpretentious. Cocktails were good, but the wine list is deep and priced fairly. The wine guy was good, a pulled an excellent bottle that hit all the notes we were looking for.\nReally incredible place, cannot recommend enough."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVWEyUjRkUzB5ZUZndFRsZGhhbE5YYkZsbFlsRRAB",
            "text": "Amazing wine list, amazing food, fantastic service.!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUFgzYzNTbUZzVUZBdE5XTk5PREI2UTJab1FWRRAB",
            "text": "I visited for my partners birthday and had a fantastic experience from start to finish. The staff was very accommodating, especially when I needed to correct a reservation mistake I made through OpenTable messaging. They handled\nit promptly and professionally.\n\nThe service stood out as the highlight of the evening. The sommelier took the time to understand our preferences and recommended a French white wine that paired beautifully with our meal. We visited during that 100 deg heatwave and they only poured in small amounts throughout the night to ensure it stayed chilled. I think 3 or 4 different people came to pour us wine a couple times each, making sure we never had an empty glass. Attention detail was impeccable. Talking about the heatwave… they may need to find a better balance with AC for the summer months. We were sweating at the table a bit but we understood the circumstances weren’t typical.\n\nWe ordered nine dishes total, including a complimentary sesame bread. Seven of them were outstanding. The only two that didn’t quite meet the mark for us were a side of potatoes and the Berkshire pork entrée. The pork was a little too salty and underwhelming.\n\nBut by far the standout dish was the snow dance chicken. Easily one of the best I’ve ever had, and I’m pretty sure every table ordered it too. It had a unique, almost Thai-inspired coq au vin vibe that was incredibly memorable.\n\nFor dessert, the mascarpone was insanely good. Would go back just for that and the snowdance chicken.\n\nWhile the atmosphere wasn’t exactly my preference. the quality of the food and service more than made up for it. Highly recommend for a special occasion or elevated dining experience.\n\nCongrats Chambers for hitting the NYT Top 100!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGblgzRjFPRWhWYTNBMWNWbGFTVnBWVG5jdGIwRRAB",
            "text": "Very loud.  Smaller menu, food was good though nothing extraordinary, would probably give food a 4.25 rating.\nThe desert items we had were extremely weak.  Why are you putting basil in your chocolate cake - just trying to be trendy?\nHuge wine list but not descriptive at all.  Sommelier was good but some of us would like to narrow down our wine choices ourselves before calling over the sommelier so we could ask more intelligent questions."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPdlg0Y0t0NEtlSllREAE",
            "text": "We got a few dishes like garlic chicken, bratwurst, butterbell potatoes. They were fine but not worth the price. The bratwurst tasted artisanal but doubt you would have to pay $42 for an undercooked sausage with herb notes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQlEzbGFMWFJOV0djd2QxQktkMWhDTmtONlNHYxAB",
            "text": "What an incredible evening! Can’t say enough good things about Chambers except we can’t wait to go back!!\n\nIt all started with my call to the maitre d’ when we realized we were going to need a later dinner time. He was incredibly accommodating and asked me if the new booking would work for us. Wow.\n\nWe sat at the bar and loved every minute of it. Brian, the head bartender, and his colleague worked like a dream- creating dreamy creative cocktails and giving thoughts on menu selections. Quite the balance and they did it perfectly!\n\nThe food was to die for (thanks to the bartenders’ recs but as we soon realized you can’t go wrong with anything there!)! The flavors were second to none- creative yet not taking away from the true taste of the food itself too.\n\nThe energy at Chambers is one I will always remember and why I love New York so much! The staff, the customers, the food and drink, the service, and the music- it was the best!! Thank you!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZUl6T25wN19qTzdBRRAB",
            "text": "This is top notch from food to wine to service… atmosphere and vibe take it over the top … somebody knows what they’re doing.  A+"
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLTFg5LTNueF9TdGFnEAE",
            "text": "Un merveilleux moment au Chambers ce soir. Une proposition culinaire de très haut niveau faite  de saveurs intenses, fruit d’une cuisine innovante, originale, techniquement aboutie qui laisse toute sa place à la qualité des produits. Rien à envier aux meilleurs restaurants français (nous sommes français). J’ai particulièrement apprécié les gambas en entrée ainsi que le ris de veau, le tile Fisher et le Coffee cake. Évidemment une mention spéciale à Pascaline LEPELTIER, la sommelière du lieu, qui nous a proposé un accord mets et vins que nous garderons longtemps en mémoire. Pour ma part, mention spéciale au saké et au Enfield wine.\nUn très Grand  merci à toute l’équipe, à l’unisson (accueil, service et cuisine), qui nous a permis de passer une soirée exceptionnelle."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOR2NxTEQ0dmRqc3VnRRAB",
            "text": "I’ve been here a few times and live locally and this place always exceeds my expectations, the food is fantastic and the ambiance is just perfect.The staff there go above and beyond to make for a great dining experience, the person next to us at the bar said he comes down from the upper east side for the food and the staff which is very telling definitely recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPckNwOF9YX2ZMVzh3RRAB",
            "text": "Chambers is a very special restaurant, with one of the best wine lists in NYC (especially its section on Loire Valley wines) and incredible food. It's become my good-to dinner spot whenever I visit NYC. The service is incredible, and the sommeliers' depth of knowledge is awe inspiring. If they have the coffee cake dessert when you go, definitely make sure to get that."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKNjc5ODZzdTUzdHVnRRAB",
            "text": "Unfortunately a disappointment. Starters uninspired (salad with sour vinaigrette, shrimp with mayo), main courses better (chicken and fish) but the sauces not perfectly seasoned (too sour). Service ok.\nSorry."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQaVVfZmVNZ2NYZFF3EAE",
            "text": "Excellent food, good atmosphere, never gone wrong going here! Little on the pricier side but well worth it. Usually able to get in at the bar for 2 by walking in, but depends on the time you go as well. Cocktails and wine selection are very good. Service is excellent every time!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNN1M3NWlvanJ5S3B3RRAB",
            "text": "Perfect, versatile ambience great for a date, dinner with friends, work, dinner, dinner alone.  Love the truncated menu made it easy to order. Wood also made it easy to order was that everything is so damn good. Love how they rotate the menu seasonal leave, but have some restaurant staples which of course I ordered and of course we're perfect. The focaccia is no joke. The beef salad with anchovies was a crazy combo that I never thought I would have and was superb. Definitely a salad to try. What I love about chambers is that every thing on the plate had a purpose and served it purpose to the upmost excellent. The prawns with the pickled peppers were genius. Get that sausage entrée while it's around this winter. The snow dance chicken is absolutely THAT good. Don't sleep on that coffee cake. Definitely an odd thing to see on a menu especially a fine dining menu, but it was so unique and scrumptious. I was so full, but could not stop eating it.\nThey also have an extensive nonalcoholic beverage list , especially nonalcoholic wine, which I really appreciated as its rare to find. The semi plume NA wine is divine with the flavors offered at chambers."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcnU2WUNhODVTcEpnEAE",
            "text": "My boyfriend booked a last minute Friday night reservation and I was absolutely blown away how good this meal was! Loved sitting at the chef’s counter, which was the perfect vantage point to watch the care and detail behind every dish. We started looking at the wine menu and realized the 80+ pages was beyond over our heads, so the in house sommelier was incredibly helpful in guiding us to a bottle.\n\nReally enjoyed the complementary bead—it was warm, soft, and topped with sesame seeds that added a nice flavor. We tried a bunch of dishes: fluke, little gems salad, spring onion with bbq almonds, pasta special (which was an unreal bolognese), and the snowdance chicken. Every dish was so so good! Portions were on the smaller side, so I’d recommend getting a few things to try if you’re very hungry. For dessert we split the coffee cake which was delicious.\n\nHighly recommend trying Chambers if you’re looking for quality food with a nice atmosphere that’s not impossible to get into!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaHF6VWJnEAE",
            "text": "Wonderful experience at Chambers. Great food, great service, and an incredible Sommelier (had a fun, informative, real conversation that helped him pick a couple great bottles for us). Between the four of us we had a good sampling of the menu and everyone was extremely happy. My boudin blanc was my favorite. Our table could not have been better, a four top that offered us a quiet(ish) corner with a great view of the small restaurant. Cannot wait to get back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNkxPZHJ3RRAB",
            "text": "Loved everything! Chicken was amazing!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKanR6ZW1nRRAB",
            "text": "Always a great wholesome, clean and delicious meal at chambers. The kitchen excels at balancing flavor with clean presentation and great sharable options.\n\nLove starting with the soft and fluffy bread - which is a great vessel to mop up any of the appetizers.\n\nThe menu is often evolving but favorites include the seafood hamachi and the chicken.\n\nDesserts are usually always innovative and delicious, and the cocktail list is great.\n\nIt's a great place to come on a date, work meal, or with a small group. The atmosphere is cool but it's also easy to have an intimate conversation, or enjoy company at the bar, or watch the magic happen as you look over the kitchen."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNGZqWXp3RRAB",
            "text": "Just had an incredible dinner at Chambers in NYC and I’m still thinking about it. Lately, I’ve found myself going back to the same few restaurants—not necessarily because I want to, but because so many new places haven’t really impressed me. Chambers completely changed that.\n\nThe vibe is warm and stylish without trying too hard, and the service was genuinely top-tier. Our waiter, Angel, was amazing!! Attentive, easygoing, and made the whole experience feel effortless. The food was elevated, and just really special. The crudo was fresh and beautifully balanced, and the coffee cake (yes, get the coffee cake) was an unexpected highlight.\n\nDefinitely one of the best meals I’ve had in the city in a while. Can’t wait to go back. Not sure how they don’t already have a Michelin star."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMHYtdUlREAE",
            "text": "I went for my anniversary. Everything was perfect! We enjoyed the food, desserts, and ambience. We'll definitely return."
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOTlTZUxnEAE",
            "text": "Nous avons été déçu de ce restaurant qui nous avait pourtant été recommandé par des amis. Les plats sont bons mais trop basiques et non à la hauteur du prestige que prétend le restaurant et des prix.\nNous avons goûté\n- Les gambas: bonnes mais trop simples\n- Le riz de veau qui se veut comme le plat star du restaurant est décevant : trop simple et le dressage est brouillon\n- Les pâtes au ragu: le ragu était bon mais les pâtes mal cuites\n- Le plat de porc: sec et trop cuit\n- Seul le dessert ne nous a pas laissé indifférent - un gâteau accompagné de glace à la cardamone, ce qui était très original\nEn somme, rien n’est mauvais mais quand on fait de la cuisine simple, l’exécution doit être parfaite or ici ni les saveurs ni la cuisson ni le dressage n’est à la hauteur, et ce pour un standing prix élevés.\nC’est dommage car le cadre est très charmant et le service était top. La carte des vins est dense, la sommelière très compétente. C’est dommage."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvd08zOXZRRRAB",
            "text": "No words. Exquisite.\nTeam, service, details, food, wine, vibe…\nDo yourself a favor and visit them if you happen to be in nyc"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeThHNFFnEAE",
            "text": "overrated"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaThleUd3EAE",
            "text": "Really tasty, inventive food. The ambiance is hushed in a nice way, very relaxed and calming. You can actually talk to your company without yelling, even though the place is small. Feels upscale without being pretentious. Great wine choices. Love this place!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOG8yaEJ3EAE",
            "text": "As one would expect, the service is excellent and the wine list / drinks are the showpiece. While the food can be very good, what we liked varied a lot, course wise."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3azduRERnEAE",
            "text": "The food was excellent. This restaurant clearly has serious pedigree; at times I felt that its “neighborhood restaurant” self-denomination was not totally sincere.\nOverall, very good; though I did wish our dinner had been been more memorable and the front-of-house experience slightly more warm/welcoming."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3N3ItQ1V3EAE",
            "text": "I wanted to come to Chambers for a long time now and hopefully I did ! The restaurant is amazing. The staff was great. As for the food, it was marvelous. I took a main plus a side and a dessert, which was more than enough for one person. Everything was delicious. I recommend this place a 100% !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OXNpem5BRRAB",
            "text": "Such a treat to have this jewel in my neighborhood! Food is amazing, staff so nice and friendly and just a great, chill vibe. Highly recommend!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdV9ISl93RRAB",
            "text": "5/5 would easily recommend and excited to come back. Thanks for the great meal (:"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbTR6ODNBRRAB",
            "text": "This place keeps hitting its stride. Thoughtful, well-executed dishes that are as delicious as they are refined, paired with one of the best wine lists in the city—made all the better by sommeliers who are truly at the top of their game. They don’t just guide; they elevate the entire experience with insight, precision, and a knack for finding the perfect bottle. Service is seamless, striking that ideal balance of attentiveness without intrusion.\n\nWhat really sets it apart is how effortlessly it blends fine dining with a relaxed, welcoming atmosphere. Last night, the table to my left was savoring a 1948 dessert wine, while to my right, a mother and daughter played Uno as they waited for their food. Somehow, both felt perfectly at home.\n\nIt’s the kind of place that makes New York special—elevated yet unpretentious, serious about food but never taking itself too seriously."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRejlfWDBBRRAB",
            "text": "Good food, good wine list, service was sub par and abrupt, particularly with respect to the sommelier.  We live in the neighborhood and were excited to try such a well reviewed restaurant, however I don’t feel inclined to return."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN2VudzJBRRAB",
            "text": "Very good wine food combinations , great wine list"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBd3RUSm13RRAB",
            "text": "Another outstanding meal at one of our long-standing favorite restaurants in the city.  First-rate inventive food, superb sommelier and wine list, excellent service and atmosphere.  Thanks - we look forward to returning!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMF91VnF3RRAB",
            "text": "Had a wonderful pre-theater dinner here with my family. Great food and a beautiful setting."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbzZ5Szl3RRAB",
            "text": "@lydieats 💕 Delicious dishes, quality ingredients, elevated vibes, and just a curated dining experience. Love that it’s a calmer space so you get to hear each other speak without yelling. Perfect for smaller groups!\n\nStarting with the fav, you NEED to get the mascarpone dessert. Layers of crispy phyllo, scrumptious creme with caramel and lemon pistachio crunch 🥰 It’s that perfect sweet bite and the diff textures come together effortlessly. Another must is the chicken (and I don’t even like ordering chicken). SO tender and juicy with the most amazing skin. A lot of flavor too from the sherry& thyme sauce.\n\nFirst round of bread is complimentary and let me tell you this is some GOOD bread. Sesame pizza bianca on paper so simply said, chewy pizza crust🔥 Simple yet perfectly executed. Solid salad but the smoked breadcrumbs takes it over the top. As for the rest, pork is good just a tad salty. Hamachi is good quality just not as exciting.\n\n💕 mascarpone $15*\n💕 snowdance chicken $38*\n💕 little gems $18\n💕 berkshire pork $39\n💕 summer squash $11\n💕 hamachi $22\n\n먹태기였다가 여기서 먹고 완치됨. 역시 내 취향은 모던 깔끔한 와인바인가 🤭 분위기도 잔잔하고 디쉬들도 맛나고 퇴근하고 릴랙스하기 완벽한 공간이다. 모든 요리가 기본기 탄탄한 느낌? 심플한것 같으면서도 풍미로운데 살짝 짠건 미쿡이라 어쩔수없는듯. 베스트는 식전빵이랑 치킨 & 마스카포네 디저트. 요거 3개는 꼭 먹기. 특히 치킨!! 너무 촉촉하고 부드러움. 밀푀유처럼 생긴 디저트는 phyllo 도우를 사용해서 완전 바사삭 부러진다. 가벼운 크림이랑 카라멜 조합이 퍼펙트 💯"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcGZ6MWJ3EAE",
            "text": "Bread was absolutely fantastic and the wine selection was great too. Sommelier was very knowledgeable. Unfortunately the ragu special we had was so salty that we couldn’t eat it. The pesto pasta was extremely salty too. However they were super understanding and took it off our bill. I’m pretty sure this was an only tonight accident because otherwise the flavors were excellent. Service was fantastic as well they were super attentive. We ended up asking for more bread though because it was phenomenal. Ambiance is great!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcXUtelhREAE",
            "text": "We read many good reviews about Chambers before our meal, and in turn had high expectations.\n\nService was good; the wait staff were friendly and attentive. Our issue with our dinner was with the saltiness of the food. The flavors were definitely unique and interesting; however, we found our dishes to be very salty. I think we were honestly in shock since we did eat everything even though we kept remarking on how much the salt was overpowering the rest. This is in regard to the Manila clams, but also the greens that accompanied the well reviewed chicken dish. If we were more experienced diners, we may have sent back the dishes.\n\nThe other dishes that we had (hamachi and the monkfish) were better balanced, and the mascarpone dessert was actually the highlight of our meal.\n\nIn hindsight, we were a bit disappointed since we only enjoyed parts of the meal, and left wanting to retry just one of the five dishes.\n\nNot sure if we will revisit to try again, but hoping our experience was just a one off since people do seem to truly love this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxd2Z1bTdRRRAB",
            "text": "Without a doubt this place is a must try if you want a elevated dining experience. I recently celebrated my mom's birthday at this restaurant, and it was a truly 5-star experience! We indulged in a variety of dishes from the extensive menu for a party of four, and every bite was exceptional. Even my mom, who can be quite discerning, had little to no complaints. The atmosphere is perfect for special occasions like birthdays or date nights. Me and my party of four managed to try the entire menu including having all of the desert items in one sitting. My only regret is that I didn’t have any to take home for leftovers ☹️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmeU8zeU13EAE",
            "text": "I want to shout from the rooftops about this extraordinary gem in NYC's Lower Manhattan - just a stone's throw from City Hall. The general manager of a midtown restaurant recommended we try it because of its extensive collection of Chartreuse and great wine list. To enjoy a dinner with rare 1960s and even a sip of an even earlier bottling of the French liquer would have been worth the trek  from UES, but the food alone overseen by head chef John was brilliantly conceived and full of flavor. Each dish was lovingly crafted and presented professionally by the team at Chambers. The divine tuna and equisitely dressed kohlrabi salad were wonderful starters, but the halibut with sunchokes and cheese gnudi entrees were delicious. Desserts, prepared in front of us at the kitchen counter seating, were amazing finales to start iur new year obsession with this special restaurant. We cannot wait to return often as we understand that the menu changes often even though the sommelier in chief's wine list remains a constant that will impress most connoisseurs."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNVlyYldBEAE",
            "text": "Great, amazingly tasty dishes! Every dish was very well executed and packed with flavor. My favorite was the Berkshire pork loin.\n\nOur server who took our orders was attentive and friendly. However, the rest of the servers, who delivered our dishes, were aloof and even borderline rude. Often they would put the dishes near the edge of the table and walk away without a word, without placing them so each of us could easily reach them. It's a shame because the meal was excellent otherwise.\n\nThe ambiance was nice. It has a modern, but relaxed vibe.\n\nOverall, I'd recommend. But the service makes me hesitate to go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidDRfNE1REAE",
            "text": "Best meal of the year for me. Absolutely worth every penny.\n\nWe took an amazing wine tasting class with Pasqueline and then had the opportunity to dine at the bar. Staff is quite knowledgeable about the food & wine.\n\nWe dined pescatarian: Highly recommend the hamachi crudo, squid, tilefish, tomato salad, and the phyllo dessert.\n\nEverything was high quality, fresh and flavorful. Stunning wine list 🤩 We left full and happy and did not feel heavy.\n\nI cannot wait to try more of the menu, especially as the seasons change."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNHJudGxnRRAB",
            "text": "Always an incredible dining experience at Chambers. Elevated cuisine, reasonable pricing for what you get. Extremely extensive and well curated wine list. Pairings for anything you can think of. Service is great, not pretentious and very light hearted which makes the experience very chill."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMy1MODRBRRAB",
            "text": "There's something serendipitous about walking past a restaurant in New York that you haven't heard of and can barely notice from the street and it turning out to be a gem.\n\nI would eat in this place even if the food were terrible because the acoustics were so good! Okay, I'm lying, but this is a lovely restaurant and you can hear each other!\n\nThe owner / manager, Jared was gracious and funny. The entire atmosphere of the restaurant is very chill. Even when it got busy there was still this calm and it was never crazy noisy.\n\nI was very intrigued  by the sign over the bar that kept changing, like the ones you find in a train station. Very nice touch!\n\nThe cocktails were elegant-looking and delicious. The names were fun and the flavors made you want to drink a pitcher of them. I resisted also getting the Tiki Or Not Tiki like rest of my group. Garnish was simple but striking -- a leaf of shiso in a glass with a large ice cube. They both loved it!\n\nI had the La Capilla which was a tricked out Paloma. The garnish was a sumac and salt edge around half the glass that I licked off happily.\n\nChambers is like a neighborhood restaurant that you want to go to over and over. The food looked beautiful when it hit the table and each dish was well executed without being over handled. The bread -- sesame pizza bianca -- will make you cry. At first, I thought, \"No butter?\" Then, I tasted it and thought, \"Damn, that's good!”\n\nWe had four appetizers, four mains, all the veggies, and two desserts.\n\nLoved the beets with one of my favorite blue cheeses ever the Bailey Hazen blue from Jasper Hill farms and smoked panko.\n\nThe escarole salad was gorgeous looking. Tender yellow escarole that looked a bit like tulip petals and popped with the carrot slices and the pickled orange peppers.\n\nManila clams in a celery root curry with stinging nettles, who'd of thunk it? Very tasty!\n\nThe mains were all solid. Great ingredients done well so they make you happy to eat them.\n\nThe chicken was perfectly cooked, beautifully browned, topped with spinach on a puddle of sauce.\n\nThe sauce on the sea bass was just really well done. Meyer lemon bernaise equals dreamy.\nThe beef was tender and delish with spring alliums and mustardy potatoes\n\nOne of our party was allergic to mushrooms so we had to eat more of the pork tenderloin. I love that it wasn't overcooked. Pink pork can be a little off-putting for some but it was really good.\n\nBe sure to have the veggie sides.\nI'm going to recreate the sweet potatoes at home tonight. Asparagus were all dente with an excellent anchovy mayo. The carrots were sticky with a tumble of toasted pistachios and fresh herbs.\n\nWe had to Google the ice cream flavor, bordiga centum herbis = 100 herbs, served with the flourless chocolate cake because our Latin was rusty. It balanced really nicely with the bittersweet cake.\n\nWe demolished the marscapone and phyllo Napoleon --crispy, creamy & yum!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdF9iQ2tBRRAB",
            "text": "Really one of the best restaurants we’ve been to since before the pandemic. We felt excited about every dish and the wine was magnificent. Warm, down to earth but professional staff and a comfortable, not stuffy setting. A truly special experience, we look forward to going back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeHVlV0hBEAE",
            "text": "Probably THE best meal I’ve ever had. The food had so much flavor! We literally licked the chicken plate clean. The bread with sesame was insane. I could have ate that all day happily. My wife and I were just blown away. 🙏🏽 If you haven’t gone yet, you should."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlN2VTWWVnEAE",
            "text": "This restaurant has been a great new discovery. The wine program is simply amazing with the depth and variety that it has to offer. Despite the long list it’s also very well curated with both reasonably priced bottles and bottles for a…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteTlpcy1nRRAB",
            "text": "Excellent resty with a great and interesting wine list! All the food was delicious and well executed. For the service, our waiter did not have a lot of personality, we had to ask the questions rather than him guiding us as it was our first time. If service is improved, I expect many more accolades for this place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNWZxTHdnRRAB",
            "text": "Chambers is a new restaurant in Tribeca. We visited on a rainy night and it was still packed. That is always a good sign.  We were greeted and seated quickly by the friendly staff.  Drink orders were taken with ample explanation for those of us with questions about the offerings.  We had a few minutes to enjoy conversation within our table before the waitperson approached us about our appetizer selections. Again, we were given answers to our questions. The food selection on the menu was limited, but extremely delicious. Fish, pasta, meat dishes were chosen and were all excellent.  Everyone was very pleased with the food.  We shared the mascarpone dessert together and we all enjoyed it too.\n\nThis is a great restaurant with great service and great food.\n\nHighly recommended."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeS1ueEV3EAE",
            "text": "Chambers is a breath of fresh air in a city that is doing too much with everything. The ambience is simple and refined, the service (the service!) is attentive and helpful, and the food lets the ingredients shine while still giving the wow factor of complicated preparations. It’s amazing that the team here has kept a neighborhood feel despite the high level food coming out of the kitchen. Gold medal to the bar team — you won’t get better bar service anywhere in the city. Speed, knowledge, conversation, truly an excellent all around performance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOGRfMV9RRRAB",
            "text": "Another wonderful Chambers experience, this time celebrating an anniversary. Warmly welcomed by Jarred, then following a discussion w/somm Pascaline on our likes and menu choices, she chose a wonderful champagne, Solera, by Olivier Horiot in Riceys. Almond, oregano, herby and also a little hoppy, with a nice long finish, it expertly complemented the mackerel as well as the foie gras torchon, and squid. For the  delicious sirloin w/chimichurri, the    new (to us( super friendly somm, Oliviero, gamely suggested if we’d like to try two different reds -  Roagna Dolcetto D’Alba and a Portuguese Dao from Antonio Madeira (more rustic) - so we could compare and contrast which we liked best, a lovely idea. As it happened my wife liked the more rustic Dao while I was quite taken with the silkier Nebbiolo. Finishing with a rhubarb cake, we couldn’t have asked for a better evening. Our server Siarra was delightful, always at the ready, when needed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibU5QYlhBEAE",
            "text": "This is one of NYC’s top destinations to enjoy delicious food, a uniquely thoughtful beverage program (including a wine selection second to none), and hospitality that can’t be beat, all in a space with a minimalist warmth that creates an incredibly calm and welcoming sensation upon entering…just like a luxury spa. As a huge bonus, a carefully-curated audio component effectively wraps your table in its own sound bubble, allowing for crystal-clear conversation so you can discuss every detail of your culinary experience without feeling any audio intrusion from the table next to you. Chambers is as close to perfect as it gets for lovers of fine (but humbly unpretentious) dining."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeElXOWpnRRAB",
            "text": "Wonderful experience, the food was very good, the service outstanding and the ambiance very relaxed.\nPascaline gave us a perfect recommendation and her level of knowledge is impressive.\nI’ll be back soon !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCOGV2bDRBRRAB",
            "text": "Chambers is the best restaurant in NYC. The food is outstanding, every time. While I always intend to try something else, I just can’t steer away from the ricotta cavatelli. It’s outrageous. Like a French onion soup meets pasta. Beware: everyone will have their fork in it in no time. This is the type of place where you’d be remiss not to order a starter and some sides. The wine list is extensive but not intimidating because the somm is amazing and makes incredibly approachable recommendations. The atmosphere is beautiful and the staff, Chef included, are super fun. Great option for walk ins, too. We love it here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCb2NYNy1RRRAB",
            "text": "One of the best restaurants in nyc and one of our favorites. Easily the best wine list in the city and the som always finds the perfect bottle for the occasion. Food is outright delicious. Have tried most things on the menu and can’t remember a dish that wasn’t top notch. My wife would eat the ricotta cavatelli every night if that was at all possible. Definitely order any dessert! The team are heaps of fun too. Super welcoming and friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKb3U2cDRnRRAB",
            "text": "have wanted to come here for a while. overall a very enjoyable experience.\n\nfood is really stellar - almost a 10/10. i’d say portion sizes are fantastic, not too big or small - we shared 3 starters, 3 mains and 3 desserts, between 3 of us.\n\nthe sesame pizza bianca at the beginning was fresh, warm, chewy and totally superb. we ordered it twice.\n\nstarters of gem salad, strawberries, and hamachi - all great. mains of hanger steak and pork - mine was the hanger steak, which was really to die for. every bite was perfect. like wow.\n\nsides of asparagus and potato. asparagus was cold which was not what i was expecting - still great. the potatoes were heavenly with the steak.\n\ndeserts… the millefeuille and then strawberries were stellar. the millefeuille was one of the best i’ve ever had. i’d say the chocolate cake was a bit of a miss — the cocoa powder on top ruined it (i have no idea why restaurants do this!)\n\nonly thing that was a bit of a miss was the service. we waited FOREVER (almost 45 mins) for the sommelier…. didn’t order until 30 mins in. service was a bit eh… no one really seemed that friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkeE9PX3FnRRAB",
            "text": "This is a 5 star restaurant for sure. The staff is very and the food is unbelievable good. This place deserves a Michelin star!! 100% recommended! Whatever you get will be amazing but a must is the cauliflower!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6djl6LUh3EAE",
            "text": "Chambers is as good as it gets. Neighborhood vibe with quality and consistency: the food, drinks, & service are all top tier. I've been 4x and each time the experience is memorable - Worth traveling for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNU1XbWl3RRAB",
            "text": "Warm ambiance, fantastic service, and the food was beyond delicious. We will definitely be returning sooner rather than later but next time sitting at the chefs counter."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMW9LWnNBRRAB",
            "text": "Best restaurant in Tribeca and it's not even close. Inventive and delicious from start to finish (including the bar snacks and dessert). Love the castelfranco salad, the sesame pizza, the cavatelli (especially the spring tomato vodka version), the chicken, the eggplant parm, and the rhubarb dessert was phenomenal. The lafayette cocktail and their whole wine program is great too. Love their neighborhood-first concept, the design, and the ability to get a table. Amazing gem."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Z2RlQkh3EAE",
            "text": "i’ve been meaning to come here since they opened. the hanger steak with asparagus and brown butter hollandaise was a sensation, i made it disappear. the wine list is incredible, and i love the selection of rare chartreuses. i’m very much…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYN1BqTDNBRRAB",
            "text": "Spectacular food! The service was top notch and very friendly.\nHands down the best cauliflower I've ever had! And a wonderful wine suggestion."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOHJ6UnBnRRAB",
            "text": "Excellent food. The wine program is fantastic and very deep. The team really takes the time to talk with you and find the perfect bottle/pairing. Can't wait to go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKX28tWkJBEAE",
            "text": "Amazing place! Everything was incredibly tasty! I'm glad they offer delicious, gluten-free warm bread and a very good non-alcoholic red wine. I highly recommend the Mascarpone dessert!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aDh6ZUJ3EAE",
            "text": "Loved the food, ambiance and the wine list is simply fabulous. I sat alone at the bar so I opted for wine by the glass, something I like doing when the wine selection is very interesting which was the case here. I guess I got unlucky with the service?... I was expecting a bit more of a proactive, pationate approach to help me chose the wine. A bit more tasting before choosing which is exactly what the couple next to me was experiencing. \"Try this it’s great with oysters, compare it to this other one, etc\" I will try again, fingers crossed."
        }
    ],
    "reviews_count": 80
}