{
    "name": "Tsubame | Kaiseki Inspired Omakase",
    "place_id": "ChIJHSg-pCVbwokRAHnqxa5xSko",
    "grid": "MN1",
    "address": "11 Park Pl, New York, NY 10007, USA",
    "rating": 4.7,
    "user_ratings_total": 58,
    "phone_number": "(929) 614-5998",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScFNtaERUR2h2WlZsVVJURlBjVVZSVTI5NU9VRRAB",
            "text": "The new fall menu is super tasty. All the fish and shellfish was super fresh and flavorful. The Banana dessert was delicious and unique."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204ME1tSkdWR3hJWlZkVmRIUTNOME5ETFVwa1FWRRAB",
            "text": "If you know what's good for you, you will run, not walk, to Chef Jay’s Tsubami before they get a couple of stars and double their prices!\n\nThey serve both Kaiseki (non-sushi chef’s selection courses) and traditional omakase. Both were excellent! The taste, originality, presentation, and intimate atmosphere were all exceptional! I go to many restaurants with tasting menus, and I was thinking recently that they all, while excellent, started to look and taste the same. Tsubame stood out!\n\nThe restaurant is intentionally minimalist, but no detail is overlooked! From a little coaster for your phone to the bird sounds piped into the bathroom.\n\nAnd give some love to Raj, the maitre d! He’ll correctly guess your name from the reservation. Explain each dish. And he can make an intelligent conversation about everything from where to eat in New York to the future of AI!\n\nI couldn't be more impressed with this restaurant, and I think you won't be either!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NVltTjFSVmx4YzJwa2FHYzNlbnBST1c1MmFYYxAB",
            "text": "Tsubame is an absolute gem. The space is beautifully decorated—elegant yet warm—and the intimate setup makes the whole dining experience feel personal and special. The kaiseki menu was stunning from start to finish, with each course thoughtfully crafted around the season and the freshest available ingredients. Every bite felt intentional and balanced.\n\nThe pricing was very fair for the quality and care that goes into each dish, and the staff were incredibly friendly and attentive without ever feeling intrusive. Their explanations of the courses and genuine enthusiasm for the food added so much to the evening.\n\nOverall, Tsubame delivered a perfect balance of atmosphere, flavor, and hospitality. I can’t wait to come back for another seasonal menu."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWb1ZEZzFZVU5EVUV4NlJ6Qm9hakpzVUhwU2MyYxAB",
            "text": "Tsubame delivers an incredible omakase experience. Every course is fresh, beautifully presented, and full of delicate, balanced flavors. The ingredients are top quality, and the attention to detail really stands out. The chefs are warm and professional, creating a calm, intimate atmosphere that lets the food shine. It’s refined, thoughtful dining done right — definitely one of the best omakase spots in the city. 🍣🔥"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSmJsWTNjM3BGYzJGM2VtNDFSWE5MYW5seWNFRRAB",
            "text": "I can taste the chef created each piece with his passion. Will definitely come back soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMlpWSnlYM1ZLVWt0alYxVXhNbFpXU0MxamFtYxAB",
            "text": "👍 good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMWVYUjNTSGd4UmpJdFYyZFdkVU5OVkY5WGVuYxAB",
            "text": "Tsubame, named after the Japanese word for swallow, is a reflection of Chef Jay’s roots and refined culinary vision. Starting his journey at just 12, Chef Jay now crafts kaiseki inspired omakase with unmatched attention to detail. The cozy, beautifully designed space sets the mood for a deep and personal dining experience. Every ingredient is carefully selected not just for quality, but for the BEST part of THAT quality. Let Tsubame guide you through the seasonal tasting menu sourced from around the world. Each course flows effortlessly into the next like a gentle stream from appetizer to dessert. With a constantly evolving menu based on season, Tsubame offers the best of the best with surprises and satisfaction every time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJTGpxZDY4bjZIVDNBRRAB",
            "text": "Had the most lovely meal here. Intimate with quality service. Great conversation with my own party, the chef, and another guest. Food quality and presentation was superb, as well. Each course was delicious and worth writing home about. In fact the other guest noted that was his second time within the span of a month since his first dining at Tsubame. Will definitely return for another exquisite meal."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZTJrWlhpMHZ6dGZ3EAE",
            "text": "We had the pleasure of dining at Tsubame and were truly impressed by the impeccable service provided by Mr. Raj Basel. As the Guest Relations & Beverage Manager, Mr. Basel exemplified professionalism, grace, and an unwavering commitment to excellence.\n\nFrom the moment we arrived, he welcomed us with warmth and genuine hospitality. His knowledge of the menu and thoughtful beverage recommendations greatly enhanced our dining experience. It was evident that Mr. Basel takes great pride in ensuring that every guest feels valued and cared for.\n\nThanks to his attentiveness and dedication, our evening at Tsubame was not only enjoyable, but truly memorable. We are deeply grateful for his outstanding service and look forward to returning soon."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJT0FoTGlONVpUYUlnEAE",
            "text": "The food here is average—not bad, but nothing memorable. What really stood out was the lack of consideration in the service. While other tables received complimentary desserts for special occasions, our table—just because we are having a normal dinner—was the only table that was overlooked entirely. It’s not about the dessert—it’s about the inconsiderate approach to service. It left the impression that only certain guests get treated with extra care. Disappointing experience overall."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJN2tnZW1wejhXWklBEAE",
            "text": "We had the most incredible omakase experience at Tsubame last night. Everything — from the exceptional freshness and quality of the seafood to the flawless service — was simply outstanding. Every dish was a delightful surprise, beautifully presented and full of flavor. The attention to detail and warm hospitality made the evening feel truly special. We can’t wait to return and relive this unforgettable culinary journey. Highly recommended!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OE8zX0ZBEAE",
            "text": "One of the best kaiseki omakase spots out there! I took my fiancée here for her birthday and we both loved it!\n\nWe didn’t know this beforehand but found later on that Chef Jay was the owner of Gaijin and Koyo from Astoria. We use to go there all the time when we lived in Queens. We didn’t know Chef Jay owned it since it was Chef Mark and Chef Darry at the counters for all the time we went. They had one of the best omakase menus.\n\nMy fiancée and I were shocked that we somehow chose a restaurant that ended up being owned by the same chef from our favorite omakase restaurants."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3c095WDBRRRAB",
            "text": "I had an unforgettable dining experience at Tsubame NYC, a hidden gem in Tribeca offering a kaiseki-inspired omakase. With only 10 seats at the counter, the atmosphere is intimate, making it feel more like a private dining experience than a typical restaurant. Watching Chef Jay meticulously prepare each dish right in front of me was mesmerizing—every movement was precise, and you could see the dedication behind each plate.\n\nThe food was incredible. They use seasonal ingredients flown in from Japan, and change their courses to reflect the seasons, which makes each course feel unique and special. One of my favorite bites was the Grilled Scallop and Winter Melon in Scallop Dashi as the “Yakimono” course. The perfectly grilled Japanese scallop was an island floating on top of rich and umami-filled broth. It was rich yet balanced, with a melt-in-your-mouth texture. Another standout was the \"Gohan\" course, which featured seasonal sushi selected by the chef himself – this time, he showcased delicious aji, mackerel, sweet shrimp, and more. Every bite was perfectly executed, from the fresh sashimi to the beautifully plated small dishes.\n\nThe experience felt elevated yet welcoming, and the individualized service was top-notch—attentive, knowledgeable, and very personable. If you’re looking for an omakase in NYC that blends tradition with innovation, Tsubame is a must-visit. Just make sure to book in advance—seats fill up fast! Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbktUV1B3EAE",
            "text": "Chef Jay is both expert and a great guy, fantastic food/experience all around. Highly recommend"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnd3RUMGpnRRAB",
            "text": "Very innovative style Kaiseki inspired omakase. Highly recommend"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncFBmajBBRRAB",
            "text": "Loved the intimate seating, the seasonal menu and the very nice staff."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeDdLNVBnEAE",
            "text": "The service staff here was professional and attentive, but unfortunately, that’s where the positives ended. My experience at this omakase felt more like an afterthought than a curated dining experience. The chef spent the majority of the evening socializing with his friends at the counter. I was ok with this. I prefer focusing on the food during omakase and am not interested in small talk. Chef’s friends were late. Not only did I have to wait for their arrival to start the service, but the nigiri course was rushed. I received back to back pieces and was ushered out the door in what seemed like an effort to move me out of the space quickly\n\nIt’s one thing to host friends, but if the chef wanted to prioritize them, reservations for paying customers should not have been open.\n\nThe sushi itself was disappointing—lacking in flavor, balance, and the care one would expect from a premium omakase experience. For a $300 meal, there was no sense of attention to detail or hospitality.\n\nWhile the service team did their best to make the evening smooth, it’s clear this establishment relies on theatrics and connections over delivering true quality. I wouldn’t return, nor would I recommend this place to anyone expecting the precision and care omakase is supposed to represent."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcDRqT1ZBEAE",
            "text": "I had Omakase here recently for my birthday and it was an amazing experience. The service is fabulous and the food is delicious. We were sat at the counter and all of the dishes were prepared in front of us by the chef. Each one was different, exciting, and tasty. This was some of the best sushi I have ever had. The server made sure our wine glasses were full and that we had everything we needed without being overbearing. 10/10 would recommend to go here and experience this Omakase."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdWFMNm9BRRAB",
            "text": "One of the best omakase experiences in NYC, super fresh, Creative and the Chef is a gem"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYekpXR1FREAE",
            "text": "Simply beautiful! My wife did a lot of research before choosing Tsubame for her birthday. We were delighted with our dinner. I don't pretend to be an expert on sushi, omakase, or kaiseki. (Take a look at the photos to see our menu). But I know that we had a tremendously calm, enjoyable, and delicious meal.\n\nAs a side note -- I don't follow New York Mets baseball, but I learned later that Mets pitcher Kodai Senga was sitting next to me for the prior 2.5 hours. Evidently this was a repeat visit from him. So although I'm not a sushi expert, I figure he has a lot of choices about where he gets his sushi in NYC, and Tsubame meets his standards. ; - )\n\nThe service and interaction with the staff was perfect. Our conversation with Chef Jay and our server (JB) was fun and insightful, without ever being intrusive.\n\nWe wish Chef Jay, JB and the rest of the staff continued success in sharing their Kaiseki Inspired Omakase with food lovers.\nThank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeWMtdUt3EAE",
            "text": "Truly an unbelievable meal. I came here to celebrate a birthday and was blown away by both their hospitality and their diversity in fish. Highly recommend!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOC1iMDdRRRAB",
            "text": "I have been here three times and I am not lying this is the best omakase for price, location, and service! I have been to so many omakase restaurants in NYC at different prices. This by far is the best!! The menu changes frequently. The drink selection is diverse with both good choices of sake and beers from Japan."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURua0lpMW13RRAB",
            "text": "Just had an unforgettable dining experience at Tsubame Kaiseki Inspired Omakase, and it was absolutely phenomenal! Every dish was thoughtfully crafted, bursting with flavors, and beautifully presented by chef Jay .\nEvery bite was a work of art, and the attention to detail was impeccable.\nThis omakase is a culinary journey that shouldn’t be missed. Can’t wait to come back! 🤩✨\n\n✨ Sakizuke\nStarting off strong with the luxurious Uni & Caviar on Shokupan—a rich, creamy bite that’s the perfect blend of ocean freshness and buttery toast. Absolute indulgence! 😋\n\n🌟Hassun\nNext up, the Toro Tartlet, Botan Ebi, and AnkimoEach bite was a delightful combination of textures and flavors, from the melt-in-your-mouth toro to the sweetness of the prawn and the silky monkfish liver. A trio that captures the essence of true omakase!\n\n🔥 Yakimono\nAn absolute showstopper: Miyazaki A5 Wagyu with Cured Jidori Egg Yolk. The wagyu was so tender it practically dissolved in my mouth, while the egg yolk added an extra layer of umami richness. Couldn’t get enough of it! 🥩🔥\n\n🥚 Mushimono\nThe steamed Hotate & Jidori Egg Chawanmushi with Caviar*was a silky, savory dream. The custard was perfectly smooth, and the scallop's sweetness with the caviar’s briny notes made this dish a highlight. ✨\n\n🍲 Suimono\nA light yet flavorful Madai, Lobster Mushroom & Awashi Dashi soup—delicate and comforting, with a hint of umami that lingered with every sip.\n\n🍚 Gohan\nThe main rice course was a flavor bomb! Amaebi, Uni, Sujiko Donburi with a Seasonal Nigirizushi Selection was the ultimate taste of the sea. Fresh, vibrant, and full of flavor, this dish took me straight to Japan. 🇯🇵\n\n🍮 Mizumono\nDessert was a delightful Hokkaido Milk Panna Cotta with Kuromitsu & Fig, followed by a refreshing slice of Japanese melon and a warm cup of matcha. The perfect sweet ending to this exquisite meal. 🍈🍵"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaGFiSW1nRRAB",
            "text": "We loved our meal at Tsubame. Extremely warm service, beautifully sourced seafood, in fact the chef gets the best seasonal seafood he can, it was really spectacular.\n\nWould highly recommend it to Japanese food lovers and appreciators of intimate dining experiences."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3amV1dVpnEAE",
            "text": "Absolute perfection! Best omakase in the city, prove me wrong. Inventive dishes, great intimate atmosphere. Came here to celebrate my engagement and was an unforgettable night!\n\nLoved the Japanese melon, thanks so much Chef Jay!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOHB1VXJ3RRAB",
            "text": "What a wonderful dinner this was!! Very happy to have celebrated it here. Delicious food and company"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiX3JMVTh3RRAB",
            "text": "By far the best Omakase I’ve had in the city! Chef Jay is extremely meticulous when it comes to hand-crafting every piece he prepared for us. Upon being seated we were served complimentary champagne. This isn’t your typical Omakase where the chef only serves nigiri pieces, each dish that we ate were packed full of flavor and super fufilling! I love that Tsubame also has a rotating menu depending on the season! I can’t wait to come back again! Thank you Chef Jay!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibHFUdzlRRRAB",
            "text": "It's rare to find a chef as passionate and committed as Jay Zheng. Constantly changing the menu based on ingredients in season, Tsubame offers diners a unique meal they aren't going to find anywhere else in New York."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybUxlcWhBRRAB",
            "text": "Best dining experience and the team is super nice and helpful during the entire time! Fish selection is super fresh and beautifully presented and prepared. A must try for sure!10 stars if I could!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6c2JMSnRBRRAB",
            "text": "I make the reservation wrong day and tried to contact them but no respond. Lost all the deposit for nothing. Ridiculous rule\nDear Tsubame management:…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaFBtVkRREAE",
            "text": "So much better than your typical new york omakase. The chef is extremely knowledgeable and actively sources seasonal fishes that you won't find anywhere else. The kaiseki courses are also intricate and amazing. For the price, this is a steal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbWN2T1VREAE",
            "text": "A fancy Japanese restaurant and I’m impressed the foods there, as well as the environment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dXZtYUF3EAE",
            "text": "I've been eyeing this restaurant ever since it opened, being a big fan of Koyo (Tsubame’s sister spot). Finally got to swing by on my birthday. Gotta admit, I had some pretty high expectations, given the higher price tag and all the research I did. But truth be told, the dishes I saw on Yelp and social media looked way more impressive than what I actually got. Not to say the food was terrible—it was nicely presented—but it just didn't quite hit the mark ingredient-wise.\n\nOverall, the experience was not bad. They even threw in some complimentary champagne for my birthday. However, the seating was a bit uncomfortable with those high chairs. I'm all about sea urchin, but when it was served on an oyster, it had this weird bitter taste. On the flip side, the fresh uni in sea salt water was pretty darn good. Still, could've done with some fancier ingredients. I was expecting some fancy risotto, Wagyu, Japanese crabs. Nope… I got this mini bowl of sushi rice topped with ikura. Talk about a letdown!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcnByUzVnRRAB",
            "text": "Can’t seem to put my finger on the food here. On one hand 225+ is a great value but then when you compare the food and service to the double price point sushi places (noz/shion/yoshino etc), I almost feel like paying double is justified in this situation due to how rough the service/food is.\nFirst dish was crab/seaweed/caviar with tozaru gelee, the gelee overpowered all the delicate flavors and each bite was just pure acid.\nSecond was mochi with uni. Mochi was chewy with hard/burnt edges which stuck to your teeth. Sous chef was actually cutting off burnt bits off other people’s mochi.\nSashimi course had a touch sinew in the fish so I had to shallow it whole.\nThere was shirako but my partner said hers was very fishy.\nI can go and on about each course but the biggest letdown came to the nigiri course. The rice was very soft/overcooked with little seasoning. The letdown of the rice caused me to not enjoy any of bites of fish. The ginger was periodically refilled for me, but there was one particular section of ginger that was extremely spicy and it filled my mouth with an overpowering amount of spicy. My partner agreed with my feelings about the ginger.\n\nService was also quite spotty. I was waiting in line to use the washroom when I specifically saw that all guests were sitting at the counter. Turns out, one of the waiter was using the washroom. I never been to any 100+ price point restaurants were the servers would use the same washroom as the guests. Also the chef treated his group of friends with much more attention than certain other guests which I think is unprofessional. Other reviews said the chef was very personal and talked to the guests but the chef didn’t add any personal touch to anyone except his group of friends.\nWorth the 200+? Maybe, you do get to try some adventurous seafood. Quality? Definitely not worth it. Service? Spotty. Environment? Cramped seating, they could do with one less chair but that would make the seating an odd number. However, you have to give them some leeway since they are less than a year new so some kinks and rough edges would be ironed in. This place left with me with some conflicting feelings and even as I write this, I still can’t place how I feel or whether I’d come back. If the chef tweaked the quality of the fish and did a little bit more balance testing, maybe the price would be justified?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxanIzdU93EAE",
            "text": "I found out about this place from the chef of Koyo, and I was so glad that I came! Everything was so extraordinary and the food was not only tasty but also truly unique and amazing! The chef was so friendly and the service was great. The chef said he changed the menu every few weeks. I'll definitely visit again next time I'm in New York."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcE5TMUV3EAE",
            "text": "Chef Jay and his team have created something special - a creative, well executed, intimate, unpretentious restaurant. The menu is delicious really reasonably priced despite the recent extreme rise in NYC fine dining prices.\n\nReally enjoyed the breadth of flavors and seasonal ingredients which combined kaiseki, sushi, and a little French technique. The ambience is intimate yet upbeat in a brightly lit minimalist modern room that bumps lo-fi music. Service is attentive.\n\nMy favorite part of the meal aside from the exquisite food, was chatting with Jay about his background as well as learning about all of the ingredients, their seasons, and where they’re sourced from. A few standouts were the snow crab with yuzu jelly, seaweed, and shiso flower, the monkfish liver mousse over toro, the uni over grilled miso, and the lovely soup with baby eels. All of the sushi pieces you can see in the photo were well prepared and the red vinegar rice was full of umami, but not overly seasoned.\n\nI really hope this restaurant continues to grow in success, it’s one of the few fine dining restaurants in the city I would like to return to. I didn’t feel robbed after and Jay was extremely personable and comes from a non traditional sushi chef background.\n\nWell done Jay and team, can’t wait to return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOE5Dbkh3EAE",
            "text": "Not sure about the whelk but Omakase was excellent. Chef was very engaging and had some great discussions about the origin of the various fish served."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsX0ludjlnRRAB",
            "text": "Love the freshness of the food and the friendliness of the staff 😁 highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbjRHM1NnEAE",
            "text": "Perfection at every step."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGaTlfZ09nEAE",
            "text": "분위기도 좋고 가격도 좋고 서비스도 좋고 음식은 정말 일본가서 먹은거같아요 ❤️ 친구들이랑 자주 갈거에요 제이쉐프 최고!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbXJibHF3RRAB",
            "text": "Had a beautiful birthday dinner here! The room is gorgeous, atmospheric, and intimate, and the chef and staff make lovely conversation with plenty of superb recommendations. The food was incredible — inventive, fresh, and joyful to eat and watch being prepared. This is a truly special experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbXVhampRRRAB",
            "text": "The flavors were incredible, the staff was attentive, excellent sake recommendations, and the design was warm. I can't wait to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaLWRHdUtREAE",
            "text": "Tsubame was an incredible experience. My girlfriend and I came here for my birthday; Omakase is something we always do for special occasions. The restaurant is very personable, and the service is superb. Chef Jay has clear intentions for his menu, each dish was thoughtful and unique, the fresh ingredients leaving you looking for more after finishing each dish. Chef Jay is deliberate in what he intends each dish to be, he is interactive and informative. It’s clear that Chef Jay cares about his craft and does an incredible job making sure each party is satisfied. My advice, if you have the pleasure of seeing Chef Jay, don’t spend the entire time on your phone like the people I sat next to. By all means, take pictures and ask questions, but get to know Jay and his intentions, for that’ll make the experience that much more unforgettable. Chef Jay, you made my birthday an incredible experience!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNXZxZFBREAE",
            "text": "They claimed their system accidentally booked our reservation which requires significant prepayment. They called us a few hours before our reservation on a saturday night  to say they could not accommodate our party of two, but one of us could go alone or we could go three hours earlier. We were celebrating a personal event so this immediately ruined our night. not to mention we had childcare for our infant scheduled for this dinner. They made no attempt to reasonably accommodate us, offer a reservation at anywhere they had a relationship (apparently they have none), or offer a gift card. This is New York City- cancelling our 8pm reservation at a high end omekase without offering anything is really not acceptable for an expensive restaurant where we PREPAID FOR A VERY EXPENSIVE PREFIXE. Terrible customer service doesn’t endear you to actual New Yorkers or anyone other than transient tourists. If you’re willing to shell out the money I’d expect much more high end service during this type of mixup. You should be able to accommodate one extra person when your reservation system screws up. The inability is ridiculous. I don’t spend this much money on a night out often as a parent of an infant, and to be treated this way when we’re spending that much is absurd. There is incredible omekase in this city that will treat you to a luxury experience- don’t give this establishment your money."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOVl1ZDFRRRAB",
            "text": "Creativity + Excellence🔥🍣🔥\n.\nOmakase for $225 includes 18 courses at Tribeca’s newest sushi bar. Chef Jay has opened his second NYC restaurant after the success of Koyo in Astoria, this one takes the Kaiseki-theme to a new level. Higher end ingredients, a more thoughtful progression through 7-8 nigiri and several spectacular dishes. Highly recommend 🤤"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMnJfbW53RRAB",
            "text": "Chef Jay did it once again with Tsubame. My husband and I frequent his other restaurant in Astoria, Queens, which is called Koyo. When we heard he was opening up a sister restaurant, we knew we had to come!\n\nInside is a warm and intimate dining experience led by Chef Jay and JB. Their hospitality is unmatched, and they truly take how you enjoyed the dining into consideration.\n\nThe dinner began with 5 small dishes, that were filling, flavorful and creative. The dishes were then followed by 8 pieces of sushi, which I paired with the Red Maple sake, I highly recommend this combination! After the sushi, it was a small rice course, and two dessert plates.\n\nI left with a happy and full stomach, as did my husband. We loved talking to Chef Jay about his creative process in regards to opening up this restaurant, and how it will differ from Koyo. The staff is so friendly, the vibes and atmosphere is inviting, and you’ll certainly want to visit again.\n\nTo note: Chef Jay mentioned that as this is a kaiseki forward style of dining, the menu will change frequently. Unlike Koyo which changes per the 4 seasons, this menu will change every couple of weeks. It depends on what he can find, and the menu will be based off that. So this alone makes it a restaurant I will want to visit over and over again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcXVyUUtnEAE",
            "text": "Been looking forward to dining here for almost a year now; So glad they're finally open.\nRight when you step in, it feels like you're transported to Japan. Behind a sliding door is the dining area where everything just feels very intimate and personal.\nThe food: Amazing. Chef Jay is an absolute master at his craft. Everything is incredibly fresh and light. Following the model of only seasonal ingredients, the menu is ever changing. Will definitely be coming back here often.\nChef Jay and JB are very friendly and personable, definitely made the experience all the more enjoyable.\nHighly recommended for anyone looking for a high end, high quality dining experience. I would suggest booking the 5:30 time slot as you're more likely to get a private session and get to know more about Chef Jay and his creative process."
        }
    ],
    "reviews_count": 47
}