{
    "name": "CUT by Wolfgang Puck",
    "place_id": "ChIJ87qt5hhawokRfDHmVxCxPJY",
    "grid": "MN1",
    "address": "99 Church St, New York, NY 10007, USA",
    "rating": 4.4,
    "user_ratings_total": 740,
    "phone_number": "(646) 880-1995",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReVRsVjZTV2hrWVZKcU5UWkhPRGxoWDBScVVVRRAB",
            "text": "Amazing food"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcmFtMTNjbFE1WDE5VGVrZG1aRFo0Vm5CNU1IYxAB",
            "text": "Costs the same as a surgery but atleast you get better food in the hospital"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCelNUVldTSHBQYTNCSFRVcFhiemhVVUU1ZmVtYxAB",
            "text": "You get what you pay for.\n\nExcellence."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVWVIZE1jWEY2Tld4RlRXYzVWRGhFYW5SUWFWRRAB",
            "text": "The staff was friendly and the food was very good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NmRWcHVka2g0VnkxalRWWm5NbmxLY1Y5VVlWRRAB",
            "text": "Amazing experience here tonight.  Food  a 10. Service a 20."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNU5WUkNPSE0xUTNWWlpXUXdTa2QwVTFSME9FRRAB",
            "text": "Expensive but loved every bite and everything about this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKV2NWQlNaVE4yWTBwV2Frb3diemcwTWxaQlZtYxAB",
            "text": "Their filet mignon was superb"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UmVucFhTRE5DYzA5VVRUZDRaREpRU2taUFdVRRAB",
            "text": "One of the best dining experiences in the city. The Tomahawk steak was phenomenal, but don’t skip the seafood, the oysters and octopus were standouts. Cocktails are fantastic, and the wine list is huge. Service is top-notch, attentive from start to finish, and the ambiance manages to be elegant and lively at the same time. Expect to spend $200–250 per person including tip if you go all in, and honestly, it’s worth every dollar. Highly recommend for groups or a special night out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUGMxWmtlVFJOUm1wcVVrRlFRelpSUzBoeE9XYxAB",
            "text": "A classy restaurant with a very good lunch menu. Never goes wrong earing at the Cut."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUVRFMUlkbFE0V0ZVeE5sUk9aMDVPZFZkSWVVRRAB",
            "text": "✨ New fave alert! ✨\nImmaculate service, peaceful aesthetic and vibes, perfect music, and food that hit the spot. Staff stayed on point all night — kind, attentive, and communicative. 10/10, I’m already planning my next visit! 🍽️"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaDduVTl3RRAB",
            "text": "Update... Had a breakfast meeting at Cut today. The food and service were fantastic as usual. This still is one of my go to stops downtown for a nice overall experience...\n\nWe dinner at Cut for a special occasion, then again for a drink at the bar on another visit to the area. The food, service, and atmosphere here were all fantastic both times. This restaurant is located within the Four Seasons hotel downtown, making it a nice go-to spot if you're staying at that property."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeVNXZzVTRUUzTVhacVQyUnNaakpSY0dwVVpsRRAB",
            "text": "Disappointing Experience for a Restaurant of This Caliber\n\nWe ordered two large steaks — a 32 oz porterhouse and a 36 oz dry-aged ribeye — both requested medium. After an hour-long wait, the porterhouse arrived completely overcooked (well done). Even our server acknowledged the mistake and called it unacceptable. He offered to speak with the kitchen about refiring the steak.\n\nSince we were starving, we asked to keep the overcooked steak while they prepared a properly cooked one. Unfortunately, the service continued to fall short. The sides didn’t arrive until about 10 minutes after the original steaks, by which time most of us had already finished eating. Steak sauces weren’t brought out until the refired porterhouse was delivered — again, too late to enjoy with the meal.\n\nThe overall service was disorganized and underwhelming. For a restaurant that carries the Wolfgang Puck name and charges premium prices, I expected a much higher level of professionalism and hospitality.\n\nWhat truly surprised me was that despite the kitchen error and service delays, the overcooked porterhouse wasn’t comped. Instead, we were charged for all three steaks (roughly $600), and only two sides were comped.\n\nThis was not the experience I anticipated from a restaurant of this reputation. Hopefully, this feedback helps improve the level of service going forward."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOb1FtcEpXRUppVGtwalQwSXpVWFJYUVRWaVpFRRAB",
            "text": "Food was excellent, service was great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdVR5MXVVazFNT0dGRGNrcDRiR2t6VUdneUxXYxAB",
            "text": "Came for our anniversary dinner. There were many halal steak options which is why we chose to come here and we were really happy we did. Food was wonderful and delicious, staff were attentive and gave good advice in ordering our meal.\nWe ordered the Tomahawk steak and we really wanted the mushrooms but they had alcohol so we mentioned this to our server and she brought us halal friendly sides. We were really happy with such attention to detail. After our meal we were really full and had no space for dessert so they gave us a delicious chocolate cake. Definitely give it a try!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVVIwWnVVVEpzUTFrMWRGaDJlR0UwWVUweGNuYxAB",
            "text": "First steak restaurant in NYC I've been to in a very long time. I got the ribeye which was pretty good. A few friends and I each ordered the \"flight of sauces\" which was an additional $8 to be able to try all the sauces, but in retrospect it probably would have made sense to share the flight rather than to each get one since they came in sizable amounts that could be shared. The one complaint I had was that they wanted to place the order all at once so we weren't able to order apps to start while we continued deciding what we wanted for our mains. Otherwise, the food was good and the portions were decently sized."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTllYcHpjREZ2WjJKb1gyUlJXbVZ0VkRORFQwRRAB",
            "text": "help"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVlFscHhNRWRGZDJkRFZVOVJhbTVHWjNwb2QxRRAB",
            "text": "The ambiance is sleek and modern, and the service is absolutely exceptional, attentive without being overbearing. We ordered the tomahawk steak and it was out of this world, perfectly cooked, incredibly tender, and full of rich, smoky…"
        },
        {
            "date": "4달 전",
            "language": "iw",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcmJGUnVSRll6YVdkTWFXUm5PVk5hV0ZKdWNrRRAB",
            "text": "היינו אחהצ, תפריט מוגבל אכלנו המבורגר יקר ויבש"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4R1FsWnNhMUZpU2pReVZrVmlNaTA1U2pWWk5rRRAB",
            "text": "Relaxed yet sophisticated atmosphere. Simple menu executed well. A good representation of the CUT brand."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLaW1pY1Q3MzZPdU53EAE",
            "text": "Always the most fabulous place to catch up with friends over a chic and delicious drink! The bartenders are top notch!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLUGgzdFhDNnE2LV9RRRAB",
            "text": "Very expensive and remarkably unremarkable.  I expect special takes on food from Wolfgang Puck's properties.  This was a straight-up premium steakhouse no different than any other chains.  Not as good as Ruth's Chris and certainly not in the same league as NYC's Keane's or Peter Luggar."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMldoX3FJcnRLWU13EAE",
            "text": "Dining at CUT was extraordinary. I was blown away by the level of service—truly one of the best service experience I've ever had in my life. The staff really made us feel like they cared about us as people, making the entire evening feel really special.\n\nNow, the food—wow. I will be dreaming about the large format tomahawk and ribeye for a long time. Cooked to absolute perfection, each bite melted like BUTTER!!!  It’s was extremely tender, and bursting with flavor. I like my meat salty.. & it didn’t need any extra salt it was perfect. The quality of the meat and the expert preparation made it clear that this place is in a league of its own.\n\nOne detail that stood out and made the experience even more meaningful: 95% of all the steaks are HALAL!!, with the exception of the A5 Wagyu and top sirloin. As someone who looks for halal options, this was a rare and deeply appreciated find. I love this place, I really really do. If anyone from the restaurant is reading this review, thank you for such a wonderful experience, & i truly mean that from the bottom of my heart ♥️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQXzF5SjZwc0k2MkhnEAE",
            "text": "It is the best ribeye steak we have ever eaten. The service was perfect, and the atmosphere was elegant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLU2RoNHpPd3B2N0NnEAE",
            "text": "First and foremost, I want to thank the staff at CUT for making our dinner the best and most memorable dinning experience we’ve ever had.\n\nBeyond 5 star, not only was the food top notch, but the staff went above and way beyond my expectations!\n\nMy wife is a huge Wolfgang Puck fan… HUGE!  One of her dreams was to eat at one of his restaurants (hopefully while he was there so she could give him a hug. Lol).\n\nI booked a reservation as a surprise for my wife; it was for our 20th anniversary.  I wanted it to be extra special this year, and thanks to the staff at CUT, it was.  The first time I proposed, I was poor and couldn’t afford much.  For years I promised her a proper engagement ring… it took longer than expected, but, this year was the year.  I mentioned this when I made the reservation and that I planned on asking her to marry me… again.  The staff took this info and ran with it! Lol\n\nWhen we arrived at the restaurant, they were expecting us… I mean, beyond the fact that we had a reservation.  We were shown to our table, and not just any table, the best table in the house!  The hostess, I’m not good with names, but I think it was Danielle, was great… all the staff were, in fact!  They were very attentive and made sure we were completely satisfied with everything.  Being a special occasion, I ordered the Japanese Wagyu.  It was cooked to perfection; super tender and buttery!  My wife had the Branzino, also wonderful! All of the food was fantastic!  We didn’t realize how large the portions were and so order too much, but I’m glad we did.  Everything we ate there was an absolute treat to the palate!!  Our sincere compliments to the chefs in the kitchen!  To drink, my wife had the “Peace On Earth” which she loved.  I had the Glenmorangie 10 year, my favorite Scotch!  Everything they gave us was of the topmost quality and cooked to perfection… then came dessert…\n\nThis is where the truly beyond expectations came in.  I ordered a chocolate souffle and discreetly got the new engagement ring ready.  When the souffle came, it wasn’t alone!  Another server came out with a second dessert that had written on the plate “Happy Anniversary”… and then the hostess came out with a THIRD dessert, a cheesecake, and on it’s plate was written “Will you marry me… again?”… that one even surprised me!  It was SO perfect!!  I then explained to my wife what this was all about and presented her with the ring… to say she was happy is the understatement of understatements!  I proposed again, and she said “yes” again. Woohoo!!\n\nThe staff, both in front and in the kitchen, definitely live up to the Wolfgang Puck name.  We could not have been happier with the whole experience!\n\n… And, Mr. Wolfgang, sir, if you happen to read this, my wife loves you, almost as much as she loves me… lol.  I hope next time you’re in NYC we can snag a reservation so she can meet you… her life won’t be complete until she gives you a hug. Lol"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJM2d2TzJrdWRYYUpnEAE",
            "text": "👍👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKcUs2cnVOX05LelJ3EAE",
            "text": "This did not feel like a luxury dining experience at all. I ordered still water that didn’t come until I told the server I wasn’t ready to order until I got the water I ordered. It took almost an hour to get my party’s food. Nothing I ordered came with my party’s orders.\nThe three of us ordered a fruit plate to share and that should have come out first. I ordered a croissant and a French toast. Neither came out with my party’s order I was being told it was being plated. How long does it take to plate French toast? The kitchen ran out of croissants and I wasn’t told about this until my party’s food was being brought out.\nIt’s the lack of concern and communication with the staff that makes this dining experience unacceptable. I would not recommend this place to anyone. It’s Mother’s Day and they weren’t even crowded."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLUzMwLTNYNU5PZTZnRRAB",
            "text": "Good, but nothing over the top to justify the price. It’s about 25% more than your average nyc steakhouse. Would recommend Au Cheval or Wolfgang’s in the area instead."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYnMzSjdUcS1MdkNBEAE",
            "text": "Really cool bar and vibe. Now that “Metamorphosis” art piece by Marco Gallotta is on view, i feel like the bar is complete.\n\n- reviewed May 2025 -"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMGF5QU13EAE",
            "text": "The private dinning room was really big but comfortable. The food was great. I ordered the salmon and really enjoyed my meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeTh2RXpRRRAB",
            "text": "My experience at CUT was disappointing. I ordered a medium-rare porterhouse, but it arrived medium-well, overcooked and far from what I requested. When I raised the issue with our server, I was offered a refund only for the sides, which made no sense since the sides were actually good, and the steak was the problem. The lack of accountability and poor resolution left a bad taste. Overall, not a great experience, and I expected better from such a renowned restaurant. Also, when I came in, the server immediately started with,  \"kitchen is about to close\". Why have a reservation slot for 10pm when the kitchen closes at 10?"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMnJ2RFF3EAE",
            "text": "Bring your wallet we spent $500 plus tip and I only had a steak and two drinks. That said everything was over the top fantastic. We sat at the bar and the service was second to none. Don’t forget to try their crazy cauliflower!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOVBiUU9nEAE",
            "text": "I love this place! So many halal options and probably the best char on the steak anywhere.\n\nAlso has a high chair to bring a baby! :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZ0xYUEh3EAE",
            "text": "Food was very good and service was very attentive. My first steak was overcooked though."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaS11Tnh3RRAB",
            "text": "The food was decent, but not exceptional. Drinks were good vibe was decent. There’s not a lot of options downtown so I would recommend it but it’s not earth shattering."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MXE3dm53RRAB",
            "text": "Excellent!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3b0s3MnV3RRAB",
            "text": "Excellent experience, the entire staff was amazing and accommodating. The service, drinks and food were all exceptional. Will be dining at CUT again soon."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aDlpcWlBRRAB",
            "text": "Superb food and service. Ambiance both relaxing and good energy.  Staff wonderfully professional and personal.  Highly recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3N29fT2pBRRAB",
            "text": "Amazing as one would expect. We were able to get seated before closing yet still treated us like there was no rush. The service was top notch.\nFor the sides the Mac n Cheese is next level!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NHM3S0hREAE",
            "text": "Had a family birthday dinner at CUT . Food is great , service is wonderful and the atmosphere is very cosy and sophisticated at the same time . Had 2 porterhouse steaks to share amongst  6 family members . Was just the right amount of food , and the steak preparation was as expected - medium and medium rare .\nOrdered desserts after dinner . Baked Alaska was great , cheesecake was wonderful and a butterscotch dessert ( can’t recall the exact name ) was very unique . My husband ate it so fast I found only take a quick photo :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRalpYcE9BEAE",
            "text": "I’m beyond impressed with CUT NYC and the team here. They’ve nailed classic customer service with the highest level of pride, but are able to deliver it with a modern feel. I’m so appreciative of Michael and the team for their commitment to their craft. I order a retired drink from their classic menu, the Forbidden Kiss, my favorite drink from all my global travels. Michael pulled out the archives and all the bartenders took diligent notes. They learned this drink for me! Made me feel so special!!  The food is always incredible, but the team takes it over the top. Thank you!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRa3NYYmV3EAE",
            "text": "The overall experience at CUT was exceptional, including the ambiance and the quality of the steaks. I would gladly return to this establishment on my future visits to New York City. The staff provided exceptional customer service overall, The sauces significantly enhanced the flavor of the filet mignon that I had ordered."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURROE5TTnF3RRAB",
            "text": "The Wagyu stake is heavenly the other dishes are fair. The service was excellent and the ambiance is nice. High quality steakhouse."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdi1IWkZ3EAE",
            "text": "I'm not impressed.\n\nThey served me a $225 Japanese Waygu cut that was burned and cooked incorrectly.  When I asked them to fix it, they swapped it with a filet, & I suppose they thought I wouldn't notice.   The filet was fantastic, but not what I ordered, and I was still charged for the original cut, which was $125 more expensive.  I am not one to complain, so I just ate it and left.\n\nI am a huge advocate of high-quality steak dinners, and this is up there with one of the worst experiences I have had.  The servers seemed annoyed with me for saying something, which was also frustrating.  To add to the annoyance, I ordered spinach and a few different sauces that sat on the table getting cold while I waited for them to cook the second cut.  The blue cheese sauce was almost solidified by the time this took place, and the spinach was cool.  I would imagine the sauces are wonderful if they were served warm with your meal.\n\nThis is very unfortunate, as I had very high hopes. I have been to others and was never disappointed.\n\nOn a positive note, the drinks and appetizers were great, the cappuccino was to die for, and the atmosphere was truly enchanting.  I doubt my experience is the norm here.\n\nC+"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnajgtT0N3EAE",
            "text": "Excellent striploin. Liked the peppercorn sauce more than the chimichurri. Pricy."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbllDMHdBRRAB",
            "text": "Is five stars"
        },
        {
            "date": "8달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnb1lxVjJ3RRAB",
            "text": "이곳의 해산물과 스테이크는 상상이상입니다. 해산물을 어떻게 조리하였기에 이렇게 식감과 맛이 완벽할 수 있는지 놀랍습니다. 여행을 많이 다니고 유명한 식당도 많이 다녀봤지만 이곳은 라스베가스나 로스엔젤레스의 지점보다 훨씬 맛있었고 지금까지 제가 먹어본 음식중에 단연코 1등이라고 말할 수 있습니다."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOHIzU3NBRRAB",
            "text": "Our Valentine’s Day was truly exceptional, thanks to the friendly and attentive staff at The Cut. The food was spectacular a delightful treat for us. We’ll definitely be back and highly recommend The Cut to anyone seeking a fun and memorable evening of wonderful food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNna3RMalp3EAE",
            "text": "Top 3 resteraunt experiences I ever had. The hostess Tall and blonde short hair. she was wonderful from the second she picked up phone call. All of my accommodations were met and she was extremely sweet. Definition of top tier customer experience. Premium!\n\nFor all of the people that eat halal. bring your wives and families here! the server was elite and made sure I was good from A-Z . Kyira was also very helpful.\n\nI didn't have to life finger. any thoughts or questions i had was answer efficiently.\n\nFood fantastic.\nEast coast oysters>West Coast Oysters.\nI got the tomahawk steak 10/10.\n\nI literally had no issues\n\nCatch Steak closed down.\nNot to worry Wolfgang Cut here!\n\nI will be a returning customer. for my future family birthdays/anniversy etc"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbTctSnJ3RRAB",
            "text": "Pasta with lobster with fresh tomato sauce\nWow\nSix small pieces of lobster and 4 pieces of tomato"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeVozZW5RRRAB",
            "text": "Absolutely amazing"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNaGFtWlh3EAE",
            "text": "스테이크 + 에피타이저 시키면 충분"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dXRiVXZ3RRAB",
            "text": "Classic but laid back vibes. Great food. Especially the steaks! Even did a little happy birthday cake and when I joked \"what no song?\", they offered to sing. Which of course. Quickly turned down but appreciate the gesture."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNVkzTmhnRRAB",
            "text": "Had breakfast and dinner here while staying at the Four Seasons and we we’re not disappointed. The chicken and steak dishes were well prepared and the raw bar items were high quality. The only negative things we could find during dinner were that our server’s shift ended mid meal and the decanters that were showcased had not been cleaned and had fingerprints all over them; not a big deal but didn’t meet the standard they’re trying to set. Breakfast, however, was perfect. The eggs were top quality as was the fruit and the service was flawless. There’s plenty of options for restaurants in Manhattan but I would likely visit this location again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMGVMWE1REAE",
            "text": "I recently dined at this place, and it was an exceptional experience. The ambiance was elegant, the service was impeccable, and the steak was cooked to perfection. Every dish was bursting with flavor, and the presentation was top-notch. The staff was knowledgeable and attentive, ensuring a memorable dining experience. I highly recommend this place  for anyone looking for a superb steakhouse dining experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydmVLYXNnRRAB",
            "text": "The food and service were some of the best we have had. Steak amazing. Wine choice amazing and the dessert!!  The decor was disappointing.  Its just like an extension of the bar with very little character.  The music was a bit loud with a vibe of classic rock. I love classic rock but it didn’t seem to fit the level of the restaurant and service. One final comment and a pet peeve. I had a fairly expensive glass of dessert wine that was listed as a 1996 vintage. When it came it was 2009. That’s a big difference. When I pointed it out they apologized and commented the menu should be updated. I accepted it but still felt misled. Was the price I paid for a 2009 or a 1996?  It was my choice to accept it but it’s the point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5ME9ucUNnEAE",
            "text": "The service was perfect, the drinks were delicious, and the food was also great.\n\nThis is our first meal in NY after long flight. Too bad we are too late to try out the dishes, just had some simple small bites at the bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMzZYOUZ3EAE",
            "text": "Steak was tasty and a little crunchy burned. Scallop still on the sashimi side. Egg w spinach was a huge portion for 1 person side dish.\nOverall, good food, good atmosphere but overpriced for the steak."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwd1pTb3RBRRAB",
            "text": "This exquisite fine dining establishment surpasses all expectations in every aspect. From the moment you step foot into the opulent premises, you are greeted with an air of elegance and sophistication. The culinary experience that unfolds is nothing short of extraordinary.\n\nThe selection of prime meats is unparalleled, sourced from only the finest suppliers and prepared with the utmost precision and skill. Each dish is a masterpiece, meticulously crafted to tantalize the senses and leave a lasting impression on even the most discerning palates.\n\nThe service provided by the highly trained and attentive staff is nothing short of impeccable. Every detail is meticulously executed, from the seamless coordination of courses to the discreet presence of the waitstaff, ensuring a flawless dining experience.\n\nThe pastry chef, Aura, deserves special mention for her exceptional creations. Her desserts are a symphony of flavors, artfully presented and expertly balanced. Each bite is a revelation, showcasing her remarkable talent and commitment to culinary excellence.\n\nFurthermore, the management team's dedication to providing a luxurious and exclusive atmosphere is evident in every aspect of the restaurant. From the lavish interior design to the personalized attention given to each guest, no expense is spared in creating an ambiance of unparalleled luxury and refinement.\n\nIn conclusion, this establishment sets a new standard for fine dining experiences. It is a haven for those seeking the pinnacle of culinary artistry, impeccable service, and an unforgettable evening of indulgence. A visit to this restaurant is an absolute must for anyone with a discerning taste for luxury."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2N2RUd3B3RRAB",
            "text": "Friendly and hospitable hostess, very friendly bartender (ordered sparkling water until the main restaurant opened for dinner), and an attentive server (Patrick) who has a quiet energy about him - not invasive - just the way I like it. I got lucky!\n\nThe decor is darker than what I usually like, but the vibrant music was enjoyable and the food was elegantly presented.\n\nMy favorite is the mashed potato! So smooth and delicious! The grilled shrimps and the cheese macaroni were delicious too! Not to forget the house-made pretzel rolls with the mustard seeds butter that tasted as good as they sounded!\n\nFor a chocolate lover, the dark chocolate snickers bar was the perfect ending to a sweet experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaGFMclpREAE",
            "text": "Food was great, service was great. The server we had was very fun and made our time there more enjoyable.\n\nThey also have Halal options"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdHV2WW5RRRAB",
            "text": "Very slow service and mediocre food. The food is way overpriced compared to better steakhouses nearby in NY. The waitress was very slow and rarely checked on us. The steak was bland, the lamb was raw. The only bright spots were the sides and the hostess who sat us down was very nice!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJM09lQ1F3EAE",
            "text": "We came here for hubs birthday celebration. We had a great time. They set up a card on the table and the service is excellent. I just wish there were more seafood options. I know I know! It's a steakhouse, but still, they only had 3 seafood entree options, which isn't much at all compared to other steakhouses. The food was cooked perfectly and great wine selection.\n\nNice ambiance, it can get a little loud, but the crowd overall was lively in a sophisticated way. Definitely would return here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkamVqU2d3RRAB",
            "text": "An impeccable experience, from start to finish! My partner and I were greeted warmly, and we were asked if we'd like to have the staff take care of our coats and bags. We were directed to our table and pleased with the lovely (and comfortable) seating and ambience. The waiters were so professional and knowledgeable about the menu, which was super important for my partner and I as we were looking for halal options on the menu (and they have a lot)! We were even offered the option to see the cuts of meat prior to ordering, got a thorough explanation of the cuts of meat, and briefed on what's halal. We went with the special of the day, which was a bone in australian wagyu cut for two. It was absolutely delicious, as were the fries and grilled prawns we had for the sides. We also ordered a mocktail which was excellent!!\n\nPost pandemic, as a Native New Yorker I really felt that NYC restaurants were on a sharp decline in terms of quality of food and overall customer service. This was not only the best meal I've had in a while, but it was coupled with excellent service that almost seemed synchronized. 5 stars across the board!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dk83eExBEAE",
            "text": "Absolutely awesome. The atmosphere is great. The food is second to nothing, and the customer service was outstanding. The staff that night really helped our group understand the menu and all the highlights which helped us have a unforgettable experience. Highly recommend if you are downtown Manhattan."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaExhcUl3EAE",
            "text": "We loved everything and the food was phenomenal!! Will visit again if we make it back to NYC. I had the red wine braised short ribs in polenta and chimichiri. English Pea agnoletti. We shared the Caesar salad which came with an amazing crustini!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNka19PaVZnEAE",
            "text": "First time here and loved the atmosphere of the place. Walked in and was greeted with big smiles and was attended to right away. That quickly ended when our drinks were brought to the wrong table. I let that go thinking it was an innocent mistake but noticed it happened throughout the whole restaurant. I ordered the rib eye and my partner ordered the New York strip both American wagyu. When the steaks came out both looked the same and was burnt on the outside and hard to cut open. My main highlight was the apple salad which was amazing and packed with flavor. I’m a new cook to New York City and was hoping to find some inspiration and started here. Wish our steaks received the same attention like our neighbors who got the tomahawk steak. We felt like if we didn’t order something big we weren’t going to receive the best product. Customers in the bar were very rude to us as well. I guess the more money you have the better treatment you get. Our waitress was very non existent even though we sat next to waitress station. Seemed like every question we had was an inconvenience to her to answer. She made it seem like we should know about this establishment. I’ve worked at a high class place and with a place like to claim their steaks are good is an overstatement. Subpar at most. Steak sauce is a big no no at steakhouse but make sure you order all their sauces. There is a reason they offer those sauces for free. The steak photo looks like a hockey puck. I ordered medium rare."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLMlptZUN3EAE",
            "text": "It was an absolutely wonderful experience. We were blown away. The level of service at this restaurant is close to that of a Michelin starred restaurant. Mary was an absolute pleasure to have. I cannot speak more highly of her. Beyond that, the meal was fantastic. The cocktails were very good, but a little pricey if I’m honest. I got the fluke appetizer. It wasn’t my favorite, and Mary took it off the ticket without me even asking. Me and my mom got steaks. She got the 12 oz prime strip. I got 8 oz of A5 wagyu. She loved her steak. Mine was on another level. You will never find steak that tender and juicy. The potato purée and the mac and cheese were phenomenal. Just an overall sublime experience. I haven’t been this full from a meal in a long time. If I ever visit New York again, I will return for sure. Expect a big bill but a great experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3LTViVkp3EAE",
            "text": "Excellent all around. Staff, food and service were all wonderful. Pricey but you'll get a fine meal/experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMmFtNEFREAE",
            "text": "Food was excellent. Service with a smile! Was my birthday so they brought out a slice desert with a candle. My husband said the steak was great. I had the wagyu Bolognese with a nice cocktail. Perfect evening. Decently priced and great ambiance"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLXRTNzZ3RRAB",
            "text": "Incredible dining experience. The staff was friendly and attentive and the food was so delicious. My son and I had the filet and it was perfectly cooked. We went a little crazy on the sides, but they were worth the indulgence. My son couldn’t stop eating the table caramelized onion bread. This is an expensive restaurant, but worth the price for the experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmM29hTWl3RRAB",
            "text": "Is my favorite steak house i ate there all my birthdays they cuts is amazing, and the cocktail angels in Manhattan is delicius, perfect service, perfect food, prives according with the all."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRNE1YaUNREAE",
            "text": "The food here was delicious. They don't have any vegetarian meal options but they have plenty of veg sides. The service was good although I'd prefer that they say \"excuse me\" before just coming and talking right in the middle of my…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMzRxUDRnRRAB",
            "text": "Went here for the winter Restaurant Week 2018. The menu had a good selection of dishes. I had the Tortelloni to start, followed by the Skate Wing and finished off with Strawberry donuts. The husband had the Winter Salad, Steak Sandwich and Apple Crumble.\n\nThe Tortelloni was yummy with both a creamy filling and rich sauce. The skate wing was fine. The sugar coated donuts were warm and divine, just can't beat a fresh donut. They didn't try to go for anything too weird for the flavour, just be careful eating it as the jam came oozing out. I also tried the apple crumble and that was nice too.\n\nThere was a small section in the drinks menu for non-alcoholic cocktails, which were on the expensive side ($14-16), but the Cracklin' Rosie I had was good. Nice to see they cater for non-boozy people.\n\nThe restaurant wasn't too full during lunch time, so, practically no noise to speak of and no background music either, a blessed relief. The decor was very swish, as would be expected for a high end restaurant next to the Four Seasons.\n\nOur waiter was a very pleasant chap and service was pretty quick. Oddly, they took away the bread plates before serving the main course, this seems to be happening at a few restaurants we've been to recently. Odd trend. Neat freaks?!?\n\nAnother oddity was the $5 supplement for the donuts, which I thought was bizarre. Surely that should have gone on one of the more expensive items on the menu? 🤷‍♂️\n\nOverall, a good experience and will go again if I'm in the area."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNV91YXlRRRAB",
            "text": "One of Wolfgang Puck’s high-end steakhouses located in a four seasons hotel was an exciting start. The atmosphere is prestige from the bar to the dining area. I asked the chef to pick out A stake that he would like to eat and how he would cook it and surprise me.\nThe filet mignon taste out of this world. I went with a mac & cheese,mash potato on the side\nFor apps I had Raw oysters and a scallop dish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bllpNWRBEAE",
            "text": "Everything was delicious here. Especially the halal tomahawk steak, and best halal ny strip we’ve ever had. Definitely on the pricey side but well worth it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeEtucTlBRRAB",
            "text": "I went here for date night, and I was thoroughly impressed with everything from the service to the atmosphere. Everything was top-notch. I was most impressed with the fact that I was able to check my handbag. I have never been to a restaurant where I was able to check my handbag. The menu was extensive many options for both food and drinks. The waitresses were very well knowledged on the menu. This restaurant is on my list to return to."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzbllmZHd3RRAB",
            "text": "I’ve been to CUT in Los Angeles plenty times and never had a bad meal there. Went to CUT NY for the week for a birthday trip. This one was a bit different. I always order the bone marrow whenever I dine at CUT. In LA, it comes out to you on a plate bone marrow still in the bone(tasteful that way). In New York, they serve it to you on a dish already scooped out and drown it in olive oil. I told the waiter, “we didn’t order scallops...” he said, “it’s the bone marrow and they don’t serve it in eight bone.” I was a bit disappointed. The rest of the meal was okay... I don’t like the fact that the desert menus are so different either. I was also expecting their delicious banana cream pie to be on the menu, but I guess that’s only in LA. The service was good, but I excepted the food it to be more like the LA location."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnallfc0F3EAE",
            "text": "UPDATE: NEW MUST-TRY DISH: Sweet Corn Agnolotti with truffle is AMAZING!!!!! The Black Forest Sphere was delectable.\n\nWarm, friendly service from the moment you arrive, until you leave. The food, speaks for itself, excellent, as always."
        }
    ],
    "reviews_count": 78
}