{
    "name": "Brooklyn Bread Cafe",
    "place_id": "ChIJ393MKQBbwokRUIZRHI5xf7I",
    "grid": "MN1",
    "address": "111 Murray St, New York, NY 10007, USA",
    "rating": 4.7,
    "user_ratings_total": 201,
    "phone_number": "(929) 586-2600",
    "reviews": [
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaWNFWkxSbGMyT1dGM1JUWlBZMmRZV0UxYVNFRRAB",
            "text": "My favorite is the bond street sandwich"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc2R6VnNRemsyWW5KS1ltUkdTRGQyYWpkVE4xRRAB",
            "text": "So accommodating and delicious sandwiches"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NVMzYzVYMVJsU1VOaVgyWnlXbE52WW1ORlpuYxAB",
            "text": "Best sandwiches and bagels in Tribeca"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWWFGaERibEoxUjBsRmVrNXZOSEJFU1U5SGEwRRAB",
            "text": "I have to say, we have ordered through this place multiple times, and every time it is a hit!"
        },
        {
            "date": "수정일: 6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNE16RXRVRmxSV0hkb1MycFJSRlZmZUdaUFMyYxAB",
            "text": "I’m happy to say they’ve exceeded expectations once again. My hospitality service recently ordered both breakfast and lunch from them, and everything was absolutely excellent.\n\nThe quality, presentation, and consistency were top-tier — clearly a team that takes pride in their craft. The corn muffins were perfectly baked, the Godmother sandwich was truly unforgettable, and the apple crisp easily deserves six stars out of five.\n\nHighly recommend them for both individual meals and group catering — reliable, flavorful, and professional every time."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWmJYSnNaRk4xUWpORmVVaDJWbXhMTWxsS00yYxAB",
            "text": "Unassuming and hard to find if you aren’t looking. It is a narrow shop so if more than 5-7 people are in here it would be packed. It is a small spot but packs a punch. They have freshly made cookies which I has. The churro nutella were awesome and I would reorder. The muffins looked delicious as well. I would however go with the bagels. Large fluffy and delicious. The turkey sandwich I got on a bagel was lovely. Would definitely come back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCV2J6ZENVWGQ0ZFhoTlVsUk5RMUJCZVhOSGFsRRAB",
            "text": "Excellent spot for lunch. Food tastes fresh & love that it has recently partnered with MealPal!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OeVJqbEVZakI1WDFBMVNtbGpibmRUYkhwcWVHYxAB",
            "text": "Came in for a chicken cutlet sandwich and I must say it was one hell of a meal.. fresh with deep flavor.. I even got a chance to meet the owner Lenny who happened to he walking by ensuring all customers are satisfied.. highly recommend this place for a quick lunch if youre in the area."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWlRHczBlVUoxWlcwM1YwRkRTbEJwVkVWemJuYxAB",
            "text": "We love Brooklyn Bread Company! We ordered breakfast sandwiches for the office and everyone loved them and they will now be on our regular rotation for breakfast and lunch. 10/10!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200M1ptMXpia3RaVEU5elRIUjVOMk5LTldGQlVWRRAB",
            "text": "Excellent"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rdGJtRkZTbWhoUm1sVVgwbGphVXRDUmxKRmRIYxAB",
            "text": "It was a pleasure with Brooklyn Bread and Lenny! The team was very responsive and helpful with all my questions, requests, and changes. I’m grateful for such a responsible catering team for our event!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOa2IwUTVRVXhJU1ZWTlpUZFRabmw2TFZScmEzYxAB",
            "text": "The store felt modern and updated."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NemFGOVlXRzl0TVVSUlRXWnpRWE5ZWkZObE5sRRAB",
            "text": "I ordered from Brooklyn Bread for a lunch meeting and Lenny, the owner, was so kind and helpful. You can do a catering order online but I preferred speaking to someone and Lenny answered my call. The food arrived 10 minutes earlier which I appreciated. The sandwiches were really good. Everyone enjoyed them. So if you’re looking for a business to cater, give them a call."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVFdWOXhNVUp1ZG1ObWVWZGxTRE5qVURGRGNGRRAB",
            "text": "Fire BEC on pumpernickel, the way they wrap up the cheese in the egg is like beautiful honestly. Bagel was nice and fluffy. Got a tropical smoothie too since I just finished a run, and I chose the Tropical Sunshine. It was pretty good and really fresh, although I did wish it was a bit sweeter, not in the sense of extra sugar but I feel the fruits themselves werent as sweet as normal but it still was a great pair to the sandwich."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkckxYZDJhMjAzWlRSMWMyeEtSR0UwZW1veFNrRRAB",
            "text": "Our office gets catering from Brooklyn Bread quite a bit!! They make a lovely and delicious hot breakfast, classic sammies and overall their delivery services/food is impeccable ❤️❤️❤️"
        },
        {
            "date": "1달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSc2FFMXpaVTV6VjB0dGRHRmlSbXhHVlRFMlJVRRAB",
            "text": "Pork Roll이랑 3 Cheese BEC 먹었다. 맛있다.\n캐셔도 나이스하고 다 좋은데 점심시간에 가면 미어터진다. 구글맵스에 있는 getsauce로 Pick Up 넣어두고 바로 받아오는거 추천."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQlNXVm1jV1Z0TldGT1FsWXllVlJXVEVOU1lrRRAB",
            "text": "Fresh food, pleasantly surprised. Only outdoor seating which was fine with us."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWVdYcE5TMjB5VUd0Qlh6QTVUblUyVW5odFYxRRAB",
            "text": "Tasty, filling, fast"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKV1ZEUk5SMnh4TVdSSk4waFFPVmhqU0ZkbGJVRRAB",
            "text": "Fantastic food. Their fresh pressed juices are my favorite. Awesome staff always."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxelFVMXFaa05aV1cxVE5GSnBhVlF3VWtodVpXYxAB",
            "text": "I work for a wedding planner and we often use Brooklyn Bread for large catering orders. They are always friendly, accommodating, and reliable. The food is fresh and delicious, and they’re consistently on time, which is so important for events. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMVZXVnZZa3RxUTNvMmEwcHBYMUV0WjJNeU5HYxAB",
            "text": "Bagel was amazing, everything was so fresh! Will be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVWF6SjFYMXBGWVZCMFJVSnBhMlEwTFVGRlEyYxAB",
            "text": "We stopped in on a Sunday morning for breakfast before doing some sightseeing.  We got two breakfast sandwiches, a strawberry fields bagel and a cinnamon roll.  The bagel and bagel sandwiches were the stars.  Reasonably priced for NYC.  Enjoyed eating on a copy of little outdoor tables.  Friendly service.  Seems like there are limited options in this area and we would highly recommend this spot.  You won't be disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeVJrVTNTRTlHYWtjeWVtUnJMV3RUWld4RExWRRAB",
            "text": "They do not skimp on the fillings. They toasted my bagel just as I requested. Perfection!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTVNrUjBXVWwwZDJNd05tY3RSVlZLZVdwTmEzYxAB",
            "text": "Really happy to have found this place! Not as flashy as some other sandwich shops but this one is a GEM! We had a chicken sandwich, acaii bowl and coffee and enjoyed by the water close by. 10/10 start into the day"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONWEzUktXVVl0V21vemVDMXVjRnBTVFd4VFIxRRAB",
            "text": "You might want to skip if your in a hurry or use Meal pal. They insisted I check off \"picked up\" on my meal pal order then made me wait over 25 minutes for my sandwich. Didn't seem to care when I asked about it. Did the same thing to the next Meal pal order right behind me"
        },
        {
            "date": "3달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTmRqUm9OM2hWVERBNGVVMXljMWt3WkROYVExRRAB",
            "text": "Zeer goed ontbeten"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbFFWcEdVM2t4VTNCV2ExQjBjVFpFT1ZsbVVYYxAB",
            "text": "Brooklyn Bread Tribeca is conveniently located next to my apartment building, and I have a favorite sandwich called the BENNY BLT that I order regularly. The serving size is very generous. Great food here!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMFNtOXROa0ZuUWw5Rk5VNUhSRXA1ZGtsTlJWRRAB",
            "text": "My breakfast was so amazing. Way bigger than I expected and I’m not complaining!! The bagel was soft an delicious. Will be back"
        },
        {
            "date": "4달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSFRFazVPRXRoUlc5NVdFZDZOa3d5V0ZSWlUyYxAB",
            "text": "매장 안에는 일자로 되어 있는 테이블이 있고 최대 네 명까지 앉을 수 있습니다\n밖에는 테이블이 총 일곱 여덟 개 있고 매장에서 식사하신 분만을 위한 장소로 되어 있네요"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pka09GVTFOM2hFTjNGelNXSTFaRTVsV1ZCb2JGRRAB",
            "text": "Turkey wet."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQTDRqNkNLNnF2bmtnRRAB",
            "text": "Great experience having them cater breakfast and lunch. Food was great, my guests loved their wraps. Service was great as well. They were easy to reach and flexible with deliveries. Would go with them again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbUh5X1MxbUpqempBRRAB",
            "text": "Hands down the best quality and value in the area. The service is amazing, sandwiches, wraps, and salads are delicious.  Plus, the portions are huge and high quality.  The bread is to die for!\n\nWe have used them for catering, and all my staff goes in at least once a week to pick up lunch.  100% a fan of Brooklyn Bread Cafe.  Lenny always takes care of us and we will be back again next week!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQeUd1NzZvdC16U2RnEAE",
            "text": "Brooklyn Bread never fails - all of the sandwiches I've tried are delicious! They have such a wide selection so they'll have whatever sandwich you're in the mood for.\n\nSome tips:\nIf you order on their website you can skip the line (but be prepared to pay sauce a fee..), but the wait time/line usually isn't too bad. Also, if you're not crazy about sauces, you can request sauce on the side! Thanks so much Brooklyn Bread!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPYWttUHlKbnF5Wkp3EAE",
            "text": "Good bakery items… nice atmosphere.  However, I am very experienced with 25 years of NYC cappuccinos.  Brooklyn Bread fails here big time….weakest Capp I've had in a very long time…. don't think the staff knows the shot to cup size ratio at all."
        },
        {
            "date": "5달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKajgwX2k4bS12UDFnRRAB",
            "text": "10/10!! Lohnt sich zu 100%, pro Person ca. 20 $"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZjZwNm1ta05mWnR3RRAB",
            "text": "Wow wow wow! Thank you to Lenny and everyone from Brooklyn Bread!!!\n\nOrdered catering for an event and they made it happen. On time and everything was fresh.\n\nMuffins, bagels, sandwiches and more - you cannot go wrong by ordering from Brooklyn Bread  :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPTDUwOG1pX2QyQUVBEAE",
            "text": "Missed going to the Brooklyn location, glad they’ve made it to tribeca"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYmstNU9iaUlmWi1nRRAB",
            "text": "The food is great! Everything is fresh and delicious, it’s a little expensive thought."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJMzFzTTJnaWNxa1hnEAE",
            "text": "This place is seriously one of the best lunch spots I’ve been to!! I got a matcha smoothie and the tuna avocado salad to be healthy—and I have zero regrets :) The salad was honestly one of the best I’ve ever had (no kidding!).\nThe Brie and ham wrap is also a treat! Guys try this place out !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeGZmb2JREAE",
            "text": "The most beautiful and delicious spread of food! Fresh and incredible flavors! So much variety! Highly recommend for all occasions!"
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd2NqenlRRRAB",
            "text": "Die Lage des Brooklyn Bread Cafe ist super – direkt in der Nähe des World Trade Centers, was es zu einem idealen Spot für ein schnelles Frühstück oder einen Snack macht.\n\nWir hatten einen Bagel und eine Acai Bowl. Der Bagel war deutlich größer als andere, die wir in New York probiert haben. Geschmacklich war er nicht ganz so gut wie andere, aber dennoch definitiv lecker und gut essbar. Besonders hervorzuheben ist, dass er genauso viel kostet wie bei anderen Läden, aber eben extrem groß ist. Für meine Freundin hat schon ein halber Bagel gereicht, um satt zu werden.\n\nDie Acai Bowl war absolut standardmäßig – nichts Besonderes, aber grundsolide.\n\nEs gibt keine Sitzmöglichkeiten im Inneren, es ist ein reiner To-Go-Laden, was für uns aber kein Problem war.\n\nInsgesamt ein guter Ort für ein schnelles Frühstück oder einen Snack, besonders wenn man in der Gegend unterwegs ist."
        },
        {
            "date": "6달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNnNiRGRnEAE",
            "text": "배터리파크 산책하고 우연히 들어갔는데 맛있어요\n로컬 사람들도 많이 사가더라구요 굿"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeUtyVnd3RRAB",
            "text": "Great food and service. Will certainly order from Brooklyn Bread again!"
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcGFqRFZ3EAE",
            "text": "Wir waren zum Frühstück vor Ort.\nIm Laden selbst gibt es nur Stehtische, draußen mehrere Tische.\nWir hatten 2 Bagels bestellt, die sehr gut geschmeckt haben!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOHI2bEJ3EAE",
            "text": "Recently hosted an event and could not have been more thrilled with the catering experience with Brooklyn Bread Cafe. The service was impeccable, friendly and easy. Will definitely keep Brooklyn Bread Cafe for future events!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdDRMaVVBEAE",
            "text": "The staff here is extremely racist at least the Mexican staff. After ordering some breakfast which absolutely sucked I realized I left my bag with some very important documents. I go inside and ask the guy at the front counter and he says there's no bag. There is another employee who is hearing the whole conversation knowing she knows where my bag is but doesn't say a word. I decided to ask her and she describes my bag and says to ask one of the other girls behind the counter who gives me my bag. Keep in mind that the girl who described my bag heard me ask about it when I walked in and would have let me walk out without my bag if I hadn't asked her directly. A horrible staff to match the Horrible food."
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvd29lSHBBRRAB",
            "text": "Au top, service rapide, petite faim un b16, une grosse faim b19, sandwichs généreux, espaces extérieurs pour se poser.\nJe recommande vivement"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvZ3JYTjJ3RRAB",
            "text": "Hard to find a good Taylor Ham egg sandwich, but this place nailed it. The bagels are legit & the everything bagel had more flavor than most others I’ve tried before."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa1phSER3EAE",
            "text": "I got the Montague St. It was very good. First time ordering here. I wish there was as much pastrami as the pic on the app menu haha. Will be ordering again though. Thanks!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNHJhZ2xBRRAB",
            "text": "Best breakfast wrap i’ve ever had. Get the vegan hash in a wrap instead of a bagel."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJb1pMRXBRRRAB",
            "text": "We recently catered from Brooklyn Bread for a union event with over 230 members, and it was an absolute hit. From start to finish, everything was smooth, professional, and delicious. The food arrived fresh, hot, and right on time — which is no small feat with a crowd this size. We ordered the executive box that comes with a sandwich, soda, chips, and a fruit.\n\nWe ordered a wide variety to suit different tastes: the Vegan Hash, BB Ruben, Brighten Beach, Mila, something close to the Mary B., Chicken Club, Hangover Chick, and the Gabagool — and every single item was a standout. You could tell everything was made with quality ingredients and real care. Nothing tasted mass-produced — each sandwich had its own flavor and identity, and people were raving about them during and even after the event.\n\nOur members are still talking about how good the food was. Brooklyn Bread truly made the day feel thoughtful, enjoyable, and well-fed — and we’re incredibly thankful. Highly recommend them for anyone looking for top-notch catering and genuine flavor. We’ll absolutely be ordering again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyX2F5eW5BRRAB",
            "text": "Even though the staff moved quickly, and clearly most people were locals, they still kindly stopped to briefly answer a few questions I had. I ordered a simple everything bagel with cucumber-dill cream cheese and an iced coffee. Tre' yum! Bagel was fresh, pleasantly chewy. Cream cheese was tasty and generously smeared on. Coffee was great! Nice little bench area with trees next to it. Great in the summer."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRck9xX0xnEAE",
            "text": "I would call myself a bagel snob as I have had some really great bagels before…that being said…..these are probably the best bagels I have ever had. They are big but light and soft with the perfect crisp outer edge. My partner had a “honey apple” sandwich and said it was also phenomenal. If you are in the area definitely stop here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeXNIRTBBRRAB",
            "text": "Very excited they finally opened! They have a HUGE menu — bagels, brunch items, specialty sandwiches, and salads.\nI got a spicy tuna bagel sandwich. The bagel was huge and chewy and crunchy, and the flavors were super unique and well-balanced.\nCustomer service was fast and friendly, even during lunch rush.\nJust note that the space is very narrow, and you have to squeeze around other customers to get to the back to order.\nOverall super excited to have it in the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bC1MaDlBRRAB",
            "text": "We visited Brooklyn Bread Cafe for breakfast and it was worth the walk from Tribeca! The bagels were fantastic, with so many different options to choose from. I had the one with avocado, bacon, and egg, and it was delicious. The cafe is walkable from Lower Manhattan, making it a great spot for a morning stroll and a tasty breakfast. Highly recommend checking it out if you’re in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZy16ZXd3RRAB",
            "text": "Really awesome spot! Although the cream cheese slightly lacked in flavor, the bagel was extremely well seasoned and fresh! The staff was super nice, and the atmosphere was great! The music was such a vibe!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNU8td1hnEAE",
            "text": "I’ve moved out of New York now for many years and I needed to find a place that would deliver a beautiful breakfast from my team in New York City.  The bagels had to be delicious just like I remember them and you know what they were.  I ordered from Brooklyn Bread Café on Murray Street. Everything was beautiful the presentation. The food was delicious. I got raving reviews from my party in New York who were very happy with the bagels muffins and danishes. It was delivered on time and I was very happy with the service when placing the order as well. You need to stop into Brooklyn Bread Café on Murray Street"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbE5fSUV3EAE",
            "text": "As I stepped into the café, I was greeted by a vibrant and energetic atmosphere that exuded the unmistakable Brooklyn swagger. The interior design was trendy and modern, creating a welcoming and hip ambiance.\n\nThe first thing that caught my attention was the eye-catching display of big, delicious bagels. They were beautifully arranged, with a variety of flavors and toppings to choose from. The sight alone was enough to make my mouth water and excite my taste buds.\n\nBut it wasn't just the bagels that impressed me. The aroma of freshly brewed Colombian coffee filled the air, creating a tantalizing and invigorating scent. The rich and robust fragrance was a true delight to my senses, and I couldn't wait to savor a cup of their fabulous Colombian coffee.\n\nThis café is a fantastic addition to the neighborhood. It brings a unique and trendy vibe that perfectly complements the local scene. The combination of delicious bagels and exquisite coffee is a winning combination that fulfills the cravings of both locals and visitors alike.\n\nOverall, I can confidently say that this place is a gem. It offers a delightful experience from the moment you walk in, with its energetic atmosphere, fresh bagels, and fabulous Colombian coffee. It's exactly what our neighborhood needed, and I'm grateful to have such a fantastic establishment right in our midst."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyX19tWnhnRRAB",
            "text": "Brooklyn Bread’s catering is the absolute best food and service in the NYC and Brooklyn area. If you want delicious food and easy hassle free ordering and service - you need to try Brooklyn Bread!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMnQySUdREAE",
            "text": "Wow. I’m so glad they’re finally here. They have such tasty custom sandwiches here at Brooklyn Bread. I would definitely recommend this place.  The pricing is very efficient compared to the size of their bagel and hero sandwiches. You can also create your own which is top tier 😎. Overall, very satisfied with this new addition to the neighborhood. They also have a cute seating area outside where you can eat and enjoy the view !!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbmFxbmJnEAE",
            "text": "Lenny and the team at Brooklyn Bread did an amazing job catering my breakfast meeting. They accommodated  a very large order for the very next morning when I called only 5 mins before they were closing. The food was great, clients loved it and appreciated how well everything was packaged. Thank you BB! I will be using you again for future events."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdTVYMFZnEAE",
            "text": "Ordered the Lucky Luciano sandwich, see pic piled high with prosciutto. Sandwich was really good. Really small & narrow in side. Staff was okay, felt like I was a number."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyaDQyOU1REAE",
            "text": "I ordered Brooklyn bread catering for my son’s 10th bday party. All I can say it was amazing!! From planning it with the owner Lenny to getting it delivered and setting it up for my guests. Both the adults and kids finished every bite.  Unfortunately I didn’t have anything left to take home.  I will be ordering again for my next event and I can’t wait to stop by and have some lunch there."
        },
        {
            "date": "7달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cDlhZ29RRRAB",
            "text": "Niesamowite miejsce, bardzo miła obsługa i przepyszne jedzenie. Nasze bajgle były przepyszne. Szukałem nowojorskich bajgli i dostałem to czego szukałem. Przepyszna, świeża bułka wypełniona smakiem💪🙂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNElUTXRBRRAB",
            "text": "Absolutely loved my experience at this bagel place in Tribeca! I ordered the \"Bushwick,\" and it was incredible. The bagel tasted so fresh, with the perfect balance of flavors from the eggs, avocado, crispy bacon, sun-dried tomatoes, and a kick of sriracha mayo. It was very big and filling. Plus, the service was impressively fast, making it a perfect spot for a quick yet satisfying meal. Highly recommend this place for anyone craving a delicious bagel! Also got a cappuccino. Five stars"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdFBySTFnRRAB",
            "text": "Awesome, delicious sandwich on very tasty bread! Very big sandwich, if that's what you're into- I took half home with me.\nLots of options for sandwiches as well as sweet/desserty options. VERY friendly and kind staff! Only a few spots to perch inside and eat, but some umbrella covered tables right outside, and a lovely shaded park area as well.\nWould love to eat here again and try everything on the menu!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNHRDZWpnRRAB",
            "text": "Stayed over night in NYC and tried here out for breakfast this morning… absolutely delicious! Whole wheat bagel, turkey bacon and pepper jack cheese. Delivery was even a half hour early! Ketchup was missing but I don’t even care, it didn't even need it! Highly recommend if you’re looking for a tasty, super-filling breakfast sandwich. Thank you :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudEpLY0lREAE",
            "text": "Wow i would say this is the best sandwich i ever had in nyc so far. Fresh bread! Fresh chicken and friendly staffs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbGJMSjl3RRAB",
            "text": "I've been a BK Bread Cafe fan for a few years now and super excited to now have a city option. Food is always hot and fresh with an array of options even for a pescaterian like me. They also offer catering which is my jobs go too option for working lunches. Welcome to the city, Brooklyn Bread, love the new space."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOHFDalNREAE",
            "text": "I came here after seeing a couple of reviews on yelp for\nBrooklyn Bread Cafe\n.\nBrooklyn Bread Cafe\nis terrific. Didn't expect it but,\nBrooklyn Bread Cafe\nwas really fantastic. Very pleasant service with a good mood. Really welcoming service with a good ambience. Courteous staff and great mood all year round. Every single thing I've tried until now is good. I honestly have no words that can possibly describe how amazing the items that I got were. Pretty much every item that we have ordered was really fresh and tasty. Staff are incredibly helpful and service is really swift. Everyone at the\nBrooklyn Bread Cafe\nwas so charming and accommodating. From the beginning, every one has been so incredibly friendly. Wonderful place to visit with family, friends, and significant others. I can not say enough good things about this place. Can't wait to come back to\nBrooklyn Bread Cafe\n."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQamQtWXVnRRAB",
            "text": "Great food and great service. Had a catered lunch for the team and it was a hit. Everyone loved the chicken cutlets!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYd1BlYy13RRAB",
            "text": "As a first time customer, I can easily say the food quality is above average, the setting is nice and the location is convenient for me.\n\nSome people can be fine with this, however I did not appreciate having an unknown condiment added to my bagel.\nI don't even know what kind of condiment this is, its white, buttery and kind of sweet?\nIf this is a gimmick of the restaurant I wasn't really prepared for it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NGVUTWhRRRAB",
            "text": "I was looking for a breakfast place to order for a client and came across Brooklyn Bread on Murray Street which was relatively close to the office. They offer several breakfast bundle options which I appreciate along with several different side items to possibly add.  I worked with Roger on my order and he was patient, answered all of my questions, and provided suggestions/options for my breakfast order.  I arrived at the office until 2 hours after the ordered was delivered to learn that all was delivered on time, the food was fresh, nicely organized/displayed.  I was very pleased with my catering order from Brooklyn Bread and would highly recommend them.  Another nice thing is, they do offer gluten free bagels (plain only) if you place your order in advance."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dXFfaEJnEAE",
            "text": "I find this place is pretty great; great bagels, good pastries, fantastic variety, yummy sandwiches. I had the 5th Ave sandwich on a bagel when I was very hungry one time, and it was one of the best meals I’ve had in a while. I always recommend to people who visit or are in the area if they are looking for a good bagel or sandwich!"
        }
    ],
    "reviews_count": 74
}