{
    "name": "Serafina Financial District",
    "place_id": "ChIJU4Y5bNNbwokRu8Y53Q4_PdY",
    "grid": "MN1",
    "address": "30 Broad St, New York, NY 10004, USA",
    "rating": 4.6,
    "user_ratings_total": 865,
    "phone_number": "(347) 647-9030",
    "reviews": [
        {
            "date": "4시간 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0a01YbEdVVXQ2VEZGbVlWb3lXVlJuUjB4TlJtYxAB",
            "text": "Nous avons passé un merveilleux moment lors de notre déjeuner accompagné par Selma.  Très professionnelle, discrète,  agréable, vous avez une serveuse de très grande qualité. L'ensemble  de l'équipe était au top, une table excellente avec des plats raffinés. Merci pour cet accueil, la Maillet Family's."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRFdqVnNNemxOUXpoUFRFTkxTRnB0UzJzMFEyYxAB",
            "text": "💓"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeU0zSldjREo1Y0hka2JWSjNVRTV4VVUxUFVsRRAB",
            "text": "I love Serafina. Any location"
        },
        {
            "date": "3일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cFprcDFSRUZDUjNkVFIwbEZTM1Z3VWpoMGVFRRAB",
            "text": "Un sitio genial y la atención de Jonathan de 10 .\nComida maravillosa"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ob2JIQm5Oak54WDNGNWRWY3lhMlpqTVU5Rk9YYxAB",
            "text": "Loved my experience and food!!!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TlMydGlaVEZrTm5WMU4ydENZM0k0YzA1RmJHYxAB",
            "text": "I had a takeout pizza, the service is very good. Pizza however is saggy, probably is better if dined in."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUE16QkxSVTB5ZEVKSk1uZHdaRXRLYm05WWFFRRAB",
            "text": "I’m usually the first to cheer on local businesses because I love supporting the neighborhood. So, I’m genuinely heartbroken to write this review.\n\nMy family and I ordered from Serafina on Friday, excited to share a nice meal together, especially since my brother was visiting from Florida. We ordered the seafood risotto, three pizzas, and the Capri Salad. Unfortunately, the experience was a major letdown.\n\nThe pizzas were soggy and lacked flavor, and the risotto was even worse. It was completely inedible! We ended up throwing most of the food away, which was incredibly frustrating and disappointing, especially given the cost. It’s tough to write something negative about a place I wanted to love, but I hope this feedback helps them improve. I have ordered form the other location on Tribeca, but this location was a major let down!"
        },
        {
            "date": "2주 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WlpreEJSRGs1VVhjMFJEQnlOMFpDUjFKSFdYYxAB",
            "text": "Das Essen wie Salate und Desserts schmecken ausgezeichnet. Hervorheben möchte ich die Lobster Ravioli, sie sind schlicht phantastisch. Auch die Weine sind von guter und gehobener Qualität. Der Service, besonders Selma, ist zuvorkommend und ausgesprochen freundlich und herzlich. Meine Frau und ich haben uns im Serafina sehr wohl gefühlt; wir haben dort in 10 Tagen dreimal zu Abend gegessen; das machen wir höchst selten, aber hier hat alles gepasst. Chapeau für den Koch, ein Meister seines Fachs."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214emNWZDZhbU5CZFhsR1NubDZRbGxOVEZWU1NGRRAB",
            "text": "Excellent service,  relaxing atmosphere, fantastic food.   Crispy thin crust with good flavor,  so nice to eat just on it's own.  Toppings were well balanced for the size (12 inch), and lots of pesto for pesto lovers.\n\nA great place to wind down with a friend, date or partner after work."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRWQwdFRXV1F3V25aWWQwZEZWR2xLTFZwRlNHYxAB",
            "text": "Very nice discovery. We ate in this restaurant 2 times in the period 02.10-05.10.\nOriginal and very good appetizers.\nWe ordered to share, and have had great advice from the service, her name was Marina (tnx again).  We had a great time, good food and tasty deserts in this beautiful place  ( tiramisu was really good). We actually returned on the last day before our trip and enjoyed it again. I highly recommend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1emJuZ3RVMGxrVGtsdWJrRjRURGgzZVVWRGJFRRAB",
            "text": "Went in last night for the first time, was recommended by a friend. Will definitely be returning!! The bar tender (aiden i think?) was so funny and attentive. The food was was great and overall will recommend"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobmQycE1OV3hMU2pGcWVXbG1PVzFvWldjNWFWRRAB",
            "text": "I come here now since Tribeca location no longer serves pizza.\n\nI really enjoy their pizza since crust is so thin and light and hard to find especially since they close down a great place near meatpacking.  Cheese and sauce very good.  I like how they give you a lot of cheese for certain pizzas.  Their lasagna is a hit as well.\n\nAmbiance here is nicer but you can never get end bar seat next to wall since employees always sitting there after work.  In fact, most of bar customers are employees!  I came a few times and same thing every time and then I realized why and it is because manager himself sits there, too.  Reap wat you sow.  I think no customer can ever sit there because all their notes and notebooks occupy that bar area as well.  I don’t really want to sit at other end because servers get their drinks there and so that only leaves me middle area lol.\n\nAnother time, an employee was sitting at the bar and vaping.  Unless they allow vaping at this branch, this is not only unprofessional but basically a health hazard.  Sorry, I don't want to dine while breathing in poison gas.\n\nHopefully, they bring back pizza at Tribeca location because I like that branch more and it feels more hospitable for customers."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbVZtTTJlbFF3WW1GVFVXTm9OWFZXVkhaQ2RIYxAB",
            "text": "Finished a short work trip with dinner at Serafina. Had delicious bruschetta with wonderful lobster ravioli. So so good!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUmJ6WkxiRzE1WVdaWGNuTk9OSFUzVUU4elptYxAB",
            "text": "Inedible"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RdGRsbENja0Y2VWsxTGRsRlpiamxGZEhRMlQxRRAB",
            "text": "Great drinks and specials. We were served quickly, and the pasta dishes were fantastic. The only complaint is that the restroom is tiny, and only one person is available for everyone."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xalRWcExUVWxLWkdSSmNHZHBiWEV3YWs0MlEzYxAB",
            "text": "Seafood risotto was EXCELLENT. Amazing service from Selma and nice ambiance - 5/5 experience"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcFpqRmxjRTh4YVUxemIyNWxhSEpaU0ZNMWFGRRAB",
            "text": "Food is always delicious and beautifully cooked!! It’s a restaurant I always love to come to. Jenifer was just delightful!! Great service!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkc09VcGZkaTAzWHpOZmRUSTBUbFpzVDNkWlRFRRAB",
            "text": "Authentic and perfecto!!!"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aWNUYzRjRE16UVVOWFpXSktjVlJaUVhkSFQwRRAB",
            "text": "Comer en Serafina fue una experiencia muy agradable. El lugar tiene un ambiente elegante pero relajado, ideal para disfrutar sin prisas. La pasta está deliciosa, se nota que usan ingredientes frescos y el pan que sirven al inicio es buenísimo. La atención fue amable y el servicio rápido, incluso con el restaurante lleno. Los precios son justos para la zona y la calidad que ofrecen. Perfecto para una cena tranquila en Nueva York con buena comida italiana y buena vibra."
        },
        {
            "date": "3주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcFZqaDJXWEZoY1hwTVpUUmhlRFk1TFV0VU1sRRAB",
            "text": "Bel endroit juste un peu bruyant"
        },
        {
            "date": "3주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaFZXdENXbEp2YjJ0bFpDMTFVbEoyWVdsV2RXYxAB",
            "text": "Au top, belle découverte"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSVdIQjVlWFpRZEVFM05sZGpPVWt6ZDBaT2RWRRAB",
            "text": "Very nice discovery. We ate in this restaurant 2 times in the period 02.10-05.10.\nOriginal and very good appetizers.\nWe ordered to share, and have had great advice from the service, her name was Marina (tnx again).  We had a great time, good food and tasty deserts in this beautiful place. We actually returned on the last day before our trip and enjoyed it again. I highly recommend."
        },
        {
            "date": "4주 전",
            "language": "iw",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSmFrVjZZbFZJV0hWcWVuVXdYM2RrZUhoSGJIYxAB",
            "text": "אוכל בינוני. לא מומלץ"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMWNtRm1ka2gwUjJKd1NrWnZXbEJJVFRCck1IYxAB",
            "text": "Let me start by saying that I'm italian.\n\nNice food, nice wine selection, nice service, nice ambience and I also managed to work a bit."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa1JXRkJaMHRHUkVGdmFuRTNOVTUwU0ZkVmQzYxAB",
            "text": "Food was good although not amazing for the price. Nice atmosphere that felt welcoming but also has a nice vibe."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSmQwZGxjbHAxV0dseFVuaENVa0ZRUWxCWU9XYxAB",
            "text": "Great atmosphere/ambiance.\nFood was great, Drinks were 👌👌👌👌👌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSU5VcGFkWE4yVVVSTGIzTnlUR2xtTkdsTVdFRRAB",
            "text": "Service was so fast, food was good, atmosphere was good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NM1gxaHRYM0JGWkU5YVdXSjBXVlUxWlRGT05uYxAB",
            "text": "The food was delicious. They have a new chef so the menu has been updated but everything tasted great! The service was a little low but everyone was friendly and the atmosphere was great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMGFpMWllRU5SWmtZdFZFMHRMVjlrV0ZNMmFYYxAB",
            "text": "Great food and Service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneVlXdHlPRkpUVjI1RlZVZE1lR1ZWYkRsVGVXYxAB",
            "text": "Augustin did an amazing job as our waiter!  Food was absolutely amazing and the atmosphere was so nice!  Highly recommend and would come back again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNmFYcFBTV3RzU2tWMWJFeHJVRkpETUdkdlFVRRAB",
            "text": "The food presentation was good but my chicken parmigiana was fry and tastes like it was precooked then warmed and served. My wife’s lobster ravioli seemed to be something their food distributor sells. Overall the atmosphere, drinks and service were good with below average food quality for the price"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVFZHWm1Ua1ZQYVc1UFVETTRWVXR5UW1oaFJHYxAB",
            "text": "Very recently my daughter celebrated her 21st birthday here for dinner with a few friends.  The food is great, nice drinks, friendly service and mgmt, great down-tempo intimate vibe.  Chic decor, nice dim lighting. She had an absolutely wonderful time!\nThank you to the incredible staff!"
        },
        {
            "date": "1달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcU9IZE5VV2RNYUROdGNDMUdhVXhNTkhWeExWRRAB",
            "text": "Excelente comida a preço justo."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Qll6aG9hM053VFcxV1VrMVVaVTFFZDJJdFUyYxAB",
            "text": "Great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UGMwRmFTSEV4UlhkSExXeHNPVXhrU2xNNWNWRRAB",
            "text": "Serafina great ambiance, service and food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdmRGQnJSRWQzUkRGemNYZDJaMnN4V1RreWNWRRAB",
            "text": "I am still surprised that this place has such good reviews when in reality food is plain and mostly tasteless.\nWe went for a family dinner, had high expectations bc of overall reviews, but unfortunately food was too plain.\nOrdered different pastas and a pizza, all tasted like just a tomato sauce mixed with macaroni without any seasonings, and had no taste. Overall, not worth the price for the taste you get. I’ve been to many Italian restaurants, as well as the ones in Italy, and these pastas and a pizza were nowhere near close to them.\nInterior is beautiful, and atmosphere is pretty good. Service is ok, except when we just asked for a water and they almost charged us $10 for it (they brought some expensive bottled water), then we asked to replace it for the simple tap water."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZak5lekNREAE",
            "text": "Was in NYC Financial District for business and we all wanted Italian and went to Sarafina. The service was great, the staff were all friendly and helpful. The Negroni was nice, the Meatball appetizer very good. Others on the team ordered the Seafood Risotto and loved how fresh and tender the clams were. I had the Cacio e Pepe was great, the spaghetti was al dente and the cracked black pepper was freshly cracked so it had a good, rich, peppery flavor. The Pistachio Tarte was exceptional, not too sweet at all. We could not have been happier to have eaten here. Thank you to their entire team.\nStopped in again and the meals were just as good as the other visit and the staff was just as friendly. Highly recommend this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eGVHaGlWMFpDTWxaeWJGbFdiMlpXWVRkUVpXYxAB",
            "text": "After reading the reviews, it's very possible that we went on an off day. The Brussel sprouts were dry and the lobster ravioli did not have a good flavor to it.  The pepperoni pizza was just okay but the service was commendable."
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbS1EMDV3RRAB",
            "text": "Tutto buonissimo, primi eccezionali (cacio e pepe davvero buona, fa invidia ai migliori ristoranti romani, e carbonara) e dessert buonissimo (affogato al caffè). Caffè molto buono.\nServizio non veloce ma super sorridente. Devo segnalare che la ragazza ha versato fuori dai bicchieri entrambi i caffè degli affogati 😅\nSi erano dimenticati di portarci prima dell'arrivo dei primi una birra, e hanno recuperato egregiamente non includendola nel conto.\n\nPrezzo tutto sommato in linea con NYC, c'è da considerare che il ristorante è letteralmente di fianco alla NYSE!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxS1ZHSmFjbFJsWWxOUVJsWkxNM2wxTFRkNWFVRRAB",
            "text": "We had such a wonderful experience at Serafina! I ordered the Chicken Milanese, which was perfectly crispy on the outside and tender inside, and my fiancé had the Steak Frites, cooked just right and full of flavor. We also shared the crispy burrata special, and it was absolutely delicious, definitely a must-try. On top of the great food, our server Selma made the evening even better—she was warm, attentive, and made us feel so well taken care of. We’ll definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeVV6Qk5VMGxJYTNKbFJXdFZibFpLUkY5YVdGRRAB",
            "text": "Sapori di casa. Da Serafina si può ritrovare un pezzo del Bel Paese nel cuore di Wall Street senza alcun tipo di retorica. Io, mio marito e una coppia di amici abbiamo passato una piacevole serata con pietanze e un conto che rispecchiava appieno quanto proposto (in allegato il nostro conto). La presenza del simpaticissimo chef Danilo accorso al nostro tavolo ha ovviato anche alle incomprensioni linguistiche, facilitando una serata rilassante in un clima disteso. Super consigliato!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taT2JteHZTbEpVY210YVJYb3hRbkIyTTFZeldtYxAB",
            "text": "Unfortunately, the pizza (Fungi) was a real letdown. The dough was soggy, the mushrooms lacked flavor, and the overall taste just didn’t come together. It felt like it was thrown together without much care.\n\nThe place itself seemed fine, and service was okay, but when the main dish is this disappointing, it’s hard to enjoy the rest. Wouldn’t come back for the pizza."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGR1UzUXlNV2hKYkVSblpVSTRiVFJzTUZwMGNtYxAB",
            "text": "Selma our waiter was amazing. She gave the best recommendations of food and drinks and the food delivered. We got the meatballs, the burrata, the tartar and the desserts which were to die for but the highlight: Selma’s service, care and attention, we felt like home. And Serafina is such a cozy and cute place to come with family or friends"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLX1puNHlqcHVuNjZnRRAB",
            "text": "The food was amazing. Gabriella, the server was so sweet and kind, her service was also great. Highly recommend this spot for yummy Italian in the area"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNGJWY3liSGxaV2tkQlZVbG1WVGsxV0dsS05FRRAB",
            "text": "Excellent choice given how many other Italian restaurants are in the area! Great food and the staff were very friendly and welcoming!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJN183R2Z3EAE",
            "text": "Restaurante italiano.\nMuy agradable.\nTuvimos una experiencia excelente en este restaurante italiano. La comida estaba deliciosa, con sabores auténticos y productos de calidad. Queremos destacar especialmente el trato de Jonhatan, que fue simplemente perfecto. Nos atendió con amabilidad, profesionalidad y nos ayudó a elegir los platos recomendándonos opciones que resultaron todo un acierto.\nSus compañeros también nos brindaron un gran servicio. ¡Repetiremos sin duda!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqc29mUTlRRRAB",
            "text": "This place is amazing! It has become our go to place after work and it was the best decision. We came for the food but we stayed for the drinks, food and the staff! Frank and Juan are the best! For a person like me with food allergies they have always made sure that I got something I loved but was safe for me to eat. Let’s not forget the cocktails that they have and have made on the spot to our liking. Thank you! We will still keep coming!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbE4yOURTek5UUm14WlRscDRWRVpYZEhONlMzYxAB",
            "text": "Excellent location and service. Food was amazing, and I am telling it as someone from Italy."
        },
        {
            "date": "4달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcU0za3hUREJHVHpBNE9ETTJjMnBhVWpoU1JFRRAB",
            "text": "Dopo giorni di hamburger tacos e pollo in tutte le salse abbiamo cenato in questo ristorante super accogliente dove abbiamo mangiato molto bene… lo chef Danilo ci ha fatto sentire orgogliosi di essere italiani a New York… Danilo rappresenta il meglio della gioventù italiana che lotta per la sua passione ovvero la cucina del bel paese 👏👏👏"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPMmg3WS01czg2OVFREAE",
            "text": "On Mothers Day, we had the special menu of artichoke lasagna and lamb chops. The margerita pizza with basil and olives had only two leaves of basil as garnish and five whole pitted olives.. fyi. Our complaint was that the temperature of the food was lukewarm. And there is no complimentary bread- it can be purchased.  I think a basket of bread should be complimentary all the time, if you offer it. So if you see other tables with that fresh warm basket of bread and you didn’t order it, you’re just left salivating. Overall we had a great tasting experience.\n\nThe service at the end of the meal was so inattentive that we skipped dessert. The bill pay app at the table has a $2 fee so we opted to flag a waiter down for our bill. He gave us the check and never came back.\n\nThe vibe is pretty laidback. I’m sure we’ll come back in another two or three years."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvenFlemp3RRAB",
            "text": "Okay, where do I start ?\n1. The food was great! I got the branzino and was very satisfied and top it off the bartender Luna made one of the best espresso martini’s I’ve had in a while.\n2. The staff was very friendly from the moment I walked through the door.\n3. The interior is beautiful - from the lighting to the decor - great place for a date night!\n\n10/10 I will be back!"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bmRqeVFREAE",
            "text": "Eccellente ristorante a 2 passi dal Toro di Wall Street. L'ambiente è molto elegante, un pò buio (qualche lampadario in più non guasterebbe) ben arredato. I posti a sedere sono parecchi suddivisi su 2 salette. Il menù è vario ed offre tantissimi piatti \"italiani\". In 3 persone abbiamo preso: un ottimo tagliere di salumi di prima qualità, 3 primi piatti ( un tagliolino al limone e gamberi, un tagliolino al pesto ed un tagliolino paglia e fieno), un dolce (soufflé al cioccolato), una birra Nastro Azzurro alla spina, 2 bottiglie di acqua gasata e 2 caffè...per un totale di 120$ cui aggiungere una mancia (obbligatoria) del 18% o 20% oppure 22%. Io ho optato per il 22%, dato che i camerieri sono stati molto presenti e professionali. Consigliatissimo.\nAllego alcune foto....ahimè quella del tagliere non ce l'ho!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQLUxqVTlBRRAB",
            "text": "Our server Gabriella was amazing. She took care of our table in such a friendly and caring manner. The food was delicious and the dirty martini was so dirty, to perfection. Love this restaurant would recommend for a date, friendly get together, or really any occasion. I will be back soon. Thank you :)"
        },
        {
            "date": "4달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMFVtSm5PRzQwYm1oNmExZzRTRlZCZVZCa1dsRRAB",
            "text": "Excellent repas dans ce restaurant, à la hauteur d’une vraie cuisine italienne. Je recommande"
        },
        {
            "date": "4달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMGFXSTRiVWRCYjJveFVrMXlNVXB5YmpFeU5rRRAB",
            "text": "Refeição SENSACIONAL , conheço há tempos e a delícia continua maravilhosa !!! Serviço acima da média e a Gabriela atendeu com muita qualidade e atenção"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWlMxRkdSbW81TFZjNFNUTmFkR05RVjJaWFprRRAB",
            "text": "Orecchiette alle cime di rapa e salsiccia davvero buonissime!\nAtmosfera tranquilla per un buon pranzo a due passi da wall street."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIZ012T19BRRAB",
            "text": "Great food and ambience! Perfect vibe for group of friends or your favorite date! From the music to furniture to the food, oh the food, you’ll want to come back again and again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBd3A2MERREAE",
            "text": "The best restaurant in New York.Absolutely perfect.Amazing food ,amazing drinks,amazing stuff.\nHighly recommend.\nWe had the best time ..\nThanks Aidan,Christian and Jorge for the wonderful service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdXF2WlhREAE",
            "text": "I've been four different Serafina locations in Manhattan and this is the best in terms of service and cocktails.  However, I found the pasta very underwhelming in taste, texture and overpriced. The spicy penne vodka was undercooked, dry and did not taste like vodka sauce."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbGR5a3VBRRAB",
            "text": "Made a reservation for 7:30 pm but when we arrived we were told to wait because somebody was still at our table despite the restaurant being half empty. After 20 minutes we got seated.\n\nBruschetta wasn't great. Not the right bread for it, missing olive oil or any seasoning and the mozarella was very cheap and tasteless.  Focaccia crostinis were totally dried out and again no olive oil. Lemon pasta and Arrabiata were tasty. Tartufo pizza was very mediocre and overpriced and the dough dry and a bit burned. Chicken parmigiana was pretty tasteless and nothing special but the green salad was really good. The portion of it was also good. Sides were way too expensive ($9) and definitely not worth it since fries were the regular frozen ones and ketchup served in a plastic cup!\n\nDesserts were delicious! Tiramisu and chocolate souffle recommended.\n\nStaff was nice but nothing exceptional. The waitress offered us an extra Bruschetta piece for free since we were with 4 and they only serve 3 pieces.\n\nIt wasn't bad but nothing I would come back to. Not worth the price"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNzVhakx3EAE",
            "text": "Yummy and delicious. Gluten free options. Jonathan was excellent!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wd2NXUm9TbnBRTkdseWNEWlRWVFJ4Ym0xb1oxRRAB",
            "text": "The food can use improvement on flavor. The lasagna and lobster ravioli was good but the Spicy Penn Vodka and Tagliolini Al Pollo and meatballs need more flavor. The service also needs improvement as the waiter checked on us towards the end of our dinner. The only positive thing was that the food came out pretty fast."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WVdHeE1SVW96U0VocE9GaFlibkJNYjA5b1MyYxAB",
            "text": "The service was great and the atmosphere was very pleasant... however, the food was worse than sub-par.  For the price, it was 10x worse than Applebee's or any other low rated franchise restaurant.  Calamari was bland; meatball appetizers were very dry and just not good.  The sauces and pastas were practically un-edible.  The pizza was bad.  The staff were very attentive and after complaining, they were kind enough to take 2 items off the receipt.   Will probably never come back but I do want to give a shout out to the waiters and manager for understanding and for being apologetic."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMWVFOXFiSG8zVFZGQlRtRk9iRll6VEZWd1QxRRAB",
            "text": "Such a great experience and delicious food. Highly recommended! We came after a long day and it was worth the trip\n\nThe service was impeccable.  Selma made sure everything was perfect. Best waitress :)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfajhIRkxREAE",
            "text": "Time on our hands and we stumbled on the restaurant 1 year anniversary the day before my 46th Birthday. The \"Happy Birthday\" balloons felt meant to be. Aiden, our bartender was charismatic and hospitable.  Happy Anniversary and Many More 🎈🎈🎈🎉🎉🎉"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbVBhLXlnRRAB",
            "text": "Un lugar delicioso, bonito y con excelente servicio! Fuimos 4 personas, Pedimos una burrata al centro, y para compartir 3 pastas: Al pesto, al vodka, y carbonara! Todas deliciosas y muy bien servidas que hasta sobraron! El servicio fue muy bueno y muy atentos. Lo único que no nos pareció tan bueno fue el postre de Pistache, la verdad es que no tenía mucho sabor."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJNi04OWZZeTQ3Q3l3RRAB",
            "text": "Overall food was very average, waiters were busy. I had one of the dishes that waiter said was home-made pasta, but really did not taste like freshly made pasta (I make my own pasta, and the pasta here tasted like dried pasta from the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeXZuZVZBEAE",
            "text": "Beautiful space, but vey bad experience.\nI sat at the bar alone, the restaurant was empty because it was end of lunch time, before dinner. I waited for the menu for 10-15 min, the bartenders payed 0 attention to myself. I had empty water glass all the time, even though I haven’t order anything else to drink. The bartender who took my order disappeared (maybe his shift was done), the other girl was absolutely lost in space. I asked her for check, she forgot. I couldn’t even remind her for my check because she was far checking for the milk in the fridge for 15min. The manager sitting there on his phone, not paying attention what’s going on. I had to wave for someone’s attention.\nTuna tartar was good except so much sauce, felt like it was a tartar in the soup! I had to take out the tartar to the small appetizer plate. Filet mignon was good"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnanI2dEF3EAE",
            "text": "I continue to visit this place because of the staff  especially Gabriela and Christian. I eat here often with a group of my friends to celebrate or just enjoy great food. You must try the Serafina champagne cocktail. Gabriela is just the sweetess"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkcXJ6a1hBEAE",
            "text": "UPDATED REVIEW on 8/11/2024\n\nI decided to give this place another try because the restaurant is so beautiful inside.\n\nWalking into the restaurant all you hear is the incredibly loud music. Good thing I was alone because if I had to have a conversation with someone it would be challenging. Please turn down the music a few notches!\n\nI ordered a cucumber basil gimlet. It took 15 minutes to get the drink and several reminders to confused wait staff. The appetizer actually came out before the drink.\n\nThe drink was the only good thing I had this visit. It was very tasty and fresh. Maybe this place would be better for drinks instead of food?\n\nThe bruschetta was utterly bland and tasteless, even after adding salt and pepper. There are no great Italian smells when you enter this restaurant. Maybe that explains why the food is so boring.\n\nI have revised my rating for this restaurant to 3 stars overall and 2 stars for the food.\n\nAfter two tries, I think I'm going to give up on this place. Unless you only want drinks, I would try somewhere else for sure."
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWGJGZGpRVlo1Y3pCNFpqaFVaR2RsVURCTWVHYxAB",
            "text": "Excellent restaurant, très bonne ambiance, le personnel est adorable\nLes plats sont excellents\nCadre très chaleureux\nTrès bon rapport qualité-prix"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RU5VVXpVVkZ0WmpKMmNsWmlWak5hV0UxbFNsRRAB",
            "text": "This was great food. The lasagna al forno was very flavorful and a medium portion. The jalapeno margarita was a treat. The atmosphere and service is upscale but not pretentious and it's not cheap, nor overpriced. The restaurant also features a kids menu and options for vegetarians."
        }
    ],
    "reviews_count": 72
}