{
    "name": "Scalini Fedeli",
    "place_id": "ChIJRY0QrR9awokRtnCdmU4ijlM",
    "grid": "MN1",
    "address": "165 Duane St, New York, NY 10013, USA",
    "rating": 4.8,
    "user_ratings_total": 505,
    "phone_number": "(212) 528-0400",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNlRsODRPRTlEV0RNeldrZHVhVzh6UmtaaFJVRRAB",
            "text": "This place is a big break from all the trendy, hard to get, crowded italian places in NYC. It's old school, you get treated like royalty, anything you order I'm sure is going to be top notch, and you get complimentary small bites from the chef all the time. If you want to impress your in-laws, this is the way to go. The butternut squash ravioli was to die for, and the tiramisu is probably the best I've had in the city. I bet the pre-fixe menu is great, but we ordered a la carte and had the best time too.\nWe didn't feel rushed to get up and leave, and we just had an amazing evening overall. Would definitely come back soon, thanks for the impeccable service and food!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFM2QzVmhNalJPV25SRkxVWk9WRU5SVFVoVVgyYxAB",
            "text": "The food, service, and classy experience was superb! The food was amazing, especially the desserts!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obk5tZGZWMk5QZGpKQ1YxTTFTbE15TlRSU1ZuYxAB",
            "text": "Scalini Fedeli is outstanding! The food is classic Italian done perfectly — rich flavors, fresh ingredients, and beautiful presentation. The pasta is especially amazing, and every course feels carefully made. The restaurant is elegant and quiet, perfect for a romantic dinner or special night out. The service is warm and professional, making the whole experience feel extra special."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUVJqSnplVUZJUmpRM2VUTjJPRGh0YVVKMlVtYxAB",
            "text": "We had an event in the neighborhood and were searching for a nice restaurant and wow did we find a winner!\n\nScalini Fedeli was exceptional.\n\nFrom the moment we walked in the door to the moment we left it was an exceptional dining experience.\n\nThe restaurant interior is beautiful, soft vaulted ceilings, comfortable seating and the lighting is just right. We arrived early and were offered a corner booth type table which was perfect for the two of us.\n\nEach course of the fixed price menu was excellent.\n\nWe look forward to returning and highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNFYycFlZWEZmTWpKMmIxSjVjbXBKYlRGQ01uYxAB",
            "text": "It’s as good as it gets. Amazing experience. Best Italian restaurant in NYC. Try the shrimp and lobster pasta!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seFpsQkNXV2hxUjBGWE1TMVVhRk10TUVWcWJtYxAB",
            "text": "The kitchen values fresh ingredients while the front of house values fresh approaches. The employees show professionalism. Many different offerings have earned my praise. You'll notice the interesting atmosphere. This place offers something new."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNMlNuTjRhbk5mVG1zeWVsTkRaWGhOZDFGUU4wRRAB",
            "text": "Great Italian food. Always fresh good quality meat."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Nd1V6WmFNa0k1WWtkNlFWTktlalJIT0hGbWEyYxAB",
            "text": "Just enough surprise to keep things interesting. Their employees create an atmosphere of belonging. This place understands flavor. They offer delicious food in an unpretentious setting with attentive staff and happy customers. Visit this place immediately."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psR1IzUm1aM2t4ZEhsc1lUUmFiRFZaVlZsd1RuYxAB",
            "text": "perfect space for a small group to celebrate something special. we came here as group of 6 to celebrate friends city hall wedding ceremony. love the ambience, nice decor and delicious food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSk9VY3RiMkYwTmxRdE5YTjFSRnBrYm14SU1XYxAB",
            "text": "We had the most delicious meal and the service was excellent. They also went above and beyond to accommodate me as a vegetarian. I would highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ka1VERjJOMEZXVFZSRFRHVnNka3hET1dkVWNGRRAB",
            "text": "A complete 'mappazzone'. It looks like food went back to the 80's."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMWQwSklSMk5aY3poYVdteGZOMGR5UTJaalFVRRAB",
            "text": "Still a Classy restaurant"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25welVsbHpVMGcwVTBKclQwbDNVekZuWDA5cFVWRRAB",
            "text": "Beautiful, gorgeous. The level of attentiveness, the food, the ambiance. Made date night incredible. We will be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1a1IzaEpNVlYyUVdaUmFUbE5UVVpvYzBwTlNuYxAB",
            "text": "Such an enjoyable experience…the food was so nice, especially the egg yolk truffle ravioli, one of the best I’ve ever had. The sorbet was very good and refreshing as well. A little suggestion would be that the pork chop(the really thick one) is a bit dry and tasteless, would be so much better if accompanied with some sauce. However other dishes are really delicious.\nService is nice as well. Servers are professional and polite, but also friendly, feels like home. Nick greeted us by the end of the meal and we had a very enjoyable chat.\nLove the atmosphere, really nice decor, brings me back to my Europe trip."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUGQzWkxja1psYmtJNVdtbzViMVJpV1ZScFlWRRAB",
            "text": "Every dish was delicious, Excellent service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSGVvTW1tOEtuOEd3EAE",
            "text": "Great dining experience. The soft egg yolk raviolo was amazing!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tack5GSktXR05DT1ZwU1RHMXBXVzQwVkdzd2VrRRAB",
            "text": "The food and service at this restaurant was excellent. The menu is a 3 course fixed price or you can order Chef’s tasting menu. We went with the 3 course. There were also numerous two-bite tastings compliments of the chef. My guest had pappadelle veal and pork ragu with a hint of orange as first course  and pistachio encrusted lamb chops as the entree and  I had the Ecuadorian shrimp and lobster tail as first course and filet of sole Franchese as entree. Delicious!  For desert I had the chocolate raspberry caramel tart and my guest had panino pistachio hazelnut caramel wafers layered with hazelnut gelato. Amazing!   The waiters and servers were very attentive and friendly.\n\nI would easily give this restaurant 5 stars however, I realized as I was leaving that there was no accessible restroom. The restrooms were down a long flight of stairs in the basement. I know this is an old building but it is the law to have ADA accessible facilities.  I encourage the management of this fine restaurant to correct this situation. If you or your guest has mobility issues you may need to pass on Scalini Fedeli."
        },
        {
            "date": "5달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOV0RfT2ZiOE5mVmdBRRAB",
            "text": "맛있습니다.분위기도 좋구요. 이탈리아식 코스가 좋았어요. 주키니 식전 요리 맛있고요. 라비올리도 두개 다 맛있어요. Surf and turf 모두 좋아요. 디저트 두말할 것 없구요"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbUh4dXE5MjZIRWFREAE",
            "text": "I finally understand what people say about New York City's Italian food.  The set price menu T Scalini is incredible in the quality and available food items.  All selections are 5 star in quality and amount of food is plentiful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQWHM5c1h2eXVtVENREAE",
            "text": "We have eaten at Scalini Fedeli in Tribeca about ten times now. It is our go-to restaurant whenever we have a special occasion or just want to be guaranteed a great meal and wonderful experience. We ate there again last night and the entire experience was perfect from beginning to end. I had the veal chop and my wife had the salmon and both were delicious!  In fact, all of the food has been consistently great over the years. But, it's all the little in between course surprises that the chef sends out that make the experience extra special. The service is just wonderful too, and is provided with a real warmth and a professionalism that is sometimes lacking in today's world. And, although it doesn't seem like it would be, we always feel like it's really reasonably priced for what you get. It's well managed and as a result is an absolute gem of a restaurant. We're already trying to think about when we will go next."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNdVlpZDN0ODlpLXJ3RRAB",
            "text": "I’ve dined at hundreds of restaurants in the city, but this was the first time I’ve ever experienced food poisoning. Both my friend and I felt nauseous shortly after the meal, and I eventually vomited hours later. We did not finish our dishes—not because we were full, but because the food was barely edible.\n\nI ordered the lamb medium, but what arrived was clearly undercooked. My friend’s scallops were mushy and watery, with a texture that strongly resembled defrosted seafood—not fresh at all. Neither of us finished our meals.\n\nThe atmosphere itself was nice, and we appreciated being able to walk in without a reservation on a Friday night—which in hindsight, says a lot. The dining room was quiet for a reason.\n\nService was inattentive and, frankly, dismissive. We were ignored multiple times, and my friend commented that the treatment felt borderline discriminatory—perhaps because we’re young. When the manager eventually came over, we thought he was offering a complimentary drink as a gesture of apology. Turned out, it was just a sales pitch. We were charged full price.\n\nThe worst part? No accountability. When I tried calling afterward, the management was nearly impossible to reach. Once I did get someone on the line, there was no apology, no concern, just a defensive insistence that their team is “professional.”\n\nFor comparison: I once had a less-than-perfect service experience at Daniel. They followed up proactively after my review and offered a sincere gesture to make it right—a bottle of champagne the next time I dined at any of their restaurants. That’s what professionalism looks like. That’s what customer care means.\n\nI’m not expecting Michelin-level treatment everywhere I go, but basic food safety and respect should be non-negotiable. I would never return here—and I sincerely hope no one else has to experience what we did."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPVGo1ZExDeXN5ZFh3EAE",
            "text": "What a great place! I came here celebrating a special occasion with seven friends. We were sat at a round table and miraculously we were all able to hear each other and talk. This is a classy joint you can bring your parents. An epic prix fix menu which fits the budget for a fancy meal only $89! Good portions, great flavors, and a perfect amount of options!! We all tried each others food and everything was great. The service was top notch with a team of five people catering to our needs before we thought of them! Thank you for making this a great experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbzdUc1dBEAE",
            "text": "We went to celebrate my girlfriend’s birthday and from start to finish our experience was top class. The food and the service were excellent. The chef’s curation of flavors provided the perfect enhancement to our night of celebration. I would highly recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbHBpdnF3RRAB",
            "text": "Delicious authentic Italian food. The place is comfortable and cosy without being pretentious. The food is good value for the money. My only slight complaint is the wine list which is quite limited and has very few bottles under $100"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOEtiejVRRRAB",
            "text": "Wonderful restaurant."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLWZYemJREAE",
            "text": "Scalini Fedeli delivers top-notch Italian cuisine with elegant ambiance and flawless service. The truffle risotto is outstanding, and every dish feels thoughtfully crafted. Perfect for a special night out."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbXZQSHFnRRAB",
            "text": "Every dish was delicious. Excellent service, a very nice place for special occasions. Highly recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3X01mV1JREAE",
            "text": "Such a culinary adventure but not too adventurous.  Don’t hesitate to book."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMDczYWJREAE",
            "text": "This restaurant was stellar in all facets of service"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndTdIbndRRRAB",
            "text": "Amazing service and dishes! So much variety 😍 will certainly be returning"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN0lPVVVBEAE",
            "text": "Excellent service and atmosphere, but the meal itself was underwhelming. The mandatory prix fixe menu felt restrictive, though thankfully, our appetizer and dessert redeemed the overall experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBc1lIcEh3EAE",
            "text": "This place is a solid spot for classic Italian food! The vibe is super cozy, and it’s nice and quiet—perfect for a chill dinner.\nWe did the three-course prix fixe and shared everything.\nPRIMI: The porcini ravioli with black truffle sauce was really delicious —so good, rich but not too heavy. My boyfriend got the Ecuadorian shrimp, which was decent, but a little too tangy for me.\nPIATTI PRINCIPALE: For mains, we had the scallops Saltimbocca and salmon Forestiere. Both were cooked perfectly, and the beet reduction added a nice touch of sweetness. The scallops were the real standout.\nThey surprised us with a few amuse-bouches between courses. After dinner, they brought out a coconut sorbet to cleanse the palate—so refreshing!\nDESSERT: We chose one chocolate and one non-chocolate option, both served with ice cream. Really good but definitely heavy.\nService was on point—friendly and professional without being too much.\nOverall, great food, great atmosphere, and a prix fixe that’s totally worth it. You’ll leave full and happy for sure!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmM29hSTVRRRAB",
            "text": "The Holiday Menu is kind of Boring. However, strongly recommend the regular menu."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmN3ZxZmJREAE",
            "text": "Nice quiet restaurant. Wait staff is very attentive but also does not rush you at all. The food was amazing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMjU2MXhRRRAB",
            "text": "My adult daughter and I enjoyed celebrating our Christmas Eve dinner at Scalini Fedeli in NYC. Everything was impeccable. The decor is elegant and cozy.  The maître d’ and servers were super attentive, the tasting menu was fabulous with the amuse bouche, tagliatelle and filet of sole with a lemon and caper sauce. We wanted to add the arugula and buffalo mozzarella salad and they accommodated our request. The desserts are out of this world too! Highly recommend!! Be sure to make reservations. I look forward to returning on my next visit to the City!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2azhxUkdBEAE",
            "text": "Very good food and service. 11 years after our last visit to NYC, we booked again a table in this excellent restaurant. The whole visit was at least as good as 11 years ago with excellent food quality and very good service.\nFor sure a place to go when in NYC and looking for a good Italian restaurant! We will again book a table once we are back next time."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2N2FtNnp3RRAB",
            "text": "For our final dinner in NYC, we chose Scalini Fedeli and enjoyed a three-course prix-fixe meal that exceeded our expectations. We started with the Tagliatelle “Bolognese” and Spaghettini “Arrabiatta,” both of which were excellent renditions of (more or less) traditional pasta dishes. A delightful surprise was the focaccia bread served on the side—so good that we asked our server for an extra helping.\n\nFor the main course, we both opted for the 10 oz. filet mignon “Giambotta,” which was perfectly prepared and incredibly flavorful. Interestingly, I found it superior to the filet I had at Triple A Steakhouse earlier on this trip.\n\nThe desserts were equally impressive, rounding off the meal on a sweet note. The service was outstanding, as one would expect from a fine dining establishment like this.\n\nAn interesting side note: the bathrooms are located in a cellar-like basement. While the facilities were clean and well-maintained, the walk down felt like stepping back in time. The basement was lined with old wine bottles and plaques featuring past restaurant reviews, creating a curious and slightly quirky atmosphere.\n\nOverall, Scalini Fedeli delivered a wonderful dining experience, and I highly recommend it for a special night out in NYC."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cnVMdG9RRRAB",
            "text": "The lobster pasta is the dish that I came here for and I am not expecting it to be extremely good! You can never go wrong with Scalini. Good food and good service, I am looking forward to my next visit!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdzUyMnJnRRAB",
            "text": "The service here was wonderful and the food was so delicious. A hidden gem in the area for sure"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaVkyYUhREAE",
            "text": "What a great night!  This place delivers on every level and then some."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeXRhS21RRRAB",
            "text": "magical place for fabulous food, romantic atmosphere and terrific service"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX3R2RVBBEAE",
            "text": "I LOVE this restaurant.  Magical atmosphere. Flawless service, Delectable food, Not inexpensive but worth every dime.\nEntering is like entering another world."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMza0pPRTN3RRAB",
            "text": "Been here several times; Food is good and service is attentive, price is relative good value"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYallDcU1REAE",
            "text": "Gorgeous space with a proper old school Italian feeling. The team is supremely attentive and the vibe was warm and welcoming. Came here for a large team dinner but can’t wait to come back with friends and family."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeXZiQlRREAE",
            "text": "An amazing old-school restaurant. Not everything is perfect with the food, but it’s worth coming here for the service. I haven’t experienced anything like this in a long time. They really put in a lot of effort. I wish for more satisfied and well-fed customers. I will definitely return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubk1LZFFBEAE",
            "text": "Really good food especially the raviolo uovo and sole filet"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3OEtUUXJRRRAB",
            "text": "Food and wine are superb; staff is very attentive and friendly, but the ambience leaves a lot to be desired.  It's so old and outdated. Seriously needs an update."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybmZ1YnB3RRAB",
            "text": "Attended a dinner function for work. Nice atmosphere and exceptional service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMelpUSmxRRRAB",
            "text": "Amazing hidden gem!! Best Italian meal I've had in Tribeca. Quiet and elegant atmosphere, very attentive service, and delicious food.\nThe breads, raviolo, porcini ravioli, vodka pasta, lamb chop, and desserts were all exceptional. Great place for a special occasion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOXRfdHhnRRAB",
            "text": "We were searching for an out of this world NYC Italian dining experience and we found it!  Everything was so freaking delicious.  Trust the reviews.  You won’t be disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREX0lEenR3RRAB",
            "text": "Exceptional Italian food and excellent service. Highly recommend if you enjoy Italian cuisine with some great collections of wine. The vodka pasta is the best I have tried ( it’s a little spicy). The sorbet was very refreshing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcl9taHpBRRAB",
            "text": "Scalini Fedeli was one of the best dining experiences I’ve had in ages. The service is outstanding & welcoming. The food is also fantastic. It is a great value for a pre-fixed menu and you will leave very full and happy. Great for special events or romantic date nights. We spent several hours there and did not feel rushed through the dining experience at all. I highly recommend the egg soft yolk raviolo with truffle and the lamp chops. They were extremely accommodating, proactive with service and included complimentary wine to celebrate the special occasion. Looking forward to coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdzZTMEN3EAE",
            "text": "I like the environment, service and food. I like the lobster head-on shrimp pasta, signature egg york ravioli with black truffle, salmon entree with mushrooms and onion sides.\n\nNice desert. Chocolate soufflé is good. A little sweet for me. Best pistachio gelato I have ever had including in Rome and Florence."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdWRxX3lBRRAB",
            "text": "This restaurant was like taking a trip back in time. I didn't plan to eat here but we were curious about what was in the old Bouley space with those fantastic vaulted ceilings.\n\nFirst of all, the host was extremely gracious when we showed up without a reservation. They have a price fixe menu for $89 where you get about six courses. That price is very fair for the amount of food and service you get.  The service was excellent. I was very impressed by how thoroughly the waiter folded my boyfriend's napkin when he went to the bathroom. A nice touch!\n\nWhat I love most about this restaurant is ability to hear. So they had tapered candles on some of the tables. Very old school.\n\nThe menu was also huge! We found it difficult to make a choice of from all the amazing pasta offerings between the main menu and then the specials.\n\nI also really like the fact that the the supplements for dishes were reasonable. It was no $50 upcharge for shaved truffles.\n\nThe food was good, not amazing but absolutely we are presenting what was offered. They bring a few of nibbles and small appetizers before your pasta course. The raviolo with runny egg yolk was very good as was the spaghetti Alice.\n\nUnfortunately, my duck was tough but my boyfriend salmon was very generous and tasty even if it was slightly overcooked from what we asked for.\n\nI thought that the desserts were the weakest link in the whole experience. It wasn't the execution or size but the quality of the chocolate and the ice cream that was lacking.\n\nStill a thoroughly enjoyable dinner that would be perfect if you were taking your elderly Mom out to dinner if you wanted to remember what good service used to be like in this town without paying to eat at the more expensive places in New York.\n\nI can think of two restaurants, right on West Broadway, that we've eaten in recently which were pricey and the service paled by comparison.\n\nExcept for the staircase which is steep and could be a bit of journey for an elderly person."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaFpPcXFRRRAB",
            "text": "We had an amazing meal at this place. The service was great, although perhaps not exceptional in their attention to detail. You get a real sense of old school Italian vibes at this place. The arched ceiling and the dimly lit tables with candles make you feel as if you're in a different era.\n\nThe food was amazing. We loved every dish except for the duck, which was a bit tough and overpowered by the overly sweet jus. The seafood pasta and the Bolognese were excellent. The steak was very well cooked.\n\nNote that this place only offers pre fixe menus; no a la carte.\n\nOverall, we had a great time here and we'll go back to try some of the other dishes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdllQa3dRRRAB",
            "text": "The ambiance is golden candle light and flowers is only exceeded my the amazing food and service. The food was presented like works of art. The combination of textures and scents and taste made me quiver in anticipation of the next plate.…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcEtlMnpBRRAB",
            "text": "Had a wonderful meal here for our anniversary. Could not have been more happy with the food, wine, or service. The decor and ambiance are also great for a special occasion. The manager even stopped over a couple times to make sure everything was as good as could be.\n\nFor the fixed price menu, you have your choice of appetizer (mostly great pastas), entree (lots of fish and meat), as well as desert. Do make sure you save room for the delicious desserts. The fresh-baked donut balls were outrageous."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzcFBQNDBBRRAB",
            "text": "Amazing Italian food in very romantic and classy settings. They only have seasonal/monthly prix fixe menu and chef’s tasting menu. We had the 3 course prix fixe, which has extensive choices at very reasonable price, $75 per person. Their…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbkppb1pREAE",
            "text": "One of the best Italian I've ever had. We did the tasting menu and it was worth getting to try a variety of what they offer. The ambiance is quiet and romantic. I must say their raviolis are the best. The service is great. We plan to return before I have to go back to DC and will continue to return in the future when I'm in the city."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbVlQNHRRRRAB",
            "text": "My new guy and I went here after I searched a lower Manhattan spot for him to get to as soon as possible and away from Tuesday traffic.\nThe decor is pure Italian and gives you all the feels, it puts your mind in that space also.\nMy date and I had a full feast and were pleasantly surprised at such great customer service and cleanliness. The food was absolutely delicious and beautifully placed! See photos attached."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMzR6LTZnRRAB",
            "text": "Wonderful dining experience! We absolutely enjoyed our evening. The prix fixe meal was perfect. More than we could eat, and we will be back!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNXVPWnVBRRAB",
            "text": "Nos encantó el lugar! El ambiente súper acogedor y con una atención estupenda por parte del personal. Disponen de un menú cerrado (aprox 80$ sin impuestos) que incluye 3 entrantes, un primero, plato principal y postre. La verdad que estaba todo riquísimo! Lo recomiendo sin duda y esperamos poder volver pronto!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybUpDVEJBEAE",
            "text": "Our first visit!  I chose Scalini Fedeli because of the wonderful reviews on their food and service (we had a guest visiting who appreciates fine dining). Well, we were impressed from the moment we walked in. The dining room is just lovely with lit tapered candles on every table, white tablecloths, classic paintings adorning the walls.\n\nThen, we were blown away by the service with so many waiters attending to our every need. Each food was artfully presented and best of all tasted scrumptious. Some of the dishes we chose were Ecuadorian Shrimp with two purees (huge shrimp!), sole (lightly breaded) with tomato and olive sauce, pasta with Bolognese, squash ravioli with fried sage.\n\nThe coconut sorbet (before dessert) was sensational! Desserts of chocolate torte, apple tart & donuts were all fabulous.\n\nAll in all, everything was just perfect and we felt it had a lot of value for the price. Our friend likened the experience to her treasured experience at a fancy restaurant in France, too. We all agreed the dining experience was  a wonderful respite from the pandemic!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2aFBPenZ3RRAB",
            "text": "Scalini Fedeli in Tribeca NY is a treasure!  Everything we ordered was extraordinary.  The restaurant itself is exactly what I was looking for.  I was showing my boyfriend NYC for the first time, and I wanted him to go to the very best…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydW9Qc1hREAE",
            "text": "One of my new favorite Italian restaurant! Great service, food was well balanced and didn't feel too heavy or overly rich."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaby03dGRnEAE",
            "text": "5 stars for every category. I'd give 6 stars for the service. Our waiter Alfonso was superb. Made great recommendations and was on top of everything. This place is pricey but it's worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0enVheGdRRRAB",
            "text": "Amazing food and superior service.  We went with a party of six, and the service was flawless.  The atmosphere is amazing, and the additional complimentory chef items were wonderful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbktlell3EAE",
            "text": "Great welcoming, delicious food, superb service Fantastic Wine Selection. It feels like Italy, beautiful venetian Plaster arch celing, planty of room for big tables and special place downstairs in the wine room. if you never been there you have to try it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJLTdXaVN3EAE",
            "text": "This restaurant is not just a great place with incredible food and perfect service, it's an experience! They have expertly created a warm, romantic, and upscale - yet very comfortable - atmosphere. My fiancé took me here for my birthday (2nd time here - the first time here left me reminiscing for months) and though it was crowded, we did not even notice unless we looked around; it felt quiet and private despite others dining around us. Our waiter was knowledgable about every detail on the menu and the specials (we had a lot of questions) and made wonderful recommendations, though I feel like I could have closed my eyes and pointed at anything on the menu and left happy.  Dishes that stood out in particular for us were the linguini carbonara, the chicken liver purses, porcini mushroom ravioli, mushroom and black truffle crusted Arctic char, and the caramelized banana dessert. Needless to say we left very happy and will be returning again soon!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeG9Eb1l3EAE",
            "text": "Wonderful romantic candlelit dinner with impeccable service. Very friendly and polite staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcmZYN0hnEAE",
            "text": "Perfect place for a birthday dinner! Cozy atmosphere, delicious food and best service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NU9pU3JRRRAB",
            "text": "Celebrated our 15th Anniversary here. They went all the way up to impress us. Definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNWNQSW1BRRAB",
            "text": "So good. It’s been a long time since I am actually amazed by a restaurant. Highly recommend!"
        }
    ],
    "reviews_count": 73
}