{
    "name": "Il Giglio Tribeca",
    "place_id": "ChIJqQ08Lx5awokRH2LHWIB9Gm0",
    "grid": "MN1",
    "address": "361 Greenwich St, New York, NY 10013, USA",
    "rating": 4.3,
    "user_ratings_total": 76,
    "phone_number": "(212) 223-6311",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VE1tdGFYMHQ1YUY4eFNHZGpSRVJ6Tm1aVU5YYxAB",
            "text": "Fabulous, simple but elegant, perfectly cooked Italian food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMWNGcEhkMWxRVGtNMU5VVkNjbVIwUlZONlJtYxAB",
            "text": "we experienced an all time low of service at this restaurant. Entrees were not served until well over an hour of our reservation. When we asked to speak to the manager and server, our server stated: “I don’t cook the meals. Sorry.”\n\nSpend your hard earned money elsewhere and don’t leave it to chance on how you will be treated in a city full of other great restaurants."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWE5IWkRMVlJFYzBwWVZIbHFXa2hIYnpJNU5GRRAB",
            "text": "Quite possibly the WORST service experience I’ve ever had. The service was at an UNWORLDLY low. Our table was completely neglected. Everyone else in the restaurant had their food but we were made to sit an hour and a half with no food at all. Our server never checked on us. We finally flagged down the manager who said that our order wasn’t put in. We politely, but truthfully shared our disappointment with our experience with both the manager and our server and our server was incredibly rude, unapologetic, and took no accountability for his poor service. I want EVERYONE to know that this is a horrible choice of restaurant!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aGMwTndYMVpIZFVWNk9IVlhWVUZXTFhCTk9VRRAB",
            "text": "I had a horrible experience and believe I was a victim of race discrimination. Server forgot to put our food in and was dishonest and not accountable when we brought to their attention that our table was the only in the whole restaurant without food. Do not go here! You may be mistreated by people who hold harmful beliefs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscWNYRndkRlp4WjJwVUxYY3dUVk4zU2xZME4xRRAB",
            "text": "A hidden gem. Great Italian food. Super friendly. Good local spot for nice relaxed high quality Italian."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bUxVSTRXazExY0ZORGNXbFRkVzR5VEcxQ00zYxAB",
            "text": "Food is extremely over priced - I’ve been to the best Italian restaurants in the world and I’ve dropped slot of an excellent meal but from the moment I walked in and saw the menus I knew this would be bad. $30 for salad? Absolutely insane. And when we ordered, it was the cheapest ingredients charged at the highest price.\n\nService mixed up our orders but was fine besides that.\nTwo apps and two drinks were $130 - none were even half decent, crazy.\nDo not go here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTlRFcFBUVGc0ZDNOVGFsTm5YM1pNYkZndFVYYxAB",
            "text": "The food is expensive and basic. Tourist trap. The lemonchello cocktail was died pink. Really let down. My husband was pissed at me for taking him there."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaVIyVlpORmhUVDNoV016SnJURVl5ZGtOTllXYxAB",
            "text": "Stumbled upon this place because of getting caught in the rain, however, it surprised me with its quiet ambiance, friendly service, and appetizing dishes.\n\nOnly ordered an appetizer because this was a spontaneous decision. The dish is an appetizer consisting of octopus with potato’s. Would would be great if paired with bread but the restaurant didn’t offer bread. They do provide for a dish of appetizer composing of a focaccia, olives, bruschetta, and Parmesan.\n\nExtremely professional and attentive staff really made it for me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWamF6TldUbXgxU0dWRFZ6aG1lVkZTWnpWNFQzYxAB",
            "text": "Not really a true representation of Italian food. According to the team, unless you specifically request the pasta to be served al dente, it will come overcooked."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veVowaDBhMUUyUlZscVJHVnhVVFpMWVZabGFGRRAB",
            "text": "It was a very pleasant meal. The food was very nice, we enjoyed everything.\n\nThe service was very efficient, but didn't seem very friendly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbVptZE9jMHMxUkVGTWNYZExVMVYwVkUxaVpYYxAB",
            "text": "Setting is beautiful but lacks any atmosphere. The food menu is good but the wine menu is way overpriced. The starters were good and very generous portion size. House pre starters were given which was unexpected and tasted good. The main courses however were not good. The pesto gnocchi was dense and heavy and the pesto was too garlicky and not well balanced. The veal cutlets were average at best and the fettuccine bolognese was just okay. Way overpriced restaurant in the TriBeCa area, it was nearly 400 dollars for 3 adults and 1 teenager, so not worth it and would not recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MlIxVTRUMnR4VVRWaVJHcEhaMWRNWDNveFYzYxAB",
            "text": "We had the most incredible experience at Il Giglio today, thanks to our outstanding server, Fabio.\nFrom the moment we sat down, Fabio made us feel so welcomed and cared for — his warmth, professionalism, and attention to detail were truly top-tier.\n\nMy family and I were celebrating a special day, and our Italian waiter Fabio went above and beyond to make it feel memorable.\nHe was attentive without being intrusive, made fantastic menu recommendations, and ensured that everything came out perfectly timed and beautifully presented.\nHis genuine kindness and charm added such a personal touch to our meal — we honestly couldn't have asked for better service.\n\nThank you Fabio, for making our day so enjoyable. Il Giglio is lucky to have you, and we’ll absolutely be back soon — hopefully to be seated in your section again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MU4wWXlTR0kzZDI5eExUZzFSRWgyVFZaUmNtYxAB",
            "text": "Super chill spot. good vibes, friendly service, felt really comfy the whole time. food was solid all around. will def be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRlJuZElXbWhHVkVkWmJqVkNSa2cxYkUxSWRXYxAB",
            "text": "One of the best Italian restaurants I have ever been to in NYC. I can't say enough. The staff was very knowledgeable about the menu. Creative cocktail menu. Great wine list. The food was wonderful. I will be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWFRHdGFRbUV6TTNsNVFrVjNObFE0ZDI5MFVIYxAB",
            "text": "Food was delicious. Portion size too large and outrageously priced wine list: nothing under $100 is shameful and unimaginative."
        },
        {
            "date": "4달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQR1g3NXlXX1pMQS1nRRAB",
            "text": "맛있어요. 분위기 좋아요. 가는 길이 보통 돌아다니는 곳이 아니라 힘들었지만, 디저트는 안 먹어도 되었는데 소통이 잘못되어 먹어서 비용이 많이 나왔지만 그래도 맛은 있어요. 비싸긴 해요."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQaTRndlN5ejZtS3VRRRAB",
            "text": "Today was the perfect day to try out the buzzworthy beauty that is Il Griglio.  Nestled on a delicious little corner in Tribeca flanked by a cobblestone street..entering this beautiful space, one is instantly struck by the amazing modern industrial decor that is beautifully-appointed, elevated and cozy. This swanky gem feels cool but offers every bit of an intimate dining experience.  We began our meal with a sexy Piedmonte region Barolo and the most beautiful Fried Burrata & Heirloom Tomato appetizer. It was perfectly balanced, seasoned and fresh from first to last bite   Next we indulged in main courses that included the Shrimp Oregenati, Rucola & Fenocchio Salad and the Chicken Fra Diavolo.  I’ve never seen prawns this size glistening in the most succulent and velvety scampi sauce.  The chicken was fall off the bone moist, submerged in a rich, flavorful gravy with a fragrant aroma  that danced about the table.  Every bite of our entrees was a reminder why we made our way from Brooklyn to see if Il Griglio lived up to the hype…it did not disappoint!!\n\nOur meal ended with the most spectacular Italian Apple Tart dessert that truly stunned from presentation to taste.  Creamy delicious Caramel Gelato topped an incredibly flavored crust that hid the perfect blend of softly sweet apples.  A masterpiece of flavors and worth every calorie it costs!!\n\nAll in all..Il Griglio has every hallmark of greatness..perfect for brunch, dinner and I can only imagine that gorgeous bar as a highlight for a hip and happy night out with friends.\n\nGet to Il Griglio the next time you're in the mood for phenomenal food and atmosphere!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLM25zcG1JeEw2N3JBRRAB",
            "text": "IMO the food was very average.  Definitely not worth the high prices."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNWGc0YjNtenNPUWJREAE",
            "text": "Clever G. was the worst server we have ever had. Our appetizer came out 45 minutes after we ordered it. We asked to have it taken off and then he asked if I knew “the difference between sales and management”\nAlso, the pasta was stale."
        },
        {
            "date": "7달 전",
            "language": "pt",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MmU3SzhRRRAB",
            "text": "Bom , mas nada especial. A localização é conveniente"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dk0yV2R3EAE",
            "text": "My fiancé and I enjoyed a very nice dinner at Il Giglio. The space has a classy modern décor, definitely a classy spot for locals. The service was also welcoming and attentive.\n\nThe menu is large, plenty of options for every food preference and dietary restriction, also a nice cocktail and wine list.\nAll of our dishes were fantastic, the Chicken Parmesan was excellent and the filet cut like butter.\nThe complementary bruschetta was a nice starter snack too.\n\nWe hope to return next time we are in the neighborhood."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBc3MtT2l3RRAB",
            "text": "Came here with a friend for a weeknight dinner, and it was great. The restaurant itself is spacious and relaxing, and the atmosphere is also very relaxed. Service was friendly, accommodating, and informative. We felt neither rushed nor neglected over the course our dinner.\n\nThe food was tasty, rich, and plentiful; we got the meatballs and beet salad to share, pastas, and a tiramisu. The meatballs were rich, and the beet salad was refreshing. My pasta (fettuccine in a cream sauce with pancetta and peas) was decadent and cozy for a cold day. The tiramisu was a great way to end the meal."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOWV2V0lREAE",
            "text": "Lovely food and awesome service!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNExpeGd3RRAB",
            "text": "Just ate here for the first time. My favorite Italian restaurant in the city is il Mulino so I was pleasantly surprised when this place was right up there in regards to the food! We usually don’t order soup as an appetizer but the lentil and Italian vegetable soup were excellent!! So fresh & full of flavor. Ordered off the specials for our main course. Although pricey well worth it. The best Chilean sea bass I’ve ever had. My fiancé ordered the squid ink pasta w lobster, shrimp & scallops in a spicy marinara sauce….so delicious! Pasta was cooked perfectly as well as the seafood. So much flavor! Wine list a bit high but expected in the city. Wait staff very friendly and welcoming. Will def come back w our family!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dThfZVh3EAE",
            "text": "My friend  and I visited Giglio Tribeca for dinner and were immediately greeted by Zoran, the host. His warmth and energy made the meal that we eventually ordered that much more enjoyable. Couldn’t recommend this place more."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OHJ5dU13EAE",
            "text": "Terrible carbonara, didn’t eat it after one bite. It’s too bad because the space is cute"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaWNpM0hBEAE",
            "text": "Great food; nice space; exe ellent wait staff; old school Italian updated"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcXF1VGt3RRAB",
            "text": "Nice atmosphere with a great menu. All of the food was delicious and the service was excellent. All of the servers were extremely attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYZ3AzVlFBEAE",
            "text": "Great Italian, lots of options and warm ambiance. I enjoyed my meal\nand the staff was efficient and friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURub1o2SURBEAE",
            "text": "Amazing food and atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuZ2Q2TVVBEAE",
            "text": "This is a great seafood and pasta restaurant. We eat often inside, outside and takeaway. The seafood risotto is among the best in NYC and the snapper and seafood divine. Both are large portions which are always well put together. The service is good and the restaurant cute. It is in the best restaurant spot in NYc so you have it all. Take it in. Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdXYzUUh3EAE",
            "text": "Delicious !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbXBLN2VnEAE",
            "text": "amazing food, good cocktails, excellent service by Marco .."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ajV1RmxnRRAB",
            "text": "Great staff led by Zoran. Classic Italian done right in a classy atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cDdPMEhnEAE",
            "text": "Cannot recommend this restaurant enough!\nThe service, the food and the atmosphere were all outstanding! From the antipasto to the entree, every bite was delicious. My husband even asked for something special and they accommodated his preference with perfection."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3d2I2bWZ3EAE",
            "text": "Amazing food, ambiance, and service. Will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3c0w2cHZ3RRAB",
            "text": "Amazing place and customer service ! Food and wine are fabulous 🙏🏻 The best experience! Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicjRtSmdnRRAB",
            "text": "Randomly stopped by for lunch, the service and food was amazing! Get the burrata"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybDhYU0NnEAE",
            "text": "Just too expensive even for me, and I love to spend. But $60 for a chicken parm is insane. Il Mulino has a better chicken parm for less."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOEktZlpnEAE",
            "text": "We took family from out of town.  The service and food were both perfect.  Can't wait to go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENkxMRTZ3RRAB",
            "text": "I sprinted from dinner to write this review. It should be impossible to get into this place. I’ll start by saying the service is absolutely bar none, including every ultra fancy Michelin stars I’ve been to. Second to none. The food is exquisite and the menu is creative and unique. Very modern take on Italian with something for everyone. As fresh as it gets. The vibes are cozy, classic, and upscale. Definitely a good date night destination. I just cannot say enough good things. Will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eHFEYkZBEAE",
            "text": "My favorite restaurant in Tribeca. Always makes me feel like I’m back in Italy. Great food, great service and a great ambience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aTlhcktBEAE",
            "text": "Il Giglio makes you feel as if you were transported to a past decade (or to Italy).  From the complimentary antipasti, menu options (yes, including dessert), and wine list, Il Giglio is designed to please those who know what kind of experience, food, and service they desire.\n\nIt was so pleasant overall!  I should explain in more detail in a future review but sometimes this is all you need to hear.\n\nPerfect for a date, small group, or an important business dinner too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NUwzLVBnEAE",
            "text": "My wife and I had the pleasure of visiting Il Giglio for a pre-wedding drink, and we were truly impressed by the entire experience. The restaurant's ambiance is a perfect blend of cleanliness, modernity, and chic style, creating a delightful setting for any occasion.\n\nFrom the moment we walked in, the staff's warmth and hospitality made us feel genuinely welcome. Their attention to detail and commitment to going above and beyond set Il Giglio apart from the rest. We ordered two glasses of prosecco to kick off the evening, and that's when the exceptional service truly shone through.\n\nTo our surprise, the manager personally came over to our table with a small plate of bread, meats, olives, and cheese, insisting that we shouldn't be enjoying our drinks on an empty stomach. This thoughtful gesture added a personal touch to our experience, highlighting the staff's dedication to ensuring their guests have a memorable time.\n\nIt's the little things that make a restaurant stand out, and Il Giglio excelled in every aspect. The manager's proactive approach to our dining experience left a lasting impression, making us eager to return for a full dinner experience in the near future.\n\nIl Giglio has proven to be more than just a place for a casual drink; it's an establishment that takes pride in providing top-notch service and creating a sophisticated atmosphere. I highly recommend Il Giglio to anyone seeking an exquisite dining experience, and I personally can't wait to return for a more extensive exploration of their culinary offerings. A heartfelt thank you to the staff for making our evening truly special."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcU1hSFJ3EAE",
            "text": "Great bar ! The manager it's very knowledgeable about Italian  wines ! I will highly  recommend for someone who is a bar sitter   !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMk9qMmhBRRAB",
            "text": "A Hidden Gem Revealed in NY's Dining Scene\n\nNavigating the reservation madness in New York can be daunting, especially with bots snatching up all the sought-after spots. So imagine our delight when a last-minute girls' night led us to Il Giglio, a place that, quite frankly, seemed too good to be true given its unexpected availability.\n\nStepping into Il Giglio, we quickly realized we had stumbled upon something extraordinary. The ambiance, service, and cuisine transported us straight to Italy. The seafood was impeccably fresh, and the pasta dishes, especially my cacio e pepe, were a dream. My seabass, cooked to absolute perfection, was a testament to the culinary prowess of the kitchen.\n\nIt wasn't just us; the air was abuzz with contentment from every table. Everyone seemed to be having not just a good meal but an exceptional one. This made me wonder how such a culinary jewel could have been so readily available for a last-minute booking. Perhaps it's the recent name change from the renowned Il Mulino to Il Giglio that has kept this gem under the radar for now.\n\nThough part of me wishes to keep Il Giglio as my little secret sanctuary in the bustling New York dining scene, it deserves to be recognized and celebrated. This restaurant is not just a successor to an institution; it's a remarkable entity in its own right. I genuinely hope that diners soon catch on to the fact that Il Giglio is the new avatar of Il Mulino, ensuring the continued success of this fabulous establishment. In the meantime, I'll be savoring the joy of having discovered it first. 🍝🐟🇮🇹✨"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdjZpUHd3RRAB",
            "text": "Il Giglio truly exceeded our expectations! The level of care we received from the staff members - from the employee that took our coats, to the managers and everyone in between - was unmatched. We were blown away by their hospitality and the food was fabulous. Next time we're in NYC we will definitely dine here again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdWMyUXF3RRAB",
            "text": "Avoid it! Not an Italian restaurant! Terrible food!\nNone of the plates at our table were Italian, the carbonara wasn't a carbonara but some terrible pasta with loads of onions and cream in it.\nThe polipo grigliato wasn't warm and the potatoes in it were completely frozen.\nAs per the service, first of all the manager keeps shouting at the waiters in front of the table. Then we had interaction with too many waiters and they kept asking the same thing.\nSome of the plates weren't the ones ordered.\nNot a pleasant new year's dinner also with the DJ dismantling the console in the middle of the dinner.\nAll of this with high prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOHVhdG9nRRAB",
            "text": "After Coming out a show, Saw this restaurant on google and it had good reviews so me and my wife went to go check it out. This restaurant has to be one of if not the best ITALIAN restaurant in the city, starting off with the apperativos which include Bread, Cheese very good. Our server Renan took very good care of use giving us recommendations on the wine pairing for the food gave us a very good cab that went very well with our meals. Then the lady that came and delivered the food we also asked for her name which was Johanna has the best attitude and smile, It made us feel very comfortable and delighted to be at that table. Everything was very good and will definitely be back to see Renan and Johanna 5/5 ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxZ09IeGd3RRAB",
            "text": "The staff is amazing - very friendly and attentive. The complimentary platter they serve is filled with olives, fried zucchini, Parmesan, cured meats, bruschetta and focaccia. Not only is it plentiful but it tastes so good. We ordered the fettuccine bolognese and you can tell the pasta is made in house and fresh. The veal chop was the most tender piece of meat Ive ever had. It was so well seasoned and cooked to the perfect temperature. The food was amazing but the service was even better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMS1ySWdRRRAB",
            "text": "Incredible service in a cozy and beautiful location.  The food was delicious, from the starters to the mains, with a excellent wine selection.  Will definitely dine here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWOFBlVDdRRRAB",
            "text": "I cannot speak too highly of this place. We had reservations at 5:45pm, and there weren’t too many people there. Both managers took the time to talk with us, share recommendations, and let us try various wines. The service was phenomenal, the food was superb, and the restaurant was beautifully decorated. The food was so fresh, and the wine selection was incredible. This was one of the best dining experiences we’ve had both in NYC and around the world. By the time we left at 8:00pm, the restaurant was completely full, yet the managers were still taking the time to meet with each table. It felt like an authentic Italian experience in the heart of NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWdDhiMHB3RRAB",
            "text": "Great service! Food is delicious! My wife and son have made it a routine and come here every Sunday! Love the atmosphere and how they treat my son.\nMy son absolutely loves this place and tells us every Sunday- it's diner time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNmZDTDJnRRAB",
            "text": "We were so happy, when we heard Il Giglio reopened and we decided to get a nostalgic Italian dinner experience.\nService was exceptional, spectacular wine list and outstanding food!\nWe’ll definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaek1DeXFBRRAB",
            "text": "An amazing and memorable dinning experience, great dishes with superb wine pairings and outstanding service. I’ll definitely be coming back for more!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bkxic2p3RRAB",
            "text": "Food was delicious. Service was excellent. The restaurant has a nice ambience for a greet night Dinner"
        }
    ],
    "reviews_count": 56
}