{
    "name": "Añejo Tribeca",
    "place_id": "ChIJf4XPj4pZwokRjFYw3YKWv7Q",
    "grid": "MN1",
    "address": "301 Church St, New York, NY 10013, USA",
    "rating": 4.4,
    "user_ratings_total": 1511,
    "phone_number": "(212) 920-6270",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWU1MzaGhha1pHTTB0c2JXOUlOMGRwVG5aTVFXYxAB",
            "text": "Amazing service and hospitality. Absolutely amazing. My friend is visiting from Madrid and he and I stumbled upon the restaurant. We were welcomed and treated with respect by the managers and bartenders and servers. I haven’t received such exceptional service in so long."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVGNFOU9kVlUyVXpCRVVHaG9SSGR4WlhCdE4yYxAB",
            "text": "Great bar for tequila cocktails. Menu looks good. I was very happy with the customer service and decor."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMGRtVmxTSHBMVWtwZmQxVk1kbVJrVTJkVFpHYxAB",
            "text": "After experiencing a terrible night at another restaurant we came straight to Añejo for a pallet cleanse.\n\nThey are always so friendly, accommodating and the food and drinks are amazing !\nOur server was so nice and checked in on us constantly. We had the guacamole, fish tacos, lamb tacos and some flavored margaritas.\nOnce again everyone is so attentive not just our server but all staff is making sure you have what you need.\nThere isn’t much more to say except they are so great and it’s definitely one of my favorite restaurants, highly recommend! :)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MGRTMUlTbWxyUkRKTVlsZFlYMWRyT1dSalQxRRAB",
            "text": "In a post COVID NY of water down drinks and bad customer service, this place is a haven for catching up with friends"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdFBUQzhnRRAB",
            "text": "Cauliflower tacos were very good."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNWRqTjBSMlJ6ZUVaaWFqQmpkSHBaWkY4MGJWRRAB",
            "text": "Charlie was amazing. Pls ask for him! Super attentive sweet and kind and gave great recommendations"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNE9EQTBkbUpLT0RGdVF6Tm9aMnhmY0hwcmFYYxAB",
            "text": "What a charming spot! Busy no but not overcrowded, servers were attentive without being overbearing, excellent food and dangerously smooth Añejo margaritas. I look forward to coming back and trying more delicious meals here!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsemFXZHBlVTF5T0VoSE1teDJhelJOVkV0M05XYxAB",
            "text": "Decent but not exactly great. Small menu more mezcal and tequila than food options.\nCesar salad was interesting but not exactly great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toc2RFdGlZbU5ZTFRkUmRYaDBaR05uYWxsSGVGRRAB",
            "text": "Jodi is the best of the best! I’m not here if she’s not here. She always guarantees my experience is the best of the best !!!!!🩷🩷🩷"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oR2QwdENUak5xYVcxc05VOTNNM3BMT1dwb2IzYxAB",
            "text": "Thank you so much to Jodi she’s an amazing host!! Raise required 100%; no cap i ain’t playing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zdFFYQkJlRzh6YjBjME5VMDNWMlJGWTAxWGFHYxAB",
            "text": "Jodi was incredible, she made my experience one of a kind !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205QmNrOUxlVXBOYlhWNlYwMUpMV0ZIYlRGRFgzYxAB",
            "text": "Food was okay But JODI made my experience so much better. Great & friendly customer service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNlZtbFlkR2hvUkV4elJsQkRaRkZpU3pGbVVVRRAB",
            "text": "I came in today for lunch and, unfortunately, encountered a taco that had mold on it. It was extremely disappointing, given the reputation and pricing of the restaurant, I would have expected better attention to food quality. I understand the restaurant was busy, but when it comes to the physical wellbeing of customers, it's better for a few dishes to be delayed than for someone to risk getting sick from mold. We spoke with the manager, who after taking the dish back to the chef to confirm whether or not it was safe admitted that it had been overlooked in a batch of tortillas. They offered to make us new items and did remove the tacos from our bill, which we appreciated. However, it was still inconvenient, as we ended up spending two hours at the restaurant and left only full from appetizers. We didn’t have time to wait for replacement dishes.\nIn the end, we still paid $65 for the appetizers, chips and guacamole and left a tip for our lovely waitress, who truly did her best. Unfortunately, the overall experience was disappointing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wd2MwTXRNV05hUkVvdGFXdzRZVkZRYUVGdGEzYxAB",
            "text": "Ivan, the general manager, provided an amazing experience. I can't tell you enough what a great person he is.\n\nAfter traveling all day from California, we arrived late on a Friday night.\n\nAt 11:07 pm, I called the restaurant to find out what time the kitchen closed. Ivan said it closed 7 minutes ago at 11:00.\n\nBut he said that if I got there in 10 minutes, he could ask the guys in the kitchen if they can accommodate us.\n\nI told him that we were staying at the M Social Hotel and that I had to get an Uber and didn’t know if I could get there that fast. He invited me to come anyways and to ask for him.\n\nThe kitchen was closed for 20 minutes when we arrived at nearly 11:30 pm.\n\nWhen we arrived, Ivan welcomed us like we were his family. We were offered the full menu and were not rushed to order. They made us feel like they were not closing. It was as if they were just opening and they were very nice.\n\nThe server asked me if I was interested in an alcoholic drink, but for health reasons I told him I could not drink.\n\nThe next thing you know, Ivan shows up with a shot in his hands. He overheard that I don’t drink, so he came over with a specially imported tequila. It has no alcohol.\n\nIt's exclusive to the restaurant and you can't get it anywhere else law in the City.\n\nIvan went out of his way to get me a special drink when I was content with just water. After I tasted the tequila, he made me a margarita with that tequila.\n\nThis place is very high end and classy. It gets an A for ambiance. And the food is absolutely delicious. I swear, the chicken tacos may have been the best tacos I’ve ever had. And that’s saying something since I’m from Los Angeles.\n\nWhen I first heard the kitchen closed 7 minutes ago, I thought I was going to starve or have to go to some late night dive. But I ended up having an extraordinary night. And it's all because of Ivan's hospitality and generosity.\n\nThank you Ivan for the warm welcome on our first night in NYC. You made an ordinary night an extraordinary night. I will never forget it or your thoughtfulness."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214c1ZHeEZOMnhZVGxsTWFuTjZkV3BPTURScVZXYxAB",
            "text": "Loved it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RFZGQjBhMUkyVTNCS01tbElNa2hCT0doa1IwRRAB",
            "text": "We had an amazing experience at Añejo Tribeca! We ordered a special, unlimited chips and salsa plus French toast and two entrées for $35 per person and it’s honestly one of the best deals you can find in NYC. The chips and salsa were fresh and delicious, and the salsas themselves were bursting with flavor.\n\nI had the shrimp and grits and it was absolutely scrumptious — perfectly cooked and seasoned. We left feeling completely satisfied and full.\n\nThe staff was so friendly and the service was spot-on — our drinks stayed full the entire time without us ever having to ask for refills.\n\nHighly recommend this spot if you’re looking for great food, great value, and excellent service. We’ll definitely be back soon"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWU2FYcExMVlEyVFVKWE9XcHVaemwyVFRSRVNsRRAB",
            "text": "Robert was our server! He had an amazing vibe & was very kind and sweet! the bottomless brunch cocktails were amazing! we will be back! thanks Robert!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ZllUYzVTVEpoWXpGQ1VVTlFNR2Q2V21GdFFuYxAB",
            "text": "We went with a large group and the food and staff were excellent. A great experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0elNXRkVXSE5RYjJSSU5IWXpOMHN0VFMwNGNVRRAB",
            "text": "Looks awesome, but they refused service (even a quick shot of mezcal) in the 9'oclock hour even though they close at 11. Really disappointing way to start my first night in NYC.  They did recommend Macao next doorz which was awesome!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKcWNVbEtiMmN5TlVOUE1UTllRV1JtV1ZKeFJIYxAB",
            "text": "Best MEX in NYC"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ac1VUWTFlbkJUYlU0NFlqQkdhWFZTYkRKR2RWRRAB",
            "text": "Great tequila list , good food and in a great spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeE1IZGlSM1ZETXpNM2VrTjFPVmg0UW5VMFJXYxAB",
            "text": "Añejo Tribecca is not just a restaurant, it's a whole experience. The food with flavors that win you over from the very first bite, but what truly makes it special is the team behind it. BENJI, RAUL, IVAN and ROBERT welcome us with such warmth and made us feel at home, even though we were far away. You can tell how much passion and care they put into their work -- not only was the service impeccable, but they also created a genuine and inviting atmosphere. From their recommendations to the way they took care of us, there was that spark that turns a good dinner into an unforgettable memory. The food already burst with flavor, but the real seasoning come from their hospitality. Without a doubt, Añejo is a place I'll always want to come back to -- not only for what's on the table, but for the people who make it so special. Oh..., and the tequila?? Let's just say it was dangerously good!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsU1drbHlORGRDT1hCb2VsQXlkM04wTUcxaGVtYxAB",
            "text": "I had an amazing experience at Anejo Tribeca, the service was friendly, the staff was knowledgeable and welcoming. I had the  Birria  tacos , and they were out of this world! I would recommend all who have a chance to experience this gem of a restaurant to give it a try, you will be so happy you did!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obFRVdG9VM0ppWTNCaWJHUjNURU5WTkdwZlZVRRAB",
            "text": "Amazing service!!! The staff works together as a true team to heighten the experience. The manager is phenomenal - personable, entertaining, genuine, and honest. And the food, absolutely loved. Tasty beef birria tacos. Subtle lamb barbacoa tacos.  Delicious chicken tinga empanadas. Hands down, would return again and again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeVozbzRSWGc0UnpkMldERnBaalpTYUhOdmNYYxAB",
            "text": "Excellent quality food. We were there with my two children, and they prepared something special for my youngest son, who rarely eats. The location and the great service from our waitress, Miriam, and the manager Ivan, were exceptional! We'll be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNVRqQnFlWFpUZDBWamJtWmZlRkF4T0U4MU5IYxAB",
            "text": "I went there yesterday. I had two margaritas and some \"chicken el pastor\" tacos. Nice restaurant, good food, good service, nice atmosphere. I recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWFNrMVlUa3huTjJaQ1dsTk9hamwxVm5saVNXYxAB",
            "text": "We had late lunch around 3pm. Octopus dish was soft and delicious. Enjoyed shrimp tacos and bouritos. Friendly service, reasonable prices, good quality food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205V1JGbGlXVU5aWjI1Sk1WVlBRbkZDT1ZsRU1rRRAB",
            "text": "I have have been going to Añejo Tribeca with my coworkers this summer and it has been so much fun. The staff: Benny, Raul, Andres, Alma and Ivan  treat us so well. I celebrated my birthday yesterday, the food, drinks and dessert were delicious. Great, fun atmosphere.  Thank you to an amazing staff!  👏\nBest drink: margaritas and the 'Jalisco fog' 😋  -Betty"
        },
        {
            "date": "2달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScWRHOHhSbUk1YXpKS1RUbEJlREJ3UW10WmRVRRAB",
            "text": "Sehr nettes Personal"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeU0zcG5XbFpTWTJKSFpUSTJaVzExVWtRd1JrRRAB",
            "text": "Añejo Tribeca nails it every time. Great food, strong drinks, flawless service. Ivan is fantastic and exactly why I keep coming back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWGVsUnRjemgwVXpScVIySkxNRlE0TVZGMFgzYxAB",
            "text": "Añejo in Tribeca is truly one of my favorite restaurants in the city. I’ve been coming here for a few years now, and it never disappoints. The food is absolutely incredible – authentic, flavorful, and elevated Mexican cuisine at its finest. Every dish is beautifully prepared and consistently delicious.\n\nThe drinks are just as impressive – creative, perfectly balanced, and always a highlight of the evening. Don’t skip dessert either; it’s just as outstanding as the rest of the menu.\n\nA special shoutout to Ivan, the manager, who makes every visit exceptional. His warmth, professionalism, and attention to detail truly set the tone for the entire experience. He goes above and beyond to make guests feel welcome, and it’s one of the many reasons I keep coming back.\n\nAñejo is a perfect spot for any occasion; whether a casual night out or a special celebration – and it’s always a 10/10."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cVNuWlBkM0V0UjB0T2RUZHhTMHBoTkcxblgxRRAB",
            "text": "Añejo Tribeca is an absolute gem in the city!\n\nFrom the moment you walk in, the rustic-chic vibe with exposed brick and warm lighting sets the tone for a fun and vibrant evening. The cocktails and margaritas are some of the best I’ve had in New York—fresh, creative, and perfectly balanced. If you love tequila or mezcal, their flights are a must-try.\n\nThe food is equally impressive. The pork belly tostadas were unforgettable, the birria tacos packed with flavor, and the chorizo tamale was a standout. Every plate is crafted with care and designed for sharing.\n\nService was attentive and friendly, making the whole experience even better. Whether you’re here for brunch with bottomless drinks, a date night, or just catching up with friends, Añejo delivers on all fronts.\n\nHighly recommend for anyone looking for top-notch cocktails, delicious bites, and a lively yet cozy atmosphere in Tribeca!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weGFrTTJRblptTkdVMWFtSlZhWFJuT0hWa2VtYxAB",
            "text": "Ivan was absolutely amazing and the nicest guy. The food was incredible and you cannot miss the flan. It melts in your mouth and had me drooling. 100/10 would recommend to all my friends and will 100% be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSmNsOUJRVlk0ZHpSQ01HaE1aRW8xYTFGVllrRRAB",
            "text": "This is the best Mexican that I’ve had in the city. Amazing cocktails and the service is amazing. Ivan is the best. Come here with friends and drink tequila!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSZldHWlpibEJUTURrME1FOXFhMmhGWldkM1kxRRAB",
            "text": "Amazing drinks, guacamole and the flan is a must-get! The service is also stellar, I will definitely return soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMVppMHhTSFUwYTFSbVpqTm9WRVF0ZERSUmFIYxAB",
            "text": "We went with a large event organized by the team at Añejo. Amazing and very professional team running the restaurant. Amazing food.\n\nOur server was amazing as well.\nWe want to give a huge shoutout to Daria and Ivan who organized a fantastic experience. And a special shoutout to our server Mariam, our entire party (25) were very impressed by how on point she was."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMlZtSklaV1JIVVRsTVR6SXljVmhtTUhCSU9YYxAB",
            "text": "I just want to say I had the best food and service experience. The food was absolutely deliciosa!!!! I had the shrimp ceviche and the chicken al pastor tacos.  The mezcal margarita was awesome. The brand of mezcal I had was illegal. Yummy!! And I really have to give a big big compliment to the whole staff, but especially Luis and Ivan. Luis is so knowledgeable. He told me exactly what to eat and I listened! Did not disappoint! And the manager Ivan is great!! Very attentive. So friendly! Just great!!\nDefinitely recommend! Bravo!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aVZtZFNUamhKYVdVNVJUSkJZM052TnpWdlMxRRAB",
            "text": "Their food is so tasty. Their lunch special is a must try- get it with Margaritas!!!!!! Thank you Miriam for your great service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bVZWRkJRMlptWmtsbldWUndjWFIzUjBaSWFYYxAB",
            "text": "Amazing night and great food! The best server Miriam"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQ2JsUlVOM3BXTTBscFgzUXRWVmhTZW5oRE5uYxAB",
            "text": "Thanks Ivan and Miriam for a great dining experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVWNHVlpVRnBHYWpORU9EZFBjbkZZWWpOT1RsRRAB",
            "text": "Try the special mazkal"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNGRtVnZXVE52UVU1eE1rZDJNMGgyZUMxNE9IYxAB",
            "text": "This place was awesome! I love how the manager came up to our table and engaged. Ivan was really nice. Thomas was an awesome server! The food was amazing especially the Carne Asada. 10/10 I will be back!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGS1J6WmlkMDQyZUY5ek1EZGtNR3BRZFV0U1pFRRAB",
            "text": "Ivan was the best! The service/food was AMAZING would definitely recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTmJYUlNRM3BNTW5wdFprVjNSQzFLV0d0RFkyYxAB",
            "text": "Came with with a part of 7. Seated promptly, energy and customer service on point. Food and drinks 10/10! Thanks to Ivan & Thomas, will be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNlptVkROM2gyVFhVNVdYazVUbmRQY2xvMU5tYxAB",
            "text": "I truly love this place! I’ve been twice at happy hour. It’s never too crowded, the fish tacos are INCREDIBLE, the margs are great, and it’s just a good time. The staff is also very kind and the owner/manager is always on the floor. They really care about your experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201U1oyOHhiblIwZW1nMFVITlhRVll4UjFkdmVrRRAB",
            "text": "Love it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sT1VHSXRPV1p6YlUxcmNDMTBlV1IwUjFCWFVFRRAB",
            "text": "I tried calling them five times to talk to a host since I wanted to order my friend a birthday drink (she was dining there) and the AI agent did not let me talk to the host. Unbelievable that you have to talk to robots these days to get anything done."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMGRITTFWVTl1ZFZkRlEySllUVFpYZGpKblRsRRAB",
            "text": "Reviews looked good but experience was disappointing. Between an unattentive server, did not stop by the table one time (other than me asking) and food dish delivery to the table was ten minutes between the first and second entree, just a subpar experience.\n\nOn the latter item, when I asked the server about this, all she said was “the food is delivered as it is prepared,” all I could do was chuckle at the kitchen timing.\n\nThe corn dumplings were unique and really enjoyed them.\n\nUltimately, I was given a refund and apology for the food delivery timing issue."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSmRUUm5RblpDY0hWa2MxZzBiakJvTUhCM1dWRRAB",
            "text": "Loved the fish tacos and octopus. Beef birria was too salty"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOc2FEUjBPRXRLWVdKcGRuSk9WVUYyYkdGM1JsRRAB",
            "text": "Servers were friendly and helpful"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMYjR3YW44NXZHTEFnEAE",
            "text": "The Al pastor tacos were way too wet, and didn’t have the classic char on the chicken you’d expect from a classic Al pastor (probably why they list it in quotes). Fish tacos were better, and the pork tostadas were my favorite. Overall, it was a serviceable meal"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJakx1a2dBRRAB",
            "text": "LONG hair found in our food. Steak was undercooked with very over done eggs on top. Manager Benny tried to help but we felt harassed as he kept coming to our table to correct the multiple mistakes. More focused on avoiding a bad review than fixing our food. The check was wrong four times and half way through our meal we lost our appetite. The shrimp and grits were decent (apart from the hair) but the jalapeño biscuit felt reheated as it was still very hard. Felt not too busy but service was still very very slow. French toast was awesome and that’s the only reason it’s not 1 star for food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MF8zQkdREAE",
            "text": "Añejo Tribeca is a fantastic spot for great food, drinks, and atmosphere. The margaritas are top-notch—fresh, flavorful, and perfectly balanced. The tacos are a must-try, especially the short rib and crispy fish. The service is friendly and attentive, even when the place is busy. The ambiance is lively yet cozy, making it a great spot for date night or a casual hangout with friends. Highly recommend if you’re looking for quality Mexican food in Tribeca!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOSzZsZDc5aGF5LWV3EAE",
            "text": "We went there for lunch after our granddaughter's graduation. Food was great and their drinks were excellent."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX055Z3hBRRAB",
            "text": "Came here on Tuesday night at 6:30 did not need a reservation. We sat outside with our two dogs. They were very accommodating and brought water for the dogs. The manager came over offered us free chips and salsa. Everything we ordered was fantastic. The cocktails are delicious and the prices are good. While it is not cheap, it is not ridiculously priced and the portions are big. We got fundido and ceviche as well as pollo adobado and carne arechero and margaritas. Absolutely loved everything."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURILWJxUUZnEAE",
            "text": "Shout out to Raul for giving me such an amazing experience! His customer service and knowledge of drinks was above and beyond. The restaurant is very lovely and cute. Right when I walked in, I was greeted with warm welcome and smile by the host. I sat at the bar and Raul was the bartender. I challenged him to make me a cocktail drink with requests of tastes, flavors, and type of liquor and he did not disappointed me. I’ve never had a drink with egg york due to the raw tasting and smell I experienced at other restaurants. But he know how to make it tasty and delicious! A basket of fresh nacho chips is brought out with 4 different sauces. The sauces could use a little improvement of additional seasonings (little bland and spicy). The tacos were delicious with crispy fish fillet served in warm soft tortilla shells. Definitely need to check this restaurant out 💯"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnejQ2RVJnEAE",
            "text": "We stopped here for dinner since it's near our hotel. I'm so glad we did because they have incredible food & drinks. The guacamole, al pastor tacos & margaritas are very good. They also offer flights on tequila and mezcal, I recommend trying one of those."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bHZESnNBRRAB",
            "text": "We went to Añejo in Tribeca and everything was great! Every dish we tried was better than the next. The margaritas were also very good. My bf who doesn’t really care for margaritas was impressed. My favorite dishes were the pork belly tostadas, the ribeye fajitas, and the cheesecake. This place is a must visit! We are already thinking about going back lol"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOGFQZElREAE",
            "text": "Tried a bunch of different tacos. They were good, not exactly memorable but still a good meal. The draft beer was really smooth."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OWN5Rm13RRAB",
            "text": "Great service. It was very welcoming and perfect suggestions from the server. Everything was delicious. The music was great and I will definitely come back. Im sad we missed brunch but now I have something to look forward to. The flan desert was my least favorite but we tried the coconut tres leche and the cheesecake and those options definitely made up for it. This is the place for delicious drinks and awesome tacos. The lamb tacos were 10/10! My friends were tempted to order some more empanadas to go. I forgot to mention it was my friend’s bday but the service was so top tier that the celebration felt implied. Food was so good, I left feeling bilingual! Gracias"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcTdqQnBRRRAB",
            "text": "Very good food. The guacamole was very nice. We had vegetables in addition to the tortillas, which was very welcome (it was mostly carrots and some other roots, and a few cucumber slices). Pork tacos and pork belly tostada were also excellent.\n\nService was good. The atmosphere was fine."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOR0xyWkcxMGZmMDdBRRAB",
            "text": "our server robert was so sweet ! i had the “mendoza” margarita & chips with guac/salsa. my drink was very sweet but still strong. great experience ✨"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaGEwcFJOSGhuWWtwNlFXOUdTVXcwY0ZoWE1XYxAB",
            "text": "First time here and I was supremely impressed.  My wife had shrimp and grits and I had the cheddar Jalapeno biscuit...the flavors were insane!  I can't wait to go back and try other foods.  Brittany our server was so cool - if she's yours you will enjoy your time.  Highly recommended for brunch!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLclBuOUstajZ1TVRnEAE",
            "text": "Went here for the $55 brunch special for father's day. We were a few minutes early but the super friendly staff were accommodating. The shrimp and grits are amazing. So are the breakfast tacos and the French toast is out of this world. Had a great time, highly recommended.  Staff are super friendly and helpful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4LWJudk93EAE",
            "text": "Nice Mexican restaurant in Tribeca district. Vibe and food are good. The service at the beginning wasn't so impressive, I guess because the first shift about to leave and the waiter a bit rushes us to order. After changing shift. Our server is a lady and she is very nice. They also have happy hour and free salsa quatro (yelp check-in) but you should double check when your bill comes because they maybe don't take it off. Overall I like this place a lot and look like they will be busy during night and weekends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuczdtbTlRRRAB",
            "text": "From the moment we walked in, Manager Nelson's warm smile and genuine hospitality made us feel welcome. Alma was knowledgeable, enthusiastic, and helped us navigate the menu with spot-on recommendations. And Raul, the mixologist, crafted cocktails that were truly works of art.\n\nFresh ingredients, bold flavors, and beautiful presentation. Every dish exceeded our expectations.\n\nWhat truly sets Añejo apart is the staff's passion for exceptional service. They genuinely care about your experience and strive to make every moment memorable.\n\nAñejo Restaurant is a must-visit for anyone seeking an exceptional dining experience. We can't wait to return!\nHighly Recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyX3NhSm1RRRAB",
            "text": "Oaxacan colada was really nice.\nFor appetizers, we shared the pork belly tostadas and it’s very tender, I really like how it’s paired with the crunchier wrap. Shredded beef enchiladas were…"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocGJ1VVF3EAE",
            "text": "Update: tried this place again years layer and they provided burnt tacos!\n\nThe food wasn't bad, but okay. I had the shrimp empanadas, which were overcooked and hard. The drinks were delicious. However, we walked in, and we were seated but were not told that they only allowed an hour and a half for the table. As we went to order another round of drinks, we were told that they had another party at 6 pm and would need the table. Nothing wrong with it. Tell us up front, and we could have chosen to go elsewhere. The drinks weren't good enough to have us come back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZek1uczB3RRAB",
            "text": "The tacos are very good and in a good location. The Birria tacos are good and the lunch special is a decent deal.\nUnfortunately the waiter doesn’t check in very often."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dVkyRUVREAE",
            "text": "First time coming here and it didn't disappoint!!!! I honestly had the most awesome experience. It is so rare nowadays to receive the type of service that this restaurant gave. Alma was our waiter and she was exceptional. She answered all our questions and gave us great recommendations. She has such a wonderful personality and was very attentive and cheerful. The food was full of flavors and so delicious, we were so full but couldn't stop eating. And our drinks omg what can I say. Jason the bar manager definitely knows his tequilas and recommended us each a cocktail that fit our personalities. Even the hostess that directed us to our seats was extremely nice. I will definitely be coming back to this location. I went for brunch hours and had a blast. The environment was so lively especially the upbeat selection of music. This is a restaurant you must add to your list. Highly recommend!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbi1YUzZBRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nWhat a fantastic find in Tribeca! This Mexican restaurant offers an unbeatable location right across from the Roxxy Hotel, where you can catch live music after your meal. The atmosphere at Anejo was fun and lively, perfect for a night out. We stopped by for happy hour and were blown away by everything we tried — the nachos and tacos were absolutely delicious, and their signature margarita was a real standout. If you’re looking for great food and a vibrant setting, this spot is not to be missed!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwX3RhMU1REAE",
            "text": "I honestly loved the Skirt steak torta. I did the lunch menu which came with rice & beans and guac & chips. I was greeted very beautifully. I went alone and I had a feast. Tacos weren’t my favorite but still good. I got full pretty quick. Esquite was delicious. I loved the Mezcal Paloma the waiter recommended. And the Tequila flan was amazing! Atmosphere was calm for a Tuesday afternoon. Props to the cooks and staff! Will def come back again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZbnNuTnBRRRAB",
            "text": "We did the all you can eat/drunk brunch deal. Pricy at $49 but you get a tremendous amount, both quantity and quality! The drinks were delicious (sampled a big, well made bloody, margaritas and rose sangria) and they're attentive staff…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdko3ZHd3RRAB",
            "text": "THE BEST MEXICAN FOOD I'VE EVER HAD\nI've been to many places in the world and always tried Mexican food. From my home country (NL), to Denmark, Spain and even Mexico itself. But Añejo is the gem.\n\nWe didn't have a reservation, but were very happy to have a table in this cozy place. The atmosphere is great. It's busy and there's nice music. Staff is extremely friendly and very quick. But the menu and thus the food were so good. Really amazing. There also are a lot of different cocktails, of which I loved the Añejo Margarita the most.\n\nThe staff deserved the tip very much."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdGEzMTlnRRAB",
            "text": "The hostess and food runner were really lovely, and the food and drinks were good. However, our experience with the bartender left the entire experience ruined and will not come back because of it. He spent most of his time on his phone and wasn’t helpful or friendly when we had questions. He even had AirPods in at one point. Ive only ever given 5-star reviews, so this really says something. Even with only eight customers in the restaurant—and only five at the bar—we had to call him over because he seemed more interested in his phone than in serving us. Not once did he ask if we enjoyed our food or drinks or if we needed anything else. At one point, my mom was talking to him while packing up her food, and he literally walked away mid-sentence. We waited to cash out for 20 minutes with my card out in front and our food packed away and drink glasses empty and he didn’t acknowledge us once to notice. I was wondering how long it would take but after 20 minutes I was just way too annoyed to even see if he’d notice eventually and called him over. It’s a shame because everything else was pretty good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwc3RuTXl3RRAB",
            "text": "I went here because of the amazing reviews the place had. The ambience was nice and the service was very good! The downside was that only some of the food tasted good. We ordered an appetizer, 3 entrees, 1 side and a drink. Of the 3 types of guac in the trio one was really good. The rest were too tangy (too much lime in the guac). Even the entrees were either too bland or too dry."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhdEoyZnRBRRAB",
            "text": "Loved the dinner. This was a pleasant surprise for my wife and I. The drink prices are on par with the area but the food prices are very reasonable. All the food was delicious and the margaritas were great. Definitely recommend the pork belly tostada and the crispy cauliflower tacos."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMSzctYXFYNC1uOVVREAE",
            "text": "Only tried chips and five dips, but omg awesome!! Service was more than I can say! EXCELLENT atmosphere!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMVltT1d3EAE",
            "text": "Anejo Tribeca really delivered a fantastic dining experience! We had the wild mushroom quesadillas and crispy fish tacos, both of which were bursting with flavor. The quesadillas were a delightful mix of earthy mushrooms and melty cheese, and the fish tacos had the perfect crunch. The star of the show, however, were the churros – crispy, fresh, and utterly delicious. They were just the right touch of sweetness to round off the meal. Definitely a spot worth checking out for some top-notch eats!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5b2IyazlnRRAB",
            "text": "Delicious elegant Mexican restaurant! HOT TIP: ask for their home made spicy sauce and you’ll get their salsa and chips for free! Jalapeño margarita had jalapeño infused tequila so every sip was spicy - only order if you love spicy. Highly recommend the mushroom quesadilla and ceviche but know the portions generally are not big here. You’ll need to make a reservation if it’s a weekend dinner!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaGFXaG9SekJFVW1Zd1VuRXlRMVI1YkVseFVIYxAB",
            "text": "Not going back here.\nTook 45 minutes from ordering to the time we were served. Waitress didn't bother to check on us in the meantime. When we were finally served, the entrees came out one at a time so the food was cold for the first person by the time the entire table had their plates. Oh and they never brought out our appetizers.  Meanwhile, all the tables around us were served without delay. On a Tuesday after work, it wasn't even that busy. Can't properly rate the food & atmosphere as the poor service ruined everything else."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNod2FISXFnRRAB",
            "text": "Sunday at 1pm - brunch.\nWe had reservations but they won’t seat you unless your whole party is there.\n\nGuac trio was good to share\nThe best was the pork belly tostadas!! Had to order a second round.\nSteak and eggs were solid too\n\nThey have a seating area downstairs, quieter and easier to converse with your group. Also closer to the bathrooms if that’s a concern for you."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycVpQdHVBRRAB",
            "text": "Looking for a Sunday brunch we found this great Mexican restaurant! They accommodated us even though they were super busy. Service is great and super nice. All the food we ordered was delicious. From huevos rancheros to breakfast tacos and guacamole, to their classic margarita. Music is great and lively, loud and makes you wanna dance. Great place truly!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHaWZTMEl3EAE",
            "text": "Stopped in for a quick lunch after shopping in the area. The service was quick and the staff were friendly.\n\nI loved the different salsas they came served with the chips. I wish I ordered more! I ordered a torta with a side of rice and beans for my main. The food all tasted great and I felt like the portion size was just right. It’s a good value for the price.\n\nI would come back to try more menu items. I would love to see what the night life is like at this location. We went when it was less busy so not as exciting in my opinion."
        }
    ],
    "reviews_count": 84
}