{
    "name": "l’abeille",
    "place_id": "ChIJq75Ur-tZwokRo7I_F_PhlcU",
    "grid": "MN1",
    "address": "412 Greenwich St, New York, NY 10013, USA",
    "rating": 4.6,
    "user_ratings_total": 269,
    "phone_number": "(212) 542-3898",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMVkwTnpUVmhXWTFGVFdFaHVlSEpDU1hGbWJtYxAB",
            "text": "excellent restaurant with very attentive staff. the tasting menu is very interesting, and dishes are taken to tge peak of flavor."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMWNucGtaa2czZVZWaVRsSXdhV0Z4TldOVWIwRRAB",
            "text": "Tried l'abeille for the first time and absolutely loved it! The crispy Amadai was so flavorful, the squid tagliatelle rich and silky, and the signature carrot dish surprisingly comforting. Beautiful food for the beautiful night."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oYVlXSlRSbTVXVjJoQ2JITlNkR0phYkZGR1NWRRAB",
            "text": "Heard so much about l’abeille and finally went. Wow, it was every bit as amazing as people say! The atmosphere was cozy and romantic, perfect for a night out. The terrine with foie gras and whiskey jus was so smooth and flavorful, the Fleur de Courgette with prawn and eggplant was light, fragrant, and beautifully balanced. 5-star experience from start to finish!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STFFXTkphMlJsU0hwUFVVWnVNRUZXYlhaT1EwRRAB",
            "text": "l'abeille is hands down the best fine dining restaurant I’ve been to in New York. I absolutely loved the lobster with almond and white peach gazpacho — so delicate and full of flavor. The pigeon dish was cooked perfectly and just melted in every bite. Everything about the night felt thoughtful and special — can’t wait to go back."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQlFUUm5RMVpGVkVoNU9WTTRkVk54TkU4NFNtYxAB",
            "text": "Had a lovely evening at this downtown establishment last night!  Excellent menu with high quality ingredients and creative presentation.  Incredible wine list.  The service was perfection!  Highly recommend for a very special night out!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTWNYSjFVM1ZqTTJkbFMyeHpUamx2U1VkamIyYxAB",
            "text": "We’re invited to a special event and the experience was amazing each dish was delicate well crafted a balance of savour and flavours !! Full menu was served with different wine ❤️❤️"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vM05EQjNNbmhQYjFkNFdXSktVSHB5WVZWS09HYxAB",
            "text": "Delicious. Young, passionate chef. Certainly 1 Michelin Star -- looking forward to when they win another!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSWRDMTBUbXhLVDBSNFNuWTRjMUZrVFdSTWEyYxAB",
            "text": "An incredible dining experience for our birthday! We visited l'abeille recently and every dish had its own personality. The stuffed squash blossom was full of flavor and impeccably plated. The tile fish with tomato sauce vierge was sublime. Loved how the scales were cooked crispy. The desserts were awesome too, the celery popsicle was playful and refreshing — such a fun way to begin the sweet part of the meal. The lemon dessert was creative, bright, and the perfect finish to the evening."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSk5sZGtWMnRXTW1aMlVFdDRXRXRxZEcxWFVFRRAB",
            "text": "I knew within the first 30 minutes of this experience that it was going to be one of the best meals of my life, and I was not wrong. I have eaten at many great/Michelin starred restaurants throughout the United States and Europe, and L’Abeille just catapulted its way into my top 5.\n\nThe space itself is fantastic, beautiful and intimate yet not overbearing, and the service even better. The sommelier was extremely knowledgeable about the wine list and was able to provide us with a bottle that gave us exactly what we were looking for within our price range. And then the food. Chef Mitsunobu walks the line between indulgent decadence and childlike creativity in the greatest way. It is rare that a menu is able to be clearly committed to giving you the best versions of food you have had before, while also introducing you to completely new flavors and culinary ideas. A rarity at most restaurants, the most memorable dish may have been the chicken course. Granted, it was helped with foie gras and whisky infused jus, but still, some of the flavors found on that plate made me stop to reconsider the possibilities of a what a chicken dish can provide. Some other highlights include the most incredible combination of prawns and grilled eggplant inside the flower of a courgette, then a peking duck au poivre with intense peppercorn, and a citrus-forward dessert that played with temperature, acid, and sweetness like not many can.\n\nI cannot give any higher praise to Chef Mitsunobu and his team at L’Abeille, and I cannot recommend it enough. My only regret is that I wish I could’ve thanked him myself after the meal."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscmNXZzBZVm90Y25ST2JWZFlUSHBQWWxaWlkyYxAB",
            "text": "A friend recommended us l’abeille, and it truly lived up to the praise! The “Peking duck” with beets was a creative and flavorful main course and we also loved the beef gelée with uni and horseradish cream. So rich yet beautifully balanced. To finish, the strawberry dessert was light, refreshing, and stunningly presented.\n\nEach course was a work of art, and the service was warm and thoughtful throughout. The Michelin star is absolutely well deserved!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWldreDRXSFY1YWxaYVEwUkRNVmw0VW1KdU0wRRAB",
            "text": "Absolutely magnificent food and service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNWVuWkhjMlZDU0V4WlVVSjRjR0pqYlhwMGFrRRAB",
            "text": "Perfection"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSVYydERkR2w0VTJ4bk9GTktRMWN4U1RSVGEwRRAB",
            "text": "Absolutely loved our dinner at l’abeille! The truffle pasta was rich, silky, and full of that incredible aroma you can only get from fresh truffles, simple but unforgettable. The absurd amount of fresh black truffle shaved right over the top. The aroma hits you first—earthy, intoxicating, the kind of smell that makes you close your eyes for a second. Every single bite is a little piece of heaven. Every dish was served at the perfect temperature, showing just how much care goes into the details. The setting was cozy yet elegant, perfect for a slow, relaxing evening. Everything from the atmosphere to the flavors made it such a special experience."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUWQyWlVlbXRKTkVzMlRraGZVRmwwZG5od2VVRRAB",
            "text": "One of our favorite Michelin dinners this year. The food was delicious and well presented. We appreciated the staff's flexibility in allowing us to order items off the tasting menu as well as the a la carte menu."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SR2QyaG5ja1pyUkVGaFJEUndWRTFUU0VGSWVsRRAB",
            "text": "We had such a wonderful evening at L’Abeille. Every plate that came out looked like a piece of art, colorful, elegant, and beautifully put together. The pavé of turbot braised in red wine with smoked bacon and leeks was the star for me, rich and comforting in the best way.\n\nWhat made it even better was the service. The staff were friendly and attentive, always around when we needed something but never overbearing. It felt very personal and welcoming.\n\nThe space itself is calm and elegant, the kind of place that makes you slow down and enjoy the moment. Everything  from the food to the atmosphere came together perfectly. A very memorable dinner, and I’d recommend to anyone visiting NYC!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWVJrOUJSRkl4WTI1TFprZ3pSRU5CZGpGNE9GRRAB",
            "text": "This place is amazing! The bar is beautiful! The food is 10/10! The owners are always around and making sure the place is perfect. The chef is a wizard and so humble!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUU1qUTNPRk4wZFVkb2RuVkVaa1F3ZDFCUFlWRRAB",
            "text": "Excellent tasting menu and truly unique NYC dining experience. We found the wine pairings to add a perfect level of unexpected flavor depth to all dishes, and the dishes themselves to be flavor bombs on their own all around. We did not know Chef's history prior to booking here, and his background truly shows in impacting his footprint in all dishes. The wine list is impressive as well, full of classics but also some eclectic and unique underrated labels and producers as well.\n\nHighly recommend; the price is worth it and the service excellent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abllVSjRaVWQ2WDJOU1RYVlNjV0V4T0hBdFIyYxAB",
            "text": "Incredible food and service\nLove everything about l’abeille!!!!\n\nHad the most wonderful birthday dinner and will definitely come back next time💖"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Qk5Hd3pSbVJLVURWblVVNUVSbTVrYkhwdmNuYxAB",
            "text": "Disregard all the haters with broken English, you obviously know they have no taste. This spot is great and their recent yamazaki collab was worth it. Absolutely amazing meal, my heart left very full ❤️ ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nd1lVa3dSVGgyYTB4bE5uUjZhV1pRWW5kNGIwRRAB",
            "text": "Solid meal"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMlUyTmxZelEwUVRodWJURklRVkF6YURCRFoxRRAB",
            "text": "An unforgettable fine dining experience in Tribeca!\nI recently had the 7-course prix fixe tasting menu at L’Abeille, and it was nothing short of extraordinary. At $245 per person, it’s definitely a luxury experience—but 100% worth it for a special night out in New York City.\n\nFrom start to finish, every dish was beautifully presented and expertly balanced. You can tell the chef blends French culinary techniques with modern, seasonal ingredients. The flavors were refined, creative, and each course built upon the last in a truly elegant progression. The wine pairing was equally impressive and thoughtfully curated.\n\nThe service was impeccable—professional, warm, and attentive without being overbearing. The ambiance at L’Abeille is intimate and upscale, perfect for a romantic dinner, anniversary, or celebrating a special occasion.\n\nIf you’re looking for the best tasting menu in NYC, or a high-end French restaurant in Tribeca, this is the place. It feels like a hidden gem, but one that deserves all the recognition. Highly recommend booking in advance—this kind of experience books up fast!\n\n✨ Favorite highlights: the seafood course, the unexpected amuse-bouche, and the perfectly-executed dessert finale."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUFpuSXRVaTB5TWtKdGQwVnhORTFhYmxaNFdGRRAB",
            "text": "When I retired I was gifted a $550 voucher for L’abeille, Japanese/ French, Michelin star restaurant. It was a year before we finally got there because it’s not the typical place we look for when we visit Manhattan. However we gave it a shot on our last visit and we’re glad we did.\nRather than set menus and wine pairing we kicked back at the bar and split three main courses and a bottle of red wine (175$, one of the cheapest on offer, but good all the same), followed by a desert and a glass of  Hétszőlő Tokaji Aszú (Hungary) and Carcavelos (Portugal) as recommended by the staff.  By the numbers:\nAmbience - 5 (classy, relaxed, not intimidating)\nService - 5 (on point at all times, happy to answer all our questions)\nTile fish, the scales left on and crisped, delicious and unique to me - 5\nLobster, dare I say overcooked - 3\nLamb chops, superb.- 5\nDesert + wine - 5\nTotal cost excluding tip, $540 ($10 remains on voucher code). Tip you have to take care of yourself, you can’t use any voucher value.\n\nAlthough not something I would do on my own dime, we will always remember the overall experience with pleasure."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVFVtWlBXbDl3T0RaeFIzTkJNRU0xZFRaVVptYxAB",
            "text": "One NYC's restaurant gems. Divine food, quiet, and wonderful service.  The tables are spaced far enough apart so that you feel like you're having a private dining experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLS2E2T0hOcUpTY0lREAE",
            "text": "L'abeille will move it's way up through the Michelin hierarchy if it continues turning out the exceptional food and perfect service that my wife and I experienced on our recent visit. This devine restaurant has figured out the business model. Putting a lower cost a la carte offering in a next door space (literally \"a cotê\") for the younger (and often louder) and a formal sushi-ya further down the block. That enables L'abeille's brilliant Japanese-born/French trained chef (and his pastry chef!) to truly cater to gastronomes and oenophiles in a quiet, professionally staffed, small haven...and make it work financially. You will drop over $1,000 for 2 here with a good wine selection or the pairings, but you will walk away happy with everything. Which is much more than I can say for many well-rated restaurants in NYC these days. This restaurant will return you to how things were when they were, well, better!\n[Only thing I would suggest is a shift to tablecloths. I know, Tribeca and all...but.]"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbWdySXZMbXZxdlpnEAE",
            "text": "My wife and I celebrated our anniversary at Restaurant l'abeille and it was one of the best dining experiences of our lives. The concept of Japanese influenced French cuisine was intriguing to us, and Chef Mitsu and his team did not disappoint. ALL of the dishes were outstanding. The tasting menu was so dynamic and with most of the dishes, had amazingly unexpected textures and flavors. They were beautifully presented and perfectly paced. My favorite of the evening? The Amadai en \"Herrisson\" aka \"hedgehog\" japanese amadai tile fish. The signature cocktails and mocktails were so creative, beautifully presented, and matched the menu (we are not big wine drinkers so opted out of the wine pairing). And the service! From the time we entered the restaurant (30 minutes early btw) we were treated like VIPs by the front of the house and in such a warm and genuine manner. We were seated and immediately greeted by our server Laura, who by the way was literally our in-restaurant concierge throughout the near 3 hour experience. Walked us through the menu, drinks, preparation, and service, and found the perfect times to chat us up. It was the same with her team and the manager(?), who were constantly on the move at our table and throughout the restaurant in a synchronized fashion and went out of their way to make us feel like the center of attention, but without being pushy. The ambience! Felt modern yet classic, sharp yet warm, stylish yet comfortable, elegant yet inviting. Tough to balance all those elements but for us, it worked. Thank you l'abeille for a wonderful and memorable experience!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNX2Q3OHJxdmFpMU9REAE",
            "text": "Incredible"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMX0RrTV9raHNHN09nEAE",
            "text": "L’Abeille is nothing short of a revelation. As someone who appreciates the fine art of gastronomy, I can confidently say that this Tribeca gem redefines what it means to dine exquisitely.\n\nFrom the moment you step in, the ambiance is captivating. The setting is understated yet profoundly elegant, with an open kitchen that invites you to witness the meticulous craft behind each dish. The muted lighting and plush seating create an atmosphere where time seems to pause, allowing you to fully immerse yourself in the experience.\n\nChef Mitsunobu Nagae’s approach is nothing short of genius. Each course in the seasonal tasting menu is an interplay of precision, creativity, and harmony. The foie gras crème brûlée, paired unexpectedly yet brilliantly with onion ice cream, balances richness and acidity with an effortless finesse. The scallop crudo, enhanced by beet sorbet, exemplifies how simplicity can be elevated when ingredients are at their peak of freshness and flavor.\n\nOne standout moment was the miso-glazed roasted squab. It was an umami revelation accompanied by crispy quinoa, which added an unexpected texture that complemented the tender meat. This dish alone is worth the visit.\n\nThe wine pairing is impeccably curated, elevating each bite with thoughtful selections that echo the French-Japanese fusion at the heart of L’Abeille’s philosophy. The sommelier’s passion and knowledge add another layer to the experience, making it not just a meal but a journey through taste and terroir.\n\nService is equally remarkable. The staff navigates the line between attentiveness and discretion with precision, making you feel truly welcomed without being intrusive. Their genuine passion for the craft mirrors that of the kitchen. There is a tangible sense of pride here.\n\nL’Abeille is more than just dining. It’s a curated experience where every detail is considered and executed to perfection. Whether you’re a seasoned epicurean or someone simply looking to celebrate a special occasion, this is the place that will remind you why food is an art form.\n\nPrepare to be captivated. I left inspired, grateful, and already planning my next visit."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMaTRrczJwb19Majh3RRAB",
            "text": "What an insult this experience was. From the quality of the food to the hospitality, or lack thereof, everything was subpar, to say the least. Whoever awarded this abysmal place a Michelin star should be charged with fraud. It is possibly one of the biggest traps I've walked into in my three years living in the city. Do not waste your time or money, as there are far better dining experiences at that price tag.\n\nAdding my response following the comment left by the owner:\n\nThank you for taking the time to follow up with us. I’d like to clarify why we left the evening feeling blindsided and, frankly, rather let down by our experience at l'abielle. Moreover, it baffles me that you would make such a statement as \"blindsided\" when reading through the other unfavorable reviews, similar concerns were raised. This should come as no surprise.\n\nWhile your staff was courteous and service appeared synchronized at first glance, the interactions felt profoundly transactional and impersonal, which is unacceptable at a restaurant of this caliber. Our server didn’t introduce herself or try to establish any rapport, a simple gesture that could have made a significant difference in creating a warm atmosphere.\n\nAt the beginning of our meal, I appreciated being asked about dietary restrictions, especially since I had responded to a text message I received two nights prior informing your team that no one in our party consumes pork. However, I was the only one who didn’t receive chorizo with the lobster course—a detail that, while seemingly minor, reflects a lack of attentiveness to our needs. It’s small touches like this that demonstrate whether a guest’s needs are genuinely being prioritized and catered to.\n\nWe noticed that glasses were left uncleared throughout the evening unless we specifically requested it. For example, my first glass remained on the table the entire time, which diminished what should have been a smooth dining experience.\n\nRegrettably, the food did not meet the expectations set by a restaurant promising \"Japanese-influenced French\" cuisine. The flavors were muted to the point of blandness, the lentils were undercooked, and the fish was somewhat dry. The dessert box was another disappointment; the non-edible decorative stones adhered to the edible elements, which themselves were dry and pasty, leaving a less-than-ideal final impression. And, if you choose to serve bread, please ensure it is edible and not stone hard.\n\nAesthetic choices felt inconsistent as well. The mismatched wine glasses varied in shapes and sizes; while this may have been intentional, it wasn't explained or integrated into any coherent theme. This points to a larger issue—the experience lacked a cohesive story. At this level of dining, guests seek not just quality food but also intentionality behind every detail, from plating to ambiance.\n\nFinally, seeing staff casually lounging on bar stools, posing for group photos, and congregating in the dining room while guests were still finishing their meals did not convey the professionalism or hospitality typical of a fine dining establishment. Even if we were the last seating, the atmosphere should respect the dining experience until the very end.\n\nIn summary, we arrived hoping to be delighted but left feeling disappointed. We’re sharing this not out of malice but in the hope that it encourages a greater focus on the experiential aspects of your service rather than just its performative facade. We are quite disappointed and feel very duped by this experience.\n\nSincerely,\n\nShahab"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNjlmbWNREAE",
            "text": "l'abeille from el salvador y Gascón is better"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcmJMbnBBRRAB",
            "text": "Great experience with amazing staff"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLU5pTmhRRRAB",
            "text": "The food was very fresh but the flavors were nothing special."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbTk3UHFBRRAB",
            "text": "Exceptional. You will leave lightly hungry, but you will leave satisfied. It’s quiet- vibes aren’t really there-  but the execution is undeniable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdVl2UXZnRRAB",
            "text": "One of the best meals I've had great food great staff . Had my birthday there and made me feel great .Chef and Oscar are awesome people"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnb3U2cDZRRRAB",
            "text": "Lovely 5-Star Experience\n\nThis upscale Michelin-star restaurant truly delivered!\n\nThe interior is elegant but not intimidating—guests ranged from business casual to formal, making it clear the space welcomes everyone. The food was artfully crafted, and the flavors were just as impressive as the presentation. The bar served top-tier drinks, and as someone who appreciates a well-made cocktail, I could tell the ingredients were high quality and likely house-made.\n\nThe service stood out. Multiple servers worked seamlessly to ensure we were taken care of, balancing friendly conversation with giving us space when my husband and I were chatting. A special touch was the chef personally presenting one of the courses—such a memorable moment!\n\nA couple of things to note: The experience took about three hours, longer than I usually prefer, but honestly, you can’t rush art. I also tend to favor having one server, but the team approach kept everything smooth and consistent.\n\nOverall, this place nailed it—beautiful ambiance, warm service, and food that truly lived up to the hype. It’s an experience worth savoring. Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMHViNTl3RRAB",
            "text": "Overall this rating is in context of the price, as the restaurant is very expensive. So really comparing it to other restaurants in this price class, which is extremely high end dining.\n\nGood: beautifully decorated restaurant, the aesthetic is top notch and generally felt really good dining here. Our waiter was also excellent.\nLess good: the food was good and clearly required expert technique, however we felt there weren’t really any standout dishes that were super memorable or made you say “I could just eat that for the rest of my life” which is something that we do often get from restaurants in this price class. Some of the flavors were just a bit off and not balanced as well as they could be. Honestly some of the prior menus online simply look better than the one we were served in Feb 2025, which perhaps accounts for the stellar prior reviews which made our expectations so high. The food was good and nothing was bad, just definitely fell short of expectations. Probably the weakest dish was a pre- dessert course that was basically a celery flavored popsicle.\nWe also felt in hindsight like we had a bit of a swing and miss on wine, and were kind of steered away from our original direction by the somm. It was decent but just way more expensive and not really what we wanted. It’s too bad because we really wanted to love this place and I could see a different (past) version of the menu being better, so wouldn’t write it off completely, it’s just that we’re only going to this type of restaurant maybe 1-2x a year and the competition is fierce."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbk1IS0p3EAE",
            "text": "Rahul’s the most gracious host- I love the aesthetic of the restaurant. The quality of the food is incredible. It’s truly a wonderful experience to dine there and I would go back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBeHYzZHdRRRAB",
            "text": "Great experience 🫡🫡🫡"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNTZmYnNBRRAB",
            "text": "Service is amazing & nice vibe"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfd3UySGZREAE",
            "text": "Had the most incredible experience at L’abeille. We had chef’s menu with wine pairing, all dishes were unique and perfect portioned. Special thanks to our sommelier who took us on a wine journey throughout the world with wine pairing and shared his knowledge with us. The service was exceptional and not pretentious. 10/10"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeHJQTG5BRRAB",
            "text": "Everything was exquisite...from the service to the food. The cocktails were a nice bonus to a already impressive experience. Can't wait to return"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNnJHMERREAE",
            "text": "Very comfortable place to enjoy dinner.  Food is exquisite but not powerful.  Service is excellent."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ3NMYXhnRRAB",
            "text": "An exceptional journey of taste and sophistication you’ll cherish forever. L’abeille always exceeds my expectation. Of all the Michelin-starred restaurants I've visited in NYC, without a single doubt, this is my favorite. The artistry of the chef, the delightful flavors, the refined yet intimate setting, and the exceptional service all combined to deliver an experience beyond compare. It’s an experience not to be missed. You will not regret."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmc3VDYUVREAE",
            "text": "I've been here twice. The first time I had the Discovery menu, and the second time I had the full tasting menu. The first time, I had to have the Discovery menu because I had guests who had dietary restrictions. The restaurant was very accommodating. The champagne cart is an awesome way to start the evening. Highly recommend starting with that and getting the wine pairings with the full tasting menu. The cuisine was very unique and creative due to the French and Japanese influences combined. Be prepared, though - the full tasting menu was a lot of food, and you definitely want to save room for dessert. The shorter Discovery menu is a great option if you want fewer courses and more flexibility with dietary restrictions. I thought this was a 2 star Michelin restaurant, so I was quite surprised to see they had 1 star. They deserve 2. Nevertheless, the food and service are great. I also loved the more intimate seating on the green chairs - try to get seated at one of the two-tops if you can. It was both comfortable and upscale at the same time. Highly recommend - just wish I had more friends to share this experience!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmakl5RzlRRRAB",
            "text": "We had our anniversary dinner at L’Abeille, and it was an amazing experience. The food was delicious, and the service was superb. Despite making a last-minute reservation and being seated at the bar, the service was personalized and friendly. Jose, our waiter, ensured all our needs were met, and we even got to meet the chef!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cEktV0tnEAE",
            "text": "Nice presentation but definitely has room to improve. The Amadai course was tasteless."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aF83RGJnEAE",
            "text": "Definitely not a 1 star. Foods are average, services are below par. They even took my plate without asking me. The vibe is a typical NYC restaurant. Doesn’t worth the price."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M0xERXZnRRAB",
            "text": "Had the most special dinner with my fiancé. Every single staff member was extra attentive and the food from the tasting menu was exquisite. I would highly recommend l'abeille for any special occasions you have for a memorable night. It is on the pricier end ($400+ pp including tax & tip), but I would say it's worth it."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQZ2VIdXBBRRAB",
            "text": "A phenomenal dinner. The menu was set and we had the choice between a 5 and 7 course meal. We did the shorter of the two. Everything was delicious. My favorite was the pasta with truffle (was an optional add on dish for $130). The wine pairing was interesting as it included one glass of sake. 🍶 And the ambiance and service was great! At the very end you get a goodie bag of cookies to take home. 🛍️ Highly recommend"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNVlpbFVREAE",
            "text": "L'abeille was, without a doubt, the highlight of our food tour through NYC and Chicago. My friends and I were completely enchanted by the experience, and we will absolutely be returning. The food was nothing short of delicious, and the service was impeccable. From the moment we arrived to the time we departed, every detail was executed with precision and care.\n\nThe ambiance was perfectly balanced—warm and inviting without feeling over the top. The team at L'abeille embodies graciousness and kindness, creating an environment that feels as though they truly care about how their guests feel. They made every moment of our visit seamless, from accommodating our reservation to delivering a flawless dining experience.\n\nEach dish was a masterpiece, and the attention to detail put me in my happy place. The presentation, flavors, and textures were all extraordinary, and the patience and professionalism of the staff added to the experience. I even found myself humming with joy as each course arrived!\n\nEveryone at L'abeille clearly knows their role and performs it beautifully. It was perfection in every sense. If you’re looking for a restaurant that will leave a lasting impression, L'abeille is it. We can’t wait to return!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNDVUMXdBRRAB",
            "text": "Really great experience!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOWZHLWxnRRAB",
            "text": "The tasting menu at the bar was an excellent experience. Every dish felt familiar yet packed with twists and a beautiful presentation. The way the chef plays with textures and flavors kept every bite interesting.\n\nThe eggplant dish was fun to eat, with many ways to combine the individual parts. I won't spoil the fun of discovering it.\n\nThe only disappointment was the eel, which I actually ordered on the side since I'm a big fan, but it felt flatter compared to everything else.\n\nThe service was good and the space was very airy. I went early so there were very few people at the tables."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMHBQTzNnRRAB",
            "text": "Good food. Beautiful intimate space. Very friendly and accommodating staff. We had Discovery Menu - shorter course menu - and added Foie gras, which took us about 2 hours. Most of dishes came with little mini side dishes - they were cute, and it was nice to pair with the main dishes. Food portions were good, so we were full at the end of the meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbzktY21RRRAB",
            "text": "Heard great things about this place but was left very disappointed. Our reservation was at 8PM and were told to stand at the entryway and wait as the table wasn’t ready yet. We ended up sitting around 8:20PM and didn’t waste any time to order. We were welcomed with drinks which the server failed to explain that they were not complementary. He had suggested my little sister (underage) have a glass of black tea but later saw on the bill that the tea was $45 (more expensive than the champagne we were also charged for). My parents had ordered the wine tasting and our server suggested we also pair the supplemental fois gras dish with an additional special wine pairing (extra $35). Once this “special” dish was brought to our table, the extra supplemental wine that we paid for was nowhere to be found, only an empty wine glass. I had to ask multiple times to multiple people where the pairing was, I thought pairings were supposed to be enjoyed with the dish? Not to mention that we received our 1st course (out of ~8) more than an hour into our initial reservation time. The whole tasting was a slow experience and took 3+ hours (we were not the last ones to sit down but we were the last ones to leave the restaurant). Our server also suddenly disappeared halfway into our meal and never apologized or explained the reason for the slow service. There was also nothing special with all the courses, actually many of them were misses. The only thing I really enjoyed was the uni risotto and the lemon cake that was in the gift bag. Overall very disappointed and expected much more given the large bill for a special Mother’s day meal, hopefully this was just a bad day for them."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdmFMVWx3RRAB",
            "text": "Went to l’abeille for a celebration and it’s a very romantic place to celebrate something special with your significant other. We chose the a la carte instead of the tasting, which makes us have to sit by the bar. My only complaint is that a la carte has to be at the bar with high chair. It was a bit uncomfortable, especially if you are wearing a skirt it can be quite a hassle. We ordered 3 places plus a dessert for 2 people and honestly it got better as we ate. I would personally consider the restaurant more of a French/Japanese. It was much more french than Japanese.\nThe first dish, Langoustine, was not my favorite. I found it too sweet with the strawberry sauce, which took the langoustine’s taste away. Also the strawberry taste to it came off a bit artificial strawberry and not very natural. Then we had the Mackerel which was quite good with all the flavors especially with the caramelized sweet onion, delicious. I would only suggest the skin to be crispier. And then the duck. It was just absolutely stunning. It was so tasty and flavorful, I loved it to a whole new level. Nothing to change, it was that good. Then as for dessert we order the Truffle ice cream, and as it is written is basically just Ice cream with Truffle. Good but nothing special.\nThe staff were super nice but not very interactive but I personally prefer that.\nOverall, it was a great one time fancy meal, especially because I wanted to add another michelin star restaurant to my list. I would only go back if they suddenly have a drastic change or something super special."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMzVyUml3RRAB",
            "text": "The Chef’s Tasting menu takes you on an incredible journey.  The service and ambience are impeccably tasteful.  One of my favorite dining experiences in New York.  You cannot go wrong choosing L’Abeille for a special dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiX3UtdS13RRAB",
            "text": "L'Abeille masterfully combines the elegance of French cuisine with the artistry of Japanese flavors and ingredients. Each dish is a delightful symphony on the palate—sophisticated yet approachable, classic with a modern twist, and sometimes playful! The ambiance strikes a perfect balance between stylish and cozy, making it feel both chic and inviting. By the way, they have great wine list, and I love to indulge in Krug here, and you'll understand why once you see their drink menu. Just one more reason to be jealous of those living in Tribeca, I suppose."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcDZUN2xRRRAB",
            "text": "L'Abeille was an incredible experience that will stay with me for the rest of my life. From the moment you are welcomed at the door to the moment you leave, the quality of the service and the dedication to providing an unparalleled experience are palpable. The execution of Chef Mitsunobu Nagae's vision feels beyond professional. The perception is that the team shares his uncompromising vision for delivering the best quality ingredients in the most creative dishes I have seen in awhile. The wine list was expertly curated by Beverage Director David Berube and professionally serviced by his team of Sommeliers.\nWe will definitely be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabzZ6Y2RBEAE",
            "text": "Exceptional food, the best black cod and duck ever and a fascinating cold eggplant dish. The incredibly good French bread with Normandy butter was a special treat.\n\nSpecial shout out to the service which was so perfect, it was the best service I may have ever received at a restaurant. I won’t go into the added touches but having eaten at hundreds of high end restaurants it’s difficult but a new highest standard was accomplished here, including service touches I’d never seen before.\n\nI was at the bar which was nice, the tables below seemed a little cramped but come here for the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsb0xlUVpREAE",
            "text": "I had a wonderful birthday dinner last Friday evening. The presentation of the dishes was exquisite, and the majority of the food was fresh and flavorful. The only slight drawback was the 90-minute time limit, which I was unaware of beforehand. We were just savoring the last bite of our dessert when we were informed of the time constraint. Additionally, a few of the dishes were a bit too salty for our taste, so we were unable to finish them. Despite these minor issues, the staff was incredibly friendly and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudnVIajlnRRAB",
            "text": "Gorgeous restaurant with incredible food, every bite was magical. The duck was phenomenal. Wonderful for special occasions. Didn’t loveeee the fois gras but that’s just personal taste. The service, although attentive and warm, was slightly in disarray. Atmosphere was aesthetically pleasing but lacking midweek, as expected"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeUpxRWNnEAE",
            "text": "The food and service are both excellent, but the room is just a very small space for this level of cuisine and expense. The room lacks any scale and grandeur and the interior design is just too safe, crowd pleasing and underwhelming. This makes the experience feel a little like the you’re shopping at the Banana Republic of fine dining. The team does try to pull out all the stops with beautiful china, synchronized plate presentations, a lot of hand poured sauces at the table, an excellent wine list, even a digestif cart - but overall it just doesn’t quite have the magic."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMGMzSWRnEAE",
            "text": "Absolutely phenomenal food at the correct price point for a tasting menu ($180 for 8 courses). The little egg-themed plating throughout was cute and not too much as to be tacky. And overall, it was just so lovely and quiet and intimate.\n\nI would have appreciated if the extensive drink menu had also included some non-alcoholic options to accommodate those of us with that restriction.\n\nSpecial food highlights were the foie gras creme brulee, the scallop + caviar dish with gazpacho sorbet, and the two desserts.\n\nAlso they have a Toto in the bathroom! Really elevated the whole experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6a3NMUGJBEAE",
            "text": "I was overall impressed with the food and service at L'Abeille. Smaller, intimate space as is typical in New York City. Sat at the bar and had the Discovery Menu with the foie gras add-on, which was very good and quite balanced between textures and flavors from end to end. Hand-poured sauces a nice touch. It's clear L'Abeille is working towards a second Michelin star - they're a cut above nearly all the other one star restaurants that I've eaten at in the city.\n\nWhat you need to have an enjoyable time in this restaurant is: expect a very clean and beautiful, but small space. Read the menus and understand what is an add-on. Expect 2-star Michelin prices and food quality."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURob0p6bC13RRAB",
            "text": "Celebrated my birthday here. The food is delicious - French, but not overly salty like many of the fancy French restaurants in the city. The depth comes from the ingredients and preparation as opposed to being overly seasoned. I would rate this a 4.5 in terms of food, but since I can't, I'll put 5 since the service was excellent.\n\nThe foie gras was one of my favorite items. Can't really go wrong with foie gras. This particular foie gras was airy and rich at the same time.\n\nThe king crab was interesting, sort of a tropical ceviche taste in that they mix crab with passion fruit and coconut.\n\nPheasant was fantastic, lots of umami from the ingredients in the consommé broth.\n\nWe added the supplemental Risotto with black truffle - this was a miss in my opinion, nothing super special, just fancy ingredients and very rich/heavy.\n\nSpanish mackeral was just okay in my opinion. I think it's hard to prepare mackeral without a strong fishy taste, which they managed to mute a bit, but it was still there. It's a very light dish though, so that part was nice.\n\nVenison was amazing and one of the more original items on the menu. It was perfectly cooked and had a satisfying crust on the outside. Ironically, the more expensive beef ribeye cap was less interesting (but still really tasty). The cap has a similar texture to short rib and I've had/made better short rib - still really good, but not as inventive as the venison.\n\nDesserts were great, particularly their ice cream, which is extremely creamy, smooth, and not overly sweet. The hickory and dark chocolate ice creams were amazing with the blackberry.\n\nOverall, the service was lovely. It's a great option for the price point @ $195 for 7 or so courses w/o any supplemental. Definitely worth a try and deserving of their star. 4.5/5 for food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleC1XOWtnRRAB",
            "text": "We came here last month for our anniversary dinner, and l'abeille did not disappoint. This was probably my favourite French tasting menu in New York so far.\n\nMy favourite dish of the night was the seared scallops with its seaweed emulsion, which was absolutely phenomenal. The wagyu was a close second (always love wagyu), and the tomato essence with the prawns had me wowed. I'm generally not a huge fan of white fish, but the turbot had me surprised (in a good way!). The menu ends strong with the peach dessert, which tastes as stunning as it looks.\n\nFrom my experience many tasting menus start strong but fall on the main dishes, whereas l'abeille was fantastic at every course and only getting better with each.\n\nIn total for two, it was $540 after tips/tax and with one cocktail each.\n\nFollow me on Instagram @millennial.basic!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtM3VXQTdnRRAB",
            "text": "Be respectful and be on time. The tasting menu takes 2+ hours and you have your table for 2.5 hrs from your original reservation time. If you are late, you won't be able to experience the full tasting menu and you can only do the shorter Discovery tasting menu. The food is amazing and they will try their best to be accommodating for your allergies. But I would recommend calling in advance to find out if the courses have main menus that conflict with your allergies. Plan to spend ~$250/person if you are doing the full tasting menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dnMyWXZBRRAB",
            "text": "Fantastic food in a relaxed fine dining environment. All courses were exceptional. Definitely the best duck I've ever had. Service missed the mark empty plates and glasses lingered too long. We had to ask several times to remove empty glasses and plates. Its tight seating so that took away from the experience. At this price point I just expect better service. Amazing food without a Paris flight. Would definitely go back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyaUtxT1JBEAE",
            "text": "We were so impressed with l'abeille! Chef Mitsu and his team are so talented. Everything was delicious. Our favorites were the scallop tartare and foie gras and mango appetizers, the fluke, squab, and both desserts! Really creative and light/ refreshing (perfect for spring). On top of that the service was just amazing, John the Beverage Director had excellent wine recommendations for us and everyone else was also friendly yet professional. I hope they make the miso butter forever it was the best!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCM0xHVW13RRAB",
            "text": "Nice intimate restaurant with 16 tables and not too loud. Came here for dinner on a Saturday night. Dinner for the tasting menu is about 3.5 hrs. 7 courses and a petit four but no amuse Bouche. Wine pairing is 6 wines, staring with a champagne, a rose, white, 2 reds and a dessert wine. Pours are average size, with the coursing, you’re liking to get tired before you get drunk.\nAll the food was delicious and didn’t leave hungry.\n\n$195 for tasting menu and they have a shorter discovery tasting menu. $125 for wine pairing."
        },
        {
            "date": "1년 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMnRPNHNnRRAB",
            "text": "ミシュラン2年連続のフランス料理\n味、サービス最高でした。\nコース内に日本の食材もいくつか盛り込んでおり楽しかったです。\nまた行きたいお店の１つになりました。"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbjduWk5BEAE",
            "text": "Overall great, service was top notch. Food wise I don’t think I had anything that really stood out to me. Wagyu and fish was my favorite and duck was my least favorite dish (which is disappointing because I usually love duck). Cocktails were not my personal favorite either."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCOS1EUmNREAE",
            "text": "This is the longest fine dining I have ever had in my life haha. We had a 12-course (i guess) but it took us almost 4 hours to finish the meal.\n\nThe food was fabulous. The duck was my favourite dish and the white truffle pasta was what to be there for! .\n\nWe tried almost every cocktails on the menu but you definitely should try some wine too .\n\nThe vibe was very friendly that’s why it was a bit loud . I do not recommend for the first date .It is more about the 2-3rd date."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSb3NiM1dnEAE",
            "text": "L’Abeille reflects the luxurious charms of TriBeCa from its corner perch in this prized zip code. The restaurant is a darling space designed to the hilt with velvet cushioned seats and booths, a striking marble bar and handsome tables set with Christofle cutlery. The young Chef Mitsunobu Nagae is a calm, collected presence in the open kitchen, and years spent working at Joël Robuchon restaurants worldwide are evident. A harmonious union of French cooking with Japanese sensibilities, Nagae’s food is immediately approachable. From grilled trout with Champagne caviar sauce and scallion oil to lychee mousse with strawberry and shiso, each course is a vision of refinement. Servers in fitted suits roam the floor, keeping close watch on every seat.\nFacilities & Services\nAir conditioning\nAmerican Express credit card\nCredit card / Debit card accepted\nDiners Club credit card\nMastercard credit card\nParticularly interesting wine list\nVisa credit card"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeE51REFREAE",
            "text": "Had the tasting menu with my wife and it has nothing to envy foodwise a french 3 michelin star from London. Service is above average for a 1 start michelin.\n\nGreat place for special occasions as it is a bit pricy (700USD all included was the check for 2)\n\nBest restaurant I've tried so far in NY."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aXYyMzBRRRAB",
            "text": "My wife and have been to several M star restaurants in different parts of the world including several Roubochon restaurants and Ducasse and I was truly disappointed at the tasting menu. We had much better Pigeons at a fraction of the cost. The Tuna tartar with tasting caviar was good I may say yet the tuna was something that one can get at any Japanese spot. The highest standard was a plate of Tagliagili that can be made at home and truthfully if you place white Truffles over anything it taste exquisitely delicious yet for an excessive $95.00 once again exhuberant NY prices that demonstrates once again that this City is well overpriced vs. Quality reward.\nIt is not a surprise that nowadays you have several reservations spots opened.\nNever again L' Abeille..."
        }
    ],
    "reviews_count": 75
}