{
    "name": "Warren Street Bar & Restaurant",
    "place_id": "ChIJAzfSMwBbwokRnopDi7dW-Iw",
    "grid": "MN1",
    "address": "86 Warren St, New York, NY 10007, USA",
    "rating": 4.4,
    "user_ratings_total": 75,
    "phone_number": "(646) 929-6286",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMU9EZE1kblV3VDJsTFprbHlSbWQ1VldOUFExRRAB",
            "text": "I went to eat brunch here with my friends and it was wonderful service, great food and beautiful ambience (plates were so pretty) This restaurant supports my son’s school PS150 during Taste of Tribeca and I’m happy to have dined there! Going back soon 💕"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMVVFSjJVak41UTFwNFMwOXVZVEJrVW5wYVNFRRAB",
            "text": "Love it and can’t wait to come back"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVM1EzbFFWMUEyVEhOcWJEbEljWGxCV1Rsbk1XYxAB",
            "text": "Very cozy and impressive decor. Very well-trained and polite waitstaff. To celebrate Valentine's Day, we went there with a reservation for afternoon tea. A great suggestion for this special occasion. I ordered lemongrass tea and this tower of appetizers. It serves two people well. I loved it. Fair prices. I recommend it. 🧡"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WmFDMTNZMnRKYkVsdlpETmxVekptZEVkWlgyYxAB",
            "text": "My friends and I came here for brunch the food was amazing!!! the atmosphere?? 100/100! The ART!? 1000/100! Everyone was so welcoming and friendly. Our server Aerilynn was the sweetest person and was so kind and welcoming she gaved us a mini tour of the hotel will 100% be coming back and staying! Thank you AERILYNNN for your pleasant service! ♥️♥️ and ofc the rest of the staff keep doing your thing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNE1tZFliVEp2YnpaRFdURkJieTAxV21zNFVuYxAB",
            "text": "We were trying to find a brunch spot and came to this. Food was absolutely delicious, alittle on the pricy side but worth it. We ordered chocolate chip pancakes and they did not have the chocolate chip but were able to accommodate us. Our server Aerilynn was wonderful and pleasant, she gave us a tour of the hotel which we weren’t expecting. Seeing the hotel and the art and her explaining the history behind it,  we definitely plan on coming back and staying as guests."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poV2RFWnFXalJaV0U5MVdrRmlSbGxHYkdnNFQzYxAB",
            "text": "This review is specifically for the bar. They make the most amazing cocktails (most notably their fantastic espresso martini) and everyone is so incredibly kind. Also recommend trying their Sunday roast- it’s delicious!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WlFVNVhSM1F4ZFROU1VHWTBhekpYVlZOTllWRRAB",
            "text": "Get the fish & chips!! 💙💙💙"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRUxWTkJkVkV0T0ZCc1ZsOU1XR0U0ZDFKRFUyYxAB",
            "text": "Wonderful bar. Very nice atmosphere and great service. We wandered in while passing by.  Then decided to go back another day."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201Tk5XVmxUbDlxZHpocFpGaFJVRmMzWW1aUlpXYxAB",
            "text": "Really nice restaurant with a relaxing atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOc1RVbDZOell3VUhJMVFqQktYMUE1ZVRoMFZuYxAB",
            "text": "Absolutely gorgeous, detail-oriented, colorful, and vibrantly modern design with an extraordinary eye for the tiniest, charming details. I stayed in NYC for three nights, and each morning, I had breakfast at Firmdale Hotels—the Warren Street, the Crosby, and the Whitby. I am at a loss for words to describe the breathtaking, soul-stirring designs and the exquisite, elegant tea sets. The out-of-this-world, warm, and genuinely attentive service, paired with delicious, thoughtfully curated food options, made each visit unforgettable. It is an absolute must-try. All three properties are divine, with nothing repetitive or stale—each that radiates its own unique, captivating soul. These are dreamy, inspiring breakfast sanctuaries where I left feeling uplifted, motivated, and deeply inspired. Deep inside, I felt a renewed optimism for a kind, peaceful world and a lingering, cheerful hope for the future. Grateful!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wd1pYQnNVRXRaZHpabVRHeFpYM0JKTFd4T01YYxAB",
            "text": "The bartender named Baker was AWESOME. So hospitable and professional. He made me a delicious cocktail and was super fast and attentive. This is one of my new favorite bars for sure!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMFNDMWpNMjlhUW1wUmVtNVhabGd6U2tSalpXYxAB",
            "text": "Top notch atmosphere in a beautifully curated space."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJbjk4cUx1NF9lRnZnRRAB",
            "text": "An absolute lovely space! The food and drinks were good. However, if you are coming for the service - you will be very let down. Our server was terrible. She has not an ounce of warmth or hospitality in her and didn't even do as much as to check in on us throughout the evening. Her embarrassing attempt to upsell us every chance she got became comical (ie: the table orders cocktails and she makes the 1 person ordering a glass of wine feel awkward for not buying a bottle?). This woman needs to be pulled off the floor and properly trained before she turns more people off.\nHowever, there was a very kind woman, Sandra, who checked in with us and we enjoyed chatting  with her!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPMlhyX3VLaHNUNF9nRRAB",
            "text": "I had an amazing lobster roll. The couple we were dining with offered to share their french fries. Im still debating if it was the best or one of the best french fries I have eaten. They were amazing. Did not go expecting to eat fries. However, I will go again just for the fries. The octopus was cooked to perfection. Service was great. Speed of service was \"ok\"."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dWRXb2JnEAE",
            "text": "Nice decor and friendly staff."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuM3E2UGxBRRAB",
            "text": "Very good hotel restaurant.  Service was really good too.  Went for some drinks and appetizers. Get the shrimp cocktail and deviled eggs along with your drink of choice."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRemVfbm53RRAB",
            "text": "Food was good, service was decent, a little slow to start. Quiet early on the got more lively."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRZ3BpSF9BRRAB",
            "text": "Old tuna, small portions, dry and sad. Staff are more miserable than the food never coming here again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMkkyazFBRRAB",
            "text": "A lovely ambience with a great wait staff and great cocktails! I would specifically like to thank Vivian for the exceptional service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnejhENF93RRAB",
            "text": "We had a reservation for breakfast but the service person said that I have to ask my manager than the manager said no, so didn’t get breakfast we just went there from 45 min.  away distance ,so we got to have lunch whic is a few options instead of breakfast but service was very slowly. Never go there, it was really bad experience with my money and time!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnN0wyV1FBEAE",
            "text": "Absolutely marvelous! The interior design of this place was well thought through - quirky yet elegant, campy posh.\n\nThey were only serving brunch when we came at 3:30pm but I really wanted the tuna tartare and they delightfully accommodated my request. And it was delicious!! Fish was fresh and firm that blended with softness of the avocado base. It had just enough acid and spice too. The rice crackers served as a great vessel for every mouthful.\n\nAnd don’t me get started on the toffee pudding! Not too sweet but still decadent. My friend had the chocolate eclair and he loved it. Cocktails were really good too. I had the Slice of Paradise which was refreshingly citrusy.\n\nService was smooth with very attentive staff. Everything was just excellent. We’ll be back for afternoon tea and Sunday roast!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNzgzMjZ3RRAB",
            "text": "We went for high tea service. Food was yummy, interiors gorgeous, atmosphere: perfect spot on a rainy day to grab a cup of tea and linger."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBM18tMG1RRRAB",
            "text": "I had high hopes for Warren Street Bar & Restaurant, but unfortunately, the experience fell flat in almost every way. From the moment we sat down, it was clear that service was going to be an issue. Our server, who was visibly sick—coughing, sniffling, and clearly not well—only checked on us a few times and seemed completely disengaged. To make matters worse, he wasn’t wearing a mask, which felt particularly inconsiderate.\n\nOther employees were present, but they were just standing around rather than helping move things along. The result? An agonizingly long wait for food.\n\nWhen our dishes finally arrived, they were underwhelming, especially given the high prices. The octopus chorizo was overwhelmingly salty, making it difficult to enjoy. The salmon, on the other hand, was drenched in butter to the point of being heavy and unbalanced. Overall, nothing stood out as particularly well-executed or worth the cost.\n\nWith inattentive service, sluggish pacing, and overpriced, mediocre food, I can’t say I’ll be returning. There are plenty of places that do it better—without the side of bad attitude and questionable hygiene."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbjRmTldREAE",
            "text": "I’m not sure if the bartender wanted us to leave or was just practicing his mixer moves anyway a little bit distracting slashing slinging slicing his  stainless steel mixer apparati around like a hibachi grill otherwise it was OK place it is not New York City space  as it is a sprawling wide open space you could be anywhere."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNmazRKcxAB",
            "text": "Disappointing fare in beautiful decor. We tried many of the menu items including duck, salmon, fois gras, and octopus. Everything was underwhelming, particularly given the price point. Far superior food options in the area at half the price. Not a thing stood out as a great dish. Salmon was overcooked, duck was chewy, bread was not fresh. The dining room itself is stunningly beautiful, but doesn't make up for a lackluster meal. Will not be returning."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQM2EtaGVREAE",
            "text": "Jen at the bar was incredible. She was knowledgeable and enthusiastic about the drink menu and she recommended a \"garden of eden\" cocktail that she created that tastes like a magic potion. We ordered apps and sides and everything was incredible, especially the baba ganoush and the mac and cheese. We finished off with an amaretto sour that was made with love and it was so good. Thank you Jen! You made our night. We'll definitely be back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQMXA2Nk53EAE",
            "text": "Came here to meet friends for lunch. Had never heard of this place until today. Thought the atmosphere was very chill and the staff were really friendly.\n\nWasn’t really impressed by the menu. The food was ok. Maybe I just ordered wrong. But willing to give it another go."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzODRyM0l3EAE",
            "text": "Great food, amazing atmosphere and cocktails to keep you coming back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzanVYd2xRRRAB",
            "text": "Did I love it?\nYes!\nWas that salmon perfect?\nYes!\nDid the drinks do the job?\nYes!\nWere the bartenders wonderful?!?\nYes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNVpYM25BRRAB",
            "text": "Fancy breakfast spot in Tribeca, great for business meetings"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYLUp1cmdBRRAB",
            "text": "Very friendly workers and good food. Fries amazing, steak good, cocktails amazing. Tuna tartar interesting haha."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuaGJiQUpREAE",
            "text": "Another Gem in the Firmdale Hotel Chain in NYC:\n\nI recently had the pleasure of staying at The Warren Street Hotel in Tribeca, and I can confidently say it’s one of the best hotel experiences I've ever had! From the moment I walked in, I was greeted with warm smiles and a beautifully designed lobby that perfectly captures the chic vibe of the neighborhood.\n\nThe rooms are nothing short of stunning—spacious, tastefully decorated by Kit Kemp Design and equipped with all the modern amenities you could ask for. I particularly loved the large windows that offered breathtaking views of the city skyline. The attention to detail is impressive, from the luxurious bedding to the thoughtfully curated artwork throughout the hotel.\n\nThe staff went above and beyond to make my stay comfortable. Whether it was the concierge offering fantastic local dining recommendations or the housekeeping team ensuring everything was spotless, I felt genuinely cared for.\n\nThe location is unbeatable! Nestled in the heart of Tribeca, it’s just a short walk to some of the best restaurants, shops, and cultural attractions NYC has to offer. I especially enjoyed exploring the nearby parks and waterfront.\n\nDon’t miss the hotel’s restaurant and bar! The ambiance is perfect for a nightcap or a leisurely breakfast, or dinner!\n\nOverall, my stay at The Warren Street Hotel was exceptional, and I can’t recommend it highly enough. If you’re looking for a luxurious getaway in New York City, this is the place to be! I can’t wait to return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuLWJYNHF3RRAB",
            "text": "Amazing drinks and atmosphere…!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueXFLZEJBEAE",
            "text": "My recent trip to the US we came across this gorgeous hotel. Food was so good service & atmosphere simply fantastic"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaXRTQjJRRRAB",
            "text": "Incredible new gem in Tribeca! The atmosphere and art collection are stunning, and the menu is well executed. A perfect spot for a martini."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOHRYTTZBRRAB",
            "text": "Love this spot! Love the food! So gorg!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOHN6Xzh3RRAB",
            "text": "Great new bar in Tribeca neighborhood. The Warren Street bar and restaurant. Have gone now for drinks and small bites three times. First of all  the bar is large and really well done. The bartenders extremely professional and good at mixing drinks. Lots of specialty drinks and a great wine selection. The bar menu also has some great small bites while at the bar. We needed a good new bar like this in the neighborhood. K"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuc3N6NTNBRRAB",
            "text": "My family has lived in Tribeca for over 10 years, and we've been waiting for a gem like this to arrive for all our needs! The hotel itself is stunning, but the Warren Street Bar and Restaurant is the perfect balance of elegance and comfort. Whether it's a business meeting, a family dinner, or just a martini with friends after a long day, the staff are sure to make sure you feel at home. And the food and wine options are exceptional. (My favorite items are the Hake Fish Cakes and the Lobster Rolls!)  Also, be sure to also check out when they have live music playing. They have Jazz players sometimes which always just adds to the mood! Whether you're a local or just visiting, eating or just having a drink, I highly recommend the 5 star service and and atmosphere of the Warren!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuM2RxU3lBRRAB",
            "text": "Great food.  Bad service.  Highly decorated place.  The servers spent their time mostly facing the wall and haphazardly setting or bussing the few tables that were empty- giving those empty tables and the wall the most attention vs the customers at tables, in a fairly empty restaurant.  This place needs to get its act together.  Disappointed here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeTQzeWFnEAE",
            "text": "What a beautiful surprise to walk into this space! Randomly booked a spot here for a family brunch for 6 of us and had a wonderful time. The staff took great care of us and the food was delicious! I was pleasantly surprised to see they serve Sunday Roast, a rare treat here in the States!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bzZ5V3BBRRAB",
            "text": "The most unique restaurant bar in the world…they charge only  $1 for big rock"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dExUbFRBEAE",
            "text": "The waitress and the food was terrific if I ever come back to Jamestown I will definitely come to this restaurant and look for our waitress"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdllqNzZnRRAB",
            "text": "Beautiful atmosphere and a great staff. Have been here for brunch and dinner at the bar. Exceptional cocktails with a very professional bar staff. Will def be a neighborhood haunt for us! Happy to have them in Tribeca"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNUktRFRnEAE",
            "text": "We had breakfast at the Warren Street Bar and Restaurant this morning and it was absolutely delicious.  Service was great!  We spent most of the time discussing how beautiful each and every detail in the restaurant was.  Such a great addition to the neighbor!  Will definitely be going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaDZHWUxnEAE",
            "text": "Brunch at this restaurant was the most I’ve felt ripped off in a long time. $25 for French toast that is just one slice of bread?! Insanity. On top of that, it wasn’t even good. Do not go here for food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENDhUMlRREAE",
            "text": "Wonderful service. Delicious brunch. Great server"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcTlycHhRRRAB",
            "text": "We had a fabulous high tea here in a beautifully decorated dining room, with friendly staff, and delicious treats. Served in bone china and with a glass of champagne to start things off."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eFpTakFREAE",
            "text": "Love everything! The atmosphere is exceptional! Definitely will come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cjdlaDl3RRAB",
            "text": "Went for dinner with friends and for brunch with family. Food was great, the desserts exceptional! Service was slow, but I’m sure will improve over time. Beautiful design, very European feel with gorgeous tableware. Our new favorite spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bkpxeldBEAE",
            "text": "Service was excellent. Staff is young but knowledgeable and very friendly. Space is beautiful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdU9MTVlnEAE",
            "text": "They just opened but they are not ready. Some dishes didn’t arrive. Some dishes that arrive were terrible."
        }
    ],
    "reviews_count": 51
}