{
    "name": "ITO",
    "place_id": "ChIJiW_7kM9bwokR9qMrG4XITL8",
    "grid": "MN1",
    "address": "75 Barclay St, New York, NY 10007, USA",
    "rating": 4.5,
    "user_ratings_total": 78,
    "phone_number": null,
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVemRtMUdjbWhqTVVKMWVXdzVTSEJYT1haZlNsRRAB",
            "text": "Solid sushi spot, if you’re in the area worth a visit."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adWIyczBPWEZYVDBSU04xWlhkbWg0VTNOek5WRRAB",
            "text": "Extremely fun, impeccable food and service, excellent, large sake selection. Absolutely loved it. Top top omakase for us. Just a blast."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbFNIUkxjM1ZtYVU1aGJUTTBiVXBtYjA4eWNsRRAB",
            "text": "We have dined at multiple Michelin rated restaurants around the world and can honestly say that this was the best dining experience that we've ever had. From the start, the concept of only opening the doors 5 minutes before seating allows you and the rest of the patrons to gather outside in anticipation, it's a nice way to meet everyone you'll be dining with before sitting down. Once the doors opened they immediately checked us in, took our coats and commented on the reservation notes, wishing me a happy birthday. I was again wished a happy birthday as I was being seated and then a third time by our Omakase chef. The food was incredible and the staff was so friendly. Important note: if you don't like group dining experiences, this is not for you. If you like sitting with and meeting new people with delicious food and attentive service, this experience is well worth the money. While it seems that some reviews comment that they didn't like the food, I am getting the impression that at last parts of the menu change, for example we had a mushroom and truffle soup whereas others mention a miso soup. The rice for the nigiri was warm and fresh, and wasabi was grated right in front of us before being added to our food. Will recommend to everyone I know!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZdFEzZEhZVXMxWmxGalJIRlJSRlJ4UTNKbFZuYxAB",
            "text": "Not worth it. The food is not good and the environment is so loud. I wish I have left in the middle of the course so I just wasted my money, not like now, time and money"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReVVFMXNRazF5TWtveVMwbFJUV2hVV1hsc1ZIYxAB",
            "text": "I visited for a midday meal and the food was fantastic. The dishes exceeded ordinary high quality. The team performed exceptionally once more. The spot is truly exceptional. There's zero question about returning."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRWNucE5ibEZKYlRCTWEzaDNWV0pJV1ROMExYYxAB",
            "text": "Amazing experience. Wonderful staff. Indescribable quality of food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdmF4Y24tbnVTeWV3EAE",
            "text": "I enjoy sushi but have never had the omakase experience , much less at this caliber. The experience is worth every penny. Nice selection of wines for those not versed in saki. Knowledgeable staff aside from the chef regarding selections and pairings. Chef Ito is definitely a chef for the ages as well as high marks for his commendable team."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMDVlN09BEAE",
            "text": "We dine at ITO to celebrate my birthday, it was a perfect dinner experience.\nThe chef was very attentive, explained every course and made sure we were satisfied.\nThe service is great and the food was delicious!\nEverything we tried was unforgettable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJblltM1RBEAE",
            "text": "Magnificent all around. Will surely get a star soon."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cGRlT2pBRRAB",
            "text": "From the moment I walked into ITO, I knew I was in for a special experience. The ambiance was warm and inviting, setting the perfect tone for an incredible meal. Every bite of sushi was expertly crafted, fresh, and absolutely delicious. The variety of sake options complemented the meal perfectly, making for a well-rounded dining experience.\n\nBeyond the food, the energy of the restaurant was vibrant yet intimate, and the service was outstanding—attentive, knowledgeable, and genuinely welcoming. This was my first time experiencing this style of sushi, and I must say, it exceeded all expectations. Highly recommend ITO for anyone looking for top-tier sushi, great vibes, and impeccable service. I will definitely be returning!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LU15dnBBRRAB",
            "text": "ITO definitely satisfied my craving for sushi. Every course was delicious. Great staff. I loved that it was a small restaurant with limited counter seating. The experience felt personalized to the group. Thank you to the staff and Chef for an amazing NYC dinner."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMzd5THJnRRAB",
            "text": "Si eres de gustos únicos, este es el lugar, la calidad de la comida y los sabores, son únicos, cada platillo es una experiencia única, las porciones son pequeñas, de verdad no necesitas más! El Costo, único como sus platillos, vale la pena!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnazhhOHdnRRAB",
            "text": "My favorite omakase in the city, amazing wine list especially for sushi restaurant. Fun hip-hop in the background, not sterile. The crab caviar hand rolls would likely be my last meal request. Chef Masa and Chef Kevin will entertain you throughout the dinner. Cannot wait to come back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBXzdpWXRnRRAB",
            "text": "ITO Omakase in Tribeca is the place to be. The chefs here know their craft, serving up insanely fresh sushi with precision and care.\n\nFrom melt-in-your-mouth Hokkaido uni to perfectly aged bluefin tuna, every bite is packed with flavor. The vibe is sleek yet cozy, and the service is on point—attentive but never overbearing. Whether you’re celebrating something special or just treating yourself, ITO won’t disappoint.\n\nBook a spot in advance—you won’t regret it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOWJQQndnRRAB",
            "text": "The taste is as fantastic as the price! A chef with a different kind of luxurious atmosphere. It was a waste to eat. The best omakase I had in New York. Recommended if you want to enjoy omakase in a reliable place rather than going to an awkward place and having a disappointing meal!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlZzhuSkVnEAE",
            "text": "Very good overall.\n4 appetizer in season fish, end with the signature uni bowl.\n1 soup - had the corn one it was very tasty.\n12 (+/-) nigiri\nTamago - very tasty and well made.\nPanna Cotta dessert.\nAmazing service!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MkltSEdnEAE",
            "text": "Masa and Kevin are all-stars! This is the best sushi in NYC hands down!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueXNLNUxREAE",
            "text": "This was the best omakase I have experienced. I paired the sake and it was perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaTdfOUNREAE",
            "text": "Go here for service and vibes. The food is not that good and definitely worth for the money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3Z3Q3RmtRRRAB",
            "text": "Great omakase. The ikura, cavier & uni bowl was definitely a highlight. All the pieces of nigiri were delicious and well balanced. Would definitely come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieUxxVU1REAE",
            "text": "One of the best Omakase bars on town! You needed to make reservations by resy, so friendly and team is great for a stunning experience, pairing is perfect with different sake options. A must if you like Japanese food and want traditional experience out of japan!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6c3Z5b2N3EAE",
            "text": "I really wanted to like ITO but it is unfortunately a letdown, especially given its high price. The seating is very cramped, the opening sashimi is thick and meaty and many of the dishes lack the exceptional flavors and textures found in many cheaper omakase restaurants in NYC. Some dishes did stand out tho, like the uni, ikura & caviar bowl and the corn pudding dessert. But these were exceptions. For a more satisfying and innovative omakase experience, there are better, more affordable options available in the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdTdIcUpREAE",
            "text": "Excellent experience, over expectations"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqLUxqemVREAE",
            "text": "The best omakase you will ever have hands down. I have taken several friends and clients to ITO. The experience and food is 11/10 every time and everyone I have taken is always beyond impressed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaHJISU9nEAE",
            "text": "Masa and Kevin are the best in nyc, the omakase is delightful and their pairings of sake hit the spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdElUbTdnRRAB",
            "text": "Came with very high expectations and left disappointed. (Final bill 1175 USD for 2.)\n\nReasons:\n1. The restaurant is extremely crowded, the man sitting next to me constantly make physical contact with me because of lack of room, and when ever the server serves you you have to bend or move sideways - no class.\n\n2. The food is extremely average. They charge 295 per person but according to my experience this meal is on par with a 99-175 dollar restaurant. Wine pairing is 165 dollars but only six tiny glasses and there is no “pairing”. They just serve six glasses and doesn’t explain why they are paired.\n\n3. They charge extra for the food that they ask “how are we doing? do you need any more sushi? In omakasi restaurants when the chef doesn’t tell me the price of an item and just asks me if he can serve it to me, I assume it is free. If after 400 dollars of main course, I’m still hungry, it is the omakase chef’s duty to provide extra food and feed me - I have never encountered a situation where they ask me if I want it, doesn’t tell me it will be extra, and charge 60 dollars for one hand roll. Even Per Se will let me know that! I don’t want to straight up say this is a SCAM, but I doubt the owner doesn’t know they should disclose the price before serving anything.\n\n4. There is no communication between chef and customers. It is a very loud restaurant, when the chef introduces the meals I can’t hear it.\n\nOverall, it has not been a pleasant experience. Food is over priced and average. Atmosphere is horrible, restaurant is loud and crowded. Wine pairing is over priced and not well designed, chef doesn’t tell you what they serve after main course is extra and doesn’t disclose the price until they show you the bill."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaLWRma1l3EAE",
            "text": "Went here to celebrate a wedding anniversary, and thought it was  great. The omakase had a strong lineup of appetizers and followed with some of the best nigiri I've ever had, and I've been to multiple Michelin rated sushi spots.\n\nHere are some of my cliff notes...\n1.) The food is amazing\n2.) The environment itself is a little loud and loose. I'm cool with that, but its not a traditional style.\n3.) The omakase, which I believe is their only option, is $300/pp. This is on the expensive side, plus a bottle sake starts at $200 - $250. Be prepared to spend money.\n4.) The service was very good. The sommelier and staff were very knowledgeable and gave good recommendations. Chefs were on point."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1cU1TOEJREAE",
            "text": "Impeccable and delectable from start to finish - definitely the most memorable omakase we have had in recent times. 100% will be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMWVmU0N3EAE",
            "text": "Chef Masa and Chef Kevin never disappoint! It's the best omakase in NYC if not all of NY"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURKNElzRxAB",
            "text": "Good omakase. I put 4 stars in food because there are no hikarimono like kohada and its shari preparation. But ikura was well prepared with right taste. Ha katsuo sashimi was excellent.\nAfter appetizers courses there are over 15 min wait time to start nigiri sushi. I think it is too long of wait in the middle of the omakase course. Hotate from iwate and Akamutsu were excellent.\nToro is farm raised one from Japan, but it is way too oily to my taste. Shari was ok, but something is missing in its rice textures/temperature once put inside mouth and its combined vinegar taste.\nWagyu roll with caviar is not edomae style at all, I skipped it completely (since I am pure edomae enthusiast).\nOverall I rate fair to good (if not outstanding) omakase experience considering $295.\nNot pure edomae style."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dl9TSG93RRAB",
            "text": "Incredible"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NTRxRThnRRAB",
            "text": "Feel sick after eating here. And it was the first time that I have to stop at the 7th course, because the food made me feel stomach-churning.\nNot sure if it’s because I am feeling sick myself but it’s the first time for a…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dHFxQW1nRRAB",
            "text": "The dining experience I have expected the most, and enjoyed the least.\nI have come to NYC with the main intention of exploring as many Omakases, Michelin guide spots & stars, and the type of indulgence a foodie can dream of.\n\nI heard about ITO, and felt an immediate appeal to pay a visit when I’m in NY. After timing the next reservation availability & rushing to their website at 12pm sharp, I managed to secure out spots. This would have been our most anticipated, and final meal of the trip. We were extremely excited for what we thought would be saving the best for last.\n\nWe arrived to the spot, and entered an extremely loud bar sitting space with pop music playing, and a full crowd of sited people who seemed to take advantage of the chef’s attention to have a 2 hour long conversation about fish, Japan and their favorite dishes. As a party of 2, it was extremely hard to carry a conversation without full on yelling at each other.\nAs the dishes started coming out, each one was less balanced than the previous one. From too little flavors, to complete stimulation overload, our taste buds were going through the motions, in the most underwhelming way possible. From too much rice, to too little rice, from too little soy sauce, to wasabi overkill - this was certainly the least balance meal I’ve ever had at a so called fine establishment.\n\nThe service was inconsistent. My friend is left handed, and while all the places we’ve been to so far have paid closed attention to perfect the service and presentation, our chef has noticed, but had seemed to forget after perfecting two nigiri’s to fit her left hand grip. While it’s not necessarily a problem, was rather underwhelming to know $100 omakases have paid more attention to details than a $300 meal.\n\nBy the time we reached the 9th course we were just hoping this would all end soon. We were counting back the minutes to come back to our hotel, lay off the nausea of the unbalanced flavors, and watch Netflix.\n\nI would say this was by far the most underwhelming dining experience during our 3 week stay in the US.\nReally wish we had invested our last night in a place where we could carry a conversation, enjoy every course, and not count getting the check and leaving as the highlight of the evening.\n\nOverall 3/10 experience. Food & experience weren't bad, but highly not reflecting of the price and reputation of ITO."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaGIzNkhBEAE",
            "text": "You expect a lot from a restaurant like this. It exceeded the expectation. The variety, the combination of different tastes, the quality and attention to details, made this a unique experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM2FEblRnEAE",
            "text": "Their Omakase was perfect. Very very fresh wide fish selection. Their uni was like butter. Their sake and wine selection has a lot of variety and a good range of prices. Service was top notch. Can’t wait to go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScmRxcXpRRRAB",
            "text": "Best meal of my life, hands down. Have eaten incredible sushi in Los Angeles SanFrancisco Hawaii and this is the best of the best. Incredible quality, ambiance and service is also 12/10. Indebted to our local friend who recommended this place while we were in NYC. Writing home about Chef Kevin and Ito."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNod3V1YlZ3EAE",
            "text": "Amazing quality. Overall excellent experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCc0pEWTd3RRAB",
            "text": "10/10 experience. Kevin and the team took the best care of us. Incredible flavor combinations, the freshest product and five-star service team who were happy to do whatever they could to make sure we had a great experience. Will be back as soon as possible."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtaDczSHNBRRAB",
            "text": "A truly exceptional dining experience with mouth watering fish for all of our party of six.  Thank you Chef Danny and Miso Massa!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdXV2U1dREAE",
            "text": "Delicious 🫶…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdXYybTFnRRAB",
            "text": "Delicious, great vibe, excellent playlist!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOXViV2FREAE",
            "text": "Great omakase experience. Chef was very fun to interact with. Would definitely try out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbWF5LVdnEAE",
            "text": "Killer! Not a single piece was eh! Nicely done 👍…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MTlEbWNREAE",
            "text": "I’m always sorry to give a business a low rating, but wow was this a tasteless, mushy disappointment. I try a different omakase every other week and this was the only truly bad experience I’ve had so far, after trying ~3 dozen places in NYC. It was $620 for two (before a $100 tip). I’ve had more expensive omakases that were worth the price, and also omakases half this cost that tasted incomparably better (albeit I’m comparing to something I pray never to repeat).\n\nThe fish was completely tasteless, mushy, and wet, like long-frozen and improperly defrosted fish. It was concerning. I literally took a Covid test after to check that it’s not my tastebuds that were at fault. The first few dishes were also so odd in execution. There was a bowl of salmon roe with rice underneath and uni on top, and there was just so, so much salmon roe that it totally overwhelmed any other possible taste in the bowl. If I wanted to taste only mouthfuls of salmon roe, I would just go to HMart and buy a tub. Then there was an oddly heavy, creamy miso soup, I guess to fill us up before the tasteless sushi courses. The tamagoyaki was also mediocre. No unagi, by the way. At least the dessert- a yuzu panna cotta- was good.\n\nAgain, sorry to write such a scathing review, but this was truly a shock. Completely inauthentic and unacceptable quality."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aDdxamdRRRAB",
            "text": "The best omakase in the city."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dlAyUFRREAE",
            "text": "I think they should make it clear they are not affiliated with Masa uptown or the chef. Very misleading in a city like New York . Also the food was very average and more like a Nobu tasting. You will be disappointed if you follow the sushi legends. The chefs are trying too hard IMO it doesn’t feel authentic. It just didn’t meet my expectations.\n\n*Also I felt very sick that evening and the next day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdTZUdFd3EAE",
            "text": "Starters and soup were overly salty and hid the quality of the fish. Rice was mushy. The ikura, uni, caviar dish was good, but the ikura overwhelmed the caviar. Great service, glassware, and tableware  though. Overall, fairly poor quality Omakase for its price point."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeXAzNDhRRRAB",
            "text": "From start to finish, everything is so fresh and well presented, can't go wrong^^"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMHR2NGNREAE",
            "text": "Absolutely amazing will be coming back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPa29uY0ZREAE",
            "text": "Definitely the best meal I've ever eaten. Highly recommend for any sushi lover. The food Chef Masa prepares is literally a work of art."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXX3YzN013EAE",
            "text": "정성스러운 쉐프들의 손길에서 엄청난 부드러움과\n음식이 아닌 우수한작품같고\n일본의 제대로된 오마카세의 맛입니다 아마일본에서 이렇게 식사하려면 도도한장인으로부터엄청난금액을 지불해야할듯합니다\n즐거운식사였습니다"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPa3RxTUNREAE",
            "text": "Had an amazing experience last night. Firstly, they treat every guest like a VIP, service was 10/10. ITO is extremely clean, staff was constantly cleaning throughout dinner service which I thought was a nice touch. Our glasses were never empty and the food came out at the perfect pace.\n\nThere are many words I can use to describe the food, but I’ll simply say it was fantastic. Masa was extremely knowledgeable with every dish and the flavors were out of this world. I experienced flavors I never knew existed. My tastebuds were dancing all night!!\n\nLastly I want to add that the atmosphere of the entire experience was unlike any other fine dining experience I ever had. Will definitely be coming back!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXM1BLQ3J3RRAB",
            "text": "Incredible experience, some of the best sushi I’ve ever experienced.  So fresh, brilliant flavors, great cocktails and wine - last but certainly not least, the chefs (ours was Robby) were beyond talented and the preparation and service was…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXZ2UzX1h3EAE",
            "text": "Hands down. The Best staff. The most amazing sushi I have ever had in my entire life. No matter how many times I watch chef Masa create these dishes I always stare in awe, and then my taste buds are in awe. Thank you for everything guys! Absolutely amazing!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtakxuX1hBEAE",
            "text": "Probably the best Omekase experience I've had in NYC. The pieces of fish are large and delicious.  I walked out of there feeling full which I almost never do leaving an Omekase tasting.  The dishes are well thought out and elegant.  Cant wait to go back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtenMzSmR3EAE",
            "text": "For those who know type of location. Chef's are top notch, beautiful decor and food is absolutely delicious. Coming here again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbjRELW53RRAB",
            "text": "Excellent spot for both great sushi and atmosphere. New, but well worth the experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXaXVTcHRBRRAB",
            "text": "Incredible omakase experience, amazing cocktails, with an awesome playlist."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNEtIS2t3RRAB",
            "text": "32 weeks pregnant with gestational diabetes. Completely worth it!"
        }
    ],
    "reviews_count": 59
}