{
    "name": "Trinity Place",
    "place_id": "ChIJ4_AAQhdawokRzbYlVLyzKlk",
    "grid": "MN1",
    "address": "115 Broadway, New York, NY 10006, USA",
    "rating": 4.4,
    "user_ratings_total": 1518,
    "phone_number": "(929) 581-8961",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNGRVZHRTbWhvTTFGMVJWQXhTbTVQT0U5TlNGRRAB",
            "text": "The cocktails were strong, but the food was mid, at best. The atmosphere is kind of kitschy, half sporty bar feel and have higher end dining room."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMVVHOUtTWEkwY25OS01ESXplbVkzWTFCR2JuYxAB",
            "text": "This place looks very cool and photographs well, but both times I’ve come the food has been disappointingly mid. It tastes good but seems low quality and not very well cooked, like it has all been heavily refrigerated and then reheated. It’s not bad, it’s just…fine. Plenty of better options out there."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TVMwVnFWV3hTT1ZCQmJHMU1Nak5WUzJONFgwRRAB",
            "text": "BEWARE OF THE RESTAURANT Trinity Place “THE VAULT BAR” in New York City\n\nOn the evening of October 16, 2025, my boyfriend and I (both African American) visited this restaurant, and unfortunately, we had a very disappointing experience.\nFrom the moment we arrived, it was apparent that we were not treated with the same level of attention or respect as other guests.\nSeveral tables around us—primarily Caucasian patrons—were greeted promptly, served quickly, and checked on regularly. In contrast, we waited an unreasonably long time just to have our order taken.\nWhen our food finally arrived, it was not hot. At no point during our meal did anyone check in with us, and we felt ignored for the entirety of our visit.\nThe contrast in service was too obvious to dismiss, and it left us feeling unwelcome and disrespected. Dining out should never make anyone feel as though their presence is an inconvenience.\nNo guest should experience unequal treatment—especially in a space meant to be welcoming and inclusive.\nWe truly hope management takes this feedback seriously and takes steps to ensure that all guests are treated with equal dignity, respect, and care—regardless of race."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNd2RfRjhnRRAB",
            "text": "Atmosphere was inviting, lively and elegant - my friends and I enjoyed our night out.  The burger was delicious!\nOur waiter recommended the sticky toffee pudding for dessert, LOVED it.  Thanks for his good taste!  Service was great - Thanks!"
        },
        {
            "date": "3주 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnelkya3hWV2h3UVc5TVpWWjJkSEZhVWpKaVVWRRAB",
            "text": "30.Mai 2025\nWir wussten von dieser verrückten Tresortür und wollten sie unbedingt sehen!\nWir wohnten im World Center Hotel und waren auf dem Rückweg dorthin. Da fiel uns Trinity Place ins Auge!\nSpontan gingen wir hinein und wurden dort von einer charmanten jungen Dame empfangen. Sie betreut den Empfang und die Tischreservierungen. Wir erklärten, daß wie keine Reservierung hätten und auch nicht essen wollten, doch je länger wir mit ihr sprachen, umso mehr bemerkten wir die außergewöhnliche Atmosphäre und das stilvoll gemütliche Ambiente!\nHier kann man verweilen! Die junge Dame wollte gleich, daß wir ein Tisch für später buchen und machte es uns richtig schwer, sie zu verlassen! Wie versprachen wieder zu kommen, doch leider war unser Aufenthalt zu kurz - wir haben unser Versprechen gebrochen!...\nWie gerne wären dort doch noch eingekehrt! Machen Sie nicht unseren Fehler und essen an einem der coolsten Orte von Downtown Manhattan!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTmVtVk1TMGxwUWpNME9WcERPV1IxVjB4TFdVRRAB",
            "text": "Loved our meal, the toffee pudding was so unique, the filet was delicious, they have awesome cocktails to try and Karen was the sweetest server."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUlpIaEdUMjl2V0V4Q1l6RlZjbHB4YTJKNlJrRRAB",
            "text": "Typical downtown joint"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SE4ySlpkR2xxY1hWMU16SnhRbTlITFdaTE5XYxAB",
            "text": "Wonderful service from Hakim, lovely Manhattan cocktail, delicious Onion Tart, finished with a yummy Sticky Toffee Pudding! Going back to the UK very happy, thank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQmFrUTNjMnhoV2pKU2VrOWZjVmxxVUc5c2NuYxAB",
            "text": "Had a cucumber cosmo during Happy Hour (Ok I had two!) and they were great. Place is a little “finance bro” heavy and it was PACKED at 5PM - but boy was it a cool spot for a drink inside a vault. Highly recommend the drinks!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTmExSTVSV3hDZVdVMVkyYzJSRlJ2ZWtsRU0xRRAB",
            "text": "This was an overall low spot on our tour of restaurants in NYC. We went in for appetizers and drinks. We ordered cocktails from the menu, which were very good, however the dishes we ordered were lackluster at best. We got the charcuterie board, which had a decent quantity of options on it, but each option was disappointing. I make better paté at home, the summer sausage was wanting for seasoning, and we have purchased better prosciutto at a grocery store. The pickeled options and mustard on the board were good, but not good enough to make up for the lackluster meat. Our second order was the duo of tartare, which again had good enough accompaniments but the protein left you wanting for flavor. The seaweed salad was quite good, the cucumber salad was so lightly dressed it made me question if it was dressed at all, and the duo of tartare were disappointing. In my experience, a tartare has some seasoning, even a fish based one as served here. This appeared to be minced fish that got a kiss of oil and was stuffed into a ring mold. Dining in a bank vault was cool, but we spent far less for much better food elsewhere in the city."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GclZ6VmljMnB5ZVdkMlUycGhOUzFXVGtKSVRXYxAB",
            "text": "Cool atmosphere with the original bank vault. But food was meh and service a little too hands off. Also note it’s very loud at times."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRmRUSmxlRU53Y0d0MmRtWjBSazQzVlV0NFVVRRAB",
            "text": "Awesome eclectic atmosphere. Drinks and appetizers were well made. Entrees were hit or miss."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VM01qbGxZVFJ1V0ZRelYzSktTVFZzVDFvdGJrRRAB",
            "text": "The trinity burger was tasteless… the salad had maybe one drop olive oil on it… no salt or pepper available… the location looks very cool but it is so loud we had no chance to understand each other… overall very disappointing… and for that they want 20% tip… nerver again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SS1JIaG1WR0UxV2tsaWMxcHVWbTB0VXpCblMzYxAB",
            "text": "Cool spot with cool story! Bar is cool. Great service but the group food was just okay"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYU1HVjVVMjUzYjI1TWFFTnBTMVprTjBGcFZWRRAB",
            "text": "Really can’t beat this place for downtown decor and a smidge of novelty. The vault door is truly impressive and our service was top notch. We had espresso martinis and some sliders at happy hour with evening light streaming in thru the high windows before a concert at Pier 17, would do it again!"
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKb05HZDZjREkzTmt4NVRFTnZSa0ZNVlVwc2NGRRAB",
            "text": "Pour le dernier repas à New-York.\nCet endroit est vraiment agréable. A deux pas du WTC et de Wall Street.\nUne ambiance feutrée, avec une musique pour accompagner mais qui permet de discuter.\nApéritif : de jolies propositions mais j'ai préféré un Manhattan (buffalo trace)\nRepas : house turkey burger.\nService vraiment irréprochable, souriant et disponible.\nUn endroit où l'on se sent bien.\nJe recommande."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQlQwdFZTbmw1ZERKaVJscGFjaTFJZFRSQ1RtYxAB",
            "text": "Surprisingly good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTmVITlRlRmRYYkdKQlNWVnBhRUZOVFV4VFkxRRAB",
            "text": "It was an improvised lunch in the financial district...and we couldn't have done a better choice!\n\nFood was very good, amazing environment, convenient price...and Carlos Alcaraz won the match that day and we saw it there on the TV, as we had Lunch!!!\n\nWe will return here the next time we come back to NY."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VFoybHpWSGRSZG1vNFZIQlVhMUZGZUdkbmJYYxAB",
            "text": "The food and service were great. The place has so much history. ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMGNVNTVWRTAzUjFWdWJYTkZabkpzUnpCRlNIYxAB",
            "text": "Service was great, food was good/acceptable, cocktails were good. I had a fine time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTlIzTmZRazlUWmpCdWFWWnlZV056Vkd3MlVuYxAB",
            "text": "Absolutely amazing experience. I wasn’t expecting much but the food was delicious  and so was my server - Adam Hakim !!! Which is why I am posting this review. I ordered a Veg Barley Soup and it was the best I have ever had at a restaurant! Hands down. The Pan seared Scallops were soooo delicious too with fried leeks on top - and so flavorful and fresh. The Madame Lavender N/A drink was good too - and thanks to my server- customized as a Martini!!\nThe front room attendant was not great, forgot to inform the server about me so I had to wait for 15 mins before anyone came to serve. However when my server arrived- he Made sure I got everything fast! and excellent service. — Thank you Adam Hakim!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdGNHUmhZWE5xVDB3d1puVXdRMnB2T0VOSlJYYxAB",
            "text": "Love the vibe and the decor. The food was good but could be better. I had the burger.\nThe cheesecake dresser was so not worth it. Service was ok but our waiter changed shifted during our meal and no one told us. Just had someone else show up."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNWVYWTFPVFEwZEVGR1JrOHhaMkZzU1dKbFZGRRAB",
            "text": "We were there for dinner. We ordered salad, salmon, pork chop, noodles and a bottle of wine, Cabernet Sauvignon. Everything, food and wine, is delicious and perfect. The only drawback is the service, but I’d still recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WT1ZuWmZVRmhST1dkUVZGaHBkV2xGUzNSUmFIYxAB",
            "text": "Great place for a business dinner and drinks. Loved the bank vault ambience. Timeless classic spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRFZXMU9iVFZxVmtaSVNGVnpiV1JmTW5jdFIzYxAB",
            "text": "A little but efficient after work spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdU1VaElTVkYzUm1kcVkydGlla1o1YW5ZeGVrRRAB",
            "text": "The atmosphere was amazing. Second to the food and the service. I highly recommend Trinity place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGS2JqWnpRa053ZVRkUmVXeFJjbHAzTm1nNGJWRRAB",
            "text": "Came here for business dinner. The food and service was great but the ac was weak would definitely return"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJUFE2Ny01aHZHMmJ3EAE",
            "text": "Very unique place. Had a great evening, food was delicious...."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJYTlrUFdjMzQ3a2RREAE",
            "text": "Cool little bar to enjoy some lunch or a break from work. Built in an old bank vault , nice place to meet a friend for a quick one"
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNeTJ4dmpQd09XQklnEAE",
            "text": "Nice place for tête a tote."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdmJnSXYzeWRlVFp3EAE",
            "text": "Had a great experience with friends here. Service was prompt, food was good, drinks are basic but classic. The vibe was nice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQX3dnNV9rN3ZtS3pRRRAB",
            "text": "Fabulous food! Cosy, comfortable bar and restaurant :-)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPSEszWVBfaTdicS13RRAB",
            "text": "This review is just a bit long overdue. March 21st, 2013, was the first and only time I visited this establishment before moving out of NYC. Today, my son and I worked on a salmon recipe a little out of the ordinary, and I was recounting to him and my wife that the last time I tried salmon this outside the box was at this restaurant. It was an unexpectedly pleasant surprise, and I always remember this salmon dish because it was like nothing I had ever tasted before, nor since. The ambiance of the restaurant was unique and cool from what I recall, and next time I’m in Manhattan, I hope to try it again. Regarding the timeliness of the review, I guess better late than never."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQTERuT193NGRUNEN3EAE",
            "text": "Good place for a drink"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQNzEwYkMtdW9yQTZRRRAB",
            "text": "Big restaurant. Very noisy and loud.  The service was great but the food was ok. I ordered the cheese and charcuterie board which was great to share. Trinity JC salad, it was terrible.  Tasted like dirt.  It sounded so fresh and amazing with all the ingredients but it was terrible.  They brought me a Cesar salad and that was really good.  Main course was the pan roasted pork chop.  Very very good.  Highly recommend.  Service was great.  I didn't say anything about the salad and the waitress noticed i was not eating it so she addressed it and easily swapped it out.  Very very nice!! We were there for a work meeting so the room was EXTREMELY loud and not conducive to that.  But the atmosphere was really cool.  Probably a fun place to go with friends or for drinks at the bar.  Not so much work meetings."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLUHAwUFNqemZMWUlBEAE",
            "text": "Amazing server Ashly"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa3UycHVnRRAB",
            "text": "I’m really happy with my experience at Trinity Place! The staff was very attentive and knowledgeable about gluten-free options. They even have a separate gluten-free menu with a great variety of starters and main dishes. I had the tuna tartare and the salmon — both were absolutely delicious! They come with gluten-free bread, but can also be served with regular bread on the side for those who don’t need to eat gluten-free. For the main course, I had the duck risotto, which was spectacular. They also offer gluten-free drinks like beer. Everything was incredibly tasty, and best of all, my stomach felt great afterwards!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMFpuMWN3EAE",
            "text": "Amazing place. Great menu, I think I could’ve ordered anything and been happy. Atmosphere was super relaxed. Bathroom was super clean. No notes!"
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvd3RicVJREAE",
            "text": "Danke Adam und ans Team! Wir haben den Abend sehr genossen. Mega gutes Tartar und leckeres Fleisch! Vielen Dank, wir kommen gern wieder! Verrückt war, das genau an unserem Tisch ein Bild hing, was auch bei meiner Mutter überm Esstisch hängt… sehr verrückt. Mega gutes Ambiente und leckere IPAs."
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMWJmN2RnEAE",
            "text": "Schönes und grosses Lokal. Empfang und Bedienung sehr nett. Wir hatten Bruschetta mit Riccotta. 3 Scheiben Brot mit reichlich Auflage und schön serviert. Danach ein Wagyu Burger mit Potatos und Rucola Salat. Der Burger war allerdings für unseren Geschmack zu fad und zu trocken. Brot, Fleisch, Cheddar. Keine Sauce dazwischen. Schade, denn so stell ich mir ein US-Burger nicht vor...\nPreise sind ok."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcWFqTVZnEAE",
            "text": "We went with 2 friends to enjoy Happy Hour at this place that is incredible for its history and preservation, the drink and food options for Happy Hour are very limited, the woman at the bar was very rude, not friendly at all, we ordered 2 cocktails and told her that later we would have beer to accompany the mini hamburgers and nachos with guacamole, this bartender served all the drinks together and uncorked all the beers, when we asked why she had uncorked them she was very rude responding that she didn't care if we hadn't finished and that it was a rule of the place, we had to cover the mouths of the bottles with a napkin so they wouldn't lose flavor, the male waiters and the other bartender were very friendly, I congratulate you guys for your excellent service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbjVMbUtREAE",
            "text": "Good vibe, great service, pork chop was amazing, steak could be in one piece instead of sliced into two."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNlA3OHVBRRAB",
            "text": "This is an old bank vault converted to a restaurant. The risotto was great. The duck was slightly over cooked, but still good. If you are in the financial district this is a great place to stop for a drink. The bar and drink prices were reasonable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MS1QMnFnRRAB",
            "text": "Great old school New York City bar.  We went off peak so it was not crowded. Nice craft beer selection and delicious small plates."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Z09PTDdnRRAB",
            "text": "Unique space, good food and courteous, fast lunch service - but it is pricey!"
        },
        {
            "date": "7달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNkp6dVdREAE",
            "text": "Absolut cooles Restaurant und Bar! Waren an unseren ersten Abend in New York zum Geburtstag meines Freundes hier essen & es war wirklich toll! Das Essen war extrem lecker und der Service total freundlich!!!\nDas Ambiente ist wirklich cool und es gibt zwei Räume: Bar-Bereich und Dinner.\nFür so ein schönes Lokal ist der Preis total ok v.a. für New Yorker Verhältnisse.\nWir würden jederzeit wiederkommen!!!"
        },
        {
            "date": "9달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcHJlakJnEAE",
            "text": "월가의 증권맨들이 바에서 열띤 토론을 하는 것을 볼 수 있습니다! 은행 금고를 개조하여 사용해서 독특한 인테리어이고 음식도 맛있습니다. 뉴욕에서의 마지막 날을 장식하기에 좋은 선택이었습니다."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbk95QWpRRRAB",
            "text": "우연찮게 찾은 맛집이었으나, 종업원이 정말 친절하고, 음식 맛도 좋았음. 어린이 메뉴도 있으니 가족 단위 방문도 추천함"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1aUlDQ3ZBRRAB",
            "text": "Pan salmon추천! Red diamond pinor noir와 페어링 좋습니다 혼자갔는데도 편안한자리 주고 직원분들 친절합니다 월드트레이드센터 보고 식사장소로 강추"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwdzg2UjJnRRAB",
            "text": "커피값이 한국보다 저렴"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdUlTWlhnEAE",
            "text": "We dined at Trinity Place, and it was an exceptional experience from start to finish. The highlight was the Bank vault door that was truly UNIQUE place to dine. The ambience was perfect—elegantly designed with a warm, inviting atmosphere that made us feel immediately at ease. The food was nothing short of outstanding; each dish was beautifully presented and bursting with flavor, showcasing the chef's talent and attention to detail. Service was top-notch as well; the staff was attentive, knowledgeable, and genuinely friendly, enhancing the overall dining experience. I highly recommend Trinity Place for anyone looking for a memorable meal in a fantastic setting.\n\nThe desserts were truly exceptional. Each treat was a masterpiece, both in flavor and presentation. These desserts were a perfect ending to an already fantastic meal, showcasing the chef’s creativity and skill."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdHR5Qmd3RRAB",
            "text": "Came here spontaneously for dinner, the night before our flight home to UK.\nSeated quickly, despite no reservation. Team were friendly.\nFood was delicious, we especially liked the scallops & steak fillet.\nPleased to find a brulee on the dessert menu.\nAtmosphere was lovely, busy initially but not overcrowded. Felt very cosy, interesting surroundings being in an old vault.\nLovely find, wish we'd found it sooner! Would absolutely recommend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNUpfb1JREAE",
            "text": "My employer rented out the bar and restaurant for our annual holiday party, and it did not disappoint.  First, the entrance is right across from Zucotti Park, which was lit most beautifully for the holidays.  The entrance can be. Bit ticky to find but is about mid way down on Cedar by the park.   The decor is definitely unusual, with large bank vault doors, a lot of dark woodwork, gleaming fixtures, and low lighting.  We have a fixed menu that was spectacular.  Unfortunately I don't know if the menu was comprised of fare that they normally serve or not but if our options were comparable to other offerings on the normal menu, then you'll definitely have a.spectacular meal waiting for you.  Also, given that my employer was paying, I have no idea of the overall costs, but given the quality of the food, bar, and service, I would think that the prices would reflect that."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQa29qaFNBEAE",
            "text": "Great FiDi location with excellent food, friendly staff and terrific atmosphere. Highly recommend this restaurant. It can be hard to find reasonably priced fine dining in Manhattan. Trinity Place achieves an elevated dining experience without breaking the bank (pun intended)!\n\nWe ordered the onion tart, filet medallions and Wagyu cheeseburger. Everything was delicious and prepared as ordered."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiLV9XRnV3RRAB",
            "text": "Came here for dinner on a Thursday night before flying back home the next morning. Nice restaurant and atmosphere. It was a bit busy but we were seated right away. However, we sat next to a larger party which made it a rather noisy experience. Good and drinks however were delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoekphWjVRRRAB",
            "text": "The overall vibe of the restaurant is nice, with the vault door from when this building was a bank serving as the entrance to the dining area. There's a nice assortment of cocktails with solid food and good dessert. The menu is small but varied, which is a good sign that everything is fresh. The menu also covers multiple dietary options like gluten-free and vegetarian.  I hope to come back soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqenZyeUxREAE",
            "text": "This place is a hidden gem! Aside from its historical charm(used to be a vault for a bank), food was excellent. I got ahi tuna noodles and my coworker got a burger. Both excellent! Everyone is friendly at this place and the service is great. I plan to come back regularly!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMODlQdnBnRRAB",
            "text": "I had a great meal. The duck was good, although it was a very small leg.\nGreat chocolate dessert and ice cream.\nAppetizers were good also.\nI would definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqd2FmcGpnRRAB",
            "text": "Wonderful service from when you walk in. We sat all the way in the back dining room. It was nice lighting and felt like a private atmosphere. The bar area was a bit more lively. We were there at 5:30 pm on a Friday. The food was delicious!! We will definitely go back here."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncWZUdjB3RRAB",
            "text": "My partner took me for Valentine’s Day. The location is beautiful but small. We got seated in a tiny nook with a couple on each side of us, and both were close enough that getting in I knocked into their table a bit. The service from the waiters was wonderful, we were greeted and they offered to take our coats and check them in. The artwork is beautiful. The food was mid. I got the waygu burger with home fries and a salad. The salad was bitter, the burger was tasteless, and the home fries were not crunchy. My partner got the beer braised lamb shank which is the second most expensive item on the menu. It was delicious. They served it with mashed potatoes carrots and sautéed brussles, I ate off his plate the whole night. My partner can’t eat pork and they took out the bacon which was very accommodating. We then opted for a New York cheese cake because I was worried at this point I wouldn’t like the other stuff they served. The cheesecake was also mid. For some reason I got what texturally felt like coconut flakes in it, which i absolutely hate. Lastly we got alcoholic beverages, they give u a menu but you can request cocktails not on the menu, I got a dark and stormy and it was also delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqZ2NXd2F3EAE",
            "text": "Great food and drinks. Atmosphere is awesome since it’s styled as an old bank. Service wasn’t bad but wasn’t fast, was also lunch so understandable. Definitely recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYalltbFZnEAE",
            "text": "Atmosphere is totally worth it! You have to walk into an actual bank vault. Food was good and prices were fair. We were there for an after work thing and the service was excellent. I'd come back anytime."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuc196dk5REAE",
            "text": "Great place for a quick bite just one street away from the 911 monument. Variety of freshly cooked meats - shish kebabs,charcoal tasty freshly cooked  corn\nPrices from $3.\nHighly recvomended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNE5lU3NBRRAB",
            "text": "The concept behind the restaurant is very very cool, and walking through the bar area into the back room you really do feel like you’re about to get locked into a vault. There were tons of small details to give the restaurant an original bank feel, including a giant class that had shredded money in it. The ambiance was great, the food was just fine. We ordered the tuna and salmon tartar and hummus to start. Neither were anything original or out of this world. For dinner we got the wagyu burger and the duck risotto. The burger was a regular burger, and we have another place downtown that had a better quality, lower price so I wouldn’t recommend. The duck was quite nice, and the risotto had plenty of mushrooms in it, but the duck portion was a bit small compared to the risotto.\n\nall in all the dinner was fine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdEtteHZBRRAB",
            "text": "The food here is absolutely delicious! We were served pretty quickly despite the busy hours. There aren’t way too many options, BUT the options they have are simply amazing. The menu can get pricey per person ($30-$50 depending on whether you buy an appetizer or not). I loved it and will definitely come back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlb0tUQmdRRRAB",
            "text": "This place was so cool and I will be back every time I'm in town. The music was good, the atmosphere was laid back, the drinks were amazing, the staff are courteous, the food is great. The bank vault aspect is just as cool as the pictures depict, I love how it's sort of sunk underground a bit so it's this unassuming place you can't see from outside, it was such a low-key great place to hang out. I only got lunch (but it was an amazing burger) but I'll be back to try dinner and more cocktails, and that famous steak tartare!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ3BmaXhRRRAB",
            "text": "Can't say enough about the entire experience. Our server didn't rush us. We had a quiet table in the dining room close to the entrance to the bar.  As the room began to fill with 3 large parties, our server offered to relocate us to the bar because of the increased noise.  Amazing meal: ahi tuna soba noodle salad and Duo of Tartar. Wonderful wine selection. Finished with a cocktail in the bar. We will return."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOUpXNFBnEAE",
            "text": "Mas que por la ambientación, el restaurante es bueno por la comida. No pedimos la hamburguesa pero se nota que es espectacular. Las porciones son grandes y la comida es de calidad, no tan caro para la zona donde esta. La ambientación es muy linda tambien. La “onion tart” es increíble."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOVkyUVZnEAE",
            "text": "I can highly recommend this place if you want to have dinner in a special location! The food is also really good. The menu is not that big but perfectly fine. Also the dishes are not super big but the taste is outstanding!\nThe service was perfect! I would recommend a reservation if you want to go there with a bigger group"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEd2FuYTRBRRAB",
            "text": "good food, good vibes, okay drinks.\n\ncame here with someone who’s a regular here and he said the turkey burger > regular burger. turkey burger was pretty darn good (and not heavy at all)\n\nthe cocktails were ok; i wouldn’t come back for them but not mad i tried them. the wall st sour (basically a whiskey sour) was decent, the rum drink (harvest something?) was weird, new amsterdam was also weird, and the spritz was ok"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCZ1BYX3lBRRAB",
            "text": "Randomly came across this place and was so happy we did.  The espresso martinis were fantastic, our server Brian was awesome, order the tuna tostada, the duck confit risotto, and sage ravioli. You will not be disappointed. Plenty of seating at the bar or a more quiet dining experience in the back. I'll be back."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNU9lWVdREAE",
            "text": "Très bon saumon noirci, ainsi que le hamburger, le duo de tartare et le cheesecake. Nous retenons surtout le cadre sympa autour de la thématique des finance dans le quartier financier."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkenVTUHVBRRAB",
            "text": "Muy buen restaurante (aunque con pinta de pub) todo de madera y comida muy muy buena. La atención fue excepcional y nos sentimos muy a gusto porque no había mucha gente y estuvimos muy tranquilos en pleno Wall Street. Muy original la entrada con la entrada a la cámara acorazada.\nComimos lobster roll, tartar de atún y de salmón y risotto de confit de pato, todo buenísimo, pero el risotto estaba espectacular!\nMuy recomendable para comer por la zona."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPM3BHOEdBEAE",
            "text": "This is an amazing piece of history that has been beautifully repurposed. In a former life, this was a huge bank vault! Everything was first rate. The staff was very professional and attentive. All the food we had was exquisite and…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZc2Eya1JREAE",
            "text": "Hidden Jewell! Stomach paradise! We had tuna and salmon appetizer, oysters (which were not my greatest), cod stew and Kobe burger. Delicious! Service and ambiance were great. Sticky pudding was not what I expected it to look and taste like. So glad my son ordered it! Must visit again!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaDREdkxREAE",
            "text": "This was our first visit to Trinity and we really enjoyed ourselves! Beautiful venue and very friendly staff. Drinks were well made and food was spectacular. The lady lavender drink was strong but not overpowering, hubby got a scotch that he liked but sadly after the first 2 options were out and the waiter had to go back and forth to check. Was a little surprised the digital menu wasn't updated but we didn't let it bother our night it just delayed the celebration toast! Ahi tuna tacos from the bar-menu were a great app, fresh and tasty! Shepherds pie was served in its own cute ceramic baking dish atop a wooden board with the sald (perfectly dressed with a vinaigrette, shaved carrots and cherry tomatoes) Hubby got the filet with peppercorn sauce and charred broccoli, I was lucky I got in a bit before it was gone!\nWe enjoyed the music and mood lighting, very cool to walk through the vault doors and learn all about the building and history of that part of the city. Thank you to the staff for being so friendly and accommodating with a late reservation."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoZ3FMd0FREAE",
            "text": "Absolutely delicious and very unique! A group of us came here for a terrific lunch during the work week. The restaurant is inside an old vault with these beautiful old doors, and is decorated with a lot of vintage, money related things.\n\nThe food was all delicious! It took a while to come out, which was surprising because there weren't many people in the restaurant during lunch, but it was definitely worth the wait. I had the duck leg risotto which was the perfect blend of savory flavors and contrasting textures. The risotto is creamy and smooth but the duck leg was roasted so the skin was amazingly crispy. The portions were generous as well.\n\nAfterwards we got the toffee pudding which was also fantastic, warm and not too sweet. Overall we had a great time here, and would definitely recommend it for lunch!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdzZtQm53RRAB",
            "text": "5 stars for atmosphere, quality of food, portion sizes, drinks, happy hour and customer service! I had a great experience here last night. I was helped by multiple employees and each one was just as kind and hospitable as the other so I cannot name anyone specific. Wagyu burger and happy hour menu were all delicious and extremely affordable for that area in Manhattan. Oh and most importantly, they have extensive GLUTEN FREE options!!! Burgers, warm bread - you name it! Highly recommend and I definitely plan on returning!!"
        }
    ],
    "reviews_count": 78
}