{
    "name": "1803 NYC",
    "place_id": "ChIJ0yKXaB9awokR6WFqdEE9aBY",
    "grid": "MN1",
    "address": "82 Reade St, New York, NY 10007, USA",
    "rating": 4.5,
    "user_ratings_total": 1988,
    "phone_number": "(212) 267-3000",
    "reviews": [
        {
            "date": "3시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNVNYZFZNa3BhWDAxclNUVlFORGxaUlhKS1gxRRAB",
            "text": "Enjoyed the food, service and vibe."
        },
        {
            "date": "1일 전",
            "language": "fr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SblVEZzJWM2RNY1ZVNVIzaGlTakZDYjIxRU0xRRAB",
            "text": "Je vous recommande cet endroit"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKM0xXcEhkMWQxT1RGaVREWndXSEZVZGtWMGVtYxAB",
            "text": "1803 blew me away — everything from the atmosphere to the food to the service was spot-on. The vibe is warm, lively, and full of New Orleans energy, but still feels cozy and welcoming. Every dish was flavorful and perfectly cooked. The pasta, steak, and nachos is a must-try. The cocktails were creative and balanced, and the staff made the whole experience feel personal and fun.\nWhether you’re coming for dinner, brunch, or just drinks, 1803 hits the perfect balance of great food, great music, and genuine hospitality. Can’t wait to go back!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WWQyZDROMmRrZG5CVk4yTkVZV2RoVGtkUU0xRRAB",
            "text": "Over hyped and over priced and they dont do the jazz brunch anymore which is the whole reason why I wanted to go. I paid for a large order of gumbo ($25) and there were only 2 shrimp in it. The charbroiled oysters had good flavor but they were over cooked and dried up. The vibe was very very tribeca / finance, not giving the jazzy nola vibe i saw others post online."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwemFVeFpVVlJqZFY5dE1qbFlkbUkwZUVOaFdVRRAB",
            "text": "Prompt service. Relaxed ambience. The seafood dishes were all made to perfection."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210T09UQTViR2RGY1ZwcGFrZHNVV3RMVjNveWMwRRAB",
            "text": "This place makes food that tastes like it's made with care. This place has earned my genuine affection. I'm telling everyone about this place! The team shows remarkable attention! The place stands out from competitors!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORVVsbzBjRzgyUzB0UmRtUjFaM1JHYW5WNFZHYxAB",
            "text": "This Cajun restaurant has a ton of flavors. I'm from the Caribbean so I love to eat at restaurants from my roots. Tasty food tasty selections"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oclVqVmtRVEp1ZFhreGNqTmZYMHN4YmxZNVdHYxAB",
            "text": "My next visit is just a matter of when, not if. The taste quality here is outstanding. The dishes showed flavor mastery! This illustrates how staff should treat guests. This place exceeded expectations - I'm planning to return."
        },
        {
            "date": "6일 전",
            "language": "nl",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kS2FsOXdhRjluYVRoTU0zYzVZVTR6WXpkSGJIYxAB",
            "text": "Eten was goed.\n\nWe hadden het gevoel dat ze een strak schema hadden en dat we dus snel buiten moeten. De bediening was dus niet zo goed.\n\nAchteraf zagen we dat er standaard 20% was bijgerekend op de rekening. We vroegen hierachter en we kregen een heel slechte reactie. We stelden het eigenlijk gewoon in vraag maar dit mocht blijkbaar niet. We hebben zeker geen probleem hogere tippen te geven indien verdiend. We hebben de tip betaald maar achteraf zaten we met een raar gevoel."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNGJGZHRMV3RYVlUxdk5HcFNYM1pqWDNCMGVVRRAB",
            "text": "Amazing place with wonderful people! Special thanks to the gentleman at the reception — his kindness truly made my day."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oYU4yOU5Rbk51YmxNemJsbGtMVGxRV1VSWFVsRRAB",
            "text": "Just like grandma’s rice 😋…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5alIyOUlkRVV4TjJVM05GVndMVmt5VmxSWGFVRRAB",
            "text": "Love you nyc"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0a1UweHdUV1JRTms5c1ptMVZaRlY1Y3psSE4yYxAB",
            "text": "Thanks to a very mild Nor’easter, my trip to NOLA was grounded two weeks ago. I craved the essence of New Orleans and so I went on a search for a bit of New Orleans in the city. I came across File gumbo bar and 1803 on Instagram and the two restaurants are within walking distance of each other. Naturally, I made reservations for both as I absolutely have to try both restaurants.  We visited File Gumbo Bar first for brunch. We had an amazing time. The food, atmosphere, and service were  all what we expected of a restaurant with such great reviews.  After brunch, we walked over to 1803 for drinks, appetizers, and good conversation while we played catch up in the city.  The restaurant exterior seemed promising, tall elegant windows and an inviting ambiance. On the inside however, the vibe was just completely off as soon as we walked in. The establishment is very small. The tables are cramped next to each other and the chairs reminded me of my seat in my kindergarten class. Very small and uncomfortable.  The music play list was 1970s funk, not what you’d expect at a NOLA themed establishment. And there was a musky smell in the air.  We were seated near the restroom. It smelled like dirty mop or mold. Just not good. We opted for regular tap water and received a bottle with a branch in it. My first inclination was that it was probably mint, but there was no smell or taste of mint to the water.  Slightly off putting. We opted for the Hurricane as a drink and ordered Chargrilled Oysters, Ribs, and Mac n Cheese for our appetizers.  The Hurricane looked like what you’d expect to see when you order one at a NOLA establishment, and it was quite potent.  The chargrilled oysters were flavorful but very little meat to it.  The Mac n cheese was just OK. The ribs were very tender, and the sauce was sweet with a hint of spice, but the meat was a bit dry.  We left about half of each dish behind. No interest in taking home any of the left overs. Towards the end of our meal, a waitress, who was not our original server, asked us how everything was.  We asked for the check. She brought the check over and hovered over us. Our original server came back and processed our payment.  After  paying and tipping, we rose from our table to leave.  The manager wished us a good evening but also asked the hovering waitress if we paid our bill. That was extremely rude.  This experience absolutely paled in comparison to our amazing brunch at  File Gumbo Bar earlier.  If you are seeking a fun relaxing brunch vibe with amazing food, great live jazz, and professional service, go to File Gumbo Bar just a few streets down instead.  Our first and last visit to 1803 was so disappointing."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aZmVUVkdaMVJ0YVhscloyeHdOSEpYVFZoQmQxRRAB",
            "text": "Great food and menu"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQlZHOUhkMjlqZERsaGJsZE9OemhNZFV3NFNFRRAB",
            "text": "Love the chicken sandwich but I wish there’re more sauces"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oS1dsbHlOMWxNT0dvNGVWWk5kRTh4WWxacVJuYxAB",
            "text": "Came here for brunch after walking over the Brooklyn bridge with my family. The staff is soooo friendly and kind, everyone talks to you with a smile. The ambiance is very inviting and beautifully decorated. Food was amazing and their drinks are great I had a non alch beverage and loved it\nWould definitely come back, the staff here truly made it an experience"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOS1JVRnViR3AyUldFMkxUWnZjMDlPVVZCVk9XYxAB",
            "text": "The staff was beyond welcoming, attentive and friendly. The Oysters were beyond disappointing! Nothing like Drago’s in New Orleans. The meat of the oyster’s were so small there was almost nothing there to eat but the sauce, which was good but there was little meat there was; shriveled! Please don’t order the oysters. I should have sent them back immediately. The bread was soft and nicely toasted but no butter.\n\nThe ribs were fall off the bone tender but it needed MORE seasoning! They needed , heat,  spice and or citrus. They needed something to balance out the sweetness.brought mine home and reseasoned them with garlic and jalapeño, and added Adobo.\n\nThe best thing to me was the gumbo. Again more seasoning! What do they have against onion, garlic and Tony’s.\n\nFinally the bread pudding top with butter pecan ice, delicious! I finished it right there."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdWVrNVNhRkZmTkRaelgxWjJkVXc0VFhvd1MzYxAB",
            "text": "Very nice and cute restaurant. The food was just ok. I had the Cajun style ribs and my grandmother had the dirty rice and gumbo. She didn’t care for her food- it needed more seasoning"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSU2VWVnBla2hvWnkxc1VESXlkVmRDWjA5WWFXYxAB",
            "text": "Fall trip from Atl and stopped here after our Brooklyn Bridge Walk. A breath of fresh air. The kindest staff! Food was great. Highly recommend!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbFVtSjFaVW94WmpsdlIxaDJSMEZmUkhsMlZVRRAB",
            "text": "Great food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcGMwMWlTbE5oVnpCaVNGVm1kVW94WW1oclMzYxAB",
            "text": "Great atmosphere and steak lol"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNVF6TkhNWFozZEZKU2RYWlRUVVZDWVY4eVVrRRAB",
            "text": "Brunch and lunch where the same thing brw"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMk1UVXpkSGRNZG5WU2FrTXpibXR4TTNCUlZIYxAB",
            "text": "Best gumbo in NYC. I'm from New Orleans. It's not made with the traditional dark dark rue but the flavor was phenomenal and I do appreciate the flavored rice separated from the gumbo instead of sitting on the bottom of the soup getting soggy. Perfect for the fall weather outside."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdFRWTlJNbFZFVkc4MlZrNVRaMTlZWW5CM1NVRRAB",
            "text": "The food the food the food. Drinks are really good esp if you like to try different mixes of alcohol. The atmosphere is cool but the music be vibin'. Everything foodwise was delicious...but just grilled oysters..\nAll I gotta say."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNE5HNVFNVTR3VFRkalVGbHdiVzVWYVVoZlJFRRAB",
            "text": "1803 NYC serves up great New Orleans-style food with tons of flavor. The shrimp and grits are creamy and perfectly seasoned, the jambalaya is smoky and hearty, and the blackened catfish is tender with just the right spice. The po’ boys are loaded and delicious, and the cocktails, like the hurricane, fit the vibe perfectly. The place has a fun, easygoing atmosphere with friendly service and good music. A solid spot for bold Southern food and a relaxed night out."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNVJqVnZkVmRMYjJWR1gxTmZNVTlVZUZCb2JsRRAB",
            "text": "Great food and great service ! Will be back !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcVJFTjBlbmxtU2xCcmNIUkVabWhCVms5TlZXYxAB",
            "text": "Everything about this restaurant impressed me — from the atmosphere to the service to the food. The manager went out of his way to make us feel comfortable, even moving us to a larger table and personally recommending the ribs. I’m so glad he did because they were unbelievable — tender, flavorful, and honestly the best thing on the menu.\n\nYou can tell the staff here genuinely cares. Everyone worked together effortlessly, clearing plates, checking in at the right times, and making sure we had everything we needed without ever feeling rushed. The vibe is cozy and moody with perfect lighting, stylish decor, and music that sets the tone just right.\n\nThe food was exceptional from start to finish. Every bite was rich and balanced, but the bread pudding was pure heaven — warm, decadent, and melt-in-your-mouth good. Their mocktails were just as impressive as the cocktails, which is rare.\n\nIt’s so refreshing to find a place that gets all the little details right. 1803 has definitely become one of my top favorite restaurants in New York City — can’t wait to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoYVoyNXNlRFZCYkRkUE9EaDJlbDk2TFZCdVkwRRAB",
            "text": "The food experience here rivals famous restaurants costing much more. The food tastes amazing. All parts work in harmony. Staff members were fast and personable with all requests. This place provides plenty of reasons to return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTVVVVkVaSEZ1U3pCWlVIQkxRemRDU214WFZtYxAB",
            "text": "Really good place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRd1ZUZFVSR1JFVjIxNFZUTTRZbWh0YTFSM2EyYxAB",
            "text": "Every dish showed that the kitchen takes pride in their work. The price point, amount of food, flavor quality, and service level impress me. The employees here never fail to be pleasant and attractive. You'll notice how gorgeous this place is right away. My return is certain."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OU2RFRmZRa2d0U1haaE1HRkxaR3QyU1dscVkyYxAB",
            "text": "The service was great! Everyone was friendly, from our server to the food runners.\n\nThe food was overall good.\n\nThe charbroiled oysters were delicious, and the Brussels sprouts could have been cooked a little longer, but they tasted great.\n\nFor our mains, the sauce on the Branzino made it a bit soggy, and the short rib Ragú pasta could have been a bit more al dente.\n\nSorry for the very opinionated review, but it’s with good intentions."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSlpGZDJaakJFTUU5c2JYUlliRTh5VkdzNWJsRRAB",
            "text": "Incredible food and nice buzzing ambience  but the best thing was their service- very good staff, great attitude and it made our lunch extra special."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd2NEbEVUak13TldGT1lsUjNaRTlTUm1oSGVFRRAB",
            "text": "I went to 1803 because I was told about the live band but unfortunately they no longer have that service. Even though that experience was no longer I had an amazing time and the atmosphere was still very inviting. My waitress Maria was everything. I would definitely recommend going here. Make sure you get the ribs btw! Soooooo good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MGQxOWphVUV3WlZOcWFsQkRkRGd6UTNwNlltYxAB",
            "text": "My friend and I popped in for a couple drinks towards the end of our night and it was a great time. The bartender was so friendly and made us great cocktails. If I get back to this area I’d be interested in trying their menu, but stopping in for a drink was a great decision!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vdGJHaHRVSE5wV0hwQ05UUktURzlUVjJkMVkyYxAB",
            "text": "Great little corner joint to have drinks or lunch w a Frenchie vibe and center bar. And a frozen drink machine, w awesome rotating drinks, for those hot summer dayzzzz!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbWNtZGtjMVp4ZG05RlVYWnJRWEpVUWtOMWQzYxAB",
            "text": "The Brussel sprouts and gumbo are delicious, especially when dress with the yummy hot sauces that are house-made by 1803. Staff is very nice & professional; definitely worth checking out"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TGJYcDVhREZ3Y1U1YVozQjJUSFpoTFdzNGNGRRAB",
            "text": "Steak and eggs was just ok. The drinks were definitely better. Next time I'll try the burger. Also, the sorbet was absolutely delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU01GQnNkMjVuVlVscU5tWktTMVJoWjIxMVFsRRAB",
            "text": "Ill start by saying that they nailed a Nola vibe/look with the decor. I had the most amazing honey chili sesame seed Brussel sprouts ever. However the burger was unimpressive. Although I have to say... burgers are just 1 of those foods that most restaurants dont get right. Im currently on the hunt for NYC's best burger, this is the perfect place for friends gathering or a casual date. Great drinks and decent appetizers. The staff is friendly,  my waitress Mariia was very attentive. And the manager Eddy certainly works the room ensuring that everyone is satisfied. I would definitely visit again if im ever in the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeGNERjJNemRvZEVkQ1lWZzBMVm90UzBGVVRtYxAB",
            "text": "BEST food. BEST service. BEST vibe. A time was had, and this is hands down one of my favorite restaurants in the city! The food portions are generous, the flavor is rich, and the staff could not be kinder! Eddy, you’re a 👑"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoQ1kxbFRSbEp2U0VGYU0waEZWVzVSWjNSSlVuYxAB",
            "text": "So glad I discovered this gem!! Touch of New Orleans in NYC! Amazing service and hospitality! Tasty drinks and food!! Can’t wait to visit again!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeVFVUXpla2gxTUc5R1RtaGxXSHBpVjJaR1dHYxAB",
            "text": "I recently had the pleasure of dining at 1803 NYC, and I must say it was an unforgettable experience. From the moment I walked in, the atmosphere was warm and inviting. The decor perfectly blends modern and classic elements, creating a cozy yet stylish environment.\n\nThe food was absolutely exceptional. I tried the shrimp and grits, which was bursting with flavor, and the portion size was perfect. Every bite was a delicious combination of spices and freshness. My partner had the jerk chicken, and it was perfectly cooked, tender, and full of smoky flavor. The drink menu was impressive too, offering a great selection of craft cocktails that paired well with the meal.\n\nWhat stood out most was the service. Our server was friendly, attentive, and knowledgeable about the menu. The whole team made us feel welcome and ensured we had a great time from start to finish.\n\nOverall, I would highly recommend 1803 NYC to anyone looking for an outstanding dining experience in the heart of the city. Whether you’re celebrating a special occasion or just enjoying a night out, this restaurant is definitely worth a visit!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMlJFZG5XRUZXVVZSd09IazNVbHBNVEVKcVlXYxAB",
            "text": "Fantastic brunch experience. Food was amazing and servers were very friendly.\n\n100% would recommend the Gumbo, Southern Hoe Cakes, and Bread Pudding!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWlpVUkVZVlJUVkY4eFNYUlNkRTVMTlcxSmRtYxAB",
            "text": "I absolutely loved the food! Gumbo and oysters charboiled. 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRVVIWTNORTU0UWtobVoxVnZkV2xUVUZWVFJXYxAB",
            "text": "Phenomenal Experience at 1803! Outstanding Customer Service, Delicious Food and Delightful Drinks! We really enjoyed our time!!! Everything was perfect! Thank you to the entire staff for allowing us to host our birthday celebration!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BdFMwMHRVWGRVYm5OWlEwZFdabVkzVmtwRWVsRRAB",
            "text": "Service is exceptional. The manager is a gem. Celebrated my 24th birthday here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdVMzUTFPRWMwTXkxaFUwRjRjamhEVVZkT05IYxAB",
            "text": "Everything was nice and they surprised my friend with a dessert for her bday. Definitely we come again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeFRIa3dTek55U1ZVeE9IZzNiV1JuVUUxV1lYYxAB",
            "text": "On a recent night out, I randomly chose to try 1803 NYC for the very first time, and it did not disappoint. From the moment I walked in, the atmosphere set the tone—inviting, lively, and just the right mix of casual comfort and city sophistication.\n\nThe food! Ahh the highlight of the evening. I started with the baked oysters, which completely exceeded my expectations. They were rich, perfectly seasoned, and had that indulgent, briny depth that makes oysters so special. For my entrée, I decided to step outside my comfort zone and try the ribs—something I don’t usually go for. To my surprise, they were outstanding: tender, flavorful, and fall-off-the-bone good. I can honestly say I’d order them again without hesitation on any future visit.\n\nThe drinks were just as memorable. Decadent and well-crafted, each cocktail was a treat in itself—elevating the meal and adding a touch of indulgence to the evening.\n\nWhat made the experience even more special was meeting the restaurant’s new manager -Eddie. His passion for hospitality and the future of the restaurant was immediately clear. It’s rare to see such genuine enthusiasm and care in action, and it added a personal touch to the night that I won’t soon forget.\n\n1803 NYC is a place to savor! It’s easy to see this restaurant becoming a staple on my dining list. I’m already looking forward to my next visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwQkxXWkdWMmwwU1ZGMVJteFROMEp3Y0hrMExVRRAB",
            "text": "This place delivers satisfaction on every level. I look forward to visiting this spot. The restaurant's standards show in food taste and staff interaction. The workers treated my family like their own. This spot merits your consideration."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJdE4yWkJhaTFYYWxrM1QwODFVakl4VVZsT1FXYxAB",
            "text": "We had a girls’ brunch for six at 1803 and everything was perfect! The staff was incredible, the food was excellent, and the lively ambiance made it the ideal spot to catch up with friends. Our server (whose lovely accent I wish I could place) took such good care of us, and Eddie, the manager/owner, went out of his way to thank us for coming. He mentioned that seeing groups of friends reconnect is what makes hospitality so special to him, which made the experience feel even warmer and more personal. We’ll definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MmJHVlNRV0paYWpRMlQydDVVekptUWs4eE4zYxAB",
            "text": "Eddie is an awesome host. From the moment you walk in, he's doing everything and anything to make the experience great.\n\nMy wife would have passed this over, being a Cajun-Creol restaurant as a vegetarian but the veggie soup was melt your face good.\n\nServing staff was wonderful, food was excellent, and the vibes were just right.\n\nWe'll be back soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeU1ETTFZM1kwTkd0SFdYaDZPRXBwYUZKM2NsRRAB",
            "text": "Great atmosphere in and outside. Reasonable prices. Service very friendly and fun. Escargot delicious. Shrimp plump and juicy with a great sauce. Paella a bit dry so they brought out a very tasty sauce to liven it up. The ribs appetizer was the standout falling off the bone."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMlFVd3lYMnRNZUdOaE0zSjBWbk5MYkdJelVtYxAB",
            "text": "Perfect brunch experience!!  The food was delicious.  The live music excellent.  Atmosphere was inviting and fun.\n\nThe bread pudding was the best thing I ate in a long time. Incredible mixture of chocolate, caramel ice cream and of course bread pudding.  Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb1pTcFVREAE",
            "text": "My friend and I had a reservation at 1803 NYC at 5:30 on a Monday evening. I read some reviews about the restaurant being very loud, but if you go around this time, it is not that crowded. Interior-wise, there is a small discrepancy between the upscale vibe their decor gives and the appearance of the floors, walls, and bathrooms.\n\nWe split charbroiled oysters ($23), my friend got the jambalaya ($29), and I got the Louisiana pulled pork sandwich ($20). The oysters had a wonderful sauce that tasted like a zesty tomato base. My friend enjoyed the jambalaya and noted it had great flavor. The pork in the sandwich was tender and cooked well. However, I do like some type of smoke or bbq flavor in my pulled pork, and this fell flat in that regard. The fries were cooked perfectly, so they had a nice crisp.\n\nService was good! We had multiple check backs and quick service. Overall, I felt like the restaurant had great flavors at appropriate dinner prices. I would recommend checking it out if you're in the area, though it is not a restaurant I would go out of my way to return to."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205R1RuTmhWVUpSVVVwV1MzSkdZa3A1ZVRsbGRtYxAB",
            "text": "I'll get straight to the point. We went with a large group. We ordered the gumbo, the jambalaya, the burger, the French toast, The oysters and even a salad. I cannot tell you one thing that I didn't like. It was all amazing. My favorite was the gumbo and the oysters and the employees there were all really nice. I can't wait to go back again. I definitely want to try the shrimp Po boy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taclJrUnpXRFV6Y1hkTmJuWkZWSGhrYVhWcE1GRRAB",
            "text": "1803 was southern comfort, LGBTQ pride, excellent service, and great cuisine rolled up in one. We were pleasantly surprised. We were warmly greeted and taken to our tables immediately. The ambiance is a rustic, welcoming almost homely vibe. None of the unnecessary flair that you find at other restaurants looking to trend.  We were greeted by a handsome young man named Calvin who was very mannerly and attentive. He took our orders and answered questions. The food was brought out hot and in a reasonable amount of time. The food was delicious and there had not a single empty plate at the table when we finished. The was a jazz band playing light music that was very soothing as it was not loud music-just mellow and smooth. Even staff who weren’t waiting on us conversed with us casually- not pretentious or over the top. The mood was so light the we didn’t want to get up but staying longer without ordering more would have been rude. If I am around the area I would definitely go back and I would say try 1903 and bring a friend or two. Only downside is that the menu is not extensive, but I guess that’s what makes them master the menu options to customers delight."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKenB4SXF6LU5xRjBnRRAB",
            "text": "Very tasty food. I went to their jazz brunch. The food was great and I liked the cocktail pitchers. Music was okay but an added bonus. It was not Dixieland jazz or anything you'd hear in New Orleans. It wasn't too loud for chatting which was nice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbE4wTldkRzUzVldObkxXTTFaVlppWVRWaVgzYxAB",
            "text": "I had an absolute great time at 1803! I’ve been twice, once for a date night and the other for a girls night and both times I thoroughly enjoyed myself. The drinks were amazing, my favorite was the sidecar and the frozen grenade. I was lucky to get the happy hour special so it was $2 off all drinks! The food was delicious and very well flavored. I had the xo noodles and the charbroiled oysters were to die for!! I Will definitely be back again soon :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbjQtdFV3EAE",
            "text": "We came to 1803 NYC to celebrate my mom’s birthday, and had such a fantastic time! This was our second visit, and it definitely won’t be our last. Our waitress was absolutely wonderful—super friendly, attentive, and provided top-notch customer service. The rest of the staff was just as impressive—everyone was helpful and on point.\n\nThe food was delicious! We especially loved the ribs and the charbroiled oysters—they were packed with flavor. The mac and cheese was a standout for me: rich, creamy, and so satisfying. The gumbo and brussels sprouts were just okay, but everything else more than made up for it. A really thoughtful touch was when they surprised my mom with beignets for her birthday—they were warm, sweet, and really tasty.\n\nOverall, it was a lovely dining experience with great vibes, great food, and great service. We’ll definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRFlVVjBlRFJYU0RaT2RWOWFhbFZaVUdaemVFRRAB",
            "text": "The food was delicious. Everything was seasoned to perfection. Taste and full of flavor. They have a special sauce that is drizzled over the food and it tastes amazing. My collared greens were pretty good. The hostess was so inviting. Made you fell like you belong to the restaurant.  Very nice experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaS2QzYzNaRFV4U0ZKUU4xbEpSRGhIWlRCc1UyYxAB",
            "text": "Went there for lunch with my girlfriend and ordered two simple Caesar salads. They were around $17 each, but really just lettuce, some cheese, and croutons. If you wanted to add shrimp or chicken, it was another $14–15 which would bring the salad to nearly $30, which felt way too much for what it was.\n\nThe fries were actually pretty good (about $9 for a basket). In total, we spent about $60–65 for a basic lunch, which seemed steep for what we got.\n\nService was fine, nothing memorable. The interior was quiet, beautiful view, nicely designed, and very clean that was probably the best part. But based on the price and food quality, I’m not sure I’d go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4V2MwOXlSbWhVUkROb1RqQlZaV2RrYURCTlUwRRAB",
            "text": "I enjoyed this spot. It's in a great location in Manhattan literally across the street from the subway! The staff were super friendly. Decent options for food and drinks. My friend and I enjoyed lunch there. My meal was tasty enough and well priced. Def a good spot for lunch"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZM1VXVlVTbEJhT1V0UmIzZEdhMU5NWWtSRFZYYxAB",
            "text": "Made reservations for Sat brunch and the place was relatively empty around 1:30 pm on a sunny day. Live music, welcoming host, and cozy interiors is how the interiors felt.\n\nWe really went here to try their beignets - but their menu rotates every 2 weeks and their website wasn't updated with their new menu. That however did not stop us from trying other things which included their Signature Gumbo ($13 - cup). A little too seafood forward in terms of the aroma of that dish, however the cajun rice was packed with flavor.\n\nVegan Jambalaya ($29) is what we shared as our entree, and while tasty, it felt a little too dry. They 1803 red and green hot sauces though were a flavor explosion - a must try for spice lovers! They made the waffles and chicken into a waffles and berry compote for our little one, so thanks to Tsubi for that!\n\nTsubi and Eddie were very welcoming and friendly throughout our stay here and we will certainly recommend as well as visit again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNGIyYjFBRRAB",
            "text": "We took my mom here for her birthday. The pictures on Instagram don't really do it justice. Beautiful place, fantastic service, drinks amazing and the food was dynamic. We are all hoping my sister wants to have her birthday celebration here. We are all excited about visiting again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeWVYUnBkVzlhWmxwMk9FSmxaREpCYURGdmFuYxAB",
            "text": "Thoroughly enjoyed our meals of hoe cakes with a delicious blueberry compote (we ordered extra!) and vegan jambalaya. There was live music which was fantastic - Cuban flare and not ear bustingly loud :)) Highly recommend!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOXZqSFR3EAE",
            "text": "Loved this place! The staff is super friendly and you can tell they really work together to keep things running smoothly.\n\nThe food was fantastic! We had the charbroiled oysters (so good!) and the signature gumbo, but the real star for me was the chicken and waffles—absolutely amazing! I’m so glad I went for them.\n\nWe also ordered a pitcher of the French 75 cocktail, and it was perfect for the table.\n\nThe vibe was great, with good music and an overall fun, welcoming atmosphere. I wore an outfit after visiting the Met and didn’t feel out of place.\n\nCentral, pretty, fun, and worth it. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOE1YTzdRRRAB",
            "text": "Absolutely loved our brunch experience here. The vibe is fun and I’m happy I could hear my friends over the music. Was also happy to hear that none of the food is actually spicy and so I chose the chorizo purgatory with confidence. Staff is friendly, super helpful and checked in with us often. My friends got their drinks but I opted for a coffee and can say I enjoyed it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMVYzVkViVWhJU25oeWVFdEVOVmh3YzJaR2VVRRAB",
            "text": "Simple, solid Cajun food.  The jumbo and branzino was perfect and the key lime pie was a perfect way to end the dinner.  Enjoyed our experience."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNVdrNU9kRXRRVlhOVVdYRlFURXhmY2tSUmVHYxAB",
            "text": "El pasado domingo 27 buscando un local para comer por casualidad dimos con este restaurante y resultó ser una magnifica experiencia. La comida muy rica amenizada por música cubana en directo y encantador su dueño que estuvo hablando un buen rato con nosotros, una conversación muy enriquecedora, fue un placer, recomendamos visitarlo y por supuesto comer en el. Un abrazo desde Madrid."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aR09HWlBSWEIxUTFobVFscExNMHgxVldSM1pYYxAB",
            "text": "We just came by for a snack on our first evening in New York. Didn't expect too much from the vegetarian menu but we were wronged. The food was fresh, tasty and just really good. Also checked the soup of the day and found out it was vegan, so we did try it additionally.\n\nGood, welcoming an quick service, no long waiting, nice drinks and clean babthrooms. Thanks to the whole team for ne nice evening. We will recommend you guys!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SlF5MXNlalUwVUZBMlkyUlVPV1JLV1Y5dVZGRRAB",
            "text": "Nice brunch place after a movie. You should reserve a table though.\n\nWish I took a picture of the menu but here is the steak and eggs with a side of Cajun rice. The sauce is a little surprising in terms of flavor, but all in all it was good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfck9lRlNBEAE",
            "text": "Booked reservations at this restaurant for my birthday weekend, they were so awesome in giving me options for seating. We chose to sit in the speakeasy area it was perfect, not too loud but still great music. Our waitress was so kind taking group photos for us and helping us with finding the perfect drink. The XO noodles were to die for and the deviled eggs and Cajun escargot are a MUST! We loved the black swan and French 75 cocktails and WISH we saved room for the beignets, we will be back !"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRU1YQnVSUzFEY0RZdFVtNVJRWFZLVldoU1lrRRAB",
            "text": "Un lugar fantástico! La comida muy rica y el servicio súper agradable. Especialmente agradecer el trato que nos brindó Eddie, quien hizo que en 7 días de estancia en New York, visitaramos dos veces el local 🫶🏼"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUWJrNXBXVGgxYlhBMFkxOHpjbnBaU0RWemVHYxAB",
            "text": "The XO noodles are great along with the jambalaya and gumbo. Live performance with dinner Thursdays and Fridays I believe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbnVHZl9BRRAB",
            "text": "Stumbled upon this restaurant after going to a haunted house. We didn’t have a reservation but were able to sit at the bar right away. It’s a cute restaurant and noticed there is upstairs seating as well but the counter is wide so it’s enough space to eat at the bar if you don’t have a reservation. Surprised it wasn’t that busy on a Sat night so it was a bit odd that it took quite some time for the bartender to come and take our drink and food order. She was more attentive at cleaning the bar and cashing out their tips than wanting to take orders. Our favorites were the signature gumbo and ribs which we shared as apps. It was so good! The meat fell off the bone and the two hot sauces they give you goes so well with it. The gumbo along with the rice was so rich and tasty. Since we enjoyed the apps so much, the entrees were a bit underwhelming. The beignets were really good and def recommend to end the meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MWVQdU9BEAE",
            "text": "Great atmosphere. Went for a really early birthday dinner on a Sunday. Food came out fast, was delicious, and the ambiance was great. Highly recommend the Mac n cheese. I also recommend the ribs as they were finger licking good. My table had the peach salad, gumbo, and jambalaya. Everything was good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS1BqWk9ObHZmOF9BRRAB",
            "text": "love this place so so much ! found this place open on valentine's day and it is now me and my girlfriend's spot !! great food and amazing atmosphere - downstairs is awesome at night."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MmQxRTNRMG8wYWxFdE1qQlBiak5aWjJnMWRuYxAB",
            "text": "The service is really well. Food is ok and we loved the atmosphere. Happy hour Monday to Friday."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5c2VUdi1nRRAB",
            "text": "We had a super yummy and also super early dinner.  I have been here before for the jazz brunch with live music, which was really nice since we sat in the balcony with the band.  On this occasion it was after brunch, which made it more conducive to conversation, which was helpful.  We had the shrimp and grits, which was absolutely delicious, and the fried green tomatoes and macaroni and cheese as shared starters.  We also had the lavender lemonade which was perfection.   Our servers were friendly and efficient and the atmosphere was great... except for a rude group that sat behind us... but that's not the restaurant's fault."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnb2V2bkVnEAE",
            "text": "A perfect lunch on a chilly afternoon!\n\nI started with their signature cocktail, Flight 1803 (gin, Luxardo liqueur, lime), which was very good!\n\nWe both had a bowl of their delicious gumbo with oysters, crab, shrimp, and andouille sausage.\n\nService was wonderful too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIX2VpSnhRRRAB",
            "text": "Rare for me to give 5 stars across the board,  u tend to reserve that for the places I appreciate most in any particular trip.  We've ate at some great couples well in New York but this place is a hidden JEM!  A bit of the south tucked into a beautiful looking corner spot with outside seating.   The gumbo and jambalaya were both wonderful.   The drinks were great and the price is reasonable."
        },
        {
            "date": "6달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMm8yemtRRRAB",
            "text": "Lezzetli bir kahvaltıydı çocuklarla gidilebilecek rahat bir mekan  güler yüzlü hizmetiyle işletmeye teşekkür ederiz"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOVk2dWhnRRAB",
            "text": "Wow , what a great place to stop in on a cold February night with a friend.  This is a charming New Orleans inspired restaurant on Reade Street in Tribeca. Layout is a bit weird but it was warm inside and staff are nice .We got 2 cocktails each. The Flight 1803 gin drink with cherry flavor was my favorite and a perfect Winter drink . The Jean Lafitte is gin with dragon fruit and was good too . The 'Oh The Places You'll Go ' drink is a complex but delicious bourbon drink that's perfect for Winter too . The Mississippi Delta I didn't get as big a flavor from but this is a serious cocktail place that's popular with locals for Happy Hour with $2 off drinks . Get the Prawns appetizer  ! This was so delicious and the sauce was great for dipping bread . Ceasar Salad was ok but next time I'd get the Escargot or the Grilled Oysters . For mains I got a Shrimp Po Boy with fries. The sandwich is definitely tasty and filling and they give you hot sauce to put on it if you like.  The fries weren't very crispy though. My friend had Jambalaya and thought that was really good , of course we wanted to try New Orleans food . Dessert was Bread Pudding served warm . Wow ! So delicious,  definitely get that . I'd love to come back here again.  It's a couple blocks from City Hall ."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNdE1rVlhhVEZzYjNsdk9IRm5SVzlXZFdOamNIYxAB",
            "text": "Wow! This place is amazing! The ambience is so cozy and cute, and the food was far beyond anything I expected. We ducked into this place (blindly) after a long day of walking the city. It looked inviting so our family of four decided to give it a shot. I was in the mood for a good salad, and the one I got was so tasty in all the right ways - perfect little gem lettuce (my favorite), delicious grilled chicken, and wonderful touches like pomegranate seeds and goat cheese. All of us loved our food! I tried my daughter’s mac n cheese, and it was divine, too. They baked it in a little dish fresh and that really makes all the difference. A really fun little surprise was when a band started playing, and we looked up and saw that they had a special loft for them to play above the restaurant. So cool! On our way out, we happened to run into the owner and what a nice guy. He was so welcoming and kind. Since we are traveling, I don’t know when we will get to go back, but this will for sure be a stop we make every time we are in New York!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmLTZ5aGVBEAE",
            "text": "Had a group of 22 dine here and everyone was really pleased with the quality of food and amount. The ribs melted in your mouth, beautiful branzino and heard rave reviews about the steak frites. Only negative was the spinach dip being very spinachy, but I enjoyed it, so it may be personal preference. Our cocktails were good but very much on the sweet side. They really accommodated our group well - first in the bon courage speakeasy and then up on the balcony for dinner with a live jazz band! You cannot beat the atmosphere! I'd go back for sure. I had genuine comments at the end about how much everyone enjoyed themselves. Very reasonable prices for groups as well - family style!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NW92aW1BRRAB",
            "text": "Fried oysters 10/10\nCorn Salad-let the chef know he out did himself. So perfect.\nJambalaya- wow I’m from Charleston, SC, but that will put some real south in yo mouth\nPecans and String beans! No she better don’t, never would have thought of it.\n\nHad a nonalcoholic beer I have never heard of before, and it was awesome.\n\nAtmosphere, calm, cute, sat out doors, relaxing perfect day\n\nMaria, our server. What an angel. Paid close attention without hovering. Will recommend and return. Thank you."
        }
    ],
    "reviews_count": 85
}