{
    "name": "Ol'Days Farm to Table Tribeca",
    "place_id": "ChIJx29iYSBbwokRZVlUmks4WNA",
    "grid": "MN1",
    "address": "73 Warren St, New York, NY 10007, USA",
    "rating": 4.3,
    "user_ratings_total": 290,
    "phone_number": "(646) 370-1074",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGa1VWYzNZUzB3WVRCNkxVOXdhMVZETmxOdFYzYxAB",
            "text": "This restaurant ruined our evening.\nThe staff was inattentive and slow.\nOur table wasn’t cleaned properly.\nFood came cold and flavorless.\nOne star is too generous."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTk1EVmlNRVpVWVdoUlRqZENPWEZoUW10ME5GRRAB",
            "text": "100% recommend!❤️"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tock4zTk5hM0JwTXpKT05XWjNVRGhPUVcwemRtYxAB",
            "text": "Lovely cafe with good food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0QkxXNU1VVE4xWnpsYVlYaG1jREp1ZUY5emFHYxAB",
            "text": "Shakshuka is totally bland. Send the chef to somewhere to learn how to make a shakshuka"
        },
        {
            "date": "2주 전",
            "language": "no",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocVpucHpXRFU0TkdaV1JYYzJkRTFuVnpsbU5YYxAB",
            "text": "Rolig, luftig og fint sted å ta en lunsj.\nNydelig avokado toast."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTUxYZDFRMVJHVUc1RmJFNURlbEJJTWtGWmRFRRAB",
            "text": "Nice place with healthy food and friendly service! Will come again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVlVHUmZiVzAxTmtNeVNXNXVlRXhVWTBrNFRWRRAB",
            "text": "Much smaller than appears in photos. Food was ok but nothing special. Did not taste like it was actually farm to table and the orange juice is not even freshly squeezed. Service was rushed they took away my iced latte when I was looking and I wasn’t even half way done with it. Very disappointing experience overall"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toYUxWWjFOemRuUzI1NVMwbFNOR2RrYlROTVVWRRAB",
            "text": "Food was over priced for what you get and service not great. I basically had to get up from my seat and ask for everything we needed at different points in the meal- menus, silverware, napkins, knife, etc."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTmVtVlNRMDF6Y0UwNFUwTXhUMHQxZDJwUVoxRRAB",
            "text": "Food & Drinks were great!\nService could’ve been better. The server, Lorena, gave no hospitality.  Very dry service. Other than that, definitely recommend!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdk9UZE9kVkJvYjFwZlJESk5OVnBKZW1adE1WRRAB",
            "text": "La comida muy buena, los pancakes deliciosos, el servicio algo desordenado y descuidado"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GU1NIVkhjRFF4TlVwSFkyZEhUMFpoVVZSSlJFRRAB",
            "text": "Like idea of farm to table. Really Wanted to like it but unfortunately, terrible value for the quality of meal. Could make better food at home"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVE0ydDRPVGxrTjFoalRYTmlaM1ZWYldkbWIyYxAB",
            "text": "Decent. Simple, bright decor offering basic breakfasts spread. Not to just on weekday mornings"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWamIydGlaUzF2TlRoRFVqTnBZMnMwUWs4eFNuYxAB",
            "text": "Our experience eating here was thoroughly enjoyable. We liked what we ordered though we've had better elsewhere. I found the experience outstanding. The entire workforce shows impressive capability. I'm ready to return at the first opportunity."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJNVJUSnlkM1ZyVVVwc2FrYzRkVGw2UW5sTWVIYxAB",
            "text": "Food was fine but the service was truly terrible. My boyfriend and I ordered our food and after that, our waiter never came back to the table. We waited about 35 minutes for our food and then the couple sitting behind us (who came in about 10 minutes after we did) got a free pastry for “a delay in their food” and ended up getting it 3 minutes after we did. We couldn’t get anyone’s attention to get butter or another drink, and saw others having to literally stand up and wave staff down for help. Everybody around us was complaining about the wait and lack of service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR1dUaGpUR2xQVDJSNE9XaGhVMDl2UVVKaldFRRAB",
            "text": "Ol’ Days is such a great spot for breakfast and lunch! I ordered the chicken wrap and was a little unsure about the cream cheese on it, but it turned out to be very, very good. The wrap was warm, which was a nice surprise.\n\nThe café itself is super cute. They have some indoor seating, and the aesthetic is even better in person than in pictures.\n\nOverall, a very good experience and definitely a must-try place if you’re in the area!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkalZFVTBWamRXYjBGdlZXd3RObmM1YVhFNU1IYxAB",
            "text": "I enjoy the atmosphere here. Nice team working together. The cooking quality surprises everyone. This place lets you breathe and enjoy. Friends will find both good conversation space and food here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWU1JHVkZaRFpsVUhNd01tRTJXRTVPWDNZeU1YYxAB",
            "text": "The garden quiche was fresh and tasted amazing!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbmJGY3lWV1JDTW5GR1pqUm9ZakZ2UzNJd2JGRRAB",
            "text": "Food was good, enjoyed our breakfast ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVldsZHBYMnB4V2tWTE9FUnRSbDlwY0Y4dGJuYxAB",
            "text": "The food is over priced and not up to standard. No flavor. Had to send back as it was also missing ingredients. The server was rude. Don’t come here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMVEwNVBWMjlrVUZKd2RETnljbEJPWkVoVVZtYxAB",
            "text": "Atmosphere was good and we had a good breakfast."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUVVFTlpabkpqZFhBek0xRnNVemxrTFdVMlRHYxAB",
            "text": "Amazing food and atmosphere!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMGJXaFZXVGRtY21GNWRUaEpWM05vTVRZd1ZVRRAB",
            "text": "Wagyu burger was delicious, tasty, and juicy. I wish I had the option to choose how the burger was cooked. It served to me medium well to well done"
        },
        {
            "date": "4달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eU9YQjRSbEJPWlUxUWRsTnZUWEp6UlhReE1uYxAB",
            "text": "Bardzo smacznie, bardzo miło..."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQN085YmJMazQtNFhBEAE",
            "text": "Amazing French toast!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLN3J3TnUya1pLRS1nRRAB",
            "text": "So glad we came! The waiter Gastón recommended the steak sandwich and the salmon bowl and they were both amazing. Also the tiramisu latte was great and still had strong espresso flavor. Will definitely come again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQelRfSS1rNnIyNzNBRRAB",
            "text": "So good!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOU2hqdGEtcDZid3ZnRRAB",
            "text": "Tried their iced tiramisu latte at the Tribeca festival and it was amazing strong coffee flavor and not too sweet. Note, confirmed with the store employees that this is an in store special only, not available on delivery apps like GrubHub ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VObXpncUw1LWNUNFFnEAE",
            "text": "The service was disappointing. The waitress took a long time to take our order, and when it came time to pay, she charged us incorrectly by keeping more tip than we had agreed on. We also asked for the receipt several times, but she didn’t want to give it to us before we pay. Unfortunately, this experience made us feel uncomfortable and disrespected."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJZWZuYWVOcnQ3aVlnEAE",
            "text": "Worst brunch I’ve had in New York\nEggs weren’t seasoned, potatoes were disgusting, bread inedible. I truly didn’t think it was possible to mess up eggs and potatoes.\nService a bit slow\nIncredibly loud inside"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLaVBvS1BTOHY3anVRRRAB",
            "text": "Seems a bit overhyped, but still some positives\n\nStopped in for a bite and appreciated getting a seat right away—always a win in Tribeca. The atmosphere was classy, and the design of the place was well done. Food presentation was excellent and felt thoughtfully put together.\n\nThat said, the yuca fries were dangerously hot—burned my mouth, and I couldn’t taste much afterward. The burger looked great but had zero seasoning until I added salt myself. Coffee came out cold, and even with hot water added, it still didn’t cut it.\n\nClean bathroom with good-smelling soap was a plus, though—a small detail, but appreciated.\n\nMy spouse loved it, so stay tuned for his glowing review. For me, it felt a little overhyped, but not without its charms."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMemlyTUhZNTZLMFVnEAE",
            "text": "Was easy to get a table when reserved on the same day. The food was good, the portion size was appropriate. A good variety of items were available for brunch, would recommend to give it a try!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLRzFfdmE3bnRhNlRBEAE",
            "text": "We tried this place on a whim and it was a good experience. We walked in and there were a few tables available. Our order was taken in a timely manner and the staff was kind and welcoming. The food took a while to arrive, but it was delicious and plated beautifully. The eggs were fluffy and I recommend having some. My partner ordered the \"Champ Pancakes\" but was disappointed that the plate served contained a singular pancake. I would recommend updating the menu if this is the norm to avoid false advertising. He liked the food still and enjoyed his specialty drink.\nThe ambiance was nice and there is a bathroom for customers. The decor was beautiful and there were nice murals of lemon trees that went well with the interior."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKV0FvT19BbktMd2FnEAE",
            "text": "We recently visited this place for breakfast and I have to say, it was fantastic! We had a vanilla cappuccino that was perfectly crafted, and the bacon, egg, and cheese croissant sandwich was awesome. The sandwich is huge and the croissant was flaky and delicious. Plus, the atmosphere was great and the service was on point. I’m giving it 5 stars for sure!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOZVI4OWYwai12aWdRRRAB",
            "text": "Had breakfast early morning, pretty quiet, the service and food was great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKU05tdHJncDRDRWxRRRAB",
            "text": "Edit: the marketing manager reached out and offered her personal contact for future catering orders and offered a discount, which was a nice gesture.\n\nI don't recommend ordering catering, unfortunately. I have brought clients here for brunch and they love it, so I thought their waffle platter would be great for a breakfast presentation I did for a client. I ordered it 24 hours in advance and had the confirmation. When I arrived 20 minutes past pickup time the next morning, they told me it wasn't ready yet, and that I had only sent them the order at 9:20 that morning. I showed them my confirmation from 24 hours prior, and they were kind of rude and just shrugged. No apology or solution. They told me it would be a 10 minute wait for my order, but I was going to be late to my appointment, so I asked for a refund for the $70 and to just order some pastries from the case instead ($50). As they were putting the pastries in boxes, someone brought out my waffle order all boxed up. Nobody said anything to me, so I asked if it was mine, and they said Yes. I asked if I could take it instead, maybe they could charge my card for the difference, and the staff member said \"You want it, too?\" No, obviously I don't want it also... that's what I originally wanted! I just said nevermind and took my pastries. Not to mention that the waffle platter is pictured online with edible flowers, but they were not included in the catered box. I loved going to Ol'Days for the seated cafe experience, but the customer service in this case was really bad. I did end up being 5 minutes late to my meeting."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbEttZFlBEAE",
            "text": "This is one of the few places in NYC I’d be excited to go to brunch at. The vegan/vegetarian options are abundant, you’re not relegated to a menu of eggs — there’s toasts, burgers, bowls, and of course my favourite: vegan waffles 😍.\n\nI’m not one to eat a fully sweet meal, but a good waffle HITS. Especially given how infrequently I come across them (RIP Quantum Leap in West Village). The lentil burger was also really good, and there’s enough on the menu that I’ll be back to try more!\n\nAmazing post WSH run meal. Can’t wait to eat my way through the menu (and the drinks!! gotta try the juices next, but the mint lemonade was"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN1pQaFdnEAE",
            "text": "Amazing food! Service was fast and staff was very attentive"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdWEyUlNBEAE",
            "text": "the food was amazing and beautifully presented. the vibe was a bit more casual but still an excellent place for breakfast, brunch, or lunch"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdHBPV01nEAE",
            "text": "Found this randomly and enjoyed it very much.  The eggs were perfect, coffee is great and the menu has plenty of find choices.  I will be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMDlDY2VREAE",
            "text": "Lots of choice and really delicious food. Was quiet for a Saturday morning which was surprising. Would definitely come back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveFpUcmRBEAE",
            "text": "We had a fantastic brunch at Ol’Days in Tribeca. The drinks were a standout—perfectly crafted mocha and cappuccino that hit the spot. For food, the Grandmother’s Buttermilk Pancakes were warm, fluffy, and comforting, just like the name suggests. We also tried the Midsummer Lentil Bowl, which was beautifully balanced with earthy lentils and sweet roasted beets. Everything felt fresh, thoughtfully prepared, and true to the farm-to-table concept. Highly recommend for a relaxed, high-quality meal in a cozy setting."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvb3ZuaklnEAE",
            "text": "Food was pretty good, drinks were great and unique. Everything was beautifully presented. Service was courteous but slow, especially to get the check. Nice place overall to grab coffee/breakfast and have a chat."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbl8zNld3EAE",
            "text": "Great brunch spot. Make sure u order the pancakes"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJazVLTTV3RRAB",
            "text": "Was thinking about gatekeeping this place but it’s soooo good! The staff is fantastic, the food is delish, and I find myself looking for any excuse to get breakfast here! Love it!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJanZHb1pnEAE",
            "text": "Such a good place.\nPleasant cozy atmosphere, friendly staff. I had shakshuka and eggs with bacon and mushrooms - it was so good. This is my first time there and I’ll definitely come back😊"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOXBTUEJBEAE",
            "text": "Review is specific to their mealpal\n\n14 points (about 20% of monthly points) for the short rib is about 19.5 so you are saving 4.5 dollars. The flavors were nice\n\nHowever - the meal was ice cold and barely edible despite the good flavor, I appreciate the discount but the condition of the food was a let down"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMEpMemdBRRAB",
            "text": "Great vegetarian and vegan choices!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aEtyc19nRRAB",
            "text": "Very loud."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cHNxc3dBRRAB",
            "text": "Very tasty food, many plant-based/ vegan options"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdzlYb0JBEAE",
            "text": "If you’re wondering what the worst matcha taste like, come to this place. Plus it was more expensive than other matcha spots. Probably a bad day, but it was definitely deserving of a review. (I’ve never rated a place before, so imagine my experience with their matcha)"
        },
        {
            "date": "8달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnanRTc1VBEAE",
            "text": "강아지를 데리고 갈 수 있는 몇 안 되는 식당인데, 음식도 깔끔하고 맛있어요. 서비스가 좀 느린게 흠이지만, 여유있는 브런치를 즐길 수 있는 곳입니다."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfanFya3pRRRAB",
            "text": "Spacious place, nice vibes.\nFood is average I would say. Got the shakshuka and tapioca balls, were mediocre. Quantity was just enough for one person. Matcha latte was nice. Got their fruit plate side, good quantity and fresh variety."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzLUx2c01REAE",
            "text": "So I was so beyond excited to try the wow choco, and mocha! One of the reasons I came here and farm to table food!\n🦋 when the waitress told me they ran out…I was so beyond disappointed that it completely changed my mood (mood kill)\n🦋  we opted for the hazelnut latte and caramel latte… which were both disappointing. Felt like just drinking milk with no flavor. No thank you.\n🦋 the falafel wrap changed my mood, it was very delicious. Great flavor and packed with so much. Definitely made me happy. Only thing  it wasn’t warm - so I’m not sure if that’s how it should be, but still was very satisfied.\n🦋 my partner got the champ-pancakes . It was good, simple …nothing extraordinary.\n\n🦋 almond milk is made fresh everyday!\n\nOverall I do want to return…to try what I was looking forward to…which was the chocolate. There’s so many other food that looked great that I want to try, but the falafel wrap did make me happy. So yes  make your way here and experience this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREOE9XWGNREAE",
            "text": "Went here on a Saturday for Brunch. I made a reservation online as I'm told the place can get pretty packed up. Our 1:30pm reservation, was a great time, wasn't too crowded at all. The latte art was so cute and their nut milks are made in-house. The cafe drinks are a bit pricey for the sizes, but it's NYC, and you get what you pay for. I had a latte with the oat milk and it was quite tasty, indeed 😋.\n\nThe inside aesthetic was cute, bright, and cozy with lemon tree decor. Would definitely return in the future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5akstQnJRRRAB",
            "text": "Absolutely love this place. Stopped in after 3 pm and was pleasantly surprised that they serve breakfast all day! Will definitely return to try some more of their meatless options. Gave it 4 stars only because my food was cold but still really delicious and tea was a bit hotter than ‘warm’ but not quite hot. I did love that they garnished the plates with edibles flowers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxM05tRE9REAE",
            "text": "The staff is really nice.  Food is great.  The risotto was really rich and delicious.  I would highly recommend sharing it and getting a lighter dish to share to counterbalance the richness. All my friends enjoyed their dishes as well.\n\nThe Reboot juice is tart, be prepared for that.  The Latte was good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNXFXU0l3EAE",
            "text": "My third time here.. not as impressed as I was when it was newly opened. Service was extremely slow which I understand because it was a Sunday and was extremely busy. The shakshuka was unimpressive, watery tomato sauce, I loved the champ pancakes and the cappuccino though."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOODdXYW13RRAB",
            "text": "This is my 4th time coming to Ol’Days, and it’s quickly becoming my favorite brunch spot in TriBeCa. I’d like to try everything on the menu. My favorite combo has been the salmon bowl with a tea infusion. The music is wonderful and relaxing, the chairs are comfortable, the atmosphere is spacious, and it smells delicious too. Our server Maria was very nice, made good suggestions, and she was attentive without hovering. Perfect service. Every time I eat here, I leave feeling energized and light. You can’t find ingredients this fresh in grocery stores."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NHFhMmVREAE",
            "text": "Lots of seating with bright natural lighting. The food was decent. The toasts were small in portion size. Preferred the mushroom one the most. Could replace cheese with vegan cheeses. The tapioca bites were nice. The Buddha bowl was on the sweet side. Overall the food was ok but a lovely cafe to meet friends or have a relaxed weekend brunch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaHBMRGx3RRAB",
            "text": "Beautifully decorated food and it tastes likewise as well. Great for breakfast. We ordered the avocado toast and chipotle chicken sandwich (so pretty basic) and both of them were delightful. Very helpful staff, we stopped from our way back from the airport and they stored our luggage on request. Lot of natural light which adds to the charm of the place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dDVMeFRnEAE",
            "text": "Food was delicious!  The staff was welcoming and friendly.  This felt like a local establishment to have brunch in.  The food was so good.  Start with a chai latte with freshly squeezed almond…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0aFozZ0l3EAE",
            "text": "This place is absolutely beautiful and such a nice vibe for brunch! I had such a great time with my friend! The tropical salmon bowl had  beautiful colors and the salmon was cooked perfected with the crispy skin!  I also got a tea that was delicious I already came back! Server was great too!!! I can’t wait to try the other foods."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGaGZtV0V3EAE",
            "text": "Nice spot for brunch in a nice country style setting. Plenty of seats inside.\nCoffee was good. Cortado, cappuccinos were good. You can also get very large sized lattes.\nLots of breakfast items and healthier salad/bowls sandwiches.\nWe enjoyed the pancakes and the shakshuka and avo croissant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKd29fNTNBRRAB",
            "text": "Fantastic breakfast location. Full service with excellent selection of healthy options and indulgences alike. The coffee and fresh squeezed juices are excellent as well. There’s space for larger parties and the decor is homey and warm. 6 stars. Great job"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdmNtNmtBRRAB",
            "text": "We came for breakfast and it was absolutely delicious! I got the açaí bowl which was amazing and my husband got the homemade yogurt with granola and fruit which he loved as well. The roasted potatoes were so light and yummy. Luciano was fantastic! We’ll definitely be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdHJPWURREAE",
            "text": "First time visiting this place. I tried shakshuka and yuca as the side and it was super delicious, warm and fresh! The server Gaston is wonderful sweet guy. Coffee was amazing too.\nWill definitely come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaVllMEtnEAE",
            "text": "The place is really cute, and the staff is nice! The food was great, and for the price, I mean it’s alright for NYC. However, the coffee feels a bit overpriced for the portion you get, and the banana bread didn’t taste like what you’d be used to. But overall, the place is really cute and nice!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdG9yYjhRRRAB",
            "text": "Just what we were looking for, for breakfast!\nCute cafe, not too busy.\nFood really delicious and beautifully presented.\nMenu looks amazing, wish we were in NY longer to try more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0b2FXU3ZBRRAB",
            "text": "With lofty ceilings and lots of natural light, Ol'Days was a lovely place to have brunch. They also had a solid brunch menu with a mix of sweet and savoury options. My friend and I split a Tapioca Bites appetizer and I got a Buddha bowl with added poached egg and chicken breast.\n\nThe Tapioca Bites sort of resembled little cubes of what looked like bread, but was actually a lot chewier as it was made from tapioca flour. They were definitely interesting, but unique texture aside, they were a bit bland. I was only interested in eating two or three of them, so I wish it came in a smaller serving.\n\nI quite liked the Buddha bowl with its large variety of ingredients. The bowl was visually appealing, wholesome, and filling. I regretted getting the added chicken breast though as I found it dry and not very well-flavoured. Also, I wish they could have an option for adding a smaller portion of protein (for example half a chicken breast), as I thought the chicken serving was a bit big, and I would happily pay less for less protein.\n\nMy main complaint for this place is: on the day we visited, the restaurant seemed severely understaffed. From the moment we were seated to the moment we got food, it took a solid 45 minutes. Not only did the servers take a long time to come take our order, but the kitchen also took a very long time to prepare the food. Even though we ordered an appetizer, thinking it would come out a bit earlier, it actually arrived after the mains. This wasn't just the case for our table, but for the tables around us as well. In fact, the party next to us actually got up to leave, as they had been waiting so long for their order to come and they had other plans after the meal. Thankfully my friend and I didn't have anything time-sensitive planned after the meal, and we were happy to chill for longer (although we were getting pretty hungry), but this is definitely not the place to come if you have any plans afterwards."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaU9feFFBEAE",
            "text": "Coffee was excellent, we ordered a cortado and flat white with oat milk and vanilla. We ordered 4 dishes for brunch: the waffle, champ-pancakes, any style eggs, and the Wagyu burger. The eggs any style and the burger were excellent, but the other two were average. Portions were sizable and fairly priced for the area of the city and quality.\n\nThe main issue we had was the service. It took 40 minutes to receive our food and the restaurant was not even that busy. Our waiter did not bother to check on us at all to see if he could get us anything in the meantime nor acknowledge/apologize for the wait."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsa2JYR0ZBEAE",
            "text": "My husband and I came here for brunch with our family this weekend! The food was delicious, flavorful, and presented beautifully. We wish we lived close by to eat here more often! It was so great to be able to get a reservation at a brunch place at a Sunday in NYC. We highly recommend eating here!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzM2FHWWRBEAE",
            "text": "Ol’Days in Tribeca is an absolute gem! I stopped in for a quick pick-me-up before a SoulCycle class, and it was the perfect pre-ride indulgence. The vibe is cozy and inviting, with a menu that feels thoughtfully curated.\n\nI ordered The Cheese Board, which featured an amazing selection of brie, gorgonzola, gouda, and gruyere. The accompaniments—olives, nuts, berries, honey, and bread—were the perfect balance of sweet and savory. Pairing it with a couple of glasses of Prosecco made it a delightful treat!\n\nThe service was friendly and attentive, and I loved the relaxed ambiance of the space. This spot is ideal for unwinding with great food and drinks. I'll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsNy1tNEl3EAE",
            "text": "My wife and I dined in for brunch on Saturday and this place did not disappoint. The staff was extremely friendly and the food was great. The champs pancakes and homemade oatmeal stood out as must haves. The service is table by table so it took a bit longer to get our food but we were fine with it as the staff kept us updated and was an overall pleasure to dine here. We will be coming back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaDlYRDNBRRAB",
            "text": "One of the best brunch spots in tribeca, food is very good. We had Açai bowl and Quesadillas. Açai bowl was one of the best in NYC, they use their own granolas which was very good. Quesadillas was very good too. Coconut latte was a very interesting latte, never had such a different taste in coffee"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMzRucTRBRRAB",
            "text": "I'm glad I found this place. It's farmhouse cozy seating on the first floor & additional tables upstairs. No wait 10 am on a Saturday. Exceptional wait staff. Huge, & I mean huge cup of coffee &just as strong-they even froth the milk. My bacon & pancakes were delicious, & they separated as requested. This was a pretty & relaxing breakfast. Can't wait to take my husband here."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaGE3dGxnRRAB",
            "text": "Totally recommended! Everything was very tasty and fresh! The service is very good and the place in general is very clean, highly recommended for having a brunch in NY!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsN2V2bER3EAE",
            "text": "I came here for the second time, and was disappointed by service - we waited for a simple breakfast for an hour!! I don’t know the reason if it’s lack of people on the kitchen or just poor service, but it’s too much for waiting for simple omelette and sandwich\nFood was ok\nPancake is healthy and very popular, worth to try\nAnd some dishes are overpriced, avocado toast with salmon -$26, really?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOUlHWVlBEAE",
            "text": "Cute place with very nice workers! Unfortunately the food was very mediocre, especially at the price point. A waffle was $16 and tasted fine, pretty chewy. A side of country potatoes was $6. It was tinyy and stale. Look at how small that is in the picture!! I think they gave me the leftovers at the bottom of the fryer lol. I might come back because it's cute and has vegan options but maybe not for a long while."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMS11bEZnEAE",
            "text": "Amazing, healthy, vegan food and such lovely ambiance! Our favorite was the quesadilla. Although it took a little over 20min for the food to arrive, it was worth the wait especially since the setting was so nice. We can't wait to come again and try new dishes as well!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeHZXdDZ3RRAB",
            "text": "Went there for brunch at Sunday morning. Really loved waffle! We also enjoyed the salmon avocado sandwiches."
        }
    ],
    "reviews_count": 80
}