{
    "name": "Industry Kitchen",
    "place_id": "ChIJcaQCwD1awokRuJEpTiEWOtw",
    "grid": "MN1",
    "address": "70 South St, New York, NY 10005, USA",
    "rating": 4.3,
    "user_ratings_total": 3480,
    "phone_number": "(212) 487-9600",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsME1IaHVNemhUWWpaWVRsQnRNRGQxWmkxc1luYxAB",
            "text": "Wow! Thank you for excellent tuna tartar, lobster tacos and chicken quesadillas, but  more important, the excellent service that Emon and Patrick provided along with their GM Aylon. I loved their attentiveness and their friendliness .. It was so worth the trip there!!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVWNTMTNRbmx2T1RWTmMza3dXRlZZYlVSbFQxRRAB",
            "text": "The menu is broad, upscale casual, with a nice mix of familiar and elevated dishes: wood-fired pizzas, fresh salads, starters like octopus or crab cakes, plus more composed entrées.\nIndustry Kitchen\n+2\nIndustry Kitchen\n+2\n\nThe ambience is notable: waterside location, modern design touches (wood, steel, open-feeling). A past architectural write-up described its design under the FDR Drive with reclaimed oak, black steel etc.\nArchitectural Digest\n\nGood for special occasions or a nice dinner out, especially if you value atmosphere (waterfront, stylish interior) and a menu with variety."
        },
        {
            "date": "1주 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSlUyNWxWME4xWWtOUVRYRnVTMFl0U1cwdGVXYxAB",
            "text": "Mooie tent met prachtig uitzicht. Lekkere hapjes en drankjes met goede service! Aanrader!"
        },
        {
            "date": "2주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkc1ZIQkJhbmhMU0hoNmRYY3diMnMwVVU5SFlYYxAB",
            "text": "Abbiamo pranzato in due occasioni e in entrambi i casi ne siamo stati soddisfatti . Buona scelta e cibo di qualità . Ottime birre."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRFpWUmxUR3RxUkdaR00xWlBjRE5aTkhGRWNXYxAB",
            "text": "Excellent location of restaurant. Food is great. Service was excellent. Ambiance was great."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdFl6RmlOQzFIYVVWMmRVUllObkJDYW1sdllVRRAB",
            "text": "We went to industry kitchen with a pretty large group for happy hour without making a reservation. Davion and the staff were so accommodating and got us settled into the tiki bar area which was perfect for our group to mingle and use the inside bar to order drinks and food for our group.\n\nEverybody loved their happy hour cocktails (espresso martinis (yum!),  margaritas, red and white wine, and seasonal beer! Our non drinkers were also loving their hot tea and cappuccino options.  Food was also delicious and great for sharing (margarita pizza, lamb and feta meatballs, and potato wedges to name a few). With the view of the water, great service and food, this place should definitely be on your list to visit!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxd1NIbFFRMWRzZDFaUGRUbEllR0ZzWkZkelVXYxAB",
            "text": "We had the most perfect lunch along the Hudson at Industry Kitchen. Sun overhead, breeze off the water, food that made every bite worth it.\n\nWe ordered ahi tuna nachos, a red tuna salad, and salmon over wild rice. The tuna was fresh, clean, beautifully seasoned — not masked by dressings. The nachos had crackle and crunch to balance the softness of the fish. The salmon was cooked to precision, juicy and flavorful, sitting on a hearty nutty base of wild rice that grounded the plate.\n\nPeople talk about this place for its waterfront lunch views. Outdoor seating by the river feels like part of the meal itself. Many reviews call industry kitchen a great spot for lunch and drinks by the water, often highlighting how the staff make the experience warm and genuine.\n\nTo me the MVP here is how the setting and the service make everything feel elevated. The water views turn a midday meal into something special, and the team makes you feel like you’re exactly where you belong — relaxed, well‐taken care of, enjoying the pause.\n\nWe’ll absolutely return."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRmVGZDFWVk5NYlY5TFNsQmlTV3hqT0VaUk1XYxAB",
            "text": "Food was very good, the lobster tacos tasted amazingly fresh, tuna cooked to perfection - even the burger was smokey and straight off the grill. Friendly service and incredibly quick."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaVkydEhlR3AyZFY5SWMzSnBabVpSYkU5NVRGRRAB",
            "text": "Highly recommend for happy hour between 3pm-6pm. Reasonably priced drinks and a wonderful waterfront view on the patio. Lovely place to just sit and enjoy with friends."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GYVptSjJlRUZ6WVZFeFMyaE1jMjV6U0ZoM1gzYxAB",
            "text": "First time here while passing thru.\n\nIndustry Kitchen is an open air (weather permitting) local restaurant by the water. It is friendly, casual and chill. The service was down to earth and friendly. My waitress took the time to explain the menu options to me. She also made several recommendations.\n\nI tried the grilled lamb lollipops. The food quality appears to be very good as the open kitchen displays care and attention to their craft.\n\nDepending on how hungry you are… You can go with one or two choices. The portions are not overly large, which is fine.\n\nAwesome place to try for yourself."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TlgwZHpkMHREZVhneU9XTjJSRzh0UjIxTExXYxAB",
            "text": "We stopped by for lunch by chance. It was fairly quiet when we arrived, as the restaurant wasn’t too busy. For starters, we had meatballs and potatoes, followed by a tuna Tacos, lobster pasta, and grilled chicken as mains. The food was tasty, though not outstanding compared to other restaurants nearby. The service was attentive and friendly."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTVkyUk1SbUpEZWtSbGRFNTRURmhOT0Y5RGVtYxAB",
            "text": "This place is the best … is very nice, that music is very good. The server is amazing. ( Amon & Cristian  ) I love it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSmRWUlZXVkpGV0hsVFVtMTFORlJQUTFCUmRXYxAB",
            "text": "Great food, beautiful location, ask for Eddy he is the best server and always makes our time here so enjoyable !!!!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKc2JHdG9lVzFPYVdKTlZuZExPV2N3WlZkZmRIYxAB",
            "text": "Comida excelente, deliciosa! Muy buen servicio. Lugar hermoso, vista al mar."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMU4xOVdVamRDVFZSalpVSm1VMDlGYkZad1pFRRAB",
            "text": "Every dish reflects skill that comes from real passion. The chef balances tastes perfectly, creating wow moments with each bite. What you pay aligns with what you get. Their customer care was outstanding. I found this restaurant meets my needs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGZll6bHpXREZ0Y20xclpYZFhhSFJZWjNFNE4xRRAB",
            "text": "Had a great Sunday lunch here with my family. No reservations, walked right in at around 2pm. I had the kale salad and a frozen spritz, but the steak and eggs were also delicious.\n\nJonas, our waiter, was incredibly helpful with suggestions and overall gave us a great service. Would totally come back and thank you Jonas!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ek5IVlBkRGhhZVdoM04zWlRObFJYUXkwNVdWRRAB",
            "text": "Amazing outdoor seating. Great drinks and friendly service. Recommended as part of a visit to lower Manhattan / Brooklyn Bridge and 9/11 area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMVlrUkVORVUwVFRsNVkzVlpTMGRXWlhwVWNGRRAB",
            "text": "I spent 4 days in the area and this was my favorite restaurant I went to. After 90% of the trip being walking and totally overstimulating, I was looking to relax and enjoy the scenery. This hit the spot for for sure. Food was a banger, service was a banger. A little more expensive than I am used to, but honestly the steak was huge and a banger. Could probably even be split between two people, I would definitely recommend it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNlRHd3liMUpSU1hkU1ltMTFOblYwV0VGcE5uYxAB",
            "text": "Went here with my daughter. I am typically a picky eater but this place had an array of options. Customer service is very friendly and super helpful. Love the fact this was by the pier. Would definitely come back here again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeE4yaDRWVU5JVWtaMFZ6Z3piMlpETXpneVQyYxAB",
            "text": "I have been here quite a few times ( typically for dinner) this place has amazing vibes. The view outside of this restaurant at night is gorgeous. Their cocktails are great as well as their menu options. The customer service is top tier, everyone is so nice (shout out to my last waiter Veronica). This is definitely repeat go to spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdVlWTnNaV1l6UVc1UFZIbFBUVUZGWm1oRVMzYxAB",
            "text": "I don’t really write reviews often, but I really enjoyed my evening here. My server Veronica was absolutely amazing this past Friday! She was attentive, friendly, and made the whole experience so enjoyable. The food was delicious, but what truly stood out was her service and positive energy — she made our date night feel extra special. I’ll definitely be back, because there’s nothing better than great food paired with outstanding service, especially in a city where that combination can be hard to find. Also we are excited to work my way through the entire menu and try everything, as this is definitely our new date night spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocFZuSXlVVTR0VlZJM2NrdG5OMFZHY2xwS1lYYxAB",
            "text": "Rice was undercooked. Lobster pasta was bland. Drinks were weak. Major thumbs down. If you want good food, stay away. If you want to waste money on bland food with dry hospitality, welcome."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMVNFaFdjMGRRWDNSTFptZGhlVVpUUzFCNlEyYxAB",
            "text": "Really impressed with this place. Food is incredibly tasty. Friendly service. Would really look forward to visiting again to try other menu items."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcFNsSnNWMjF3UlV3MFgzYzRSVlo2YlVST1MyYxAB",
            "text": "Eddy is the best waiter! He is always kind, professional, and an absolute pleasure. Looking forward to returning again!"
        },
        {
            "date": "1달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GT00yc3dTV3BxUm1vMVR6ZDRVM04zZFd4VlVtYxAB",
            "text": "Buscávamos um restaurante aprazível e descolado para o almoço de domingo. Chegamos por volta das 3:00pm e não tivemos que esperar, embora muitas mesas estivessem ocupadas. Fomos muito bem atendidas pelo Jonas, que acertou em cheio nas sugestões! Muito obrigada, Jonas! Recomendamos aos nossos amigos do Brasil, da Argentina e de EUA!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSGRIcFFOVkp2U1RKTGJqZHpkbVpHTW1GRFlsRRAB",
            "text": "Came in last week for first time with my friends for dinner and had this amazing server Veronica - super friendly, gave great recommendations and so attentive! Loved her service and will be coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5c2JrUTRSa2xJYlVjNVZUQk9WbWM0ZUd4UWNIYxAB",
            "text": "Over all great Expirience , We had a server named Veronica and she took care of us and made sure our experience was one of a kind ! Thank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVVZXWnJOSEZCWVVaaWFXOW5iMWxYY0ZSS1RIYxAB",
            "text": "First time visitor! The food and service were amazing. Our server, Veronica, was great at suggesting her favorites off the menu. She picked out great options for my husband and I! We will definitely be coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTE5GbDVhVGx2Ums5bldtSlBXR3MwYlV4WWVVRRAB",
            "text": "Good foods, good drinks"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pac2NteExSMlUzWHpaS1Uyd3RjakZpZURJM2JGRRAB",
            "text": "This place had rats, I fell off the bench because my son got so scared of the rat coming at him, and all they said was stomp your feet to keep them away, then moved us inside.  The service was slow and no comps for the incident. Truly upsetting and my bum hurts!!! *just to add after I posted this review I read other reviews and found that the rat issue is not new, they have had rats before which now explains why they would simply say just stomp your feet while you’re sitting to keep them away…. Totally unacceptable.  For the prices they charge we should have been at least had attention to have our waters filled….i didn’t even get a cup!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UVRYQmxTMHBoZDFZMmMxVktWVzB6TFVKTk1VRRAB",
            "text": "Food was great but the service was better! Great team ya got there, love love love"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKV2NGaGhOMFp0WjJkZlNuUllhRGhPV214MVJYYxAB",
            "text": "Had the best dinner thanks to Eddie Incredible service from start to finish. He answered all questions and made sure to double check with the chef regarding dietary restrictions. Food was great and is always consistent. 10/10 for Eddie!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbGJtSjNjamhJVmtKTmVIRjVWbGMyVHpCRldIYxAB",
            "text": "Nice waterfront restaurant. Excellent soundproofing job, couldn't tell it was right underneath the FDR!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdVZUUjVhVk5mYTFKM1lqaERUM2h5UzJ4VFMwRRAB",
            "text": "Pretty good capresa."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0YWFFUXhiRUptWm1zeWQwUllZWGRuY1U5eVEwRRAB",
            "text": "Service was great, food was delicious and the view is one of a kind"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQ2VtTTJRbEJXTjJFMmNWTmhNVFZVY21kWlQzYxAB",
            "text": "Everything was perfect the food was great the drink on point"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRlQycFFWVXBLYVhkU01GbDFSVWhFYVVWd2JHYxAB",
            "text": "Spacious restaurant with a river view, equally great for a date or for afterwork drinks. Amazing octopus, cooked perfectly well. Lobster tacos are generously stuffed with lobster, Le Frenchie flatbread was also very delicious. My cocktail was colorful but a bit too sweet. Overall I really enjoyed the dinner."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobE5FbHNORXhNUnpOWE1pMW5hbDlIY0UxeVVrRRAB",
            "text": "Just to point out what others have listed- you will see rats scampering around after the sun goes down. The owner does describe their actions in other reviews ( which I did not read before going with colleagues )  to try and stop the rat issue and places blame on city issues but ultimately … you will see rats.\n\nThe food and drinks were good . No complaints and a fair meal. The location on the water and an outdoor patio were excellent.\n\nHope they ultimately can figure out what to  do with their rat issue as that seems like it will be the downfall of this restaurant—-. You just can’t have that no matter whose fault it is."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdVIzTm1URkF3YjB4dFUxSm5SR05OZFdodFJXYxAB",
            "text": "I had the absolute pleasure of being served by Ryan D at Industry Kitchen, and he made our night. From the moment we sat down, Ryan’s energy, professionalism, and genuine warmth stood out. He was attentive without ever being overbearing, and his drink recommendations were spot on. He was engaging and funny, no notes."
        },
        {
            "date": "1달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tST1ExSkxMVU5zVGpGNFkyWmllWE16Y2s0ellYYxAB",
            "text": "Apos um passeio pela Estatua da Liberdade, fomos ao Industry almocar, super pertinho! Excelente comida, atendimento e o local é belissimo! Jonas um brasileiro querido demais e que tivemos a sorte de nos atender! Recomendo 👏🏼👏🏼👏🏼"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQ1dXRTVOVFV5U0dkTVpqZExRWEF3TTFOb2NYYxAB",
            "text": "This is a perfect place to bring colleagues for a relaxed lunch meeting."
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeVpsbDZORlU1V0dGTlQyRjVUR1o2ZVV0dU0xRRAB",
            "text": "Arrêt pour y déguster une pizza. Elle était bonne, mais service un peu long et prix élevés (comme tout les établissements de New-York) Et la musique est trop bruyante pour le lieu."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSVIwUk1kRXhwTnpSUFNrRm9NekEyVnpSalVWRRAB",
            "text": "Industry Kitchen has amazing views and such a nice vibe being right by the water. It feels really casual and relaxed, which is why I enjoy going there often. The service is always super nice, and their margaritas are a favorite of mine. I really love the lamb meatballs — definitely my go-to dish — though overall I’d recommend this spot more for drinks than food. I’ve tried most of the desserts and wasn’t a big fan, but the atmosphere and location more than make up for it. A waiter suggested I try the quesadillas next time, so that’s on my list. Overall: great drinks, amazing views, friendly service, and the perfect place to enjoy the scenery."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twaVh6aEZhVXhZYVRBME5VdG1SbGhNTUdsWGNuYxAB",
            "text": "Beautiful view of the east river. Service was amazing. Salmon with caesar salad... chefs kiss. Crafted cocktails did not disappoint. Atmosphere was nice but the bees were literally buzzing around the table. But what else could i expect from waterfront dining. 9/10 Definitely would go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VM1JrTmlObXRJWkhGall6Vm1lSGwzZDBkVlZtYxAB",
            "text": "Great happy hour with an amazing view. $10 margaritas and wine"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TmJUWnJlVmt3Um1KaVpYWlpjbTUxVmxaR01GRRAB",
            "text": "Great place for a laid back brunch or dinner, beautiful view of the Brooklyn skyline and the adjacent nyc bridges"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVFJ6TkpWRkpFV1c5aGJEZEtWakkwT0VSYVRrRRAB",
            "text": "Terrible. Found glass in my pizza."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gbk4xOU1XVlpTYmxSc2NYVlVUVmRKWkhweFdVRRAB",
            "text": "Absolutely phenomenal food and drinks here. I ordered a buffalo chicken flat bread, ate it, then ended up ordering another one because it was that good.\nI can't recommend this place enough."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMFNWcDRhWEpaU1U1VVJHeHNkVkF3VkV4YWFIYxAB",
            "text": "Very big Seaport touristy restaurant\nAlways a table is available"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VmN6QjRXVXQzWkRJMlRGOU5NbTB4U1hkU1prRRAB",
            "text": "Whenever I have a moment to stop by the Industry Kitchen, I always feel like for a moment I am by the seaside of some sort of paradise, enjoying a lovely, innovative entrée with a chilled espresso martini I etch mountains and stars with while it warms up on a relaxing summer day by the pier. As if for a moment, time slows down, and I can breathe in the Atlantic/Hudson coastal air, as the music booms soothingly on the stereo, and laughter between friends, loved ones, and colleagues fill the air. The Industry Kitchen is certainly an amazing setting, with the design both interior and exterior being very complementary to the incredible views of the Brooklyn Bridge in the backdrop, surrounded by beautiful gardens, shops, and overall like a brief vacation in between the hustle and bustle. Whether it be a nice lunch/brunch, enjoying happy hour after work, to enjoying a scrumptious top-tier dinner with some of the best cooks and crew, the Industry Kitchen is a gem with the perks of being in such a mesmerizing destination right by the pier!"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrNllybkdBEAE",
            "text": "자유의여신상 크루즈갈때 들렀던 식당,\n저렴하고 맛있는 식당! 뜻밖의 수확"
        },
        {
            "date": "3달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNmF6UmhZbWRYTTAxMU0wWm9YMUZvUzJWeGNsRRAB",
            "text": "음식맛은 그냥 그런데 분위기는 괜찮아요."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNMjd1dGtnRRAB",
            "text": "Nice place to eat nearby the pier. Loved the pizza.\n\n한쿡인이라면 열이면아홉이 타는 자유의여신상크루즈 항구 엎어지면 코닿을데 있는 식당. 가격대가 조금 있긴하지만 맛이조음. 점심먹으러 나온 월가피플 구경하는 재미도 쏠쏠"
        },
        {
            "date": "6달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa29LVDB3RRAB",
            "text": "강가뷰 분위기 기온 바람 음식 모두 완벽"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMzRMZF9nRRAB",
            "text": "웨이터가 서비스 안받음 음식다먹고 계산하는데 30분걸림"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvazZPUjhnRRAB",
            "text": "깔끔하고 이뻐요."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoYVZuWnROSHBrYkhCMGRtSTJOamhaU1ZCWVdtYxAB",
            "text": "From the moment we walked in, the service was nothing short of exceptional. The staff were warm, attentive, and incredibly knowledgeable. Every request was handled with genuine care, making us feel truly welcomed and valued throughout our visit.\n\nThe food was absolutely stunning. Each dish was beautifully presented and bursting with flavor. You can tell there’s real passion and creativity in the kitchen. From the appetizers to the dessert, every bite was a delight.\n\nIt’s rare to find a place where both the service and food exceed expectations. Whether you’re celebrating something special or just looking for an unforgettable meal, this is the spot. Highly recommended!\n\nThanks to Diana, Juan, Eddie, Dustin and all staff whom were very kind and gave us a truly memorable dinning experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbFNVRnJkbGRLYms0MGJtdHRWV3hmUTA1cWRsRRAB",
            "text": "The location is great, staff are friendly, the food was absolutely delicious, and the drinks were enjoyable. Everything started off perfectly for our first dinner out in New York.\n\nHowever, the experience was completely ruined when *three large rats* jumped out of the bushes right next to our table and started running around. It was shocking and honestly traumatic. When we informed the manager, the response was simply, *\"They come from the river.\"* No further action was taken, despite the fact that multiple rats were visibly roaming freely around the dining area.\n\nSadly, while the food and service were great, I cannot recommend this place unless you're a rat enthusiast. For us as first-time visitors, it turned a memorable night into an unforgettable nightmare."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcVRHNUthV0p6ZWw5cVZERlFZVmRMYzFSYVNWRRAB",
            "text": "Great location on the banks of the east river. Service was outstanding. Food was also excellent. The brunch menu had all the staples. Eggs Benedict, Pizza with burrata and prosciutto, bagel with salmon and whitefish were all excellent. Good beer."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oa1VtdGhUbTlWYVZKS1VWWkpRbUpsVUhsYVVWRRAB",
            "text": "Absolutely wonderful dining experience.  We were in NYC for the weekend for PlantCon & stumbled upon this restaurant on our last day, right across the street from our hotel. The best lamb & beef meatballs with feta and taziki sauce appetizer. Phenomenal custom lemon drop martini’s and yes we had 3.Passion  fruit, apple, lychee. The best pizza that easily compares to Italy. Our server Jonas from Brazil provided superb service. He made us feel totally welcomed and tended to our every need. The manager even came by the table. Good people!!!! Hate that we discovered this restaurant on our last day in NYC."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJeWF4ZnpEaFpUTVRBEAE",
            "text": "Cool American restaurant on the water with a huge outdoor area. More than half the tables are outside and some are inside behind open glass doors (plenty of umbrellas for sun). Food was solid, loved the lobster tacos and octopus apps and miso glazed salmon main. Service was friendly and pretty attentive. Overall cool spot especially of you are looking for patio dining."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUFExZGItaU0tOGVBEAE",
            "text": "If you’re looking for a spot in NYC with amazing views and great food, Industry Kitchen in the Seaport District is such a vibe. I went on a sunny day, and sitting outside with the view of the Brooklyn Bridge and the water was just perfect.\n\nThe place has a modern-industrial look—open-air feel, cool decor, and the kind of space where you can chill with friends or go for a cute date. I loved that it didn’t feel overly fancy but still felt like a place to be.\n\nI had the pizza (they’re known for their wood-fired pies), and it did not disappoint—crispy, flavorful, and super fresh. They also have fun drinks and a solid menu with something for everyone.\n\nIt does get busy, especially when the weather’s nice, so I recommend going a bit early or making a reservation if you want to sit outside.\n\n📍 Location: 70 South St, New York, NY 10038\n⏰ Hours: Open daily – typically 11:30 AM to around 10 PM\n💵 Price Range: $$\n🍕 Known For: Wood-fired pizza, cocktails, and waterfront views\n🌟 Vibe: Casual-cool, scenic, relaxed"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKZWs5cGp5elpqSnZRRRAB",
            "text": "We had a lovely lunch at Industry Kitchen in the Seaport district, and it truly exceeded expectations. We opted for the prix fixe menu, which was a great value, well-portioned, and full of flavor. Every dish felt fresh and seasonal, and the presentation was beautiful. The real standout, though, is the ambiance. The waterfront setting, modern décor, and open, airy feel make it such a refreshing spot for a midday break. It’s perfect for a relaxed lunch with friends or colleagues."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUGVrTm5OR2hoWW5wMWFuQXdaRXd4Um10dVptYxAB",
            "text": "I'm really at a loss for words. Everything about Industry Kitchen is top-notch, and I have no negative takeaways (aside from the prices haha). Seriously, one of the best places I have been to, with the service and quality of dishes outperforming places three times as expensive.\n\nOur waiter, Ryan, was absolutely fantastic. He was very attentive, consistently making astute observations and keeping our table taken care of. He also knew the menu and the restaurant very well, making great recommendations and suggestions for us. His depth of knowledge was something that really set him apart.\n\nThe food is likewise wonderful. Given the unique items on the menu, I was not sure about many of the items, but was consistently surprised by just how well each dish tasted. I had one of the juiciest and my most tasty filets of Salmon, and my rice, Bok Choy, and coconut curry were all unbelievably delicious. The rest of my table had equally great dishes. Nothing to complain about.\n\nOh, and I almost forgot, the CAKE, OH THE CAKE. We had a vegan mango blueberry acai cheesecake, and it was absolutely unforgettable. While eating it, I forgot it was vegan. The consistently, taste, texture, and quality were a very competent mimicry of a cheesecake. The mixture of fruits in the cheesecake paired so well together, and was able to avoid being too sweet. You just have to try it.\n\nAll-in-all, the experience was beyond any rating I can give. This has been added as one of my new favorites, and I hope to be back the next time I am in NYC."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSFRFdENZMk54UTFOZldIVXROMUZzY25kNFRFRRAB",
            "text": "Good vibe on the bay of NY city, food is fusion and modern western mixed, you have various choice to choose. And Vibe is extraordinary, ypu can sit outside to see the river and definitely vibrant view on night, lets try it if you visit NY"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJLTVIRC1nRRAB",
            "text": "this place seriously blew me away. The food was so good like, everything tasted super fresh and was packed with flavor. You can tell they actually care about what they’re serving. I got the lobster and it was insanely tender, perfectly seasoned, and just hit the spot. The pasta was light and fluffy, and the spice level? Chef’s kiss 💕 just the right amount of heat.\n\nThe vibe inside is chill but still really put together, and the whole place just feels welcoming. The staff were awesome too, super friendly, super attentive, but not in-your-face. You can tell they really want you to have a good experience.\n\nHonestly, I wasn’t expecting to love it this much, but now it’s 100% going on my regular rotation. If you haven’t checked this place out yet, do yourself a favor and go. You won’t regret it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WmVUUTJiVzkwTmxOVGFFeEtRMFJUVWt4MVpVRRAB",
            "text": "An amazing experience from start to finish! Just the right atmosphere for an evening of good vibes. The Cacio é Pepe Flatbread and Summer Squash Gnocchi are absolutely to die for. But what truly made the night exceptional, was our server, Alberto—a true gentleman with warmth, personality and impeccable professionalism. Highly recommend requesting Alberto as your server. If he’s not on the floor, you’ll find him behind the bar. Head to Industry Kitchen and experience it for yourself—top notch all the way!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJakxlOVZBEAE",
            "text": "This restaurant had great ambience and even better food. No wait time (with reservations). Service from host to waitress and waiter was great. All of the staff were attentive and friendly. The executive chef was great in giving suggestions. The noise level was good, even on the busier day. I would recommend. 5/5."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcXRoOS00cFp1Z3VnRRAB",
            "text": "We came on 5/31/25, before our concert at pier 17. Very clean environment, nice service and really fast. The pizzas, bao buns and creme brûlée were great. Definitely recommend coming here. 👍"
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX0lfcTB3RRAB",
            "text": "Wir haben zu viert dort Pizza gegessen und wurden freundlich bedient und hatten gute Getränke serviert bekommen.\nDie Pizza war ausgezeichnet und auch ausreichend für den großen Hunger.\nDie Spinatpizza war mit frischen Spinat belegt und Zucchini und reichlich Käse. Auch die beiden anderen Pizzen waren super. Ich kann das Restaurant sehr empfehlen!\nMan sitzt mit einem tollen Blick auf den Pier!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacWNGcGhUaTFJTTFWVE1Ha3RWV054VGt4SGRWRRAB",
            "text": "food was good, my favorites were the Truffle Potato Wedges and the Cacio e Pepe Flatbread recommended by our lovely Brazilian waiter 👌🏽😍\nNot getting a five because there was a hair inside of the water bottle they serve."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNk1qaDBhMmc1VWpsTVNVcDVOVFJXYWtONWIzYxAB",
            "text": "When I realized visiting NYC during July 4th was a reality, I immediately knew I HAD to see the fireworks. I had actually booked my hotel a few days BEFORE they announced the show was happening this year and where it was happening. It was happening right outside of my hotel, but there were undoubtedly going to be huge buildings blocking much of the view. I didn't necessarily want to take any chances, so I kept an open mind going into it and made a choice the night before. My room actually did have a view of one of the firework platforms, but there were four platforms and seeing them all together.... Well, obviously, that would be a different experience. The entire area was being prepared for a massive amount of people and so many areas were barricaded off. You could see a lot of it from my window up above Battery Park. The line of people on July 4th in the morning was probably a mile long. It was really cool to see it from up above. =)\n\nOn my first day, I happened upon a spot along the water called Industry Kitchen. I needed to rest a bit after getting lost with my suitcase in Lower Manhattan for an hour because my GPS had no idea what was happening. One Frozee later, I found out that they were having a fireworks experience and they were located exactly in the middle of the four firework barges. It seemed like an easy choice. The show was amazing and the entire night was perfect!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ZmQzVnVNRzFGYTAxcmRFWlFVVnBQWDBaVVZGRRAB",
            "text": "Went here with a large group, and it was a great experience. Everything was great, from start to finish. And this includes the scenery and location. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRGRHODJiQzFNVHkxTVdua3ljVjg0YlY4dFZFRRAB",
            "text": "I got the delicious rib tacos an Industry kitchens last Sunday and had a delightful time. What I liked best, were the vibes. The service was welcoming and friendly from begin to end. The water, people watching and the food were cherry on top. I know where to go if I end up in that neighborhood again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMVYwZGFUVXhrZURoVVJUWkNSR2xMY1haaVkxRRAB",
            "text": "Patrick was our server Friday 8/29- he was so great! Food was great. Views were amazing! We mostly did the prix fixe menu and it was a great value with great options from the regular menu! So good. And Patrick was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMTd1NDNRRRAB",
            "text": "Great view and loved the outdoor seating area! The small plates were a highlight, especially the octopus—definitely a must-try. I wasn’t too impressed with the lamb chops, though.\n\nI’d definitely come back! Plus, they have an amazing photographer to capture memories during your visit. 😀\n\nThey have some good gluten free options!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNlBtQ1pREAE",
            "text": "This venue was fantastic. Seems like the hot spot for great food and drinks. We were in a hurry because we were going to take a helicopter tour and only had 45 min.  At the time we were there, there was a large group of DEA agents for an event.  I let them know we needed to get food fairly quickly. We ordered the lobster tacos and the Bao Bums to share. We were served within 10 min of ordering. The food was fantastic. Flavor beyond my expectations for both dishes, and the server was attentive to our needs. Highly recommend but would recommend taking time to enjoy the view and restaurant  atmosphere more than we had time for."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbllTUG53RRAB",
            "text": "Overall food are so so, the garlic knots doesn’t taste much of a garlic. The Brussels sprouts were eatable. The best of the lamb lollipop which actually tasted good with a hint of sweet and savory flavor. Staffs are very friendly and they have a very cheerful vibe. It is nice and cute that they have set up individual cover for outdoor seats."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNHVPaEZnEAE",
            "text": "WOW! Had a super first impression with my friend Dr. Parlour. The vibe is so friendly and our server Melanie was super cool. The food is outstanding in terms of taste and presentation. I tried the short rub bun , the salmon, chicken and dessert. This will be a great summer spot and definitely will be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvLVozUVFBEAE",
            "text": "Strange name for a fine restaurant. Coming of the soundview ferry this is a great place for lunch. Outside are lots of tables, some in green houses, and inside as well.\nWe tried the braised short rib eggs benedict and the smoked salmon sandwich. Both were worth 3 Michelin stats.\nWould strongly recommend eating here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d2JfdmlRRRAB",
            "text": "My family came here for a quick dinner before catching a ferry at the pier. The view from outside is absolutely breathtaking, and our waiter was very kind. The food was okay, but the alcohol is pretty strong. The restrooms at this place have two doors, but are connected (two doors to the same bathroom), but they are still pretty clean and stall walls go from top to bottom."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdDVfOTNnRRAB",
            "text": "Industry Kitchen, conveniently located on South Street, offers stunning views of the water, making it an ideal spot for a date or people-watching. The open layout adds to the ambiance, and the heated booths provide a direct view of the waterfront. The staff is super friendly, and I had the pleasure of hearing Melanie’s lovely voice as she sang a bit during her shift. I enjoyed the salmon ceviche, a well-balanced small plate with avocado, served alongside nachos. The restaurant is also dog-friendly, which is incredibly convenient since it’s located right behind the dog park I use to train dogs."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKemJXc3hWRlp0Y0V3NGVEQXhRME5uTjBWb1RWRRAB",
            "text": "We had dinner at Industry Kitchen last evening and really enjoyed the experience. Our server, John, was absolutely lovely and attentive throughout the evening. The ambiance is fantastic—especially the outdoor seating with views overlooking the harbor. It’s the perfect spot for a fun evening out on a weekend.\nWe ordered the 12 oz steak, which was cooked just right to medium and full of flavor. The lobster pasta, while decent, didn’t quite live up to expectations. The portion felt small for the price, and the dish could’ve used more flavor and a more generous helping of lobster.\nOverall, great vibes, good service, and a solid dining experience with a few small areas for improvement."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNHAyTGN3EAE",
            "text": "Ok this place impressed me! I just came for an amazing pre-fixe lunch with my friend Dr. Parlour and we had the best time with out sweet server Melanie. We tried the short rib bun, salmon, chicken, and desserts. Do not sleep on this place because we will definitely be back. What impressed me is the attention to interesting flavors and presentation. Cheers to the chef and the crème brûlée. Plus they have a beautiful outdoor setup."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaHFETEZBEAE",
            "text": "My family and I do not consider ourselves fancy or upscale so we decided on the pizza. Normal pepperoni pizza and garlic knots. The food was ok. They have Pepsi so we got diet. Is it normal for lemons to be served in Pepsi in NYC?  Sitting in the mini greenhouse out back listening to the music was great! The service was wonderful!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYX3ZYYWNnEAE",
            "text": "Service is far and above what I expect in NYC. Our server was attentive but knew when to check in on us, and when to give us space. The food was delicious and being right on the water is nice, providing a beautiful view... until the sun goes down & the rats start coming out.  They mainly stay in the boardwalk & didn't bother us but there were quite a few.\nAside from the rats, everything else was great."
        }
    ],
    "reviews_count": 86
}