{
    "name": "Gran Morsi",
    "place_id": "ChIJSYuuSx9awokRyrrOFTGg0GY",
    "grid": "MN1",
    "address": "22 Warren St, New York, NY 10007, USA",
    "rating": 4.4,
    "user_ratings_total": 589,
    "phone_number": "(212) 577-2725",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRGJsTmpRVWRDY0RKeU1ITlliMXBuZDIxNFZHYxAB",
            "text": "Rude staff made us feel unwelcome.\nOur orders were completely wrong.\nDrinks spilled, no apology given.\nOne star is too generous."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWE4xOVhhVFphZURFeVgxbHhXWEUyV1VOQ2JXYxAB",
            "text": "Taco shells burnt, filling dry,\nSpicy sauce? Just a lie.\nRestroom stinks, place unclean,\nWorst meal I’ve ever seen."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swd1ltZFdXRVIxYmxWSVRIUmxiMU5oTTJwVk1HYxAB",
            "text": "Food was bland and overpriced.\nWaited ages for our order.\nStaff didn’t care about service.\nNo water refills offered.\nThe portion size was tiny.\nCompletely not worth the cost.\nUncomfortable seating and atmosphere.\nWouldn’t suggest this to anyone."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjemFWZEZibUU1VVZSYU9HSXhNM05yV21oS1dFRRAB",
            "text": "This restaurant was a disaster.\nThe menu looked better than the food.\nEverything tasted like old leftovers.\nThe staff didn’t even apologize.\nTables were sticky and dirty.\nMusic was too loud to talk.\nSuch a waste of time and money.\nNever returning again."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4d1NuVjFVMlp4Y0ZVMFoxbDBaM3BRVldVMFZGRRAB",
            "text": "I regret coming here for dinner.\nThe pasta was soggy and flavorless.\nService was painfully slow and unhelpful.\nPlates were chipped and not clean.\nMusic was too loud to talk comfortably.\nWe left hungry and disappointed.\nNever coming back again."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toM1NFcEhOM2N5ZEZCRWQzYzVSMUpSV0ROcmFFRRAB",
            "text": "Update:  We returned. We decided to give Gran Morsi a second chance. I have to say that we were pleasantly surprised. I felt that the food preparation was significantly better than our first experience. Each dish was wonderful. We started with the artichokes which were deliciously seasoned, then moved on to the meatball appetizer, also very well prepared, deliciously seasoned. And then we gave the Cacao a Pepe second chance. The pasta was homemade added excellent texture and the dish was quite good.\n\nSo perhaps my first review, which I’ve left below, was a bit off, perhaps we just touched on a bad evening? Perhaps every chef can have an off day, just like the rest of us.\n\nWe’ve decided that should we be in this neighborhood again, this will be our go to for Italian food.\n\nI hope you enjoy.\n\nWe walked in on a Sunday late afternoon, we’re easily seated. Very nice interior, very comfortable environment.\n\nThe overall dining experience was good, but considering the visual impression of the establishment, we anticipated a higher level of food quality than what we received. Caico e Pepe  was not very well prepared, and the broccoli was just ordinary, broccoli, not what we would expect from an Italian restaurant, which would minimally be broccoli rabe.\n\nThe servers were very attentive.\n\nIf you are in this neighborhood, however, I’m looking for an Italian restaurant, I would still recommend.\n\nPizza was fantastic!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSb1NHcE5NbnBsTkhBd01rZE9kMFZ5VERGNVZXYxAB",
            "text": "Too expensive for the quality and experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWV2JrZFdPVXBWVW5CM1RUbHVWMVJ2WVZZd2FrRRAB",
            "text": "Went with some girlfriends and loved it! The food was very nice especially the truffle gnocchi and the arincini. The wine list is incredible. We didn’t love the ricotta focaccia but they immediately brought a new one and it was so good! The service is incredible and everyone is warm and attentive, can’t wait to be back soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NNFFtWldiM2hSTVdNMldHbE1PRUZKVkdsbGRIYxAB",
            "text": "I recently had the spaghetti and meatballs, and for such a simple dish it completely stole my heart from the very first bite. The fresh pasta paired with the perfect texture of the meatballs was beyond authentic. Absolutely love, love, love! Gran Morsi is officially a must-stop for me every time I visit New York."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTlgyNVNVVlF3Vm5Sdk1tRldaa1puVnpGQ1VVRRAB",
            "text": "Grand Moria has such good quality service, along with food and drinks.  The staff is very friendly and attentive!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaV0xVTjNiSEZHVEhSVGJHbDRlRlZHWkVoeVZYYxAB",
            "text": "This place just always hits. Great food, great staff, and the specials are always amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdGNFRTJSMDFhWTFwa1N6TkxUMk4zV1daT1pWRRAB",
            "text": "Amazing local spot.   Service and food were excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxb2RHdzFOVlpOVURZdE1HRTNObkJaVUVsalJFRRAB",
            "text": "Beautiful place . Great service . Delicious food. I will"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRFJtOHdRakl4V1hoUFVsTm5iVlExV1VkMWRtYxAB",
            "text": "Retirement place overpriced food"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oZmF6WmlSRXhSVTFWNWJXVlJkMWRhUW1sMFYyYxAB",
            "text": "Cena del menu de 3 pasos de la NYC restaurante week.   Entrada y plato principal, deliciosos, el postre no tanto.   La cena no termino saliendo los u$60 dolares sino mas, ya que algunos platos le agregaban unos u$ mas... raro."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sS1MydERSWEUzZUhkRWRtNUJSelZXYm5kUU9IYxAB",
            "text": "Phenomenal food and atmosphere with top notch service!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNVVXWjJiM0oxTTJ0dFJFRlZOVlZYVFhGZk0zYxAB",
            "text": "Awesome pasta and cocktail"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ2FFTnFUVkZ1UkdGWU5ESlJlRFJxTjB0Mk0zYxAB",
            "text": "Went here last night for restaurant week and had the best experience. Food was great and the service was even better. Our server, Tanner, made the experience 10x better!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRGNXSmpXRVZ3YlhjMmNIQnpORzVXZDBFelVXYxAB",
            "text": "Good quality food in nice European size portions. The service was really great, and the place has a nice calming atmosphere.\nAnd I found the prices to be reasonable compared to the quality you get."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWGNHcHJTMjlCVjI5cFRubHVaWFpmV1UxMmVuYxAB",
            "text": "After dining at Gran Morsi, I emailed them to let them know I had lost my wallet (I tried phone first but they didn't answer), and they helpfully replied that they had found it, and I was able to pick it up at their restaurant.\n\nHowever, when I emailed them to ask for my wallet back they added me to their spam email list. I have made VERY CLEAR that I would like to be removed and I continue to receive spam from them! If Gran Morsi is reading this, take me off your spam mailing list! Take everyone else off it too while you're at it.\n\n(Also, I strongly disliked the food. Better than spam, though.)\n\nI took a star off \"atmosphere\" because the damaged brick wall with a bunch of screw holes in it was kinda ugly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSmFFRlBValpsUkdKcFREZFRMV1F5U25SMmVtYxAB",
            "text": "We had a large group with us and the staff worked their butts off, so thanks 🙏 for the friendly service.\nThe food was ok but the calamari was pretty rubbery, the pizza was a bit bland, and the various pastas were decent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWWVUaDFWalpoVWxveVJFRjFURFV5TW1aaE1GRRAB",
            "text": "Good food and selection of wine. Slow service though."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTFUxUkVaREJGWDFjMFFqRkVTM2hzVWt0QmFYYxAB",
            "text": "Such a pleasant staff! Great service, wine and pizza. My new favorite spot!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GV1RrWmtTVjlhYUV3dFdVcEpWaTFpU1RSdGJuYxAB",
            "text": "I’ve only ordered in.  The food is outstanding.  The rigatoni with spicy vodka sauce is the best I’ve ever had. The carbonara is not only delicious, but the presentation as a to go dish is incredible.  But beyond all that, on a night when my family were shattered by a scary diagnosis for our dog and ordering late, and the door dash driver screwed up by delivering our food to the wrong place, they were our heroes.  Minutes before closing they remade the order and got door dash to send a new driver and deliver.  We were all so grateful for the fast and very kind response. We look forward to dining in at the restaurant soon."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodVpFOUljVEJCYTBjMGRGaDJZV3d3T0Roa1JHYxAB",
            "text": "Great food, and nice decor but it's impossible to have a conversation as its so loud!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMmZtcHhnRRAB",
            "text": "Food is awesome and the ambiance is friendly. All the servers are fantastic at their job and provided us with an excellent service. Everything on the menu is delicious and the ingredients are freshly sourced! Must go!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SWEzaEphVTlsVkdKaExUWmhTR1ZYTkROR1RsRRAB",
            "text": "The restaurant is nicely decorated. The ambiance is great. The food, however, was just okay. They have experimented with traditional recipes, but the dishes taste weird... it sounds interesting to have fig puree as a pizza sauce, but it tastes too sweet and, at times, tangy. The drinks were interesting, and everyone loved them, but food was somewhat of a letdown.\n\nThis place is pricey. If you have a sizeable group, then Bill will add up pretty quickly..."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNFgzSlNja0pvTFhObk5rUlJTV0oyTlU0MWVIYxAB",
            "text": "I have been shocked into posting a review by an amazing delivery experience. I ordered from a 20 min walk away (my apartment) at 6:50pm and the food was delivered piping hot at 7:09pm. The food was delicious and came so fast. Only in NYC can you get this quality of food in such a timely fashion. We will be ordering again. Thanks a lot"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRE56VndOa1o1ZEd4dE5sRkxTbXgzYjE4d1ZFRRAB",
            "text": "Amazing service and food!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQUEQtdWotNXIzcHd3RRAB",
            "text": "Cheeseburger, cheeseburger, cheeseburger, cheeseburger, believe it or not that’s what they gave us for appetizers in the basement. The cousin of the cheeseburger was the most wilted piece of bread they could possibly find with chopped…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNT0p1Si1Gc0tyRmdBRRAB",
            "text": "I got food poisoning today, visited last night. When we first arrived they somehow ran out of menus and we had to wait at our table for them. Service was slow. It was overly loud, couldn’t hear my dates voice from even just the other side of the table. Worst part was the food poisoning… wouldn’t go back again…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJem96Z3d3RRAB",
            "text": "Best SideCar ever... Rivals The Algonquin's"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaktQb29BRRAB",
            "text": "Got the tagliatelle bolognese and it was awesome! Sooo much flavor! Also got the Broccoli rabe to have some veggies- it was great lots of garlic!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bFB2QnNRRRAB",
            "text": "Ordered on uber eats. Delicious food that stayed nice and hot despite the high prices. Had a Margherita pizza with pepperoni. The dough was perfect. The artichoke appetizer was delicious. The lasagna was amazing and the tagliatelle bolognese was excellent. I think the desserts left a bit to be desired. They were pretty expensive and kind of small, I didn’t care too much for the ricotta cheesecake."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRX18yNmNREAE",
            "text": "Took some clients here for dinner.  Small and intimate. The food was very good and service was good.  Portions are on the smaller side but high quality."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNU1MaF93RRAB",
            "text": "Incredible experience with 10/10 service and 10/10 food. The staff goes out of their way to make you comfortable, and they create a beautiful, fine-dining atmosphere. The food is authentic and original, and it is obvious why this restaurant has been thriving for 10 years in New York City."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN0tud3VnRRAB",
            "text": "You can taste that they are using high quality ingredients. An excellent meal."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM29lMDF3RRAB",
            "text": "Great Italian spot. Made a same day reservation. We got the meatball and artichoke appetizers. Meatballs had a wonderful sauce. Artichokes were very flavorful. The bass picatta was really good. The meat lasagna special was extremely cheesy. Tiramisu was wonderful! Staff was very attentive."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdFpfNzhBRRAB",
            "text": "An intimate, cozy restaurant with great service and good food."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbHZmdmFnEAE",
            "text": "Wow what a great experience.  It’s a bit on the pricey side and you get what you paid for, great service and great food.  Hidden gem!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNjV5djFnRRAB",
            "text": "Date night here was fantastic. The food is delicious. Not too salty but well seasoned and the portions are huge. The drinks were mixed well and after one drink was able to feel a slight buzz.\n\nThe best thing was the service. From the hostess to the general manager everyone was so kind, attentive and  accommodating. Can’t wait to come back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcXNYX29nRRAB",
            "text": "service amazing, food was the highlight of our trip!! definitely stop by if you want a warm welcome and some delicious food. made my birthday special."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNaDlMOGdRRRAB",
            "text": "Quality of the food has gone down from the last couple of years. Can’t really say that I love it anymore."
        },
        {
            "date": "수정일: 10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibjVHTTZ3RRAB",
            "text": "Este restaurante superó nuestras expectativas en todos los sentidos, lo buscamos por Google, llegamos sin reserva, y como tenían disponibilidad nos sentaron, el ambiente es muy agradable, y la comida estaba deliciosa, que por cierto pedimos el menú cerrado, pero lo que más nos sorprendió, fue el gran cuidado a los detalles por parte de los camareros y de el encargado, te explican la carta y el menu, te limpian la mesa con el cambio de cubiertos, están pendiente en todo momento de tus necesidades, la mesa de al lado se puso un poco ruidosa y nos ofrecieron cambiar a otro lugar, terminamos comiendo el postre en la barra y todos estaban muy pendientes, se nota que se preocupan por dar un buen servicio, los recomiendo 100% y espero volver pronto."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2X295M2JnEAE",
            "text": "We arrived for a dinner reservation and were seated. We attempted to order a bottle of wine and some appetizers when the waiter belligerently commanded that we needed to place our entire order for the evening at once since they had \"an event\".\nAll food would be brought to us at once, take it or leave it. We left it! Unbelievable arrogance!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2b082bU9BEAE",
            "text": "Good spot for holiday parties"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQclpQNlRBEAE",
            "text": "Very good spot.   Had a nice time,  service was great.   Not a huge menu, but we made it work...."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaHVfQXdnRRAB",
            "text": "Excellent place. I had fish of the day and was delicious. Wine was very good and fairly priced. Service was warm and professional. I would go again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcUpQdkFnEAE",
            "text": "Discovered this spot walking by and was drawn in by the warm and inviting ambiance. The food was delicious but what I was truly blown away by was the phenomenal staff. Above and beyond in every way, especially Carlos and José behind the bar. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ3ItVmtRRRAB",
            "text": "Food and atmosphere were fine but the waiter (long hair had black earrings) was incredibly disappointing. It was loud in there (a table of 12 screaming top of their lungs) so I couldn’t hear him well and I asked if we could put drinks in, he said “as I just said, I will come back and take your order”. Right off the bat we didn’t appreciate the attitude that came out of no where. From then on, everything we said to him seemed like an inconvenience. We asked if we could put in appetizers first and he said no we must order everything all together. Found that really odd. Cherry on top was once we finished dinner he was no where to be found. Turns out he LEFT and the food runners helped close out our table. We won’t be coming back as there are so many other options in New York."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaE1idDBnRRAB",
            "text": "Excellent!! I loved everything from this place. All the staff was amazing , the host, the server, the helpers, THE FOOD. I had the best mocktail of my life, my boyfriend got a spicy marg super good too. I'm not a tiramisu lover but the one here was to die for! and the exquisite pastas. I highly recommend this place 10/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z3M3SXNBRRAB",
            "text": "Really great food here. The restaurant itself is beautiful and the staff/service were excellent. There were 7 of us for a work dinner and we chose the family plan option which worked out great for us. There was plenty of food for all of us. The meatballs and ricotta appetizers were excellent. We also had the fig pizza which was good but just a tad too sweet for some. The steak was very good and the squid ink pasta was my favorite. So tasty and a little spicy. The desserts looked great but they were just ok when we ate them. Overall I really liked this place and will hopefully be back for some more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEc0p1bmRREAE",
            "text": "Loved this place. Been living in and around NYC for the last 7 years and this was one of THE BEST Italian spots. People so “oh yeah west village is so good, blah, a lot of those spots are same same but different. Gran Morse had immaculate vibes, incredible service, and food that was delicious without being pretentious.\n\nThe Caesar salad is a must try, with kale and mixed/smushed together it was everything you want in a Caesar yet different, and delicious.\n\nMeatballs and burrata were really good, very tasty and of quality, the reviews didn’t lie\n\nThe truffle/mushroom pizza was also surprisingly really good and I’m not even a huge fan of truffle\n\nThe special of the night this longer rigatoni type spicy vodka was the best item. Perfectly al dente, with the perfect amount of sauce and spice, little bit of cheese - this took it home as the best dish for sure.\n\nAll in all a great experience for a dinner with a few friends, with service was something you don’t expect in NYC  - no rushing and trying to make sure you’re comfortable and have everything you need. Almost didn’t write this review, wanted to gate keep this place, but it’s too great a place to not share. Peek the photos, no lie this place is amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6ellLTnNRRRAB",
            "text": "My husband and I had an amazing dinner here tonight! We were in town for the night and had the pleasure of dining here. Food was incredible, everyone was so nice & welcoming, and the ambience was so pretty and relaxing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaa2FDdV9RRRAB",
            "text": "Visited here as part of a large party. We sat outside on the sidewalk (although it was enclosed so still felt quite intimate).\n\nThe food was excellent. We had a wide variety of different dishes with each course but everything we had was amazing. The meatballs were particularly good.\n\nGood choice of wine too. Staff were very helpful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSaGIyaktBEAE",
            "text": "I'm starting my review by raving about the Caesar salad. It's served as a beautifully molded piece topped with shaved parmesan. Everything here was good but somehow this was the star.\n\nAlso had the foccaisa - which was very tasty and came with a marinera dip. Wife had a pasta that she enjoyed - but again - was hard for anything to compete with that salad 😅\n\nDid try the ricotta cheesecake - was good but think it might have needed a bit more cream on the side. I'm sure I could have asked for it.\n\nThe Paloma cocktail was solid and the decor was nice. They did one of those cool plants on the wall things, which despite being done all the time I'm always like 'wow, look at that'.\n\nCame here for a date night with the wife - looking forward to coming back, especially since it's an easy walk from the Occulus.\n\nOh, and staff was super nice and attentive. Place was busy but thankfully didn't need to wait years for the check."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJa3V6Q2dBRRAB",
            "text": "Overall good service. Classy, laid-back ambiance. The food was hit or miss. The eggplant parm lacked seasoning and flavor. Their special of the day, which was pasta with white truffles, didn't have much of truffle flavor at all and surprisingly the worst dish of the meal. Their meatballs were really good; tender and juicy inside with great sauce. I liked the chicken parm the best. The chicken was cooked perfectly and the sauce was amazing. The other pastas we ordered, garganelli and tagliatelle, were both pretty good, too.\n\nThere was an event on their main floor and towards the end of our meal, at which point I'm guessing our server got busy because of the event, the service was very slow. Our server was nowhere to be seen and we had to raise our hands and holler to get our check after having waited for a while. She was very attentive in the beginning, though. So overall a good service but not great.\n\nOne thing that was strange to me was that when we ordered focaccia bread, what came out was this very flat bread that looked more like pizza dough or naan. I was more disappointed than puzzled because I was looking forward to enjoying the more common type of focaccia. Upon being asked about it, the server said it was a special type of focaccia. ¯\\_(ツ)_/¯"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbHRPNk93EAE",
            "text": "I had a great experience dining at the Gran Morsi. It certainly passed the vibe check for the night. Gran Morsi had an upscale feel, yet felt cozy and somewhat casual.\n\nThe staff and waitress was very friendly and pleasant. I wish I remembered our waitresses name, because she made our dining experience very please.\n\nThe food was incredible, I ordered the eggplant parm, which I would argue was better than most chicken Parmesans I have had in the past. The red sauce was perfectly seasoned and not too sweet. Our waitress helped me select the perfect wine paring to go with my meal.\n\nMy date ordered the pork chop and it had one of the best fresh of the grill tastes I’ve had outside of a backyard barbecue.\n\nI’d define it return here with a group or for happy hour any time!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtN2QyZllnEAE",
            "text": "Went here for a restaurant week dinner with friends. We were seated quickly after they checked our vaccination cards. I got the polpette as the first course, half chicken as the second and chocolate budino as the final course. My friend got the ceasar salad, branzino and tiramisu. The chicken was a little less seasoned than what I prefer. The other dishes were pretty good. The servers were very attentive. We also got a couple glasses of wine which were great. The restaurant is on a pricier side for their offering."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtc1ktY0xBEAE",
            "text": "Great place! We actually had our wedding there this September, and we went there for New Year's Eve dinner! Great food, nice people!\n\nUpdated to add some pictures :) Thanks again, a year later!"
        },
        {
            "date": "7년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3NXZMc0FnEAE",
            "text": "Italien de quartier où déjeuner si l on est dans le coin. La pizza est bonne, la croûte croquante, la poulet mozza est très bien aussi (et très copieux). Les calamars en entrée étaient en revanche un peu cuits. Service très agréable et la décoration est lumineuse.\nJe recommande."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLamN5N2tnRRAB",
            "text": "Wonderful place for Italian dinner in the city. We had octopus, short ribs, pizza, meat balls, squid ink pasta!  They practice social distancing! Indoor and outdoor eating available!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzMG9QTURnEAE",
            "text": "Pretty good! I was a fan of the baby arugula salad; it tasted light and fresh. The gluten-free bolognese pasta was passable. I wish the noodles were cooked closer to al dente and that the sauce was a bit more flavorful. Great environment,…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNheXM2SDF3RRAB",
            "text": "Went for restaurant week to Gran Morsi and we really enjoyed the food here. We tried the market salad, buratta, sopressata pizza, gnudi verde. For dessert we had chocolate budino. Great ambiance and excellent service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPc0xuWUR3EAE",
            "text": "Hosted a 90-person private event here recently and had a great experience. The events team was really flexible and patient with my many requests in the couple weeks before the event, and always responded quickly. They also crafted a customized menu to accommodate for specialized diet needs in the attendee group. I requested slightly elaborate place settings with favors and the staff set it up beautifully. The food was very good and the mixed drinks were strong. When I accidentally dropped all my tented place cards and they fell out of table order within seconds of the event starting, the  team helped me gather and re-order them so that we could get attendees in as quickly as possible.\n\nThe private event space is in a basement (which is common in NYC) so there are no windows... but there's a lovely green living plant wall which is a nice touch. We needed a microphone for speeches and it kept cutting out, but they worked to fix it quickly. The open wifi wouldn't connect, so I wasn't able to stream my playlist... though the restaurant's music was just fine in the end! The space holds about 100 people, but I think 80 would be the ideal number.\n\nOverall it was a pleasure to plan this event with the Gran Morsi team and I'd definitely consider bringing another group back here. The event team was honestly awesome."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNveU1PVlBREAE",
            "text": "I have been here for a group event and returned for a dinner. They have an impressive wine list, carrying more than just the typical styles of wine you see elsewhere. Really nice portions, I liked the ratio of meat or veggie to pasta when ordering dishes that contained both. The waiter and the bartender were excellent and very helpful."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbVBYQ2NnEAE",
            "text": "Came here for the first time with a friend and everything was pretty good. Pizza is okay, service is okay. The music they played was really good along with the overall ambiance. It seems like they actually take care of their flowers. They have covered outdoor seating and staff wore masks. I had the Cacio E Pepe and Grapefruit Spritz which were really good. Tiramisu was amazing. But I also kinda expected more from an Italian place in this area."
        },
        {
            "date": "7년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbmFlUXVBRRAB",
            "text": "Nous y sommes allés après avoir traversé le pont de Brooklyn, nous sommes arrivés vers 20h45, nous avons été bien reçu et surtout très bien mangé ! Les plats étaient excellents 🤩.\nService plutôt rapide 😉\nPtit plus :  la dame au bar parle un peu français et espagnol."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bTkydTB3RRAB",
            "text": "Waiter so kind, dots I really good, no waiting, good wine, romantic and chill atmosphere, price no expensive. It's a really great restaurant. I advice it for special occasion or romantic dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c2F2VzlnRRAB",
            "text": "Loved this place! Went with my friend and everyone was so friendly (even when we showed up in sweaty workout clothes). Host, waiter, etc were all lovely. Cacio e pepe was delicious. Great outdoor seating as well."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBby1QZXh3RRAB",
            "text": "Great service especially enjoyed the fig salad nice texture and flavor combination.  Very open feeling in this restaurant.  Pleasant list with ample selection.  Main courses are varied between Morsi-pizza, pasta and Grandi.  I enjoyed the Garganelli main course."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSd3NPMEZREAE",
            "text": "Caesar salad was amazing, everything else was just good. Space was really nice and intimate! Will return"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1eHZmTVJnEAE",
            "text": "Went there on Restaurant Week, the three course menu was amazing! Drinks are good too"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOUltVlFREAE",
            "text": "I was there with my parents visiting from Italy and we are very picky. We took 3 of the 4 pizzas on the menu and all were very good. I usually avoid pesto pizza as it is very \"technical\"... that one was super."
        }
    ],
    "reviews_count": 74
}