{
    "name": "Tara Kitchen Tribeca",
    "place_id": "ChIJoz4wBFFbwokRpkJ9fa2n4i8",
    "grid": "MN1",
    "address": "253 Church St, New York, NY 10013, USA",
    "rating": 4.6,
    "user_ratings_total": 231,
    "phone_number": "(212) 226-4400",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MU5XUTROM1JrVEV3MFIxSlNWM1I2VjBobU1sRRAB",
            "text": "Most excellent lunch experience- real food cooked from scratch up, great & friendly service and reasonable price - highly recommend!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bk56UXdMVTkwVURCUlVFRklVVTVVYmxWYVpWRRAB",
            "text": "The food here is very good! The drinks are great. The manager was so nice. We had the lamb tagine and it was so tasty and tender meat."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zd1QzUkZjRW81UmtWSlpHbDNXWFp6ZFZRMU9FRRAB",
            "text": "super cute atmosphere and incredible, generous service. We didn’t eat a ton of our food just bc we were semi full from a pre dinner snack lol and there was somewhat of a wait for our food to come out/they didn’t have the burger I wanted, and not only did they give us a free round of drinks they took all our food off the bill. Highly rec this place, v solid food and lovely staff and vibes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTWNrSkxSMEpSWTNvMlFUTkRTVGgwU0c1c1kwRRAB",
            "text": "Went here with a group of coworkers. Great food and nice atmosphere! I will be coming here again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORExURnZSVmsxY1ZkQmVIVTJTVTVRYlUweGNWRRAB",
            "text": "Amazing place. Hard to open the door ! Push hard!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSQk5uSnpXWHAxZFMxcmRGRlliREJaYkZOa1kyYxAB",
            "text": "The food is great! Good options, generous portions. Really like it. Also the service was very very good. Highly recommended"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsYU1XbGlkVmRZWmtaSExVMTNhSEZMYjJWV1JHYxAB",
            "text": "Excellent place and the food is so tasteful. The vibe is nice and relaxing. They were so nice to provide complimentary dishes as well"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSlpXdHRlRGxQUzJFMGJFdFJXWGxaUm5oWVNtYxAB",
            "text": "This place was delicious! Great vibes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNVMxUkRlSGRuYlY5bFVYUXhPSHBPYURKWFZsRRAB",
            "text": "Thought I try place out but sat at bar for 10 minutes and no one tending bar and just one guy talking on phone.  At least give me a menu, but nothing, just ignores me like I don’t exist.  Got my butt up and left but he doesn’t seem to care so why shud i?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMUxWSkxSVzFYV1hSVk9IZEdkREZSU1dob2JrRRAB",
            "text": "My first Moroccan food and it was amazingly delicious.  Mouth watering.  Carrot and ginger soup was outstanding.\nSalad was delicious.  Main course was Lamb with potatoes, scrumptious."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdFBuQVBBEAE",
            "text": "We visited this Moroccan gem as a group of 8 coworkers to celebrate a birthday, and it was such a lovely experience from start to finish. We made a reservation two days in advance, and when we arrived, they were ready and waiting for us, such a great first impression!\n\nWe ordered a variety of dishes: rice vegetarian bowl, boneless chicken, golden chicken, shrimp pil pil, Moroccan shepherd’s pie, and lamb kebab. Every single dish was flavorful and satisfying. I personally had the shrimp pil pil, and it was perfectly spicy with a rich, bold flavor, just the way I like it. The portions were generous, and we didn’t have to wait long for our food, which made the whole experience even better.\n\nAfter such a hearty meal, we were hesitant to order tea, but we’re so glad we did! We shared two pots of Moroccan tea, and it was the perfect way to end the meal—refreshing, great for digestion, and served in the cutest little glasses.\n\nThe ambiance was authentic and full of charm, with a warm, welcoming vibe. The staff were incredibly attentive and kind, even surprising the birthday guest with a beautiful slice of cake, a candle, and a sweet gesture involving singing, such a thoughtful touch!\n\nWe’re already planning to come back and try more dishes. Highly recommend this place for anyone looking for delicious Moroccan food and a genuinely lovely dining experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ob1FWQnJPV1pvZVhoSVUwaHNPRFp3VEhOWGQyYxAB",
            "text": "Loved appetizers including the chicken shawarma hummus. The pita bread was sooo fluffy and delicious! Also the shrimp appetizer (forget exactly what it was called) was also so good — these sauce was amazing. Aside from that the entrees —I got the eggplant — were ok, not as good as the appetizers."
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aM09VRnRNblZZVm1aQlJ5MWxZMk5yYUV4Q1JVRRAB",
            "text": "Uno dei migliori ristoranti di NY per amanti della cucina marocchina.\nAbbiamo preso tutti i piatti a base di verdure ed erano ottimi! Personale gentile, ottimo servizio, buona scelta di piatti tradizionali della cucina marocchina e anche dei vini, cosa non usuale in America!\nSuper consigliato! 👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oemIyRkljbEJZTW5CS2RtUmFkWGhPUzFOM1JWRRAB",
            "text": "The food at Tara Kitchen was delicious, and Omar was super nice and welcoming. Great experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeFpXMHhNMnhQWWt0U1ZFaGFNM2x3UjFBNFRXYxAB",
            "text": "Authentic Moroccan food in a cozy, vibrant space. The tagine was rich and tender, and the flavors were spot on. Great service, generous portions, and a true taste of Morocco in NYC. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeE5ETmZXbGxRTW5CeFUwTXphM0p0Y1ZoRWNXYxAB",
            "text": "I have to call out Omar, our waiter, who was the most attentive, but not intrusive, sweet. and helpful. The ambiance in Tara is awesome and the food is divine. I had the cuscus dish with added lamb and it was the best I ever had. The flavors, with added almond slivers, sesame, and chickpeas were special. we ordered the Bastia for an appetizer which was a wonderful mix of sweet pastry with ground chicken and dried fruit. The dessert choices were a bit less enticing- I expected a light pastilla which is a traditional flaky pastry filled with either chopped lamb or other protein- with almonds and raisins. It's airy and served with powdered sugar.. but that wasn't on the menu. We ended up ordering a guava/ mango cheesecake which left us wanting more of a guava/mango taste. Overall, a wonderful culinary experience and highly recomended."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMVFYaEVWelpoUWpnNU5HcGxkbVZWVkdsZlVVRRAB",
            "text": "Amazing food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNGEyOU9ZMnRFYW5OdWNEUlBNRVphWjFGa0xWRRAB",
            "text": "Great experience where service, food and drink, and atmosphere was great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNE1FTkVZbEEzUWpWb2RFNWlZbWRLTlRKUVZIYxAB",
            "text": "Perfection! Great food, great service, great ambiance, other patrons weren’t too loud (because the music wasn’t too loud!). We ordered chicken harissa for the appetizer then for the main course we ordered lamb shepherds pie and lamb kebab, all of which was very tasty and boy, their portion–for the price–was generous! On top of that, if you drink, the have all-day happy hour for 5 bucks! You can’t beat that. Service was very friendly, warm, profesional, and quick! Again, the volume of the music was so important because it was not too loud and everybody didn’t need to yell. What a perfect Friday afternoon. Thank you Tara Kitchen! Btw, since the portion was so generous, we didn’t have space to order dessert. Next time tho. Oh, and sorry if the photo of the chicken harissa was blurry."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeFMzZDVUa2hDTm13MVdHeEVZMGs1YzNabmNVRRAB",
            "text": "Such a great lunch deal for the area! Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21walZISmlWamsxWDA4eWREaGZNSEZOUW5SalNHYxAB",
            "text": "Amazing food and vibes. Very cozy atmosphere!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNFRtTnhWbE5zU1ZsaE0xTlJjbFY1YVdweFVIYxAB",
            "text": "really good taste and beautiful decor"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSlRuVllhekpwWlZOWVpUSkNjRFpXWHpaSFJuYxAB",
            "text": "The food and ambiance are amazing! Especially the Lamb tagin it is so good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTFJIaDFXRU5OWTJKeGJXNWZZV1ZGVTFneVEwRRAB",
            "text": "What an absolute gem of a place!! The food is colorful, flavorful and beautiful. The service is kind, attentive and comfortable. I never felt rushed, which is very unlike every place in NYC. It is just one of those places you want ro stay because everything is just....comfortable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSlQwdHBZMm90U0dOV01GRklTR1JRUzJSYVpuYxAB",
            "text": "It was a hot Saturday night at 6:30pm, and we had the most delicious, aromatic, perfectly plated, nicely served dinner. Our waiter answered our endless questions and shared great recommendations. We felt like the cook was thrilled that we ordered too much food because there weren't many people there.  Don't overlook the essential tomato salad. The salmon was perfect.  And the  fig& fire chicken tagine was an absolute star.  Our friends loved their food as well. Oh and even if you think you don't like couscous,which a couple of us were meh on, you have to try the couscous. Yuuummm.  An A is on the window, the music- perfect, the decor charming, & it is easy to get to.  We will go back💯"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObWVtTlhkV1JxYUd0VFUyYzJOalZzZVhNdE1YYxAB",
            "text": "This is the spot for me and my girl. We always come here because she loves it. Food, service, atmosphere - everything is perfect! It’s one of our favorite restaurants of all time. We usually get the fava bean salad and a few tajines. It’s always a perfect time"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treVgybFZRbGcxZDIxd09HNDFSMnhWV0ZsMFdXYxAB",
            "text": "Just stopped by for a quick bite loved the fig & Sage Manhattan and the bouillabaisse\nWill be back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNWJGbHVSRWd4ZWxsTVFraHNRM2g1WkRsbVptYxAB",
            "text": "Took my wife here for our anniversary and had a great experience. The food was AMAZING,! The fries were good but the dip was even better. We've never had hummus that tasted so good. My wife enjoyed her  stew lamb. We both fell in love with my spicy mixed vegetables which was mixed in spaghetti. It was so amazing she ordered some to go. I ordered the lentil soup to go and that tasted so great and she also ordered the braised lamb to go. Everything was amazing including Omar who served all the guests by himself. Even the drinks were good. My wife loved the lychee Martini while I had whiskey mixed with black fig liqueur which was top tier. Everything here was original or made in-house. I definitely recommend this restaurant and will be going back really soon."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMlJFWnRUMnB2TVdOb1lrRkhSemRhVEhoeFJsRRAB",
            "text": "I have been walking by this place for years and finally their  $5 happy hour till 9PM peaked my interest.\n\nDrinks are unique and SO good recommend their pistachio cosmo & salt and pepper martini.\n\nShout out to Omar, he was so sweet, attentive and made great recommendations. I would 100 % recommend this place.\n\nI also recommend their did and burrata salad. *chef’s kiss*"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMR1FsTkMza1pXcjBRRRAB",
            "text": "Amazing place, fantastic food - we will come back!!! 👍🏼😍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLeUcxWm1mb2JMTzB3RRAB",
            "text": "The service here rewrites what I expect from dining establishments. The restaurant offers a special atmosphere. The workers never dropped below excellent service. The restaurant delivers quality consistently. I can't wait to dine here in the future."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYlZ2TzY2Mk1HbjVRRRAB",
            "text": "Everything was delicious! The service was great (shoutout to Omar!). Omar gave us a disclaimer and explained that the meals were inspired by Moroccan cuisine—since the incredibly talented and passionate chef lived there for many years—but that they were different from the original recipes. As Moroccans, we were pleasantly surprised and loved all the meals: briouates, meatballs, tanjia, rfissa, and a third one (a sweet and savory chicken tajine). The Dubai chocolate-inspired dessert, the kaab ghzal cheesecake, and the Jouhara were also delicious!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLTHF2OVQ2MzhfbHFRRRAB",
            "text": "This place was so cozy and cute. The food was amazing and so was the service. This was hands down the best food we had on our weekend trip to New York!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYTc2ZnFsdnJUQ1FREAE",
            "text": "If you're looking for Moroccan style food, but in a modern way, this is definitely your place to go with full flavors on your tongue, the best food in the city honestly, and very healthy too. Being Woman owned makes it 1000× times better! A must place to eat in the city, hands down, never disappoint 😎 Check out our video and follow on Instagram @JadaExploresAll"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOcXlqSkNNcTV1THlnRRAB",
            "text": "The fish and shrimp tagine and the 7 vegetable cous cous are so delicious with complex and deep flavors. The rice is really tasty too and pairs perfectly with soaking up the extra sauces. Definitely one of the best restaurants in Tribeca."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQQ2ZxdHpFenB2by1nRRAB",
            "text": "Absolutely loved Tara Kitchen! The food is full of rich, authentic Moroccan flavors and beautifully presented. Service was warm and attentive. The atmosphere was cozy and inviting and Omar made the experience even better with his friendliness and great recommendations. He’s awesome! Can’t wait to come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJN0swdG5mNi1yTXlRRRAB",
            "text": "Tara’s Kitchen is a hidden gem! Amazing flavors, cozy atmosphere, and top-notch service. Omar and the team make you feel right at home. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLenE2OG1TMDV5Vi1BRRAB",
            "text": "Great food on every section of the menu and servers and chef were very friendly"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQanh0LWJQczRfOHdRRRAB",
            "text": "Mediocre food. Not true Moroccan. The cook literally is Indian and went in vacation in Morocco which inspired the restaurant."
        },
        {
            "date": "6달 전",
            "language": "ro",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd3M2Y1NBEAE",
            "text": "Excelent!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveFliRjZBRRAB",
            "text": "The waiter’s hospitality was great, attentive and kind. However, the food was of greater disappointment unfortunately, no resemblance to authentic Moroccan food other than the name of the food itself.\nThe couscous seamed not steamed at all, and I've never seen a 7-vegetables couscous with eggplant and brocoli 😒, also the sweet and spicy sauce on the kebab! That was definitely new🥴!\nI was expecting a lot more for the price I paid.\nI am not going back to this place ever, and wouldn't recommend it either."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2ZmYndRRRAB",
            "text": "Absolutely phenomenal space!\n\nI really loved all the flavors and life that the menu has, especially the lamb.\n\nCan’t wait to come back for more!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdWYzOFdBEAE",
            "text": "It’s a small cozy place. The server was super friendly and sweet. I’d say the food doesn’t stand out but its not bad either."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveWZxUUNBEAE",
            "text": "i contacted this restaurant looking for a catering service for my upcoming office event and they invited me to come try the food i can’t even tell you how impressed i am right now leaving this place the food was beyond omar even got us non menu items we are leaving excited about the catering now"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveWJxMldREAE",
            "text": "The best food ever!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvenR5WERREAE",
            "text": "This was my first time at this establishment and I must say the food was delicious I met the Chef and Tony the bartender made awesome lychee martinis. I recommend here for great Moroccan food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNva3RhdGlnRRAB",
            "text": "Absolutely loved my experience at Tara Kitchen! The food was flavorful, authentic, and beautifully presented. Every dish had a perfect blend of spices that really brought the cuisine to life. The service was top-notch—friendly, attentive, and genuinely welcoming. The space is beautifully decorated. Whether you’re a fan of Moroccan food or trying it for the first time, this place won’t disappoint. Highly recommend!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJLTRQR2hRRRAB",
            "text": "Cozy sexy delicious will be back love the vibe a lot.\n\nThis place is seriously amazing. The Moroccan food is out of this world — super flavorful and beautifully done. The cocktails are super creative (and strong in the best way), and the vibe is perfect: warm lighting, great music, and just the right amount of buzz. Definitely one of my favorite spots in NYC right now."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJN3ZubEh3EAE",
            "text": "Delicious food! and the waiter is so kind and helpful. A really nice surprise i ran into in Tribeca"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJejhYakR3EAE",
            "text": "We had a delicious lunch at Tara last week.The food is amazing, the staff is wonderful and the atmosphere including the music are fantastic. Thank you all"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bnJtVHZnRRAB",
            "text": "New favorite restaurant in town! Incredible food, what a delight! I thoroughly enjoyed the salmon Tajin, in a delicious red sauce of tomatoes, spices, and capers. My boyfriend ordered the chicken with vegetables, which I tried, and it was also delicious, so exquisitely seasoned! Next time I come, because I'm definitely coming back, I want to try the orange salad. We were served at the bar by Horacio, a very kind Mexican who speaks perfect English!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndWY3MkdBEAE",
            "text": "Wow, what an experience this was! This is definitely one of my favorite restaurants in NY, I wish I had discovered it earlier. The food was so delicious, I can’t quite name my favorite because all of them were favorite! We got some pita bread with dips, carrots with hummus (which was far from the ordinary), egg rolls (wow! maybe my favorite?), chicken sandwich, orange salad, mango dessert, and more. And I shouldn’t forget the cocktails! Go for the salt and pepper martini if you like non-sweet drinks. The service was also outstanding. Omar really made us feel welcomed and took great care of us. Will be counting days to my next visit…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidXQ3QkRBEAE",
            "text": "I had an amazing meal at Tara Kitchen. I can for brunch and had my favorite. Shakshuka. A Mediterranean tomato stew with eggs. For me one of the best breakfasts one can have.\n\nAt Tara Kitchen the dish is greatly flavored with some exotic Moroccan spices and was amazingly delicious.   As I loved the place and hung on for a while I got to try some of their other signature dishes. Yummmmmmelicious !\n\nAs i staid I tried a cocktail here and it was just as good. 😊\n\nA real hidden gem.  Totally loved it 😍"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaFlMWjl3RRAB",
            "text": "What an amazing place!\nHad dinner there on Saturday night with friends.\nA beautiful restaurant with such a cozy atmosphere.\nCocktails were delicious and looked beautiful! But food, wow! We loved everything we had. We started with their delicious olives, Mediterranean spread with pita bread, orange salad, eggplant dip and shrimp. Everything was delicious, really can’t pick just one dish.\nAfter we had two different chicken Tagines and that was amazing!!!\nFor dessert we had mango guava cheesecake and chocolate lava cake, both very very good.\nSpecial big thanks to Omar, he made this experience amazing with his exceptional service and hospitality. Thank you Omar, keep doing a great job.\nGreat experience, amazing hospitality and delicious food. Will definitely be back, soon."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScXJhYlB3EAE",
            "text": "We had some wonderful food here. Have not had Moroccan food in quite awhile. It was very good and a lot to choose from which can be a bit daunting. We had a Pulsd coupon which we had no problem with. FYI: On the coupon though it says you must call to make a reservation but when I called I was told they did not take reservations. No problem. We both enjoyed our selections for entrees. Spicy was spicy. The Moroccan wine was very good as was the mango cheesecake we shared for dessert. The servings are large so we took some home and it was almost better the next day reheated which is a sign of some great cooking. My only complaint was a waiter was not the friendliest. Maybe it's a flaw on my part but I dislike talking to someone who seems to be looking away like there's something better to do. The other waiter was much more attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNILWJmcjVRRRAB",
            "text": "I found this place with the Seated app and am blown away by this place. The orange salad, lamb chops, Shepard pie, and cheesecake were exquisite. Additionally the service was great and prices not an issue for portion size and quality of food. We will be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqd3RmX3RnRRAB",
            "text": "I had a great time at Tara Kitchen! The staff was really friendly and the food was super flavorful. We ordered the mechoui lamb shank which was cooked in a thick delicious gravy and served on a bed of creamy mashed potatoes. We also got the m’chermal chicken tagine cooked with olives and potatoes. Last but not least we ended the meal with a mango cheesecake and chocolate lava cake which I really enjoyed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdTRYWHZ3RRAB",
            "text": "I’ve heard about this place quite a lot from my friends and social media and how they perfect the Moroccan cuisine even though it’s not owned by North Africans, I wanted to take my friends out for a nice dinner out since we hadn’t seen each other in ages and we decided on this aesthetically elegant restaurant.\n\nWhen i first entered this restaurant, I was embraced with a warm and dark interior that really set the mood to a relaxed and pleasant night, fulled with Moroccan artifacts and related cultural items. I was with a group of friends my first time here during Ramadan so we started off with breaking our fast with a couple of dates ( which were so generously provided by the restaurant).\nFor our appetizers with the cigars, which were quite a delight, the lamb was cooked in such a sweet and tender way that just warmed your stomach. In addition we got the market salad to complement our appetizer, which was very delicious.\nI sadly cannot remember what everyone got, but I do remember three dishes that I got to try and they were absolutely stunning in every way possible:\n\n- The lamb Pomegranate molasses ( this was for sure one of the best Moroccan dishes i’ve ever had a very good combination of sweet and savory into one dish infused with zaffron)\n- Lamb Tangia ( a slighty spicy and deliciouslption that I’d recommend getting)\n- Moroccan Shepherds pie ( this was a really nice dish, the lamb was buttery which made it melt in my mouth)\n\nAs for my second time here, we wanted to somewhat diverse our options so we had the:\n- Orange Salad, ( i enjoyed this much more than the market salad, a very good combination of fruit and vegetables into one plate that made me crave for it more and more)\n- Casablanca spread ( a good range of different dips that had me craving so much)\n- Mechoui ( absolutely delicious and an amazing option,\n- Lamb Pomegranate Molasses again ( I really wanted the person I was with to try it and we ended up devouring it)\n- Moroccan tea ( personally this wasn’t for me, I don’t believe they really perfected the tea in the way I’m used to having moroccan tea but it was good nevertheless)\n\nI do want to also highlight their pita bread as it was very warm and fulfilling, I’d highly recommend getting it even if you aren’t having any dips). In addition the friendliness of the waiters that accommodated us so nicely although we took a long time to order, so patient and respectful.\n\nI’ve headed here twice so far and it has to be one of my favorite Moroccan restaurants that I’ve tried in the states, Overall speaking I really loved my experience at Tara’s Kitchen, would definitely recommend coming here with friends!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkbkptSlZBEAE",
            "text": "This spot may have one of the most romantic vibes in NYC and not only that but they are also serving up authentic Moroccan dishes that will have me back for more! Especially those lamb chops!\n\nHere were our meal highlights:\n\n🍊 Orange Salad w/ honey pomegranate molasses\n🍖 French Lamb Chops w/ a mint sauce and mushrooms\n🍗 Chicken with Pomegranate Molasses, Honey, Harissa, Kalamata Olives & Almonds\n🍰 Mango Cheesecake"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdUw3eU9REAE",
            "text": "The tagine at @tarakitchenusa were spicy and satisfying. Their menu is pretty authentic but still caters well towards American palates with heavier seasoning. The lamb was not that tender so took a while to chew - would probably just go for the veggie dishes instead in the future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dFBqN3ZRRRAB",
            "text": "There was a good variety of vegetarian options on the menu. Everything we ordered was delicious. For starters the Casablanca spread, (3 types of spreads in relatively small amounts) we preferred the zaalouk and tapenade which were very flavoured. The harissa was too spicy. The fava bean salad was amazing and surprisingly was served warm.\nFor entrees both options we so we got were amazing. Really enjoyed the loubia butter beans in tomato chermoula. It was full of unami! The grilled red snapper was solid, super fresh, and grilled to perfection. The Moroccan tea was too sweet with too much honey for us. Definitely looking forward to coming back to try other dishes.\nService was attentive and the dining setting was  nice and intimate."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaGNTbjVRRRAB",
            "text": "Step into tara kitchen for a culinary fusion like no other. With a mix of Indian and Moroccan flair, this place is a flavor paradise. Big shoutout to Omar for the stellar service and the gorgeous decor that adds to the vibe make it so romantic. We started with the orange salad, a sweet and refreshing kick-off to a fantastic meal.\n\nThe Casablanca spread with warm pita is very delicious, and the grilled Red Snapper with lentil and citrus salad is flavorful.\nFor seafood lovers, the seafood Tagines is a must-try. Vegans have plenty of options. We tried the Couscous. It has seven vegi and so delicious. And don’t forget the dessert-the homemade Baklava is pure indulgence.\n\nTara kitchen is a culinary gem with unforgettable blend of flavors and a fantastic dining experience."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0eElIUmVBEAE",
            "text": "Really surpassed my expectations. Satin, our server, was amazing. Enjoyed the delicious food, atmosphere, music.\nSatin recommended the facade bean salad and it was delicious had the lamb meatballs so good. Lamb and chicken tahini, so flavorful. Substantial amount of food, pita, continuously replenished without asking.\nWine was great. Dessert- mango cheesecake and baklava, very tasty.\nSatin was awesome, she made the whole experience. Will be back. Totally recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcUllUWdRRRAB",
            "text": "Surprisingly a great experience.\nFood quality and taste A\nService A\nAmbiance A\nThe Moroccan Shepard’s Pie—a must have.  You have to be ok with a little Tanginess and a little spices."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSX1B5dm93RRAB",
            "text": "Enjoyed the Casablanca platter and Chicken tagine with apricot prune sauce.\nLittle pricey but we don't often get to try Moroccan food and we liked it. The waiter explained the dishes & recommendations to us."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmZ2FlTDZ3RRAB",
            "text": "this place is so cute!!!! vibe is like 17/10. loved the salmon tangine and the pita was also amazing\n\ncame on a snow day and it was empty which was so surprising bc this was such a lovely experience"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OVl6MWpBRRAB",
            "text": "Food seemed Moroccan fusion. Been to Morocco and been to Moroccan restaurants so this was very disappointing. Lamb coucous and  Lamb meatball just ok.  Fava app was good but not much fava. Most dishes did not warrant the higher pricing. The server who said he was from Morocco was very friendly, genuine, and attentive. The other server was rude. Space and bar is beautifully done. Sadly, will not be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeU9fZGRBEAE",
            "text": "Great brunch location! The beghrir pancakes are delicious and the chicken bastilla was an interesting and very tasty combination of flavors. Skip the diner and come have something extraordinary!\n\nWe’ve also enjoyed dinner here and the tagines are well-spiced without being hot-spicy (unless you want that!). Atmosphere is relaxing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2LTZYMUZnEAE",
            "text": "Tara Kitchen is an amalgamation of food and hospitality, intertwined to create a supreme culinary experience in the middle of Manhattan. Serenity of the place and service of the staff leave you with a desire to come again. Vibrant decor, warm, earthy walls, decorated for Christmas was perfect ambience for a magical evening. Lamb Tagine, topped with apricots and almonds, was a perfect blend of sweet and savory. And the Moroccan tea, served in a traditional glassware, was a cultural ritual that added to the whole experience. For those who are looking for an authentic Moroccan dining experience, without taking that flight to Marrakesh, this is a place you have to visit, to enjoy the culinary finesse in every bite."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMWNMQ1Z3EAE",
            "text": "Beautiful space, really good music, and very attentive servers. Clearly labeled vegan options is always a plus. The food was amazing as were the mocktails. We will be back for sure!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoeDd6VHV3RRAB",
            "text": "We loved eating at the Tribeca location of Tara Kitchen. The mint tea was plentiful. The tagines were so tasty. But the best part are the owners Aneesa and Muntasim are so friendly. You feel like family eating here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNzlLQTJRRRAB",
            "text": "I recently visited Tara Kitchen for Moroccan cuisine. The waiter’s hospitality was impeccable—attentive, kind, and professional. The atmosphere was classy and comfortable. However, the food was a major letdown, bearing little resemblance to authentic Moroccan flavors. The tea was equally disappointing, lacking the distinctive qualities of true Moroccan tea. I hope this was due to visiting on a Sunday when the main staff might have been off. Despite the excellent service and ambiance, the poor food quality was a significant disappointment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWOXRQYktnEAE",
            "text": "Omar was the most wonderful server and host. The food was amazing, filled with flavors and love. Shared the lamb meatballs, the lamb chops and the flourless chocolate\nCake with mango on top. Highly recommend and will definitely return soon"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNHBhd0VREAE",
            "text": "Excellent food! The staff are very fast, attentive, and helpful. The food was delicious. You get tea with your food which is awesome.\nThe price is very fair to the amount of food and quality provided. The ambience is great!"
        }
    ],
    "reviews_count": 74
}