{
    "name": "Pepolino",
    "place_id": "ChIJf6tT54pZwokRI5EU-NKF7sE",
    "grid": "MN1",
    "address": "281 W Broadway, New York, NY 10013, USA",
    "rating": 4.5,
    "user_ratings_total": 895,
    "phone_number": "(212) 966-9983",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbVlqWmxTM2x4TjJNdE5HOTRjR1UxVEc5UE1rRRAB",
            "text": "The best Tuscan dinner I have ever had! The service was first class and the desserts were amazing! The ricotta cheesecake was spectacular! Thank you pepolinos for such an amazing dining experience!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSR01WOUpjbloyZFdWeWRVNUhlV055TUcxMFEwRRAB",
            "text": "Stopped in for lunch on a Saturday afternoon and the restaurant was not very busy, the food & service were very good and I would recommend it and would visit again.  My only down side was the table placement next to a large party of 8 and next to the \"bar\" area which was not ideal but the upstairs looked inviting & with a better table location/atmosphere it could have been a 5 pretty easily."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTmFEaDVWemc0U1dSSFNVVktWSEpWU0RWa1MxRRAB",
            "text": "I had my birthday dinner here for a group of 12 and everything was perfect!  They made sure we had a great table, food was delicious and the service was incredible, never letting our glasses get empty.   The team there went out of their way to make it a wonderful night!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNGJqQkVVMDV5UnpNMlVIRTVUR1J6YkVoeFRIYxAB",
            "text": "Super cute and inviting interior, Luigi was helpful and hilarious, and the food was decent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeVJYb3paMFJoT0UxNlMwczVXRTU1YkRWSWMzYxAB",
            "text": "My Italian friend took me to Pepolino on a Monday night and I was super impressed with the food. We ordered the calamari fritti, Tagliatelle porcini and the Melanzane scarmoza which was my favorite dish. For dessert we ordered the Ricotta cheesecake and it was delicious. I’m not a cheesecake person but I LOVE this one. Great service and relaxing ambiance. The whole experience transported me back to Tuscany ❤️ This is an amazing restaurant and I can’t wait to dine where again"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ2YybC1nRRAB",
            "text": "Booked a table, went there and turns out it was a table that is literally on the road on a very busy avenue. You are on the street with this weird smell around. I thought i was booking a table at a restaurant.\n\nNot a place to book for a date night."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSGQwNU1ORmhSVUMxUU4xQkxUbGxZZEhNNVgwRRAB",
            "text": "Deliciously Fresh Homemade Pastas! And save room for the OMG cheesecake!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbFIyUm9hVFJzYkhJNVZIRjZkRnBKVDIxZmRHYxAB",
            "text": "Very average food. The servers are fine. The interior needs help."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTlVrMHdOSEJ3YjJ4WFMxSlNUVE5mYVRSbGFXYxAB",
            "text": "Its nice, but nothing special."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bVNGVTBObFpKVUZaT1pFNTRXQzFIVGxaU1NVRRAB",
            "text": "Great place , great atmosphere, great service and food !"
        },
        {
            "date": "2달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWc1NWUXdkbFJ3WjNWT1JWbGplVEk1V1RaTk1FRRAB",
            "text": "Italienisches Essen at it's best!\n\nCarbonara wie es sich für Italien gehört - ohne die in Deutschland obligatorische Sahnebombe - homemade Pasta, gute Weinauswahl und sehr guter italienischer Amaro. Dazu sehr sehr freundlicher und aufmerksamer Service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NWJrbzFYekY0T0ZCZlZGTm1TSFF4YUVkTVExRRAB",
            "text": "Best gnocchi I've had. I get it all the time!!! I recommend it. We go here every week!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odFZHbGxhakZ2TXpSdVMwbFBPRkZzWmpkWGVGRRAB",
            "text": "Great spot to sit outside and people watch. Excellent service and homemade linguini was superb. Only did lunch - will be back for dinner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSGRXZENOVTFZYkc5MU1HMVVkRWRKV2tsRU1WRRAB",
            "text": "Amazing place!. Food was amazing. Owner super personable and very dedicated to his restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcmIxcHRWbWhMYkhOeVQzWTJUM0ZZU0ZGUVgxRRAB",
            "text": "Good food. Nice atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4T04yRjJlbE5QU1hoNFNIZGtWemhFZFVsSlQxRRAB",
            "text": "Came here for a late lunch as a party 1 and wanted to try their Restaurant Week lunch special. I was greeted by a lovely staff member and was free to choose any small table.\n\nThe complementary tomato flan packed a surprising amount of flavor. Spreading it on the bread was a different but delightful experience compared to having a plate of sauce or oil. The top of the bread was brushed with some salt, elevating the overall taste.\n\nI had the Carpaccio di Manzo for my appetizer. The marriage of cured beef, cheese, and truffle was a wonderful salt fiesta in my mouth. The portion was also quite generous, so I'll definitely get this again in my future visits (unless I'm trying something new).\n\nFor my main, I got the Polpettine Di Vitella (Veal & Ricotta Meatballs). The dish overall had a good balance between salt and savory, and a plentiful amount of salt and pepper. The meatballs had a semi-deep lingering taste from the ricotta, which was accompanied with several seasoned vegetables and a light tomato sauce. It was a good contrast from the strong carpaccio opener.\n\nIn total, the dishes were definitely on the salty side. However, it was tolerable for me because it satisfied my appetite as an athlete. But I can see how this could be a turn off for some consumers, especially with the Carpaccio di Manzo. The restaurant week special is definitely a steal, but I will still come back to try more dishes, and recommend this to my friends and family"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWlNGZ3lja3A2ZGpnemIycFJiRE5WWnpCb05sRRAB",
            "text": "Excellent dining experience. Great food, wonderful service, and pleasant relaxed atmosphere. Multiple dining floors, so larger than expected from exterior."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSlpITjFVV2hZYUhWMU9YWXpjVXR0YVVsVGNtYxAB",
            "text": "Came here with some colleagues for dinner while at meetings in SoHo and loved it. We sat on the 2nd floor and the view is great. Excellent ambiance, classic decor, and wonderful people. The server was great, and the food was awesome. Homemade pastas were great, definitely recommend the boar ragu and the porcini tagliatelle, both were delicious. The sausage crostini appetizer was great too. Would definitely recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSVN6TkJRbXh1VkhnNWFIUmFOVzEyZEVwT1QwRRAB",
            "text": "Great Reastaurant.  Service and food was outstanding.  We had the fresh made fettuccine and bolognese special. We had a view of One World Trade tower from our seat."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbnRQTVFnEAE",
            "text": "Not up to par for a NYC Italian spot.  Pastas are overcooked (not al dente), and there is a 2% credit cards surcharge to kick you on the way out, after paying the exorbitant and entitled tip."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeGFXVlpaRXg2T0hkVWFWUmlUMU5XWlZZNU1sRRAB",
            "text": "Excellent wild boar ragu and the ricotta cheesecake was heavenly!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQeUdvdGZNX2NXZFdREAE",
            "text": "From the outside Pepolino looks like a small restaurant but it's actually multiple floors and had a lovely decorated experience. We went after work with a group of 15 and they offer a fixed price menu that serves a 3 course meal of app, entree, and dessart for $60. The portions were a bit small but it with the 3 courses was a perfect size to be full at the end of the meal. The staff was very friendly and offered suggestions on food options. Food was delicious and not one of my party was disappointed with their choice. The restaurant was buzzing with families, couples, and large tables which shows they accommodate everyone. Very happy with this choice and if you are ever in the neighborhood or staying in a nearby hotel you should definitely give this one a try!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UlpGVnZUM0psTm0xVE5sOHRkRVV5TlY5MlpYYxAB",
            "text": "The attention was very good, the pasta di mare was excellent!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJV2tnTHpsM0pTMlRnEAE",
            "text": "Wonderful evening.  The food was tremendous and the service was exceptional.  We had not made a reservation and lucked out to be able to sit at the bar.  We received exceptional service and extra attention.  We enjoyed our cocktails.  They were well made and delicious.  We shared the endive and pear salad.  Our entrees were the veal and ricotta meatballs and a pasta special of Linguini with Artichokes and pancetta.  Very delicious!  We were too full for desserts but they sounded wonderful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQQ0YwZGFRX2ZMN0JREAE",
            "text": "Great food and atmosphere as always. Will be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMV29oTXJUc05EZXpRRRAB",
            "text": "Asked for a specific dish for takeout that they didn't have on the menu and they just made it happen!  Thank you! .....and it was delicious with special touches I didn't expect."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaGQ2aEpBEAE",
            "text": "Fabulous! This spot will transport you straight to Italy. The atmosphere is charming & rustic and the service was attentive & wonderful. Had a light lemon pasta that made me feel like I was dining in Sorrento. My mom had the trout special and it was wonderful. We left with full bellies and high spirits."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva3Azc2NBEAE",
            "text": "Great wine, fresh pasta and a welcoming atmosphere, can’t go wrong going here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNkx6YUlBEAE",
            "text": "Food was very good and staff was professional. Enjoyed a lovely lunch. Octopus was cooked very well!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaTd1ay1RRRAB",
            "text": "We had a group of family and friends. We were very comfortable and the food & service was excellent"
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJazQtWDV3RRAB",
            "text": "Sono stato ospite da Pepolino qualche settimana fa con la mia famiglia, qualità del cibo ottima , bell’ambiente , ottima cortesia , un ringraziamento particolare al cameriere (italiano) Luca che ci ha fatto sentire come a casa\nConsiglio!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaXB5Z2hRRRAB",
            "text": "Excellent food. I’ve been going there for many years. My favorite Italian restaurant in NYC. Very authentic."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJXzg2dFZREAE",
            "text": "Beautiful place, the environment is amazing. Really feels like Tuscany on the inside. But the foot is a little pricey"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJLThUMF9RRRAB",
            "text": "At Pepolino to celebrate my husbands birthday. Not very happy with the lackluster, slow service so far.\nOrdered 4 appetizers and received the first two  in a timely manner but had to wait more than 30 minutes for the octopus and mussel appetizers. Server doesn't really check on us.\nCocktails were watered down in spite of the high price.  For what they charge, we expected better service and better drinks. Hopefully the rest of the meal gets better ....."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOWZTMUZnEAE",
            "text": "I would eat here again. The pasta was pretty good, though a little pricey for what it was."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaU1DRFF3EAE",
            "text": "Delicious! Great little Tuscan spot in a city full of Southern Italian. Filled my cinghale pasta and chianti classico desire for sure!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJZ1A3Q3J3RRAB",
            "text": "Delicious food. Loved the fried burrata special and the steamed mussels!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cHN5Wk1BEAE",
            "text": "I’m typically cautious to explore Italian restaurants from the 90’s… often over-cheesed and over-sauced… but the food was really lovely and the rustic ambience felt lived-in and welcoming."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3N3RUZF9nRRAB",
            "text": "Superb food, friendly, attentive service.  Love the squid ink seafood pasta and the wild boar ragu.  The ricotta cheesecake is truly exceptional, unlike any cheese cake you’ve had-so light, you’ll swear it has no calories!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRei1tOTJRRRAB",
            "text": "From the moment you step into Pepolinos you’re transported straight to Italy. The warm ambiance, soft lighting, and inviting aromas set the perfect stage for an unforgettable dining experience.\n\nOur server was knowledgeable about the menu and offered excellent recommendations. All of the pastas were particularly incredible.\n\nThe meal concluded with the ricotta cheese cake that was light, creamy, and the perfect balance. It was the ideal ending to an already perfect meal.\n\nWhether you’re looking for a romantic dinner, a family gathering, or simply an indulgent night out, Pepolinos is a must-visit. Authentic, flavorful, and executed to perfection—this is Italian cuisine at its finest. I can’t wait to return!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRei1ucW1RRRAB",
            "text": "Definitely a must go to restaurant in NYC. Pepilinos, definitely sets the bar when it comes to:\nAuthenticity, hospitality, quality, intimacy and overall professionalism!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRaHVtNzJBRRAB",
            "text": "High-quality and high recommendation!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRM0kzUElnEAE",
            "text": "The veal meatballs were out of this world."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbzlpa2xRRRAB",
            "text": "A pleasant surprise for dinner with friends. True Italian hospitality."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaXBubEJBEAE",
            "text": "The Cod was a stand out and the best meal I’ve had in a while. The Linguine pasta with some shrimp was just ok. The pear tart was fantastic. A lovely restaurant full of locals and the service was great."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnX3M2Q2l3RRAB",
            "text": "Excellent Italian food in a quaint little restaurant.  Staff was welcoming and very attentive.  Food was incredible and lite in portion but seasoned to perfection.  Ricotta cheesecake for desert was a delight.  Highly recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbnNDRjh3RRAB",
            "text": "They canceled our reservation with no reason  30 minutes before we were supposed to have dinner there. Unbelievable"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncXFMazNRRRAB",
            "text": "Positively the best place to eat downtown, and perhaps in the city as a whole.  This is our hometown neighborhood Italian restaurant.  High-quality food, warm atmosphere, and most importantly the BEST people!  Adrian makes it an especially good experience.  This is THE place to go if you want all the best of real New York with none of the pretense of “trendy” places."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURBXzVoYxAB",
            "text": "Went here for a business dinner. We were both genuinely surprised by the reasonable prices & generous portions!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcl9tSkdnEAE",
            "text": "This restaurant does not treat you like Family… they treat you like Long-Lost Friends!"
        },
        {
            "date": "9년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdDhXMFBnEAE",
            "text": "호텔 컨시어지에서 추천 받아 가게 되었는데, 합리적 가격에 아주 맛있는 이탈리안을 먹었다. 소호 주변의 애매한(?) 이탈리안에 지친분들에게 강력히 추천합니다."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzMlBXTHN3RRAB",
            "text": "가정식 같은 포근한 느낌이에요! 완전 맛있고 재방문 꼭할거에욥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeHJTLXhBRRAB",
            "text": "I happened to be in the neighborhood so decided to give this a place a try. Two stories with a nice rustic vibe. My starter - pork belly on a gnocchi custard was excellent while my pasta - a pappardelle with wild boar was decent. I would save space for their ricotta cheesecake though - a great finish. I did find prices a bit on the high side compared to similar restaurants - the most obvious being their cocktail menu. Basic cocktails of the type here should not run above $20. Needless to say, I skipped the cocktail."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMek9hb25nRRAB",
            "text": "Very average Italian food.  The staff was good and really no other issues, but the pastas were disappointing and not very authentic Tuscan cuisine.  Not bad, not great.  The apps were, however, quite good and the wine selection was also pretty good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbTdpQnh3RRAB",
            "text": "Came here with my team for a team dinner. It feels really intimate and dimly lit inside.\n\nGood:\n- Tasty free bread\n- Burrata was very good, good ratio of cheese to tomato\n- Eggplant parm was so good - it was thinly sliced and easy to eat\n- The ragu was tasty - the pasta noodles had a lot of texture and good flavor\n- Portions are good, super full\n- Service was good - nice waiters\n\nBad:\n- Nothing too crazy in terms of blowing my mind\n\nOverall this place was nice for getting my team created!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dGJXaHFRRRAB",
            "text": "We were in the Canal area of Tribeca during a rainy night and saw Pepolina close to a subway entrance. We decided to try the restaurant and are glad we did. The room was warm & inviting and the service was very good. We tried the spaghetti chitarra, pesto linguini (special) and tagliatelle ai funghi porchini. The pasta was cooked perfectly and the flavors were very nice. For dessert we had the tiramisu which was one of the better ones I have had recently with the liquor being clearly prominent. Pepolina is recommended for better quality home style pasta at a good value and many vegetarian choices."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dk9US01BEAE",
            "text": "Warm and cozy, delicious, authentic food. Fast and attentive service. Kept our water glasses filled which sounds minor but is hard to find these days. Food was excellent and fresh. Will be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaHFYWWp3RRAB",
            "text": "AMAZING Italian restaurant!! I came here on a Saturday for lunch and the place was practically empty. I sat outside in their beautiful outdoor patio area. The waiter was very kind and gave us some phenomenal suggestions.\n\nTo start the bread and the Suppli’ di Riso we’re fantastic. I really enjoyed the tomato paste that the bread came out with. And the Suppli di Riso was fantastic. The tomato sauce it was in was beautifully made and had rich depths of flavor.\n\nThe Maltagliati al Ragu’ di Vitella was also fantastic. The noodles were cooked perfectly and the veal ragu tasted amazing.\n\nWe finished off with the Pollo Agli Agrumi. This dish was to die for. The mix of the citrus and the chicken was delicious. It actually might be one of my top chicken dishes ever as it was such a great combination of flavors. The chicken was also cooked perfectly.\n\nOverall, this restaurant was amazing and 100% recommend!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dXJfbXp3RRAB",
            "text": "Our meal at Pepolino brought back all the memories of Tuscany, spot-on. Simple ingredients, thoughtfully prepared, flavors truly shine. Steamed mussels were some of the best we've ever had, both pappardelle dishes were excellent, and also loved the Capri cocktail. Pepolino embraces what Tuscan food is all about: creating flavorful dishes using fresh, simple, and high-quality ingredients."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbG9yamtRRRAB",
            "text": "Large delicious portions of pasta which are served piping hot. The crispy pork is very good, served with a shallot sauce, a good combination. Friendly staff who make you feel at home."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMWN5b2J3EAE",
            "text": "A 5 star experience all around! Authentic flavors, very friendly and attentive service, yummy bread and tomato paste thingy and EXCELLENT freshly made pasta. The gnocchi was so pillows and soft, perfectly complemented with the butter sage sauce. And the pappardelle pasta with wild boar ragu was impressive. A lovely atmosphere, perfect for date night or friends with dinner- inside and outside is so adorablewith the lighting. We'll be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4enBfS1p3EAE",
            "text": "It was one of the best meals we have had in NYC. BEST Italian. Fettuccine Bolognese, Spinach & Feta Gnocchi and an Orange Blossom Creme Brulee. I can't say anything about these, other than they were delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoek1MN0J3EAE",
            "text": "Pretty consistent Italian restaurant- have been here a couple times over the years and the food has been pretty consistent. Would say the pastas are better than the secondi dishes though. My favorite dishes were the squid ink pasta and veal meatballs.  We also got the porchetta special but it was overly seasoned for me so would say perhaps stick to items on the menu for their staples"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURaeTZ0cRAB",
            "text": "What a cool spot.  The food and drinks here are amazing.   I had the best pear vodka with sage syrup, lime juice and martini.   Fabricio is a master at making them.  The ricotta cheese cake is out of this world.\n\nShowed up to Pepolino a third time and make a mistake with reservation. I booked Saturday but showed up Friday and Jada was kind enough to save the night.  I was visiting with a guest and wanted to share one of my favorite restaurants and was mortified to find out if showed up on the wrong night.  Thank goodness for Jada.\n\nI can’t recommend this restaurant enough.  I would give it ten stars if I could."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaXNEamhRRRAB",
            "text": "My wife and I had a Friday night dinner here. We love the food - she ordered the seafood linguini, had a papadela (the first dish on the menu), and another appetizer that has eggplant and mazeralla in it. Every dish was good! The service was great too.\n\nWe didn't like the cocktail Verona which is $22, and we were a bit disappointed that they don't have affogato or tiramisu for dessert."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaUkzWFZ3EAE",
            "text": "Cute outdoor space!  Tons of seating.  It’s a great place to people watch!  The service was friendly! The food was just okay.  For the price it could have been better.  There’s no kids menu.  The menu is not as kid friendly.  It’s close to…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMlBUTzBRRRAB",
            "text": "The appetizers were fantastic, especially the octopus. However the main dishes were pretty average—the pastas overall flavor profile was bland and was expensive in relation to the leve of wow I got"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzb1lpc3d3RRAB",
            "text": "Wonderful homemade pasta. Bread and apps were fantastic as well. They have a lovely lunch prix fixed menu that we ordered from. Don't think you can go wrong with anything here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMmFPbjJ3RRAB",
            "text": "Very romantic and off the path place. Service was fantastic, singularly bested by the quality of food. I had the grilled octopus on a crustini which, to be honest, is probably the best meal I have had this year. Cooked to perfection. They also have the tomato based olive for your bread, something I have never had before, which I thoroughly enjoyed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoazktYWF3EAE",
            "text": "Great service. Cozy setting with warm interior. Enjoyed every dish but was not blown away by any. However, I loved my pineapple tequila cocktail! Good red wine as well. Could maybe one day be back. Would recommend though!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdTVyOG1BRRAB",
            "text": "Was here for a group dinner. The pasta was amazing and had the Branzino which was  also very good. I tried the Tuna and we found it just ok and a bit dry. The flourless chocolate cake was an excellent desert choice. Overall we enjoyed the meal and had very good service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeGUyMER3EAE",
            "text": "We had the days special truffle pasta, pork, and the usual menu mussels, eggplant and endive salad for appetiser. The tiramisu was really good too. They have a nice patio seating with good quality heaters."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1enFlYUtBEAE",
            "text": "Great experience and food at Pepolino. Reserved a table on the beautiful patio. Great, attentive service and on-point pasta dishes. Love the simplicity yet delicious flavors."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHajg2QjRRRRAB",
            "text": "Great menu and selection of items; very friendly, observant and helpful staff and such a nice vibe. They had porcini mushrooms soufflé on the specials when I visited and it was out of the world delicious.\n\nPRO TIP: you can ask for half portions for any of their pastas if you’re too full.\nTheir desserts are made fresh every day and are quite light and delectable!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eGFlU1Z3EAE",
            "text": "Intimate Tuscan restaurant with a rustic feel serving high quality Italian foods, differentiated from many of the restaurants you’d find in Little Italy. Several vegetarian options, some which can be customized to vegan. Ordered the pappa…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyemRmTU93EAE",
            "text": "We almost left Pepolino within the first 15 min of being seated, as we were placed next to a large table where two snooty, wealthy, WASPy Karens were gabbing and ignoring their misbehaving daughters who were wreaking havoc in the general vicinity and disturbing everyone nearby (esp. us). Ugh. Talk about a living birth control ad.\n\nWe eventually got the staff to move us to another area, and things were immediately better from there. But I felt bad for the couple that got seated at our old table. Pepolino staff: If parents won't reign in their bratty children, you need to do something. I promise the backlash from one or two parents will be balanced out by the many more diners who will appreciate you for taking action.\n\nAnyway, the food. The Zuppa Di Porri & Patate is scrum-diddly-umptious and perfect for cold winter nights. But the Cozze Al Burro was the best dish by far. The garlicky parsley sauce was everything your Mediterranean-loving heart could want, and the fact that they de-shell their mussels is just cherry for lazy diners like me. Pasta-wise, the Tagliatelle Ai Funghi Porcini was one of the more flavorful mushroom pastas I've had, while the Fettuccine Al Coniglio provided much-needed rabbit heartiness. The portions were pretty substantial too.\n\nWe skipped drinks and dessert, but overall, I wouldn't rule out a comeback. I might bring my own privacy screens though, to block out wayward children."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcW9YeE9nEAE",
            "text": "Good food and good service! The eggplant appetizer is really delicious and very unique. We had the seafood pasta and the ravioli of the day, which were okay. The staff was very friendly and accommodating. Definitely on the more expensive side though, and not sure if it’s really worth the value. I’d come back though!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyako2ZEh3EAE",
            "text": "Have been wanting to come here for years mainly because I saw it as I entered Manhattan driving from NJ. It was amazing. Well priced, good vibe great wine selection. Recommended for date night that won’t break the bank."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNHQzTFJREAE",
            "text": "One of the best dining experiences I’ve ever had. It’s not often I walk away from a restaurant saying, “This is a new favorite.” But from the food to the service, this place was impeccable. Given that we’re in the middle of a pandemic, I’m truly blown away at the level of this restaurant’s service.\n\nOur server was phenomenal and made perfect recommendations for drinks, dinner, and dessert. He guided us the whole way through and absolutely everything was divine.\n\nA couple of true standouts that you should absolutely add to your order: the mussels and the cheesecake. Everything was perfect, but I will 100% get both of these dishes when I return.\n\nIf you’re looking for a heavenly dining experience, look no further!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbnZhYjZ3RRAB",
            "text": "I just loved my experience at Pepolino. From the warm greetings to the goodbye and everything in between. True Tuscan food and service I highly recommend this establishment. I had tomato bread soup, an eggplant and mozzarella appitizer from…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdVBfdkhREAE",
            "text": "It’s like a trip back to Italy! The food is so amazingly good. Had the Spinach gnocchi, it was melt in your mouth perfect. My husband had rigatoni with sausage which was perfect. Make sure you dine here when in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxeUxHNERnEAE",
            "text": "The waiter is good at suggesting and explaining Tuscany food. Tried the Spinach flan out of curiosity, pretty creamy and soft, non fibery texture with the tomato based sauce. Also had the Creamy shrimp pasta with lemon. Pretty good overall! Restroom is tiny tho."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRak0tc1dREAE",
            "text": "My go to spot for Italian in the downtown Tribeca area. Have been here many times and am never disappointed by the quality of food and service I receive. The pastas are all made fresh in house and are incredibly delicious. The main dishes…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDdkxqTkVBEAE",
            "text": "Yummy pasta and cute outdoor dining. Pasta and gnocchi were fresh and sauces were really good. Complimentary bread with a tomato spread. Pastas between $20-25 although was $17 for an aperol spritz. Overall a pleasant experience and would recommend!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMzQ2cjJRRRAB",
            "text": "Besser spät als nie!\nIm September 2022 waren wir zum ersten Mal in New York, wir wohnten damals im Club Quarters Hotel am Ground Zero.\nEine tolle Zeit! Tribeca, Downtown, Fulton Fischmarkt waren unser!\nEiner der Höhepunkte war der Besuch im Pepolino. Ein wirklich gutes Restaurant!\nWir saßen draußen, ein wunderbarer warmer New Yorker Abend mit dem erleuchteten One World Trade Center im Hintergrund. Amazing!\nGrüße aus Deutschland! Das Pepolino werden wir nie vergessen!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcU83SG1BRRAB",
            "text": "Really enjoyed dinner. Went here with a friend to catch up and dine. Dinner was awesome, ambiance so Tuscan and server Gabriel was so attentive. Really recommend the Ravioli’s 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeDRfd0NBEAE",
            "text": "Cute low-key Italian restaurant with good service. Unfortunately the food didn't meet my expectations, the rabbit meat in the pasta was overcooked and the sauce had too much parsley that made it difficult to actually taste the rabbit, this sauce also lacked salt. The veal ragu pasta was a bit too salty but it was a better choice than the rabbit. Pasta itself was good though, cooked just the right amount of al dente."
        }
    ],
    "reviews_count": 87
}