{
    "name": "The Malt House",
    "place_id": "ChIJT4JpKxhawokRJsGwYfLpp60",
    "grid": "MN1",
    "address": "9 Maiden Ln, New York, NY 10038, USA",
    "rating": 4.3,
    "user_ratings_total": 2091,
    "phone_number": "(646) 682-7577",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVlFqRkNVRVJOUWxOc2R6Tk1VRVJoWjNWdVpuYxAB",
            "text": "Staff was very attentive, food was hot and served quick as well as tasty. Ambience A+"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSE1rZGlla1ZEYzBnNVNtVk5TRlpVUWpkbloyYxAB",
            "text": "The burrata salad with shrimp is 10/10"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Od2JtUlJSRzlqT1ZGR1NYWTRPRWxrTlhCRFRWRRAB",
            "text": "Good vibes, good drinks, excellent sliders."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUVYxSm9hRkEwTm5rd2MyMXFSUzEwY1ZKM1pVRRAB",
            "text": "Hello- I was there about 2 days ago. I was sitting at the bar and the person next to me began playing the theme from the Movie Rosemary's Baby. Halloween cane early for me that day. I move to the front door very fast!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUFJURjFTSFJYVHpSRmExWklZa1ZsV2tZd1UyYxAB",
            "text": "Service was incredibly fast. Unfortunately I think it compromised the overall quality of the food.\n\nSpent 80$\n\nSteak was medium, not medium rare. Cooked so quickly it was hard to cut and a bit stringy.\n\nBlueberry cheesecake didn't taste of blueberries. Beer tasted to light it was watered down.\n\nService was attentive and fast, wings were good. I'd come and get a beer and hot wings happy hour and leave."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdlJsaGFibHBpZHpVMU9IUnNjbVJ0TWxOaVEwRRAB",
            "text": "Nice late late night spot in the city. Food, drinks and service were great. Have to come back."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aR1YwVTVYM1JxZFhWbmEya3RkbTlZWkdWNGRFRRAB",
            "text": "My wife and I visited there since it was close to our hotel, the drinks were good like any nice bar, she had the chicken sandwiche and said it was good, I chose a appetizer of nachos and I would not recommend them, nothing special and we’re just bland tasting."
        },
        {
            "date": "수정일: 1달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKd1FUTjNVbmxUVmtRdFZFNVpTMFpEUkVOd2JGRRAB",
            "text": "Precio excesivo de las cervezas y nos cobraron el agua cuando siempre es gratis. La comida muy buena"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdmNrTjJWVjkxWmxNemVEazRMVmMwYlhKSlgzYxAB",
            "text": "I walked in one evening and grabbed a seat at the bar. I tried their house beer which was alright. It went well with the burger I ordered, which had a good savory flavor. I did find the fries to be a bit bland and soggy."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRldFazNXRTh5ZWt0a2FUbERURkpNYVhKRU1tYxAB",
            "text": "Service was nice and quick, but atmosphere is so&so, very noisy, peopke seating so close.\nFood was tasty, quickly delivered, but they should mark hot meals."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNGJXTm5lVEE1UkVGclQxQndkMmh5VmtkRVlrRRAB",
            "text": "I had the pleasure of dining at The Malt House recently, and it truly exceeded my expectations. This cozy spot has a fantastic, welcoming atmosphere with an upscale yet relaxed vibe, perfect for a night out with friends or a casual dinner date. The decor is stylish and modern, but still feels warm and inviting.\n\nWe started with their famous truffle fries, which were crispy, golden, and packed with flavor. For the main course, I opted for the house burger, and it was absolutely delicious – juicy, perfectly cooked, and topped with all the right ingredients. My friend had the grilled chicken sandwich, and she loved how tender and flavorful it was, paired with a side of perfectly seasoned sweet potato fries.\n\nThe drink menu is also top-notch, with a great selection of craft beers, cocktails, and spirits. I highly recommend trying their signature cocktails – they really know how to mix a drink!\n\nBut what really stood out was the service. Our server was attentive and knowledgeable, ensuring we had everything we needed without ever feeling rushed. The team at The Malt House genuinely goes above and beyond to make sure you have a great dining experience.\n\nWhether you’re in the mood for a great burger, craft beers, or just a fun, laid-back night out, I highly recommend The Malt House. It’s the perfect spot to enjoy great food, drinks, and company. I can’t wait to return!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oU2FUaHRTM1ZUZWtWc2RHVnJhbk5rUmxseFZWRRAB",
            "text": "A very good place to have drink. They also have cheesecake."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25acFFVODJlR0YzWlhaSllWZHFWRlF5U0dWM2FuYxAB",
            "text": "We visited during happy hour, got a delicious Malt House IPA and an Old Fashioned (also exceptional!). We had onion rings for the appetizer, the breading was beer-batteref but no so heavy that the onion wasn't allowed to bloom underneath (so to speak). My companion got the American Burger, with an onion jam that made it one of the best he's ever had. I got the Roasted Chicken and the combination of the tarragon, mash potatoes and creamy mushroom sauce made it a welcome comfort to my hungry stomach."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSmNsRnBXa1F4ZFhkM1NXZFhielJRWTBKblRuYxAB",
            "text": "Decent food but bad service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RVVFVkRla2gxU2poeFpFRlllbHBzTVZWR1VWRRAB",
            "text": "Needed somewhere to eat before seeing Oasis at the MetLife and walked past The Malthouse and saw the lunch menu advertised. What a gem of a place, the pulled pork sandwich was excellent and our server (Irish lady) was really lovely. Will visit again next time we are in New York. Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRlZGUTNkbTlYWjFWNlRGcGZkeTFhZVVwMFQyYxAB",
            "text": "The food was decent, but the service was terrible. They seated us near the bathroom, even though there was ample space available. The servers and employees only came once to ask for drinks. We decided to order appetizers as she asked for our drinks, we got our drinks and appetizers but we never saw another server until we went to find an employee to ask for our check. We ended up eating a proper meal somewhere else. Here, they prefer chatting by the bar than interacting with customers and generating revenue. Cheers!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSYVdqaFJjbFppWXpWaVlXZFJSV3gwWkZBMlYxRRAB",
            "text": "Had a beer. It’s a cool bar"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1blJFeGxMWEpGWkdSdmF6Tm9RbGhNZURWM1YwRRAB",
            "text": "In the financial district with business colleagues. We needed a place to eat and the internet suggested this nearby. The food was good. There are vegetarian options. The person in our group who ordered steak liked it.\n\nThe only issue was the music was ridiculously and needlessly loud. The place was only about twenty percent full. It made it difficult to have a conversation."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONWJtWjBhVmxCT1Y5R1VEVkhOV3RUU1dNeU1uYxAB",
            "text": "I just went for a quick lunch, but the food, drinks, and service were excellent. I had the chicken dish, and it was absolutely amazing. Don't get me started on that espresso martini 😅. Would highly recommend. 👌🏾"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oc2QwUlpXREI0UVZnNWNEWldaMGhPZVdkRFltYxAB",
            "text": "Food is excellent!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMVVqSmFlV0UyVFVkVGJtVnFObmhXVTI5WVZHYxAB",
            "text": "One of the best burgers I’ve ever had and I am a food snob!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5blZXWlJlalpoYlZCc2VVaGxSM0JTWWxkVU5FRRAB",
            "text": "Staff are racist. Was here for a work event and the worker with the bob continuously looked us and other POCs up and down. Never coming back. Food was decent, but not at this cost."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJdGJqSXpXRXhIVEVKaFpEVlJlbWRaUVd0RFpIYxAB",
            "text": "TLDR: This establishment is primarily made up of and serving a very certain demographic of people. My colleagues and I (people of color) had a terrible experience and witnessed the staff looking at a group of Black women up and down as they entered the restaurant. The service was agonizingly slow (only for our table though) and the staff, very passive aggressive, making you wonder if it in fact was coded racism.\n\nI made a reservation for 7pm for an after works drinks. When we arrived, it was not that busy, and yet took almost 30 minutes to bring us our order. And my colleague and I actually had to stand up and ask the front host to please find our waitress since it had been 20 minutes since we had been seated. Meanwhile, the very busy table in front of us who came in after, was served much quicker. We could not wave down any staff to get the check or even ask for more water for well over half an hour and whenever the woman with the bob would acknowledge us, she would just turn around and ignore our table. We had to get up and go track down a hostess to ask for the check and even then, it took much too long."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwemRtVktMVlZ0Y0RnMlFrbDZja0l3ZVc5eFRsRRAB",
            "text": "My fiancé chose this because it was the best rated brunch spot in the financial district but they had a very limited food menu for brunch?? The drink options took up almost one and a half pages of the menu.\n\nIt was before noon but there was still loud club music and TVs with two different channels playing sports. We were one of a few people here but it was still noisy and overstimulating.\n\nWe remembered that we came here for a very late night dinner one other time. The menu then was still limited, and the TVs and people were very loud also. we couldn’t hear each other talk and I left with a screaming headache.\n\nThey did call him when he left his credit card so there is a redeeming factor.\n\nThe side salad that came with the breakfast sandwich was over salted but I’m giving the food ⭐️⭐️⭐️ because the breakfast sandwich itself was very good. It was served on a ciabatta roll with the initials MH stamped in it, which was a cute touch.\n\nIf you need a rowdy pre-game for a catered lunch elsewhere then this is your place. But if you prefer something more low key then I would look elsewhere. Sorry."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200ellVUkRlR1ZpVERadlYyNUpWM056V0dKTlZrRRAB",
            "text": "The Malt House had a really good burger and fries definitely hit the spot. But the mocktails were a miss for me. We ordered a non-alcoholic mojito, and I’m pretty sure they added bitters, which threw off the taste. The music was also a bit of a turnoff… it felt like a mix of Halloween tunes and Broadway songs, which didn’t match the vibe at all. That said, the space looked nice and the staff was friendly and attentive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMFRtaENORmxXYXpkUU1FOUJWbE5FU1hWWmFYYxAB",
            "text": "It was good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOc05tdG5NVmxZTUhGU01ucHRYM056Wm1GYVRrRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ One of the best dining experiences in New York.\nAbsolutely outstanding. Without a doubt, this is my favorite restaurant in the city. The Braised Beef and Grilled Branzino were perfectly cooked and full of flavor — simply exquisite.\nThe ambience is elegant yet relaxed, and the service was impeccable: attentive, kind, and professional from start to finish.\nIt’s rare to find a place that delivers on all fronts — food, atmosphere, and service — but this one does.\nI’ll definitely be coming back in the next few days. A must-visit in NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdFVYQkVlbDltVlZKUldYTTNVR1kwVlRNeE5rRRAB",
            "text": "The Malt House is very centrally located, making it a convenient stop if you're exploring downtown NYC. The atmosphere is casual and lively, with a solid selection of beers and a simple, easy-to-understand menu – great for a quick bite or casual night out.\n\nThat said, the service was unfortunately not up to par during our visit. The staff seemed overwhelmed and inexperienced, which led to delays and confusion with orders. It felt like they weren’t properly trained or supported, which took away from the overall experience.\n\nWith a bit more attention to staff training and coordination, this could be a great spot. The potential is definitely there, but service should match the quality of the location and the drinks."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMk1VUmxiVkZzVUVwelJWcGtNMGxrVVdwcGNsRRAB",
            "text": "Good food but I did not think it was worth the price. Atmosphere was very loud and a bit overwhelming. I would recommend for a happy hour with co-workers but would avoid for a catch up with friends where you can easily talk/hear each other."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WlNsSTBjRkZLYkdZMVRHMVhNMUJSUWtST1lXYxAB",
            "text": "Bad espresso martini\nThe food was served no fork no knives\nNo house water\nNormal things that you expect like in every other place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kd2JYTmFiMDkyYmxKeU5sRXpkbGRFYVZOSU1GRRAB",
            "text": "Excellent service and tasty burger."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWGEydHFVbmMwVVZKb1FsOXJTMVJaV25OQ1UzYxAB",
            "text": "Reliable Favorite with Top-Tier Happy Hour Vibes\n\nI've been a regular at Malt House for over 5 years, and it continues to be one of my go-to spots—especially for Happy Hour. While their Old Fashioned has changed over time (it used to have a signature smoky flair and the mix has evolved), it's still one of the best you can get for the price in NYC. The atmosphere is laid-back yet lively, and the service keeps me coming back.\n\nShoutout to some of the amazing bartenders—Rachel and Adriano are always on point. There’s also a young woman of Dominican descent (often wearing red lipstick with a warm brown complexion) whose name escapes me, but she is absolutely delightful—attentive, personable, professional, and simply a joy behind the bar.\n\nWhether you're dropping in solo or meeting up with friends, the crowd is diverse and welcoming. Highly recommend if you're looking for a consistent, friendly, and reasonably priced spot in the city."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTk5qbFJUWEJsWVRCR1IzcHpTMmgyU1dkcGFFRRAB",
            "text": "Great gastopub and particularly if you have a big group on the weekends. They went above and beyond in accommodating us and my octogenarian aunt and uncle. Great beer list and food was good, roast chicken especially. Had a great time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NFoySnVORk56ZFd4MFoyWkZjRTAwWlZRNFltYxAB",
            "text": "We had a great experience! The service was amazing. Our server Skye was lovely. Would come back again for bottomless brunch."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKU1dWWTNiMGxRVUZOTGJsQlpiSEl4YUVZMGRHYxAB",
            "text": "Drinks and food very okay, not good. Its dining area is in the basement which was not really pleasant and it smelled"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMVVrOXVSV3B6YlU1UU5HdHpRbkJGUnpsQ2JWRRAB",
            "text": "The place is really nice, as is the people working there: welcoming and friendly. The food was really good, and as an Italian I tend to whine too much about food... No need to do that here, at all! The one thing that prevents me from giving five stars was the music: good music played by a real DJ, but the volume was a bit too high, making it hard to chat. Luckily we were next to the entrance, so we could chat somehow. We went on a Friday, late evening, so that's probably the reason. I suspect that coming on a weekday, the place would have been quieter. Anyway, really a great experience overall! Saved the place to come back next time we're in NYC."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcmFYTXpTVTkyYWpRMmRta3RVa0pNWWtGc1duYxAB",
            "text": "Ate here twice during a trip to NY - once for dinner and once for brunch. Really nice spot for casual food and drinks, and we were very impressed with the food and service. It does get quite loud in the evenings/dinner time but that is to be expected as it’s part bar part restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WT05YZHVVbWM1VDNCZk1qSTFOMDUzVGpOVVZrRRAB",
            "text": "Beer is good. That’s all."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCc1gwTkZVMU4yUTJkS2JFMDBPRkJJYkZWdU0zYxAB",
            "text": "The quality of the food was disappointing, it lacked flavor and did not meet our expectations given the price."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKR2Fub3l4aGFXM0VREAE",
            "text": "Nice selection of beer on tap"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNW92eWh3RRAB",
            "text": "Well serving of every thing, we were well attended and had several options of seating, we went during happy hour and the drinks were good and strong. The food had a good mild mixture of flavors as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMFF6ZHdkMW8xYlVwd1Iya3diV3BKVm1vNFgyYxAB",
            "text": "clean and lovely place! good music and friendly staff. get the brussels sprouts and zucchini sticks!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLWG42Sm1fOXJtSkp3EAE",
            "text": "Great drinks and food! Will go again"
        },
        {
            "date": "5달 전",
            "language": "sv",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNSDN4YWlYOTRyazZnRRAB",
            "text": "Goda hamburgare\nTrevlig personal\nGod service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMNm1scURfbGZHZ2RnEAE",
            "text": "It was loud and crowded. The bbq I had was way too wet."
        },
        {
            "date": "5달 전",
            "language": "uk",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKTFl6bzJjdk5mcDZ3RRAB",
            "text": "Дуже смачно. Файні люди. Атмосфера. Просто супер."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJN0s5NS1Lbk8yZTdnRRAB",
            "text": "as a server myself, service was very mediocre. it took forever for a server to come even get our drinks i just had a feeling its because we were a younger age group and none of them wanted to take care of us. 2 soft drinks, 1 bar, and our…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOM1k0YnVveGNfSzZ3RRAB",
            "text": "Nice evening in a bar with some elevated food. We were able to get in with a larger group with a couple hours notice, but place was pretty full by the time we finished. Food was solid. I had the tuna tar tar and short rib and enjoyed both. We were seated at an upstairs table, so service was a little slower but not bad. Atmosphere and vibe was chill and fun. Would go back again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPM3RfYkxFb2JUdjNBRRAB",
            "text": "The place is very nice, their beers are not as good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOeU00OTZDcDdlYzJnRRAB",
            "text": "For other tourists: don't bother if you are not dressed like Wall Street people. Come! The staff and the audience are welcoming."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0OEpQTXRnRRAB",
            "text": "이름 부터 몰트하우스 여서 맥주가 맛있을거란 기대를 했는데, 결론적으로 실망스러운 맥주였습니다.\n그냥 일반 레스토랑에서 파는 맥주라면 그냥 마셨을텐데.. 이름이 몰트하우스 잖아…\n우리나라 호프브로이 같은 싱거운 느낌의 맥주….\n조명이 좀 어둑어둑해서 술 먹기엔 좋은 느낌인데 그러지 못해 아쉽네요.\n서버 분들은 정말 친절해서 사실 많이 먹고 싶었는데\n그러지 못해 아쉽네요.\n대체로 관광객들이 많이 오는 펍의 느낌."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNcTl6THBnRRAB",
            "text": "전형적이라면 전형적인 미국식 펍. 우선 스포츠채널이 크게 틀어져있고 근처 브루어리 맥주를 취급하는 곳. 목요일 저녁인데 11시까지도 사람들이 많고 매우 시끄러웠어요. 차음 들어갈때도 너무 시끄럽고 다들 바 앞에 서 있어서 깜짝 놀랐어요. 월가 근처라 그런지 뭔가 양복을 입은 사람들이 많아서 그것도 응미로운 요소중 하나였어요.\n안주도 종류가 아주 많은 건 아니지만 그럭저럭 식사대용으로 할만한 것들이 있긴 했어요. 먹을 만한 식당이 너무 일찍 문을 닫으면 좋은 대안이라고는 못하겠지만 그나마 대안일 수 있는 듯"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbkplNGdBRRAB",
            "text": "It’s Monday 23:32, me and my friend arrived 10 mins ago. IM IN THE DEEPEST SHOCK. We were not welcomed at all in the front and felt very rushed to figure out where we wanted to sit. I get it, it’s not Saturday, but Google says you guys are open till 2 am. That’s the reason why we chose to come over and have drinks and meal here at the  first place. If you are ready to close down at 11 pm, mark it on Google, don’t fool people. Bartender and the front crew weren’t  happy with our presence at all, girl in the front was smiling and accommodated, but the moment we set at the bar,  the bartender threw menus at us on a counter like he is making us a huge favor. We asked if kitchen can cut a burger for us for 2 and he made a very TALKING FACE, Saying that best we can hope for is 2 toothpicks. We got our food order, which was wrong, we ordered burger with salad, not fries, we also got chicken bites and I asked the bartender if they had any blue cheese, he didn’t even turn on me, he just mumbled “yeah, give me a second” and went wherever.\nAWFUL SERVICE. DISGUSTING.\nI’ve been in hospitality for 13 years myself and I have never ever in my life felt so unwelcomed for no reason. It’s outrageous and you never should make your customers feel that way.\n\nNever coming back.\nYour stuff should know better\n\nP.S the moment we ordered our food, bartender decided that a convo with a coworker is more important so we could never get an extra blue cheese sauce, even though we were calling for him.\n\nP.S AN UPDATE. We did manage to ask for a sauce and he returned back from a kitchen with a smile telling us we are not getting any sauce whatsoever because kitchen is closed.\nNo one ever communicated this and gave us a last call and the delivery is just OUTRAGEOUS.\nI cannot remember when was the last time I had such a horrible service. HORRIBLE"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyXzZDRnJ3RRAB",
            "text": "The atmosphere is perfect for dates or to hang out with friends at the bar. They have seating that’s nestled away for more private conversations or work lunches/dinners. The margarita flight is worth it if it takes multiple drinks for you to get there. They give you favorable portions of food for the price and it was very well seasoned. I am giving 4 stars because service was slow and the place was not busy at all. We had to wait a bit and it was hard to get anyone’s attention."
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdnRtUzNnRRAB",
            "text": "Un accueil chaleureux et très professionnel au Malthouse, situé en plein cœur du district financier de New York. Le service était irréprochable, et les plats étaient excellents, avec des saveurs parfaitement maîtrisées. L’ambiance est conviviale, idéale pour se détendre après une journée dans ce quartier animé. Une adresse incontournable pour un repas de qualité avec un personnel attentionné. Nous reviendrons avec plaisir !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLdk1fR01nEAE",
            "text": "Service: great service. Friendly staff.\nFood:\n- best loaded nachos I've had in a long time. They're on a flat plate and not stacked, so every nacho is covered with delicious toppings.\n- fried chicken sandwich and fish tacos were also really delicious.\n- all food portions are really generous.\nDrinks: great beer selection. Overall really satisfied.\nPrice: everything was a bit more expensive than i think it should have been."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqXzdpUDNRRRAB",
            "text": "Great ambiance at Malt House! Despite needing a reservation, we were pleased to be seated in the bar area. We visited specifically for their burgers and tried the American Tavren burger and crispy buffalo. Both were tasty, but the American Tavren burger stood out for us. The staff were incredibly accommodating and friendly. A lovely experience overall!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMk5fZ2V3EAE",
            "text": "For my first time coming to The Malt House was a pleasant experience. I came during brunch hours. I ordered the steak and eggs. The steak medium well and eggs sunny side up. I also got the bottomless mimosa upgrade which is 90 mins of unlimited mimosas from 10am-4pm Saturdays and Sundays. The waitress was hospitable and friendly. The service here is a 10/10. I would highly recommend The Malt House to anyone who prefers or likes American styles cuisine. ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOG8yYzJnRRAB",
            "text": "Forgive the quality of the pictures.  The place had dim lighting.  Wonderful atmosphere.   Very loud in there so if you're easily over stimulated, where earplugs.   But this was a 10 out of 10 for me.  Staff was EXTREMELY friendly and pleasing.  Spent 2 hours there.  Absolutely worth it 👌🏼"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaEtXdWNnEAE",
            "text": "Had a great experience at the Malt House! The service was amazing, from the hostess to the server to the food runner. Our party ordered the chicken wings, cheese curds, braised short rib (super soft), and the tavern burger with French fries. The only thing that wasn’t what I expected was the “Diet Coke”.  It tasted like Cola. We asked our server and she confirmed it wasn’t coke product that they sold. Other than that, everything was amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbzVDbG9BRRAB",
            "text": "Ya know when you order a burger a temp down so that when it comes to you, it's actually the temp you want? Well here you don't have to worry about that. I ordered medium rare burger and I got the most perfect medium rare burger I've ever received. Sooo delicious and well seasoned but cooked for absolute perfection! Vibes were on point. My extra dirty martini was delicious. Service was lovely - everyone was kind, attentive, friendly, tactfully conversational, especially Maxwell the bartender who made dining there personal as a solo traveler. I loved every minute of my experience. PS peep that stack of fries covered in cheese and herbs. Don't skip those either ;)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMWZqWTVRRRAB",
            "text": "Customer service was great! I sat downstairs and I love the set up. Tables were separated from one another and the bar staff was efficient! Reason for 4 stars is the brunch menu is very limited. There weren’t that many options to pick from. The bottomless mimosas are a must! Definitely recommend the death trap! It’s sooo refreshing! As for the food LEMON ARUGULA BURRATA BOWL was delicious, the burger is also really good and juicy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINXE2cDF3RRAB",
            "text": "Went for brunch and got the cheese curds, crab cake benedict and short rib breakfast burrito which were all tasty. Also got an espresso martini (can’t taste the espresso) and bloody mary (too spicy) which wasn’t our fave. I asked the server to replace the breakfast potatoes with fries but she ended up charging us for a side of fries without replacing the breakfast potatoes which was not mentioned when asked."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcU1yMVFBEAE",
            "text": "Delicious restaurant located in the financial district. The restaurant had excellent aesthetics and decor. The service was great. The drinks were crisp, refreshing and perfectly balanced in flavor. The salmon was incredibly fresh, moist and presented beautifully. Along with the sauce each bite was rich and bursting with flavors."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbktlaTRRRRAB",
            "text": "Came in after circling so many blocks with our big (15 person) family on a Friday night. Malthouse immediately seated us and provided incredible service and kindness. All meals came out together, fresh and hot and delicious and plates were cleared right after finishing. I recommend the steak sandwich! The food was so good, from apps to entrees and the environment is cozy. Loved the Christmas decorations and circa 2010s alternative rock. 10 stars all around. Thank you so much for a great experience in NYC!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aV9hMm9RRRAB",
            "text": "Headed to Malt House for a quick happy hour meal. The music was a little loud for my taste but it’s known to be a happy hour hang out spot so I wasn’t too surprised. The happy hour menu was decent. I ended up having a tequila based cocktail (the death trap) for $8 it’s wasn’t very strong but still good. I also tried the buttermilk bites! They were very delicious, well seasoned, crunchy yet tender on the inside. For my main I had the Day Boat Scallops and WOW!! I was blown away. I did not expect such a complex and flavorful meal here but was pleasantly surprised. The scallops were cooked to perfection with a slight saltiness. The peas and carrots were creamy and pores perfectly with the scallops. I will def keep this spot on mains for future happy hour/dinner dates. Two of us spent under $100 here. I’d say it was a good price for what was offered."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGZYeHVRRRAB",
            "text": "Really great dining experiences. I've come here with friends for lunch and the atmosphere is very welcoming. Not too loud, the decor feels a little steampunk but they have some nice flowers mixed in. Food is great and good options to pick from - burgers, entrees, appetizers, etc.\n\nJust did a private event with Malt House and we got a private room where we had personal service there, they were very attentive and left everyone feeling well taken care of. I will definitely consider hosting my future work events here! :)"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dTQtcGtnRRAB",
            "text": "Petit pub très sympa !\nAmbiance musicale, déco pub et ambiance très tamisée et les plats sont bons.\nAttention la bière est servie en canette donc surprenant pour les amateurs de pression.\nNous avons passé une soirée agréable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdXZTVkhBEAE",
            "text": "I just had a New York Strip Steam cooked medium rare with mashed potatoes, bread, and French fries! The steak was great. I would definitely recommend that the service was great and the atmosphere was upbeat, and I had a great seat to watch the game!  96"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdW9fN1JBEAE",
            "text": "Visiting from Texas and found this place while walking around the twin tower memorial on a Saturday morning so stopped in for brunch. I got the Malt House Burger and added an over easy egg! Its was amazing. My boyfriend got the burrito with fries. The burrito I would give a 4/10. It just was not something to write home about. The fries were really good! We got their bottomless beverages and we were able to choose the different options. I had the mimosa, Fritz, and bloody marry. They do pre make the mimosa batch. This as dissatisfying because  this made the mimosa flat. It was also brought with ice which is also out of the norm for mimosas. Overall I enjoyed the food, drinks, atmosphere and service! I would go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkLThHcGZnEAE",
            "text": "Cozy, dark (love a dark bar!), very reasonable Happy Hour prices. $9 house red, $4.50 one braised pork slider with smoked coleslaw (they let you buy ONE!). Just the right snack before hitting the subway home. Nice service. Was greeted by the manager as I walked in. Admittedly, he and a coworker were setting up the front picnic tables, but he still took a moment to smile and say hello. The little things matter. Music is upbeat and changes quickly, so if you don't love one song the next may be your cuppa tea.\n\nThe people next to me are having some kind of whiskey cocktail that comes with a lid bearing smoke ... smells devine.\n\nCome here after visiting Wall Street and Century21!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1ck9xNGJ3EAE",
            "text": "Amazing food of all kind! Burger, Carbonara, Mahi Mahi, Beer, Wine... ambience... and the service... we and the kids love  💕 it... we came to know that the chef has a Michelin 🌟.... granted and earned. Thanks for welcomed us and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREdTd2ZVJREAE",
            "text": "After a looooong day in New York City we were looking for a place to sit and eat and relax.\n\nWe stumbled across The Malt House and we weren't disappointed.\n\nWe didn't have to wait for a table and friendly staff seated us.\n\nThere was a good selection on the main and kids menus, and lots of choices for drinks.\n\nThe food came after a decent amount of time, and was very decent.\n\nOverall value for money was good, and I would recommend the nachos!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOWJqNGJ3EAE",
            "text": "Let me preface by saying that my friends and I came here on a Sunday right when they opened (10 AM). This was right after a 5K race that we ran a few minutes before.\n\nWhen we arrived, there were already a bunch of runners waiting for The Malt House to open. I could only imagine the surprise coming from the staff when they saw a bunch of people already waiting outside.\n\nWith all that being said, the staff were ready for us! Despite the swam of people, the service was fantastic and I also noticed how friendly the folks were  at The Malt House. BTW this place is super spacious!\n\nNow for the brunch food and drinks - I got the breakfast burrito and it was super tasty. We also all ordered the \"Deathtrap\" brunch cocktail which was AMAZING. Frankly, I would've ordered more if I didn't have to leave.\n\nAll in all, I was very happy here and will definitely return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMzRYQk53EAE",
            "text": "Food is very flavorful! Waiters could be more attentive. Chicken and waffles are only served on weekend. They play some really good music here. I would recommend this place if you"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcnFmVjlnRRAB",
            "text": "Highly recommend for Happy Hour, close to WTC. Beers around $6, certain mixed drinks are under $10. Also ordered fries and wings. Wings are very good. Bar was crowded but was able to get seated immediately. Staff was great, nice and checked in on us often."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeTV1aGl3RRAB",
            "text": "The place is spacious and had fun music during brunch. The crab cakes eggs benedict were excellent. Good crab cakes and perfectly poached eggs with a nice side of potatoes and salad. However the drinks were not great. The mimosa was and the bloody mary were weak and the sangria was very sweet. The service was good."
        }
    ],
    "reviews_count": 77
}