{
    "name": "Serafina Tribeca",
    "place_id": "ChIJ-0VhGB9awokRksxfZJBvigE",
    "grid": "MN1",
    "address": "95 W Broadway, New York, NY 10007, USA",
    "rating": 4.3,
    "user_ratings_total": 1389,
    "phone_number": "(212) 766-2700",
    "reviews": [
        {
            "date": "23시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oc1FVWkJVVk5xYmxndFNucEZaRlJSYnpWVGFsRRAB",
            "text": "This restaurant was awesome. From the appetizer to the desserts, it was great. If you want to look for Italian restaurant, I really recommend you this."
        },
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmb3ZPaWF3EAE",
            "text": "I had the best mojito ever. The costumer service was impeccable, everyone made me feel so welcomed. It was truly a great environment. The pizza was also amazing and came super fast. The bartender was super friendly."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeFdtNVJWRVJ4UzAxemFIbHdXRm90UjNCdFZGRRAB",
            "text": "Always like the food at any Serafina location.  Ordered a bean soup that the right texture and spice plus mushroom ravioli capped off with a class of Super Tuscan and creme brulee."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkR016QkZhV295YUhSUlRsaHZVelJCU1VsNmIzYxAB",
            "text": "Spaghetti carbonara was exquisite. Staff very friendly and the atmosphere very cody."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdFJGVjFhM2xUVjNkbVFYbGxkVnByTkU5SUxVRRAB",
            "text": "Stuyvesant Hs graduates of 1975 celebrated their 50th reunion here at Serafina in Tribeca. The food was Divine, atmosphere was right and the service from staff was exceptional! Nico and Cruz especially were extremely attentive! We were so lucky to select this venue!!! Thank you, Serafina - Christian our event planner was true to his word on giving us his very best! We will come again. 🥰♥️🍾❤️"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jd2J6TlRia3AxUzFSaFJuWk5XV05pT1ZoVFpsRRAB",
            "text": "El servicio y la comida excelente desde que entré, la atención, los precios y la atmósfera. Voy a volver"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdFVXNWpkMHRoV1ZGclNrUnpkVmhaVld4cWRVRRAB",
            "text": "Pretty mediocre food for the price, but an easy option for families."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201ek4zaFpkRVI2U1hRd1dXRllZMEZGY1ZOTlpuYxAB",
            "text": "Had such a great dinner at Serafina!! Patricia was amazing, so kind & had great recommendations. The spinach & goat cheese salad was delicious HIGHLY recommend. Penne alla vodka & chicken paillard were also incredible!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkM1ZWOXdOMWxLTjFWd1dVSnRSVlo2UjFGVE4yYxAB",
            "text": "Wow, amazing experience\nWe came in 5 with no reservation, and they gave us a great welcome and accommodate us right away.\nYou can tell the food is made from scratch because how fresh it was.\nQuick and professional and warm service.\nThe best hospitality experience at affordable price in comparison to this area and the restaurants around.\nGreat job Serafina Tribeca"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210aE1qSnFjR05zZWxrNFNGZHdhMlJUVWpCa1ZsRRAB",
            "text": "Food was good but Our waitress Umby was amazing! She was very friendly, attentive, and made sure we had everything we needed. Great service and a wonderful attitude!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTmRYUnRiVXB5TjE4MVFUYzFRVEZwV0ZwV1kwRRAB",
            "text": "We wanted drinks and some light food in the early evening and stopped into the restaurant because we saw a sign outside advertising the rooftop.  They directed us right to the top and we were able to have some freshly made cocktails and shared a few plates while we enjoyed the view.  If you have been to other rooftops in Manhattan you know the wait and the prices can be quite high for the view, but this was more affordable and had more of a welcoming, community feeling than other locations. Stop by before winter sets in!"
        },
        {
            "date": "2주 전",
            "language": "de",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNFpuWmFTRmw1ZGpaNFFVMVFhbmwzTmt4M2FrRRAB",
            "text": "Das Ambiente ist ganz schön dort. Das Essen hat uns auch gut geschmeckt. Der Service war leider nicht so gut. Sehr kurz und knapp. Als wir kein Dessert mehr bestellen wollten wurde uns ohne Kommentar die Rechnung vorgesetzt. Preis Leistung passt hier einfach nicht- viel zu teuer für ein kurzes Essenvergnügen."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWlVtZHpZMjV3WW5sRWNrOTNkMmxOVWpoU2VIYxAB",
            "text": "waiter broght everything at once. food was ok nothing special"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJd1dtVlpjVGRtZEdsWk1XNVRVVVJvTWxGWU0xRRAB",
            "text": "Jay is an excellent bartender — friendly, attentive, and always makes great drinks. Fantastic service every time!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNWFsQlVaV1ZNV0VGcWIxTnFWV3B0VFcwelpsRRAB",
            "text": "Always great, never misses! Ryan was our server and knows how to provide high-end excellent service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWWR6bFhPRlJOU20xb1VUWTBla295VWtVNGMxRRAB",
            "text": "Nice restaurant, good pizza 🍕"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNmNYcFlWemxLYjNCMlJrbExkSFV4V1V4MGNVRRAB",
            "text": "Fav Italian so far!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocVEySXlXRVZ4VTJWVldUZHZPRjl6VFdKa2FuYxAB",
            "text": "The atmosphere here was amazing, the food was delicious. Coming back very very soon!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcFFrcHZlazlUUVZJeldVNVJUelJIZFZWTmIxRRAB",
            "text": "Amazing experience really good food and great service with a great view!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMWRWQkJNWFpXVGs5TVNIQmthV1pXVG5BME1HYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nSerafina Tribeca — classy, cozy, and delicious.\nThe food is amazing, the ambiance is pure downtown elegance, and the service is always warm. It’s definitely on the pricey side, but worth every bite for the quality and vibe you get. Perfect for a date night or a special evening in Tribeca. 🍝✨ #SerafinaMoments"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkd2NGSnhWRk50ZFd0cGRYTmFPSGRSY2xrdFYyYxAB",
            "text": "Ryan was a fantastic waiter and a great ambassador for Serafina!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UmMydDRRMFJqTUZSSmIyVnZTVVpyVEhSVmJHYxAB",
            "text": "Very average food with hurried service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMWJYQXRTemh0YTBsU1VWbGlWbmwzUW1KR1FtYxAB",
            "text": "This place is a very nice vibe\nIt has a pretty rooftop with a beautiful view.\nI had some drinks which were delicious.\nAnd the service provided by Hector was on point. I definitely recommend this spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pad2Iwc3lNa04yYlUxdGIzSXRUWGRyTFVaSFZYYxAB",
            "text": "Best chicken Milanese in New York. Never seen a chicken that big before in my life"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVFFYWlNRMnRtYUZaUk5UaGlja3hTVTBsNlEyYxAB",
            "text": "Great rooftop with view on the jinga tower and liberty tower"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toZmJGbzVOVGd6WlV4RVIyNHlia1l6VWxKM1pXYxAB",
            "text": "I have nothing but wonderful things to say about this place. The experience on the rooftop was superb and all of the food was absolutely amazing. We had a party of 10 and ordered multiple cocktails, bottles of wine, appetizers, entrees, and deserts and everything i tried was so good! You can't go wrong with the pizzas too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeGRtRmZhM0I2TUUwMlFrRTFaVmhmZEMxcWFVRRAB",
            "text": "A lovely place locating along the street. Nice Napa wine and delicious pasta m. And warm service from Ryan. Haha. Good to try this place! They are all very friendly!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGT1FXMXZYM0pPZDBoUWRYQXRjSE01YlRKaFlVRRAB",
            "text": "I can assure you that hey have amazing drinks & not only that but the food & service is exceptional. Every worker is very patient & attentive when it comes to their customers. I come here for the lychee martini’s they are TO DIEEE FOR."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ZlNraHhkVFZ6TlRacmFFMHdPR0o2YVZWWVltYxAB",
            "text": "We visit the bar at Serafina Tribeca every time we come to NYC. Cruz at the bar is fantastic and has great energy. It is a must visit visit if you are in the area!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFek5rVklTelV0VUMxS1IwcHJaa1p2UnpKRlpIYxAB",
            "text": "I had an incredible time at Serafina! Our server Clemente and bartender Sebastian were so welcoming! The atmosphere is simply amazing, with a lively vibe and an incredible music selection that really sets the mood. I have to give a huge shout-out to the bartender—they're not only a master at crafting perfect cocktails but also genuinely kind and welcoming, making you feel right at home. The decor is absolutely breathtaking and adds to the whole thrilling experience. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNGNqbGxZMHRXYm1sbGRTMTFha0ZsT1c1dWVHYxAB",
            "text": "Rooftop is so lovely and authentic New York vibes . Sebas served us well :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTlJUUnVObHA1VkU1RU1YVnVSa3RVYTJGMFkyYxAB",
            "text": "This is my son’s favorite restaurant, which is fantastic for the rest of us because we can enjoy a delightful meal while he indulges in the offerings of the children’s menu. Highly recommended for families!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVE5VaFhXV1pxVDFwWmFFNWhNemx0TFU0d2MxRRAB",
            "text": "My friend and I were starving after eating tasty but absolutely non- satiating salads a few hours earlier.  We wanted to eat something that would make us satisfied, since the salads did not do the trick. Lol.  We were in Tribeca. Odeon was crowded (I really wanted a burger) so we went to Serafina, which had a decent crowd for a Saturday night, but luckily for us, no wait.\nEverything looked good, and it was hard to choose but we finally decide to select and share the  eggplant parm and penne with vodka sauce. Man,  was this pasta delicious! It really hit the spot. The service was good, (although they still have the Covid era QR code menu thingy that I detest) the ambiance ok (we sat outside under the shed since the music was pretty loud inside). A no-brainer if you want tasty, satisfying pasta. Serafina never disappoints. You should definitely go!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSWFtNTRVMVkwWm10cWQzVklVVUpLYmtsWk1FRRAB",
            "text": "Such a cute place with great food! Their burger was delicious, penne vodka was outstanding and their salmon was perfectly cooked. I can’t complain!!!! Everything was perfectly seasoned."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KR2JYSmplbGxqUlZGRU9VSktjbUY0UjNjd1gyYxAB",
            "text": "Niko maravilloso servicio mejor imposible"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTGQyZElTMWh0Y1VKUE9FSlpWM2cxVW5sS1ptYxAB",
            "text": "Exceptional service! Beautiful views! Shoutout to my server, Jay 💖"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RlUxTktYM2xTVW5waWNVeFdjMlJ3WmpSaU5VRRAB",
            "text": "I had an amazing dinner experience at Serafina Tribeca recently, and I can’t recommend it enough. The restaurant has a chic and cozy vibe, which makes it the perfect spot for a night out, whether you’re on a date or with friends. The ambiance is both relaxed and stylish, with modern touches that make you feel comfortable right away.\n\nWe started with the famous Serafina bruschetta, which was fresh and bursting with flavor. For the main course, I had the truffle pasta, and it was hands down one of the best pasta dishes I've ever had. The pasta was perfectly al dente, and the truffle cream sauce was rich but not overwhelming. My friend had the margherita pizza, which was crispy on the outside, yet soft and chewy on the inside – just the right balance.\n\nThe service was impeccable. Our waiter was friendly and attentive, making great wine recommendations and ensuring we had everything we needed. The vibe was lively but not too noisy, which made for a very pleasant dining experience.\n\nSerafina Tribeca is definitely one of my new favorite spots in the city. Whether you’re craving Italian comfort food or just want to enjoy a great meal in a welcoming setting, this place should be on your list. I’ll definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wM2RHdENkbGhZY2xoRWNsaHBWREZxYkRacmIyYxAB",
            "text": "The atmosphere and the food were simply amazing. The drinks were very delicious as well. We had the Paglia E Fieno and Ravioli Degli Innamorati dish and it was phenomenal. We also had a side of their truffle fries. Everything was cooked to perfection and the presentation was nice as well. The service was a little slow and our drinks came out after our meal but besides that everything was great! Definitely recommend going to this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVGVrMHllamxvUjFsNVVuWjJRV3BLY2s1SGMwRRAB",
            "text": "Ryan is the absolute best! Took care of our group of 27 and I cannot thank him enough!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aFoyMWtUVmQ2WXpoMlZEazBSa3hmTjJaS1ZWRRAB",
            "text": "Great service and food, Sebastian, one of the bartenders, is fantastic! Plus the rooftop views are amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWVJVWlpWazF1VGpGemVTMTVSamN0VVZSekxVRRAB",
            "text": "Best food, service and ambience in all of TriBeCa. Make sure to get Sebastian & Clemente, such a great team and never disappoint with a good time. Can’t wait for my next trip back:)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodVpUbG5VV1pRTTJRek5qbG5SbTVqWmpSdmJrRRAB",
            "text": "Always the best service, food and vibes! My favorite Serafina location in the city. I’ve been living in Tribeca for 14 years and it’s my go to spot and it never disappoints:) Sebastian (see pic) and Clemente are amazing & so attentive with impeccable service, so make sure to meet Sebastian at the bar 👌👌👌 I always order the chicken paillard with sautéed hearts of palm, which is perfection 💯💯 oh and the best rooftop bar in town with views of World Trade Center."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNE1hbHB3RRAB",
            "text": "Our server Ryan was great drinks are perfect"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdlNVTkxaRTEwZVZadmExRnNWbWRwZDNadU5IYxAB",
            "text": "We went to dinner one evening at Serafina, and it was good. The staff was so great. The cocktails were good, and The food was good. The views were great if you sat on the roof, which I would highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MFJGSkxVRmRaYkZOTlYyUlBXbmsyV0hFdFUyYxAB",
            "text": "Great atmosphere and vibe. everyone’s really friendly, accomodating and pretty fast service. Food had great flavours can’t complain!\nServed by Ryan!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTmNXRmlkM1pxV0VGQ05FWjZMVFZwZFRCRVVIYxAB",
            "text": "Conveniently located in Lower Manhattan this place served some of the best Italian food I've had with exceptional and fast service from Ryan and his team.\n\nAmazing entree, main and dessert.\n\nWill absolutely be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wQmRYSXhWazltWkhoM09HcHpPRWxEUkMxM1VVRRAB",
            "text": "The best service, the best drinks, the best food. Ryan is the BEST. Ask for Ryan!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVVNTMUNPVWxNZFRjMkxWRk9kM0ZuZVZRNFprRRAB",
            "text": "Our waiter Ryan was the literal best."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVVlrRnJUbmx6UWpCVVRHOTVTRkpEWnkxc01VRRAB",
            "text": "We got the chicken parm, bruschetta, and brussel sprouts. The chicken parm was fine but average. Bruschetta was good. Brussel sprouts were undercooked"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRlFXZHZWVlZpYldwZmFUQlhUakp6TTAxUlgyYxAB",
            "text": "This place is one of the best in NYC.  The food and drinks are reasonably prices and so good!  The best part was the rooftop bar with the amazing bartender, Sebastian.  All the of the staff was super friendly and accommodating.  Sebastian made our visit most memorable and was the most awesome bartender.  So friendly and always kept out glasses full!!  So excited to go again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMWVsTnpWMVJXY0VWdmFXNUNZblpNWkRWTE5HYxAB",
            "text": "I had an amazing experience at Serafina! I ordered the Serafina burger with truffle fries and the “My Passion” drink—everything was absolutely on point. The flavors were rich, fresh, and perfectly balanced. We sat on the rooftop, and since we arrived early, we practically had it all to ourselves, which made the ambiance even more special.\n\nThe highlight of our visit was Sebastian, our waiter. He was extremely attentive, friendly, and incredibly knowledgeable about the menu. His service truly elevated the entire experience. I’ll definitely be asking for him next time. Great food, excellent service, and a lovely rooftop setting—everything was just perfect!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd3Izb1JREAE",
            "text": "Amazing Italian restaurant in the middle of Tribeca. The Italian Red Shrimp tartare was really fresh and sweet. Absolutely delicious. Everything we had was awesome."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQREFnUGZUOU16Smp3RRAB",
            "text": "The bruschettas were spectacular and the pasta too!! Big portions, which is important if you’re walking around the city to have some energy 😂 Ryan was very kind and attentive with me, as well as all the staff. Would 100% recommend!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xV1JpMDNWM1pGTW1NMk5WTnBTRTR4TW1kNFJGRRAB",
            "text": "Amazing service, great drinks!!  My bartender Ramiro made me a delicious ‘Venus dream’, and got to try the ‘V.I.P. Pizza’. Such nice authentic Italian food!! 100% recommended!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURILWNXZE53EAE",
            "text": "We were treated like VIPs here! Had a lovely time and ordered so many wonderful things. We dined on the rooftop and it was such a lovely night to do so. Even if we had dined inside we would have been happy because we peeped the decor and every inch of this restaurant was so cool. They have a wide menu with pretty much anything you could possibly want on it, so I feel like it may be really easy to find something you like here. My sister's pasta portion was HUGE too, we kinda had a cheeky laugh over that! Overall, I loved my experience here and would def go again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveFB6cENBEAE",
            "text": "Popped in for a quick lunch, quick attentive service, pizza made fresh and delivered piping hot. 10/10. Will be back when in the area for sure. Extensive menu, good traditional Italian selections, bathrooms are upstairs."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPX01sNFRjemEzeHBnRRAB",
            "text": "I chose this place to have a business luncheon with the management team.  It’s not far from and offered a nice selection of options for lunch.\n\nThe restaurant is somewhat spacious and offers seating indoors or outside in an inclosed sidewalk setting.   Lighting was a little dim which is not a big deal for me as I like dim lighting.\n\nWe sat in a booth it was 6 of us and we fit ok. The food was delicious and the portions were very good. The bread with olive oil was especially delicious. I’d definitely recommend them to someone looking for a more elevated lunch option in the area. I had the DiSofia salad and added chicken to it. It was very good."
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNGVlS19nRRAB",
            "text": "Leckeres Essen, schöne Speisekarte, für jeden was dabei.\nMan kann gemütlich sitzen, sowohl drinnen als auch draußen.\nSehr freundlicher, zuvorkommende Service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNQM2VraxAB",
            "text": "Serafina Italian Restaurant exceeded all expectations! The service was attentive and friendly, making the experience even more enjoyable. The highlight, of course, was the food—both the pizza and pasta were absolutely delicious, showcasing authentic flavors and perfect preparation. Pairing the meal with a glass of wine elevated the evening, and the beautiful atmosphere made it a place I’ll want to visit again. Whether you’re looking for a casual meal or a special night out, Serafina is a fantastic choice. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkV1NFOVZkVGh2T1RZeFp5MURjVWxRVXpRMmMxRRAB",
            "text": "Best vibes especially the rooftop. Bartenders are amazing and so fun. Every time a friend comes in town I always bring them here. Can’t go wrong"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWmJtSklWVlpzUTJWVlIyZHFiVU5QZVRocWRGRRAB",
            "text": "Every is great about this location 🙌🏻 Jay was amazing - with drinks, food suggestions and a great company during the night !! Highly recommend spot !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNVVEQXRhMjFRYTBWWlEzTlZORUk1WHpseVZIYxAB",
            "text": "Food highlight of this year. Serafina makes you into the consummate “perfect” guest as you’ll be tempted by - and seriously enjoy - apps, entrees, and desserts.\nApp: Meatballs (delightful)\nEntree: Penne alla Vodka (superb)\nDessert: Profiteroles with chocolate drizzle (heavenly)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNy1EQWt3RRAB",
            "text": "I was being told by my husband who stays in hotel fredrick on his official trips, that  it’s one of the best Italian restaurants in NYC.\n\nI personally would say it’s good enough but won’t rate it as one of the best Italian I have eaten.\n\nI had ordered bruschetta, ravioli and pizza.\nRavioli was average & not quite upto the mark for me in taste & flavours.\n\nThe decor and ambience is inviting and staff is cordial.\n\nIts good enough option , but to call it as one of the best I need to try few more options maybe"
        },
        {
            "date": "10달 전",
            "language": "nl",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MV9yTFN3EAE",
            "text": "Op een vrijdagavond zat het bomvol. Gezellige sfeer. We moesten best lang wachten tot we konden bestellen. Hadden een ‘wiebel tafel’. Het eten was heerlijk.\nWaarom moet een fles water $10,- kosten? Dat staat toch niet meer in verhouding?"
        },
        {
            "date": "10달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbWFtVTNBRRAB",
            "text": "Serata indimenticabile in un ristorante veramente speciale. Un locale accogliente dove abbiamo mangiato dell’ottimo cibo. Tutto ha reso resto la nostra prima cena di Natale a New York davvero magica. Personale e Manager sempre attenti e disponibili assolutamente consigliato"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdWNLSTlRRRAB",
            "text": "we’ve had the best dinner in nyc in this restaurant. the quality is just top tier, whether it’s for the service or the food, you can feel and taste the commitment and dedication of the personnel, which gives the best meal experience to the clients.\n\nChristian, the manager, has been attentive in making sure everything worked perfectly and was a pleasant and friendly presence.\n\nI will recommend it to all my friends⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubXF5azhBRRAB",
            "text": "Nice experience. I ordered the carbonara, which was absolutely delicious—rich and perfectly cooked. We sat on the roof, enjoying a stunning view that made the evening even more special. For appetizers, we tried a  meat platter that I forgot the name of- consisted of an interesting whipped sweet cheese with meat that was a delightful surprise. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3LVphNEdnEAE",
            "text": "I love Serafina, it’s my go to spot for consistent italian food. My last time going the experience was exceptional thanks to Ryan. He was on top of everything and all his suggestions were beyond delicious"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gc1FUaGxYMEppVVMxeVVGb3hPREJrV1hWNFVYYxAB",
            "text": "A little noisy but extremely tasty foods with large portion sizes."
        },
        {
            "date": "11달 전",
            "language": "vi",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNFpDeUxnEAE",
            "text": "Quán này nhiều chi nhánh , tui thấy chi nhánh Tribeca với Time Squares ổn nhứt về thức ăn . Thức ăn thì cung ổn, ko sieu ngon ko dở, tay nghề ổn định, ăn lần trước sẽ giống lần sau. Tui kiu mì Ý cọng dẹt Với sốt ragu bò, tui thích loại sợi này. ghệ tui chiều tui mới kiu burger tại tui vừa thix pasta vừa thích burger. Burger ăn dở nha đừng kiu. Cocktail tui kiu Espresso Martini món ruột của tui, ngon, mạnh đậm nên tui cho review quán này 5 sao chớ ko thì cũng 3 sao thoi."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyOXBMV053EAE",
            "text": "Accidentally found this fabulous place. We needed something good for lunch. I had no clue where we were going. I just liked the setup of the tables at the terrace.\nFinally it was quickly proven that this is a top Italian restaurant.\nCaprese was fabulous. Even the bred and the home made like olive oil was fantastic.\nSince we stopped for lunch my wife had a spaghetti carbonara and I had the lobster spaghetti. I wanted to try a Sauvignon Blanc with the pasta but the sommelier recommended sg. that I was not familiar with but definitely suited my dish.\nTiramisu is a must try.\nAll dishes were fabulous, wine was excellent, service was professional. What else could you ask for? Perfect place, try it and you will not regret it for sure."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNzVIYUFREAE",
            "text": "Beautiful and cozy place. The food was fresh, tasty, and well presented.  Staff and service were super attentive, detailed, and kind. It's definitely a place to visit and eat with friends and family."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdjZqTTFnRRAB",
            "text": "Had a pleasant experience here celebrating a friend’s birthday. The location is nice and the inside is beautifully decorated. One of the better locations I’ve found as I’ve been to the a few of the locations. The staff were friendly and attentive along with the food coming out quickly. The drinks were made strong which makes it worth the high price but the food I would say is definitely over priced which is the only reason why I deducted a star. The food is delicious but you’re really paying for the name, the location and ambiance when it comes to Serafina so you have to go into it knowing that you’re going to pay a premium for that. Other than that, we had a great time."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRb2JyVzFRRRAB",
            "text": "Serafina is my go to restaurant for a quality steak, dessert, and more. I try to treat myself to a meal at Serafina at minimum 2x per month and I always find my experience here an absolute pleasure. I was served today by Ryan who made sure everything was top notch."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUFdXczVUVEZ3WlRGc1JUUTRWVXN6V25vMUxVRRAB",
            "text": "We had a dinner meeting  for 10 people and were seated in the second floor,  very comfortable and perfect for our group size.  Nico was our waiter for the evening. He is professional, friendly and welcoming! I've dined at Serafina Tribeca numerous times and enjoy the atmosphere and good food, hence chose the location for our dinner meeting. Thanks again Nico!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNHBfYzFBRRAB",
            "text": "Amazing truffle risotto!  Worth the $.  Other greats were the chicken parm and the orrechiette.  Tiramisu is a must for dessert!  Great experience with a live music for Mother’s Day.  Staff was friendly and worked exceptionally well with a packed house."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214U1FuRktkbFJvVUZOTlNqWlpUVFJ4T1VSQ1VWRRAB",
            "text": "Really delicious. Always a great option! Would recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOU16cFdREAE",
            "text": "We were spending a couple of night at the Frederick Hotel and were given 2 free drink tickets upon arrival. After a show on Broadway Friday evening, we made it back in time to use those tickets before heading out the next morning.\n\nWe both went with espresso martinis (one made with tequila) and we decided to try the chef special appetizer (and so happy we did because it was delicious!!!)\n\nCharred octopus over house made burrata — an absolute must! Service was very attentive and overall great and we sat on the enclosed patio which had great outdoor, pretty vibe.\n\nA great ending to our NYC trip."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN01ucEtREAE",
            "text": "“It was my first time visiting this restaurant, and I had dinner and cocktails on the rooftop. The bartender, Ramiro, was very kind, introducing the dishes and drinks, which made for a really great time. The atmosphere, music, and service were perfect, and I’m so glad I found this place. Highly recommended!”"
        }
    ],
    "reviews_count": 79
}