{
    "name": "Locanda Verde Tribeca",
    "place_id": "ChIJTWkuhfVZwokRS_go-fdp7Vs",
    "grid": "MN1",
    "address": "377 Greenwich St, New York, NY 10013, USA",
    "rating": 4.4,
    "user_ratings_total": 2245,
    "phone_number": "(212) 925-3797",
    "reviews": [
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaFVGTlhNMkp6TFRCM2JFZElhREpQVG1KUWRtYxAB",
            "text": "See my profile contact me business owner.38"
        },
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTFQwSlJPR05aVkV0eFZIQlJOWFpUU25ZMFoxRRAB",
            "text": "See my profile contact me business owner..."
        },
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcWNUTjVNbVpZZW5aMmJYVjZNRXhDU2pGYWJsRRAB",
            "text": "Loud environment and dirty tables. Worst dining experience ever."
        },
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQ1FrOWFWMFpQU1RKNlJtTlZVbmhRYVVGT00wRRAB",
            "text": "The staff were rude and seemed annoyed when we asked questions."
        },
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUk1VMVpNV2hWTFRKa2FHbHRNMDlvVmtkM1ptYxAB",
            "text": "Waited over an hour for our meal and it still arrived wrong."
        },
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FdGNIWk9ZVkE1VnpsT2RsUnVUV2hMT0doeU1HYxAB",
            "text": "The food was cold and tasteless. Definitely not coming back."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTFZqbHpTa1k1VDJac2EwdGxNWFp2ZDBSRlYxRRAB",
            "text": "Situated in Hudson Yards, Locanda Verde Tribeca is an exceptional Italian restaurant.\n\nUpon entering, one is captivated by the intimate details and ambiance of the interior.\n\nThe food is truly delightful; I particularly enjoyed the Eggplant Lasagna and the Sausage with Ear Pasta.\n\nFollowing dinner, take pleasure in a lovely evening stroll around Hudson Yards."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdldHSmtlbTlWZDJVMU1ucDBkMk4zWkRCVFpVRRAB",
            "text": "We’ve eaten at Locanda Verde several times before and have always been fond of the place, so it’s a real shame to say our recent visit was so disappointing.\n\nWe booked a late lunch at 2:30pm, not realising that the restaurant closes at 3pm. It’s frustrating that they accept bookings that late when the team is clearly preparing to shut down for the afternoon. The atmosphere was flat, and from the moment we sat down, everything felt rushed. Despite asking for a break between starters and mains, our mains arrived before our bottle of wine, and the entire meal was over within an hour.\n\nWhile the starters were very nice, the mains — the porchetta sandwich and the chicken — were both dry and underwhelming. Overall, the food and experience just didn’t live up to what Locanda Verde used to be.\n\nIf you’re after a great New York lunch or dinner at any time of day, head to Via Carota or Gramercy Tavern instead — you’ll spend less, eat better, and enjoy genuinely warm service. Unfortunately, we won’t be returning to Locanda Verde."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUGVtUklSVmhrUWtOaGJUVTJaVUk1UlRSeWRFRRAB",
            "text": "Came here for a solo brunch. The food was great. It might be a little pricey for a solo meal but if you want to treat yourself, you should!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWU09UaDBUMGRHWDIxakxVcE1jM1phU21zd1YwRRAB",
            "text": "10/10 experience went here with friends to celebrate my 30th bday. Food was delicious and they sent us out tiramisu for dessert!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTWJqZHFWQzFMV0doUFNqUlVSVE41VjJsQ1UxRRAB",
            "text": "Weird experience tonight and it pains me to write this. I’m a huge fan of Locanda Verde, especially the Tribeca location. Made a reservation for my wife’s birthday about two weeks in advance and clearly listed it was my wife’s birthday. They were about 15 mins late seating, not a big deal at all, we had a drink at the bar. But then they proceeded to lead us into the back room with absolutely no music, no vibe and no energy. Major mood killer! Totally different experience than main room. I felt like Sloth being chained in the dungeon.\n\nThe food was excellent. We ordered the Cesar salad to start (10 out of 10) and then the lamb meatball sliders (also 10 out of 10) and steak tartar (8.5 out of 10.) Next course was the ravioli. It was excellent but not hot (not cold either but it def was sitting for a while before they brought out to us overall 8.5 out of 10.) We split the half garlic chicken as our main (9 out of 10) and crispy potato’s (5 out of 10) they were inedible, way too salty. We complained and they sent us new ones albeit it took 15 mins to bring out. We also ordered Brussel sprouts (11 out of 10) they are to die for. For dessert we ordered the tiramisu (10 out of 10) and they brought out a candle for my wife’s birthday.\n\nService was excellent no complaints there. Solid water game although they didn’t really come over and ask us about reordering cocktails so we only had two drinks the whole night but overall, I have to say it was a real miss with putting us in the back room. Really killed the vibe for us."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMFQxUnRabkpMWkdJMUxXZFZObVJEYzNwMmJuYxAB",
            "text": "We had a great experience with Saturday brunch.  Our group had the frittata, egg sandwich, steak and eggs, eggs Benedict and the sheep’s milk ricotta and crostini.   It was all excellent.   Oh and the Bloody Mary’s were classic!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWWJuYzFSR3htVkRCa1JUSmlaVzFMTFVjemEzYxAB",
            "text": "Amazing experience! The menu was superb, and the service was friendly and attentive. Highly recommend!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WV1YxQk5ObEpSVlRGaWNITllObU5NYTA5TU5uYxAB",
            "text": "Always has amazing food and service. We usually don't order dessert, but this time we did. Absolutely the best tiramisu all of us have ever had. Love this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wc1UyRlJWVXhhZERkaVNHMVBOSGwzWkRkRVoxRRAB",
            "text": "This place is a gem, a true delight for any day, whether it’s sunny, rainy, or anything in between. I love the warm atmosphere and the charm of the restaurant. The service is quick, and the food is consistently delicious. I highly recommend everything on the menu: pasta, fish, steak, and all the starters are our favourites. Especially the beef tartare is absolutely outstanding!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMldHeFFjbmhHVmxCcGJtRTVTemRMT1ZsVlZVRRAB",
            "text": "Had a pretty bland dinner here. Came here right when they opened Saturday with reservations and sat us probably in the worst seat by the entrance and it wasnt even full basically empty.\nFood was just okay. Steak tar tar was probably the best dish of the night but they put an odd fried quail egg on top instead of egg yolk and a super thin slice of bacon is basically unneeded.\nPasta was very underwhelming and lamb chops were good. They dont even have complementary bread?\nCocktails are decent tho, but dinner was mediocre"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdmQwUlFaRkEwVm1aSVNFWm1ZV05mYlVGU1dGRRAB",
            "text": "Love this place for the vibe but the pasta was off. The mushroom crostini was so good, as was the steak tartare, but both of our pastas weren't great. I'll go back, but will stick to the small plates."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacnBTQnpBRRAB",
            "text": "You can never go wrong with Locanda Verde! Amazing food, great vibe, outstanding service!\nRevisited 9/25...Had brunch at Locanda Verde for the first time and WOW. The eggs benedict were out of this world – I’ve never tasted anything like it, the sauce was unreal. The egg and sausage sandwich was incredible too, it looked like a three-story sandwich and tasted amazing. The lemon ricotta pancakes were soft, fluffy, and absolutely delicious. The staff here is so friendly and attentive. This place is always consistent. I usually come for dinner, but brunch blew me away! Plus, I love the cozy yet stylish vibe of the restaurant. Definitely one of the best brunches I’ve had in NYC!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdFZqTmhVR05IWDBWcFMyNDBMVUpTYWpCNVYxRRAB",
            "text": "Great food and service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neFZWSkRYMlZ6UVd0V09XOVVZbWxKWTB4bU1XYxAB",
            "text": "It was a divine brunch in every way ! The service was exceptional and attentive. The Caesar salad was delicious and unlike any I have had before. The Pappardelle was a culinary masterpiece, truly and the tiramisu was beautifully designed. It was pure ambrosia, except for the whole coffee beans embedded inside. I could have done without those. Thank you for making my Sunday an unforgettable one. It goes without saying, that inside and out, Locanda Verde is an extraordinary restaurant !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVVZXZHlWV1I2VG5jdGNtWklialJuWjBaMVVtYxAB",
            "text": "Just fantastic. Every time. Quick service, delicious drinks, the best gnocchi you could ever ask for. Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GR2R6Qk9SRlZrT0ZCT01FNTJjRkJYTm13Mk5FRRAB",
            "text": "We hosted my sister's bridal shower at Laconda Verde Tribeca and I can't thank their team (especially Dante) for helping make the day run as smoothly as possible. Their attention to detail, support and kindness were genuinely appreciated and the whole team truly went above and beyond to help make the event amazing for us and our guests. The food, drinks, atmosphere were all an 11/10. THANK YOU to the whole Laconda Verde team. I couldn't recommend using their space for your next event enough!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4dFJFbGtiVlJ5Y1hWZmRXMHdRM1pGYVMxMlpWRRAB",
            "text": "Locanda Verde always shines.  Just head and shoulders above other dining options downtown.  And thanks for providing such a lovely outdoor setting for a lovely September evening."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWU1ITTBkbGxSYW5WSmNHOUdNVFJIYWpaaFkzYxAB",
            "text": "An amazing place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMlJHZG9WR3d0UVdjeFNtUjRkblJIWlhwbFdsRRAB",
            "text": "Food was delicious. Drinks were great.\nI recommend sitting and eating at the bar with Alex if you can, he was great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TFlXaEplV2RzV1dGT2NtTkVRVmxMWWpFNU9IYxAB",
            "text": "How does an Italian resturant exist that has no bread service even if your willing to pay. Appetizer menu offers nothing that anyone would want to eat. Asked for a blody mary at bar asked bartender for xtra worshershire sauce.He said he had none. Listen that's an ingredient in same. Overall expensive and not worth the trip."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNmVVZEhkVUp1TjNCYVJHOVFUR1JCWWxRMFlXYxAB",
            "text": "Excellent service, ambience and food from the moment we entered."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bFprSktjSHBKTlRsUlJsRjRURXBqTFhCNWVWRRAB",
            "text": "One of Tribeca's most charming restaurants, this one stands out from the crowd with its warm and inviting facade. Upon entering, you're immediately captivated by the beautiful decor and warm welcome. The food arrives on time and at the right temperature. The dishes are delicious, and the photos speak for themselves. The waitstaff is well-trained and very polite. The prices are fair. I recommend it. 🧡"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMU9EUjNUbFJFU0VaRmVqTTFUbWhsT1dWbWRHYxAB",
            "text": "Went for breakfast and got the egg white omelette. The real star dish is the ricotta toast on the dinner menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdGJYVmlPRkZ4Wm1OeGVHOVFTMnQ2Y0UxaWVrRRAB",
            "text": "The attention to detail from the host to our main server was superb; our Cesar salad was crisp and right in flavors and portion appropiate for two ppl; I wasn’t expecting a big deal with the pasta and seafood but their Frutti di mari is phenomenal ; the lamb sliders were the pefect  dish to fill the spot. I highly recommend you to try their signature Tiramisu dessert is something not to be ignored at all  and because we like sweets the panacotta orange will send you home HAPPY !!! Thank you Evan and  Heidi for making us feel so special tonight."
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNmVUTlJVbXQwY0c1dFR6bGxTMk5EVFVaeU5rRRAB",
            "text": "Loved the Eggplant Calabrese and Spaghetti Con Acciugche."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RVQzWm9VVVJ3VldoWFYxVm5lR0Z6UWpGMGRuYxAB",
            "text": "The venue is gorgeous with dark wood paneling throughout and floor to ceiling windows which gives it a rustic yet modern ambience.\n\nService was good and professional but not too detail oriented nor anticipatory. My group and I initially sat inside but it was the table closest to the kitchen opening so we decided to move to the patio to have a quieter table and better setting.\n\nUnfortunately, the rustic Italian dishes seemed quite good in written form but in real time taste was not really great nor special. The Roasted chicken reminded me of a vamped up version of Costco chicken. Which to say the least is tasty but not worth this price tag. Cavatelli was cooked Al Dente but the sauce\nWas just okay and lacked substance.\n\nMy friend had been 2 years ago and this venue was always a gem. Perhaps we just had an off night. Overall, mediocre and not worth this price."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Ull6bGhRbXAwVlVGd2NqQXpTVFJhUm1OSlRGRRAB",
            "text": "An institution in Tribeca! Order anything it’s all amazing especially the whipped ricotta."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BM1dGVmlaRGM1VjBoR2MwZDVWWGhmYjBKZmIxRRAB",
            "text": "Tartare was the best. Chocolate cake was surpassingly good w olive oil. Bathroom looks rlly nice. Service was not bad but could be a bit better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUWRWUk1NSEprVm5GWU5ISkhhRGxNWlRGVlNHYxAB",
            "text": "Hospitality reigns: patrons are made to feel welcomed and looked after at no diminution to technically well performed service. Bread basket plus honey-ricotta spread on warm is an excellent intro to the main dishes. Sides of sausage and bacon add oomph to egg dishes and the pancakes-with-blueberries and French Toast classics. What's missing? the monkey bread of yore. BEST BRUNCH NYC"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeFMxSk5PVk5HZUVWZmJVcHVWa2hTVjFjMFZIYxAB",
            "text": "Staff is great here. Had an uncomfortable interaction with another guest and the team made the rest of our meal so nice. Thank you"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc1Z6UmhVMVpsVld0VmVFNUNlbFJTYVVwbGMzYxAB",
            "text": "Front desk people and waiter were great. The food was not."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMVpIaDVPVzV3TFVFdE1XY3lMVXRYUTNGelYwRRAB",
            "text": "Nice restaurant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdlZHODFaSGRLVm5WSVoxRjRWR2d0U1dVdE1tYxAB",
            "text": "Typical New York atmosphere. So great, food is also good. Good experience, I’m simply said not wow’ed. And that’s pretty normal. 4+ but not a 5"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVGVGUlNZWFo2U1VOUGRUQkdhRzR4WjJOSk1GRRAB",
            "text": "Celebrated my wife’s birthday at Locanda Verde with our daughter, and it was very nice! The vibe is cozy but lively, the staff is friendly, and the great food. We left so happy—can’t wait to go back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRE5qWlBjRTh4Vkc1VmNEZHVXREY2WDBsSmVFRRAB",
            "text": "Caprice is a hostess with the mostess.\nAccommodating, attentive all you look for when seeking a hospitable experience.\nMy wife and I have been a few times now and enjoy the cocktails and authentic Italian cuisine with a twist.\nThe staff are great. The food is great.\nThe neighborhood is great.\nIt's a no brainer. Best to reserve a table because it gets busy. We had success with a party of 2 as a walk in but I think we got lucky.\nBon appetit!"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURna3RqcGV3EAE",
            "text": "👍👍👍…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbk5ha0ZREAE",
            "text": "This restaurant has a great vibe and an open kitchen which creates a really cool vibe.\n\nWe started with the Steak Tartare and the Insalata D’Andrea, and they were both perfect. The steak tartare was truly amazing. I loved the egg on it. However, I feel like bacon is not necessary.\n\nFor the main courses, we had the Scallops and the Duck Arrosto. The scallops were unbeatably good. They match perfectly with the lentils. It is such a good dish and definitely our favorite; the duck was good, but I think the meat could have been more tender. I also tried the Cappelletti Fizz cocktail, and it was really well-balanced. I really liked it, and I also tried the Vesper In Coat Tails. It was amazing but very strong. My partner loved it!\n\nFinally, for dessert, we ordered the Lemon Panna Cotta and it was very tasty.\n\nThe service was very good, the staff were always very attentive 🙏🏻 It’s a great place with really nice food. I wouldn’t use it for a first date tho, because I feel like it can be very loud, so it’s hard to talk."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYVNoNW5UelBtMWdRRRAB",
            "text": "Amazing service the Maitre d’ Caprice is a gem! She got me & my friend seated right away in the back dining room. They lit the fireplace which I loved. If you’re looking for a laid back upscale spot this is the place to go. Judith was my waitress she was extremely helpful. Also- please don’t get rid of the Paloma with the cinnamon rim until summers over! It was so good!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvazU3Y0NREAE",
            "text": "Locanda at Hudson Yards is a hidden gem with a truly beautiful setting. The staff are exceptionally professional and warm, making the experience feel both welcoming and refined. The food is delicious, but what truly stands out is the ambiance—the interior design is romantic, intimate, and timeless, creating the perfect backdrop for a special evening. Every detail, from the classic decor to the thoughtfully crafted cocktails, makes this place unforgettable. A must-visit for anyone seeking a charming and elevated dining experience."
        },
        {
            "date": "수정일: 4달 전",
            "language": "ja",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLZlZxcFAwZ0phTjF3RRAB",
            "text": "期待していたイタリアン料理\n和牛のタルタルは美味しかった。\nパスタはソースの味付けは美味しい。\nスパゲッティはちょっとゆるいかな。美味しいけどもうひと工夫欲しかった。\nティラミスはサイコーでした。"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdVAyZFl3EAE",
            "text": "Scallops stole the show. Perfectly seared and with a delicious glaze. The steak tartare was terrific and went very well with the beet carpaccio. Buttered crab squid ink pasta was also great but would opt for something else if I came again. Overall great experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYkg0dS1ndXFqTFVnEAE",
            "text": "I had the best time at Locanda Verde in Tribeca—this spot feels like a little Italian escape tucked into the city. It’s warm, lively, and has that effortlessly cool downtown energy that makes you want to stay for hours. The vibe is rustic yet elevated, and the food? So good I was already planning my next visit halfway through dinner.\n\nWe ordered a mix of dishes to share, and everything was delicious—from the fresh pasta to the burrata to the olive oil cake for dessert (don’t skip it!). The service was warm and casual but super professional at the same time, which just added to the whole experience.\n\nPerfect for a date night, girls’ dinner, or anytime you want to feel cozy but classy. Honestly, this place gets it right on every level.\n\n⸻\n\n📍 Locanda Verde Info\n📍 377 Greenwich St, New York, NY 10013\n🕒 Open daily:\nMon–Thu: 7 AM – 11 PM\nFri: 7 AM – 12 AM\nSat: 8 AM – 12 AM\nSun: 8 AM – 11 PM\n📲 Reservations highly recommended (especially for dinner)\n\n⸻\n\n💸 Price Range\n🍝 Pastas: $24–$36\n🥗 Starters: $16–$25\n🍰 Desserts: ~$15\n🍷 Extensive wine list + cocktails available\n💳 Mid-to-upscale pricing for NYC, but 100% worth it for the atmosphere and quality\n\n@raquelgerlani"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfajU3VDBnRRAB",
            "text": "The hostess, food runners, and a lovely waiter named Godfrey was amazing...BUT the waiter assigned to our table didn't inform us that the kitchen closed at 3 so we felt very rushed and the drinks that were recommended [after asking for sweet flavor profiles] were bitter and sour. I doubt I'd ever return. Not how I'd hope to spend my actual birthday."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJM2R1MGFBEAE",
            "text": "Had received multiple recommendations for this place. Visited with a friend on a Friday night.\nWe ordered a caesar salad, ravioli, pappardelle, and tiramisu. My personal favorite was the ravioli; the homemade tomato sauce with the lamb&pork filling was so on point. My friend liked the pappardelle with lamb ragu more though. Tiramisu was unique, with crumbled coffee beans, but I didn't like that it's served in a wide plate with the edges having only mascarpone cream (personally like having all flavors in one spoonful).\nI also liked that they had non-alcoholic cocktails; tried 2 of them and they were both really good.\nAs to vibes, it gets really loud and the tables are very close to another. I personally wouldn't choose this for a quiet romantic date spot; more of dinner with friends before going out spot.\nI would love to go back and try more dishes!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdzZLTkpnEAE",
            "text": "It was an absolutely incredible experience—flawless from start to finish! The team was exceptional, the food was beyond outstanding, and the atmosphere was simply perfect. Every detail was thoughtfully executed, making it truly unforgettable. Definitely a must-try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINnRiQlF3EAE",
            "text": "Red shrimp was tasteless, although the beans were good. Pasta dishes were too salty and very skimpy on the meat (see photos) Service was uncoordinated and bizarre (waiter didn’t understand meaning of al dente?), our pasta dishes took way too long to come out and the manager not introducing himself tells us they are coming out soon but it’s another 10 minutes? Still, wonderful atmosphere, and we will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYN092RnB3RRAB",
            "text": "The food was amazing. The crostini, lamb sliders and fluke crudo was delightful appetizers. The squid ink pasta & duck entrees was very flavorful and cooked to perfection. Our server,  Cornelia was very knowledgeable about the menu and gave such great suggestions. She was always smiling and a pleasure to have as a server tonight. 10 stars service and food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNibWROZRAB",
            "text": "Beautiful interior, great vibes, delicious cocktails and food is ace! Ordered one portion of chicken for one and it's massive, big enough for two to share!\nVery easy staff, walked in and with almost no wait we were able to get a seat by the bar.\nThumbs up highly recommended!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROeWR2VXN3RRAB",
            "text": "O ambiente é aconchegante e agradável. O serviço foi gentil, elegante,ativo, definitivamente foi excepcional!!\nA comida é maravilhosa e autentica, a massa é fina, saborosa, tudo mto bem feito e com sabor incrível.\nNao deixe de experimentar o Pão com azeite e o Ravioli.\nA sobremesa pedi a panacotta que foi diferente da tradicional porem estava deliciosa e confesso que prefiro essa versão mais moderna com especiarias.\nSe for para o Brunch recomendo fortemente checar o Menu antes, pois o é bem diferente. (Não recomendo o Brunch, mas o menu de almoço/Jantar vale muito a experiência)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OEpUOWV3EAE",
            "text": "Awesome place for a night out on the town or for a private event. The restaurant is very spacious and offers great Italian fare. Service was impeccable, especially the bartender Shua. He was the bartender assigned to our party and not only did he come up with the coolest evening cocktail with St. Germain, he served over 50+ guests and even hand delivered some of the drinks to our table. He was friendly and attentive. The food was fantastic and I loved the communal style dining. You could scoop what you wanted and get extra servings too. All in all, a fantastic event space and a kicking Saturday night scene."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaEl6Q21BRRAB",
            "text": "The pastas and raviolis are so average, I’ve made better food at home. Pasta was very thick, not aldente, just simply mixed with pesto or melted cheese. Peanuts in steak tartare are not needed, just not a good flavor combination. The best thing hung was ricotta cheese. We waited for food so long.. not coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicThEd3lRRRAB",
            "text": "This place was delicious. The service was really great as well. The manager was super kind and accommodating to us as well. The host and server as well. They also filled our waters faster than anywhere I’ve ever been. Very impressed considering they were under renovation and had seemingly few staff as well for a busy place on Friday night. Would definitely go back we ordered burrata which was delicious. All three of us enjoyed it. I ate Spaghetti alla nerano as my entree and enjoyed it. The zucchini was very filling too. I enjoyed the locanda tazza as well and the paper plane both very tasty as well. My mom had the Black Tagliatelle\ncalamari alla puttanesca & breadcrumbs\nand said it was good lots of seafood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENmY3bnVnRRAB",
            "text": "Located on Greenwich street downtown New York City, Locanda Verde offers an unforgettable dining experience that combines impeccable service with a vibrant atmosphere.\n\nThe service at Locanda Verde is unparalleled, with attentive staff who are knowledgeable about the menu and eager to ensure that every aspect of your dining experience exceeds expectations. Whether you're seeking recommendations or simply need another glass of wine, the staff is always on hand to make sure your needs are met with a smile.As for the food, the appetizers set the stage for an extraordinary meal, with standout dishes like the beef tartare, eggplant, and crab crostini stealing the show. Each bite is a symphony of flavors, perfectly balanced and expertly executed.But the true star of the dining experience at Locanda Verde is the entrees. The Chittara Frutti di Mare is a masterpiece, with tender pasta perfectly complemented by a rich seafood sauce that transports you straight to the Italian coast. And the scallops are cooked to perfection, with a delicate texture and flavor that delights the palate.Overall, Locanda Verde is a must-visit for anyone looking for an unforgettable dining experience in NYC. With its inviting atmosphere, impeccable service, and standout dishes like the beef tartare and Chittara Frutti di Mare, it's a place you'll want to return to again and again. Highly recommended."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOU0pfT0xyM0t5aXlBRRAB",
            "text": "Recently went for dinner. We had a horrible experience. They seated us 20 minutes late. When we sat down we ordered drinks that took close to a half hour to come to the table. Our waitress gave us attitude the entire night. She seemed annoyed we had allergies. Eventually they brought out the entrees which they mixed up and give my friend the wrong dish, wasn’t even sure that the dish contained dairy even though we notified her my friend was dairy free. The entire experience from start to finish was awful. They did not care about how they treated us. For a place with such a good reputation the food does not live up to the hype, you can get better food easily in the city. The food was lacking and the hospitality was awful. Do not come here.\n\n**** update they also comment on each post claiming to reach out to their email and they never respond. It’s all for show and don’t actually care about the experience of their customer. In a city filled of amazing food this is mid at best don’t waste your time."
        },
        {
            "date": "4달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLU0V6dkNwbXJhVmNREAE",
            "text": "Locale bellissimo, curato nei minimi dettagli, così come l’ottima colazione e il servizio attento e cordiale"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OHB6eVZnEAE",
            "text": "We really enjoyed our meal here and the service was 10/10 from the moment we were greeted. The food was good and flavorful, and while it’s not the best meal I’ve ever had in NYC, it certainly ranks in my top 5 currently. The desserts were definitely a highlight (we got the tiramisu and lemon tart), and I highly recommend the whipped ricotta. I believe the menu changes seasonally with a few staples, but if you get the chance to try the tortellini verde, you definitely should - you can taste the smokiness without it being overpowering, and it’s a unique flavor. Overall, the atmosphere, service, and food sets this place apart and we’ll be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcUkyamFnEAE",
            "text": "Good service from the waiter, good pasta, but too expensive for what it is. Wine, burrata were ok, the salad too much acid, brocoli not good at all, dessert chocolate too much sugar we didn't taste the chocolate. Maybe next time it will be better but please review your price because there are better restaurant with better price. I don't recommend this restaurant if the quality of certain plates and price didn't change."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdFpuNnJBRRAB",
            "text": "Came here for dinner with friends. My friends are regulars and love Locanda Verde. They’re foodies like me, so I was excited to try this restaurant…Well, now I know why they love it so much. This place nails Italian food; every dish we ordered was cooked to perfection. My favorite was the rigatoni. Additionally, they have an impressive list of wines. Furthermore, the staff are stellar. Our waiter was knowledgeable, friendly, and extremely attentive. I can’t wait to come back and try more things on the menu. Keep up the excellence Locanda Verde!!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCd3VYMEpBEAE",
            "text": "Very tasty meal. The ricotta toast was the star of the show by far, incredibly good. It’s salty, creamy and doused in high quality olive oil served with crispy sourdough bread. Another favorite was the grandmas ravioli, super fresh and simple. The vibe of the restaurant was great, really dark and moody. Great meal overall."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQX2FMTjRRRRAB",
            "text": "This place never disappoints. Yummy & wholesome food. I have been here a few times with colleagues for lunch and it's always great with friendly service and atmosphere. Reservations have been needed each time I have gone. Def check it out!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabjY2T3dnRRAB",
            "text": "Cute restaurant with very nice staff - went for brunch and the corn raviolis really stood out. Portion sizes are pretty small though.\n\nWe can’t wait to come back and try the dinner here :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcjZldXBRRRAB",
            "text": "A great dining experience from the moment we walked in!  We were warmly welcomed and shown to our table and when we sat down our waiter was helpful with the menu and wine list.\n\nThe food was very good - some highlights were the sheep's milk ricotta, pappardelle, and garlic chicken (note, the order for 1 was more than enough for the both of us in my opinion).  We also had the lamb meatballs and grandmother's ravioli which were both tasty, but not must-haves if you ask me.\n\nThe chocolate torta we had for dessert was amazing!  One of the better chocolate cakes I've ever had - definitely worth saving some room at the end of the meal.\n\nThe vibe and atmosphere was pretty hip and happening for a Monday night, but not uptight in anyway.  Definitely would like to come back to explore more of the menu."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJdlA2ZTBRRRAB",
            "text": "We’ve been here before for brunch and liked it. I actually preferred it for dinner. The dining room has a great atmosphere and the service is awesome. I have to say the food was particularly good. The pasta was cooked perfectly and tasted spectacular. Deserts were also good. We didn’t try the wine list but the margaritas were great.\n\nBook in advance as it’s popular. It’s certainly not the cheapest place but well worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcHJ2NkdnEAE",
            "text": "I'd give it 6 stars if I could, I am now obsessed with this place. The service was top tier and was unique in that it did not at ALL feel like I was being rushed out of there (like many other NYC restaurants). It was nice to just enjoy every detail. The tortellini was incredible obviously but the halibut was something so amazing that writing about it doesn't even do it justice - you just have to go try it. I'll go back here 1,000 more times."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdF9fbHZBRRAB",
            "text": "Not a crowded area so, enjoyed my time at this place. The food was a mix, as some of our pastries were too sweet..so sweet that we could not eat them all. Meanwhile the pancakes were delish, except one of them had a bit of a chicken taste leftover. Guess the pancakes were cooked right next to the chicken?!?!?! I am a veggie person so, imagine my shock when I tasted the chicken flavor. Aside from that, this place was nice."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNmd2IxVRAB",
            "text": "we were able to enjoy our brunch here today, first of all a very elegant and relaxed ambience. The hihhlight are the toilets, the toilet paper is like butter unbelievable, everything is very clean you just have to mention that. the staff very cordial and committed. we had delicious food, we would love to come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaEpxVFlnEAE",
            "text": "It’s for sure one of the BEST restaurants I’ve ever been to. The food was amazing, the decorations were tasteful and the service was outstanding. We truly enjoyed our time there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqXzdIaXB3RRAB",
            "text": "I loved everything about Locanda Verde, minus the small portion sizes. I can deal with damn near anything the universe throws at me but small portion sizes. I truly am god's strongest soldier.\n\nI've lived in New York long enough to be conditioned to pay between $25-$40 for a plate of pasta and not bat an eye, but when the Grandmother's Ravioli ($33) and Rigatoni ($36) came I immediately knew I would have to go home and make myself a 2nd dinner.\n\nThese small plates of pasta were on brand with the tiny lamb sliders ($16) and steak tartare ($29) we got for appetizers... \"What is this.. a dinner for ants?!\"\n\nThis being said, the quality of everything was HIGH level. Phenomenal. Sensational. Legitimately some of the best pasta I've had in the city. That Steak Tartare went NUTS too. Bite for bite, I'm putting Locanda Verde up against all the heavyweights... you just don't get that many bites ahahaha.\n\nMy buddy's girlfriend always chirps me because she actually prefers small portion sizes when going out to eat. My soul has never disagreed with something so vehemently, but it is good to know somebody else's perspective on life can be so drastically different than mine. Kind of cool, honestly. Civil discourse is so important to push society forward and live in harmony with one another.\n\nI will absolutely be back, but will have a big snack session before my next visit. I also need to get to Tribeca more. It is like what Soho used to be before Soho became Times Square...\n\nIG @jnov_\nTiktok @jnov_reviews"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaa2NtNTBja00xYjFKRlYzaFFkbU0zVTNrM1QyYxAB",
            "text": "Before I say anything negative, the food was great. I think it was the only thing that saved this place, I guess they deserve at least 1 star. The service was okay as well. The only thing I will complain is the waiting time and the hostesses. There were 5 of them by the host stand, and none of them know what they were doing and were not communicating.\n\nWe initially had a reservation at 7:30 for 4 people, arrived at 7:20 and asked us to wait a bit. Sure there was a bar and we got some drinks. 20 minutes later at some point, none of the 5 hostess came to us, and we had to go to them every 5 minutes asking for our table. One of the hostess asked us if we wanted to sit outside where we CLEARLY made a reservation for inside.\n\nWe saw a table of 4 open up around 7:55 and asked if that table was ours, as we saw it was available for the past 10 minutes. One of the hostess proceeded to tell us “sorry, it’s for a table of 6 people”, where clearly only 4 plates were laid out. We then saw a family of 4 with 2 small children sit on that “seat for 6”. Sorry but we’ve been waiting for 30 minutes and they just came in?!??? Also, why did you lie to us??\n\nHorrible wait time, they lied, badly organized. It was my partner’s birthday and she was furious. Never experienced reservations like that in any other place. We wanted to go somewhere else but it was a Friday night so i guess we had no choice but to sit through this bullshit. Never coming back. It’s New York City, there’s amazing food everywhere. I recommend going somewhere else. ✌️"
        }
    ],
    "reviews_count": 75
}