{
    "name": "Giardino D'Oro",
    "place_id": "ChIJA7FDxRdawokR60802QyPTbM",
    "grid": "MN1",
    "address": "5 Gold St, New York, NY 10038, USA",
    "rating": 4.5,
    "user_ratings_total": 296,
    "phone_number": "(212) 514-6400",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVGEyUXdOR0k0ZDBjNVZWQnpURlJaZGpkdU0wRRAB",
            "text": "Delicious food, friendly staff, and a relaxed atmosphere with mood lightning, elegant decor, and classical ambiance. Highly recommended for a date night or business gathering."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WYWIzaElTR2h5VUUxSE9VY3lkblF3VUhWRlIxRRAB",
            "text": "Good variety of desserts to choose from."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWmIxUjNaR1F3UWtOMGVsZEVkSE5KZEdaNU5VRRAB",
            "text": "Excellent homemade pasta! Best staff around."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdlZtcFBNMEZQUWpadVRGTmlWVmhzZUhaSk9XYxAB",
            "text": "Nice presentation on the plates."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkaWVsaEtUbWhxVEVOTlZFWnZWa0ZSYUZkeWNWRRAB",
            "text": "Excellent service as we felt welcomed and the staff took care of us. The inside was beautiful and made the ambiance great! Had great little appetizer at the beginning which included bread and salami and cheese. Order the special of the days that were well priced for the menu. Had 2 additional fish options. Reservations are recommended but they were kind enough to squeeze us in. For tourists I would recommend trying it even if you feel underdressed as exploring the city deserves a great meal. I recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kd00zSjVUSEpQYkZselIzaDJWVWd3Y0dGcGFVRRAB",
            "text": "Terrible tiramisu. Dry, hardly any cream/cheese, and tiny for the price."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wM00yTmhUME5WUkZaSWVsRXdibVJ0WkVsNVUzYxAB",
            "text": "Great service and food. Place has been around for a while and always wanted to try it.\n\nGot the seafood pasta, pasta with clams, baked clams and caesar to start. Everythjng was great. Highly recommend this spot for some old school italian food especially with all the chains around"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeVVESTRjRGhKUjBaNVpsaHRiVWxaVm5waVJFRRAB",
            "text": "Great atmosphere for conversation and convenient location near Wall Street."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSR2IzRmpjR3hDWldoMmFUZ3pVa3N4T1ZrNVJHYxAB",
            "text": "Amazing place. Great service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTVJuVlVOWFJwU0RWd09HaE9WbmwxU25WT09FRRAB",
            "text": "This establishment located between maiden lane and platt st on gold st has a very welcoming and warm environment perfect to escape from a busy world the food is something that you can’t find anywhere else in the city especially downtown.\n\nThe pastas are out of this world and if your feeling something with meat the dry aged steak is the way to go side of sliced potatoes and broccoli must order it with Au Paue sauce comes with red pepper mushroom black pepper corn it’s a absolute must combo ask for Valentino he’s a great host/Waiter and will make your visit out of this world"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kZldGODNaazV4ZFcxelRGUXdkVUp1WjBGdFFVRRAB",
            "text": "Authentic and beautiful restaurant"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLcVFxTHVwM01UeG1BRRAB",
            "text": "We were greeted and welcomed in immediately.  Excellent service, food was amazing, atmosphere authentic Italian.,"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLMmM2dmV6bUpXa2VREAE",
            "text": "Thank you.High end restaurant. Stuff was great and very friendly. We tried fish. It was special. It was great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVFNoTWU5b2JyVVJnEAE",
            "text": "Amazing Tiramisu! Perfection☺️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHFfYTNRRRAB",
            "text": "I didn’t really enjoy food here because it’s quite middling but very pricey.  Drinks too expensive since no happy hour.  Although steak is good deal, it doesn’t quite match up with nearby reputable steakhouses.  Lastly, ambiance quite drab."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGJiLXRnRRAB",
            "text": "My favorite restaurant Manhattan"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN1luWW5RRRAB",
            "text": "Staff was told incredibly attentive and kind.  The host and our waiter Valentino were both above and beyond expectations.  The food was delicious and the perfect combination of flavor and presentation. All together, a definite place to come back to!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MEpMZE13EAE",
            "text": "Delectable menu and excellent service. We thoroughly enjoyed our meal with the Tiramisu and Ruffino Modus 2018 being the pinnacle. Our pastas were delicious with the server allowing me to split two kind to try them both. We had the linguine with clams, seafood pasta, and rigatoni with bacon and onion. Definitely recommend if you’re staying in the Wall St area of NYC."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NDQzRlVBEAE",
            "text": "food was overpriced and kind of mid, green beans and potatoes were unseasoned. bread was slightly stale. The appetizers were nice though. Also 12$ for water is highway robbery. Ts Pmo fr"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aFlDTHZnRRAB",
            "text": "I had the pleasure of dining at this restaurant for the first time, and I was truly impressed by the exceptional service, high-quality food, and warm, welcoming atmosphere. I have a deep appreciation for family-owned establishments, and this one (in my humble opinion) stands out among the best. It has definitely earned a top spot on my list."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MEtpZ01BEAE",
            "text": "The service was incedible. Valentino and Timmy were terrific. Better than we could've ever asked for. First time in NYC and I am incredibly grateful!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbUthZEVBEAE",
            "text": "Nice place, tasty food and beautifully served food)"
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdy1QUGF3EAE",
            "text": "Endroit plutôt Simpa\nSeulement la nourriture n’en vaux pas la pas le prix, environ 35$ pour des pâte c’est beaucoup trop cher !\nNous avons été presser de finir de manger car il voulais fermer\nLe serveur à poser l’addition sur la table a lors que on avais à peine fini de manger"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aUxmREpREAE",
            "text": "Amazing Italian spot! The  Taglierini E Proscuitto was delightful!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bS1qWU5REAE",
            "text": "Great food, exceptional service and a taste of old school New York. We had an amazing celebratory dinner and would suggest this place to everyone who wants a great, friendly and professional dining experience. Highly recommended and a wonderful evening for the entire group."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eWZpc2tBRRAB",
            "text": "Absolutely top level fine dining experience. Delicious food well presented."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaF9QdHRRRRAB",
            "text": "One of my favorite Italian restaurants.   The owners are very attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMU5qNVRBEAE",
            "text": "Excellent service, food was great. One of the better steaks we have had and the homemade pasta was delicious. Everyone was friendly and attentive without being interrupting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcnJyUW9nRRAB",
            "text": "Slightly loud inside"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubl95UnNBRRAB",
            "text": "One of the best steaks I've ever had.  Service was perfect.  Benny and Timmy did a fantastic job of being aware and attentive without smothering.  My best NYC meal ever!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbHRLNjJnRRAB",
            "text": "Food was amazing, and the atmosphere was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIczlyekZ3EAE",
            "text": "Omg we had the time of our life-- we got the filet mignon on bone and the fruit of the sea but the narrative we established with our waiter, who so funny and so charming and we just laughed the whole night-- or maybe he wasn't that funny but the drinks were really strong!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NWZXQ05REAE",
            "text": "Lovely old school Italian restaurant.\nSuper nice staff, very attentive.\nMenu had great variety plus many specials of the night. Not sure why it was quiet on a Friday night - might be that it is summer ending in nyc and the Wall Street interns are gone. Branzino in Francese sauce (special) side of carbonara spaghetti for me - yum. Veal parm for hubby. Nice peppers and olives with bread (complimentary).\nDef a solid choice for Italian in FiDi."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3b2VDb3NRRRAB",
            "text": "Overrated and over priced. Staff was nice but the food was mediocre at best. Décor old school and nothing special. Horrible lighting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ1B1eDZ3RRAB",
            "text": "High end restaurant. Stuff was great and very friendly. We tried fish. It was special. It was great."
        },
        {
            "date": "수정일: 1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrLTktS29BRRAB",
            "text": "Super Service, der Pfeffermann ist der Hammer. Sehr gute Qualität bei den Essen 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMMThDYTFRRRAB",
            "text": "An Italian Restaurant with a real Italian feel and taste .  NYC has many Italian restaurants. This is real."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMk91bjd3RRAB",
            "text": "We found this place by mistake and I was so glad we did. I had my teenage daughter and niece with me. The staff was so patient and helpful with all of us. The food was excellent and worth every penny as was my wine. The only regret is we were too full for dessert.  We will go every year we are in NYC. This is now our go to Italian restaurant in the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNEpyTHZ3RRAB",
            "text": "By far one of my favorite Italian restaurants in New York City . The service is phenomenal. Very attentive. The pasta was made in house . I will be coming back here for sure. Not to many in fidi this great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6djdtYUxBEAE",
            "text": "My favorite place in the neighborhood. they treat you like family and the food is amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREclBISkpnEAE",
            "text": "Not a horrible restaurant, but make sure to bring a padded wallet. $38 for a run in the mill chicken parm that doesn’t come with any side pasta, and to add pasta, is a $18.50 up charge. Better choices out there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5d2Ztd0lnEAE",
            "text": "I really enjoy dining in the restaurant.  It is a great place to mingle with friends.  This is a very solid restaurant offering Italian food. Pasta and appetizer is nicely made. Like many restaurant the dessert can’t make me to give them a 5 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5Xy12bnRnRRAB",
            "text": "Held an engagement/birthday celebration there in the private wine cellar, which is beautiful and has a such rustic feel, and it was an amazing experience. Benny was very accommodating and helped my vision come to life. The food was amazing and our server was world class as well. The memory we were able to create there felt magical and I’m so appreciative."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dmFqelB3EAE",
            "text": "Nice Italian restaurant, great service, cool ambiance, but the food is bland.\nWe tried different pasta dishes and I had a house special cavatelli with meat sauce and it didn't have athe taste I was looking for. T-bone steak was a little chewy for my taste as well. Over all an ok experience, just not the great one."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bE9tamJREAE",
            "text": "Delightful dinner and attentive service. Great spot for romantic night out"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkXzgyZGtBRRAB",
            "text": "5 Stars all around!  Benny is a fabulous host, and the staff is friendly and efficient while allowing for a relaxing, elegant environment. The steak was seasoned and cooked perfectly, and the ravioli was bursting with flavor. You absolutely MUST save room for dessert!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdDl5VjZBRRAB",
            "text": "Just moved in to neighborhood  first time eating here Food was Awesome Service was Excellent. Wine list was Fantastic This is a Hidden GEM of a Restaurant in FIDI"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkcGRPNXJBRRAB",
            "text": "The service is old school Italian. The ambiance is classy. The wait staff is generally on it. The food itself is just not great. Bland with cheap ingredients that felt they came out of a Food Emporium. I felt swindled when I saw the total at the end of the meal. Way too expensive for what it is."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0Z2ZmUGx3RRAB",
            "text": "I had Linguine ai Frutti di Mare and tiramisu which were divine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaXJ5b05REAE",
            "text": "I had my best and most delicious (and most expensive ;) ) spaghetti carbonara ever. Fantastic. Grazie mille. 👏"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWcWVmOUNREAE",
            "text": "Superb Italian restaurant within walking distance of Wall Street. Beautiful, expansive ambiance. Attentive and professional wait staff. The peppers added a level of spice to the usual bread table starters. Calamari and herbed potato wedges were nice for starters. The main course - I went with the homemade black gnocchi with lobster tail, and was lip smashingly delicious to the last bite. Post lunch espresso was served at the right temperature - not scathing hot. Thoroughly recommend!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtaVBqUzNnRRAB",
            "text": "Ate dinner here with some family last night and the whole experience was incredible. Luigi our server was top notch and so was the rest of the staff. The food was delicious in every way. The quality and freshness of the meal was something…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbWNxcGxBRRAB",
            "text": "What a fantastic place! Great food! Had a sirloin steak and spinach. Delicious! We can highly recommend this place. Very nice place, great service and clean. Would love to come back!…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxX00tT0JBEAE",
            "text": "The atmosphere is great. The service is awesome. The food is delicious, but the portion size felt like I received a kid's meal. Honestly, if I had known, I would've ordered an appetizer & 2 entrées. I got the penne alla vodka with chicken. Sadly, there was room for dessert because I was still really hungry. I got the Napoleon. The Napoleon wasn't the best I had, but it was still good. But, now that I know the portion size, I know to order more next time. Sorry, I was too hungry & forgot to take a pic of my penne alla Vodka with chicken. But, I did remember to take a pic of my dessert."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeGNIZ2pRRRAB",
            "text": "Giardino D'Oro in New York City is an epitome of culinary grace and elegance. Tucked away in the city's bustling landscape, this gem offers more than just a meal—it promises an unforgettable dining journey. The atmosphere strikes a perfect balance between opulence and comfort, setting the stage for any special occasion or memorable night out.\n\nOur evening was made truly exceptional by not one, but two outstanding waiters—James and Valentino. James' expertise on the menu and wine pairings was as invaluable as it was enlightening. His attention to detail, from the appetizers to the desserts, was meticulous. On the other hand, Valentino brought an unparalleled level of charisma and charm to the table. His flair for creating a welcoming atmosphere was perfectly matched by his keen sense of timing and service.\n\nThe synergy between James and Valentino was palpable, each complementing the other's style seamlessly, ensuring that our dining experience was flawless from start to finish. It was like watching a well-choreographed dance where each waiter knew just when to step in and take the lead.\n\nThe cuisine itself was a masterpiece. Each dish seemed to transcend the last in terms of flavor and presentation. Whether it was the perfectly al dente pasta, the delectably fresh seafood, or the sinfully indulgent desserts, every bite was a celebration of culinary artistry.\n\nIn conclusion, Giardino D'Oro is not just a restaurant; it's a sublime experience for all the senses. With the incredible team of James and Valentino at the helm of service, and a menu that rivals any Michelin-starred establishment, this place is an absolute must-visit for anyone looking to dine in New York City."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdmR1QlRBEAE",
            "text": "Went in while location scouting for photos in FIDI. Wanted to try the broccoli and a gin drink. Ordered a VERY dirty Hendricks Martini and a side of sautéed broccoli. Both did not disappoint!\n\nThe restaurant is very aesthetically pleasing as well!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNjkyVEV3EAE",
            "text": "I came here for an amazing work dinner but was too full for dessert. Another table ordered this for dessert and I knew I had to come back. I sat at a he bar and had a great whiskey from their selection at the bar while waiting for my…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBcnRISmJnEAE",
            "text": "Pasta’s sauce is the best, deep and fresh. Desert is also good. But restroom for male and female together."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvanR6OGdnRRAB",
            "text": "One must experience you should try if near Wall St / NYSE and want to try Italian taste. Great attention, fabulous ambient and really tasty food. It worths a visit."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJOWFDaGhBRRAB",
            "text": "They served us complimentary bread and great complimentary starters. Service was great and friendly staff. (But pricey menu)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbzltTWN3EAE",
            "text": "I walked in accidentally and never wanted to leave. It's exceptional. Full food coma. Amazing experience and food"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURncDdlS2pBRRAB",
            "text": "Giardino D'Oro is fantastic! My favorite place in Manhattan for Italian food. It boasts of authentic Italian food and phenomenal service. I've tried so many things on the menu and am never disappointed. Beni, the owner, makes sure everything is just right every single time."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NjZ2U0VBEAE",
            "text": "Since one arrives, the deal is spectacular and Benny attends to you and does not allow anything to be missing. The food, the taste is delicious and wine is amazing. Thanks BENNY"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvMHNLZUtREAE",
            "text": "My first time but im impressed with the food and service this place provide you.\nStarting from the complimentary appetizer to the main course eveyrthing was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1OG82NnJRRRAB",
            "text": "Wonderful old style Italian restaurant. Hard to find these anymore. Very few places prepare the food at your table. In this case it was the Branzino which was beautifully prepared. My husband is Italian and we both think the food is excellent as well as the service. It's pricey so be prepared, but it's great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacjlQc1hBEAE",
            "text": "Step into this restaurant to step into an incredible and intimate dining experience. The staff was knowledgeable, friendly and very helpful with suggestions.\n\nWe tried the chefs specials! The pesto was probably the best I’ve ever tasted & the lobster ravioli was absolutely delicious. Each time I visit the city I will aim to make it back to try each thing on the menu.\n\nAnd the desserts…. Just wow!! I will be thinking about the cheesecake and crème brûlée until next time"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNLU5IejBBRRAB",
            "text": "The atmosphere and service were great. If your looking for a wonderful experience then this is the real deal. The food was good but I think it didn't live up to the rest of the experience.  You will have an exquisite wine list and the bar too is well stocked. Should be a 4.5."
        }
    ],
    "reviews_count": 67
}