{
    "name": "Joseph's Restaurant",
    "place_id": "ChIJST0cgRZawokRNvJv5mhG57E",
    "grid": "MN1",
    "address": "3 Hanover Square, New York, NY 10004, USA",
    "rating": 4.5,
    "user_ratings_total": 362,
    "phone_number": "(212) 747-1300",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscFVIZDBRbmxFZW1SS2FXVnFUVXd6YWtKRGFtYxAB",
            "text": "Great food, great atmosphere and excellent service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQlF6aFVjekZHUTA1VFpsRktVbmQ1WXpSVUxXYxAB",
            "text": "Excellent food and service. Lindi is a great manager!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORFVuZDFhREp3YjFablJGazBOMjlhUm05U1FVRRAB",
            "text": "The service and friendliness was wonderful. I really couldnt find a red wine by the glass I liked. The Beet Salad special was a little odd tasting and I didnt like tje accomplishments for the crispy sea bass.\nThe ceasar salad was good, as was the veal piccata. I guess I just ordered the qring things.\nIt was also warm and cozy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRlNWRkZTRnB5YXpCYVYwVkhhSEZSU2psV1NVRRAB",
            "text": "Great"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMlgxTlFWWEZ2ZDNoUFFVcHFOa3BqTWtsMlUwRRAB",
            "text": "Hidden GEM\nFANTASTIC MEAL ...\nEVERY BITE of  EVERYTHING\nBaked Clams... AWESOME\nAvocado Salad... AWESOME\nBURRATA Salad ... AWESOME\nCHICKEN MARTINI... FRIGGIN AWESOME\nCHICKEN PARM... AWESOME\nVEAL PICCATA... LIKE BUTTER - FRIGGIN\nAWESOME\nNO A BAD WORD\nLOVE THIS PLACE"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWU1HMXZNRXBNYTFVNU0wUldXVGxMTTBoQlNuYxAB",
            "text": "I like the tricolor salad. Salmon is good just no skin on"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SWNrSXhla3R3U2xKeE1YSnRNVXBCZDJVek5IYxAB",
            "text": "Amazing food and service! A must visit restaurant when in the city!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5S2RVaGpTWGhoUjNCeFRXVk5PWGRtZVVOcU5tYxAB",
            "text": "The hottest day in nyc June 2025. They turned the air off when kitchen closed. Last night I was at Stephina. Much better I will not be back!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobFRXaHVkekU1T0dzd1NtdFdUbTVSTkRSR1RYYxAB",
            "text": "I was unpleasantly surprised after going there with high expectations. Appetizers were really bad except the calamari. Pasta dishes were fine but not fine dining level. Over all it is a basic Italian restaurant with food below average"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMeWszTm4wM056LUJnEAE",
            "text": "Upscale Italian restaurant with amazing atmosphere.\nOur food was great!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsU2NYVjRTbFZZUVVKM1FXaDZSRzVoWlRoa1JuYxAB",
            "text": "We were here for our company party - the food was ok, but not in accordance to the prices. I had the chicken parm, which was ok, but for price, I would expect to be amazed. Everyone's food was good, but not great and for this price level there needs to be something - anything outstanding."
        },
        {
            "date": "5달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbjg2dUxScGNpWWZ3EAE",
            "text": "Haben hier zu Abend gegessen.\nDas Essen war sehr gut! Alles auf den Punkt und Qualität top!\nGetränke ebenfalls sehr lecker und der Service extrem schnell und aufmerksam!\nKeine Wartezeit für irgendwas und es wurde jeder Wunsch sofort erfüllt!\nGerne wieder!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLQ2JwdERSbE5uemRREAE",
            "text": "Not worth the money.\nFood was average.\nService was great.\nFood quantity and quality for the price not recommended."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLLVRrN0RtbnJuSVdnEAE",
            "text": "Great Italian food. I had the pleasure eating there last week. The appetizers', dinner and desserts were fantastic."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNVHQtcWpOOFlqY1pBEAE",
            "text": "An unexpectedly delightful meal with impeccable service in a classic old school Italian restaurant. Cozy interior, solid menu beautifully executed."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJajhXeFV3EAE",
            "text": "I ordered a sancocho soup and a chicken soup. Both tasted off. Like it was made the day before and the samcocho was watery not even thick. No meat never will I order from here again and I’ve ordered multiple times. Whoever cooks definitely doesn’t know how to cook. Mofongo off soup off. The only maybe good thing is the mangu. Everything else save your money if you know what real good food tastes like."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bVpIaTJRRRAB",
            "text": "The ambiance is amazing and if you love authentic dainty decor, you will love how the restaurant created a place that makes you feel like you’re in little Italy. The staff are second to none and was impressed how they deboned the fish before me. I could not fault the food neither the service. If you’re looking for good food, good service then I recommend you eat here. If I lived in NYC they would see me more frequently, I hope they have one in London."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRM2NIWXFnRRAB",
            "text": "It was great."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRektTeVpnEAE",
            "text": "Food was excellent and service was above and beyond expectations!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNkxfUzZRRRAB",
            "text": "Nice work.lunch spot. Quick and easy"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbDdyWjVBRRAB",
            "text": "This place is outstanding"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMXFLMkZREAE",
            "text": "Great ambiance, amazing food and anove all the best customer service. If yoy are in NYC Joseph’s is a must."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfanZHa0ZBEAE",
            "text": "On Wall St for a business NYSE Closing, and felt like eating Italian food. The wife does not like seafood, and there are a few items on the menu that meet this need. She had the chicken Parm, and I had the sausage chicken. I thought mine was pretty good and serving size was ok. The wife felt the tomato sauce on the chicken Parm came from a can... Did not taste prepared, she also ran into a few pieces of the chicken that were fatty. The olives and bread were good, Limited selection on non-alcohol beverages. The waiters and waitresses were on top of it, and friendly. We felt a little out of place in jeans, as most of the customers in this place were in suits. They did ask if we had reservations, and seated us even though we looked a hot mess from traveling and did not have reservations. I guess we should suspect this from the financial district. We are from TX, here for business so I won't complain. If had the choice I would go back to Joseph's and try other plates, and their salads as they looked good. I would consider dressing up a bit though so we don't feel as out of place."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNHRlc2hRRRAB",
            "text": "This was such an amazing find! The service is warm, and the food is exactly what you would hope it would be. The restaurant itself is very quaint and well apportioned, and you do not feel like you are sitting so close to someone that you could share food. It was a great place to have a quiet evening meal. Service was very prompt, and always made you feel welcome. The food itself was perfectly cooked and very well flavored. And given the fact that you can get a reservation last minute, you just can’t pass this place up. Joseph’s is definitely a hidden gym."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cjZQOUFnEAE",
            "text": "from the outside this place doesn't look inviting, but we descended the steep staircase anyway and were welcomed into a nicely appointed space and seated right away. what a surprise! everything from the complimentary olives and bread, the wine and the entrees were way better than we expected! I had the chicken scarpariello and Jenny had the eggplant parm and both were excellent! attentive and friendly service. this turned out to be one of the finest dining experiences we've had all year. thanks!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Z19TME9REAE",
            "text": "Such a surprise.   We didn’t have high expectations at all & yet it was just great!  The wait  staff was attentive & food rocked!  We will be back."
        },
        {
            "date": "11달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQb2V6dTlRRRAB",
            "text": "Świetna włoska (chociaż może nie do końca) restauracja. Świetny ribeye, świetne wino (również włoskie), świetna obsługa. Na pewno tu wrócę. Polecam!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbi0zckN3EAE",
            "text": "Delicious food, amazing service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYM3I2VTdBRRAB",
            "text": "We had an unfortunate experience at Joseph's and won't return. Despite having an early reservation, we were forced to sit next to a huge table of extremely LOUD men. These men were literally standing and screaming profanity at each other throughout the meal, all in good 'fun.' Our table of 5 could not even converse. There were other open tables, but our server refused to move us. The broccoli was mushy, our bill contained errors (overcharged), and we suspect we were served a cheaper substitute wine than the one we ordered (it came in a carafe, so we didn't see them pour it). When it came time to pay, they would only split the bill 4 equal ways for 5 people, leading to an awkward moment for our group. We all left disappointed with the food, service, and atmosphere. Never again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNWVUNklnEAE",
            "text": "Food was delicious, the stuffed calamari was amazing."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYM3RYWXVnRRAB",
            "text": "Nicht sehr ambitioniert"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYa3NlUUxBEAE",
            "text": "they gave some food to us that was $77 and was out of menu without telling us the price and also enforced us some 20% tip for a party of 1.\nThe service was also too soow"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucDdubmxRRRAB",
            "text": "the Bass, it was delicious, skin was crispy and was just cook perfectly! Waiters were very efficient, definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucW8zemVREAE",
            "text": "Idk what I ate, but it wasn't Italian food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMzYybkNREAE",
            "text": "refined environment and excellent cuisine in pure Italian style, the best restaurant in Manhattan"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdHJXT2VREAE",
            "text": "Joseph's Italian restaurant is a solid choice for anyone looking for quality Italian food in a relaxed setting. I recently visited and was impressed with a few standout dishes: Prosciutto, Burrata, and cacio pepe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIXzdqMWNnEAE",
            "text": "Everything about this place is great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdU92dTBRRRAB",
            "text": "We loved everything about this restaurant.  It has a very nice atmosphere,  the service is great with very attentive staff. I had the pork chops and have to say, it was one of the best pork chops I have ever had. My girlfriend had the mussels and she loved them. I highly recommend this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bFk2SF9RRRAB",
            "text": "Good atmosphere nice to hangout with friends"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMzgzVzhRRRAB",
            "text": "The best veal chop I ever had"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMTRhUkJnEAE",
            "text": "Best Italian spot downtown no question. You can eat clean or you can eat fatty either way whatever you are looking for you will not be dissatisfied. Great people and service tell ‘em blanco sent ya."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicnV1c3hRRRAB",
            "text": "Tasty"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicnBpbjN3RRAB",
            "text": "Joseph’s is a quiet neighborhood Italian spot with great food and even better service! The mozzarella appetizer was great, the wine selection was also very good, and the gnocchi was homemade and delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydGFpTERREAE",
            "text": "Disgusting that a restaurant would charge $12 for water. I have no problem paying for a great atmosphere but this place is just an over priced Olive Garden. The design is tacky and a $20 bottle of wine costs you $300. It’s laughable"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNTYzOURnEAE",
            "text": "No lo recomiendo el pan frío y duro y ni hablar de la pasta a la nonna que pedí ósea estaba súper súper dura… no importa el pago si se trata de calidad deberían contratar chef para poder ofrecer comida de verdad"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbGN2ZHlRRRAB",
            "text": "I do not recommend. I did come in thinking it was chef food, but the bread was hard and old, the antipasti was horrible and low quality. I felt scammed. I don’t mind paying for real good food, but this one is terrible and pricey. 😂 service was great tho"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMl9ULVlREAE",
            "text": "Visiting town with relatives and tried this restaurant for lunch. Very nice inside, staff very professional.  Food was excellent.  The only thing that I found weird was when my check was brought to table for a party of 5, there was a 20% gratuity already added to the ticket.  I found it a little insulting as if they did not think that I was going to tip adequately but they short changed themselves because I was planning on tipping 30%.  Have only experienced that with large parties before.  Maybe it is a NY thing"
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbXZuVHN3RRAB",
            "text": "Jedzenie - pyszne\nCarpacio mięso dobrej jakości i zimne\nMakaron carbonara dobry\nCrispy sea bas bardzo dobra\nTiramisu takie jak być powinno :)\nObsluga - Uprzejmą I profesjonalna\nKlient - restauracja jakby w piwnicy ale z wyjątkowym klimatem, ściany obłożone butelkami wina - świetny pomysł\nWarto tu zajść i spędzić czas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqZ1lhaUF3EAE",
            "text": "La cena perfetta …\nWe had the an amazing dining experience at Joseph’s. Astro and his team truly are world class restaurateurs. The food, service and our comfort level were perfect. It’s always nice to get treated like family, enjoy really tasty food and dine in comfort.\nGrazie mille a tutti 💋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdHBLeVpnEAE",
            "text": "Tucked away in the bustling heart of NYC’s Financial District, Joseph’s Italian Restaurant offers a pre-fix dinner option within a setting that exudes comfort and a welcoming atmosphere. Its proximity to the lively Stone Street and the renowned Harry’s Steakhouse adds to its allure as a dining destination in FiDi. The interior ambiance strikes the right note for a pleasant dining experience, offering a respite from the urban rush.\n\nMy decision to dine at Joseph’s was influenced by the promise of a serene environment paired with the convenience of its location. However, while the setting met expectations, certain aspects of the service and culinary experience left room for improvement.\n\nThe service was adequate up until the conclusion of our meal, when the attentiveness of our server notably diminished. The prolonged wait to request our check, seemingly forgotten after our table was cleared, detracted from the overall dining experience. Furthermore, the presentation of my leftovers in a simple plastic ‘Thank You’ bag, placed unceremoniously on the table before dessert was even served, lacked the finesse one might expect from an establishment of Joseph’s caliber.\n\nCulinary-wise, the dishes were satisfactory, yet unremarkable. The steak, requested medium, leaned towards medium-rare, verging on rare at its core. Additionally, a specific request to substitute the mushroom sauce due to allergies resulted in a plain, sauceless steak, rather than an alternative concoction from the chef. This oversight was disappointing and contributed to the overall oddity of the meal.\n\nThe dessert course brought its own set of mixed feelings. While the tiramisu I received was enjoyable, the portion size compared to my friend’s—visibly about 20% larger—left me feeling somewhat overlooked. Whether my slice was unusually small or my friend’s was generously oversized, it introduced a sense of inconsistency that marred the end of our meal.\n\nThe value proposition of dining at Joseph’s Italian Restaurant is debatable. While the location is undoubtedly prime, nestled within the FiDi area and surrounded by ample dining alternatives, the culinary and service missteps suggest that there’s room for refinement.\n\nIn conclusion, Joseph’s Italian Restaurant earns a solid three stars from me. It stands as a nice spot in the Financial District with potential for greatness, yet the inconsistencies in service, culinary execution, and the dessert disparity suggest that there is yet some way to go in fully realizing its promise."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSX002eTZRRRAB",
            "text": "이번 뉴욕 여행에서 가장 잘한 건 첫번째가 MLB 본 것, 두 번째가 이 식당을 방문한 거에요. 음식도 맛있지만 테이블 세팅부터 손님들을 대하는 매너, 배려, 친절함 등 대를 이어온 철학이 담긴 이탈리아인들의 장인 정신이 무엇인지 감탄했던 놀라운 경험이었요. 이번엔 신혼여행으로 왔는데 다음엔 아이랑 셋이 같이 올 거에요!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsNlBqME9nEAE",
            "text": "What a gem!  We had a meeting a few blocks away, found this on Google Maps, it looked interesting with Northern Italian cuisine. Early on a Wednesday evening—No reservation no problem. Great service from the staff, (many from Albania) wonderful atmosphere. Joseph’s is a gem. Food was excellent. Wine was great. Service very friendly, and accommodating."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGMjdfR1ZREAE",
            "text": "Nice Italian place with a really sweet ambiance. Nice and welcoming . Really cute bar, interesting service with so many people on the service, but a little disoriented. The one thing I don't like is when your waiter is topping up your glass with water every second, I get it, they want you to spend a lot of money on the expensive sparkling water, but common you cannot be that aggressive.\nThe food is good, nice pasta and appetizers, a great place to get together with coworkers and have dinner and a drink."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbE5qRTVRRRAB",
            "text": "The food at Joseph's was exceptional, worth every penny! Service was superb & our waiter was excellent. My online birthday request for my gf was fulfilled with impeccable service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMDkzLXJnRRAB",
            "text": "Amazing restaurant. For valentines they have those amazing raviolis is shape of hearts 😍\nService is excellent. The main course - chicken had very very very tasty Sauce (…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURON1lYenF3RRAB",
            "text": "Food was delicious.   Service was horrible.   We had to finally go to hostess and ask for our bill after we had sat there for 10 minutes after they emptied our table.  The manager brought 2 shots of tequila as an apology (which we did not want) but at least he made an effort."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdElmUnV3RRAB",
            "text": "Had an amazing time here at my friends rehearsal dinner. The space is beautiful and the food was fantastic. We had the whole place to ourselves on a Saturday which was also an added bonus. Will definitely be back to try other delicious food they have to offer"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxZ0xtNDhnRRAB",
            "text": "We found Joseph's looking for another place and decided to try it. What a nice surprise. Even though they had a big group celebrating the holidays, they served us like we were the only ones there. Later, some regulars arrived and were served in the same manner.\n\nAmazing food and wine."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURza0szZWhBRRAB",
            "text": "For an Italian restaurant in Wall Street area, this place is pretty awesome.  No need to go to Little Italy when it is this good. If you work in the Wall Street area and crave for Italian food, you must try this place."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvcDRMUFZ3EAE",
            "text": "Nice decor. Scrumptious food. Free homemade liquor tasting. Good atmosphere. One of us had the branzino, it is cooked whole and first delivered to the table then taken to the side to be de-boned and filleted and served again on a plate but still sizzling. Servers are very welcoming and courteous. Perfect place for groups."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOd3V1cUlBEAE",
            "text": "The restaurant was one place who wants to have traditional Italian cuisine. I was confused between two dishes and Maria helped me choosee the right one. Enjoed my Lunch here. Awesome atmosphere to have a great time with some wine and of course don’t forget their tiramisu 😋😋😋"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3LU5lQXlnRRAB",
            "text": "Had a delicious Pappardelle ai tre funghi that was absolutely amazing!\nVery nicely decorated place, with wine bottles covering some of the walls. The place is  \"hidden\" from the street."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdE5mWldBEAE",
            "text": "Didn't expect an Italian restaurant to have such delicious steak! Definitely a hidden gem of a restaurant that I will visit again. Lovely customer service also"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSellydlpREAE",
            "text": "Amazing! The service and the food was unparalleled- we will definitely be coming again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWX3R2cHBnRRAB",
            "text": "After reading all the great reviews, I was excited to give it a try, but it was all together very disappointing.\n\nThe food was fine, not great. Pretty underwhelming and could have used a bit more seasoning. But for the price, I can’t knock it too much. The cappuccino was akin to drip coffee.\n\nThe service was so slow despite being late and one of only a few tables there. We sat for ages to even meet our server, and then again trying to find someone - anyone to bring us the check. When service was available, it was someone different literally at every interaction, which meant multiple people asked our drink order and we were never sure if that first person was already on it or if we should reorder.  Staff needs to communicate with each other.\n\nWhen the check finally came, it has $50 worth of things we had never ordered, which felt like they were hoping we just wouldn’t notice.\n\nThe atmosphere was just bizarre. Visually it appears to be a nice classy Italian restaurant but the music was that of a  2000s club.\n\nHad higher hopes. Won’t be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWc2JIWEdREAE",
            "text": "Absolutely FANTASTIC! I love the basement level of the restaurant, it gives off an intimate and speakeasy feel. The entire staff is wonderful. Very professional and welcoming. The food is amazing, the perfect comfort food of northern Italy. I highly recommend the grilled octopus to start. As a first dish the garganelli with meat balls (the pasta is homemade and cooked perfectly), for the mail dish the veal chop. And don’t forget to leave room for sorbet!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaN29MdFNBEAE",
            "text": "We had the best time here last night! We live locally but have never tried it. Last night we had the absolute pleasure of eating there. We sat at the bar and the food was delicious, the restaurant is beautiful and the bartender was 10/10. Music at the bar was so fun which was a pleasant surprise for an upscale NYC Italian restaurant. We can't wait to go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNlpxM05REAE",
            "text": "I recently had the pleasure of dining at Joseph’s Restaurant, and I must say, it was an experience to remember. From the moment I walked in, I was greeted with a warm and inviting atmosphere that set the tone for the entire evening.\n\nThe food at Joseph’s is nothing short of exceptional. I had the privilege of trying their branzino and hanger steak, and both dishes were a true delight for the taste buds.\nThe ambiance was enhanced by the lovely music playing in the background. The service was impeccable as well, with the staff going above and beyond to ensure that every need was met.\n\nWhether you’re looking for a romantic dinner spot or a place to celebrate a special occasion, Joseph’s Restaurant is a fantastic choice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaeEt1SFlBEAE",
            "text": "This place exceeded my expectations. The staff was absolutely lovely, the food was great (the wine was exceptional!) like I expected and the vibe was relaxed even though everything felt upscale. I went with a friend and we had such a great time and I would go back with my husband for a night of romance too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabF9HWVR3EAE",
            "text": "A first-class dining experience!\n\nStarted with a selection of appetizers - the grilled octopus was extraordinary, shrimp, burrata with prosciutto and figs,  and fried calamari, all recommended.  And the crispy sea bass is not to be missed.\n\nThis is old-world service and a level of professionalism that make dining a pleasure.  Highly recommend!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeDZDZGZREAE",
            "text": "I've visited Joseph's many times and the food has always been exceptional. Service is excellent. Restaurant is located below ground and you can feel a little claustrophobic/ cave dweller. However the food and service make it worth the trip."
        }
    ],
    "reviews_count": 71
}