{
    "name": "Mudville",
    "place_id": "ChIJV1VdJB9awokRsucxnGK_eTE",
    "grid": "MN1",
    "address": "126 Chambers St, New York, NY 10007, USA",
    "rating": 4.2,
    "user_ratings_total": 910,
    "phone_number": "(212) 964-9464",
    "reviews": [
        {
            "date": "수정일: 2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KV1JGUXllRVp6VURWSWFuQm9VeTFRVm0xRVpXYxAB",
            "text": "Was shopping in the area and popped in for a drink before heading home. Service was good and beer was refreshing."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVWRHRjFjRWcyU0VjelN6aHJSRmxhT0ROT1JsRRAB",
            "text": "Let me start by saying I *really* tried to give this place a fair shot. But my experience? A hot mess from start to finish.\n\nFirst time we go in -- just me and my sister- we have an hour to kill before our haunted house activity. So let's rock it right? We ordered a margarita, a water, and hot wings. After **37 minutes**, the bartender comes back like, \"Oh, I forgot to put in your order.\" *Thirty-seven minutes of us sitting at the bar looking in our face, even had the audacity to set up plates in front of us. Obviously, now the time has gone by and we have to go. The manager *Jo* she was nice about it, gave us a lemon drop shot, apologized, and told us to come back after our activity -- said she'd comp the wings. Cool. I appreciated that.\n\nSo we actually did come back later that night with the rest of my siblings. We ordered guac, honey hot wings, and drinks. The buffalo wings (which she comped) were honestly the best thing we had. Everything else? Mid. Definitely not worth the prices.\n\nThen -- and this part annoyed me -- I asked for ranch with my wings, and they brought out some mystery white dip that turned out to be *dill.* I said, \"This isn't ranch,\" and the server just said, \"Oh, it's a dill dip,\" like that was no big deal. Um, what if I was allergic to pickles? People have *actual* allergies. Zero care or concern.\n\nAnd then, because apparently this is their theme, I ordered another drink before closing out and waited another 25-30 minutes. The manager comes back (again) like, \"I'm so sorry, your server forgot to put it in.\" She comped it, but at that point, I was just over it.\n\nI even asked her, \"Why do all your servers forget to put orders in? That's literally the job.\" She just kept apologizing.\n\nNow, I hate to even go here, but it's hard to ignore: we were the *only* Black customers there -- and the only people of color at all, including staff. We were sat in the corner and basically forgotten. Twice. Make of that what you will, but it didn't sit right with me.\n\nBottom line: the wings were solid, but the service was careless, the food was meh, and the vibe was off. Overpriced and underwhelming. I left frustrated and disappointed -- and I'm definitely not coming back.\n\n**I was able to post the video of the establishment on YELP. **"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTldrMTZZbU5aYVdOZmVrNVZkbll6VTI0dGQwRRAB",
            "text": "The food is surprisingly good but pricey. Drinks are good as well."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNk4xUnJaa3RXV25ZdFNFdzBOWFJLWlZkSGRVRRAB",
            "text": "Great spot and food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMGVYSjVjVEY0V0c1Q1N6QklRbXBQWWpkNk0zYxAB",
            "text": "Overpriced - I came here thinking it would be cheaper than my usual spot nearby. Turkey burger was $19 with no sides and had sauce spilled down the sides so I couldn’t pick it up without getting my fingers messy so I had to use a fork and knife. I ordered a beer in a can that was $16! I should have checked the price but I’ve never paid that much for a beer before so a bit surprising and the server did not bring my attention to it so I was shocked when the bill came. Not sure what’s going on here but VERY overpriced in my opinion. I won’t be coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swM2JGcHZkME5DUmsxTVoxaGpjVUpmYmw4MlJWRRAB",
            "text": "I appreciate every thoughtful detail this restaurant offers. This spot adds value to our local area. I left happy with my meal. Adding to my satisfaction, the proprietor is extremely friendly and observant. The entire experience was enjoyable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOR1RWTndVRmQ1TmtabE1UUjVVVVF6UmtadFRWRRAB",
            "text": "Came in during trip visiting  friends. Ratings may have given us high expectations. It’s average at best. Drinks were overpriced and food just standard pub quality. Constant upselling was a turn off but service was good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NFlsQjRaSFZYV1hWdFNqZFpZVzE0ZUUxRmRsRRAB",
            "text": "Delightful food and service. Wings are some of the best but the pizza and burger are very solid pub food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNE5VRlZjMVZTWVZCVk9VUmhaVzEyUkY5alFYYxAB",
            "text": "My husband and I love turkey burgers (which are not that easy to come by in restaurants). The turkey burgers here are out of this world! So packed full of fresh herbs and garlic. Occasionally my husband gets the chicken sandwich and he says it is really good, too.\n\nWe always receive fantastic service and food at Mudville. We really enjoy having Camilla as our server & the manager (I believe, Brian) spent several minutes at our table making sure everything was great (plus other \"food talk\").\n\nMudville is our kind of neighborhood bar!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZdGJIZElhbXBNWjBJMU1uVTVSMjlEZUhwUlRuYxAB",
            "text": "Upgraded atmosphere.\nVERY nice and great wing special"
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNU1WbDNTV2xHYms5a01YWkplRXROVkZGRGVVRRAB",
            "text": "Serveuse nul, aucun effort et en profite pour faire payer des produits en supplément.\nOn a demandé de changer le verre de ma fille de 10 ans et il nous on ramené le même verre.\n\nBref je déconseille fortement.\nLa seul mauvaise expérience après plus d une semaine a NY"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcmVsbENja2RsY0RaUGEzUlhSV2xSYVZCbGNGRRAB",
            "text": "Very disappointing experience, both food and service.\n\nI came in with high expectations based on reviews, but the reality didn’t match at all.\n\nI ordered the steak and fries: the skirt steak was over-seasoned to the point of masking the meat’s flavor, and the cooking was way off. I asked for medium rare, got something close to well done, with no sear/no Maillard reaction, the steak felt almost boiled.\n\nThe Caesar salad was just sad: plain lettuce with some parmesan, nothing more, for $19. That’s the same price as a pepperoni pizza or chicken sandwich, and $2 more than short rib sliders but felt like a bland side, not a real dish.\n\nI’m not even upset about the prices, cuz I understand NYC is expensive, and I work in the industry but when the food lacks care, that’s where the real problem is.\n\nWhat made things worse was the service. Our server checked on us literally 10 seconds after the food arrived, while I was still cutting the steak. The overall vibe felt like forced friendliness aimed at the tip, not genuine hospitality.\n\nWe politely shared our feedback with the manager, who barely reacted with a flat “I’ll let them know.”\nThen, when paying, both the server and manager were hovering around us to see how much we’d tip and we even overheard the manager whispering to the server about it as we walked out.\n\nI did leave a tip out of respect for the kitchen staff, but overall, the experience was far from what it should have been.\n\nA restaurant’s reputation is built not only on food, but on how customers feel when they walk out the door."
        },
        {
            "date": "3달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMFYyNUVXSEZqY21aM1NIbHljV0pJUW1VM2RHYxAB",
            "text": "雞翅好好吃，沙拉也非常的棒！服務周到，一面吃一面看球賽，是一個很有氣氛的餐廳，到八月還有優惠唷！"
        },
        {
            "date": "4달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210QlNHRmZRVXhHVURWTVdFZDNkbkI0WWxWUVVVRRAB",
            "text": "Der Bierhimmel für jeden, besonders für uns Deutsche die durch Zufall hier gelandet sind."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNlJzLTMxd2ZXUEZBEAE",
            "text": "Friendly people, nice atmosphere, great beers 🍺😎"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMYjZqS2lpMklTX3NnRRAB",
            "text": "Nice call in for a good whiskey"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQV3d0YVB3cDdQTld3EAE",
            "text": "HUGE shoutout to the manager for helping us out and getting us in last minute right before a Knicks playoff for a table of 12!!! Service was great, very attentive. The food was pub food , yummy and everyone was full by the end. Great beer selection. Can’t recommend enough for the service alone."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZnUyT3FqLVB6RDBRRRAB",
            "text": "Great service, great beer, great hot honey wings even though they were hotter than expected. House made ranch. Will be back."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRM19mUHBRRRAB",
            "text": "Great bar for after work drinks and wings"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdC1pZHlRRRAB",
            "text": "They charge $4 for ice when you get liquor straight up on the rocks. Criminal.\n\n[Edited after a reply saying they don't charge for ice. Here is my receipt showing that they charge for ice lmao]"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcDVQWktBEAE",
            "text": "Worth a visit if you're in the area. Great chicken wings and great beer. Service was awesome 👌"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcV9LQzRnRRAB",
            "text": "10/10 The vibes and atmosphere are chill with a little classy thrown in. It’s giving modern sports bar vibes and the food and drinks were OUTSTANDING. I will remember this burger for the rest of my life. Mudville’s martini game is fire and Stephanie my server gave impeccable hospitality. Great place to end the day, watch sports, eat, drink then repeat."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdzZYZWVREAE",
            "text": "More like Mid-ville...\n\nCame here hoping for a decent neighborhood spot but left underwhelmed. The name fits, unfortunately – the food was generally mediocre, especially considering the high prices. The real issue was the chicken sandwich; it wasn't just spicy, it was so excessively hot it was nearly inedible. Just overwhelming heat that destroyed any other flavor. Burger was a bit overdone and mac and cheese was chunky and dry (tough to accomplish).\n\nGood beer selection and available 22oz servings, if you can stomach the prices. Definitely not worth the walk for 'mid' food and one painful miss. Plenty of better options in Manhattan."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJLUpIdWtBRRAB",
            "text": "Staff is super kind\nFood was tasty\nHad a great time"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJb0xDNzZBRRAB",
            "text": "Basic Americana bites. Needs a bit of unique atmosphere."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNVBYR093EAE",
            "text": "Great service and delicious food! Highly recommend"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNHJLN293RRAB",
            "text": "This was my lunchtime spot for years. Unfortunately, they got rid of the burger and beer lunch special."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdGZhN09BEAE",
            "text": "The wings were amazing, so many beer options and the staff actually educates you on them! Jojo and Liam were amazing"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMDUyVnZ3RRAB",
            "text": "Awesome, spacious sports bar!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NHQzR0pREAE",
            "text": "Staff is great. Pizza was more of a cheesy bread. Drinks and spicy chicken sandwich were good. Music is bad 80% of the time. A place for people to go with coworkers."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2b01ENkRREAE",
            "text": "Amazing wings! Great for seeing some football and have a bite to eat. Will come back"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbXJpRmZnEAE",
            "text": "Greate place to stop by at lunch,  friendly staff. Miguel is the best person to discuss lunch options.\nAttractive price for special menu between 11 and 3 during weekdays.\nThank you."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMnRQUzZBRRAB",
            "text": "Excellent restaurant with great food, atmosphere, and prices. For just $10, I enjoyed a juicy, tender burger made from the finest beef and a craft beer. The experience was enhanced by porcelain plates, a wooden table, cozy sofas, and the attentive service of a pleasant waiter."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzb2FPRzhnRRAB",
            "text": "Hands down my favorite bar in the area. Burger is fresh and juicy and cooked right every time. Mike is super friendly and treats you like an old friend even though it's your first time there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMXFyejZnRRAB",
            "text": "I went to Mudvillle for the first time in October 2024. I'm looking for a new burger and beer bar in Tribeca years after I lost my last one (anyone remember Grace?). I got a really good first impression. The burgers are outstanding. The beer selection is strong and varied. The cocktails are also good (although I think the old fashioned could use a cherry in that glass). The decor and atmosphere leans a little more towards upscale airport lounge than Tribeca bar, but thankfully it isn't trendy. It's firmly 21st Century contemporary. And being a very good sports bar, it doesn't have to pretend to be an old tavern or just another pub full of reclaimed wood. The service is excellent. The space is super clean, and the place likes to be ventilated. The front doors are usually open wide if it's over 60 degrees outside. As someone who tries to improve his odds of not acquiring respiratory illnesses, I appreciate that. I can't wait to go back. I think I found my new favorite Tribeca watering hole."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYLVp1a1N3EAE",
            "text": "I have come here a number of times for drinks with coworkers and have always enjoyed the extensive beer list and great prices. I reached out to Mudville a few weeks ago to see if I could host a going away party for a colleague there, and it was a great experience. I was able to book for my large party on Resy. When we arrived, everything was set up perfectly with lots of room for us to mingle. In addition, our server Sadie was fantastic and accommodating. She allowed our group to open as many tabs as we would like, whereas a lot of other spaces in the area require one tab only. Highly recommend Mudville for drinks in the Tribeca area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuaDktVVJBEAE",
            "text": "The food was great. I ordered the lobster burger and onion rings. Unfortunately, it took 50 minutes for my food to come out, but the hostess removed the onion rings from my bill because of the delay. I was there at 1:00 in the afternoon and the place wasn’t very busy. The service wasn’t very good. My friend and I had to ask several times for our checks. All in all, I would go back because the food was good, but only when I have a lot of time to waste."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuckp5eEJREAE",
            "text": "I went to this restaurant with my family of eight without a reservation and they were so accommodating and patient with all of us the food was really good. Definitely recommend the garlic bread With wings and the service was so great our server Miguel took really good care of us and make sure that we had everything we needed and checked up on us as well! My drink was really good and the bill was not so bad for 8 people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuakplUU1nEAE",
            "text": "A must place to visit when in Manhattan. A real find which we can highly recommend. With a great friendly vibe, welcoming staff, excellent food and service with an extensive selection of cask beers, wines and spirits.\nWe had such a great time and look forward to our return visit to NY  in January next year."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuZ0tfd3dnRRAB",
            "text": "We stopped by last night to watch the MNF game, believing it was the same place we visited 5 years ago. It wasn’t - that place (the old Warren 77) is no longer, at least in the same format. Quite serendipitous, as it turned out. Perfect spot to watch a game, but not a “sports bar”. Great service - couldn’t have been nicer. Good food too. Will definitely be back next time I’m in town."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIZ0s3R19BRRAB",
            "text": "I had an excellent dining experience on Sunday evening. The server was attentive and exceptionally pleasant, which greatly enhanced the overall atmosphere. I look forward to returning in the future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINzRIaVVnEAE",
            "text": "If you are planning on going here, make sure you read some of the recent 1 star reviews, as they are spot on with the experience my gf and I had. On Sunday 9/8 this place had the worst hostess/waitress combo I've ever experienced in my near 10 years of living in NYC. They were both confused and slower than molasses when the place was not even close to being packed. They would maybe do fine in a slow paced suburbs pub, but for a fast paced area like Tribeca, on an NFL Sunday, they really need to hire some better employees. Going here was supposed to a relaxing stress reliever, but all it did was raise our stress levels and cause us to leave as the hostess and waitress were incapable of providing a quality dining experience. Only way I would go back is if I got there early enough on a Sunday to get a bar seat so I could order directly from the bartender. The wing selection actually looks pretty good and it's a shame we didn't get to try them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIODhyUjF3RRAB",
            "text": "Used to be great- now food, beer & service disappointing & very $$$$"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbmMteE1REAE",
            "text": "Big college football crowd on Saturday afternoons. Huge beer menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bVl1dFN3EAE",
            "text": "Mudville should be avoided like the plague -- which is a shame because I will say, it used to be a nice establishment. Perhaps there was a change in ownership, but as currently run, Mudville is incapable of and unfit to provide even the most basic of services to its customers.\n\nThe service is slow and borderline non-existent. As quite literally the only customers in Mudville on a Saturday evening, it still took over two hours to partially receive our order -- I say partially because despite five separate \"confirmations\" the kitchen was evidently unable to make a dozen wings. The manager claimed they were having \"kitchen issues\" but its clear that Mudville's problems extend far beyond the four walls of where the food is supposed to be made.\n\nUltimately we asked to cancel the multiple orders we never received and requested the check. The check included charges for all of the unreceived items and after clearly pointing this out, the revised check came back with two additional charges for food we did not receive. This would have gone on for another hour if we didn't just cut our losses and leave.\n\nManagement was rude, the service was horrible and it's clear that Mudville no longer values their customer experience and has lost the friendly, neighborhood charm that once made it such a great place to go."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NnVPMzN3RRAB",
            "text": "Food and drinks were ok. Service was slow but it would’ve been forgivable except this place is a scam. They offered us still water or sparkling water. They did not offer tap water and we didn’t realize they were handing us bottled water. When we got the bill we asked about it and the manager Ian tried to tell us that it’s standard in NY. Paying for still water may be understandable at a nice restaurant, but this place is so not a nice restaurant so it didn’t occur to us. Then Ian tried to backtrack and say they’re trying to elevate by offering more types of water, but that doesn’t change the fact that they didn’t offer tap water and it was unclear what they meant by still."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3Mm9PbXR3RRAB",
            "text": "When we arrived at the venue the waitress asked if we would prefer still or sparkling water and we responded still. Perhaps if this weren't an extremely casual bar or if we had been offered tap water it would be easy to assume that this would be charged, but tap was not offered nor was a charge for still water mentioned. We spent an hour and a half here only to get one drink each and a few appetizers because the service was so slow and unattentive. When we got our check, we saw that we had been charged $9 per bottle of water. We told the waitress we were not aware that the water was charged at a cost, to which she responded quite curtly and proceeded to get the manager. Ian, the manager, was rude and combative from the outset, coming up to us and telling us that perhaps we don't understand how things work in New York. This seems like an overt scam - I genuinely do not think anyone would walk into this establishment and expect that they would even serve a $9 bottle of still water. Nevertheless, I don't think it is fair to assume a customer to expect a charge on water if you are not going to directly offer tap. I also found the claim about the restaurant industry pretty ridiculous; I've experienced a similar confusion once in the past at a relatively nicer restaurant and when the issue was raised the fee was waived without question. This review also applies to the food and drink."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOGNlWWJREAE",
            "text": "We had lunch here today. Great service, nice food and a ‘sporty’ atmosphere. My son gave Mudville in total, a 9 out of 10. That tells!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOGFIeG9RRRAB",
            "text": "It was our first time trying this place. We asked lunch deal beer and hamburger for 10$ (10.88$ with tax and 0.12$ for change that we didn’t get)… we asked if it is possible to take away, but she said no…  the waitress forgot about us and we waited beer like 15 min, then she forgot our hamburger and when we asked for it, it turns out they have already prepared the hamburger ready for take away long time ago and it was already cold🤦‍♀️😵‍💫. If i could i would say 0/5 for service"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBd2ZUUVFnEAE",
            "text": "Returned for lunch after a long absence.  Had the steak sandwich and Jerk Chicken Wings along with a Greenport beer.  The guys I went with had a spicy chicken sandwich and a burger.  The burgers and sandwiches come bare so we ordered a side of cheese fries to share.  We all agreed that the wings and fries were fantastic and the sandwiches & burgers were great. Caught up with a little Euro cup while we ate.  Very positive experience."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzMlpDeklnEAE",
            "text": "Expansive beer list with interesting offerings on draft. The staff were attentive and friendly and the space was well laid out: plenty of varied seating (high tops, regular tables, a long bar). The food is normal Americana pub fare with…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdmREUC13RRAB",
            "text": "Came here and sat outside. They have happy hour specials from 3-6 from Tuesday to Friday. We started off with cocktails which were a good amount of sweet and refreshing. We ordered brussel sprouts, wings, and mac and cheese to share. I also…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNHVxZzBnRRAB",
            "text": "Some of the best wings that I've had in a long time. The pulled pork is also fantastic especially with a side of their crispy thin cut fries. Great selection of beer."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURheU9DdjhnRRAB",
            "text": "Stopped in for cool drinks and a bite to eat. Ended up ordering club sandwich, 1/2 rack of ribs and a side of Brussels. Ribs were a bit dry, but loved the Brussels and club sandwich. Drinks were cool, and service was attentive."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbGZETDRRRRAB",
            "text": "Still one of my favorite Tribeca sports bar pubs! They have the greatest wings; grilled Jamaican jerk & baked rosemary, garlic lemon. They also have incredible HOMEMADE ranch, can’t beat it. Great eats, drinks, and sports! So happy they stayed alive after a tough year with Covid! Cheers to many more visits!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvaUtybTl3RRAB",
            "text": "I walk past this place everyday going to and from work and yesterday I decided to go in with some friends and it was the best thing ever. The servers were friendly and the food was great. Let's not forget the $5 all day drinks were the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaWZ6QjlRRRAB",
            "text": "Est. 1977\n\nLayout/atmosphere\n*Bar area with four TVs and large selection of craft beer taps; tables and booths; old New York photos on the wall; covered outdoor dining structure in street\n\nService\n*Good\n\nFood/drink\n*Torch & Crown All In (can) - good\n*Classic Buffalo Wings (medium) - decent amount of meat; good heat\n*Mudville Burger (beef patty, sunny side egg, bacon, Cheddar cheese, special sauce, lettuce, tomato, red onion & pickles) with fries - very good; bun held up with all the ingredients; many flavors; fries were good, maybe a hair too much salt"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1N2VUay1BRRAB",
            "text": "Good server service, horrible chef, all burgers ordered were over done and my fry egg on top was half raw, had it returned and got back a dry out fry egg, felt it was a TAKE THAT response, won't ever go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtN2VpSDV3RRAB",
            "text": "Great bar with a good happy hour on apps and drinks, large TV's , diverse craft beer selection, and friendly service. A lot of locals frequent this place and Tara the bartender was phenomenal\n\nThe buttermilk chicken tenders were cooked and seasoned well. Try it with the wow sauce on the side if you like spicy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NU1XV3h3RRAB",
            "text": "Who wants Detroit style (aka middle school cafeteria) pizza in NYC? 🤢 Nice big screen TV's playing the Stanley cup but I can get that at home or live at MSG."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZd3VMR3VRRRAB",
            "text": "The server/claims to be manger was very rude.  She didn't hear my friend order his food - and when I said he did (it's possible she missed it, people were yelling at the tv.), She told me \"I'm not deaf\". Also, my medium burger was raw. Would not recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOcHZPcXdRRRAB",
            "text": "10/10 This is my favorite spot to get wings and a burger in this area.\n\nFood: It has great buffalo wings, and the burger and fries are absolutely delicious. They have Pat LaFrieda patties and it hits every time. My friend had the Chicken Bites and loved them too. I need to try other things on the menu. Will report back 🫡\n\nAtmosphere: Cozy, classic pub vibe, but feels newer and super clean. It gets pretty busy for all sorts of sports game, and they have great outdoor seating in the summer.\n\nService: The wait staff has always been super friendly whether it’s busy or not. They also make great suggestions on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROODdib1RREAE",
            "text": "Good bar food and atmosphere. A bit crowded but it was the NFLbplayoffs. Get a table the bar is crowded!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNnZIclZREAE",
            "text": "I love this place. I've been going here for years. I love the new updated but still the wooden saloon vibes. They have televisions for news and sports watchers.\nAs for the food, I love the buffalo wings, bone in, or boneless. You can get them by the bucket, too. They also do take out. They have men and women restrooms. The meals are affordable too. They also have lunch specials. All the beer you can drink too. As well as wines and spirits. All the food is made fresh. The only frozen food products are the fries and onion rings, as the manager told me yesterday.  The manager is such a people person.\nThere is booth and single seating. It's a small place, not extra small, but it's a small place that can hold many guests in a comfortable way."
        },
        {
            "date": "3년 전",
            "language": "de",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtMFl1SEZBEAE",
            "text": "Gute Musik, Gute Küche…, Pizzas sind zwar klein aber dafür fein 😎👍…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMkl2ZmJBEAE",
            "text": "My wife and I stopped in here. The atmosphere was great from the moment we entered. We were greeted by a very friendly gentleman who helped seat us. We were then taken care of by our server. He was great and hospitable for the time we were there. The bartender was also very friendly and kind when she brought our drinks. I would definitely comeback here. 100% recommendation from my wife and I. You want great service with a great atmosphere and great food;  this is your place. My apologies, I don’t remember anyone’s name."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5a3R6WklREAE",
            "text": "Great wings and place to get good food AND watch sports.\n\nDuring covid also had a spacious setup inside and outside"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbHR5RG1RRRAB",
            "text": "Mudville9 is awesome! The salads are crisp, the burgers are juicy, the beer is always cold (and they have a HUGE selection), wings are never disappointing (iykyk), and the service is unbeatable. Mike, the general manager, is a gem and always ready to go above and beyond for his patrons. I frequent here after work for Happy Hour, and really love the atmosphere. It's cozy and warm, and really fun to meet friends at! Don't skip the wings, fried pickles, seasonal beers, and signature cocktails!!"
        }
    ],
    "reviews_count": 68
}