{
    "name": "Casa Carmen Tribeca",
    "place_id": "ChIJ4Wld4_xbwokRMUC8T8wNnLw",
    "grid": "MN1",
    "address": "114 Franklin St, New York, NY 10013, USA",
    "rating": 4.5,
    "user_ratings_total": 331,
    "phone_number": "(917) 540-5500",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWFJqUXhZVXBVUVdOeFEwNHhialZaVlZCR1dVRRAB",
            "text": "A true gem!  The staff provided outstanding service.  The ambiance was superb.  The drinks were generously poured and delicious.  Very accomodating to food allergies.  Had a great time and will be back!  Wonderful restaurant!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVldESTRWRXA1WkVveFVqbE5iRWxTZW5sNFdGRRAB",
            "text": "The quality justifies the price point. The restaurant offers easy access and a cozy environment. Their food tastes great in a comfortable setting. Every employee exhibited friendliness and guidance. The staff treats you like old friends."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeVpsTkdhRTF4TVhOUU0xbHVSVWQzZEV4TmNWRRAB",
            "text": "Wow wow and wow! The culinary creativity here is absolutely stunning. The remaining options were delicious, using spices I'd normally avoid. The dining room stays well occupied. Staff members combine efficiency with a welcoming manner. This place offers excellence I haven't encountered recently."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WWFuaEJVMjR3ZEd0SlJHWkdYeTFNWlc1dmVYYxAB",
            "text": "Try the mushrooms and the rajas! Delish. Also the raw tuna appetizer."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbGVrdHdUVmxrUzBaTVp6RkJhRmRQUm5Nd2NrRRAB",
            "text": "Went to Casa Carmen for brunch and had such a great experience. We ordered the carajillo, ceviche verde, empanadas de plátano, a few tacos, and some of the brunch entrées—everything was fresh, flavorful, and beautifully presented. The vibe was relaxed but lively, and it was the perfect spot to start our day before walking around Tribeca. Definitely worth a visit!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWU4xZHZOSGxRTW1aRWJFYzBka3g0TmtRMGVVRRAB",
            "text": "Amazing service, great vibe, great food. Highly recommend coming here especially if you’re in a group !"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NlJ6SmFWRWh4Umt0aGRubFhPVkJSVDIxM04xRRAB",
            "text": "Comida riquísima  y sabor bien mexicano 10 de 10"
        },
        {
            "date": "3달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRVlqQjZWRzg0WjFVelRVMTNhV1ozVEVsdlpsRRAB",
            "text": "Wir kommen wieder!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SmVFMXRjVFZCVHpSVU5uTlhRVXRFTkdoaVNHYxAB",
            "text": "We had a group of forty here for a work function and it was perfect for the evening. The restaurant coordinated flawlessly with our planner; had a preset smaller selection menu, starters and desserts were all designed for a table share style and the drinks were perfect for us all after a long few days of a training conference session!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdmNqRjFXVVEwZGtwVVoyWndVVzVwWTBaaU5WRRAB",
            "text": "Great elevated Mexican restaurant with a great interior, good food and great staff!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cFNsUkRSMnA2TUROQ1NtRlBZMnQ0WVVoR01YYxAB",
            "text": "Es un lugar bien ambientado, íntimo y acogedor, que invita a pasar un buen rato. Ofrece platillos mexicanos bien preparados, de buenas porciones y con un sabor que transporta directamente a algún rincón de México. Una excelente opción en la zona de Tribeca para disfrutar de buena comida y bebidas."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSWVFWmZOMjlZYmtsR1ZqZEZkbWw0ZURkSlpuYxAB",
            "text": "It was our first time trying Casa Carmen. The place is beautiful, with great decor and a lovely atmosphere. The service overall was good — they have staff who pay close attention to table maintenance and small details, which we really appreciated. However, our server didn’t quite match that same level of service. He seemed to be in a hurry and didn’t take the time to walk us through the menu properly.\n\nThe food was okay — not bad at all, but nothing particularly memorable either. The only dish I can genuinely recommend is the Garnachas Orizabeñas.\n\nOne suggestion: more attention could be given to the cleanliness of the restrooms. It’s a small detail, but it does make a difference in the overall experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aYVJXTkxVVmxpUlhKVVQxUXhkRGRzWTB4clRtYxAB",
            "text": "Experience was excellent. Will definitely go back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPLXB3YkhFam9IVFJnEAE",
            "text": "One of my favorite Mexican restaurant in NYC! Amazing mole and esquites!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VON004b2p6N0oyX1JBEAE",
            "text": "The cocktail selections are great.\nThey created perfect balance cocktails.\nFood was so so. The tostadas was so hard rock.\n\nThe service was pretty bad. Not attentive at all. No spilling the menu. Blah\nI would come back for drink but not table service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQNmt0Sk9aNGY2MGt3RRAB",
            "text": "I reserved this place last minute and we came earlier than anticipated! We were sat regardless of being 20 minutes early. The atmosphere was really welcoming and so were the servers! The food was awesome and it reminded my Mexican mom of home! We even got a drink on the house for Mother’s Day! Overall we both really enjoyed our time there. Special thanks to our server Keren B!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMXNYUG13RRAB",
            "text": "Great mole!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNHN1UjB3RRAB",
            "text": "We hosted our son’s rehearsal dinner at Casa Carmen a few weeks ago.  The manager made everything so easy, the room was beautiful, the staff was excellent and the food was delicious.  This party was almost as good as the wedding!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3c3IydkJ3EAE",
            "text": "Went to Flat iron location for son’s birthday and told the waiter the occasion. I had Chicken mole which was way too sweet & I could not eat even half. Waiter busy talking to other staff & not attentive. Always had to wave him down to get attention. Seemed annoyed with me asking for different salsa. Not good kids options for grandkids. Never asked about bday dessert & we couldn’t wait to get out of there. Very disappointing"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNUtpQWNnEAE",
            "text": "Impeccable service in a refined atmosphere. Exquisite cocktails and authentic dishes from Mexico. Recommend their carnitas taco and black beans empanada."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaklXUURREAE",
            "text": "It was nice, didn't really interact with the server too much, but he did come check in with us"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBc1lmVDFRRRAB",
            "text": "The food is of excellent quality and the service as well. We had the good fortune of being served by Brenda and her service was sensational."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBaU9QSHhRRRAB",
            "text": "Wonderful surprise here. Did a bar seating for some light bites and cocktails and the entire experience was great. The drinks were delicious, the bartender very was good and the food was flavorful and fresh. Will definitely come back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcDRPd0xBEAE",
            "text": "brenda is amazing!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MC1fUTF3RRAB",
            "text": "Food was so fast it could have only been microwaved or there is a magician in the kitchen. Otherwise it was quite al right."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eGZMRnZnRRAB",
            "text": "Vibes. Excellent food. Incredibly fast service. Friendly waiter. Good drinks"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NTRqdnF3RRAB",
            "text": "SO so so delicious. great portions. great service. beautiful space. new favourite restaurant in tribeca!!!!!!!!!! will be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ODdxcURREAE",
            "text": "Delicious and authentic Mexican food. Drinks are delicious, service is amazing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aElEYm13RRAB",
            "text": "Beautiful Christmas decorations and great ambience. Food was fresh and tasty and was served efficiently. The Guacamole was excellent. The octopus Pulpo al mojo de ajo tasted fresh and was delicious. The Huarache de Rib Eye was flavourful and cooked properly. The service was excellent and attentive - thank you Ivan. We will be back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdXJPUXlBRRAB",
            "text": "What a surprise gem in Tribeca    On a recommendation from a good friend we went there and had a fantastic meal.   The. Appetizers were wonderful   We stared with crab on a large tortilla chip, ceviche and guacamole.  So packed with flavor    For a main we had the octopus and rice.  It has now become our favorite place to have octopus   Dessert was also innovative and flavorful The atmosphere and service are good too.  An absolute repeat"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdThTX0RBEAE",
            "text": "Great place and food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbHNDVXhBRRAB",
            "text": "Went for some drinks after an event and we had a great time. The cocktails are a bit pricey, but really worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcU1UOUNnEAE",
            "text": "Casa Carmen is the most authentic Mexican cuisine experience I’ve had in the US.\nThe chilaquiles w green sauce were absolutely amazing and the carnitas tacos were even better. I would highly recommend the desserts, like the flan de coco and the pan de muerto for this fall season."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuenB6YkxBEAE",
            "text": "Casa Carmen was so enjoyable - my friend had a bachelorette party here and the food was phenomenal! Here comes this down-to-earth Mexican restaurant that’s definitely more formal than your average joint with great food. Espresso martini was so foamy *signs of a solid espresso*\n\nThe venue was beautiful too with lots of natural light and earthy tones"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNnRPUUVREAE",
            "text": "Called the restaurant in advance and asked till what time the kitchen is open. Was told 10:30, we arrived at 10:10 and were told that the kitchen has closed already. Happened twice. Weird since Google says the place is open till 11pm."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIX0w3bzdnRRAB",
            "text": "So so tasty. Really, delicious to a fault. Forget the names of dishes but an app with brisket knocked me over, as did the elote corn side. Wowowow. Missing it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3em9PclNnEAE",
            "text": "Phenomenal food and impeccable service. Use with confidence."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiN183bFd3EAE",
            "text": "Nice decor friendly staff and good food. The octopus was tender and flavorful. The tuna tostadas were good, crab tostadas were also good but the star of the night was the  corn cake. I'll go back there just for the corn cake."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaE8zZXJ3RRAB",
            "text": "Casa Carmen is just what TriBeCa needed: Excellent and well curated ambiance with wonderful and friendly service. The food and drinks are delicious and the servings are just right."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNV96aGFBEAE",
            "text": "Great guacamole and steak tacos. Service is largely good in a nicer atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyemFha1ZnEAE",
            "text": "Overall, Casa Carmen was a great dining experience! The interior is stunning – modern and sleek. The highlight for me was definitely the crab tostadas, they were perfectly seasoned and well balanced overall. The mole chicken was alright, but I wish they provided more rice and tortillas to accompany it as it lacked some depth. Regardless, it’s a wonderful spot to dine and I’ll be back to try more dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMLWJ5ZkJnEAE",
            "text": "Fantastic upscale Mexican.  Highly recommend the tongue tacos,  though pretty much everything on their menu is divine.  Even their churros are out of this world."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OGZ5dDRnRRAB",
            "text": "Very pleasant surprise! Loved every dish and would definitely come back. The fish is incredible!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUenYzT0x3EAE",
            "text": "Excellent place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcl9fNlZnEAE",
            "text": "Mexican food easily shines at street level, and fine dining. It's tough navigating the mid level. Expectations are for familiarity and wow, especially superior produce. Everything here was ok, but not really elevated. Nothing to pique your interest or ask what this was, or how to make that. The dessert was the exception. The corn cake was delicious and mysterious. No idea how they got it so light. The service was solid, without any wow, and the place is clean and charming."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4emFYUUZnEAE",
            "text": "Fantastic dinner experience at Casa Carmen! The moment I walked in, I was impressed by the beautiful interior. Super aesthetic.\nWe shared a lot of different dishes with a group of friends and everything was top notch! I loved the variety and our waitress was so kind and helpful. She recommended some of her personal favorites and they delivered.\nHighly recommend if you wanna treat yourself to elevated Mexican Cuisine!\nWill definitely come back 🙌🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEb3VTNmd3RRAB",
            "text": "This place gave me similar vibes to Cosme. Maybe owned by the same people? Their guac and chips were similar to Cosme's as well.\n\nThe food was pretty good. We liked some dishes better than others. The service was good as well. I'd recommend a visit."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdDQ3THlRRRAB",
            "text": "The shrimps were hard and dry, and while the black sauce was tasty, it wasn't worth what they charge for a meager portion of badly cooked seafood that left me hungry. I went back and tried more food because I forgot to read my own review, and I'm still underwhelmed. The pork in the carnitas tacos was a bit dry and the huazontle were just not sure what they wanted to taste like, no specific flavor besides the tomato sauce and the btlitterness of the herbs.\n\nThis place is not inexpensive and the service is bad, I'm confused by the good press it gets.\n\nThe waiter was clearly used to customers reacting to the portions size, as he immediately asked if I wanted to order more food as he delivered that dish."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdG9mZXVBRRAB",
            "text": "This is my second time here and this place is DELICIOUS. The mole is imported from Mexico and has such complex flavors. The ceviche is unbelievably fresh, and some of the best I’ve had in Manhattan. The manager Luis was so wonderful and gave the best recommendations. The decor is sexy and a perfect place for a date. 12/10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURELXF1RlVnEAE",
            "text": "An excellent Mexican restaurant. One of the specials (off menu) was the delectable scallops with chorizo which was excellent. The chicken mole was also very good. Highly recommended for your Mexican fix! If you are in the Tribeca area do make a reservation to dine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoby02cWNnEAE",
            "text": "This place is beautiful. Good, flavorful margaritas. Blood orange one was tart and not too sweet. The guac and chips and carnitas tacos were fine, not terrible, not amazing, but good. The service was good, everyone was really nice, and the noise levels were good. It was quiet. Came with a friend for dinner and it was a really nice night. Easy to make a reservation online as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwczRLT0F3EAE",
            "text": "⭐️⭐️⭐️⭐️⭐️\nWildly good, unique Mexican food\n\n🇲🇽 Preimium, luxurious Mexican cuisine. Huge range of options on the menu.\n🎨 Really beauitfully designed restaurant - very chic, elegant\n👨‍👩‍👧‍👦 Highly recommend going with friends/family so you can order at least 5 starters!\n🌽 Try the corn cake dessert!\n🍌 Banana ice cream is incredible"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaTQ2VDZRRRAB",
            "text": "great octopus tacos and balanced mezcal cocktails. very good service and cool building. food is very good but a bit pricey considering other great options in the city. great spot for client dinners."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPanBtUFV3EAE",
            "text": "Great experience at this 7 week old restaurant. The service was very quick and attentive. Drinks were just ok (the marg tasted like it had a cucumber juice in it which was unexpected and a bit weird). Chips and guac fantastic. Enchiladas verde and mole dish were very good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKZy1Ua3FBRRAB",
            "text": "Actually so good! On Franklin, just off W Broadway. The crowd was quite the variety; Orans, Chanel, and Cartier Love's abound. Made a reservation a day in advance through Resy. Mexican flavors. Everyone loved what they had and would definitely come back. Vida Verde & Constantino (?) cocktails were superb."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMGZDWUxnEAE",
            "text": "Had a wonderful Valentine’s Day early dinner at Casa Carmen. Drinks were delicious - I had two mezcalritas (Ron recommended Mango, then I had Guava) and a Victoria and my wife had a few of the cocktails off their list. The food was delicious- Ribeye was delicious over the salsa verde and thick homemade corn ‘tortilla’/cake, the refried beans tasted like home, and my wife’s crab tostadas were eagerly enjoyed, once they removed the avocados (we warned that my wife was incredibly allergic). The churros came out in the shape of hearts- not sure if the preparation is different than most days for true holidays, but they were slightly overcooked and dry. However- we cannot wait for our next meal here. Thank you to the staff for starting our VDay night off with a great dining experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMXFmLU5nEAE",
            "text": "5 of us showed up on a Friday night without reservations and the friendly hostess was able to make space for us and we had an excellent meal. The service was great and the staff was able to address my food allergies with no hesitation. I was concerned about the price of the margarita but it really was one of the best I've had. All the food was great but the stand out was the Pastel de Elote. Also the space had a beautiful interior and great atmosphere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNld2VYQnR3RRAB",
            "text": "Tasty traditional Mexican food with excellent service.\n\nI went here with my boyfriend for my birthday and was impressed not only with the taste and presentation of the food, but also with the quality of the service. The servers were attentive without being overbearing, and gave great recommendations as to what to order.\n\nWe ordered the Mole, Chamorro, Fideo and Ceviche (not pictured). The portion sizes were good (especially for the Chamorro), and every dish tasted like something you might eat in Mexico. They gave us a free scoop of banana ice cream for my birthday, and all in all it was a wonderful night. Great place to go with friends or for a date you're trying to impress!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyallIT0NnEAE",
            "text": "As a Mexican, this place really takes you to Mexico and immerse you in its culinary riches. Is authentic and the flavors are better than right. From drinks are refreshing and exquisites to desserts that are the perfect closing. Personnel is…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyLTZMeEpnEAE",
            "text": "Hola! As a Mexican I can vouch the food at this place is delicious and authentic! Cool vibes and the place is beautiful. Don't leave without trying the panuchos, empanadas de platano, ceviche, tacos de carintas, huauzontles, pollo con mole, huarache and the corn cake for dessert!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyak5Hckl3EAE",
            "text": "The perfect Ceviche, guacamole, panuchos, all tacos and had also the pescado ala veracruzana and I vouch that all were so delicious. One must say also that the service was perfect and what is amazing is the decor and the ambience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodjR5akxnEAE",
            "text": "10/10 for food, 0/10 for drinks, 4/10 for service\n\nFood - we got the guac, lamb barbacoa tacos, chicken enchiladas, churros and flan. Everything was great, especially loved the tacos. Came with the spicy sauce that complimented the meat well\n\nDrinks - got a regular margarita and a blood orange. Very low quality, blood orange barely had any flavor. Given the price and quality of the food, this place needs to up its drink game\n\nService - staff was like your clingy ex. Always there, watching you, making you feel uncomfortable. Although everything was quick (almost too quick for the food?), they watch you like a hawk and as soon as you finish they clear everything. We could have used more water, yet they took the bottle once we paid. I could’ve ate more guac, yet they took it once they thought we finished. Service needs to be improved, ruined our experience"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdXR1NFJnEAE",
            "text": "Very average food. Nothing had seasoning or much flavour. We had to send back the adobo pork as it was awfully bitter. The staff took it off the bill and were apologetic but it seems this restaurant is having teething problems. Won’t return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURldWVsMRAB",
            "text": "was the food good? yes\nwas the design/decor fun? yes\nwas the crowd good? mixed\nwas the service excellent? mixed\nall in all solid spot with a staff that tries really hard but was having a bad night. perhaps they were just overwhelmed with a few large parties but simple things not having cutlery, plates cleared before we were ready, dishes not arriving etc. was unfortunate to experience. i will go back because the food and drinks were excellent"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyLTVMMmN3EAE",
            "text": "One of the best Mexican restaurants I’ve tried! The mole, ceviche and the tacos were amazing. The service and the place are incredible. The whole experience is super worth it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPM09iVXpRRRAB",
            "text": "Excellent Mexican food with a great service! The tongue tacos and Pollo con mole were really delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOFBLaUp3EAE",
            "text": "ceviche is very good! great cocktails and corn pancakes are delish"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNzhhS1pBEAE",
            "text": "Casa Carmen in TriBeCa is a gem! The staff's warm welcome and attentive service stood out. Their spot-on recommendations added to the fantastic dining experience. Looking forward to returning soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREM0k2YnpRRRAB",
            "text": "This place is amazing! I took my aunt's from out of town and they just had a great time! The food  is spectacular. The best chicken enchiladas I have had and I am from Texas so that says a lot. The fish dishes are amazing. I got to get a taste from my aunt's plates. The margaritas are the best I have had in years. My aunt's are margarita  connoisseurs and they loved the top shelf and the watermelon. I thought the watermelon was smooth and crisp with a hint of fun. We sat at the bar and the bartender Luis was just the best. He helped elevate the night with recommendations and brought a spirit of fun and enjoyment to the ambiance. He was very knowledgeable on the food, the drinks, and the regulars. He still took the time to take care of the new people who are learning the ropes at the place. The crowd was very respectful and  happy to be there and you could tell that the regulars are in a good mood. Sebastian was just lovely and found a way to make sure we got to enjoy the night with good seats. The family ambiance that created this restaurant is felt in the food and the details that combined make this restaurant a gem. I highly recommend it."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMnA2cVp3EAE",
            "text": "Une belle table mexicaine, avec des plats de qualité même si les prix sont un peu élevés."
        }
    ],
    "reviews_count": 70
}