{
    "name": "Bravo56 NYC",
    "place_id": "ChIJ7TSzzbHzwokR5we5sSX0n-Q",
    "grid": "MN12",
    "address": "261 Dyckman St, New York, NY 10034, USA",
    "rating": 4.5,
    "user_ratings_total": 111,
    "phone_number": null,
    "reviews": [
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaloxVkJXalpGVHpsUlVtSmhjVU42WDA5SE5HYxAB",
            "text": "Una experiencia de servicio y buen ambiente fenomenal, un trato cálido y de primera de todo su personal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xc1VGbDNWMWM0VDJKdlJqY3hSVGN0T0haTlIwRRAB",
            "text": "Great place\nNo food order"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVGVXRnhiVzU1ZDFnMlFUUnNYM3ByWVZOMFMyYxAB",
            "text": "Located this restaurant while exploring the nearby park. I was a new restaurant in the area and the staff outside seemed friendly so I gave it a try. The serving staff were a bit green and unprofessional but tried. The bar tender needed more training. The drinks while nice to look at were not balance at all. They were either too sweet or made with too much alcohol, and I tried 4. The food however was on point. Well made, perfectly flavored and stylishly presented. This spot has a great deal of potential but requires much work. The floor all so added to my disappointment as they diminished the appearance of the place."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTWQyNWZTUzE0T1hveVExcHpVWEJ2YzB0NU1tYxAB",
            "text": "Muy Buen lugar para pasar un Bello rato"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNVdWZE1RVEozYnpaV2RsOU9WSGxUTFRsTmVGRRAB",
            "text": "BUENA MÚSICA, MUY BUENA COMIDA , MUY BUEN SERVICIO DE SUS EMPLEADOS. ANOCHE FUE MI CUMPLE PASE UN MOMENTO MUY BONITO AHÍ EN BRAVO 56.  GRACIAS A TODOS POR SU BUEN TRABAJO.  Y POR SUS ATENCIONES .  NOS VEMOS PRONTO.  ME ENCANTO !   FELIZ DÍA A TODOS."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UGNYQk5hMFZWVkdJeGRuVlhPRTlQU2w5RVNsRRAB",
            "text": "First time last night with my wife and loved it. Food, drinks, atmosphers, and service all great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205S1NFTnBOekZKYjBWd1oyMWplbmhTVTJOTWJVRRAB",
            "text": "Went out the other night to Bravo56, good music and crowd.  Smoked hookah, had some good drinks, and had a great time!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVVkySXpabWxLTUhkbU1GVkVSbVJCVldsMFpYYxAB",
            "text": "Exactamente lo que deseaba, cumplieron todas mies expectativas"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwS2JUTjJMVEZWYWxCVVNEWllhRVZCVVVRek1HYxAB",
            "text": "El peor lugar que yo eh ido en mi vida primero le dan la bebida ami marido en vaso plastico y al resto le dieron en vaso de cristal despues le dieron un salmon ami marido con salsa blanca y el fue muy claro de desirle en salsa Roja y por ultimo le dan una cuenta que no era de el y para comer esperaron que comieramos con los dedos porque tuvimos que Pedir los cubiertos terrible servicio jamas en mi vida volvemos a ese lugar… y para que nos atendieran tuvimos que esperar 40 minutos 🤮🤮🤮🤮🤮🤮🤮🤮"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsM1dESkRSRnBmTXpOa1ppMTBkV1pDU0RoNGJuYxAB",
            "text": "Good place to hang out but food (at least what I ordered) far from acceptable"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMlJGQkJTSHBQVDBaTWEwRkdlWEI1WkhwNE1YYxAB",
            "text": "Me encanta el bravo56 es mi segunda casa"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOTg3S09nEAE",
            "text": "The night we stumbled upon this gem for the first time felt like stepping into another world. As we were walking by, Kelvin—our soon-to-be server—literally came outside to greet us and talk about the specials. That gesture alone set the tone for what would be an unforgettable evening.\n\nFrom the start, the energy was infectious. The finger food was delicious and full of flavor, and the drinks? Let’s just say they don’t skimp on the pour—word to the wise: make sure you can hold your liquor!\n\nWhat truly made the night special were Kelvin and Damian. Their vibe, attention, and hospitality made us feel like regulars, even though it was our first time there. The music was a vibrant mix of Spanish hits—perfect for anyone who loves a lively atmosphere with a little bit of everything on the playlist.\n\nIt’s not a fancy place, but it’s a fun place—and sometimes that’s exactly what you need. The kind of spot where the food, the drinks, the music, and the people all come together just right.\n\nWe’ll definitely be coming back. If you're looking for a good time with great people, strong drinks, flavorful food, and music that'll have you moving, this is it.\n\nHighly recommend!\n\nEspañol -\nLa noche en que nos topamos con esta joya por primera vez se sintió como entrar en otro mundo. Mientras caminábamos, Kelvin, quien sería nuestro mesero, salió literalmente a saludarnos y a contarnos sobre los especiales. Solo ese gesto marcó el inicio de una buena velada.\n\nDesde el principio, la energía era contagiosa. Los aperitivos estaban deliciosos y llenos de sabor, y las bebidas… digamos que no escatiman en el alcohol, consejo: asegúrate de poder aguantar el licor.\n\nLo que realmente hizo especial la noche fueron Kelvin y Damian. Su buena vibra, atención y hospitalidad nos hicieron sentir como clientes de siempre, aunque era nuestra primera vez allí. La música era una mezcla vibrante de éxitos en español, perfecta para quienes disfrutan de un ambiente animado con un poco de todo en la lista de reproducción.\n\nNo es un lugar elegante, pero sí es un lugar para pasarla bien y a veces eso es justo lo que uno necesita. Un sitio donde la comida, las bebidas, la música y la gente se combinan de forma perfecta.\n\nSin duda, vamos a volver. Si buscas un buen rato con buena gente, tragos fuertes, comida con sabor y música que te hace moverte, este es el lugar.\n\n¡Muy recomendado!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvM0xXZ3lRRRAB",
            "text": "Un lugar diferente los dueños de Dyckman en New York"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaFpqSm13RRAB",
            "text": "Exelente"
        },
        {
            "date": "1년 전",
            "language": "id",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuZ2Zud2RREAE",
            "text": "Sponsor Crown King Zainudin Untok Purong"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OTVmT0p3EAE",
            "text": "Great place for happy hour\nGreat prices"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MVl5SXNnRRAB",
            "text": "The only problem is that young man who is in charge of looking for tables you have to be more polite I don't like to touch my drink without talking to me,"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiLS1tMThnRRAB",
            "text": "Arrived 4:20 PM on a Friday and at 5:45 PM I am still waiting for food to be delivered! One order arrived late cold and sat in the table uneaten!  Drinks are not good service is really poor.  Would not return or recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiLS1ITXF3RRAB",
            "text": "Really good atmosphere. Though, if you’re looking to impress someone, this isn’t the place. Very poor service and the food was very much no good."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaWRDd2lnRRAB",
            "text": "Excelente lounge me la pasé increíble, buen ambiente, tranquilo y sobretodo excelente servicio al cliente si vas aquí pregunta por Jelipssa es la mejor mesera, súper agradable y muy atenta."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiX3VLS1ZREAE",
            "text": "Excelente lugar"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyN01IYzFRRRAB",
            "text": "Excelente servicio al cliente! Kelvin es un mesero exceptional!! Buena comida y ambiente!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdmY3aDFRRRAB",
            "text": "Muy bueno todoooo las atenciones , la comida , los tragos y el ambiente 100% recomendable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMb1ppVVhREAE",
            "text": "It’s very disappointing that an environment that sells alcohol are not able to keep it professional. Yes I was under the influence but the staff should be well train to deal with a personal that is under the influence. At times it can be frustrating to deal with people who are drunk but the personal to get that the same level is very ridiculous. Please train your staff remembers to handle situations a bit better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURULTRDMzFRRRAB",
            "text": "Guetto nothing fancy"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUOHZUMmZnEAE",
            "text": "Excelente, pero como la mayoría de lugares en NY la hookah daña el ambiente"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMUpLUml3RRAB",
            "text": "🕺"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcmRmZFJnEAE",
            "text": "As a new mom it’s hard to go out for happy hours but our server/bartender was the best person I’ve met. I work in hospitality and the way he offered to hold my daughter so my husband and I could eat was the kindest gesture. The food was awesome and the drinks too!the service was outta this world.  Definitely coming back again soon. Thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5amRiS2tRRRAB",
            "text": "I felt very good in there  !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkak9uYk9nEAE",
            "text": "GOOD 👍 👍 👍"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxa19QbUtREAE",
            "text": "El ambiente es bueno, pero hay demasiadas personas y el lugar es muy restringido, es difícil caminar moverse o bailar, deberían de habilitar un lugar para bailar o limitar las cantidades de mesa."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWamFfYk13EAE",
            "text": "The food is so delicious, excellent service, waitress are friendly and attentive, and environment is amazing. I would recommend this place to anyone, you won’t regret it !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcnVYcjF3RRAB",
            "text": "excellent service good attention"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcnJuSkhnEAE",
            "text": "Very good ser e e and very good attention"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcnNIWGNREAE",
            "text": "a beautiful business full of joy and positivity"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcnViREV3EAE",
            "text": "Very good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWenZTMTVRRRAB",
            "text": "One of the best spot in the highs Dyckman st. Live dj algenis one of the most popular dude I ever meet 😎 lapolvora gave me a great attention dude is amazing with the lights games flash beating with the Music 🔥"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1N2JyXzVBRRAB",
            "text": "We've been to Bravo before and had fun, but our recent visit for a friend's birthday left us disappointed. Despite a reservation for 8, we were squeezed into a small area and told we needed to order five bottles to stay there. We moved to a different section with a 2 am deadline due to a performance. After ordering three bottles and some hookah, we were unexpectedly asked to move again, this time with specific bottle brand requirement for the area. It felt uncomfortable, and we noticed preferential treatment for a specific type of customer (DRUG DEALERS AND SCAMMERS). They should either keep their bottle special promotion as advertised or stop promoting it if they won't honor it. Bravos staff seemed more focused on profit than providing a welcoming experience to its customers. We obviously left and took our party to a different establishment in the area, and ended up ordering 7 bottles that night. Unsure we will return to Bravo definitely not recommending it to friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZ1lhb3Z3RRAB",
            "text": "Truly wish I could give zero stars. Went to support this new spot and the happy hour was cute. The drinks were not consistent but for $5 I can’t complain.\n\nWent Saturday night and immediately had to check our coats in… but why were people inside wearing theirs? As soon as we enter, a waiter asks if we want a table, to which we reply that we wanna sit at the bar. He says there’s no room so we have to sit at a table, which he prepares for us. Then a bottle girl tells us we have to buy a bottle to sit at a table. Lol what? We just trying to have a beer and vibe to some music.\n\nSo… as we originally wanted, we go to the bar. The bartender gives us our beers and when my friend went to close her tab, he was wild rude for no reason. The pen she was using to sign the check must have been the only pen in the entire place, cus the way he was shaking his head and rolling his eyes waiting for her to finish was crazy. She tipped him anyway so I hope he survived whatever he’s going through and I’m praying for him!\n\nWe left 10 mins after arriving cus there are 10000 other spots to choose from. Might stop by and give them a bag of pens just cus they’re down bad. 0/5 stars"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwam9ybDdBRRAB",
            "text": "La atención que recibes en este negocio es de maravillas. Cuando fui la semana pasada con mis hermanas, nuestra mesera se aseguró de que estuviéramos cómodas y nos atendió excelente. La comida es súper rica y los tragos también. Les recomiendo este negocio al 100."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWenRUd2t3RRAB",
            "text": "BEST SERVICE EVER! 🎉😍 I love it there. Thanks Damian for the service soon as get there and the bartender Alberto he’s the best . Margarita mi favorita de toda la cuidad 😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcnVxRThnRRAB",
            "text": "I loved their customer service and atmosphere. I will definitely return😍😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWem9tTUhnEAE",
            "text": "the best atmosphere in Dyckman to share with friends, eat, celebrate your holidays and have fun"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWenRDai1RRRAB",
            "text": "Me encanta el lugar siempre hay buen ambiente y la comida es buen buena"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsazlpX1RnEAE",
            "text": "L@s camareros@ son buenos pero su política y manejo de sillas y mesas es pésimo"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaeWVpVU1REAE",
            "text": "Really did not enjoy the people here 🙄\n\nBad vibes all around\n\nOpen Class Action review earned!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWenBlSU5BEAE",
            "text": "Buen servicio siempre limpio y excelente comida"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1Nk92STRnRRAB",
            "text": "Me encanto gracias Juan Carlos excelente servicio y calidad"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWenI2NVJREAE",
            "text": "Muy lindo el lugar exelente servicio"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGZzVERUhnEAE",
            "text": "Best time NYC"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbHRQaFR3EAE",
            "text": "Good vibes only!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWenRlWTlnRRAB",
            "text": "Lo mejor en servicio y calidad 🔥🔥"
        }
    ],
    "reviews_count": 52
}