{
    "name": "La Barca Restaurant",
    "place_id": "ChIJectupoT2wokRYCeTGuF6xlQ",
    "grid": "MN12",
    "address": "3892 Broadway, New York, NY 10032, USA",
    "rating": 4.1,
    "user_ratings_total": 634,
    "phone_number": "(212) 928-1090",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNE9FZGFiMVV0VGtwd09IcDBOa0pTVW0xSlMxRRAB",
            "text": "Tiny place always busy, family atmosphere"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NFkxQnBZVXRqU2t4V1kxZHNaR3BtVmpCbGRtYxAB",
            "text": "This is suppose to be a yaroa de platano maduro do not order from them…the plastic fork broke and it’s too tough to eat..the cheese the meat everything is burnt i called The Spanish lady said “well what do you want me to tell you” so if your customers get sick for the nasty food that you are providing you don’t know what to tell us? Dont order fried eggs from them either i order Plenty of times and they always had egg shells."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TVRtWjNSRzFrTVZCNldFSjFaRGhvTlROd2NtYxAB",
            "text": "This restaurant has become my absolute favorite in town. The meals satisfy hunger, incorporate fresh elements, and please the eye. The attention to detail was evident from entry through departure. Customer care here surpasses normal standards. The food impressed me tremendously."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORlRrRndMVmxCVlZoT09VaGFkbGhDVG5sSmJsRRAB",
            "text": "I found a roach in my beans and hair in my rice. I will never order from here again! I wouldn’t recommend this restaurant"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VNang2LWJ6Z2VyS2F3EAE",
            "text": "La comida no está fresca. Son las 11:30pm y parte que hay pocas opciones está todo seco y viejo. Un asco"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveE1hMFZnEAE",
            "text": "El chicharrón del mofongo parece que fue una fotocopia que hicieron de un chicharrón real. Horrible. No suelo dejar review pero esto es un robo"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJM2NHaWxBRRAB",
            "text": "Amazing monfongos"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRLWJqby1nRRAB",
            "text": "Nothing serious"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXN1Q0ZREAE",
            "text": "Learn how to salt your chicken way under seasoned"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNXFtWTR3RRAB",
            "text": "Delicious breakfast! Their bread and coffee are great. I always get the Dominican sandwich or the tres golpes. Delivery is always fast!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMEphSWt3RRAB",
            "text": "Great Dominican restaurant"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmM2NYb3ZBRRAB",
            "text": "El peor mangu con salami que eh comida. No lo recomiendo para nada!"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdmRpVllBEAE",
            "text": "Muy buena su comida pero siento que su porción es muy poca."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQallhd1h3EAE",
            "text": "24/7 straight heaven. Always great food and will make to cook orders"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQZ2FYaW5nRRAB",
            "text": "the passionfruit juice here was so good it compelled me to leave the first review i’ve ever left"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNXIyMDZnRRAB",
            "text": "I paid 30 Dollars for food and the food was not good and had no taste maybe they change the cook very disappointed"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMG9MWGlRRRAB",
            "text": "Puedo decir con toda certeza que las trabajadoras del frente no tienen ni la mas minima idea de lo que es un cervicio al cliente, los dueños deberían pagarle un entrenamiento oh contratar personal capacitado. Con el dolor de mi alma por que su sason esta bueno y a pesar de que el lugar no es acogedor se siente una buena vibra entre los clientes, pero no regreso mas."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzM1plMHRRRRAB",
            "text": "Las mujeres muy amables y bonitas"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MnREYWZ3EAE",
            "text": "El mejor restaurante dominicano 🤪🥰"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3N3BQaHlRRRAB",
            "text": "Un lugar muy sucio y la comida guardada y salada no recomiendo para nada"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3N29QWEh3EAE",
            "text": "La comida muy salada no me gusta la verdad"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidjdIZG1RRRAB",
            "text": "Español: NO hagas pedidos desde aquí. Esta noche pedí un combo familiar y dos jugos de maracuyá. Encontré una cucaracha bebé muerta en mi bebida y nadie hablaba inglés cuando intenté explicarle esto por teléfono. Cuando finalmente conseguí un trabajador que pudiera entenderme, todo lo que me ofrecieron fue ir a recoger otro jugo, en lugar de un reembolso. Absolutamente asqueroso, no comas aquí, estás arriesgando tu salud y seguridad y la de tu familia, ya que claramente no son un establecimiento limpio y libre de insectos.\n\nEnglish: Do NOT order from here. Tonight I ordered a family combo and two passion fruit juices. I found a dead baby roach in my drink, and nobody spoke English when I tried to explain this over the phone. When I finally did get a worker that could understand me all I was offered was to come pick up another juice, instead of a refund. Absolutely disgusting do not eat here, you are risking yourself and your family’s health and safety as they clearly are not a clean establishment free of bugs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNXFUVDRnRRAB",
            "text": "I have been eating here my whole life and the food is amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyODdUSGtBRRAB",
            "text": "The food is great but honestly the customer service is ridiculous. These ladies will sit there and finish a whole conversation with each other before deciding to take your order"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMVktb2NnEAE",
            "text": "La comida es buena y el precio no es malo pero es la peor atención al cliente que eh podido ver en un negocio 👎🏼…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN3AtMElREAE",
            "text": "Staff is extremely rude and standoffish. Didn’t bother eating there after the way I was treated when simply trying to place an order. Food is probably as nasty as their attitudes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNF9haG53RRAB",
            "text": "The worst sancocho and the worst service charge 10 dollars for something sour and useless just because they sell unfairly!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMWN2VWRREAE",
            "text": "Sabrosa comida Dominicana."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NjhxbnNBRRAB",
            "text": "Dropped by to grab a bite. Cozy warm and good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5cmYtaGdnRRAB",
            "text": "Food is pleasant but the service here is horrible, please be advise that the women’s in this restaurant might forget items from your order if you are making an order for delivery. Extremely unprofessional and disrespectful when wanted to approach about the missing item. Which sucks because me and my family have been loyal clients for years. (This was always a reoccurring issue)."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5OFBlcXVnRRAB",
            "text": "They never have Mojito sauce, nunca tienen salsa de ajo y siempre dicen k se acabó"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkM0lEa3FRRRAB",
            "text": "Place is cool for take out to dine in not so much but the food is ok Spanish food there 3 golpe is good one of the best within walking area of this place and the sandwiches and lunches are also good there oatmeal is good they run out early almost everyday"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkcEp2OXV3RRAB",
            "text": "The rice was old and dry and they didn’t want to change it. The girl was rude and with attitude. Never going back to this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxLWJTNmhRRRAB",
            "text": "Ive come in as an Uber driver & a customer. Crazy how I've come in here at least 3 or 4 times and they've always been nasty for no reason.  As a driver I thought they were gunna push me out when I walked in because it was \"what do you want.\" Keep in mind the only customers there were leaving. Again came in and she was just like \"there's no food what do you want me to do.\" & Moved on to the next customer. Not even tried for a refund or to understand what was happening. Just close your doors, or are you gunna serve the person who came after me?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNU5xMjZRRRAB",
            "text": "Very nice food , great taste…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMDhpbERBEAE",
            "text": "If you looking for Dominican food especially after a night out this is the place to go. The mangu is bomb. The regular food is also delicious."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdFlYQVZ3EAE",
            "text": "Food is great i always get a ponche from here it's one of the few Dominican restaurant that does a good ponche."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGdjhIeWlnRRAB",
            "text": "Muy buena la.comida"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeTZMVHB3RRAB",
            "text": "Amazing dominican food quality and quantity 👌 😌"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNktpbnlnRRAB",
            "text": "a little too small"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMi1MeUxREAE",
            "text": "Dirtiest place and employees always with a attitude and just to get a order you'll spend 1 hour doing so"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtOU0tZFJ3EAE",
            "text": "I ordered and it took them almost an hour to deliver 1 cup of rice and tostones. Unacceptable! The food was ok, I mean you cannot messed up with tostones and rice 🍚\nIs better if go in person than ordering for delivery.\nTheir chicken chunks is pretty good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydC1YSkpnEAE",
            "text": "NEVER AGAIN!! First off I'm Dominican, so i know spanish food. I ordered Carne Frita con Tostones and got over-cooked burnt old meat. The lady was nice over the phone, but they hold on to expired food. Greed over the health of your customers is not good. Please throw away your expired meat, and fire the cook who over cooks food. After eating two pieces it went in the garbage, tried 1 with lime & 1 regular, and still tasted like stale rocks both tries... Good luck eating here"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvajRtUzV3RRAB",
            "text": "My sister and I were looking for a Dominican breakfast while visiting NY Presbyterian hospital. Saw La Barca was nearby with good ratings and figured we'd try it out. Ordered mangu con los tres golpes and we were not disappointed. Mangu was…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjbk9TdmlRRRAB",
            "text": "Hoy (15 sept 2021):\nEntiendo la crisis y los altos precios pero nunca debemos bajar la calidad. Las 2 últimas sopas que he pedido cocido de pata y hoy el sancocho dominicano a pesar de costar más. $14 por un sancocho porque son $12 + 2$ tips me parece que no es nada barato para recibir una sopa de auyama con unos pedacitos de carne de cochino con grasa y un pellejo de gallina con huesos. De verdad que deben revisar su calidad.\n\nAntes:\nLa comida tiene buen sabor y las porciones son bastante generosas. El servicio de delivery es a tiempo. Me gustó mucho el sancocho dominicano."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNc19tdW9nRRAB",
            "text": "Great place for a delicious, filling, drunken meal at 3 in the morning. Seems like a very strong and healthy sense of community in this restaurant, very friendly and helpful staff!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1eHJHREp3EAE",
            "text": "Operates a fake kitchen called Breakfast Beauties, quite ironic however.  My sandwich 100% did not match the description, just sliced raw onions and raw peppers when the description says sautéed, and it contained no ham or avocado.  Straight bait and switch."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRMGZEZmpRRRAB",
            "text": "It was good the first time but afterwards the meat was hard and weird. Hit or miss"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcTZYdmF3EAE",
            "text": "Always have delicious food.  Service is fast.  People are nice.\n\nSteak Sandwich is the best around.\n\nI miss their food since we moved to NJ.  Only when we drive in to visit my husband's family would we grab some to go food.  Never disappointed.  Inexpensive and good food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSMUlYLWN3EAE",
            "text": "The ladies were truly lovely even with it being so late at night. Super attentive and the food was great. I now understand why so many people were coming in to order and picking up in the 45-1 Hr we were there eating our late dinner. 😅"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMTZPWl9RRRAB",
            "text": "This style of restaurant isn't long for the world in the neighborhood.  Enjoy it while it lasts.  The food of which most of it is created batch is always readily available.  The ambiance itself can be a little chaotic.  It's especially helpful to know Spanish though they will try to understand you if they don't.  The wait can be a little annoying as the line is very free form.  Avoid this place from 6 to 7:30 especially when ordering. They will be overwhelmed and you may not get the customer service you might at other times.  The food is usually pretty good. I recommend the Lasagna, rice and beans and varieties of chicken.  The coffee is strong, good and made just for you. Also avoid big game nights, some people hang out there to watch 'the big game' on occasion."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdllMOWFnEAE",
            "text": "I ordered a whole rotisserie chicken with rice and beans and a side salad. The order came with a 2L soda. The rice and beans were delicious but the rotisserie chicken seemed like it was a day or two old. Super, duper dry and bland in taste. I regret spending over $30 on this food order. And who the hell wants a 2L of Pepsi soda? They’re keeping the Coke soda to themselves!😂"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKN3R2WGpBRRAB",
            "text": "I ordered chicken, rice and beans from La Barca on Saturday. The chicken that arrived was so old. It looked and tasted like it had been sitting under a heat lamp for a while. The chicken was hard as a rock and most of it was completly inedible. the bits that I did manage to eat made me sick. I have had a stomach ache for days. I was sad to write this as I have had previously good experiences with the restaurant."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMG8teVVnEAE",
            "text": "Great Lil Restaurant in that area. The food was very delicious, great flavor and very well cooked. The meat was nice and soft ,  good quality. Worth the price.\n\nTried out their goat meat with rice and beans along with ribs which were all great.\n\nThe place is very tight inside, Incase you are planning on going to eat in with a very large group. It's a good place for a quick take out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyenBQbElnEAE",
            "text": "La Barca has delicious food.\nIt's located not too far from NY Presbyterian Hospital so it's perfect to grab lunch for yourself or someone you might be visiting in the hospital.\n\nThe place is small but clean. They have alot of dividers up due to COVID. The lady who was attending me was perfect. She took my order exactly, verified what i wanted, asked a few questions and packed up my order with no issues.\n\nThe food was so good. I got a soup, pata de vaca. Delicious. I also got a half chicken, white rice, beans and salad. The chicken was not dry at all. The rice was nice and fluffy. The beans were tasty. The salad was good and it was seasoned for me.\n\nOverall this place is really good. I was attended well, the food was delicious and the price was right. I can't wait to visit this place again. I highly recommend it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4bWVPME1REAE",
            "text": "Very cheap but delicious Dominican Food. Delivery is available. You can pay with cards only in person, if you like to pay with a card must use one the delivery apps. I usually order through Delivery.com. Any phone orders are available cash only. No sorry their English is not very good looking"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHeU9TQ3BnRRAB",
            "text": "Place has been going downhill for years. Same people work here for the longest and don't know any English. They don't have to be fluent but at least learn your menu in English! They all have attitude and WILL have you standing there looking…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtczVySUF3EAE",
            "text": "I’ve ordered mofongo twice and both times it was very tasty. This time I ordered it with shrimp. I usually have trouble finding flavorful food in my area but this was good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MmJDc1NnEAE",
            "text": "Normal local Dominican restaurant. Small space, a typical no frills place to get food from DR. Good variety of different dishes at reasonable prices for the time. PLENTY OF FOOD per order. Even lunch specials are plenty. Outside eating area built because of covid."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXeGFpOEpREAE",
            "text": "Honestly the best 3 Golpes I've ever had in a restaurant the mangú was so soft, the onions made just how I like it. Real good, delicious! They mostly speak Spanish, and are real Dominicans so if you're sensitive don't go here cuz you might take it personal when that's just how they are. My only regret was not ordering another for home. No pics sorry, I was starving but they give you 2 eggs, 2 salchichón, and 2 cheese on a separate foil bowl and the mangú and onions on another. Not a fan of how the egg was which is why the 4 star but if you get there early I'm pretty sure the eggs are more fresh, maybe ask to see if they can make them fresh. The cheese was warm and soft, usually it's cold and hard at other places. Cannot recommend enough. 🤠👍🏾"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaGZPVlRBEAE",
            "text": "La Barca restaurant ha cambiado mucho. Años atrás yo siempre ordenaba Sandwich Cubanos y eran riquísimos. Ya no sirven:pan duro y quemado, la carne sin sabor y unos pedazos GRANDISIMOS, un queso raro de freír, no pepinillos y cosa nunca vista hasta repollo en el Sandwich y bastante mayonesa. Parece que era la primera vez que esa persona hacia los cubanos.  Al final los abrimos votamos la carne y el pan.\nDeberían de tener más cuidado con la calidad de sus alimentos ya que bastante caritos que son."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcjhfcGdBRRAB",
            "text": "I ordered 2 lunches they sent me the rice with the beans in the same terrible plate and the 2 lunches they sent me the meat that I did not order.  I called to make the observation, the lady on the phone answered me very badly.  the delivery then brought me the baked chicken and I had to pay again.  Mrs. WENDY is very disrespectful, she treats me very badly on the phone."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMC1icGZ3EAE",
            "text": "One of my favorite go-to's. The food is excellent, the coffee is wonderful. I always eat good and take a plate to go. Very welcoming, whether early morning or late night. Nothing too fancy but enough space to sit at a table or at the counter. Great all around."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcmVUX3B3RRAB",
            "text": "Very bad food. Unsvored and quite expensive. Spend about 14 dollars on an order of platanos maduros with albondigas; the albondigas felt old and the platanos were unfinished. In addition to the poor customer service."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRMHFfWDFnRRAB",
            "text": "My daughter & I were walking around the neighborhood and decided to look for a place to eat. This restaurant had one of the best reviews, so we decided to check it out. The Restaurant and the patrons looked very welcoming and friendly amongst one another and we were welcomed in as well. The food looked freshly prepared and everything looked Delicious! We ordered and sat down at a vacant table because the stools by the food were packed. When our food arrived, we were very surprised at the portion size. It is Huge!! We both knew that attempting to eat it all would be a mission...not impossible, but a hungry persons delight. We were happily amazed at the flavor of the Bistec y Arroz Blanco with black beans, & the Pechuga De La Plancha y Tostones. I have read the other bad reviews and we didn’t encounter anyone who didn’t understand English when it came to ordering, nor food that was cooked wrong or hard. We loved it & would definitely stop by again if we were in the neighborhood."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MnRLbV93RRAB",
            "text": "Horrible customer service. Ordered Uber Eats and they didn’t send all my food. The bags were stapled closed and they tried to blame the Uber driver. Disgusting. Then the lady who picked up even had an attitude cause I don’t speak Spanish. The nerve. To top everything off, the food makes you feel sick 🤢🤮 & heavy.\nDONT EAT HERE!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCei1iTUlnEAE",
            "text": "I went to La Barca in October of 2021. The shrimp mofongo with red sauce was one of the most memorable dishes I've had in my life. That is saying a lot as a Peruvian foodie that grew up with so many delicious dishes. I haven't had anything else here, but I've been dreaming of this mofongo since I left. Thank you La Barca!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRN29uWXFRRRAB",
            "text": "When my Spanish-speaking NYP coworkers get food from this place it smells, looks & tastes good. But if you don't speak Spanish they claim to not have what you order or serve you something substandard I guess believing that since you don't…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPcTVqdTNnRRAB",
            "text": "Went for a sail on my friends birthday & decided to sit inside because it was a windy day. Ambiance 10/10. Shared chips and guacamole/salsa, two pitchers and everyone got tacos, spent ~$75."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNDRqS25BRRAB",
            "text": "This spot is great for all occasions. Breakfast, lunch, dinner, late night grub. I strongly appreciate them for being opened 24hrs. I love the Dominican vibe and they serve food with love. My go to order is Mangu with the Tres Golpes. They…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjbDVIbHR3RRAB",
            "text": "They passion fruit is so good condensed milk and vanilla. They rice and chicken is so delicious.. and I remembered this place when I was craving and I kept looking up on google and then boom here the page was. And thank you for being a 24 hour store cuz I’m ordering from y’all everyday lol"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTNVlUMEl3EAE",
            "text": "Classic Neighborhood location for Spanish Food ... Cuban Sandwiches are my favorite! Beans are great as well and can't go wrong with their rice and beans along with many varieties of meat. Small location but what it lacks in size they make up in the food quality and quantity."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNValkyZzlnRRAB",
            "text": "It is a very small place to eat in, 3 two sitter table set up and counter seats. Food was average.  Did not like the bacala guisada, it was drenched in a water base sauce. I did like the arroz moro, a little bit more seasoning w"
        }
    ],
    "reviews_count": 73
}