{
    "name": "Fito",
    "place_id": "ChIJ0VsaLnv1wokRuAZjmx8HIMU",
    "grid": "MN12",
    "address": "4736 Broadway, New York, NY 10040, USA",
    "rating": 4.8,
    "user_ratings_total": 143,
    "phone_number": "(646) 789-1844",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psM1RFOVdhVzg1WW5sblgxQjFOVmswY3pRNFEwRRAB",
            "text": "This is my favorite place in the entire neighborhood! The service is wonderful, it’s small and intimate, feels like a real gem. It’s got a relaxed non-pretentious atmosphere. I come here on a whim OFTEN. Their signature drink Canelazo is the BEST cocktail i think i’ve ever tasted from anywhere, I crave it frequently, there’s just nothing like it. It’s unique and sexy, ugh, this place is a HIT HIT HIT."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSblUzb3lXRFF6VlV4b1ZVbDFWMXAxVm5KTVkyYxAB",
            "text": "A gem of a place. Great service and atmosphere. Great tasting food and cocktails."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRGExVnBkR3hHUTJwVU0weENOVFE0VkZCdlIzYxAB",
            "text": "The first time I was in the Heights, my friend took me here and it was like the best place to eat around the area. The service is amazing, the atmosphere is great, a little small, but cozy. The food is also amazing 🙌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMlpUbHZXbEZDWTFabVl6TTBTRzF5UXkxbVZXYxAB",
            "text": "Relaxed and cozy atmosphere with a great vibe. Josue the bartender and Xy the server made us feel right at home. Solid happy hour and a great selection of food. Definitely stands out from the typical spots around Dyckman."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sb2FsZFFRbGhNTUdSbFdEaEtNMlZDZUU1UldHYxAB",
            "text": "Love the vibes, staff is very friendly and food & drinks are great! Nice to have a local Ecuadorian spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213emFXSkhZM042TVc1c1ZHVmZVV2hsVmxBMFYyYxAB",
            "text": "I made 5pm reservations. I arrived early (4:40pm to be exact) and as I sat waiting for my party. My menu was taken for me at 5:13pm without an explanation. I can understand that you maybe “short” on menus. It was only 30 minutes or so into my arrival and there were (counted) 10 tables empty. This was either their way of saying you are not welcomed or simply an act of unprofessionalism. In any event It set for an unpleasant first time experience. When I brought it to the attention of a very nice waiter who quickly apologized and agreed that it was a lack of etiquette on their behalf.\nMy party arrived and I had agreed on giving this place a chance. Things went well, drink were good and the flat bread pizza was pretty good as well. The waiter who pulled my menu was then very accommodating (not sure if the other waiter had words with him) and the evening ended well.\nI will for sure return but heres a little point incase the folks at Fito read this… never pull someone's  menu without an explanation as to why. My party could have been in the rest room, out putting more money in the meter for parking… etc… when you pull a menu as such, it can be interpreted as “get up, your done… you’re not welcomed”.\n\nSide note: we ended up staying 6hours and tipped far more than those who never had their menus pulled."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJU1lpZk80X2QzcGV3EAE",
            "text": "Went on a Saturday night and they had a guitarist which created such a great vibe. The drinks were amazing as well as the food. Had the ceviche and steak nachos which was perfect for two people. The staff and bartender were attentive and friendly. Will definitely come back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLMzFtdnFNa2JpOGN3EAE",
            "text": "The food was good but the rest of the experience was so bad it really made it hard to enjoy.\n\nWe were seated pretty fast, the restaurant was about half empty. It took about 25mins until the waiter came to take our order, I ordered a drink and a few appetizers.\n\nThe restaurant is really cramped, I would recommend sitting outside because those are the only human sized tables. The inner tables have around 2\" of space for your legs and stools on the other side.\n\nMy cocktail was pretty watered down, although I enjoyed it.\n\nThat all was whatever, the wait time for our food was about 70-80 minutes to get our appetizers. The appetizer we ordered was a salad.\n\nIt seems like this was a common experience for everyone. People who came in before us only seemed to just be getting their food.\n\nIt took another 20-30m for our mains to come out.\n\nThe wait time wouldn't be horrible but the seating was so uncomfortable it was actually physically painful.\n\nThe salad was delicious, the goat cheese and tangerine made it a great dish.\n\nThe \"pizzette\" was alright. Lukewarm (it was sitting a while?), although I was so hungry after 70mins of waiting I wolfed it down.\n\nMy steak was (pictured below) way overdone. I ordered medium rare but got a completely black steak. It was alright-- it wasn't super tough but the Chimichurri sauce was super watery and gave the steak a soggy one-dimensional taste.\n\nOverall, I would recommend this place as a bar to grab a drink with a friend. I absolutely would not recommend this place if you're hungry or want to eat a full meal."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLZTZtOHVha2RiTUhBEAE",
            "text": "Fito is an absolute gem—my neighborhood favorite! The atmosphere is cozy and stylish in a low-key way, perfect for a relaxed dinner or a casual date night. The cocktails are inventive and delicious, and the food is consistently excellent. You can really tell they care about the details, not just in the service and presentation, but in the quality of the ingredients and the creativity of the menu. I also love that the menu is small but diverse, and they’re always flexible and accommodating.\n\nBut what truly sets Fito apart is the staff—everyone is warm, welcoming, and genuinely attentive. It’s the kind of place where you feel taken care of every time. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOTDU3SmpUdS1pa3VnRRAB",
            "text": "We went here on Mothers Day. The food was delicious. We made a reservation @530 for Mothers Day and sat immediately.\nBUT….\n1. It took 2.5 hours to get our entrees, 1.25 hours to get our apps. The table next to us had the same problem. A couple who entered after us came, ate apps and entrees, and left before us.\n2. Server blames this delay on three different things three different times:\n“Kitchen lost your ticket” (no they did not)\n“We only have two people in the kitchen and they’re doing the best they can…it’s Mothers Day love”(the you should limit your menu so they can keep up, or have more people in the kitchen; don’t make this my fault you didn’t plan on a holiday - I still shouldn’t be waiting over 2 hours for food in any circumstance; and DONT THROW YOUR CREW UNDER THE BUS)\n“We are bringing your nachos then the rest of\nThe entrees in ten minutes” (which is then 20; they did offer free drinks at this point but we weren’t drinkers like that. We also consistently asked for a manager and did not get one until the third ask)\n3. Nothing was comped until we threatened to leave at around the 2 hours fifteen min mark. Then the two entrees, and only the entrees were comped, and there was no offer of anything free or a check in before then.\n\nRisotto, salmon, and empanadas were all great. Nachos were $20 but had no meat on them despite saying they did, plus it was sour cream sauce and some light cheese, so they were tasty but an overcharge @$20. Rather have spent it on something else. $10 for Pelligrino is WILD and you will not know until that bill hits! Bottle costs your restaurant $1-2 and my beer is $8! How the heck is the Pelligrino $10!\n\nProbably better when it’s not busy but some low hanging fruit to fix for sure. We will try again because we live close…but not their best day."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbmNmVkR3EAE",
            "text": "Excelente lugar para pasarla bien"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbllmSUZ3EAE",
            "text": "El ambiente , el Servicio es excelente , la comida demasiado buena , me encanta este lugar , un rincon donde puedo disfrutar y a la vez sentirme muy relax 🩷…"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbmVueGFBEAE",
            "text": "Great little place, very cozy and friendly; good selection of wine; awesome cocktails menu, especially classics on Saturday, 5 to 8; all the items from the menu we’ve tried (tuna tartar, burrata, yapingacho, Fito’s salad; Macho pizzette; seviche) were delicious"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNS12NDZnRRAB",
            "text": "Love the ambiance! The food was delectable😊.\nWill return to enjoy the live music on weekends!\nIn addition, loved the attention and the service was impeccable."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeVpybjJ3RRAB",
            "text": "An auspicious microcosm of compelling characters, scrumptious food, and a delectable wine selection. If someone were to write the next great American novel, this place ought to be featured in it, not just because the waiting staff exudes vitality and professionalism, but also because the diners themselves lend their curious personalities to the overall aura of distinction and class that this place evokes."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3azVXTmd3RRAB",
            "text": "The music and drinks are always exceptional, and the service is excellent. Love calling this spot my go-to spot in the neighborhood."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdVlPRW13RRAB",
            "text": "It is my favorite place. I drink the best caipiriña always."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncUlfZXV3RRAB",
            "text": "Small but cozy, TOP OF THE NOTCH cocktails, great food, always feel at home when visit!.. Wines always on point and every single detail of this place is very well thought out for everyone to feel great when coming in!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcDZXMEZREAE",
            "text": "This place has stolen my heart! Truly the best fine dining experience in Ft George/Inwood. A trip to the cloisters and dinner here is an idea New Yorker date"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZ2J6aVN3EAE",
            "text": "Small intimate spot with amazing amazing food! My friends and I are obsessed with the steak and yuca fries! It is so tender and delicious. The wine is great too and they have a really good happy hour! Definitely a great little spot in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbm9MS3ZnRRAB",
            "text": "Nice 🍸 bar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbHJTdHdRRRAB",
            "text": "Exceptional food and very vibey upbeat atmosphere. An absolute gem. Extraña was fantastic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNYaTdwXxAB",
            "text": "It's a nice place to go and celebrate anything or just to go and have a wonderful time🙌🏽."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcUoyWm13RRAB",
            "text": "One of our absolute favorites places! Great music, people, food, drinks and vibes. We are so happy to have this in our neighborhood so much that we are regulars here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURub05ld0NBEAE",
            "text": "The food and service is really great. Very small cozy spot. Take-out is just as good too! 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNV9mbnd3RRAB",
            "text": "Very cute spot with good food and drinks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuanUyeVV3EAE",
            "text": "Wahouuu! One of if not the best dining experience in NYC so far! Excellent cuisine, excellent service and the atmosphere of the restaurant is great. I am from France (but live in NY) and it reminds me the trendiest places in Paris! Thank you and go on!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdDlULVVBEAE",
            "text": "Dining at FITO from the booking on was a pleasure. Felix, the manager,  showed true ownership when the online reservation system kept freezing.  The next day I added two people too my reservation in the notes and Felix quickly sent me a confirmation. This sense of care was clearly seen by all his staff as well.  When I arrived, I added another two people on and the host quickly moved tables and umbrellas around to accommodate my request. He worked with on the best way to do billing for a large party gave attentive service all while seating people and acting as the host. Felix personally made and delivered our drinks. All the food and drinks were delicious. They truly existed to make my night easier, which is huge when organizing and hosting a large group. There aren't many places in the area that make you feel like you belong and you matter and Fito does that and more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dTVUeUlnEAE",
            "text": "I recently visited Fito with my cousins, and it was an incredible experience! Our waiter, Xy, was the highlight of the evening. He was not only attentive but also super fun, adding a lively energy to our night. He gave us excellent recommendations, and we tried the risotto, burrata, púlpito, and nachos—each dish was absolutely delicious! The cocktails were also a hit, perfectly crafted and yummy. Fito is definitely a spot to check out if you're in the area and looking for a fantastic meal with great vibes. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicHZIWUtBEAE",
            "text": "I can't say enough good things about this local gem of a restaurant! Despite its small size, it has an incredible vibe that keeps me coming back. Zyak, who always takes excellent care of us, truly makes each visit special. His bright personality shines through his service.\n\nOn a lighter note, the bathroom here looks like it came straight out of a magazine—so well-decorated and impeccably maintained that you'll want to take pictures. The food and drinks are consistently on point, delivering delicious flavors every time.\n\nI also have to commend Felix for creating such a wonderful atmosphere. This place is a whole vibe, and it's always a delightful experience to dine here. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcjdlRjhnRRAB",
            "text": "A cute little place nestled in the Inwood area across the park. The food was excellent.  The place is a little small, and during the weekends it does get packed. Eating outside would be your best bet."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6b2FTUTZ3RRAB",
            "text": "Best wine bar in Washington Heights. Great staff and bar tenders. A hidden gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdDQzcGNBEAE",
            "text": "No complains!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEc2YtTF9nRRAB",
            "text": "Nice place to go have a drink and have the appetizers !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNELXF1bVZnEAE",
            "text": "Very cozy but small place.\nLovely music and atmosphere.\nKiller house old fashioned drink!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dGZ5dzZBRRAB",
            "text": "Outstanding!! The best restaurant uptown  and maybe the city!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5LUlIa1N3EAE",
            "text": "A different venture from your regular Dykman experience. It is an intimate, sophisticated culinary experience inspired by owner Felix Abarca's birthplace Ecuador. Fusing rich flavors found in Ecuadorian cuisine with its food and beverage program they offer an experience in the shape of a glass or plate.\nStaff is always inviting and on point. Place is always immaculate and organized. Live music on the weekends by local artist or even the bartender \"extrangero music\" is always of great taste and not too loud.\nPop-up and collaborations with chefs or bartenders happen regularly.\nThe amazing wine list is unique and curated by a great connoisseur and wine enthusiast, the owner Felix.\n\nThe coziness of this place is what makes it even more special."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5d0tURGhnRRAB",
            "text": "Really intentional in menu, drinks, service and energy as a whole. Palo Santo lit. Tight but cozy. A little pocket of space that feels out of touch with the rest of dyckman- but in the best way. Worth a visit and then revisit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MS1fQUhnEAE",
            "text": "My best time in NY was in this place. So fun, the energy in the air, dancing l, eating great food, great cocktails, meeting amazing people. The ecudorian are so warm and welcoming, definitly recommending"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dFlYWDRRRRAB",
            "text": "I’ve visited twice and had several items on the menu and not a single one disappoints.  Cozy atmosphere, and very friendly waiters and bartenders. The service is really great as well. I’m so happy to have Fito as a great addition to the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkXy0zQjhnRRAB",
            "text": "blown away by the complexity and originality of the cocktails - food is awesome - great happy hour deals - really nice ambience. a wonderful neighborhood spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxaXBfcllBEAE",
            "text": "Fantastic spot.  Great food and drinks.  Owner is salt of the earth decent person! Super fun and hip when the tunes are spinning.  Spread the word!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxLWRTVU53EAE",
            "text": "This place is great! Amazing sangria, the half chicken with mashed potatoes was out of this world, the steak and yuca fries were spectacular, and the apps, just order them all! If you’re reading this review, just go, you won’t be sorry."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOU1UdklnEAE",
            "text": "I love the freshness of their foods,  intimate place."
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWOHZtdjFRRRAB",
            "text": "Fitos rocks 🫀🔥🫀🤘"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZzRYcHd3RRAB",
            "text": "Bueno en líneas generales.  Sin mucha variedad a mi gusto."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaeGIzcFZnEAE",
            "text": "Excelente servicio"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaanRmQVZREAE",
            "text": "Delicious food and cozy spot. Really enjoyed the ambiance. Some of the best food in the area, really."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaXZtMm5BRRAB",
            "text": "This place is fantastic. Oh la la the guava margarita is the best I've ever tasted! Great vibes and staff are very personable. The happy hour specials and outdoor patio are superb for relaxing. I wish the food serving sizes were a little bit more substantial. Otherwise a perfect option for one on one catch ups in the Dyckman area"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlLWUzUGJBEAE",
            "text": "The ambience here was great, definitely a nice spot for an intimate date night or if you just want to have a quiet dinner with a friend. The service was nice, they were attentive and really gracious. The menu is small but the food was good.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlZzhMRkJ3EAE",
            "text": "Excellent service. Cozy and dynamic atmosphere. The menu is well thought out and the food is executed to perfection every time I go. A great place to go on a date or eat with a small group of friends. The drinks are amazing. Really brings new life to this part of the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobk9LX3FnRRAB",
            "text": "Wanted to check some of the ethnic cuisine the area has been boasted about. No disappointment here. Very chic place, small & quaint but very welcoming. Grabbed a small table near window to people watch on Broadway and took the waiter’s…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1anVURHp3RRAB",
            "text": "Absolutely thankful this spot opened up. This is my favorite place in the neighborhood.\n\nThe food is delicious. I’m a huge fan of the shrimp ceviche and the yapingacho. Those are my go to. I also love the cheese and burrata plates and the macho happy hour pizzette. The couscous salad is so refreshing that my husband tries to replicate this at home. I don’t eat meat, but friends say wonderful things about the chicharrón. And the desserts are divine. The tres leche is my favorite.\n\nThe drinks are superb. I was hesitant to try these cocktails since I really love tequila and whiskey and don’t really try cocktails without them. But Felix’s creativity proved my bias very wrong. Each drink I’ve tried is so well balanced. And the wine list is great. I enjoy that there is always something new to try.\n\nMy favorite part of this place is the atmosphere. The owner has truly cultivated a welcoming environment. The staffing is top notch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aXFXZkhBEAE",
            "text": "We ordered almost everything on the menu and it was all delicious and beautifully served. From oysters to nachos, they can do the familiar but with a little kitchen magic. The vibe is equally matched with a French Latin flair outside to cozy cocktails and candles inside. We'll be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoLTVtdnp3RRAB",
            "text": "Always a good time at Fito. Delicious food and drinks with a relaxed vibe. I especially love nights with the live music. Good energy, food and drinks flowing!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1aE1yVUJ3EAE",
            "text": "I’ve been wanting to check this place out for a while— especially because I like supporting local restaurants. My expectations weren’t high because most places in Dyckman aren’t out of this world, but I must say, Fito is PHENOMENAL. I love the cozy environment and excellent service provided by Steven— but most of all I love the quality of the food and drinks. I had the pork belly tacos, amazing! And let me not even talk about the chinola tres leches! I think I had an out of body experience— for lack of better words. Please don’t hesitate to try this place. I can’t wait to eat my way through the menu."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNla183VjFBRRAB",
            "text": "Always a good time at Fito. Very friendly staff; they make you feel right at home! Good food & great cocktails.. they also have live music on some nights, to set the vibe! ☺️\n-----\nSiempre la paso bien en Fito. Los empleados son muy amable; te hacen sentir como que estás en tu casa! Buena comida y excelentes cócteles... también tienen música en vivo algunas noches, para crear el ambiente! ☺️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSLV9UMVp3EAE",
            "text": "Place is small and cozy. Food is really great, and service staff is  outstanding, from making suggestions to even laughing at our dad jokes. We had a really great time there."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cVpXYmlBRRAB",
            "text": "We just came back from having brunch at Fito. The food was great, and the customer service was excellent. Marco and Steven were really nice to us."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXb3EzVkd3EAE",
            "text": "Excellent service, a true neighborhood feel and unique selection of custom cocktail offerings. I have known Felix the proprietor for some time and he does not dissapoint with his latest inspired endeavor."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd3RQaHhRRRAB",
            "text": "We had a wonderful experience at Fito. It started out with the staff presenting us with complementary champagne for our anniversary. Then we had fantastic meals, I had steak which was so flavourful and my wife had chicken with the best mashed potatoes I’ve ever eaten. We ended up with the chocolate mousse which was delicious and also dairy-free so I could enjoy it. The atmosphere was wonderful- we got to know our fellow diners (it’s a small place, so close quarters) who were all locals and very friendly. Just a great place all around, I wish we still lived in the Heights and could go back all the time! Thanks so much for the great experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCc29UeWlRRRAB",
            "text": "Absolutely amazing atmosphere and food. We had a birthday dinner and they had a really great selection of appetizers and entrees that were vegetarian and had meat options. Absolutely delicious and fresh, great selection of wine and sangria and beer for our prix fixe menu, and incredible service. I am looking forward to coming back all !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1Z3NmZ2t3RRAB",
            "text": "I am so glad that Fito moved into this lovely spot. I was so amazed how a quaint little place could be so Big on ambience cocktails and gourmet food without being overpriced. After walking through Tryon park we were delighted to find this  uptown oasis. The happy hour wine selection was delicious not some cheap well wine you usually get. We could hold a conversation without loud music blasting and still have privacy. The staff were friendly and open to adding more mocktails and vegan selections. I can’t wait to come back and I’m telling all my friends. If I could give more stars I would!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyemRxVGJ3EAE",
            "text": "Wonderful, intimate, a well traveled welcoming ambiance exudes from the walls of this place. The food is really great. I’m impressed with the quality and cooking techniques used to capture the individual flavors within a dish. The staff and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXekpqLVRREAE",
            "text": "GREAT vibe. The cocktails are fantastic and they have excellent happy hour drink specials. Overall, my favorites to order are the Michelada, Mofito, and the house vermouth. The pizzas are good and the “shareables” are all winners. Love the Yapingacho, Chicharron, and deviled eggs. The owner is just a swell guy and the staff are super friendly. Highly recommend this spot!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyelBETHpnRRAB",
            "text": "Yesterday was my first day. The place is 5 star.  The drinks are fantastic, delicious, and have good prices.  The female bartender is super friendly and nice.  I tried the pizza, it's super delicious.  I recommend the place, I would definitely return to the place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eUpMZ3VBRRAB",
            "text": "I truly love Fito. The best place uptown to sit, chat, have delicious drinks, beers and food! They have amazing attention to detail; the service is top tier. I recommend Fito100%. Go and enjoy!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPc2R5RjN3RRAB",
            "text": "Very nice ambiance,  taking great advantage of small space. Great drinks also.  A bit disappointed that had no shrimp available,  and sever was slow or distracted.. but definitely el go back and give them another try.  Had great potential"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdC0zblVBEAE",
            "text": "Loveee this place, is cozy and have character, plus the tapas to share are delicious.\n\nGreat cocktails and the staff is very friendly and attentive.\n\nLive music om the weekends is a big plus."
        }
    ],
    "reviews_count": 69
}