{
    "name": "La Casa Del Mofongo",
    "place_id": "ChIJH_3_XR70wokRk49y2KuyfBQ",
    "grid": "MN12",
    "address": "1447 St Nicholas Ave, New York, NY 10033, USA",
    "rating": 4.1,
    "user_ratings_total": 4856,
    "phone_number": "(212) 740-1200",
    "reviews": [
        {
            "date": "4일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UWRFSjNaa2RJY1hGdlRIcFVVMDFuWDBGSFJtYxAB",
            "text": "Hoy estuve por allá, soy de las que le gusta ir a diferentes restaurantes y comer bueno.  Por fin este restaurante me dio lo que quería. Wow que delicioso 🤤 ese Mofongo y la bebida. Le doy 10 de 10. E comido en muchos restaurantes y este me hizo sentir que estaba en otro mundo. Que sabor más delicioso. Me quedé sin palabras para describir. Recomiendo el mofongo de pulpo 🐙 que delicia. No temas si quieres elegir algo diferente a lo tradicional. El de pulpo te tapará la boca 🤣😱🤤🤤😍😍 la bebida 10 de 10."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkV1ZXOHlTbmxZVm05bk0xZzRhSGhCV0VweFdHYxAB",
            "text": "El mejor camarofongo y con el mejor sabor!🤩🙏👍…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oR05IWkxTRlJoY1RKa2JYcDVlazlMYjJOVE5YYxAB",
            "text": "Loud music 🎶 be ready and a little expensive"
        },
        {
            "date": "수정일: 2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaHUzb2t3RRAB",
            "text": "Buen servicio"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMVJGTmFUM3BMYjBwNmJXMDJYMjlSVTBRNVgzYxAB",
            "text": "Ordenamos guandules y enviaron habichuelas, ordenamos chicharrón de pollo y enviaron pollo frito. Además tampoco pusieron limon para el chicharrón de pollo. El servicio por teléfono es pésimo, jamás consideraré pedir aquí de nuevo"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNlYwOVhSR1oyVkV0aVdtcGxUME5GU25SaWNuYxAB",
            "text": "Always enjoy stopping by the mofongo house, good music, good food and cold beers! This time a tried a mixed drink and had mixed feelings on it so i won't add that one in truly.\n\nHad the chicharron de pollo sin hueso natural(bo breading) maduros on the side the rest of the table ordered different dishes but we all enjoyed everything!.\n\nThe music is always banging the ambient and the people. i've been lucky every time i go its been an incredible visit for me!\n\nDef a stop to make in the heights whenever I'm in NYC!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbWIwbERNVU5hTTE5bWNtTmZZbDlVVW1sSlpuYxAB",
            "text": "The food was ok for the price. However the mofongo was meh. My husband and his family said it could have been better. That’s coming from locals from Santo Domingo. They did their best with 12 birthdays at the same time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUVJVMUxVbUowWTA1d2MwWnFiMjFtZVhKUFoxRRAB",
            "text": "good food but service person took a looong time, no bueno eso"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMlZUWk1WVXBUVmpKclpWZHFRM1pFT1hSQk5IYxAB",
            "text": "La Casa del Mofongo has really good food, no doubt—but the portions are small for the price. It’s definitely on the expensive side for what you get. That said, the service is friendly and the atmosphere is nice, which makes the experience more enjoyable.\n\nIf you don’t mind paying a little extra for a taste of Dominican flavor, it’s worth trying—but don’t expect large portions."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KM2JtRnZVWEp2WVVKbVdrTjJSWGh2VUhWeWVHYxAB",
            "text": "Great food and music!!!\nGreat place to sit at the bar"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcllYb3pTMk5CWWtSblNtWnVia3B6UVZKNFdIYxAB",
            "text": "Will come back for the soup!!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWGVqUnVXVmh6UkcxNVdFWXhTM0p6ZFZSQ1VVRRAB",
            "text": "Horrible. El mofongo fue de lo peor. Queso que intentaron derretir y no se derritió, frío y grueso. Jamás volvería."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVk5UZG5kazkzVm1zMVdUWnFkRmRWYlVaUk1IYxAB",
            "text": "Vinimos de california a probarla muy buena buen servicio nos atendió luz la mejorr 🤩🤩🤩🤩🤩"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQ2QyMTNXR2hvYzFvek1raENiRGxTZUhBeFNFRRAB",
            "text": "The food was amazing!!! The people amazing!! The atmosphere reminds me of DR zona colonial"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUVRVUnNlbk5aU0hOb05ERnVXa1pqYzNsM1RGRRAB",
            "text": "Muy mal servicio no me gustó aparte saco dinero del cajero y mira como salen"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNFkyWmlVRTlmYlhCNlMzRjFUbFphVlZoWlZuYxAB",
            "text": "Seems like man servers are better than women servers in this place. Even my wife said it. Men servers are genuine, elegance, and well driven."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GU2JrdFZRM05VUjB4S1QwdG9Ta0pGTmpneGRrRRAB",
            "text": "Love this place! Went with some friends recently and we all had a good time. I ordered the shrimp ceviche mofongo and it was amazing! Also had the passion fruit margaritas and it was strong and delicious. Service was great and they had a DJ so it was definitely a vibe. Would definitely go back."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VFUxOWtaRjluVG1SeU1rSkplV1pGTTFrMU5uYxAB",
            "text": "Un plato de mofongo cuesta 50 dolares: platanos por 50 dolares.. very expensive y el lugar no se ve grandioso"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsU1psWmhaWFZ5TUhKVWMyeENhbnBrY0ZJNE1VRRAB",
            "text": "Pretty cool place to eat & drink @"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMWN6aFBOekpEUzI5emNrWmZTRzA0VGxacFRuYxAB",
            "text": "Our \"new server\" was great. We knew he was new, he took our order and repeated it. The bartender bought us our drinks and asked if we placed our order we said yes. After that everything was downhill. The food was bland and they forgot the easiest thing 2 sides of rice and beans. When we told them after a while maybe 30 minutes they decided to blame the \"new guy\" so I asked where he was as he disappeared after taking iur order. He was sent to so something else. I then asked so who was taking his spot? No answer we asked to remove the rice and pay to leave. They wanted to get people and point fingers. Our server the \"new guy\" did just fine it's the other senior people who pulled him off his duty that are to blame and to tell your customers he is new is low. He did what he was told. Next time a newer team member is training someone should be with them and in the case they make a mistake it happens that should not be the first thing management says, make it right and stop looking to blame. Had they apologized and went to get our rice and beans it would've been ok but horrible customer recovery skills by your senior staff. Menu is overpriced for quality."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twYU9IWllNM1JEUnpWNWJVTnRUazVUWDNsdGFWRRAB",
            "text": "First of we went recommended, total disappointment, La casa del mofongo and they did not have Tri fongo!!!! beef stew was hard and cold, mofongo was dry only good thing was the garlic oil sauce they give you to make it moist then it was eatable, and the waitress with her up most attitude like not humble nor thank you when i mentioned her we went recommended with a 10 star rating! Rude ppl no customer etiquette at all I think they do not know the meaning of it. My bill was over 200 charging regular price when some plates were order from the special menu, for that never again total disappointment."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKcFpHaFhTbWR3UTNKUlVVSmxOM1p4VjNCU2FtYxAB",
            "text": "TIENEN QUE VAJAR ESO PRECIO ESTAN DEMASIDO ALTO UN MOFONGO QUE EN  OTRO LUGAR TE CUESTA 35 DOLLAR HAY ME QUITARON 51 DOLLAR Y A MI AMIGO TAMBIÉN LE HICIERON LO MISMO TIENEN QUE TRABAJAR ESO PRECIO EN REALIDA PoRQUE SE VE CADA VEZ MAS VACIO EL NEGOCIO Y ES POR LA MISMA RAZON SOY TAXISTA Y CUANDO VOY A IR PARA ALLA Y LE DIGO AMIS AMIGO ME DICEN TU ERE LOCO HAY ESTAN MUY CARO LOS PRECIO."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcGFVY3lhazV2Ym1kaVpFbG5XbWRqTUU0MldWRRAB",
            "text": "Desde el comienzo hasta el final este lugar no tiene buen servicio, la comida súper mala y sin sabor los empleados no tienen ningún tipo de delicadeza para atender cómo se merece el cliente, tienen que entender que si no hay clientes no cobran, no tienen trabajo tampoco, no recomiendo este lugar para nada poco profesionalismo, fue mi segunda vez por que quise darle una segunda oportunidad por que la primera fue mala, pero esta fue peor , hasta para pagar tuve que esperar que la empleada terminara de comer para pagar, dios mío increíble. 👎👎👎👎 HORRIBLE  EXPERIENCIA"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRGJsTlhObVJ1V1dWUU5uVkdNalZqWkMxc0xVRRAB",
            "text": "I was pleasantly surprised how good the food was and the service was on point. I recommend this restaurant it you want authentic Dominican food. I will be back when I return to the city again 👍"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKYVUzaHZkamN6T1RKYU0weEtWVnAwVUVSQ2RuYxAB",
            "text": "Este lugar la primera vez que voy y no me gusto la comida muy cara la mesera que nos atendio muy distraida hasta se le olvido traerme lo que habia pedido!! Hay otros restaurants doninicanos que cosinan mejor y hasen mofongo tan bueno y no tan cara como la casa del mofongo!! Se creen que estan en la ciuda!!! Jaja"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WlVWZzNUR2h2TnkxTmEwZHVSMlEwYW1weGJYYxAB",
            "text": "El mofongo con chicharrón esta bueno solo que la ensalada parece de bolsa de supermercado\nEl pollo al grill estaba un poco seco y la ensalada igual nada fresca los frijoles si estaban buenos\nMe parece caro el restaurante"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eVpXcFNkbVJpUTFKNVRrZEdTMjFpVkc1emQwRRAB",
            "text": "Love eating here every time I go or pass through the city. Everything is delicious but I always order the same thing cause it's my favorite. Mofongo with the beef 😋🤤."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVNVFsSlpMWGRmV1hsc1UzZHhPVEJzTVRFeFNWRRAB",
            "text": "Food is so so so good best mofongo!!!!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psV05GcGZaSE5vYlZwUlVrMVpaMko0TWpKU01YYxAB",
            "text": "Excelente ambiente para pasarla bien y compartir unos tragos y buen mofongo Dominicano"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocGFHRnZabFJWV0ZKUE9YaGljMWRCZUZjMFNYYxAB",
            "text": "The place was very clean and the food came fast."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOclYzRnBOREUxTUVFeGVqUlVOV0ZhU0RkdU5WRRAB",
            "text": "Excelente servicio de Mili, La comida estuvo magnifica y la música también. 100% recomiendo este lugar a cualquiera que desee una comida dominicana y un ambiente genial"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMU9XNDRPWE16Ykdwa1praFNNVkoxZDI1Nk4zYxAB",
            "text": "When you’re in the Heights you just have to stop here.  Came for an early dinner. Seated almost immediately. Our server was attentive and very nice. We ordered a variety of different dishes. I actually tried the monfongo with chicharrón. Pretty tasty. Very filling, I couldn’t finish the entire meal. We also had the chuletas, camarones al ajillo, churrasco and arroz con pollo. Overall great food."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdWFIbHFhRlJzTUVwcFQyMW5hWHBqU0hCTE1XYxAB",
            "text": "Estuve  por este restaurant  y ordene  medio pollo con vegetales, excelente  comida y buena atención"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTVJFRm9lazlOUmpsb05YSXlkREY1UzBFeVEzYxAB",
            "text": "The food was very well prepared to temperature and taste. They tried to shape the rice on the plate, but it fell apart when it was served. That is probably the only negative thing I can say. All the food tasted great. Our waitress regularly checked in on my family. I appreciate her attentiveness to our wants and needs. She made it easy to enjoy our meal. The staff even packed our leftover food in front of us. They seemed to enjoy their employment there which was nice to see. The atmosphere was energetic and entertaining. They played all the jams anyone could dance to. My kids got up and started their own dance off on our way out. I would recommend this place for the food, service, and atmosphere."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRlRscE5hV2hVUjBFeWRsRnVaR1JYWkRGdk0wRRAB",
            "text": "Muy buena gastronomía dominicana.\nSe siente ese sabor de Quisqueya."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSmFYcHFlWE5yZG5CUmRTMDViRFpzUkhkdU9XYxAB",
            "text": "Food was incredible.\nPortions are very generous!!!\n\nGet the paella!!!!!!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdURwcW1IdXFUbzFnRRAB",
            "text": "Me gusta ir allí"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuenFLblB3EAE",
            "text": "Not my favorite but also not the worst place to eat Dominican food. The juice was not fresh (most likely from a store bought carton), my chicken tasted as if it had been reheated. I would rather go to a little hole in the wall further uptown or in the Bronx."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2d3FMT2ZBEAE",
            "text": "La comida es deliciosa y el servicio de primera. Sin embargo ese café que sirven no parece que es un sitio dominicano y es carísimo. Fuimos dos adultos y una niña, no le pedimos un servicio a la niña, dos platos, dos entradas (las almejas y las croquetas de pollo son ricas) dos café, trees jugos de chinola y una tres leche. Eso fue 188 dólares."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeHJ6QXR3RRAB",
            "text": "Cada vez que viajo desde MA, tengo que venir a comer aquí!\n\nPositivo:\n1. La comida es tan rica y deliciosa. Cada vez que vengo trato un plato distinto, pero asta ahora todo me a gustado mucho!\n2. Las mecerás son tan amables y rápidas.\n3. Los baños están limpios\n4. El olor del restaurante es agradable y puedes disfrutar de las mesas y sillas limpias.\n5. La localización está en el lugar correcto y puedes disfrutar de las tiendas alrededor.\n6. Los precios son razonables para el tamaño de la comida.\n\nNegativo:\n1.  Lo único que cambiaría es el volumen de la música.\n2. Me siento incómoda un hombre vendiendo perfumes cerca del baño. Creo que hay lugar para todo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdjlIWmt3RRAB",
            "text": "Food was great, Good Vibe... Went here really late in the evening so everything was off a more expensive menu.. wish they had a better salad selection.  However other food was delicious..\nIf you like Hookah, they have that too on the bar side of the restaurant.  I do not smoke so Hookah is not for me. However,  ppl seems to really like that.\n\nDid I mention Music, so you can totally dance here, there is not an actual dance floor however ppl made the best of it.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabEl2b3pnRRAB",
            "text": "If you're in the mood for something Caribbean, both in food and culture this is the place. A loud, but not too loud, exciting atmosphere smiling faces, and plenty of flavor in the air. The music isn't so loud that you have to shout over people but it is definitely apparent.\n\nThe food is priced well, cooked with expertise. Reminds me of some of my grandmothers cooking, and takes that as a high compliment in full esteem. The drinks were also great, maybe too good.\n\nBring your family, listen to the music, sip your drink, and eat. A good time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaThIZ0ZBEAE",
            "text": "The food was phenomenal! The beans were made so well. The mofongo is seasoned well, soft texture, and the chibo was tender! Chicharron de pollo had so much flavor and was super juicy. The service was great. Wish they would get a heater downstairs where the bathrooms are. Also wish the bathrooms weren't all the way downstairs. Will be coming back anyway."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MXFQWkVnEAE",
            "text": "The music was waaaaaaayy too loud. Come on. It was insane. The food was ok nothing special. It was a little overpriced if you ask me especially for Dominican rice and beans . They had alot items missing from the menu, and when you asked why, the waiters just had a dumb look on their faces and no explanation. It's not difficult to answer a question about a menu item. Probably won't be coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbzUyYTB3RRAB",
            "text": "This Dominican restaurant is a fantastic find! They offer a wide variety of mofongo dishes, perfect for meat lovers and vegetarians alike.  You can choose between dry or broth-style mofongo, and they have a great selection of other Dominican specialties.\n\nThe location is super convenient, with easy access by bus or subway. Plus, it's perfect for a relaxed meal with friends - they have spacious tables and are accessible for people with disabilities. They even offer take-out options if you're on the go.\n\nOverall, highly recommend checking this place out!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZeTQyQVZ3EAE",
            "text": "Our server was super cool. We ordered Sangria and didn't like it too much and she up and returned the whole bottle free of charge. The food didn't last too long and it tasted awesome just have a look a some of my pictures...Negatives are…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMjV2VzFnRRAB",
            "text": "This was a great budget friendly restaurant!If you want to experience the culture, it's the perfect spot for it. Walking around in the heights can build up an appetite, conveniently located right off the street of bustling vendors, you can't miss it! Food was awesome and plentiful, plantains are very filling and the portions are huge! Service is a little M.I.A but, the price makes up for it. Yes, your server speaks spanish and english!!\nIf Hookah and lurking older men at the bar makes you nervous...leave by 7pm.\nOverall, I had a great meal..not too many vegan options so beware,stick to the sides part of the menu."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcC1DZUt3EAE",
            "text": "La comida tardó mucho para llegar, más de una hora. La mesera nunca se acercó a preguntarnos si queríamos otra bebida. Mi esposo ordenó churrasco “medium well” y llegó “well done”, yo ordene mofongo con chicharrón y el chicharrón estaba muy seco."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvby16aFJBEAE",
            "text": "The food was good, but the steak was too dry and overcooked for my liking."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdjhpczBRRRAB",
            "text": "Food is great! Service as well. Too busy on that day and food took some time, but overall pretty good. Especially the schrimp asopao. Loved it"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzb09TN0xREAE",
            "text": "Great restaurant that with great food!! Came here during a late rainy night where almost all restaurants around the area were closed except for this one. Best place I could have gone. The food was great and at a really good price! Great drinks menu and the staff was really nice!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaXAtYmpnRRAB",
            "text": "Great music, vibe, and hookah. They vary in hookah flavors. The dinner was great and reasonable price to be NY. Would recommend for anyone to come. *Only downfall is they lack on appetizer options; not many options.*"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5cktteFZREAE",
            "text": "El lugar es bien familiar es un poco costoso el servicio es 100% la comida como el Mofongo con churrasco no me sorprendió creo que esperaba más de el lugar solo por la fama que mis amistades le dieron"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ0x6bHpBRRAB",
            "text": "The staff was very knowledgeable and helpful, and the food was absolutely delicious! 👌🏻"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2MHYteENREAE",
            "text": "My Fiancé is half Dominican and he swears by this place as the best Dominican food in New York. We go whenever we find ourselves in Washington Heights. Best to go with someone who knows their way around the menu and speaks Spanish. The staff is nice, but many are not proficient English speakers. Don’t expect traditional American style service as you’re in the heart of the City’s Dominican neighborhood.\n\nThe food is hearty with rice, beans and plantains for sides. As typical with Dominican fare, the meats can be overcooked and dry, but also crispy, salty and satisfying."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGeFlPSGZBEAE",
            "text": "I want to start off by saying one of the most flavorful foods I’ve eaten in a while. I came here a few times and the food hit every time. The staff were super welcoming and friendly. The prices are reasonable. Will definitely be added to my collection of favorite cuisines."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPeXAxczJVeU9YcFBREAE",
            "text": "Todo perfecto excepto que la música del bar es muy alta y molesta en el área de comida, no puedes concertar una reunión de negocios ahí porque la música no te dejaría, deben dividir el espacio con un cristal  para que se pueda disfrutar en los dos lados ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3d3AzN3lRRRAB",
            "text": "I enjoyed the food, the drinks and the company. Thanks for having me."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvNjRLOThnRRAB",
            "text": "Great atmosphere.  Great service.  Moderate wait times but worth it.  I had the chicharon mofongo it was excellent.  My husband had the seafood spaghetti in white sauce and it was delicious.  It had crab, lobster, calamari, octopus, and…"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPeUI0UFhQZ292ZUVREAE",
            "text": "La comida es muy buena, pero el\nServicio malo , pedi unas alita de entrada y ni me la traeron , por eso nonlo recomiendo , el\nServicio va de la Mano con todo 😡"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJbnNhdkpnEAE",
            "text": "OMG...Everything was Deliciouso and the service was wonderful.  We ate like there was no tomorrow and had food to take home.  The cafe con leche and dolce de leche were magnificently.  I used to eat here years ago and was in NYC for the day…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbzgtSGlnRRAB",
            "text": "La comida tenía buen sabor pero estaba fría,  el servicio estuvo bien, pero creo que pueden mejorar el aspecto del lugar."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNDRxQlJ3EAE",
            "text": "Food was decent. Nothing mind blowing. The service could have been a lot better….not that friendly. Overall, I don’t think I would return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaDluMUJnEAE",
            "text": "This place was so dope. My friends & I loved it when we visited this Summer. The service was quite good from the hostess to our lovely server but the Mofongo was the best part. I got the beef steak one & my mouth waters just remembering it. Unfortunately they didn't have the deserts we wanted but we were so full anyways. Can't wait to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSb3B6RklnEAE",
            "text": "Loved it . We had came down from Rhode Island to visit our home town and family 💕💕. The food was excellent the ambience was excellent just love being around music and friends and family Latino culture. The food was amazing they have a variety for all that are looking for something different something new something tasty. The desserts 💜 yum I had flan . Looking forward to my next visit or celebrate my birthday 🎉🎉🎉. I had the bento box 🍱 . 😱 It was delicious. Japanese dish ."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHcnAzZmJREAE",
            "text": "Es un restaurante que exalta la gastronomía típica de la comida Dominicana en New York, sus precios son asequibles, y su menú bien amplio, de muy buen sabor y sazón."
        }
    ],
    "reviews_count": 66
}