{
    "name": "Native Noodles",
    "place_id": "ChIJBUwqQtX3wokRuc2aytaILFs",
    "grid": "MN12",
    "address": "2129 Amsterdam Ave, New York, NY 10032, USA",
    "rating": 4.6,
    "user_ratings_total": 345,
    "phone_number": "(646) 370-6290",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMmNGUlVSVWRST1hOclFrZDJkbFJWT0VoVmJFRRAB",
            "text": "First time ordering here, I got the laksa soup, with shrimp and tofu take out for lunch. Yummy, needs more veggies i think but the broth was exactly what i wanted. Today i got the rice noodles for the soup, I’ll try the other noodles next.\n\nLa primera vez que pedí aquí, pedí la sopa laksa, con camarones y tofu para llevar para el almuerzo. Delicioso, creo que necesita más verduras, pero el caldo era exactamente lo que quería. Hoy pedí los fideos de arroz para la sopa, probaré los otros fideos la próxima vez."
        },
        {
            "date": "17시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4d1YwUlpZWEJVUkVSR2IyWnRSRGhwTjFrdGNIYxAB",
            "text": "All of us benefited from the welcoming atmosphere here. As a new resident, finding this place made settling in better. The cuisine is impressive. Staff care was notably excellent. This place offers dependable satisfaction."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sweFpFczFka0Z1VVU0dFFtNWFkVFpPYTJWNlJIYxAB",
            "text": "Do you want more 5-star Google reviews? Best of all, they’re free! We can provide as many as you need to help your business reach the top of Google Maps. Contact us on Telegram: @gthisjpeg"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aellWbHRTRzlKUkhscWJraEhaSFJTWmpNMVRsRRAB",
            "text": "Our group couldn't stop talking about the meal we had here. Restaurant staff provide friendly help and know what food you'll enjoy. The mood works well, the space is clean, and the design is basic. This defines excellence in its category. I'd return weekly without hesitation!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMk9VaE9OamhIWmxsWGNrdzBVMVF4V1hWT09GRRAB",
            "text": "The kitchen handled orders smoothly."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dFowcFFNR0ZzVUhGRFl6QlpMVmwyTURoM1FXYxAB",
            "text": "Native Noodles is amazing! The food is super fresh, flavorful, and full of that authentic Singaporean taste. The laksa and chicken rice are both incredible — comforting and perfectly seasoned. The staff are friendly, the service is quick, and the space has a casual, welcoming vibe. It’s the kind of spot you can eat at any day of the week and always leave happy. 🍜✨"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTmNWOWhTVkJyVkZnM2RWVTNOWEpTWldkbGRsRRAB",
            "text": "Everything I have tried here is great and I keep coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSb2FtSkdhV05yUkU1NGNXVkljRFJQYkZoWVRGRRAB",
            "text": "I took a chance on this place coming across it on GrubHub, then a lot of the great reviews sold me. It didn’t disappoint because the food was delicious. I had Chili crab buns, shrimp shumai, curry puffs, chili crab pasta, shrimp garlic noodle & mango pudding. All a 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxZldtTjNNSFJSU0dscFRucFRXWHBpZFZCWWIxRRAB",
            "text": "the crab pasta and spicy shrimp rice are must haves if you like spicy food, really tasty singaporean food, a rare find"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUFgyY3llRmRZTmxnelowVkxiR3RPYlZnek0zYxAB",
            "text": "Chili crab noodles were great! I will surely be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaE1tWkJkM1ZaVlVscGJVUTRRbkExYUdaNWQxRRAB",
            "text": "Had the Singapore noodles. Great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVmFXRmhaelJaTlhSRE5rWldXbmhEY1c5TlJXYxAB",
            "text": "This place has my absolute allegiance. Native Noodles serves premium dishes in an elegant setting. The food quality stands out and the service remains reliable. Workers here maintained the high standards of this quality place. Good performance! I'll return again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReVREWjFaM0E0VUV0V1JFeHZRWFJET0dWd1JHYxAB",
            "text": "As a Malaysian who lived in Singapore for 6 years, I give this place a 5 stars. Laksa is so far the best I’ve had in nyc and the sambal prawns are also v nice"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xseE1qaG1UbXg0ZGxkdE9FUmZVMkpyYld0SVlrRRAB",
            "text": "loved the dry laksa!!! tasty and fresh and light, would defs recommend 🫶🫶"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoemNHMHlUVGRCVFVKUVozbDVVVVF3ZHpVeFVGRRAB",
            "text": "Cute small delicious and affordable"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsd1ltSk9Na2xVTkU1NmVVRlpiRlJ6WVhoSlFWRRAB",
            "text": "We had a wonderful dinner at this hidden spot! Very flavorful and great portions. The  popcorn chicken was especially fun. And the staff is so friendly and helpful. Give it a try for some delicious south East Asian vibes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oM1ZFZFpkWFo2WkdsRlpsbHZNbmhHY2tobloxRRAB",
            "text": "Amazing food and best lemonade! I always enjoy the service and energy here!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWUxWaEllazkzTkZGTWJHUllWV1ZCWXkxc00xRRAB",
            "text": "Love, love, loved everything I ate. Everything was fresh that came to our table. The young lady, our server was so sweet so Thank you.🙌🏽"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMlMySlFYMDl5UWxSaFgycEZTRkZNUmxBMVpuYxAB",
            "text": "A  kind, welcoming and generous vibe with simple deeply tasty fun & spectacular noodle dishes. Thank you!!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweVJGOUhVbll5Ym1GcU9XOXpVVVo2Ym1aRVoyYxAB",
            "text": "La atencion es muy buena! La comida esta rica :)"
        },
        {
            "date": "4달 전",
            "language": "id",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV00waHNUVFpQUkUxUFZYSlRiMVZhWlc5elZsRRAB",
            "text": "Really good sayur lodeh"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVGRWbHpRa3RQV2xCdlFuSnZVRzlQZWtkb1pYYxAB",
            "text": "I was looking for a nice place to take my mom out and I'm so glad we came here. It was the hottest day in nyc 100 degrees so it was a little hot inside but the young lady that was helping us brought water and was so attentive overall. The food was great we gold a rice bowl and a noodle bowl. The food was amazing. I will be going back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdVRrUnphR2haTlU1dVJUbFBjREpZWkhrNWVIYxAB",
            "text": "This is such a cute restaurant! The food is very flavorful, and the noodles taste great. The atmosphere is great too, its a nice place to stop for a quick bite and relax."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMVpFY3ljV0YyWVZwdVNsVmxiVkJUVkRsTllrRRAB",
            "text": "Stopped in for lunch and I did not leave disappointed. The lunch specials are very filling and the ingredients are fresh. I got the peanut satay and added the roasted pork which was delectable. Absolutely recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMTDl1ZEtjaE56RE5REAE",
            "text": "Very inexpensive . Courteous service and tasty dishes! Will def be back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNQ1p6SXZVM3ZPMkdBEAE",
            "text": "Laksa - the soup version is very creamy and flavorful. Loved the ingredients which came together really well.\n\nChilli crab pasta - very generous portion of crab. Noodles were soft and delicious.\n\nBak choy side - at $5, it’s really affordable. Home-cooked flavor with shallots but could do with a more thorough wash before cooking as it’s still a little sandy.\n\nFried buns with chilli crab sauce - liked the crunchy fried exterior. Sauce was a little too sweet.\n\nRice with pork - immense home-cooked flavor. Pork was a tad too tough though.\n\nMango pudding - surprisingly delicious. Comfort food. Not too sweet and did not taste artificial.\n\nNot crowded during weekend dinner. As one previous review said, they should really better-clean the sticky table surfaces. Prices very reasonable. Counter-service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLX0NrX09saE8zdG5nRRAB",
            "text": "What a great little spot"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eXYta3JRRRAB",
            "text": "Adorable yellow storefront serving up yummy comfort food. We had the coconut vegetable stew, stir fried bok choy, chili crab buns and iced tea. Everything was so delicious. The stew is creamy and rich. The sides were fresh and flavorful. The tea was perfection.\n\nI can’t wait to go back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcjRLclVREAE",
            "text": "only writing a review because i need to know, what happened to your cold noodles?! they were soooo good. i literally think about these noodles once a day and i just cant understand why they arent on your menu anymore :( i only order online so it was very confusing for me and im starting to think i might have only dreamt about eating them ever since they’ve disappeared from your restaurant. please bring them back, i beg of you."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NUx1STd3RRAB",
            "text": "Super cute and cozy place with PHENOMENAL food; will definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3enV2RXhnRRAB",
            "text": "Curry shrimp noodles were great!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncUl5dEhBEAE",
            "text": "Real food Singapore style which seems like a blend of ALL the SE Asian countries. Taste a bit Thai, Vietnam, Malaysia etc. Lady who owns and runs is from Singapore and keeps it real. Prices very reasonable. Definitely give it a try!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbUxUQlNBEAE",
            "text": "Quaint place with great service and flavourfull food in a quaint space. Unique offerings. Delicious teh, laksa noodles and perfect soups for the winter"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaDZpOW9RRRAB",
            "text": "Yummy! Highly recommend the peanut noodles"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNWJfWTNRRRAB",
            "text": "The Laksa & Singapore noddles were delicious- coconut curry took our breath away. Such tender noodles and flavorful curry. 10/10, would recommend"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaWN5VUl3EAE",
            "text": "This restaurant is such a gem! I loved the service, the kindness and the delicious flavor. We ordered the Lhasa soup and satay noodles - 10/10 flavor!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfX3VlUnNnRRAB",
            "text": "Small but homey. 5 star food in a casual setting."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmeHZUN0p3EAE",
            "text": "Great noodles.  Yum.  Mice local place.  Not fancy.  I will come back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaU52MllREAE",
            "text": "Cute small place with great food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cF9uWEdnEAE",
            "text": "The food is very flavorful.  We ordered Singapore noodle and Laksa noodle, with shrimp as protein.  Both taste very good, a little bit on the salty side, but I usually eat food on the light side.  I take off one point for the environment in the house for sticky old floor and very old cashier counter space and most of the seatings.  The seating by the window is nicer."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ODk3S2pRRRAB",
            "text": "Absolutely delicious food with wonderful service and ambience. I highly recommend this place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQM3M2YW1nRRAB",
            "text": "Truly our favorite place in NYC! Incredible team, great value, and absolutely out of this world food with creative takes on the classics. We’ve tried most of the menu and it keeps getting better — looking forward to visiting many more times!"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbDRpeVZnEAE",
            "text": "Buen lugar"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzczhDWUZREAE",
            "text": "Great quality of noodles. I came and got the shrimp fritters and crab appetizer. All were really fresh and hot.\n\nNoodles were great and very flavorful. I added pork and shrimp. Great price point for area. Highly suggest trying this place out for a quick bite."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzaDdyWVVnEAE",
            "text": "I enjoyed this laksa soup (shrimp, tofu, noodles, et al.), looking out on Amsterdam Avenue, sipping some milk tea. 'Nuff said!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMza091dExBEAE",
            "text": "Their food is very good but their delivery is VERY unreliable! After a horrible delivery experience, we decided to try again because there aren’t that many great options in the neighborhood and we do like the food. Our order is currently very late, has not arrived yet, and the phone number is not in service so we have no idea when or if our order will arrive. Please do better with delivery! If it’s backed up, that should be reflected in the delivery estimate. This is not acceptable in NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYLThLbzdRRRAB",
            "text": "got the satay peanut noodles with chicken, was really good! nicely balanced"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudmVTZGd3RRAB",
            "text": "Pizzas are good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudHY3R3N3RRAB",
            "text": "Lakesha noodles had a pretty fishy taste that we didn’t like much.\nIndonesian noodles very mild taste.\nChili shrimp with rice was good and legit spicy. A little too much for me but not for everyone else.\nPeanut noodles has a sauce with a good flavor but the texture overall wasn’t amazing.\nCrab pasta had a mild flavor that was a little unpleasant. We didn’t like it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaXIzS2lBRRAB",
            "text": "A small neat and wonderful restaurant for Southern East Asian noodles! It seems a family business. Very Friendly environment."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bG9DM1N3EAE",
            "text": "인스턴트"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyd0w2SWZREAE",
            "text": "Visited this place with my husband and infant for first time. It’s a mom & pop store run by family. It’s very near to the children’s hospital and has a place to dine in. The lady at the counter was very polite and explained what we should order as I am a vegetarian and occasionally eat eggs. We ordered Singapore noodles and vegetarian stew with rice. It came with a side of spring roll. The food quantity was more than what you get in fast food restaurants. We both loved the dish and ate your heart’s content. I am only giving one start less because it was too hot today and their AC was not working."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiaWVxYkdnEAE",
            "text": "Lover of Asian Cuisine; we made our way to this Singaporean restaurant in Washington Heights. It was a relatively hot day and this restaurant was relatively warm inside so made the dining experience a bit uncomfortable.\nThe menu offers limited dishes and beverages but we ordered the lemonade and it was absolutely amazing.\nBoth our dishes were delicious including the yummy spring rolls.\n\nOur server was not attentive and seemed overwhelmed or not interested in serving. Nonetheless our experience was great since we don’t have to travel far to pick up so great Singaporean dishes.\n\nThe establishment is quite small so there is limited seating. Street parking is available but also very limited."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOWV5MjV3RRAB",
            "text": "Phenomenal Singaporean noodle restaurant. Fast and friendly service and delicious food. I ordered the dry Laksa noodles (\"dry\" because the dish also had a soup variety), which were delightfully chewy and spicy. I had to get some dessert because I wanted to stay longer. I tried the black rice pudding in sweet coconut milk. 10/10. If you are looking for authentic Singaporean flavors, look no further.\n\nThe only reason I deducted one star is the lack of a restroom for customers. I really had to go, so they let me use the kitchen bathroom after I asked twice, but I generally think a dine-in restaurant should have a restroom for customers by default.\n\nRegardless, I look forward to returning with an empty bladder to try more of the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqb055cnd3RRAB",
            "text": "Very good stuff! If you haven’t tried Singaporean food, definitely stop by this place if you’re in the heights. I ordered the popcorn chicken, Singaporean noodles and the lemonade. The lemonade is worth the price since they use different types of lemon, not too sweet and not so tangy. The staff was so nice and made great suggestions, pricing was very reasonable overall, I spent $20 (appetizer, meal and drink)."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLLXBDcnJnRRAB",
            "text": "Finally got to visit yesterday and claim my Yelp Elite Perk which was Boiled Wonton Dumplings complete with a soy garlic sesame dipping sauce. Delicious, thanks Native Noodles!\n\nOf course we also wanted to try some of their best dishes so we also got the Laksa Noodles, Chili Crab Pasta and the Honey Roasted Pork over Rice. The Chili Crab Pasta was good, it was more sweet versus savory and there's obviously a hint of spice given it's Chili Crab but it's tolerable and good. The Honey Roasted Pork was our favorite among everything we ordered. It reminded me of a cross between Filipino Adobo and Asado dish  so if you like that savory sweet combo, you'll enjoy this. As for the Laksa, I've never been a Laksa person as I feel it's an acquired taste but it was good, just not our favorite. I'm sure those who love Laksa will appreciate this dish. :)\n\nOverall, a small charming newcomer who is already making a name for itself and drawing crowds with its good reviews. Looking forward to continue to support and see what else they will add to the menu. Perhaps Singaporean coffee and coffee buns? And hopefully add some Asian drinks and desserts too! :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NXNTVkhREAE",
            "text": "Overall a very good experience. The food is very good, and seems homemade (with its pros  and cons mostly pros). Price is also very good. I definitely recommend this place.\nCrab buns : crab is on the side, not inside the buns. I do not recommend taking 2 extra buns."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbDVUMVZnEAE",
            "text": "Its an out-of-the-way part of Manhattan, but worth a stop if you are in the area.\nLaksa noodles with Shrimp, Potato Pancakes, Honey Pork Noodles were all really good, and I'd like to try the rest of the menu as there are a lot of dishes you couldn't try anywhere else in the city.\nService was very friendly too and they even gave us some mango pudding to try as they had just finished making it, and it was delicous!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbXJqemZ3EAE",
            "text": "A hole in the wall spot with delusions food and good service. Everything we ordered was tasty. I especially liked the coconut veg stew. The Laska and the satay peanut noodles were also delicious! They had plenty of vegetarian options too ( you could make the needles veggie if you wanted). I also loved their rose milk. Sooo good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNV9iTjN3RRAB",
            "text": "First time visiting this gem and it was GREAT! Service is A1. Since it was my first time trying this food I asked the waitress for their recommendation. She was very kind and couldn’t go wrong with her suggestion. I loved it! Prices are reasonable."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHOThfMGJ3EAE",
            "text": "I really wanted to like this place, as NYC doesn’t have a Singaporean restaurant. However, I would not call their laksa ‘laksa.’ The gravy (?)  was goopy and lacked the spice notes of laksa. Laksa broth is rich, prawny and coconutty, this felt like ginger corn starch goop.\n\nThe chili crab laksa had a generous portion of crab but the linguine was floppy and not al dente. Sauce was alright.\n\nThe sayur lodeh contained mostly carrots and broccoli which are not traditionally found in the dish. It’s supposed to be primarily cabbage and turnip with some strips of carrot.\n\nThe soto ayam was the best dish I tried and was the most authentic."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2c2Y2Y09nEAE",
            "text": "Delicious and creative Singaporean food with authentic flavors. The rose milk was floraly And sweet, with just the right amount of rose flavor. The pandan waffle Was nice and crispy on the outside, while super fluffy and moist on the inside, with a really subtle pandan flavor. The Kaya jam was a perfect complement to the waffle. I loved the fried mantou breads, and the chili crab sauce went with it well, Much neater than eating whole Singaporean chili crab! I would definitely love to come back and try all of the other items on the menu. The staff here are also very friendly, but there is limited seating if you are thinking about dining in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMnBDa1V3EAE",
            "text": "Homey noodle spot worth checking out near the Morris Jumel Mansion by 168th. Helpful staff, good service, decent portions. Enjoyed the laksa lunch special ($13), spicy crab pasta ($16) + calamansi lemonade (though slightly sweet for my taste)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsaGJtcEp3EAE",
            "text": "The tofu vegetable curry is DELICIOUS, and I could just eat bowls of the coconut rice on its own! Best Singaporean food in NYC. Only wish they had more vegan/vegetarian options, and real plates/silverware"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWbE5YbHF3RRAB",
            "text": "I did not know Singapore have different styles of noodles. So far, all the dishes I have tried never disappoint me. I am gonna try their new rice noodles bowl later this week."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqd3FqSDZRRRAB",
            "text": "Fantastic place! Really authentic laksa noodles. They gave us free new dish (fried cream cheese dumplings, if I remember correctly) to taste. The lunch special is a great deal. My favorite Singaporean place!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5ejZmTFRREAE",
            "text": "Amazing new spot in Washington Heights with tasty Singaporean street food (from Singaporean owner!). The portions were generous and the pricing is modest. We ordered the popcorn chicken, fried dumplings, homey roasted pork over rice and satay peanut noodles with chicken and all were amazing. Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNzlULW5RRRAB",
            "text": "Randomly browsing google maps was intrigued to find a singaporean street food restaurant hidden in Washington Heights so I ventured up from lower Manhattan to try it.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dmRhelJ3EAE",
            "text": "The food is absolutely delicious - the crab buns, Satay and Singapore noodles were perfect. The place is small, but cozy. It’s mad busy, but the service was warm and fast. Can’t wait to return for more ✌🏽"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaHBlMlZ3EAE",
            "text": "Loved the texture of the noodles, the laksa sauce was super flavorful, and it was really comforting and filling. If you like curry I recommend it. Will definitely have again. The rose milk was refreshing alongside this dish."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2el92azlBRRAB",
            "text": "Nice spot with very fair prices. Enjoyed trying food from Singapore.\n\nThe buns with crab sauce were our favorite. The fried wontons were crispy and delicious. The noodle texture was really good. I personally wasn’t a huge fan of the laksa flavor but it was still good.\n\nThey have counter service with seating. Maybe just our opinion but they could benefit from switching out the bright white lightbulbs to something a bit softer to make it more cozy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4djg3eFVnEAE",
            "text": "Food was decent street food, nothing special. Mung beans in the laksa was too raw though. Came out pretty fast, but in delivery containers. Place was pretty quiet at 1:30pm."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSMmRYZ2JREAE",
            "text": "One of my favorite restaurants in the area, small but always clean and good seating. I usually get the peanut noodles or Singapore noodles, but tried their new curry dish today (pictured) which was delicious. Also recommend the honey roasted pork, great value overall"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5aTZPelZREAE",
            "text": "We asked Amy - the Singaporean owner - to choose for us.\nPortion sizes were generous, and the entrees came with a lot of protein. So you could easily be fine with one entree, but you would be missing out. The appetizers are addictive. We ordered all of them - best decision ever! (Prices are super affordable, so you can totally splurge)\nThe Popcorn Chicken (see pic) is topped with these sweet/salty Singaporean cereal crumbs. The Dumplings are perfect - crispy on the outside and juicy and meaty on the inside (even the veggie ones were very hearty). My friend said he wanted to put the Crab Dip on everything, and the buns it came with were excellent.\nThe Laksa is perfect comfort food and the Satay Peanut had the boldest flavors out of the all the dishes we tried. Can't wait to go back  - want to try the Roti John next."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURta09MbEFnEAE",
            "text": "Food incredibly authentic yet cheap! Loved the peanut noodle dish, it was almost too much food. Ordered ahead and picked up, the food traveled well but will definitely need to return to try it again"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxc09UWXhRRRAB",
            "text": "I visited Native Noodles after reading a glowing review in the New Yorker (4/19/21 issue). My expectations were fully met. The food was delicious! I ordered Laksa noodles with tofu and my friend ordered Wonton Dumpling noodles with roasted…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhNTZyeFFBEAE",
            "text": "The chili crab pasta truly reminds me of Singapore. Even though this place is far from me, it was worth the trek. The pasta was perfectly cooked and the sauce was delicious. It was a little sweet for my taste and I wish it was spicier but it was still amazing. I would also get more crab meat next time for only a 1.50 more."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N1BmLWhBRRAB",
            "text": "Laksa with some amazing chewy rice noodles and honey roasted pork (+$1.5) Delicious Singaporean food made fresh and a bang for your buck in this economy. Relaxed joint with staff who mind their own business. Get the honey roasted pork you won’t regret it because I’m 😋😋😋 a happy gworl…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6Z2FhSlBnEAE",
            "text": "Everything is fantastic. I especially love the laksa soup and the turmeric coconut veggies with garlic rice. The calamansi lemonade and mango pudding are great treats too. Consistently superb"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOdWVqNEp3EAE",
            "text": "Food was delicious. Very flavorful and a lot of different options to choose from. You can't go wrong with anything that you decide to eat from here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlN3N2YWh3RRAB",
            "text": "Small, nicely-decorated spot in Washington Heights. We came after going to the Cloisters and despite coming at an off hour, the food was prepared quickly. We ordered laksa, roti john, a side of bok choy, and the pandan waffle, which was $40 with tip.\n\nThe laksa was excellent -- very shrimp-y and ginger-y, balanced by chewy noodles and fresh bean sprouts and cucumber. The bok choy went well with it. The roti john was also a pretty nice and unique snack. The waffle was simple but great, with nice pandan flavor in the kaya jam. Portion sizes were all generous and prices were on the lower side for NYC. Definitely worth the trip up for us, and I'd come back to try more things."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaZ3JxNW1BRRAB",
            "text": "Ordered through Uber eats for delivery.\n\nLovely, tasty, authentic food.\n\nAnd the lemonade was fantastic"
        }
    ],
    "reviews_count": 82
}