{
    "name": "Tryon Public House",
    "place_id": "ChIJ44_9bwf0wokR1KavbylvSlc",
    "grid": "MN12",
    "address": "4740 Broadway, New York, NY 10040, USA",
    "rating": 4.4,
    "user_ratings_total": 1390,
    "phone_number": "(646) 918-7129",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNGFtbDFZbEJvYTJRMU4xSkhaekpQZVRWTGRFRRAB",
            "text": "Great pub with plenty of seating. Tried this pub after visiting the Met Cloisters. The pub has a fun atmosphere with TONS of TVs for sports. Theres plenty of dining, high top, and bar seats. The menu has a great variety of food that can satisfy all types of people. They have fun baseball menu food and others specials too. The portion sizes are generous and well put together."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMFQzZE5SMlpsWjJSSVdHaEZUVWh2U0c4M1pIYxAB",
            "text": "We came on a random Sunday, live DJ was playing a great mix, food was delicious, fast service, awesome drink specials. Will come back soon."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wT2VIcDJUSFptVldSZlF6azVXRzlqUmxwSmFsRRAB",
            "text": "I got the french onion soup which was really yummy. Only downside is that they were playing pop music and country covers that killed the otherwise immaculate fall vibes."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRlJHaG9jWE5FZEdwR0xVbFFaMVpqVW1OdU0xRRAB",
            "text": "The Nojito was good and I only got French Fries, they could have been saltier and crispier. It’s a large space plenty of seating and the temperature is just right."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNlFXdG1OWGRyYlZaaGFUSnVWV3hYWWtSMmIyYxAB",
            "text": "We arrived just as they opened and felt welcomed immediately. The Tryon Burger was fantastic!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWd05FZENPRkJpWVhkdWFXaGxiSGRoYlhWUVVIYxAB",
            "text": "Amazing food and service! I got the Sambal BBQ Steak Bowl and it was delicious! 😋 🤤 The mild wings and French fries were amazing as well! 🤤😋 Highly recommend this place to others! 😁😁"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WGJFNTZUMGR3VjNoTmVVTnNjM0EzYmtsdlMxRRAB",
            "text": "We went here after visiting the Cloisters.  Easy walk down the hill.  Terrific Taco Tuesday with cheap beer.  4.00 PBR tall boys.  Check it out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeldYUnhNa1I0TWxsSFdFWjRWRUl4WW05U2NFRRAB",
            "text": "The bar is definitely decent, the food wasn't really that great, however our waitres was nothing less than amazing, glad I got to experience it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acGJucENlR053YTNNMFFqRm9OUzFtWkhkSVNuYxAB",
            "text": "Love this place. Great service and very attentive staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMFZtWlFSM1l0TFZsdFRuTnhRVzE2UTBaM2IyYxAB",
            "text": "Food is limited but good. Love their Mac & Cheese when asked to cook spicy with Jalapenos. W dnesdays are Karaoke days. Great drinks menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV1l6WlRkVkJZZVdVd2MwSnVSbTh6V0hoalIyYxAB",
            "text": "The Manager is amazing!!\nFirst time for my 21th birthday it was awesome, regardless I being there few times and all time perfect energy 🍻🍺🍸😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WFdsRk9iWE5aYkVObFpsOXFTVVJyYlZOdFJWRRAB",
            "text": "This place is fine. Food was okay, small portion on the lobster roll. The fries were great and seasoned well but the roll was bland.\n\nService was okay but definitely felt like the waitress was neglecting me several times."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaU1UxRnBVVVJPYVd4WFVUUnNiMXBXTFVoRGFVRRAB",
            "text": "Was there for a private event. To be fair it was crowded by bar area where the food was.   For me i don't like fried food but this was not greasy. Decent fries. Good macaroni and cheese. High stools and tables not comfortable for this short girl.    Good neighborhood pub  for local folk"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaE16QjVZbWRoVUdnNU9YRTRSa3ByUzNOWk9XYxAB",
            "text": "The service was slow yet very friendly and attentive once they had time. Smaller staff so I get it. The music was horrendous. I heard Ice Ice Baby, No Diggity and If You Wanna Be My Lover amongst other hideous songs to hit the airways in the 90s. I kept my headphones plugged in as much as possible. And then I find out there's no cognac of any type sold here. This is common in these gentrified neighborhoods where they only want a certain type of clientele. Which is passive-aggressive racism. Had I realized this when I first arrived I would've left immediately. Don't move here, open businesses here and hang out here if you don't like us. As a native New Yorker, this is wildly insulting. But, it's okay. I just won't be back. Shame on your company."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMFFteDNVbFZsTjFwU09GQTJhSEZaUzBOS1dGRRAB",
            "text": "Always great food and vibes!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVFZGVkJRMUZzTVhoMWFXRjFaVVZUWTBReWNWRRAB",
            "text": "I had so much fun, I performed here on a Friday night June 27, 2025!\nThe food is amazing, (truffle fries 🍟) no pic sorry 😞\nstaff is so kind! I had so much fun, the people are amazing. It’s New York uptown ❤️\nCheck me out @thekenyatta"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeFkwaGhlWFZRYm01NFIwbHZWelZpUmtFNWRrRRAB",
            "text": "Great burger and fries, both arrived hot and were substantial quantity. Burger was cooked as requested; reasonably priced. Great service and friendly staff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMGFFMUlNbFZKZGxWeU1FcFhWMjFvWW05b1puYxAB",
            "text": "I don’t know how this place has a high rating. Everything me and my friend got was not seasoned and BLAND. I mean look at the picture of the Tyron fries we got. They literally placed CRAFT CHEESE SLICES that were event melted well into the fries!! When I told the waitress about it she gave me a nasty attitude/tone and said “well what do you want … do you want us to remake it or what…”  Yikes. Will not be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcFlreFZTVE5zTjBKM2FVcFFaVGhLYzJsdVZVRRAB",
            "text": "l go here alot, but just hated tonight’s experience .. The host was extremely nice, but l waited forever for my food, which was just ok. The waitress however was one of the rudest l've ever experienced. When l asked for cutlery and napkins, she nastily and aggressively said 'Ok, but l've only got two hands' and walked away, when l asked for pickles she said 'can you tell me now what else you want?' .. l feel she was racist, and very hateful.\nWhat is up with this?"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNTEp0SWZmeGNuaHhRRRAB",
            "text": "A great pub house to grab some food and a drink, all of great quality. Outdoor seating available, handicapped accessible seats and restrooms and a great locally historical atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJd1FsSnZOakpMWTFwSWJrdEVRMTgyUjA0d2IzYxAB",
            "text": "Tryon fries are warm fries with kraft cheese slices which was quite disappointing but the atmosphere is always worth the visit. Lively, welcoming, and a good time. Service isn’t great though, unless you’re at the bar."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xac1JqUnZMVFpsZERCVk16Vk1WR3BzVHpZM1JWRRAB",
            "text": "Smoky burger was delicious and thick. Tryon fries were also great (note: they're pretty heavy, basically a meal in themselves). Normal fries were reported to have excellent texture: crispy on the outside and fluffy on the inside. Sweet potato burger was reported to taste excellent but the patty kind of fell apart."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOLUZxUHVpdFpHbVpBEAE",
            "text": "Great non-alcoholic drinks! And Greta burgers"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNRG9sTHpIbzZycWRnEAE",
            "text": "Great local place for appetizers and cocktails. Sat at the bar"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VORDUwZGY5cDhPa213RRAB",
            "text": "Lovely pub with indoor and outdoor seating, friendly staff!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQNml2dW5aeTZEbTRnRRAB",
            "text": "I’m not giving 5 stars to the food because the tortillas of my tacos were not the best. Overall the food was good. Very friendly staff and very nice place!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbjdPcGZREAE",
            "text": "Karaoke was fun, good crowd, all in all an enjoyable evening, will return!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJajYzMjhBRRAB",
            "text": "Great medium buffalo wings and a couple 16 oz PBR!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOXFuYVhnEAE",
            "text": "So laid back and chill. As an out of town-er, this is one of the only places I’ve visited where the bartender had time to talk to us. She even had recommendations of a local park to visit that was blooming out. Two hot dogs with chips and 2 beers was only 39$!!! Absolutely cheap compared to many other places in the city. Went early afternoon and it was nice and quiet, people reading books at the bar and working on their laptop throughout the pub. Excellent vibes, great glizzies"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MHNLTVlBEAE",
            "text": "A bit disappointed they didn't have any sour beer but a chill environment"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MExMV1VBEAE",
            "text": "The burgers are great and the steak and eggs"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcDRiRWdnRRAB",
            "text": "Really good spot"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfcDVYVmdnRRAB",
            "text": "THEE pub and neighborhood bar. Great options and fun trivia night"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcjg3LWFBEAE",
            "text": "Chill spot for a bite or a drink. Recently had their maple chicken sandwich and it was really good. Spacious, good for large parties."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaV96TWJREAE",
            "text": "The food was really good, the service was friendly, and the vibes were homey but youthful. I'll definitely go there again. The only reason I'm not giving 5 stars is that there was a hair in one our plates of fries, but that could've been a one-time thing."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnLV9HWjlBRRAB",
            "text": "Phenomenal! My niece and bf visited from Canada and we took the there to eat. We enjoyed ourselves with the activities."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMGYzSXBRRRAB",
            "text": "Nice sports bar"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2azdpOHBRRRAB",
            "text": "Excellent food, warm and attentive service, and Comfortable pub ambience make for and most enjoyable lunch last week. Excellent accessibility is also most appreciated. Looking forward to returning."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBaDdMZ09nEAE",
            "text": "It's one of my favorite bars in Inwood"
        },
        {
            "date": "11달 전",
            "language": "fr",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMmJEYTZBRRAB",
            "text": "Service très bien. Nourriture américaine classique sans grande saveur. Les frites été super croustillante."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzXzRpa0l3EAE",
            "text": "Decent pub food but pretty expensive. I appreciated the gluten free burger bun option."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMllYMEJREAE",
            "text": "Stop to see the Mike tyson fight!!  I got a couple of beers.The bartender was great in the atmosphere, which was just perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNTVPMUhBEAE",
            "text": "Stopped in for a round of drinks and an appetizer. The service was very slow, especially considering there were only 2 tables occupied at the restaurant. The guacamole was very good. The bloody mary was decent. The waitress was nice and brought us a sample of the bloody mix to test the spice level. Clean and nice atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOEtxVEFnEAE",
            "text": "Great food! Brunch is really good, big draft beer selection, many tvs to watch games, every day they have different entertainment; trivia, karaoke, markets, etc. Outdoor sitting is very comfortable, the staff is really friendly and they make you feel at home!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMXVha1NBEAE",
            "text": "After work decided to go there for a few drinks with Co-workers. We sat outside as were talking  the sitting part of the bench falls down my ankle got caught under it. The waitress comes to check what’s going on. Doesn’t offer help or checks to see if any one of us is hurt. The food we order the steak sliders the meat was super chewy did not like them and the drinks were water down. Not sure what was wrong with them on Friday but I’ve been here before the service and food were great at other times. Hopefully next time I come it would be a better experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaLVplY1pnEAE",
            "text": "This restaurant is just a short walk down the hill from the Met Cloisters, and has a great selection of food and drinks. The steak sandwich was absolutely delicious, and the fries were crispy and well seasoned. The servers were attentive and food was prepared quickly. The atmosphere was great and there were many TVs with a selection of channels on. I really enjoyed my experience at this great restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaal8tY0lBEAE",
            "text": "Came here after visiting The Cloisters Museum nearby. Very friendly service! I had the Truffle Burger and the highlight for me were actually the fries: perfectly crunchy on the outside, soft inside, and seasoned just right. The burger itself was ok but it didn't taste well balanced. Even though the patty was enormous and really dense, all I could taste was the very thick layer of cheese on top! I've seen pics of this burger from other people and it looked different, so perhaps it was whoever made my burger that day that didn't get it quite right."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6anI3QXJ3RRAB",
            "text": "Great location.  Restaurant has AC inside.  There is outside seating in the front of the restaurant.\nOrdered a house sangria - looked like grape juice, tasted like peach schnapps.\nWe ordered the guacamole as we waited for our friend.  The guacamole is not made fresh - it’s scooped out of a container & put into a mortar to give this generic guacamole an authentic look.\nWe ordered the og burger, the chicken sandwich & onion rings.\nThe burger was ok - nothing too fantastic.  The chicken sandwich was more of a bacon sandwich.\nOverall I’d save my money and eat elsewhere."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtZ3F5ajdRRRAB",
            "text": "Excellent service and massive burgers. Good selection of beers. We especially enjoy their generous happy hour: M-F  3pm - 7pm, and doesn't have to be at the bar area. Cocktail selection could be larger and more varied. Great sports bar/dive bar vibes here though! Tryon Public is definitely our favorite place to go for a drink after work in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbVpXWUxREAE",
            "text": "So far I’ve been here for breakfast/brunch twice.\nFirst time I had the eggs Benedict with avocado, but I very much disliked tasting some parts raw egg white throughout.\nSecond time the chef and waitress were so kind to substitute the chicken of the chicken with waffles for me with vegetarian tenders.\nI’m not blown away by the food, but I do enjoy the vibe and music they play here very much!\nStill want to try dinner here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0d0stMy1BRRAB",
            "text": "The location is convenient and the atmosphere is pretty nice. The food was OK but I was not impressed. Also, I think could try checking in with the tables a little more often/just being a little more attentive in case anything is needed. The coffee was not good  at all."
        },
        {
            "date": "수정일: 6년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJd3FuSDF3RRAB",
            "text": "Dopo la visita ai Cloisters del MET (da vedere!) ci siamo fermati a pranzo in questo bel locale. Personale molto gentile e accogliente. Abbiamo preso due sandwich con patatine, molto gustosi e di qualità. Porzioni abbondanti e prezzi onesti…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid2VuVmJ3EAE",
            "text": "Delightful and friendly pub where the team members get to be mixologists for signature cocktails! Our waitress created my drink “ The D” and it was refreshing and sassy! Management and wait staff were welcoming like you were regulars."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvb2REVmxRRRAB",
            "text": "Awesome place in uptown Manhattan walking distance to the MET Cloisters Museum. Great atmosphere, overall the service is really good but in special Jose that was taking care of us. Great food and drinks. Definitely come back when I'm the area. I recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMUxITXl3RRAB",
            "text": "A highlight of Tryon Public is their late night hours. Sometimes it’s the only spot open. And I’ve had some great food here, but also so pretty bland food. Depends on the day.\n\nMost recently I had a regular burger (medium rare) with a side salad. Out came a very well done burger (it was completely dry)and fries. Took a while to fix the issue because I sat outside and that rounds weren’t made often out there."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMy1EN193RRAB",
            "text": "Spent an early lunch here before visiting the nearby Cloisters Museum (free parking in Tryon park itself, if you've driven).  Friendly staff treated us quite well, the seating was good, and the food and drink excellent, and the walk, though…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdEpxUGhnRRAB",
            "text": "Great atmosphere, service, prices and very fresh tasting food. We had the burgers which were huge but could've used a little more flavor. The Fried Green Tomatoes were great but too expensive for 4 slices. The Onion Rings and Sweet Potato Fries were fantastic. Great place to watch sports too 👍"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJcFlPMXV3RRAB",
            "text": "Great place to go out with friends. Ample selection of spirits , craft beers and cocktails. I recommend “Inwood refresher”. Really great taste. At happy hours you could get a burgers at 8$ and fries are bigger than those at McDonald’s.…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnXzhMYlVREAE",
            "text": "I enjoy going to this spot in my hood. Great food, great energy, lots of beer options.  The only reason I gave it a 4 is because I think cost of food is pretty high for a pub. But that didn't stop me from getting an impossible burger from them lol. But still a bit high. Would definitely keep going though."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLdFB2eFNREAE",
            "text": "I honestly didn’t have high expectations but the Smokey Burger was one of the best burgers I have had in NYC! The smoke Gouda was incredible.\n\nWe also loved the French toast and nachos. Truly enjoyed it!\n\nIf you are going to the Met Cloisters stop here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaVlPVFlBEAE",
            "text": "Random visit to Inwood on a wet evening brought us to this little neighborhood pub. We enjoyed the atmosphere and food. Staff were amazing, friendly, efficient and just the right amount of attention. Prices are reasonable. Would visit again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eXFpR1ZREAE",
            "text": "I like this place because it's really close to me and has that pub vibe inside. They even have an outside seating area too. The food is amazing. Sometimes the service can be REALLY slow (like did they forget all about me slow) but everyone has been pretty nice. I think they pre-add gratuity to certain bills as my totals have been way higher than they should have been. So it's not a bad place but I would keep that in mind!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcDZyWVZBEAE",
            "text": "This is Fun place. Great for big groups. Fish tacos were jam packed and margarita was decent."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OWJEemh3RRAB",
            "text": "The restaurant looks stunning in and outside.  The prices were fair considering it’s Manhattan,  but the food was ok at best. My hero’s short rib were too much on the dry side, which was a bit of disappointment. The sour I ordered was…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdlBubWZnEAE",
            "text": "Very nice place, no frills. Be warned, it can get quite loud. Nice music, all 80's jams. Food was very good, got the fish & chips & the cod was nice & crispy. The Trion bread pudding was amazing. Overall very good, would recommend, especially after an afternoon at the Met Cloisters"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNOUxuRHRnRRAB",
            "text": "Was here about a week ago with my mom.Tyron Public House officially serve my favorite nachos. It was cheesy, with the perfect amount of beans, tomatoes, sour cream, and guacamole! We also ordered fish & chips which was great with the…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxOGRTRlRREAE",
            "text": "I mean... yikes on a bike. The bottom of the burger I ordered here was covered in mold. I didn't notice until my dinner companion pointed it out after I had taken 2 bites. The kitchen said they were \"just grill marks\" and totally normal. We…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdmUtQzVnRRAB",
            "text": "Having an awesome brunch here with friends!\n\nGreat outdoor seating, nice specialty menu and a heck of a uniquely great mint julip!\n\nMy friends’ had the Egg Benedict brunch item with potatoes and I enjoyed the Breakfast Quesadilla which came made with cheeses, black beans, potatoes, side of arulaga lettuce plus great guacamole and sour cream.\n\nVery nice service!  Lovely, helpful server named Jessica and a good bus guy as well.  Had everything we needed!"
        },
        {
            "date": "3년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyM0liMEpREAE",
            "text": "Très bons burgers à 2 pas des Cloisters. Les frites sont excellentes et le guacamole également. Attention aux portions copieuses à l'américaine. Le service et sympathique et attentionné."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJd2RDbGJnEAE",
            "text": "Very cozy place, near to the Cloisters, MET. You can find american kitchen: several kinds of hamburger, fries,  eggs, salads; if you go for the brunch, either the cocktail Mimosa or coffe/tea are complimentary. The staff is really nice!\nNot suggested only if you are on a diet! :-)"
        }
    ],
    "reviews_count": 70
}