{
    "name": "The Uptown Garrison",
    "place_id": "ChIJxYY-IqH2wokRySYNYm9i6dQ",
    "grid": "MN12",
    "address": "821 W 181st St, New York, NY 10033, USA",
    "rating": 4.5,
    "user_ratings_total": 690,
    "phone_number": "(917) 261-4680",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0c1YwSjFUbFpsT1dOcWJYUXRabWc1VWtRelpYYxAB",
            "text": "Stopped pass for Brunch on a Sunday. Tried the shrimp & grits and the Garrison platter. The pancakes were a hit.\n\nTheir coffe and tea menu along with the mimosas options were good too."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRk1qbDBUa0V6ZHpsMlgxSnlWekZmUTBGaU5FRRAB",
            "text": "I don’t think I’ve had as poor an experience, both food and customer service-wise, as I have had multiple times with this place. The food is overpriced even in this economy, it’s inedible and the staff is rude as hell. I tried the cheese pizza that includes chili honey and what I received was covered in so much chili honey that the heat overpowered any other flavor and the honey had made the thin crust disgustingly soggy. Messing up something like cheese pizza is quite impressive actually\n\nYou can find literally anything on their menu at a different restaurant and I promise it will be a better experience than if you had gone to this dump. Just don’t go"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdVNGaE5abmR1UTJvM01XY3dZMGhsYm5OZlFWRRAB",
            "text": "This is one of my favorite places, The atmosphere is perfect for sharing with friends. The servers are very pleasant and friendly. The food is good, and they always have great options. The drinks are wonderful and creative. The prices are very good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSFdHOXBNelk1TlhSU1FUTkRTVzEyTm5Jd01XYxAB",
            "text": "This is my go to spot to work from when I have people at the house. Great food and coffee. The only downside is that the wifi is not great, so I have to do a hotspot from my phone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GdVgwRnNaRFpuTTBoTU5qVnBkSHB5VFUxQk4wRRAB",
            "text": "Great place for brunch! Loved the pizza! Tina is a great server and the vibe is friendly and relaxed. Awesome espresso martini too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MlVHbGhWRGxxWDBvNGFXaEdSamR2VkRKb1FYYxAB",
            "text": "Been twice to dine in and once taking out. The food review here is mainly for takeout. Dining in, nice experience, had pizza, burger, salad : all pretty good. Takeout : had cauliflower salad and fries. Fries : frozen and stale tasting. Just not fresh tasty food. $10 for a container of fries ($7 across the street; I chose Uptown Garrison cuz I thought they'd definitely have fresher, classier food....) Cauliflower salad: photo shows that half the container is breadcrumbs (and I hadn't even finished separating the bread crumbs in the photo). Not a great flavor combo... The cauliflower, quinoa and walnuts do OK together but there are way too many breadcrumbs, which get soggy (and honestly, for $18, it's an awful lot of breadcrumbs and not a lot of cauliflower). Maybe the place just does better with dine in ; I will definitely not order takeout given the low freshness and flavor."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdU5IQjFkM1JCUTBwVlpqSTBaRTlrZVVaeU5VRRAB",
            "text": "The pizza here is excellent, truly the main reason I return. However, my recent visit was disappointing. During dinner, I observed three large roaches and informed the manager, who stated it was due to the open window. Later, I ordered dessert for the first time. The menu described the bread pudding as being served with caramel sauce, but it instead arrived with a coffee-based sauce. When I brought this to the waitress’s attention, she notified the manager. Given that we had already reported the roach issue earlier, I would have expected the manager to either come to our table to apologize personally or offer to comp the dessert. Unfortunately, neither happened. Overall, the food may be great, but the management was very poor during this visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSlZucGtOVEZ1UVhaSVEyRnpWeTE2UldGSlNsRRAB",
            "text": "I live super close by and the Garrison used to be an uptown institution for my wife and I, but after the COVID years, something changed and things have gone drastically downhill.\n\nWe've eaten through their menu numerous times, but frankly their quality and consistency have nosedived, and the new, muted flavors no longer match their newly inflated prices. I understand that industry competition, rising rents, and inflation have changed the game in recent years, but when you reduce the quality so heavily whilst charging so much more for something so basic ($22 for a tiny filet-o-fish clone; $17 for a chopped salad with no protein--what?!), it begins to feel borderline insulting. Garrison needs to go back-to-basics and understand what made them so popular with locals initially.\n\nI would've happily paid $23 for their old burger, but the last two times I've ordered the newer one it's been a dry, overcooked mess that can't even hold a candle to what it once was early on. Compare to Rolo's (Ridgewood) grass-fed beef, double-cheese burger which is butchered and grinded in-house for $20.\n\nCharging $8 for a side of lukewarm, somehow simultaneously soggy/stale fries that taste like they were from a freezer bag and kept luke-warm under a heat lamp just hurts my soul.\n\nTheir avocado toast (which was previously topped with thick-cut, house-made candied bacon; compared to the new stuff that's akin to Bodega bacon) used to be something special, but now it's just a depressing experience that you could easily make yourself, especially for the hefty $20+ price tag.\n\nI know that the neighborhood is in dire straights for quality food gems, but somehow the Garrison has lowered the bar that they once set.\n\nI honestly felt embarrassed after recommending them to out-of-town friends, and post-meal seeing how disappointed everyone was has made me swear off suggesting them ever again, and that hurts. I'm more than happy to pay for the dollar signs ($$$) if the quality reflects the cost, but most of the flavors no longer meet the mark.\n\nIt's no longer worth the convenience to come here as a local, as I'd rather journey downtown for a less expensive, more flavorful meal that I don't have to roll the dice on.\n\nThe only things I'll concede that they still manage to nail are their breakfast sandwiches and breakfast pancake (and sometimes their coffee in the mornings; depending on the barista of course; employee turnover rate here is extremely high so you'll see a new face almost every time you come). You should never order over-easy/medium eggs ($6) here, as they'll come out unseasoned and covered in a mystery oil for whatever reason--just zero flavor. You can absolutely do better at home.\n\nThe pizzas are pretty hit-or-miss and can be either soggy or overcooked depending on the day--sometimes decent, sometimes not, but chronically under-salted. For $20+ for most personal-sized pies, it just doesn't feel worth the gamble.\n\nMost of all, I sorely miss their old bartender lead (Courtney), as the newer mixed drinks are pretty middling and typically don't hit the highs that they once did. I appreciate what the new lead is trying to do from a creative perspective, but most of the time it just doesn't coalesce in the flavor department; he seems to be allergic to tried-and-true flavor profiles.\n\nExpect to wait long periods of time between rounds of drinks, as there's normally only one bar staff member any given evening and they appear pretty overwhelmed making drinks for the entire restaurant and bar at the same time and at times yours will get lost in the shuffle.\n\nI dearly miss the old Garrison. It's a major bummer that it's become increasingly difficult to want to come back here as time goes on with how stale and expensive it's become. I hope they can find their inspiration once again to care about what they serve the neighborhood, but for now I'll be steering clear. I just hope they can survive in the long run; I just can't merit (or afford) spending another dollar here until they fix their issues."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGd1dXNWhVSFJPTlZsaFRtSlJUVkZGTkhaVmQxRRAB",
            "text": "Nice place to sit and work, food menu is limited. I had a burger with fries, fries were over cooked. You have to pick up your own drinks and clean up your own table( very weird) cuz they are not busy at alllll. And there is a sign stating no laptops after 4pm. I feltl like we were disturbing ppl around us when me and my friend spoke to one another cuz everyone there was working in absolute silence. Its giving library vibes with a cafeteria."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gc1ZrSmhNMGd3VFd0bVZWaEtXbkJvVUhkWWVtYxAB",
            "text": "Went there on a fairly busy Friday evening and sat at the bar. Despite the crowd, our bartender was extremely attentive with our water and took careful time to explain drinks to us. (Wish I got her name, she was amazing.) The quinoa black bean burger was yummy, but the standouts were our cocktails, particularly the “lost in translation” and the “I’m Mr sun.” We will be back soon!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRMEp6R2J3EAE",
            "text": "What an incredible addition to the Washington Heights food scene! We were on our way to eat at Saggio--another local favorite--when we noticed The Uptown Garrison and decided to give it a try. We are glad we did! It instantly became a favorite. We had pizza and cocktails on our first visit, but we can't wait to return during the day, when coffee and pastries are served.\n\nThe pizzas are incredible. The crust is impeccably baked; a mild initial crunch compliments a fresh, doughy interior that is not too thick and not too thin: just right. We had the margherita and prosciutto pizzas. The latter is the best I've ever had. The incorporation of lemon juice on top of a mountain of arugla, fresh burrata and prosciutto strips is just perfect. My mouth is watering as I write this review.\n\nThe pizzas could serve one hungry individual or two less hungry individuals. We shared a salad and had one pizza each, and we were full by the end of the night.\n\nThe cocktails also were refreshing and unique, and though we sat in the dining area, there is a large, U-shaped bar area making Uptown Garrison great to come just for drinks.\n\nThe decor, with its subway tile-lined walls, mosaic tile flooring, and dim, industrial lighting, give it a chic, trendy, almost romantic downtown NYC feel, and you might feel transported to a Chelsea or the West Village in this hip (but spacious) restaurant. Carefully curated music played at an unobtrusive volume--from Adele to Otis Redding to \"Girl From Ipanema\"--rounds out the warm, comfortable feeling of dining inside.\n\nSpace is plentiful, and the restaurant is kid-friendly! At 5:30-7:30pm while we were there, there were plenty of high-chairs with children enjoying their meals, and guests and staff were not bothered by their presence. That said, you could come here and never even notice children are present (if children aren't your thing...). Due to the split level of the restaurant, you could enjoy a drink at the bar or a table in the lower section, away from the larger dining area where more families seemed to congregate. I'm sure as the night wears on, the amount of children wane--but it is nice to know it is a family-friendly space!\n\nWait-staff were friendly, enthusiastic, and helpful.\n\nOverall, I was pleasantly surprised to find The Uptown Garrison gracing the wonderful neighborhood of Washington Heights. We will most certainly be back."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNFpUVlRXRXhhVW5WSE0yeFZiVXMxU0VGellsRRAB",
            "text": "Muy buen restaurante y muy buena la comida"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSk1uRnRRMkZ2UWtrMWJWcHZRazVwUTB4TFMzYxAB",
            "text": "We came here for Restaurant Week, and we chose this location because we wanted to check out something a lil closer to Harlem where we hadn't really had the chance to explore the neighborhood.\n\nAlso they included a nice variety of cocktails with dinner, an appetizer, a main ,and a dessert. It doesn't get any better than that, all for $45 per person. I was sceptical at first but we thought that we would give it a try.\n\nThe establishment itself is very cute, I loved the black facade, and the intimate setting with the industrial lamps, leather seats, wooden beams, and the exposed brick. The hostess was prompt and friendly. We looked over the menu and chose the Old Fashioned and Golden Rush for drinks. We had the Calzonito (2 per serving, I had the sausage... Which was hard to actually see the actual sausage... I guess it was flavored in the cheese) and the Buttermilk Fried Chicken for apps (which is a large portion, great for sharing). For our mains we had the Pan Seared Sea Bass with roasted cauliflower and sauteed kale (it was well seasoned and the kale was cooked very well). For dessert we opted for the Warm Apple Crumble with oats, brown sugar and mezcal (it was warm, but would have been great with something a little creamy like evaporated milk or ice cream, we felt it just needed something to soften the dryness. We also chose the Bread pudding with sour cherries and buttermilk caramel.\n\nThe portions were huge so get there hungry. We had to get a few doggy-bags but you will definitely get a bang for your buck. Very cute spot, I loved their regular cocktail selections, I will definitely come back again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRFZ6bGlNR1JhV21kell6ZE9hRTVJVVVWVFoxRRAB",
            "text": "Happy hour is decent. Bar staff was mediocre. I think I was most surprised that in the middle of the Heights, there was not one person who seemed like they were from the neighborhood and I think the vibe of place forgot it was Uptown. Very gentrified."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWU9UWnRkRmhhV0RaaFltRkhZbGhCV0ZOS05FRRAB",
            "text": "Why do people here give 4 and 5  stars to  this place  the staff  are political  they will not treat you the same if they know that you hold republican values  mind you I had a American flag on my shirt and cap and I was watching on my…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTldsQjJVRGt0V1RWalZtVnlVM1E1Y1ZSYVQwRRAB",
            "text": "Good pizza, super good atmosphere!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psd1ZISnFXbUo0UzJSeWFsaEVOV2hIY1doMUxYYxAB",
            "text": "10/10 amazing place ! Great service and even greater food !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPWDd1Y252enMtUGpnRRAB",
            "text": "yummy across the board. shakshuka was delectable and the staff was super patient and observant. has some really cool seasonal beverages!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNTERfYkRBal92YUlnEAE",
            "text": "Used to be a decent establishment with pretty good food. They no longer provide table service but it seems that their barista counter can’t actually manage to take service either and like to miss entire parts of the order. Tipped expecting decent service, but I suppose all they could handle was standing behind the counter twiddling their thumbs (it was not busy). The food was also way overly sweet. It’s sad to see a place I once really respected and liked turn down the quality in such a fashion. I will not be returning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNakc1cUdVaDRlYlFnEAE",
            "text": "10/10 Espresso Martini\nPhenomenonal Three Cheese Pizza\nGreat local eatery"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOMndzbzM5MkpUYzRRRRAB",
            "text": "Solid little cocktail bar uptown with a decent selection of speciality cocktails. I ordered a beer as well which wasn’t cold, but it was very late. The service was good, cocktails made to order and in front of you. I will definitely come back and show some friends - great for brunch or a date night."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VORFF6SkRFdnRHbVFBEAE",
            "text": "Overrated. Not a vibe"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOM0V2NS1HOHVmZFJREAE",
            "text": "Only knew of Uptown Garrison by name but it definitely lives up to its reputation for being one of the best quality bars in uptown nyc. Stellar coffee, stellar cocktails, stellar service and stellar management. Georgia and Lindsey helped turn a regular day into a phenomenal one with their care and awesome conversations, very down to earth and fun vibes. Can’t wait to go back, definitely recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKYUhpNG0wN0kzRmlBRRAB",
            "text": "I’ve come here several times since recently moving to the area. Every time I’ve wanted to like this place so bad. The vibe is great. The people are nice (if a lil too chill, perhaps) but the food just isn’t that good. Especially since I have a gluten sensitivity and I’m limited to what I can try from the menu. I’ve had the shashuka with was more like stewed peppers and the frittata which was inoffensive but also unimpressive. My friends got the burger and a special and both times didn’t even finish the plate. I really hope the food improves, I would like to come back and be a regular but it isn’t worth it at this point."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJODQtbjZRRRAB",
            "text": "No table service. Have to get menu and cutlery on your own. You place your order at the counter. Young girl behind counter was so busy with her personal conversation that she made us wait to ask a question about the menu and then she was quite rude. Sign says to clean up after yourself. You bus your own table! I could stay home and clean up after myself. And you are expected to tip! For what?!? Never again. Not recommended."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNllPcU1REAE",
            "text": "Victoria was amazing!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOXQ2UG1RRRAB",
            "text": "The pizza is always amazing as are the unique cocktails. And the pancakes for brunch are legendary."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNna3Z2MnV3RRAB",
            "text": "Worst menu ever because almost everything has eggs in it ! Grits were similar to mashed potatoes but the bacon was great. Overall rate this place a 2/10 because it made me and my friend really sick and I have the runssss definitely wasn’t worth $90"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNna3R5Sm1RRRAB",
            "text": "I hate here with a friend and got sick from it the same day save your money"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHeE03X2xnRRAB",
            "text": "Really great coffee flavors, quiet place to work in the morning unless it's brunch. Good wood-fired pizza in the evenings (or brunch), cocktails that you can tell they've paid attention to. Super fluffy pancake for the garrison platter in the morning and fresh thick bacon. Friendly staff. Can be slightly slow when it's busy."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNzZ1YldnEAE",
            "text": "Great local place for personal pizzas, burgers and pretty much anything they have"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmM1B5OHd3RRAB",
            "text": "Gluten sensitivity.\n\nAlways a good meal and local date spot with my wife.  It's a not that large a space with low lighting for an intimate vibe.  Service is reasonably good but in the summer their patio is open which spreads around the servers and slows down the responsiveness for my experience.\n\nGluten free pizza now uses cauliflower crust which isn't as good as the normal pizza.  The sauce and toppings are always top notch but not enough to make me get gluten free pizza from here.  The crust tastes fine and is moist, but it has an unusual thickness that will deter me from get a gluten free pizza from here again.\n\nThat aside the drinks are amazing I love the names and presentations. Salads and apps are so good too.  I really like this place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmX2ZTQi1RRRAB",
            "text": "We did a large takeout. The burgers 🍔 were good but a little dry. The steak and mushrooms were excellent.   It's a nice local you'll place.  We had tons of French fries 🍟 with the burgers."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpMmFubFdREAE",
            "text": "Quality food and a fun atmosphere.  A little while back we had run into issues with the service but the last couple of years and it has been top notch"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2al9xS3dRRRAB",
            "text": "There was roach on the table and we got one of our drinks comped which was nice I guess then I guess they were doing a shift change and this waitress caught an attitude about not getting a 20% tip mind you she wasn’t serving us lol for that she should’ve got 5 dollars  that’s the roach on the floor after we killed it by the way"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQalBhQk53EAE",
            "text": "Washington Heights gem! Artisanal pizza is delightful with fresh ingredients. Brunch does not disappoint. The buttermilk pancake on the Garrison platter is a fluffy buttery sensation. You really can't go wrong with anything on the menu. Happy hour offers up a house martini that's impressive paired it with the margherita pizza and left very happy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQdWFEaHZRRRAB",
            "text": "Our visit to was a mixed experience, but unfortunately, the negatives outweighed the positives.\n\nWent with a friend and only one person in our party enjoyed their meal, which was disappointing given the restaurant’s reputation. My friend ordered a medium-cooked steak, but what arrived was undeniably well-done, dry, and far from what she had requested. Given how much she was looking forward to it, this was a real letdown.\n\nAdding to the frustration was the poor service. Our waitress didn’t check on us at all during the meal, and the only time we interacted with her was when we had to call her over. It was impossible to bring up the issue with the steak until much later, which felt like a missed opportunity for the restaurant to make things right.\n\nThe one saving grace was that I  enjoyed my dish, but that wasn’t enough to salvage the overall experience. Between the lackluster service and inconsistencies in food quality, I can’t say I’m eager to return anytime soon."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzczgzRUt3EAE",
            "text": "Best pizza in the hood!! Love this place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcFoyV3F3RRAB",
            "text": "Excellent dinner. Dates, steak and cookie 🍪 were wonderful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNWQyaE93EAE",
            "text": "At 8 in the am on a weekday, it was quiet and unassuming from the outside, perhaps due to the scaffolding. Once inside however, still quiet but beautiful! You can tell that later on, this place will be packed and knowing this its nice to enjoy a space during its quiet time.\nThe barista was very nice. Even though she was busy making other drinks, she greeted me and let me know she’d be with me soon. I was in no hurry so I sat down to enjoy the lovely atmosphere. I appreciated that she kept looking to make sure I hadn’t left. She was cool!\nThe coffee was great and I took a walk to the nearby park to sit, enjoy and ponder.\nI was very tired having not slept the night before and the coffee gave me the energy to get through a busy morning after my ponderings. Thanks UG 🍂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYM3FQR3N3RRAB",
            "text": "Hands down the best BEC I've had in months, and amazing cocktails. I stopped in at the end of a long Autumn walk from Inwood Park and the Along Came a Spider was the perfect hot cider to cap off my trek."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMXVpR2JnEAE",
            "text": "Most of the food is good,but the fried new potatoes with garlic sauce and cookie skillet are absolutely out of this world! My absolute favorite 😻😻😫 The only reason atmosphere got 4 is because it gets pretty loud sometimes inside, outside has a great view though."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYLUxIYzFBRRAB",
            "text": "The atmosphere is so sweet and chill and the wine is very nice. The bartender ignored me the entire time but she probably just wasn’t feeling well or something so I still give 5stars and hope someone else is there next time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudTlMdGtBRRAB",
            "text": "Great food. A little noisey when busy but very friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuODlUeG93RRAB",
            "text": "Great Garrison burger and kale salad with fried chicken."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNGFhVDJRRRAB",
            "text": "The food was pretty good, I didn’t like the bacon. I don’t know if it wasn’t done all the way but it didn’t not taste good to me. However everything else was pretty good especially the pancake and the eggs"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHemUtel9nRRAB",
            "text": "치킨 존맛... 피자도 존맛..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcmRqSmp3RRAB",
            "text": "Went on a late Friday afternoon after craving pancakes (which were highly rated here) and was pleasantly surprised that the brunch menu was still a thing until 4pm Fri-Sun. I sat at the bar and Jeffrey was the best! Been staying in The Heights since January and I’m so sad I just discovered this place. 🥲\n\n- Pancakes 🤤\n- Cocktails 🤌🏾\n- Service 💯\n\nCan’t wait to go back, try the pizza and run through the rest of the cocktail list. Also excited to try their partner Italian restaurant Saggio down the street. This is one of my new favorite uptown restaurants."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMk11U0F3EAE",
            "text": "It was a quaint eatery in the heights. Our waiter Jay was friendly, swift, and precise. The chicken was flavorful, juicy, and not salty. The waffle was crisp but a bit sweet for me. The pancake was fried to perfection with crisp edges. Once you bit a piece, it'll melt in your mouth. Each meal was filling. It was a really good brunch, and it lasted past 3pm. Please check this place out. You won't regret it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdE9iNjZnRRAB",
            "text": "Went for brunch today and the food I had was pretty mid. The fries were cold and hard (like they had been sitting out), and there was a weird smell I kept catching wind of (smelled like mold/damp, possibly from the kitchen or garbage coming in from the curb/street). Unless you are getting pizza I honestly wouldnt bother with this place. The passionfruit mimosa I had was good but every glass they served was less than half way full (weird/cheap?). The butternut squash soup also had a weird texture and wasn't smooth or creamy, more like baby-food. The servers were not particularly friendly and seemed to be more concerned with socializing with each other and guests than to provide attentive service. I also had this very strange \"apple crumble\" dessert which was warmed apples in cinnamon which were dry (very off putting texture) and served with small bits of granola on it, basically felt like eating warm tongues. I also had to order vanilla gelato separately, it doesnt come with it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0cjdmNHN3RRAB",
            "text": "Perfect local spot for laptop work paired with excellent drinks. The seasonal \"I Love You a Latte\" (strawberry mocha) shown here is divine. Not too sweet! Just enough strawberry 🍓 to make it a special treat. Love Garrison!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkaFBTbld3EAE",
            "text": "This is one of those special brunch spots in Washington Heights we absolutely love. Our team, along with some of my friends and I, have gone here so many times, and we're always so obsessed with the food that I forgot pictures. They always have amazing pizza. Today my friend I went for brunch and it was everything. I think they make the nest pancakes in NYC. If you come here and don't try the pancake, you're missing out. It's delicious. Buttery, crunchy on the outside but soft in the inside. Everyone loves it here. The lentil soup with a side of sourdough bread was perfect, hearty, and fulfilling. The kale salad is my favorite salad. It's delicious. My friend loved her avocado toast with eggs on top. They also made the best cappuccino and Chai lattes. This is a must if you're in the heights from brunch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbFlQTjNBRRAB",
            "text": "THE GARRISON PLATTER IS THE BEST PANCAKE/ BREAKFAST PLATTER IN NYC. I have tried many diners and brunch spots but this pancake reigns absolute supreme! It’s crispy on the outside with the fluffiest interior topped with the most delicious jam and fresh fruit. The first bite is always magical. The bacon is thick cut with the best balance of seasoning! I’ve been coming here for years on an almost weekly basis for my pancake fix. It’s truly ruined any other pancake I’ve tried since."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNTUyWTJnRRAB",
            "text": "This is a new spot that opened in November. We went to visit around lunch time to check them out. They have two doors, the one on the right goes into their cafe area, and the door to the left goes into the bar area.\n\nThe two areas, cafe and the bar are connected in the inside. The entire space is open, so it doesn't matter which door you walk in from. The cafe side is smaller, but still have have a good amount of space and seating. I liked the wood ceiling, making the area feels warm and cozy.\n\nWhen we got to the cafe to get some food and drinks, the staff told us that they do not offer hot food during morning or lunch hours. We were a bit disappointed...and hungry since we were planning to have lunch here. We decided to just order several baked goods and drinks so that we can still get the experience of \"dining\" in here.\n\nWe got a muffin, two cookies, and a croissant, all to share. We figured it will be enough to get us full, with a large cup of latte. They were actually pretty good, not too bad. The lattes were really nice, we enjoyed them a lot.\n\nSince we didn't get to have a \"real\" or hot food here, we decided to go back during the dinner time. The cafe seating ends at 4pm, so that they can start to prepare the entire space for the dinner. The cafe side also become the part of the restaurant, no longer a cafe. With that, the entrance that leads to the cafe gets locked.\n\nTheir menu is kind of small, and that could be because they are still new. Maybe the menu will grow as their business grows. We got some cocktails, Buttermilk Fried Chicken and Meatball Classic pizza. They were all pretty great.\n\nService was great, all the staffs were efficient. We had a very pleasant dinner experience here. I thought the price point was great, and the quality of the food and drinks were high. I would definitely go back for more cocktails and food in a near future for sure! Read my full review of the restaurant and food on my food blog, foodlovergirl."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtblB2Y3dnRRAB",
            "text": "Had the great opportunity to visit this restaurant today. It's a quaint New York restaurant that is very warm and comfortable when you enter. Remember, you must show proof of vaccination.  After being cleared, I was able to order my gingerbread latte coffee. It was beautifully prepared and tasted amazing!  Ivan looked at ordering The turkey sandwich and a glass of wine. The turkey sandwich was amazing and it was buttery and rich. The wine was light and crisp.. My sisterand I ordered a second glass when our meal was done.  Overall I really love the ambience and the warmness of the restaurant. I definitely would come back for their brunch menu on Sunday."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLbVl2VC1nRRAB",
            "text": "The Uptown Garrison is a solid neighborhood spot with a nice vibe. The food and drinks are pretty good with a super friendly staff. The broccoli and kale soup special is outrageously delicious!\n\nThe Garrison was also truly here for the community during COVID. Nice outdoor seating setup and very clean."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoODh1TmRREAE",
            "text": "Neighborhood gem in Washington Heights. This restaurant is so comfortable, hammered metal bar hand cut subway tile edison bulbs. Great to have a drink alone or with friends. The pancakes are not to be missed with crunchy edges and compote topping. Cannot wait to try the Pizza 🍕…"
        },
        {
            "date": "2년 전",
            "language": "sv",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bS1UY0RREAE",
            "text": "Outstanding ! Excellent location for a pizzeria and bar that’s off the beaten track close to A-train [181st subway station], on the Uppermost Westside of Manhattan’s Washington Hts. Great booze for in-dining pizza and other delicious things tacked with it. Including the beer! On draft … Classical Sverige.\n\nUtestående! Utmärkt läge för en pizzeria och bar för ligger utanför allfarvägen nära A-tåget [tunnelbanan 181:a], på den översta västsidan av Manhattans Washington Hts. Bra sprit för in-doning pizza och andra läckra saker med dem. Inklusive öl! På utkast … klassiska Sverige."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPX1lic0hBEAE",
            "text": "This is one of my local bars. Service is good, the staff are very friendly and welcoming. You can either walk in or do reservations.\n\nMornings they do coffee, pastries and breakfast bites.\nAfternoon, lunch/dinner, appetizers and happy hour.\n\nTheir cocktails are decently priced, and good, I wish to have more variation but they do the work.\nThe ambience is very nice and cute.\nPerfect for a solo visit, a date or simply hanging out."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBeWNXRUlnEAE",
            "text": "Coffee-shop by day and restaurant by night.  The Uptown Garrison is one of Washington Heights newest addition to the restaurant scene.  The Garrison has been open since November of 2017, and is already a hit with the neighborhood.  This beautiful establishment is decorated with wooden ceilings, eclectic light fixtures, and an intricate tiled floors.\n\nThe Garrison opens everyday at 7am and offers a daytime menu that includes soups, sandwiches, coffee, and FREE WIFI!  I can see this quickly becoming a go to spot for freelancers, students, and others during the day.  Dinner and cocktail service starts at 5pm and their menu includes their signature Buttermilk Fried Chicken, Brick Oven Pizza, and Wood Fired Squash.\n\nAny time I visit a restaurant I typically try their signature cocktails and take the server's suggestion based upon my liquor preference.  My server had recommended the vodka based Ginger Mint Lemonade if I prefer white liquor.  The cocktail was so smooth and refreshing that it didn't last long because it was so delish!  The pricing for their cocktails are reasonable, and the particular one I ordered was only $10.  $10 specialty cocktails drinks do exist in Manhattan!!!!  My second choice was the gin based cocktail called The Business, but overall the Ginger Mint Lemonade was my favorite.\n\nFor dinner my husband and I started with the fried potatoes which were seasoned perfectly and came with aioli.  The aioli was so good and I would literally love to dip everything in it.  We decided to just split a pizza as well since we were not very hungry.  We opted for the Italian Sausage pizza inwhich they used house-made Italian sausage.  Also, my husband is somewhat of a picky eater, and likes to stick to the basics.  The pizza was the perfect size for sharing between two people.  The Garrison has 12 different types of Brick Oven Pizzas to select from, and includes some vegetarian options as well.\n\nWhile I was there the server forced me to order dessert.  #ThingsDomNeverSays.  The server mentioned on their dessert menu they had bread pudding, beignets, and then whatever else she said after that did not matter.  I heard beignets and I was all about it.  This pillowy decadent dessert left my husband and I almost battling to the death for the last one.\n\nOverall I am truly glad I made the trek to The Heights for this amazing establishment.  The servers were attentive, personable, and had great recommendations.  This is a great place to grab a cocktail or a cup joe, have an intimate dinner, or even bring the kiddos.  It is also located give or take a block from the 181st stop on the A train.  Have you been to The Garrison or have a favorite restaurant in The Heights?"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3d0lPUU13EAE",
            "text": "Solid 4 stars for me.  People that took our order were nice, and the meatball sand which was killer (and wasn’t supposed to be available until 11am but they let me order one at 10am).  My significant other would have rated a 3.  Her coffee…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4Z2N1NTdRRRAB",
            "text": "Amazing quality food if you're going for brunch, pizzas and cocktails are great for dinner or lunch. I had the platter for brunch and the family had the breakfast sandwiches, they all loved it and pricing was decent ($80 bucks for 5 of us). The food was also very filling!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleGJUYXN3RRAB",
            "text": "We stopped in for a quick coffee, but then realized how nice it was. We sat for lunch  and everyone enjoyed their food! The burger was cooked perfectly, turkey sandwich was not dry, and drinks were all on point. If your in the area, worth a stop! Service was great as well, very nice people."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bHJXOXFBRRAB",
            "text": "Fantastic local spot for wood oven cooked pizza. Pictured here is one of their gluten free pizzas, which are spectacular. Super crispy, ample toppings and delicious.\n\nHave a revolving selection of non-alcoholic cocktails and beers, which are creative and well crafted."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzd0t2RlJ3EAE",
            "text": "This place is very good for eating.The Uptown Garrison works for pretty much every dining situation. We say “pretty much” so you don’t complain to us after showing up to this all-day spot in Washington Heights looking for a white tablecloth restaurant to celebrate an anniversary or a divorce. But from breakfast on your way to work or fried chicken with a group to cocktails and pizza with a date, this restaurant and bar a block from the 181st Street A train is one of the most useful places to know about uptown.\n\nAt last, I suggest you to try to eat in The Uptown Garrison."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MDVqQ1h3EAE",
            "text": "These photos don’t do justice. Amazing! Wow! I LOOOOVEEEE brunch on Sundays. And this place I heard a lot about from a girl who lives in Florida, not even in NY, and she loves it here. She’s crazy about it so today we had to try it and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCeVl6NzhnRRAB",
            "text": "Can never go wrong with this place. Come here for brunch, lunch and dinner.\n\nPrices are reasonable and portions are just right. My wife and I shared the garrison platter for reference."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cE9ibWFREAE",
            "text": "Very nice spot for a coffee or some eats. The sourdough was delicious, both solo (a-la my friends order) and with avocado on top (as per mine). Tables are self bussed, coffee is fresh, lots of water available. Wifi was not connecting, as is the way of things. Handy for a bit before catching the A train just a two kin walk away."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURac3JPaTdnRRAB",
            "text": "Stopped here for a coffee and a doughnut. Both were absolutely delicious. Will be happy to go back. Atmosphere is friendly and welcoming and people here are very welcoming."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4c2JicllBEAE",
            "text": "A well-kept secret in a great spot, and a bit of a chameleon: in the mornings, stop in for pastries and coffee, work remotely or linger over a killer brunch Fri-Sun. (Get the pancake!)\n\nIn the evenings, it morphs into a lovely spot for delicious pizzas, etc. (Don't miss cauliflower salad and the brussels sprouts!) A thoughtful selection of wine, and specialty cocktails made with attention to detail -- try something that piques your fancy or know your standard G+T or Negroni will be a notch above.\n\nUpon request they will stay open and cater a late night special event with a fantastic vibe. Friendly, easy to work with, and delightful!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwekliTFNBEAE",
            "text": "The portions are small for delivery but the food is really good especially the pizza. I would eat here in person next time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaElUVjRRRRAB",
            "text": "I’m not a chicken and fries kind of human but sometimes you crave it… and you always have to listen to your body ;).\nMy favorite drink is the French 75.. wow.  Potatoes and garlic Mayo were really…"
        }
    ],
    "reviews_count": 72
}