{
    "name": "Le Chéile",
    "place_id": "ChIJpSkMPqH2wokRfy_b2yucueE",
    "grid": "MN12",
    "address": "839 W 181st St, New York, NY 10033, USA",
    "rating": 4.4,
    "user_ratings_total": 1042,
    "phone_number": "(212) 740-3111",
    "reviews": [
        {
            "date": "4일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdlJYSlVXbk5rY0ZCcFZsWXdlV04zU0dkWVprRRAB",
            "text": "Excelente"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4R1RHVXhUa3RWUkhKb1VXZFlXVU5FYm1OM01VRRAB",
            "text": "A beloved neighborhood favorite with wonderful pub dishes.\n\nWe chose to rent out the upstairs space for a wedding party and couldn't have been more delighted with our choice.\n\nJenn made everything super easy for us in terms of locking in a date, menu, and pricing. On the day of, she kept everything running smoothly. During an impromptu speech she and the team prepared a champagne toast. She even helped us cut and distribute cake when the time came.\n\nIn addition to Jenn, her team, Alexis, Forest, and Daniella, made sure our guests had all the food and drinks they needed.\n\nWe had such a magical night thanks to their efforts. We cannot wait to come back again and again with our friends and family."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MlpVSTNWWGxET1hoNlpFdG9YM0ZrZDFOdWFGRRAB",
            "text": "A lovely place to sit outside and enjoy a happy hour glass of wine that costs $5. Lovely service. Tasty salad and garlic fries."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRmFpMTBaVEV4WlMxcmQxVnZWemxSWjJ3d1FrRRAB",
            "text": "Walking by randomly stopped to grab a quick bite with a friend, outdoor seating was perfect, veggie burger (chickpea) burger and sweet potato fries, both delicious and fresh! Will visit again to try other menu options!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocmQyUkxjVlZXVTFkSVpYaFpVazV2VjFSbE9VRRAB",
            "text": "Le Cheile has fallen off since 2023.\n\nWarm beer, Bad food, and Hit-or-Miss service.\n\nReally would like to see a new business (with new ideas) take over."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPV1Yzc0gybVlhUUlREAE",
            "text": "Le Cheile has long been a cornerstone of the neighborhood—a warm, welcoming spot that helped shape the area’s identity. Though it’s been a while since my last visit, I still hold a deep fondness for its tasty food, spacious layout, and the added bonus of being just a short walk from the George Washington Bridge view.\n\nSince I haven’t been recently, I can’t speak to the current service. But during my many visits in the past, the staff—especially during the Joey, Chris, Helen, and Amanda era—was always friendly and close-knit. Service could be a bit slow at times, more out of friendly chatter than inefficiency, but overall it added to the charm."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLckJ5YWlVXzgtU3FRRRAB",
            "text": "Came here for my wife's birthday. Reservations for a large group are difficult in Washington Heights, obviously, but Le Cheile was able to accommodate us in their upstairs space. We had a lovely time: the food was excellent and we were well taken care of."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKWGloSlg2eTlQRnZnRRAB",
            "text": "The Worst Steak and Eggs I’ve Ever Had\nI rarely leave negative reviews, but this was beyond disappointing. I ordered the steak and eggs expecting a classic, satisfying meal—but what I got was barely edible. The steak was overcooked, dry, and oddly rubbery."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLVFByNm5aMVBxNmp3RRAB",
            "text": "Not a bad little Irish pub. The food is fine, the beers are little warm to be honest, but the inside is cozy, nice, and it’s a fun spot to hang out and have some appetizers. Not a bad spot, and I might come back at some point. One note, for larger groups (we were 5), they do not split the bill."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcXJuM19RRRAB",
            "text": "Updating 5/10/25 portions have shrunk and the price has gone up.  The Mac and cheese used to be my favorite thing to buy here but the portion is about 2 to 3 spoonfuls of Mac and cheese now and the price went up.  The wait staff is the best thing about this place.  But unfortunately I will not be going back.\n\nUpdating my review as of 11/2/24 ordered ahead on grubhub arrived when the bar said to arrive to pickup at 6:55 pm (placed order @ 6:25pm) waited until 7:25 pm to finally get my food. This is unacceptable. If I was seated you mean to tell me I would've waited 1 hour to be served? I understand that kitchens can get overwhelmed so in that situation shut off delivery pickup options until you get it under control.  It's 100% an option any restaurant has but greed over rules"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdlpmeTlBRRAB",
            "text": "Had an awesome lunch here the other day. Service was good too! Cute place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOF8tUVFnEAE",
            "text": "Have met friends here on visits to the city for over a decade. Great food, neat space, excellent Guinness! Delicious shepherds pie."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHal9PWTVBRRAB",
            "text": "Good solid place for a new and a burger."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LTlUZDBBRRAB",
            "text": "Le Chéile is welcoming to all people. From live Irish music to cover bands, karaoke to drag shows, watch parties to private events— they do it all. Most importantly the people that work there keep us coming back. Todas las personas son bienvenidas y muchos miembros del personal hablan español."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dllfdEZREAE",
            "text": "Guys I’ve been a die hard Le Chéile girlie for over a decade… it pains me to say that the food ain’t it anymore.  Idk what happened, but the food game has to be stepped up.  Or maybe I just keep ordering the wrong thing."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaZ0lXVlJBEAE",
            "text": "Ive visited Cheile in the past and have had good experiences. Unfortunately, this time was not that time...\nI ordered a lamb burger and was not asked how I wanted it cooked. Burger came out practically raw! 🤨\nI asked to return burger and order something else. Waiter took burger but never came back to take second order. I left today truly disappointed with Cheile and not sure if I will return."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcDg3Qk13EAE",
            "text": "A great place for a pint"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcEptVUNREAE",
            "text": "Nice place. My burger was too cooked and the waiter was super concerned and kindly fixed the issue."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcVlpS3pBRRAB",
            "text": "My second visit here.  The food was so-so, the atmosphere rather sad, and the service unremarkable.  No reason it shouldn't be better."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aE1HOVpREAE",
            "text": "Beware this business calculates tips based on the total of the bill including tax. So, you might think you are tipping the waiter 20% instead you are going to tip them 28%. This is sleezy and you have to calculate the total before the tax yourself in front of everyone and the servers giving you a look..."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaDhxbnFnRRAB",
            "text": "Friendly neighborhood bar. Family friendly with good food. Great wings and the entrees are tasty. First time back since covid but will be back soon."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbDhMNG1nRRAB",
            "text": "Incredible staff, great atmosphere and amazing decor! Loved every minute there!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdDVIa0dBEAE",
            "text": "Nice, relaxed spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbzVIY0pREAE",
            "text": "$18 for mostly potato on a water based “shepherds” pie (it’s really a cottage pie) is crazy, but they pull a good Guinness and the service is great. That back kitchen can use some work for sure"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaUliSzN3RRAB",
            "text": "Been here quite a few times and tonight came here for a drink and was harassed by a woman who claims works there. She has red hair and glasses. Very unprofessional and started arguing with me. Will def not be back and do not recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubmJLZHJBRRAB",
            "text": "Had a wonderful time at le cheile I am a repeat customer and highly recommend. I’ve gotten to know many of the servers but I love when Anna is my server because she is very attentive and positive to talk to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubFlPdTRBRRAB",
            "text": "I absolutely loved my time at Le Cheile. We had the most amazing waitress, Anna, who made us feel so welcomed and attended to. We can’t wait to come back, and hope we get to see Anna again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuLUw2azhRRRAB",
            "text": "I was shocked by the unprofessionalism I experienced at this establishment. My girlfriend and I were at the bar when an employee (Short red head) without any justification, accused me of making them feel unsafe. I was immediately asked to leave\n\nAfter I had already paid my tab and was preparing to leave, this same employee approached me to tell me I wasn’t allowed back. This accusation was completely unfounded The way this entire situation was handled—without any communication or fair treatment—was both embarrassing and unacceptable.\n\nI understand the need to maintain a safe environment, but there was no attempt to verify the claims, hear my side, or handle the situation professionally. For an industry that thrives on customer service and fairness, this kind of defamatory behavior is shocking. I left deeply disappointed and will not be returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudUxPUjd3RRAB",
            "text": "Just had brunch here. Kids Mac and cheese was penne and not really mac and cheese (if I had to guess it was more of an on the spot improvised roux). My grilled chicken sandwich was dry, burnt, and smaller than the last time I ate here. The salad the accompanied it was exclusively wilted arugula. Disappointing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIa2NLMEFREAE",
            "text": "This place used to be so much better. The staff have no personality, the menu is uninspired and now there is no real reason to go here.  Such a shame, it used to be so vibrant and inspiring."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3emR6eFV3EAE",
            "text": "Great vibes!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3alkzS1RBEAE",
            "text": "I came to this place together with a friend. We had 2x2 cocktails. When I was making a payment I was asked if I’m alright to pay $XX for cocktails I ordered. During the payment I noticed that in my receipt an additional cocktail was added.…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJenY2T1pnEAE",
            "text": "Food was amazing ! I had the salmon filet with green beans, mac n cheese. 🤗…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvMmF1ZXRBRRAB",
            "text": "Still a fun neighborhood pub with good beer selections and helpful staff. Sometimes live music which is appreciated. But the quality of the food is not what it was, yet the prices are still on the high side. Some of the old favorites are no longer on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycDlHSG5nRRAB",
            "text": "Best Guinness in the city for sure. Mozz sticks were great but marinara sauce was not. Fish and chips good but tartar sauce was very watery. Friend got chicken plate with brussel sprouts (they were not trimmed) and mashed potatoes (gravy was broken for sure) and said it was horrible. chicken sandwhich ok. I wouldn’t get food here again but liked the bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNmViZG5RRRAB",
            "text": "Kennedy ,Maria and Ronaldo are great had so much fun … will visit again soon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyd1pILU5REAE",
            "text": "Great place should have the USA flag but go and enjoy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMZ2JqX3FBRRAB",
            "text": "Has a changing table! 🙌🏼 great service and environment. Only had drinks so can’t comment on food. Drinks were good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcEw2VWtBRRAB",
            "text": "Lovely vibe. Cocktails not so great. Service excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdUlidDF3RRAB",
            "text": "Can't speak on the food since I haven't eaten here in years, but its a great local pub in the neighborhood I use to frequent here years ago and recently visited during a night with the bois and its just a nice chill place yo drink"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbU9TWkxBEAE",
            "text": "Really cozy bar, with friendly staff and good, solid irish type food and drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MjVlVE9nEAE",
            "text": "Stopped in while touring the area at 1:00pm on a Wednesday afternoon. Bar was recommended by Sgt. Rivera of NYPD a few blocks away. Glad he told us to try the mozzarella sticks - yum!\nNice, old world, two story bar with local vibes - away from all the tourism. George Washington Bridge is a short walk away.\nCan’t wait to visit this area again soon and hit bar up at night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6emRMNnlRRRAB",
            "text": "I used to come here in the 90 s and the service and food were a 100 times better  how can you not carry food that would be in any grate but no steak no pork chops no lamb chops no nachos no steak sandwich the managers that run this establishment had ruin this pub hope they go back to its roots"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdmRIX2lnRRAB",
            "text": "On a whim, I stopped in as I've always been curious passing by. Very pleased with my meal. Waitstaff was very helpful. I had the Guinness and fish & chips. The chips were standard fries, so on the OK side. The star was the fish, as it should be. Great cook here: juicy, flaky and well seasoned batter. The tarter sauce really helped give it a great complete bite, although the fish can stand on its own just fine. One of the better fish & chips I've had in a while. Recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcmFXWFRREAE",
            "text": "Full British Pints and the food is good too..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdm9DMlJnEAE",
            "text": "Awesome!!!!! Only Way To Describe It!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcUlTQmR3EAE",
            "text": "We were there yesterday after a college graduation close by with 16 people. The service and food were great. I highly recommend it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeUpQSEZBEAE",
            "text": "I’m usually pretty understanding of when hiccups happen in service but our server was rude and they got most of our order wrong multiple times."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUcktqSUdBEAE",
            "text": "We go to Le Cheile several times a week. Occasionally we go elsewhere in the neighborhood, but we usually end up regretting it. Only at Le Cheile is our day brightened by the kind and curteous waitstaff, always attentive without being pushy, we know that we are being taken care of. We hate to play favorites but Anna is the best! Whenever Anna is here we buy more drinks and eat more food, she makes the best reccommendations and is great at reading the mood at our table. At the same time as we love Anna,  we could not speak more highly of everyone who works here: Anna, Forist and Lizzy are the best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUeUlQa3pRRRAB",
            "text": "It's a fun Irish pub with a great atmosphere. They often host events like comedy or live music. The vibe is great. The bathrooms are about as clean as you'll find in a NY bar. The food is okay but worth it for the vibe. On the menu, it says the cheesesticks are the best in the world, and they're not. But the curry is delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqd0xma213RRAB",
            "text": "First time here and I live right in the neighborhood.. I ordered the delicious  Irish battered fish and chips and a Arugula salad with grilled chicken, cucumbers,avocado with green peppers. So good! I'm definitely returning Total five stars here. Wonderful service. Friendly staff. A pleasant neighborhood spot to just chill and have a nice dinner and drinks"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4di1EaTRRRRAB",
            "text": "Great food and drinks. Long wait time for entree. I was told that there was a kitchen mix-up. I ordered the entrée first, then my appetizer. The appetizers arrived. My guest's entrée crab burger arrived. But not my crab lobster ravioli. The table that was seated ten minutes after us steak sandwiches arrived before the waiter decided to ask if everything was OK. Then I informed him of my missing entrée. To which he then checked and inputted my order, and I had to watch my guest eat while I waited ten minutes for my food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MU5QZGJBEAE",
            "text": "Dropped in here for a bite while waiting for a tow after my truck broke down on  the GW bridge entrance. Walked in and felt very cozy & quaint. I’m loving the bar setup & vibes. Got the corned beef hash for $18, add Mimosa for $2 more.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeUxmaUtREAE",
            "text": "The love of my life brought me here for a birthday dinner date October 30, 2021! We had a phenomenal waiter, Forrest! He was just wonderfully personable and helpful. The food and drinks were delicious and we just had a blast. We sat outside and loved it. It was beautifully decorated and the heaters were on. Everything was just perfect! Birthday Dinner in Washington Heights >>> We had brussel sprouts as an appetizer. I had a delicious vegan burger and my guy had a lamb burger. Our drinks were a strawberry 🍓 margarita and a warm spiced liquor!  Everything was A-1! Make sure you ask for Forrest! ⭐"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aVp2elBBEAE",
            "text": "They cheap drinks, $4 drafts. Fish and chips had a strong fishy smell. Friend ordered burger medium and it was well done and slightly burnt. Go for drinks, not food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMVplR1J3EAE",
            "text": "Every dollar was worth coming here. I came for a comedy show originally with an intention to go to a restaurant beforehand, but I was super late, so I ended up eating here. I was so surprised that they had bruschetta and it was absolutely exquisite. The comedy show is great and the people around me were so kind and full of laughter!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtOUxlbFR3EAE",
            "text": "Old school Irish pub. Locals having late lunch Tuesday afternoon. Cheap drinks until 7pm. Irish stew is good and filling."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybHViYWxBRRAB",
            "text": "We are a Hollywood Smile Photo Booth rentals company in New York City and had a wedding celebration here on the second floor. The guests had a lof fun, food was delicious and stuffis super friendly. Photo Booth was a great addition to the party."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2MllqMjhRRRAB",
            "text": "Love the veggie chilli!! The place has shabby chic and cozy vibes. At the top floor, depending on the seating, you can get a direct view of GW bridge (looks great at night). Have not been there in covid, but have placemats of parchment and give you crayons. You can let your inner artist out. They even use the good eclectic ones as decor."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdzlmN1p3EAE",
            "text": "Le Cheile is one of the best happy hours you’ll find in Manhattan.  Open - 7pm, 7 days a week their exceptionally tasty house ale is $3.  Great place to hang with friends or do some work with a cold pint for company.  Good food menu as well."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxeVBmNFN3EAE",
            "text": "I love this place, one of my favorites in Washington heights.good service and the crew treat you as always knowing you that's lovely. Good drinks and food."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjbjZqSURREAE",
            "text": "did ownership change or is delivery quality subpar to sit in? ive been here before and had the best mac and cheese a couple years ago, now i ordered and its water cheese sauce on elbows and some last minute jalapenos chopped on top. I also…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBaThIcnpBRRAB",
            "text": "In a neighbourhood desert of decent pubs, this a gem, which we stumbled upon.  Did not eat there (but we're going back to because the food looked delicious) but the atmosphere is warm and welcoming. Full restaurant upstairs. Close to the George Washington bridge. Lovely pub."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcHB1N1pnEAE",
            "text": "This was my third time attending Le Cheile. This time around it was beautiful cause we had my best friend retirement event at Le Cheile."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMThpWVN3EAE",
            "text": "Tonight's visit to La Cheile was unfortunately less than satisfactory. From the moment we entered, the service was lacking. Our waiter seemed inattentive, walking away before I could even finish ordering, and failing to confirm if we needed anything else.\n\nTo add to the frustration, our food order was completely mishandled. Not only did we receive an extra order that we had to send back, but when our food finally arrived, my lamb burger was served raw. Upon bringing this to the staff's attention, it turned out our entire order was wrong.\n\nWe requested to speak with the manager to address the issues, only to be informed they weren't available that day. While the correct order was eventually brought to our table, the overall experience left us with little appetite and a desire to leave as soon as possible.\n\nAdditionally, the lack of transparency regarding the happy hour special, which I only noticed due to the oversight with my drink order, was disappointing. The drink menu was hidden behind table items, making it difficult to discover.\n\nIn the end, we opted to take our leftovers to go, feeling unsatisfied and disheartened by the experience. I hope the management takes this feedback constructively to improve their service and overall dining experience."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVeVpPLTl3RRAB",
            "text": "I was very disappointed. Worst pub food I’ve ever had and I’ve had lots of pub food. After waiting 15 minutes to be served we finally got drinks. I had a $6 beer which was good but then our food was awful. I had fish and chips and my…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpOHBYczJ3RRAB",
            "text": "Fish and chips redeem this experience. The Black and Tans were.... they also didn’t have a few key Irish staples. But the service was kind and the chef excellent!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLMmFhWU13EAE",
            "text": "This is a great bar/restaurant. Delicious food and a nice happy hour!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJdXFMSlNBEAE",
            "text": "As Irish as you can get in Wahi. Public house with hearty grub. Great spot for a date or a drink. Maryanne is the best bartender !!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtaDdxejhBRRAB",
            "text": "Second time....and 2times a disappointment. Delivery took for ever. Food was cold, small meat burger, not enough fries, two top buns. Not worth the price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdHZ1SW53RRAB",
            "text": "This place is a good, standard Irish bar, serving all the menu items you expect. I had the lamb burger and several drinks. The burger was absolutely flavourful and cooked perfectly. It was cooked medium rare and seasoned well to bring out…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbFo3UzJBRRAB",
            "text": "Good atmosphere and live music. Good selection of beer. Don’t come for the food. The menu has depth — I ordered the lamb burger and a friend ordered tilapia. However, I did not find the food to be good at all. It wasn’t bad, but the food was just so incredibly plain and all dishes looked like they had been hurriedly put together."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOXI2dGFBEAE",
            "text": "Live music (that's actually good) a couple of times a month. A decent cider (some on tap, though not on their menu - tip: actually go into the bar to see what they have). Food is variable from medium to excellent. Atmosphere is wonderful. Plenty of (covered) outside seating (in individual booths) is available. Lovely upstairs too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwN01HQU9nEAE",
            "text": "This is a great everyday bar to go to. They have fantastic drink specials all days of the week. I can't complain about any of the food, but I would say that some of it is a bit plain. I've had success with the Irish food selections that they have, but some of their standard bar food is lacking a little bit. How does a burger not come with a single topping? I still make my way to this place a couple times a month though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NmVXTmRBEAE",
            "text": "Very consistent uptown pub. No frills, not overly priced, some decent specials that rotate, basic pub food along with Irish fare. Rarely empty which in my mind means they do a lot right for a lot of people. Shot and beer specials are good. No complaints over the last year plus going. Will continue to frequent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoM3ZQeTV3RRAB",
            "text": "My family has been getting together at Le Cheile for years.  Recently we hosted a surprise party for my parents there and it was a great event.  It was extremely easy to coordinate, the staff was friendly, it was a great space, and the food was great as always!  We included meat and vegetarian options for the guests.  And then we were able to bring the party downstairs into the early hours!  Really loved our experience there and will continue coming back for drinks, meals, and meet ups!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxMXNPalN3EAE",
            "text": "Excelente sitio para compartir, un espacio maravilloso para sus eventos, una excelente atención..!!"
        }
    ],
    "reviews_count": 77
}