{
    "name": "Malecon Restaurant (175th Street)",
    "place_id": "ChIJHyYvn5_2wokRKyOPOJ53zWQ",
    "grid": "MN12",
    "address": "4141 Broadway, New York, NY 10033, USA",
    "rating": 4.4,
    "user_ratings_total": 3942,
    "phone_number": "(212) 927-3812",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aV2VtVlZUbmhsTVRBd2QyVnBka2Q0VjI5WFdVRRAB",
            "text": "tried dominican food for the first time - am obsessed!"
        },
        {
            "date": "수정일: 14시간 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycjVheC1BRRAB",
            "text": "This restaurant has to be like one of the best in Washington heights love the food and the workers are nice but I got to point out that when I went last time I went with my cousin and I know people do mistakes but like I told her what I…"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMVRWRlBZbnBxYmxsSlNsaHZkVzFHZFY5WFIzYxAB",
            "text": "Malecon has always been a staple in my old neighborhood. Growing up, it was my go-to spot , the food always hit the soul and tasted like home. Their rotisserie chicken, especially, was unmatched and a true part of my childhood memories.\n\nNow that I live in New Jersey, it’s rare to find that same quality, so whenever I’m in NYC, I make it a point to pick up food for my family. However, the last few times I’ve ordered, I’ve been disappointed. The rotisserie chicken has not been fully cooked , something I never expected from Malecon. Whether it’s the rush of customers or a slip in quality control, it’s noticeable.\n\nThis review isn’t to tear down a place I’ve always loved, but to remind the team of what made Malecon special in the first place. Please tighten up the consistency and ensure the chicken is well cooked like before, that’s what made your flavor unforgettable.\n\nI hope to see the original Malecon quality return, because many of us still appreciate and believe in what you built."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRdFVrWnVlREpPYldSRk5YaHRWRGxDT0hKR1RFRRAB",
            "text": "Been coming here whenever in the area, but prices have gone way up. For food quality, ordered the pernil sandwich, the pork was so dry like eating card board. Throw something in there, onions, sauce, something!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRlVHVkVkV0ZTWldoSFQyWjRWMmxqZG5aV0xYYxAB",
            "text": "We took the subway to Washington Heights to explore the neighborhoods and worked up an appetite.  I picked out the Malecon restaurant in advance after reviewing the menu and the many good reviews.    We were seated quickly and spent a few minutes looking over the substantial menu.    I chose one of the daily specials and my wife selected what she thought would be lighter a bowl of their Sopa De Pollo.\n\nA server brought a plate of warm bread and after a few minutes our food arrived - it was plentiful!\nI enjoyed the Pernil which was slow-roasted marinated pork, served with a side of Moro Gandules (mixed rice with pigeon peas).  The pork was so very tender and flavorful - would definitely order again.  Honestly, I was not a fan of the mixed rice (I do not love peas) but that’s my fault for ordering.\n\nMy dining partner enjoyed her bowl of Sopa De Pollo, flavorful broth with lots of big chunks of Chicken.  We shared a plate of Maduros (sweet fried plantains).  So tasty.\n\nThe prices were very affordable and the serving plentiful.  Although I thoroughly enjoyed my Pork, next time I would order one of the dishes with the roast chicken (you can see the rotisserie in the front window and an employee cutting up the freshly roasted chicken as you enter the restaurant."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNmFXOWFVUzEwTnpGSlZuRkJZbEZTVEhwR1RXYxAB",
            "text": "Pricey but worth it."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTVIwWnZjV05ZUTNkS2NHUjZOMWQzTVRWMU5rRRAB",
            "text": "Some of the best rice, beans, and chicken in Washington Heights!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obVMyTk5WRXRDZDJ4YWNUUkVRMlZUVFZSaVNtYxAB",
            "text": "I remember this place from 20 years ago and still got that flavor of garlic and chicken and rice an beans. I wish the service was better. Maybe cause language barrier or something else."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWWFHdEZlR1p0VmxaSmRsUkNOSGR5ZEhJd1JXYxAB",
            "text": "Muy buena cómida y servicio rapido y eficiente"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV1ZEbHRZMFZIU0ZKWFdHUXlRbVV6Y1daRExVRRAB",
            "text": "Exelente"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMFQxRkhXVEk0U2xkNk4xOUxVa2gyVUZGTE1GRRAB",
            "text": "Good Dominican food 🇩🇴\nBuena comida Dominicana 🇩🇴"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SWVtSk9NVWxvVm1KdFFtRkVSR2xyYVhkYVgzYxAB",
            "text": "Really  like this place!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NVkzSklVVlZXWkdsaE5tOUxVWFJITW1wTVkwRRAB",
            "text": "Very Dominican, Reminds me of restaurants in DR and the food is just as good!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaExXMVZZMFpMYm1SeVUyeEJWR1pVZWtSRGRGRRAB",
            "text": "Great place with great food and really nice friendly staff. Will go back again and again!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reVJGQlhNRGxTWTJRd1V6SlZlVzFIVVRGQlJWRRAB",
            "text": "Excellent service, best cubano ever. The sancochado was delicious. And their jugo de piña and batido de guanabana. Literally loved everything here, would prioritize eating here again next time in New York. Me encantó :)"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kV01tSTFVR2QzUjFobVltaDNWRFJZUVZkVE5YYxAB",
            "text": "Parking was insane but the food was fire 🔥 they had a 10 but the chicharon wasent crispy enough so yu get a 8/10 but overall the cchicken was incredible and the Mofongo too ask for more green sauce btw"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KS09EVTFaV0pHYmpOdlIxbFhSVGR5TnpCUU9IYxAB",
            "text": "I ate here on 10/2/2025 and ended up with a chipped tooth due to the fork I was provided with. When I called the server over all he did was take the fork away from the table. When I asked to speak to a manager, they referred me to the busser and counter attendant."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WmMwNUpkSFUzTnpCdGN6TjRTekpyTVRWTldFRRAB",
            "text": "Buen servicio la comida excelente un lugar agradable"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNVUzUmlYMWhFT1hoQlkxUlRUbVZsYVVnMlMzYxAB",
            "text": "Pollo al horno 10/10"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Od2VVOWtWMnRDTVc1UVUzZHROVzFGTjJ4ZllWRRAB",
            "text": "Delicious and authentic comida De la Republica Fominicana delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWclJXSmtTa2xIVjBwd1lWZHVWRTlPU1ZZM1RVRRAB",
            "text": "Came for takeout on a Saturday night, it was bumping'. Smelled incredible. Surprised and delighted to see carrot cake on the menu. Not too sweet. Incredibly moist. Wow"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GV1VtcGtkRFJxTWxoaE9GQlBZWFZ0YlVSa2RXYxAB",
            "text": "Yummy Dominican food at a Washington Heights fixture. Open late, always a lively crowd"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMGIxaGFjMU5FVW5rd1gwSnBlbEJVT0hjNVUwRRAB",
            "text": "Excelent service, EL SEÑOR Mocano es un amor. Sumamente atento y siempre tiene buena actitud al servir si pudiera darle 10 estrellas a el también se lo daría"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbldsRlZYME15TWpaak1HeGhWRzlDTlZRNVQzYxAB",
            "text": "The food is made with lots of love ❤️ and it's delicious same taste every single visit all I can say is I'm glad I don't like near because I will be Crazy 🤣 the flavor of all the food is ridiculous like so tasty 😋"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMGJsVXRZa2cyY2xFM1YwcG5ZVU5SUVRSQ01XYxAB",
            "text": "Muy delicioso 😋 y buena atención 👌 😉…"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMk5sODNaRWRtZUhWUmJtVjBNR2M0VjBjMFRXYxAB",
            "text": "Malecón megusto una nueva esperiensia buen servicio buena comida y buen servicio"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOUEF3dE94Nkx6Ql93RRAB",
            "text": "Easily the best Dominican restaurant in New York. It’s a go-to spot for authentic, traditional dishes served in a no-frills, straightforward setting. The staff gets the job done—while they can be a bit slow or chatty at times, they’re generally efficient.\n\nThis place is a true neighborhood staple. The chicken and mofongo are my absolute favorites."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWFdrSnNORFYxWDFJNGNqUmZOazlvV0ROTmQxRRAB",
            "text": "Hands down the best rotisserie chicken in NYC. Dining in was a breeze with plenty of seating. For a more efficient meal take out is the way to go."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsa05UTklRVXRFTWxWWlRWTlJSM1F0UnpOa2JsRRAB",
            "text": "Franchesca Siempre Amable 🙌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMWNsTlVNMkpMVGw4d1F6bHVVR0ZwUVZKaGJuYxAB",
            "text": "Our to go spot for when we want to eat Dominican food, the food is great, the service is always on point."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210amJFaFJRbWd0U0VGR1RrcERZbTVuTWtaaVFuYxAB",
            "text": "Wow! I havent been here in 20 years so much has changed  but the chicken is still fire!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQ1oxSTJSa2xMYUV4aWFURk1NRlkwWVUxT1VGRRAB",
            "text": "We had dinner after a concert on a Saturday night, we ordered, tostones, Mofongo de Camarón along with two drinks. Everything was perfect—the staff was very friendly, and our food arrived quickly. The tres leches dessert was just okay. Volveremos!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KS1YxWjJZWHByUVVRdE1IaFRaa3BOYlRsR1RHYxAB",
            "text": "The food is worth the wait, you can also take out if you don't want to eat inside. First time there try the sancocho with rice and add lemon. You'll love it. By then I had the mofondo de chicharrón de puerco also really good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVVpWSk1iRUo0T0doT01VTkxZa2h3YlUxWVRVRRAB",
            "text": "Ine of the best Dominican spots in the heights....hands down...the rotisserie chicken is great...and you must try the mondongo with white rice...the best.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUFdtNW1UVTFWVDFsaU0xODJPR2R2U0hCc00xRRAB",
            "text": "Just know there is no near by parking. On street parking barely available, a lot of cars double parked."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCU1JrUkJkazU1ZDJ4TmN6WlNiSFIzUWtJeVVsRRAB",
            "text": "Place is well know for great food with Dominican flavors."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrM09VRlBhR3QyVkVaRVVrTlFUR3d6WDJGVWFIYxAB",
            "text": "Great food for a low price"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJOXF5TTZBRRAB",
            "text": "Food is always great here but they have NO CLUE about cocktails. Absolutely NO Clue. I ordered a sangria pitcher. The pitcher was filled to the Top with Ice. The glasses were filled to the Top with ICE. It's a Complete Total ripoff. The WORST tasting sangria I've ever tasted. Then I ordered a glass of wine. They gave me a $5.00 /glass tasting wine. Which was horrible and charged me $13.\n\nThe sangria was Extremely Disappointing and the wine was worse.\n\nGreat food. Always Busy. But they truly have NO Clue on how to make cocktails or how to buy wine."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVVNUbG5OblZHWkZCQ2NsVlRURkZTZG1sU1gxRRAB",
            "text": "Large plates. Good food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNGFtNUVaWFZYV0ZCNlZsSklMVEZMZFc1Q1RtYxAB",
            "text": "Always get the roast chicken. Always. So so good. Whole roast chicken, Maduros, red beans"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeVN6ZEdlRkpSUm1kdmMwMUpPVVp4ZEZVNFkxRRAB",
            "text": "DO NOT ORDER ONLINE!\nThey are the absolute worst.\nAlways super long.\n“Delivered” to wrong place… MORE THAN ONCE.\n\nMy wife and I for some reason have tried them more than a few times over the course of some years.\n\nHorrible, horrible horrible delivery!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkamJrNWtVRWwyVlVwVFdVSlhPSFYzY2t4VFEzYxAB",
            "text": "A neighborhood staple. The best."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwU2NIZDViRGxtVEVSbFJFdzFNVWhxWVd4TGFuYxAB",
            "text": "It almost felt like a quick trip to the Dominican Republic. I really like Dominican food — the fried chicken (chicharron de pollo) and pork(chicharron), the plátanos, the cheese, rice with beans… even the Dominican beer. I just love it all. Other Dominican spots I’ve been to, the staff usually don’t speak English, so it was awesome that our server actually could. Had a great time overall, but wow — the bathroom smell was rough."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJNjNwdjJEMFl2Y2JnEAE",
            "text": "Working in the area. Coworker recommended this place for lunch. He had the chicken he loves.\nHave to say probably one of the BEST Roast Pork dishes iv have, “FANTASTIC”\nLove to be here for dinner atmosphere was great place crowded for lunch. What do you expect for one of the best place in the area.\nThank you"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SM1duSmplVFJwU201b2VGSjJaMGgwUjJRdFowRRAB",
            "text": "First time ever trying Dominican cuisine. Had Mofongo with shrimp, maduros, black beans and rice. Service was fantastic. Can’t wait to return."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RGNXaDVSalJZTkRKelJWRmZTRkJWZWxoTlpYYxAB",
            "text": "Great tasting food, Dominican Style food. Be prepared for well seasoned dishes it is so tasty. It's a usually busy place & the people that work there are polite. The only thing that I wish was better is more Dominican Music & if they would put the volume up a little more hahaha I loved their smoothies too which are great in the hot weather"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLWdzOVhydnVyc3pBRRAB",
            "text": "Always consistently the best food, for years, more than @30 we going there, amazing chicken maduros arroz y habichuela tres leches and more"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTmJHY3lNVUpqUjBSWE56RjJWSFF5ZERkcFpsRRAB",
            "text": "Everything we ate was absolutely delicious! Their mofongo breakfast platter, and the steak lunch deal are everything we never knew wanted. Their cortado! Definitely get it. Look forward to eating here again!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQX2RpaW9RRRAB",
            "text": "Decent food after movie, can be long line, chaotic, quick service kinda and huge menu.\n\nI wouldn’t come again. The service is okie and food is so so. I am not a fan but it’s definitely well made for the chicken. They could have use organic chicken for the price.\n\nI think they get busy during regular hour. We got here on an odd hour. Good service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWeF8zZUlBEAE",
            "text": "12/15/23 met up with a friend that recommended this Dominican restaurant because were were hungry . As you enter you smell and aromas of this amazing food. it does get busy and there May be a little wait to get food, but it’s all worth it!!! Genesis our waitress was excellent. She was very friendly, attentive and professional. The food freaking great!!!!!! Must recommend and return."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmb3F6SzN3RRAB",
            "text": "Este lugar es ideal para recordar la República Dominicana en Nueva York. El sabor de la comida es exquisito, y cualquier platillo que elijas vale la pena. Aunque el servicio al cliente no me pareció el mejor, creo que esto podría estar relacionado con el ambiente de una gran ciudad, donde todo el mundo parece ir siempre de prisa."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLUplaUpREAE",
            "text": "Ran here with a couple of friends for a cooldown run to get food because the armory (which we were competing at) had meager food options. We figured this place would have better food. While my Pernil sandwich tasted just fine, my friend wasn’t a fan of what he ordered. If I recall it was something along the lines of a cheese sandwich or something. a very useful tip if you are here with a bit of a time crunch on your hands is just because sometimes the food is “ready to go” when you pre order online in advance is doesnt mean it always is.\nOverall the atmosphere was great, the restaurant was lively, and the food was a/ok."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNDhPWTFRRRAB",
            "text": "Great place to have good food and the atmosphere is wonderful.  Dominican food but it’s also a mix of different influences. Must try. Huge inside seating and outside seating as well.\nYou can’t go wrong with this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMXN2SVN3EAE",
            "text": "The food was definitely worth the drive, and the wait from Westchester .\nI will be back hopefully soon."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbHRhdkJREAE",
            "text": "Ottimo locale con ampia scelta di piatti tipici di santo Domingo.  Personale molto gentile e disponibile,  locale con ampia scelta di posti tra tavoli o sedute con divano.  Bagni puliti.  Ottima la carne ed il pesce.  Possibilità anche di cibo da esporto.  Consigliatissimo."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncm9YMVFBEAE",
            "text": "The food and drinks here are delicious! Everything had flavor and was cooked well. The pina colada and pineapple juice were great. The service is wonderful and the vibe is family-friendly comfortable."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkT1UwSXlOMHRoTjNGdVJXOUJObmwzWDI1UWIwRRAB",
            "text": "Si pudiera dar cero estrella lo haria. El jueves 10 de julio 2025, fui un poco desesperada a comprar un poco de comida para mi hija de 18 meses. Ella lloraba del hambre sin control y desesperada, por ende estaba un poco desesperada por alimentar a mi hija. En esto procedo a pedir un pequeño lunch ( en envase donde ponen plátano maduros para llevar ) ósea solo quería algo para mi hija no más, y les digo que por favor me vendan esa cantidad que eso solo para mi hija. La chica me dice que solo me puede dar arroz por $5.00 y yo le digo por favor por favor ponme un pedacito de carne y yo te lo pago extra, ella muy negada me dice que no. Proceso hablar con el grosero del dueño y me dice que por arroz y habichuela son $6.50, le digo que lo pago pero que me ponga solo un pedazo de carne y le pago extra, y me hablan de mala forma y dice que no. Todo esto me indigna porque no se como una persona tiene el corazón de negarle un pedazo solo uno de carne a una niña de 18 meses y más que yo me ofrecí a pagar extra. Da pena como persona como esas trabajen en servicio de comida y hombres como ese señor sean dueños. El mundo está como está por falta de solidaridad, empatía, y caridad. Pero más nunca le doy mi dinero a esa gente. Da pena y vergüenza como la gente aún con dinero se le nota el hambre"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcmJuQ29nRRAB",
            "text": "Pollo asado (Rotisserie chicken) embodies the personality and flavors of Central and Latin American cuisine, making it a delightful experience for anyone from other continents.\n\nThe concept is distinctly Latino, with intense and wonderful flavors. I absolutely love roast chicken, and this is by far my favorite. The authentic flavors are what make this chicken so delicious.\n\nI also enjoy their fresh and natural juices, which contain no artificial flavors. My favorite is the batida de mango with milk, as it reminds me of my childhood.\n\nThe bathroom is spotless and private, which is excellent.\n\nI have returned many times and will continue to do so. If there are any changes, I will keep you updated.\n\nOne more thing: if you visit on weekends, keep in mind that the place can get crowded during peak hours, so you might have to wait for a table. Be patient."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1eHJiRE9REAE",
            "text": "It was a warm Wednesday afternoon in Washington Heights, and the air was filled with the delicious aromas of Dominican cuisine. I had just met up with my cousins for lunch at Malecon, a popular Dominican restaurant that was a favorite of our late aunt.\n\nWe were greeted by a friendly hostess who seated us at a table in the back of the restaurant. The dining room was brightly lit and decorated with colorful murals of Dominican landscapes. The atmosphere was lively and convivial, and we could see that many of the customers were local families and friends.\n\nOur server, a young woman,  came over to take our drink orders from a wide selection of beer and local drinks, like sour sop smoothie.  Once we had our drinks, we were ready to order our food. Maria recommended the Pollo Asado (or Chicken Rotisserie), which is one of Malecon's most popular dishes. We also ordered the Mofongo con Chicharonnes, Yuca, and Platanos.\n\nThe food arrived quickly and it looked and smelled amazing. The Pollo Asado was perfectly cooked, with crispy skin and juicy meat. The Mofongo con Chicharonnes was a delicious combination of mashed plantains, fried pork rinds, and garlic. The Yuca and Platanos were also perfectly cooked and seasoned.\n\nWe  all dug in and savored every bite. The food was absolutely delicious, and we could taste the love and care that went into preparing it. As we ate, we reminisced about our aunt and all the wonderful times we had spent together at Malecon. We shared stories and laughed until our sides hurt.\n\nWe left Malecon feeling happy and content. The food was delicious, the service was excellent, and the atmosphere was warm and welcoming. It was the perfect place to celebrate our family and to remember our aunt.\n\nThank you, Malecon, for making us feel like we were part of the Washington Heights community. We will definitely be back soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Z2J6QkRBEAE",
            "text": "Malecon Bar and Restaurant is a great place for a meal. The service is friendly and prompt. Food good across a wide range of options. Some confusion with waitstaff on what may contain gluten. Prices make a meal affordable. Food freshly prepared but came pretty quickly."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaVBpNnZ3RRAB",
            "text": "From start to finish, every bite was incredible. If you’re a fan of Dominican food, this spot is worth visiting. Best roasted chicken in town!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTVpqSkdaMmxXUTBSTmNGUnlZMjFaVm5kVVVYYxAB",
            "text": "The best of the best when it comes to Spanish food! I highly recommend this place. This place never disappoints me. The staff is super friendly and work as fast as possible. They have variety of food plates and drinks to choose from so don’t worry about that one family member or friend who is picky with food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdkx1bDdnRRAB",
            "text": "The closest you will get to Dominican food without being in Dominican Republic. The sangria is also extremely strong, which is an amazing thing. Absolutely love this place, strongly recommend everything on the menu especially the rotisserie chicken, best chicken ever, my go-to spot every time I cross the GWB. 5/5"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMlBPZGVBEAE",
            "text": "Takes a while to get seated and the whole place feels chaotic but the food is good and almost makes up for it. Half chicken is the move with delicious skin. Churrasco is a large serving and can feed 2-3, but is cooked nearly well done. Overall not a bad spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5a2YyQ0x3EAE",
            "text": "My goto place for the best roasted chicken in the area.  Their motto - El Rey Del Pollo - King of the Roast Chicken.  Also tried their other dishes today like the sautéed pork chops and the grouper fish fillet sautéed, with side dishes of red black beans, maduros, steamed vegetables, and yellow rice.  All were generous and delicious.  Also ordered their Malecon cocktail, diet soda, and finished off with an authentic Tres Leches dessert.  We were so full and we still had lots of food to take home.  We actually over-ordered.  Service was very friendly, attentive, and efficient.  Ambiance is cozy and contemporary.  The place was packed on a Sunday lunch, very popular."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUc2J2Q3F3RRAB",
            "text": "Incredible Rotisserie Chicken, really enjoyed the sauce it came with. The chicken was perfectly cooked, tender and juicy. Maduros were also a great side. Affordable and delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMGRHcE9Ubk5sZUhCS1ZuTmFiRlZtU0dKVGEwRRAB",
            "text": "We ordered the \"Family appetizer\". They brought a plate of dry meat, and it seems it WAS NOT made fresh but reheated. Though the restaurant was full, and they cooked a lot, we got what we got. No chance to go there again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNTQzaVZBEAE",
            "text": "I used to go there often a few years ago and I remember the food being one of the greatest that I would drive all the way from Brooklyn to go uptown just to eat their food. Now the restaurant is already known so the food is ok but not the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCd2ZmS05BEAE",
            "text": "AMAZING. The food portions are huge and everything was tasty. Even ordered in Spanish and the waiter was super patient with me 😂\n\nNo joke. The prices for the portions are NOT a joke. Worth every penny."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1b1l2VWx3RRAB",
            "text": "Nice place in the neighborhood. Feels and looks like a diner, but they serve Caribbean food. The mango smoothie was so refreshing! Lots of staff around cleaning, cooking, and helping guests. Big meal portions! Everything had great flavor."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdjR2eXB3RRAB",
            "text": "It’s definitely worth the hike from Brooklyn. The food here is really good and affordable. Also, the drinks are pretty strong. I’d definitely recommend dining at Malecon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcU5YRTFRRRAB",
            "text": "Hands down the best food!! My go to, cannot go wrong. EVERY single time the food is awesome! The service is excellent. The prices are good too. They never disappoint. I am there a few time a month at least. My daughter LOVES the parrillada, especially the churrasco. It is a must if you are in Washington Heights!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLSzQyNlBUcGM2aGZ3EAE",
            "text": "Great restaurant the food was excellent the service was very pleasant but the wait to get a table was about 15 minutes"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUay1XMEJREAE",
            "text": "Tuve una excelente experiencia en este restaurante. El mangú, la yuca hervida con cebollas y el pollo asado super delicioso. Y el flan de postre no podia faltar, expectacular. Lo recomiendo 100%"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaek1tM0xnEAE",
            "text": "5 star everything Food was delicious. If you haven't gone do so. You won't be disappointed. The food was so delicious.  Amazing!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdlp6NG9RRRAB",
            "text": "Very nice food. Smoothies are bomb and the chicken goes hard. Service does the job"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiN0llcFFREAE",
            "text": "Food was outstanding, great menu selection. I had the mondongo it was amazing. Dine in facilities and service, superior. We came a long way just to have good Latin food and was not disappointed. Will definitely come again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cnVTdWdRRRAB",
            "text": "Malecon is probably one of the best Hispanic restaurants in New York City. Authentic Dominican-style food is delicious, portions are big and there are great lunch specials the whole week that include salkocho, roasted pork, beef ribs, baked fish fillets, etc. Staff members are very kind and and they make you feel like at home 🙂. Highly recommended 😋👌🥩🍗🍝🫕🥗🍲🍛🥂🍸🍷💥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3c05LN0JBEAE",
            "text": "I've come here several times in the past as I'm in the area often. I had steak sandwich and my companions had mofongos. Overall, the food was okay, but there was an issue with a morir soñando which tasted fermented as if the milk had gone bad. Only one sip was taken and the wait staff was notified to return the drink. I understand that things can go bad in a restaurant, but it's unreasonable to charge the full price for a drink that has gone bad."
        }
    ],
    "reviews_count": 79
}