{
    "name": "Hudson View",
    "place_id": "ChIJNdjH6KD2wokRGfGnTcpM4AQ",
    "grid": "MN12",
    "address": "770 W 181st St, New York, NY 10033, USA",
    "rating": 4,
    "user_ratings_total": 456,
    "phone_number": "(212) 781-0303",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc1JHTkJRa3c1Y1ZOSWFqVXlhakJ2WjBocllYYxAB",
            "text": "Stopped in with my Mom, since we wanted Breakfast at dinner time. Very attentive service and great food (Eggs, Bacon, Home Fries)"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBM1R6bEhhbkp1ZEdOdWNUaGxja1pSVVRFeWJVRRAB",
            "text": "Well food is ok but they are really scummy business.. THEY CHARGE YOU FOR TAP WATER. No joke…they also serve you in these awkward plastic cups that they have to open to give you more..Better yet they dont tell you, and they try and hide it on the bill using the letter W…Honestly its kinda a rip off…everything…lts also run down and kinda dirty…Go somewhere else or better yet bring your own water..\n\nEdit: There is a new diner on 187 and Fort Wash. The reviews are promising and they have coffee and water served in real cups. Also pricing is better! Try this place instead."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWVNqTXRaVmxvWVVObGRYWTNlbUZrVjBGclpXYxAB",
            "text": "Great location near the GW Bus station."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdmNXOVhlV0U0TW1zdFVFaGZlSGhaUW5WWmQwRRAB",
            "text": "The food was all right but they charged for tap water."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NFVWUlljbWhGYVVGSVdWZEZOM2hHY2xKVVluYxAB",
            "text": "Lovely place with the Greek touch. Everything was wonderful. Highly recommended"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNFNFb3pVbGRUVDNBeWJFNTRaVGhrZEVGbFVHYxAB",
            "text": "Just so you know, if you come here and they set down plastic cups on your table without permission, they charge you for the water. They dont even ask or tell you until you get the bill. For tap water. Its so sad to see this diner overtaken by greed because the staff seems nice. I've lived here for 11 years and this place drastically changed after the pandemic. We do not go here often anymore as everytime we do, some type of new charge is added to the bill. Its so sad because the owner doesn't seem to care what neighborhood people think. Even the food is mostly thrown together without care. I would love to see this place grow to be better as its the only neighborhood diner. But it just never changes :/"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaR04wdHBTbVpNYUZoaGVrd3RkaTFTVmpkR01WRRAB",
            "text": "I come here for their coffee usually.  Solid choice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdWRWaFVhelIxV1ZGVGRXMW9WRGwwYlRKR2RYYxAB",
            "text": "We’ve been in the neighborhood for 26 years & frequented this diner for most of that time. Initially & for years it was, for lack of a better term, a dump: horrible food/service. We still went as it was our only diner option at that time. When the current management took over some time back I was overjoyed that the quality of food/ service/ cleanliness skyrocketed & was maintained for some time. But after the pandemic certain portions shrank considerably, dishes seemed thrown together without care and the service was just horrible. & they’re still charging for tap water! They did it during the pandemic to recoup having to buy disposable cups. It was necessary but now it’s just greed? Literally the only restaurant in Manhattan I’ve found that does this. Sad to say so many of us in the neighborhood had to give up our hangout of so many years. We’re hoping things will change and we can come back at some point. Until then…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMFduQnBYM0pDVDBVd2NIaHBMVnB1ZFdkWldGRRAB",
            "text": "Everything you could expect from a breakfast place. Great service and good food. Very generous portions at an affordable price."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeVNGTnRla1pPUTA5d01uSnNTMlZ5VG5KcVpYYxAB",
            "text": "That’s a perfect place to start your day. Broad selections of the all type of dishes (wraps/eggs/salads/meat) on the menu, a lot to choose from but at the same time not too many options so you’re not lost. Portions are big (I always end up taking something for to go) and made with love. Servers are kind and nice. We live around the corner and that’s our favorite spot for breakfast. 🩷"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNUl5V09nEAE",
            "text": "Food was ok! We shared the hungry man breakfast amongst two persons and that was more than enough."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLWRqVmtBRRAB",
            "text": "A small step above a greasy spoon yet way too overpriced.  Can't have bkfast for less than $15.00 and the service is way below standard.\n\nReceived coffee in a paper cup with no stirrer or spoon to stir the sugar and milk.  Shortcut for them but if I'm dining in, I need actual cups, not to-go cups.\n\nAsked for well done eggs; yolk was semi runny.\n\nHome fries weren't seasoned well, no onions nor peppers to be seen.\n\nToast wasn't buttered well, just a slab in the center of the toast, how lazy!\n\nAsked for only sausage but received sausage, bacon and ham.\n\nJalapeño Poppers were thrown carelessly on a \"bed\" of spinach from last year...so wilted.\n\nThey don't stop and think of the small details that will make their guests happy.\n\n3% credit card charge.\n$.50 per egg fee.\n\nOut dining fee? $50 for breakfast at this type of place is ludicrous!\n\nDefinitely will not stop here again.  Was on my way to Le Cheile when I chose to give this place a try.\n\nNever again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaTUyRGN3EAE",
            "text": "Love this place.  Especially the Spinach Pie and Eggplant Parmigian"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdG95T1RnEAE",
            "text": "I Visited this restaurant this past Sunday morning with 4 of my friends. Each of them ordered food while I simply ordered 2 sunny side up eggs with toast. All of my friends’ food came out 10 mins later, while the server/cooks completely forgot my order. I waited 5 mins thinking maybe they were too busy (even though it’s a very small diner and there were some empty seats)… I finally get up and tell the woman at the register. She says, “I’ll take care of it now” (with no apology)… I sit down for 5 more minutes and still no eggs, no toast, and no acknowledgment. All of this while I’m hearing the cooks whisking eggs and completing other orders. I of course stood up and canceled my order. 10 mins later as we were all preparing to leave, I finally get a passing apology from the woman. She says, “Sorry for the eggs” as she quickly turns away and greets another table. This is a place of business and I know many people in the area. Mistakes happen, but how you react to them changes everything.\n\nThis will definitely be the last time I go there and will definitely tell my friends who live in the area to not visit this diner."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaS1ub1pnEAE",
            "text": "The prices are high for what you're getting, which is typical diner fare. I wouldn't say the food is bad but it's not that great either. Paper or plastic cups for coffee or water. Note that they CHARGE FOR WATER. Waiters have always been great."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbWNucWpnRRAB",
            "text": "Great food, great service, and a cozy atmosphere. Most of all,  consistent."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbG92eTBBRRAB",
            "text": "I was always perplexed by them serving arrangement when they served water and coffee in disposable paper and plastic cups. In my opinion, it's unacceptable for a sit-down restaurant. But on my last visit, I was shocked when they charged me for the aforementioned disposable cups with tap water. At the register, an employee told me that the next time, I could ask for water in regular glasses. She took the charge off the bill when I asked her about it. But the whole experience had a scammy feel to it. They charge a 3% fee for credit card transactions, which is also unacceptable. I won't be coming back to this place. Btw there's no view of the Hudson River if anyone was wondering."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdHByV2lRRRAB",
            "text": "As a Professional Chef out on the road it was nice to stop in at the place I grew up. the big Apple NYC Hudson View Cafe made me feel right at home . Definitely a must goto when you're in town. Thanks for the amazing food and hospitality."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNId3ZhN1JBEAE",
            "text": "I had 2 eggs overeasy and water which they charge 50 cents.\nFood was good"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcHJ5S1l3EAE",
            "text": "Hudson View is a cozy spot conveniently located near mass transit, making it a breeze to get to, whether you're hopping off a bus or train. The staff here are friendly and courteous, ensuring a warm welcome from the moment you walk in.\n\nI visited for breakfast and found it to be exactly what you'd expect from a classic diner—good, hearty fare that hits the spot. The coffee, in particular, was a standout, definitely worth a mention. The space is small but charming, creating a nice, casual atmosphere.\n\nThe only hiccup in my experience was a minor one—diners are typically known for serving coffee in classic mugs, but I was given a to-go cup instead. Perhaps they were just out of mugs that day! All in all, a solid diner experience that's worth checking out, especially if you're looking for a convenient and friendly spot to grab breakfast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbUtIMS13RRAB",
            "text": "I have only eaten food delivered through Uber eats from here but it was the best food I have had while in this city. It was fresh hot homemade and absolutely delicious It was fresh hot homemade and absolutely delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNjRyRVh3EAE",
            "text": "Rude staff, terrible food, and the owner is even worse than the staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNl9Eb0h3EAE",
            "text": "Bad food (served old avocado, and cheese that smelled), charged extra for tap water."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNHFXTWxRRRAB",
            "text": "This place years ago used to be really great plus who serves coffee not in a coffee mug but in a cup like if you were talking out !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueFBhRW13RRAB",
            "text": "I would come back for the coffee."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLU42bmNBEAE",
            "text": "I recently received the wrong order, and when I called to inquire, instead of acknowledging the mistake, the staff shifted blame. Initially, they promised to send a dasher to deliver the correct order, but shortly after, they called back claiming my order was correct. Fortunately, I live nearby and was able to walk to the restaurant with proof of purchase. Rather than apologizing, they blamed me for not using Grubhub, the dasher (who wasn’t present), and even cited not having a printer as the reason for the mix-up. However, I noticed a staff member verifying pickups, indicating it was their oversight.\n\nA simple apology would have sufficed, but unfortunately, this is the second time I've experienced poor customer service at this restaurant. As much as I want to support small businesses, we'll be seeking another diner in the neighborhood to support moving forward."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNFByR2F3EAE",
            "text": "Great diner atmosphere.  The food is on point.  Service is friendly all around from the time I walked in to the time I left."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIN2ZLWmVREAE",
            "text": "I enjoyed my food but it was HOT in there"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzMnBQVnl3RRAB",
            "text": "Classic dinner fare done right"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIZ1pXZGx3RRAB",
            "text": "Nostalgic"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cDhQaE93EAE",
            "text": "Food is very good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeXZXWDNRRRAB",
            "text": "Love this place, great local diner. My go to is the nova-benedict."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MHFPMG1nRRAB",
            "text": "Served me a raw cold burger. Returned for a new one. My son had diarrhea within 45 min of eating. Beware."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaDZhWFVnEAE",
            "text": "Food was amazing and the servers were kind and polite.  Great place to just stop by and sit after a long walk down 181st"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUd2ZTTThnRRAB",
            "text": "Good breakfast, good service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaDh5UmtnRRAB",
            "text": "I was so disappointed at this restaurant, when I noticed my bill  that they charged me for 2 glass of water not bottle of water glass tap water from the sink,😬😬😳unbelievable I also noticed that they charge 3.6% if you paid with credit card 💳 Whoever is reading this place don't wate your time having breakfast, lunch nor diner at Huddon View Restaurant enjoy eat at another place!! I don't recommend this place at all!☝☝☝"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZzdiWXBnRRAB",
            "text": "Never has there been a better spot here in Washington heights where you can grab a mouth watering sangria accompanied by delicious food and humble service for an uptown price with a magnificent view of the George Washington Bridge & Hudson River just up the block from this cool establishment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEZ3ViN1BBEAE",
            "text": "Good food and Good service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5azZybkdnEAE",
            "text": "Love the French toast"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N3NpWWh3RRAB",
            "text": "Food is fresh, follows modification notes, and delicious! Will be ordering again ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dEt5YURBEAE",
            "text": "After 15 years of ordering from Hudson View, I've sworn off patronizing them, again. They botched two delivery orders, and, then, tonight, did didn't fill my delivery at all. Instead, they called me to tell me that I said I had ordered pick up (I hadn't) told me they would deliver. They didn't and didn't bother to tell me they weren't sending the food, leaving me waiting, hungry, until it was too late to order elsewhere.\n\nHudson View clearly has given up trying to serve customers well.  When I called, the staff -- who knows me well -- wouldn't admit it did anything wrong, and couldn't have been more eager to close up shop and get off the phone than if a tornado was headed their way.\n\nIt's a pity; there aren't a lot of decent places in the Heights for a salad. But, for whatever reason, lack of staff, failure to keep up with technology, disinterest, I won't order from them anymore.  I hope someone else can make a go of diner food in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbzYtcm5nRRAB",
            "text": "The food is great. They don't have hashbrowns, unfortunately..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkN2UtTHp3RRAB",
            "text": "Nothing special."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0Nk9mMVFBEAE",
            "text": "Ok first I must say why when u order coffee when sitting in its put in a disposable cup ? Very poor condition inside invest in the restaurant unpleasant smell inside food was ok."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURObmVPb3J3RRAB",
            "text": "Great spot for breakfast. Classic New York diner, minimal frills, good service. My go to for a satisfying American breakfast"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROaWViVVBREAE",
            "text": "Got really bad food poison from the place be careful when eating any of their meats"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaGV2WnJRRRAB",
            "text": "I've lived in the neighborhood for over forty years and I went here for the first time today.  The food was nothing special.  However this is the only diner that I've ever been to that serves coffee in paper cups!  I was shocked.  Not only that, but the coffee was hot at least,  but too hot to hold in a paper cup.  I asked the waiter for a sleeve.  He says they don't have any, do I want some ice?  I would never come here again.  I couldn't believe that any of the people there would knowingly go to a diner that serves coffee  in paper cups.  At least the plates weren't paper."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeXBPZHp3RRAB",
            "text": "My wife and I are regulars. We love coming here for the pancakes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMHNPTXJRRRAB",
            "text": "Live the quiet atmosphere.  Is always that way and I love it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNktXYTZBRRAB",
            "text": "The only Greek diner in Washington Heights.  Love that the breakfast menu is available at all times. My go-to place for breakfast and coffee!  The prices are reasonable too!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnaHAtQ2ZnEAE",
            "text": "This diner is on the corner of 181 and Ft. Washington. It has seating inside but not so much. They have typical diner food but it is fresh and clean - the fries are fantastic. Their portions are generous but not too much. They are very patient with families with kids. The prices are very reasonable especially for nyc. Will definitely be going back there on an evening that no one feels like cooking"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJZ3ZIZXhnRRAB",
            "text": "Nice clean friendly diner. Reasonable prices. Good food. The waitress messed up the order several times, but the manager was attentive and corrected the mistakes. The waitress was polite and apologetic about the errors. Eat in table & booths. Take out & delivery available. They accept credit cards, but not Amex or Discover."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRXzhDWTl3RRAB",
            "text": "Good diner with standard breakfast staples... It feels a bit heavy, so recommend lightening it up with sides. Hungry man breakfast (should be renamed to Hungry person breakfast) is quite filling and it is a combination of savory and sweet."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbnJXOEFREAE",
            "text": "I ordered cheese fries… and they put cold American cheese slices on the fries. Shouldn’t even be on the menu. SEVEN WHOLE DOLLARS for american cheese slices"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOWFDbUJnEAE",
            "text": "This little place has excellent customer service and the food is always good. Good location for after doctor visits."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCNS1YU3RRRRAB",
            "text": "Don't let the old school diner vibe fool you, this place is top tier. The Cobb salad was a bit pricy once I added chicken to it, but it was a thing of beauty, and the chicken was really nicely seasoned."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdTdULVBREAE",
            "text": "Yummy yummy Eggs Florentine with the sauce on the side.\nBut if you get scramble eggs they make it with egg shells. So watch out if you don't like egg shells in your scramble of any kind."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaE9EQ2Z3EAE",
            "text": "Great local place with tons of food on your plate and great taste!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0b1BIa0hnEAE",
            "text": "I like the Turkey dinner. Breakfast eggs with fresh squeezed OJ. I recently had their bagel & smoked Norwegian salmon with all the trimmings. It was excellent."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBaEozQUhBEAE",
            "text": "A little pricey for a diner but great food, especially breakfasts. The lunch specials are a great deal - lots of food. The specials are definitely the bang for your buck."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBN3R1UDhBRRAB",
            "text": "This a very pleasant diner. The staff is nice and the food was actually impressive. Their cup of soup is huge!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeGUzanhnRRAB",
            "text": "It was so good we came back the very next day. ❤️ 😍 💖 ❣️ 💕"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQweGJmTWFnEAE",
            "text": "I want to give this place a full 5 stars but it’s sooooo expensive for a diner. The food is consistent and the coffee is good. The service is awesome as well. They know their regulars and treat them well. I love the turkey sausage and that…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobllYSUxREAE",
            "text": "Food was not very good and lacked taste. Ordered a bacon cheeseburger that tasted like a hockey puck with lettuce and tomato. The server was very nice and attentive. But LOOK OUT!!!... THEY HAVE ROACHES. One crawled out right from underneath my seat while I was eating. The 2 stars are strictly for the server. Nothing else."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZOHZLZFBREAE",
            "text": "I’ve ordered a few times thru seamless from breakfast ,lunch or late dinner and always get prompt delivery.Food is always full filing too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMta19LSmxBRRAB",
            "text": "Just ordered for the first time, officially the new favorite place. Freshest, tastiest food ever. Definitely a Saturday morning breakfast I'll be buying again! I got the turkey sausage scrambled eggs sandwich, and the challah french toast."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbHFpV0RREAE",
            "text": "Starting with the good: friendly workers, attentive waitress and staff. Now on to the rest: I came with two other friends and none of us finished our meals. We all ordered different menu items so all across the board it was very subpar.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzNE5pemVREAE",
            "text": "Ambiance is very much like a diner’s. Interesting to have a small town feel mid-city but very much appreciated. Food is decent, staff is attentive and fast. Small space but very well setup. Price on higher end for a diner. Worth a try.\n\nI’m a stickler in cleanliness and while everything is clean, I did notice some dark corners close to the kitchen area I tried to not focus on."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwa3NtZjlRRRAB",
            "text": "Enjoyed Delicious Vegetarian Omelette and Tea. Great service and Timely. Thank you."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnOC1MNUNnEAE",
            "text": "This establishment features typical diner fare and reasonable prices. But the real noteworthy thing is how friendly and involved the staff are. I first came to this diner when I was looking for an apartment in the neighborhood. When the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeXFfSF9BRRAB",
            "text": "Hudson View is a Family Diner. It has an amazing quiet atmosphere and the food is great.  The waitress is amazing. The owners are also great. My favorite dish is the \"Ruben\" sandwich and the Cobb salad. I will recommend it to anyone."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcUl1NGtBRRAB",
            "text": "Very disappointing, did they change owners or cook in past few years ? I saw great reviews and article on yelp but when we got there everything from coffee to sandwich was overpriced and not good. How about service ? Well, We got yelled at…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNHNqWHVnRRAB",
            "text": "Absolutely amazing food, we came from Canada  an tried this place out an would go back any time, best food I've had in a long time for breakfast. The bill was super cheap 35$ but as a Canadian an using credit card ended up paying 55$ still worth it, but if your Canadian use cash saves money"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMDVtUnB3RRAB",
            "text": "Nice local community diner. Very small business-family owned type vibe. Very friendly staff. The type of place where local politicians often stop in to chat with constituents.…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnckxpVWdRRRAB",
            "text": "I used to love this restaurant and went there with my children often. However, I was extremely embarrassed and treated poorly due to the fact that I did not tip the waitress what she considered the right tip. Mind you back then ( about 6 years ago) tips were really an optional. This person was physical towards me when she grabbed me by the arm and insulted me in front of my young children and other customers. I was saddened by the incident because my children felt scared and sad for the incident. The waiter was not reprimanded by her action which made me assume that she was supported by the management. I hope that this does not happen to any other family in the neighborhood. Customers certainly do not deserve this type of treatment. On the other hand, even though their food used to be expensive, it used to be pretty decent."
        }
    ],
    "reviews_count": 75
}