{
    "name": "Mambi",
    "place_id": "ChIJu3XVJaD2wokR8vwbqmztsPk",
    "grid": "MN12",
    "address": "4181 Broadway, New York, NY 10033, USA",
    "rating": 4.2,
    "user_ratings_total": 1626,
    "phone_number": "(212) 928-9796",
    "reviews": [
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDbnBiVGFREAE",
            "text": "Always good for some late night or early morning meals"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MWIyUmplbVJrYW5wTlZIVnRlRTFJV25FMlJWRRAB",
            "text": "The food lacks in flavor, the service could've been much better. I love a lively atmosphere with music and people having a good time talking and laughing but when you have 1 table that is louder than the music and every other conversation that becomes an issue. I went because a family member recommended it and I was very disappointed. I will not return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTGFtTjZUVFJXZUZWbVFrMXBTWGxrYkdONU5VRRAB",
            "text": "Stunning views"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMlJXcHFUR0puZDFaclZtaERWM2xhV1ZabWVHYxAB",
            "text": "At first, i would like to clarify that i have any attention to criticize or to be arrogent about this place, but on the contrary: I liked it very much and I am glad that I chose it out of other options - Gemini has recomended it and I went for it. My only  purpose here is to give some more information about this place out of my current experience in order to let people choose visiting Mambi with more awareness.\nThe main thing right away - AI presented me Mambi as a restaurant. When you read \"restaurant\" you expect and imagine by this definition some sort of things, some standards that I admit can be personal. Anyway, I wouldn't call this place restaurant but some local dinning room, mixed with a small Bar and private place. And once again, I have any attention to insult or to criticise. Now about the experience and the details.\nALL visitors of Mambi are locals and know each other. As I got to know, they keep coming back because the food is great and cheap, the atmosphere is authentic - it's like visiting a local bar in Dominican Republic where everyone speaks Spanish around you. Some of the guests were singing along with TV  that broadcasted old songs petformed by singers in Spanish.\nIt's not a tourist place, but very authentic and nice. The staff doesn't speak English well. I was lucky that one of the constant visitors saw that i'm lost and helped me to understand how the things work in this place and recommended me what to order. In general, you can order a \"ready food\" like in the dinning rooms (you can see it in front of you, and it's a cheaper choice) or out of the menu that needs to be prepared.\nWe ordered two types of rice, two types of chicken and a pasta. The portions were very generous and we couldn't finish them all. The food is simple, nothing sophisticated but good. I liked the special authentic atmosphere, the music in the background and people singing alon with it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVGRrSlpjSGxNTkZCd2RXOUVhRUV0U0V4M1ptYxAB",
            "text": "Awesome place! Carlos B. is a fantastic server who genuinely cares about your experience and is very personable, attentive, and super helpful  at helping us decide the dishes we wanted to eat. Food was satisfying and We will be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTVRGcHRaR3h3WWpsRllXTjNOVXRwTUdWS1VtYxAB",
            "text": "Good folks and good food 👌🏾"
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbl9DQ2pnRRAB",
            "text": "Excelente... Recomendado"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21selYwUkVVMWQzT0V4VmJHSkZOSFUyVVMxME1YYxAB",
            "text": "⚠️ WARNING TO CUSTOMERS ⚠️\nI ate here on August 5th, 2025 between 11PM–1AM and paid with my card. The staff took my card behind the counter and kept it for about 5 minutes. Within the following week, over $1,000 in fraudulent charges showed up on my account.\n\nThis was the ONLY place I used my card. I was served by a younger female and an older female—it could have been either of them. To the manager: check your staff. You should be ashamed that this is happening under your roof.\n\nTo future customers: BEWARE. Do not hand them your card. What happened to me could easily happen to you.\n\nThe food was whatevers. Not worth the fraud."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nM1IyWldZWEprTTFRNWJFMVhVM1V4TVMxRlUyYxAB",
            "text": "La Latino Americana me cobró $18 por un mondongo"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sV00yUlFjM2hQVmtaMU9HSm5WRjlVV0hRelVuYxAB",
            "text": "This was the worst food I have"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUFVERm9PRWwwVWtwc1JUZHZTVGMwYmpBeVMwRRAB",
            "text": "this place is >>>>>> i dont live by here anymore but i think about her often. 💔"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSFh6RkZRVGQxVFZORVJ6RXdUVkpNYUdwaVRtYxAB",
            "text": "I can't even say how long I've been coming here...at least fifteen years and the food remains fabulous. Everything I've ever eaten from here has been scrumptious. The dishes are authentic, plentiful and cooked to perfection. I regularly traveled from NJ to NY just to get their food. Try them and you'll be a fan for life."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdmVYUnpZbVJHZG5WRGRXSjBZbnB6YjBOVlkyYxAB",
            "text": "I love this place. Food and prices and atmosphere are GREAT!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMGRFOXljVVZKU0VveFJVSjBhMEZzWW0wd1EwRRAB",
            "text": "Food was fresh and delicious. Service with a smile and friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMNlkxcmlFemZpaDJnRRAB",
            "text": "Now this was delicious 😋.  So welcoming and love the vibes"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJZjQyc1BjNmREOU13EAE",
            "text": "As someone eles said attitude for the prices."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKQzBodG42MUttT1VnEAE",
            "text": "I have had way better spanish food."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0M3UyeEpREAE",
            "text": "Great service and food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNNmtfX3FqNHYtR213RRAB",
            "text": "Always a Delight eating here"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNXVQYWRBEAE",
            "text": "Clutch spot great food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbG9mcXJRRRAB",
            "text": "I always call throughout the week and weekends, I came home from work tired and hungry, for a man to answer the phone and tell me after I asked what he had on the line that he's too busy for me to think about what I want to eat that's he's too busy and I need to hurry up, I clicked because nobody should  be treated this way especially after I am a repeating customer and I am paying for my food not begging or receiving it for free."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbmZfZDR3RRAB",
            "text": "Best Cappuccino"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdnREanN3RRAB",
            "text": "Best late spot to get your eat on mangu and everything available is great"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbGF6M2V3EAE",
            "text": "The price of the food was reasonable. The service was good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfLXBHbHJnRRAB",
            "text": "I have been a regular at this place for more than 20 years. Food great and prices really good compared with others nearby restaurant. Sadly I had a bad experience with one short and chubby dark skin waitress who was rude an unprofessional no one but twice with me. I am Dominican I speak Spanish so the language is not the problem but this particular waitress has really nasty attitude and for that reason I am not coming back to this restaurant. Management should be more careful hiring these people. Most of the waitress are nice but this one give this place a bad vibe."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfanM3YnR3RRAB",
            "text": "Can't go wrong any time of the day"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZM0w3b0Z3EAE",
            "text": "It's always a pleasure coming here to eat. I've been coming here for the past 20 years and the food is always good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNU43Ynh3RRAB",
            "text": "Great food fast service and well priced ."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ3QtZnBBRRAB",
            "text": "I've had chicken soup in Latin restaurants at various locations throughout manhattan and brooklyn  but this chicken soup at mambis was by far the best I've had. In my opinion.…"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmaDlhVTR3RRAB",
            "text": "El servicio es pésimo.estube esperando 30 min para que me atendieran en la mesa .tomé un menú estube alzando la mano y nadie se acercó a tomarme la orden que lastima XK la comida es buena pero el servicio es un desastre. Las mesas platicando entre si y nada de atención.pareciera que va uno a ese lugar a mendigar x atención .."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcExLMkFnEAE",
            "text": "The food here is very good.. sometimes the waitresses need to be more attentive but they're getting better"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aGNERUhBEAE",
            "text": "Good Dominican food priced right"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NE1MTE5REAE",
            "text": "Got food catered from Mambi for my baby shower and everyone loved it!! The prices are reasonable, the food was ready on time! Everything was perfect 🤩 please try the pernil"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNmQ3Q0F3EAE",
            "text": "As someone trying out DR food for the first time I enjoyed the breakfast menu where it had fried cheese and salami and the onions. It was really good and their chinchirros was also really good. Their other \"snack\" menu like the fried meat croquette like items  can't be said the same either it was a bit dry when I got there or maybe it's just me not enjoying it due to different taste buds. I would rate it around 3.5 to 3.8 if I'm being honest. I went there on new years and they were still opened and they did their best to provide their service during a busy time."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCN2ZmTnpRRRAB",
            "text": "Update.... Sadly I will never eat here again.. Two nights ago I was served dinner and wasn't even given a glass of water!!! 20 minutes had passed and I got up. Left the food and demanded a cheque...The food is always good really good.. but. There's something Lost in translation. With a Dominican speaking food server who doesn't understand in America you are just that a waitress to be tipped based upon your attention and your service. somehow waitresses have the feeling that they are in their kitchen in Santo Domingo and can choose to service who they want and still expect to tip I find I'm constantly ignored waiting for someone to give me a bill The waitress is  not looking at your progress as you're eating¡!!  they're not paying attention to your needs during the process!!!. This is a classic failure for an American waitress or really in any country.. who is not looking at the person that you're serving to see what else they need and to see if they can finish the meal with an additional sale... it's not the way we do business in America... I think they need to teach them that that you're not in your country You're in America and you're serving sometimes American people.. usually were not used to such a thing. I think there's no malice involved it's just a learning curve on who your actual customer is and what they require and the food is still a great place I eat there on a daily basis because my car is parked across the street in the garage and I will continue to eat there."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbUtmSkJ3EAE",
            "text": "Food just how my mom would make it. A musical bar vibe like my uncle would make it. Overall an excellent experience just what I was looking for visiting NYC. Service wasn’t the fastest but great nonetheless. Fresh hot food and mangu 24 hours! I mean come on…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMybUphYmpnRRAB",
            "text": "Awesome late night, fresh and authentic Dominican fare. Full bar. I had fried bass with vegetable and bean rice. My friend said his Cubano sandwich was fantastic. Maduros we're also great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHam83cVF3EAE",
            "text": "Great Dominican food! Had the pernil which was nice and juicy! Their bisteak sandwich was good but definitely recommend the pernil. Friendly staff with the typical Dominican restaurant ambiance (loud music in the back, small space and a lot of people). Very reasonably priced- would definitely recommend"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzeWZpNEtREAE",
            "text": "This is my favorite place upon entering NYC from the George Washington Bridge. It's on 178th I forget the name of the street but it's one st down from Ft Washington. The Bistec is one of my all time favorites!!! Service is great, food is…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBb196OVZREAE",
            "text": "The food in this place is more than AMAZING. I have never had such a good. Every time my husband and I go here we get it. I really wanted to give Mambi a 5 star rating, however, the service really sucks. It is a very busy place and the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6emRfekpBEAE",
            "text": "Classic Latino diner with excellent food. Definitely get the chicken soup, or watch what locals order."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOE5hcHNRRRAB",
            "text": "Cool little spot to hang out and listen to music while enjoying some good food. The bathroom needs to be cleaned though. I skipped using it."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSa1oyeHRRRRAB",
            "text": "Entonces, mi amiga y yo decidimos entrar a este restaurante en realidad somos del vecindario. Crecí viniendo a este restaurante. Solo tengo años que realmente no he estado en este restaurante, en particular. Hace mucho tiempo, mi padre trabajaba como chef en este restaurante, está así que por alguna razón, estas personas nos dieron una actitud extraña y mocosa. Hablamos con la señora del mostrador, le dijimos que queríamos sándwiches de bistec, agua gratis y un refresco. Tardaron 40 minutos en darnos algo. Tuve que pararme y decirles que quería mi pedido y encima pedí una carne de quipe que costaba $1.50 cada porque eran 2 nos cobraron 28.99 los sándwiches costaban $17 cada sándwich costaba $8.50 los quipes costaban 1.50 más un refresco y el agua gratis. La camarera nos cobra 3 por el refresco y los quipes, cada uno de los cuales llegó a $ 28.99. Entraron otros dos clientes. Consiguieron su comida más rápido que nosotras, y pedimos un sándwich, y les preguntaron si querían algo de beber, por lo que encontramos eso bien rarro que a nosotras nos dejaron esperando. Nunca volveré a entrar a mambi, si el gerente o el jefe alguna vez ve esto, actualice a sus camareras para que puedan atender a todos y cada uno de los clientes que entran en la forma en que se supone que deben ser atendidos. Oh, se me olvidó de los sándwiches, estaban fríos por cierto."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeXREbkNBEAE",
            "text": "I bought 2 “sanduches cubanos” because it was recommended….  The sandwiches were not bad… sorry but they were disgusting."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1M3NqcG9RRRAB",
            "text": "Go for good food and decent prices, not the ambiance. It’s like a very crowded cafeteria always."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVM2EtMThBRRAB",
            "text": "Cheviche and chicharons for breakfast! Yaaasss. It was an adventure my friend took me to in the heights and i enjoyed it sooo much. We had pasta and ham sandwiches as well and a burger to go for lunch all just for $46. Great value and great food. Super popular.  American diner set up meats food court in a very organized display. Impressive.\nDominican, Dominican, Dominicaaan!!! Lol\nLoved it!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicXBiWTFBRRAB",
            "text": "Riquísimo este lugar es mi nuevo spot para cuando salgo del jangueo tienen absolutamente todo lo que quieras comer rico y en cantidades grandes lo mejor 24/7 abierto"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbnBQRTZBRRAB",
            "text": "Great food ,nice atmosphere will definitely come back again ,highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNGZHN2RnEAE",
            "text": "** some of these reviews are racist ,\nthe service is good.\n\nThey speak mostly Spanish but make a great effort to communicate with everybody and the menu is translated.\n\npeople complaining about a Dominican restaurant in a Dominican neighborhood having Spanish speaking staff are entitled and not the target audience.\n\ncome here if you want an authentic experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOXJpMEJ3EAE",
            "text": "The mofongo was amazing! The service was very slow but I'm happy anyway"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxeUpYeVJBEAE",
            "text": "Had a “Carnival del Barrio” here recently. Seated 21 of us with ease and had great service and authentic food. Food took like 20 minutes to come out so enter with a little “Paciencia Y Fe”. A bit warm so dress comfortable but nonetheless a great experience."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRNi0yMkRBEAE",
            "text": "I was in the Heights and wanted some mangú, found out about this place by searching Google maps it was right across the street from the IHOP my 4yo wanted to eat so I went and right away you get a sense of community. Reminded me of the vibe of restaurants in Dominican Republic. It was mid afternoon so I didn't think they'd have mangú, she told me they did so I ordered it. I'm not exaggerating when I say it is the BEST MANGÚ I'VE EVER HAD. It was SO smooth but not watery, it had a a great texture and was just perfect. My eggs and cheese were made to order. Great service, was in and served within 5 mins if that. Just great. They have a lot of food choices too, Dominican cuisine. They have meals, cuchifritos, sandwiches, beverages (natural juices and smoothies too), a bar I didn't ask but I'm sure they have desserts. If you're in the heights and want some AMAZING Dominican food for a good price Mambi is the go to. If you go before 11am you can get the mangú for 4$, I paid full price for after breakfast and it was still worth the money."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzM2NDWUlREAE",
            "text": "God forbid you speak the English language at this establishment. If you do, you will be treated like a second-class citizen. They will give Spanish speakers more food, better food, and excellent customer service. But if\nyou dare speak English, they will ignore you, give you small food portions and demand a big tip. To the owner of this establishment: I have filed a Civil Rights Complaint with the City Of New York.\n\nAbsolutely horrible establishment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OTlfNldBEAE",
            "text": "Food is fresh and quick. The service is poor. The ladies here take their time and don't have a sense of welcoming the customer genuinely.  It is a fast spot for dominican food.  It is open late and convenient location: a few blocks away before the highway entrance."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2NXFlcElREAE",
            "text": "I love this place ❤.  The food is always fresh and pretty good! The Yuka rellena is one of my favorite appetizers."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbzVQN3lBRRAB",
            "text": "Its a nice place in Washington highs they have a nice and clean place the staff working there are very friendly. Food was great and the little bar there was very convenient. I. Definitely go back"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcUlPVlF3EAE",
            "text": "I really want to like this place because the food is great but the service is really poor if you are not Latino and can't speak Spanish. The menu prices need an update as the mofongo with chicharron states $13 but is now $18. The best mofongo I've had though ..hands down. The Dominican breakfast is very good and still $10 for 3 meats with base..I like their mangu. To the owner..please hire a staff member who speaks English and can assist your English speaking customers because you have lost people with the service you have based on reviews.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOE5LNUVREAE",
            "text": "Best place to order latin, dominican food! Service is great, sometimes a little slow. The sitting area is tight, a bit noisy, you almost feel like you are really eating at a restaurant in dominican Republic, which in a way is beautiful because it gets you out of the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMVBlLTd3RRAB",
            "text": "Great Dominican restaurant in little DR. Very reasonable for what you pay. We got a cubano, roasted chicken, and goat guisado—all were very tasty, and the goat was very tender. Great service even though they were busy. A little noisy but tolerable (I’m hard of hearing so may not bother others) Would definitely go back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MnNDa3FBRRAB",
            "text": "FOOD is trash, very unimpressed of how bad this place tastes had high hopes\nVERY disappointed\nAir conditioning by our table was LEAKING"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJeUwyQ3l3RRAB",
            "text": "So much food choice. I love this place anytime of the day or night!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MTZhSjFnRRAB",
            "text": "This is a legendary place for me. I've been going here since I can remember hanging out in the heights. The food never disappoints, and if it ever does, the other options make up for it. Love this place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbWJtWHlBRRAB",
            "text": "Generous portions for pretty cheap prices depending on your choice. Both my companion and I had to take at least half of the meal to go."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeHBxLVd3EAE",
            "text": "All good. From food to service.  The proper dominican fare."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcTdpZk5REAE",
            "text": "My mother in law always raves about this place. Visited her and we went to Mambi. We ordered white rice, beans, and fish, a piña colada, and a fried yuca ball with meat filling. All of the food tasted good. The next day she asked what do you want from Mambi, I said bring something different to keep tasting their menu items. Every visit we order something else and have yet to be disappointed. It's a tight space so I would order to go. I would also look at the food and or menu before even asking for help simply because things appear to move at a fast pace. Even so, I assure you they will take their time with you if you need it."
        }
    ],
    "reviews_count": 65
}