{
    "name": "Chez Messy",
    "place_id": "ChIJOc6gA9X3wokRu5v-fpKFkBs",
    "grid": "MN12",
    "address": "5 Edward M Morgan Pl, New York, NY 10032, USA",
    "rating": 4.7,
    "user_ratings_total": 223,
    "phone_number": "(646) 476-2700",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNk5Fd3lNbTVTZGxJeVRYbGZlVE5NY0ZWbFkzYxAB",
            "text": "Food poisoning alert!\nA few hours after eating here, I was sick all night.\nHorrible hygiene standards.\nStay far away from this place."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVGIyOU5WbDlvWVhCUmJFRTBhVTF3ZDNkQmMyYxAB",
            "text": "Service took forever, and the food wasn’t worth the wait.\nOverpriced and under-seasoned.\nThe waiter was rude when we asked for the bill.\nOne star only because zero isn’t possible"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eWNUbEZTRFkxU1ZremJVTkNVMmRUWnkxS1VtYxAB",
            "text": "Food looked good on the menu but not on the plate.\nMy pasta was undercooked and bland.\nTried to complain, but no one listened.\nSave your money and eat elsewhere."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNU9WRjFRVUZ2WTBzdGRXYzFPRVZaUzBaWFdGRRAB",
            "text": "I’m visiting my mom from Los Angeles, and as we planned a night out together, I wanted to support a local spot. There’s always something new whenever I return home, and this time it was Chez Messy, just around the corner from the 157th Street train station. Perched up upon a small staircase, this two-floor restaurant is intimate, cozy, and deeply sultry.\n\nNestled in the heart of Uptown New York City, a neighborhood known for its Dominican roots and growing diversity, Chez Messy shines as a Spanish Caribbean infused gem that took my breath away. The space feels both refined and familiar, elegant yet soulful. As I sat waiting for my mother, I opened the menu, and immediately everything called my name.\n\nOur server Joshua was an absolute delight, attentive, kind, and confident in every recommendation. Antonio, the owner and floor manager, greeted us with charm and poise. Dressed in a sharp suit, he exuded pride and grace, the embodiment of someone who deeply loves what he has created. What touched me most was realizing that this Spanish Caribbean dream of a restaurant is owned and operated by Dominicans. As someone who has traveled the world and eaten in countless hidden gems tucked along cobblestone streets, I can say this place holds its own among the best.\n\nWe started with a crisp glass of Albariño and dove into the pulpo and mofonguitos filled with ropa vieja. Let me start by saying I’m not typically a red meat superfan, but that evening I was completely transformed. The ropa vieja was tender, savory, juicy, and full of flavor. The plantain cups that held it were subtly sweet, creating a beautiful harmony between bold and delicate notes.\n\nThe pulpo was perfection, tender octopus paired with a light touch of vinegar and oil, thinly sliced onions, capers, and cherry tomatoes that burst like little jewels of freshness. It was bright, balanced, and refreshing, a perfect prelude to what would become an unforgettable meal.\n\nThen came a surprise from Antonio, the avocado salad and batatas bravas, further inviting us into the full Chez Messy experience. I’ve had batatas bravas in Spain and beyond, but these were divine. Perfectly crisp on the outside, soft and creamy on the inside, with seasoning that danced on the palate. The avocado salad was heaven itself, silky avocado paired with slivers of almonds and a hint of citrus, perhaps grapefruit, creating a beautifully layered bite that was both rich and refreshing.\n\nBy the time our entrée arrived, filet mignon and shrimp in cream sauce, medium rare, we were already swept away. The filet was tender and bursting with flavor, the shrimp perfectly cooked, and the cream sauce was so delicious that I found myself tempted to lick the plate.\n\nEverything about our experience at Chez Messy was divine, from the impeccable service to the romantic, dark, and dreamy ambiance, the vibrant music that moved through the air, and the drinks that sparkled as much as the conversation.\n\nChez Messy is where you go when you want great food in a wonderful location, when you want to feel inspired, seen, and transported. It is a love letter to Spanish Caribbean flavor and Dominican pride, wrapped in elegance and joy.\n\nThis place deserves to be full every night, though a part of me secretly wants to keep it all to myself."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BdGQyOTVaWEJsZVMxd1lrTjJXR0ozUkRoalUwRRAB",
            "text": "Always a great experience and delicious tapas.  Staff is friendly and attentive.  I love this local spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UVRHbFlUVXhMU0VWc1VWaEJXRmhuZEVGMmJYYxAB",
            "text": "Food is great, drinks are pretty good, service is a bit slow. They only had one server for 6+ tables that night, I would’ve had one of the two bartenders help out instead of standing there on their phones. Food was great, bone marrow needs more toast"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbE1sUnVaekJNV0MxSFRrZzNORzFIYW1sdFYzYxAB",
            "text": "Came for brunch and ended staying till dinner. Great service, food & presentation were on point and ambiance was chill. Great place to g9 catch up with friends"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT2JtSkxOME5QZFV4d2RsZG5OMU42VWxkYU1IYxAB",
            "text": "This place is an absolute gem! From the moment you walk in, you’re greeted with such warmth and hospitality that you immediately feel at home. Antonio and his staff go above and beyond to make sure you’re taken care of. There truly amazing welcoming, attentive, and passionate about making every guest’s experience special.\n\nThe food? Outstanding. Every dish is packed with flavor and clearly made with care. The drinks are just as impressive perfectly balanced and crafted to complement the meal. Whether you’re coming in for a casual bite, a night out with friends, or a special occasion, this restaurant delivers on every level.\n\nHighly recommend it’s one of those rare spots you’ll find yourself coming back to again and again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbVdFTkNVell3WjJGdWVWUlRhSE5yTTNwRU1uYxAB",
            "text": "Everything about this place is absolutely amazing! The food is bursting with flavor, the drinks are crafted perfectly, and the ambiance is lovely. The staff is warm, attentive, and genuinely makes the experience even better. From start to finish, it’s nothing short of perfection. I can’t recommend it enough. This has easily become one of my favorite spots!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TVZGWm9jbFJ6TlZCeE5XdEhUM0psUzBSRGEyYxAB",
            "text": "I LOVED THIS PLACE, From everyone, the staff , the bartender, the bouncer , the music , this is such a good place and it’s my favorite place now !!!! 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GYVVGbDVWVGxYVFZjMWJWazFiMmN0YUhCNWMyYxAB",
            "text": "An unmatched restaurant in the city is Chez Messy in Washington Heights. The service team is warm and welcoming. They have a mouth-watering menu that only Chef Xavier can cook up.  You cannot go wrong with their blend of cocktails; it will have you screaming “ mas.” If you love octopus, a must-have is Pulpo à la Vinaigrette.  The music and disco lights create a mesmerizing ambience. Come experience the talk of the town."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseFNEa3hOakZYU0ZSV2MyOURkbEpYTTNWYU1FRRAB",
            "text": "I live in the neighborhood and a place like this is gold. However, while the food, decor and staff are great the music (which is actually very good) is just way too loud. I love the night club-ish look they are going for but for a pleasant dinner experience the music needs to be notched down a bit. You can not hear the person you are sitting with and that makes this place less desirable for a date. Not really sure what they are thinking - even the very young couple next to us were annoyed. Such a small tweak and this place would be amazing. I might go back alone and sit at the bar but unless they decide to keep the music at a reasonable decible level then I will need to keep going further downtown. My suspicion is that the manager/maitre d (who is very hospitable btw) keeps the music loud because he is not dining and wants the place to feel like a club - this is a huge mistake. I really hope they take this review seriously. I have heard this complaint from others as well and after experiencing it myself I have to agree 100%"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSlFuTktjSEpXTUZkTFNHZzVVbGwxVmpGUWVsRRAB",
            "text": "A hidden gem in Upper Manhattan. This cozy spot offers first rate food and live music on selected nights. Elegantly attired manager Antonio runs a tight team. Spread the word!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRVVUUnVjMFpvV0RkaGFWTXRNRTFIUkdaMmJWRRAB",
            "text": "RAY is THE BEST DH IN THE WORLD"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodlJXNWtlRjlGTTB0SmRrbFFPR2hUYVVWRU4zYxAB",
            "text": "Live a 10 min walk away\nJust by chance we tried the place out on a Wednesday night. LOVED IT! LOVED IT! Great food, service, and... CLASSIC SALSA BAND. We had the charcuterie board and bang bang shrimp which were great. Wine was excellent. Dessert was tres leches with cinnamon crunch cereal which was cute. Wait staffer was knowledgeable and trained. They are really trying very hard to provide a great experience. I can't wait to tell all of friends and return with them!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeGJVTlhkMTlYVW0xTmNtVlVTbXhKVHpoT1pIYxAB",
            "text": "Recomiendo mucho este lugar tiene un ambiente increíble la vibra, los tragos y la comida es lo mejor que hay"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KR2N5MHllR3d5TVZGME1WSm1XbFJzWlZKdlRVRRAB",
            "text": "Just extremely disappointed. The marrow bone was way too salty. The croquettes just didn’t taste right. The fried artichokes were so-so. The chicken wings average at best, I was really hoping for better. I will not be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM1ZrZEJZemczYnpZNE1rSTRha0oxTFd0alkyYxAB",
            "text": "What a gem we stumbled into on a Saturday afternoon. Open view to the kitchen where the chef was pumping out amazing tapas. Cocktails were memorable and exciting. Ownership treated us like regulars. Could not ask for more!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNk1GbGpRMjV2WVVVeVJWVXlSbU10TjB3MGNGRRAB",
            "text": "Came here with my sisters to celebrate one of their birthdays and we had such a great time! The staff was super friendly and made us feel welcome right away. Our server, Deirdre, was polite and attentive. The food was delicious, the ambiance was beautiful, and the music really set the vibe. They even surprised us with a round of shots on the house for the birthday, which made the night extra special. Definitely a spot I’d come back to and recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSVJ6SnVZVmxOY25SUlpHWkxWa2cyZUc1eVNIYxAB",
            "text": "A literal hidden gem! I absolutely love this place. My husband and I just walked in 30 minutes ago and already I’m in love. The vibe, the service, the drinks, the food— TOP notch!\n\nYou don’t have to even think anymore. Just come here, trust me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNFUwTk5NRTFyZDNWMFRpMUNlbGxUYXpscVVYYxAB",
            "text": "It’s small cozy restaurant,  the food was delicious. Had the tuna tartare and the ropa viajo mofongo for appetizer, steak for dinner . Our server was tentative but her shift finished and she left , her understudy trainee is ok . Over all it’s a good experience , a place to explore and experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnM2NuRkZUMnRKUzE4NGRrYzJaMUpQWVhwNlpGRRAB",
            "text": "So happy to see this in my neighborhood! Food is excellent (be sure not to miss the papas bravas!) and service is wonderful. Deidre was kind and efficient.\n\nThe only thing is I wish the music was a bit quieter and the ambiance was a bit brighter. It was very difficult for our phones to capture the QR codes because it was too dim. Perhaps some LED lamps on the table would be helpful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUllVdzRYMGN5Y0cxbmNsZDVOSGRyV2paeU5sRRAB",
            "text": "Don’t normally leave reviews but this place was really good. Our server Deidre was really nice and knew the menu well. Food was great. Only thing is music was kinda loud so hard to talk, but still had a good time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNFgyTm9PVk54YURGeWIwSXdjWGh4YmxoUFEzYxAB",
            "text": "Very cute spot, ambience and vibe is great. Good specials"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUVMzWmlja296T0haT01tWkhOazlpWVRGZlRXYxAB",
            "text": "Uncomfortable vibe. Way too loud with the live music that my ears were ringing when I left. My friends stayed to party, but I didn’t feel comfortable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbk4zQlFMVVF0VnpCUFgyMVlhMWQzVkRaQ01FRRAB",
            "text": "Great spot for a drink! Deirdre was very attentive and kind"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdGFqRnlkbVUyTXpsM2NrMXFSM1ZWY2pCc2FXYxAB",
            "text": "ray is literally the best bartender. he treats you with so much respect and honestly is the best company ever. he is the best conversationalist and has the best music.…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wc2IwMVhObVF6TTAwMVluSmZVVGQyYVhCMlJIYxAB",
            "text": "Great service! Great food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkU1lscHVjak5YT1haR1YyeDBZazA1TTIxeWRHYxAB",
            "text": "Yikes. Women steer clear of this place. The predatory behavior by the men that seem to run this place is beyond creepy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobk1YSlBSbWxrWjNrMGVFdzJabDlEU21kV1FWRRAB",
            "text": "I drove in from Connecticut and highly recommend this place. The service, food and drinks were amazing. The ambience was perfect for all occasions whether dinner, brunch or stopping by with friends for a drink. I will definitely be returning very soon with a group of friends. Great vibe :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSVowSTJhVmM0TUdkcGRXNU9UV0V3UkZONE5IYxAB",
            "text": "Since the moment I walked in attention to detail was on point .. music was great and so was the ambiance . bartenders pay close attention to details and make the best drinks .. I wasn’t sure what I wanted to drink or eat and they asked what are my preferences and their recommendations were spot on .. I had their sangria and their steak which was cooked to perfection ..  much needed addition to the neighborhood..  My new go to spot !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQlgxOVlWRXA2WWtreWJrUnJhRTgwWVdRdFNVRRAB",
            "text": "I have to say,,, best experience of my life!! What a wonderful place. The detail and outstanding service. I cant even!! 100% recommend. Great food, great service.  I feel at home."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNlYxWlBWRzh6Ym1GWVJuTnBTVzFEVUhWbVZXYxAB",
            "text": "Omg omg omg !!!! I love RAY AND THERE TEAM !!! Great human Beings!!!!! I felt welcomed and loved and food on POINT !!!!! Music on Motions !!!! Yes I’m coming back again but With my GIRLS!!!! And FAMILY !!!!!! Best place to eat n enjoy the music even the team makes u feel like we ALL FAMILY !!!!! I’m definitely coming back AGAIN AND AGAIN ! Plus the way the sun shimmers on top of me feels great ! Thank you !!!!!!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbWVUUkJabmh2WldSNlZYUmpjVTFNYW1KbVRVRRAB",
            "text": "Todo fue una experiencia de siguiente nivel. El personal del restaurante nos hizo la mañana y la tarde. Felicito a Joshua y Xavier por la comida y la atencion que nos dieron. La comida puede aspirar a michelin gracias al Chef Xavier. El servicio de Joshua fue exclente y todo a la perfeccion. El mejor restaurante de tapas."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVlpXMXVNR3hPZVRNMlFWSTJNa3RCUkcxNGIwRRAB",
            "text": "Diedre was a great server. Very attentive and polite. Would done here again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNU5IbzFZM2N3Y0doeU1IQXlVa05YU2tSdmJGRRAB",
            "text": "Deirdre provided exceptional service during our recent visit. She was attentive, knowledgeable, and made excellent recommendations from the menu. Her friendly demeanor and prompt attention to our needs made our dining experience truly enjoyable!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NFV6bE1RVUU0VURGTVpUUklWSGRhZVRCa05sRRAB",
            "text": "I just went for a music and drinks to meet up with friends."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSE4zZzFUM3BaYTA5Rk4zSmZiVWsxYjJKbFdsRRAB",
            "text": "Five of us went to Chez Messy. The food was delicious and  beautifully presented. We had the octopus appetizer as well as the shrimp in garlic sauce. Yummy. We had the churrasco with tostones. The steak was nicely cooked and seasoned. The tostones were big and crispy. We also had the chicken wings and the chicken entree. We enjoyed them all. The ambience was nice and mellow with good music. Our waiter, Joshua, was excellent: friendly, very knowledgeable about the menu, AMD made great recommendations. The drinks were really good, especially la mula and the lychee martini. We will go gain for flamenco night."
        },
        {
            "date": "3달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMlFsRXpUbmxKUWtGM2VFaFdWVkJ4YTJsemNsRRAB",
            "text": "Sehr freundliches Personal! Wir hatten eine grosse Party! Sehr gutes Essen und Getränke! Gerne wieder und liebe Grüsse aus der Schweiz"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sc1VVSjJUVGM0WlROVUxYRlVhV3QxUlhWcWJrRRAB",
            "text": "We had a great boozy brunch here. Decent price for the amount of food. The eggs Benedict was really tasty!\n\nMargs were good and flowed.\n\nWe loved Diedre, our server. So sweet.\n\nLook forward to coming back and trying the dinner!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVFMxZElVM0l3YTE5R09XcElWVWxRTVU1WGNtYxAB",
            "text": "Chez Messy’s interior design is simply stunning  and truly one-of-a-kind decor.\nWith that being said, the atmosphere at Chez Messy was electric last night‼️\nWe were blown away by the live music and spent most of the night on the dance floor💃\nThe staff were wonderful and all the dishes were scrumptious.\nDiscover the magic of Chez Messy -a night of amazing food, craft cocktails and a captivating experience‼️\n\nAmy Roberts"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbWNYbFdiMlZqUWpKWFkzWklWRGN6YlRseUxWRRAB",
            "text": "Super cute intimate place. Great to come on a date and enjoy great music, food, and drinks. Live music was excellent, would definitely return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbWNGTjVPVVJxU0VWa1NqZERWVGg2UVRoQ1lrRRAB",
            "text": "I came here with a lovely date and was taken care of by waitress Deirdre and server Joshua. They were attentive, friendly and made our dinner so special!! Will definitely be coming back :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUWFVOVNhM1U0U2pkc2VrTkRPV3BMZEhGU1JVRRAB",
            "text": "Amazing service, incredible bartender Ray who comes from some of the best craft cocktail bars in the city and now giving Washington heights that same love. Greats tapas and happy hr."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweVN6ZDNOVk5qYTBaeExWVmhWRmRMVDBka09FRRAB",
            "text": "Una súper experiencia de restaurante. 100% recomendado, sus platos de comida están del siguiente nivel incluso para estrella Michelin! Ray, Joshua y su equipo nos cuidaron y se aseguraron que no nos hiciera falta nada a la mesa. Los tragos, la experiencia, la comida, recomendado para todo público."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psR09Xc3phMjlOV0VkRVQxZzRaRnBYVjBwdFJuYxAB",
            "text": "Manager Antonio and waitress Luna were absolutely amazing!!! We celebrated a dinner for my best friend’s engagement and honestly would not do it anywhere else. We were attended to for all our needs and spectacular service given by staff especially those mentioned above."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWZll5MXRVVGQwTVdac2RUTlJUSGRsZGpkaVJtYxAB",
            "text": "My bar to go, excelente food and the beat cocktails in the area."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsYU0yaENNRm96TVc1aFJYbFhlVlV3YWs1TWFrRRAB",
            "text": "Chez Messy absolutely nailed it. From start to finish, the experience was top-notch. The cocktails were phenomenal—huge shoutout to Ray, the mixologist, for crafting drinks that were as balanced as they were creative.\n\nThe food? Simply outstanding. The burger was perfectly cooked and packed with flavor, but the real standout was the octopus—tender, flavorful, and unforgettable. Clearly, the chef knows exactly what he's doing.\n\nSpecial thanks to Antonio and Joshua, who went above and beyond to make sure we were comfortable and well taken care of. Their hospitality was warm, attentive, and genuinely appreciated.\n\nHighly recommend Chez Messy—already looking forward to the next visit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa1ZUWTNha0Y2TmtWM1ZFNHdSRzFJUzNOTlRXYxAB",
            "text": "I came to Chez Messy for the first time last week to celebrate my best friends 40th birthday and wow! What a time we had. Every single tapas we ordered was delicious. The cocktails were fresh. The ambiance and service was above and beyond. All of the staff made sure my best friend had a beautiful experience celebrating!!! We will definitely be back soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxZlpubGxXa2hCTWtoMlZ6a3dUVXR1V2xscmEwRRAB",
            "text": "Absolutely 5 stars! 🌟 From the moment we walked into Chez Messy, we were welcomed with open arms by the incredibly warm and friendly staff— Ray, Antonio, and Joshua made sure we felt like family the entire time. Their hospitality is next level; they were attentive without being overbearing and took the time to recommend the best dishes and cocktails to suit our tastes.\n\nThe tapas here are a dream, and the location is perfect for a relaxed evening out or a special celebration. Everything was fresh, flavorful, and just bursting with authentic taste. If you’re a fan of grilled meat, the churrasco is hands down the best I’ve had in Washington Heights—tender, juicy, and seasoned to perfection. It’s worth coming just for that!\n\nLet’s talk cocktails— wow. These aren’t your typical drinks. Each one is beautifully crafted, perfectly balanced, and creative in a way that makes each sip an experience. From the first to the last, they kept surprising us with unique flavors and combinations that hit all the right notes. You *have to try them!\n\nAll in all, Chez Messy has definitely earned a loyal customer in me. The food, the drinks, and the service were top-notch. Highly recommend this gem in Washington Heights—you won’t be disappointed! 🙌🏼"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdUl6ZVNlOU9PckF3EAE",
            "text": "Can’t wait to go back! This little place is a hidden gem. Antonio and his staff paid attention to details and made our night stand out. We arrived on a Wednesday during happy hour. All of the tapas plates and desserts were delicious. Their cocktails were well crafted. The atmosphere was lively and fun. This particular evening, they had a great salsa band perform. Everything was so enjoyable. We had a great time. Would definitely recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JdFVVVlFlWEo0UkV0M2JrbFFSak41YkZsMlpWRRAB",
            "text": "Had an amazing experience at Chez Messy!!! Loved the atmosphere, the food was fantastic, and Joshua took great care of us. Compliments to Chef Xavier too because he had the Midas touch for sure. Loved coming here and will be back again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4aVRXRlhNemhPTkZCRlZrWnhValphUkdSMGNGRRAB",
            "text": "I completely understand why this place has a 5 star rating!\n\nEVERYTHING from the vibes to the food, drinks, and staff is absolutely on point. I had the privilege of trying a new dish: the Citrus Meat Butter 🧈 🦴 (Bone Marrow), and let me tell you, it gives Michelin star energy. The marrow was perfectly cooked — creamy, buttery, and savory — and paired beautifully with a bright, fresh arugula salad. 🥗 The dressing was light and citrusy, cutting through the richness just right. The grilled crostini 🥖 ? Chef’s kiss.\n\nI tried their Old Fashioned; 🥃both smoked and unsmoked. It was excellent both ways. The Smashing Berries cocktail, which was strong but balanced with just the right amount of sweet and tart.\n\nI happened to visit on a Thursday and was pleasantly surprised to discover it was Ladies’ Night 🥳happy hour all night for the ladies. I Love a good unexpected perk!\n\nThis spot is a cozy hidden treasure, and I can already tell it’s going to be my new goto. I Can’t wait to come back and explore more of the menu.\n\nI will say this if they release more items like the bone marrow, I really don’t think it will be long until the secret is out.\n\nOh, I found out at the end of the night they have hookah too. 🤷🏽‍♀️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3X2Z5VGNBEAE",
            "text": "Everything was phenomenal. From the minute we sat down, they were attentive and sold us on the mofongitos and the shredded beef empanadas. They were so good, but my favorite was the mofongitos, the sweet plantains with everything on it was amazing.\n\nMy girls and I ordered mojitos and margaritas for drinks and it was so nice and refreshing. I ordered my mojito with no simple sugar and it was still well-balanced and easy to drink."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsb05sWjJPVlp1T0RkWFJqVnZhM0U0WW5WTWNGRRAB",
            "text": "My coworkers and I had a great time after work. The server Joshua V. was very friendly and attentive. Great chef too. Shout out to Xavier."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acVYwSkdURVZ3WlZCTlRYZG1YMTgxZVdkSlJuYxAB",
            "text": "This is a great local spot. The atmosphere is awesome. The drinks are strong and very tasteful. We had the suckling passion. 🔥. The tapas are delicious also. Especially Papas Gravias! 🤤😋\n\nAntonio, the manager was wonderful. Gave us a tour and everything.  Made us feel right at home. We definitely recommend this spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poR2FIQnRUR0p6Yld4dVJsUmtMWE15TWpKWVVsRRAB",
            "text": "Such a hidden gem! The food was delicious - they have great tapas. I didn’t try the cocktails but the house wine was very good and I hope to come back soon!! Joshua and the staff were super kind and attentive."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNnBIdGxnRRAB",
            "text": "This place is a vibe. I’m a regular and they always make me feel so welcome. I love coming in for flamenco night on Wednesdays. I also brought my mom and grandma there for Mother’s Day and the head chef Donna came out to personally introduce herself and offered my family complimentary dessert. You can tell the chef really takes pride in her work and she makes everything with love. Ray is amazing. He always takes great care of me and makes great drinks. Josh, Ricardo and Gigi are great as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUG9pZm4yc2Z2X1pnEAE",
            "text": "I’ve been visiting Chez Messy since they opened about 2–3 years ago, and I’ve probably been back at least seven times. At first, I stopped by just because it was down the block but I quickly fell in love with their drinks and this amazing tapa they used to serve mushrooms with scallops and toasted bread. It was absolutely delicious!\n\nI went back recently after seeing their happy hour promo on Instagram. I hadn’t been since the winter and noticed there was another staff change, but the vibe was still on point. The manager, Antonio, was fantastic super welcoming, always checking in to see if we needed anything, but never in an overbearing way. I mentioned how much I missed the mushrooms and scallops dish, and to my surprise, he brought out the chef to chat about it. That was a really cool and personal touch.\n\nOverall, Chez Messy is a chill, stylish spot with great music, upscale aesthetics, and an inviting team. The drinks are strong and tasty, the food is flavorful with a spicy twist, and bonus they serve hookah too if thats your thing.\n\nIf you’re looking for a relaxed yet classy place to hang out, I definitely recommend giving Chez Messy a try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNkpHaEhBEAE",
            "text": "This place is a hidden gem! The ambience of the restaurant is beautiful. I feel like I want to take a picture of the whole place. Messiah was very helpful along with Landon. I enjoy the DJ too. The staff was on point and attentive.. the food was absolutely wonderful..very tasty and well seasoned. My friend came with me and enjoyed the food as well and the desert.. I can't wait to return .I advise anyone to come to this restaurant.. today's low fusion spot that you would enjoy. Just make sure you make that right turn if you're coming from uptown on Broadway or else that left turn and you will see it.. KUDOS TO THE SPOT AND I WISH THEM WELL.."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbThxZ2lnRRAB",
            "text": "I really wanted to love this place but unfortunately falls short for me .  I do believe the food was overpriced for the portions you receive. The seating is very tight. We had reservations but was pushed upstairs but the couple that came in directly behind us didn’t and were seated at a more comfortable table downstairs. how do I know ? Because the host asked all of us if we had reservations To be honest I would have left for that reason alone but I drove and just parked after looking for parking for about 45 minutes, So on that note public transportation is highly recommended. I would say that if they had a promotion I would revisit but then again We went during restaurant week but was not offered the promotion by the waitress that was promoted on instagram but I didn’t mention it because when I did the math after looking at the menu the “promotion “ was MORE expensive than ordering everything individually. It was on a Saturday. (Still valid during my visit)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGczdiTlR3EAE",
            "text": "Upon arriving, my BF and I were given a free mini sangria drink and an olive-prosciutto to start… let me just say the sangria was sweet and tangy in the most delicious way and the app wasn’t bad. Overall, the prices were super reasonable and the flavors in each of the tapas were memorable. Will have to come back for their Wednesday night flamenco dancers or Thursday night magician as we missed it this time around. The ambiance and decor is cozy as well and the service was on point."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aYVNYVllTRE4xVEZOaGFtVnhiek5XYVVGelkxRRAB",
            "text": "Honestly, this place is SUCH a vibe!! The ambiance, the food, the drinks ~ EVERYTHING!! Also the music is fire. I’m leaving this review after my first time here, but, I will definitely be back because I had such a great time! Ray, the bartender, took care of us and made our time unforgettable.\nAlso great photo oops!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQSzZxNnFlbWZ1QzRnRRAB",
            "text": "Service was extremely accommodating from the moment my sister and I walked through the door. Antonio was very attentive to our needs, and went above and beyond to provide us the best service possible. The mofonguitos were absolutely amazing and tender, and would come back even just for that. I would recommend this place to anyone in this area and in NYC. Our server, Joshua, was very knowledgeable about the menu and each wine. He made sure we were taken care of, and never had an empty glass. The atmosphere is unique and consistent, the attention to detail is shown very clearly. 10/10 all around!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweHMyN1hnEAE",
            "text": "My friend stumbled upon this place. We both live in the neighborhood. We THOROUGHLY enjoyed our evening with Chez Messy tonight! IT IS A GEM!!! Absolutely GORGEOUS inside!!! My friend and I were totally obsessed! The cocktails were so good and the tapas were delicious! And how do you not love complimentary sangria upon seating? We are so excited to have such a nice spot in our area!! Very excited to see live Flamenco on Wednesdays! Thank you to Laura and Alexis for taking such great care of us!! You both are gems!! Can’t wait to go back! Much love, Chez Messy!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJemM2ektnEAE",
            "text": "My friend and I stumbled upon this spot trying to find late night grub and drinks and did we FIND IT. From the moment we walked in, we were greeted kindly and taken care of instantly. Kitchen was closing and they accommodated us with delicious apps. Croquettes, empanadas, grilled wings, and papas DELICIOSO! The house takes care of you, DJ late nights, hookah if you’re into that. Good vibes, great food. Gotta give it a try"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNzh2MFhBEAE",
            "text": "Their dine in experience and service is excellent. Their takeout seems a little rushed. They could have been very busy because they have never disappointed me, but I will probably just dine in next time. This was my nearly $12 cheese tapas. Ummmmmm."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzd0lTQW5BRRAB",
            "text": "I was exploring the neighborhood and this was no \"the list\".  I was not disappointed! (other than they were out of the Haricots Verts Lyonnaise! I have to com back for them...)\n\nThe food was great and the service was so friendly and welcoming.  I sent pics to a friend in California and he wants to visit!\n\nOnly \"complaint\": the Brussels sprouts were too sweet sitting in a pool of syrup.  Less is more..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwX2F5eEx3EAE",
            "text": "The reviews are sincere! It’s amazing how quickly they turned this into a cool new spot from the previous coffee bar. Everything from the service (we got complimentary sangria and “pre appetizer” snacks) to the food and drinks was delicious! A well thought out drink menu too that incorporates aromatics, etc. We were out to drink and the waiter was attentive and brought over complimentary bread to ensure we had something to snack on. A new neighborhood staple. Will definitely be coming back here time and time again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNFBuUGNBEAE",
            "text": "So happy to find this place. Tapas were wonderful. The Bang Bang Shrimp was so good that we ordered a second portion. The Creme Catalana Brulee was also extremely delicious.  Staff were friendly and welcoming and prices very reasonable for the quality of the food. The decor is really interesting and fun. TBH they had me with the napkin rings."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMk5UaFZjVzV1YkZacFoyTmpPR0pNT0ZObFdrRRAB",
            "text": "**⭐️⭐️⭐️⭐️⭐️ A Home Away From Home – An Unforgettable Experience!**\n\n\"I’ve dined here countless times, and it *never* disappoints. Antonio, Ray, DJ Jonathan, and the entire staff treat you like family from the moment you walk in. Their warmth and hospitality are just as exceptional as the food!\n\nI’ve brought so many friends and family members here , and every visit feels like a celebration. It’s more than just a restaurant—it’s a place where memories are made."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcXZmc0t3EAE",
            "text": "Fantastic tapas bar/restaurant with a well thought out menu and atmosphere. Every detail from the flower wall, to the antique glasses, to the absinthe fountain is intentional and unique to the area. Well priced cocktails considering how elevated the flavor profile is paired with the fun presentation. The staff is so welcoming and lively; I felt as if I knew everyone from a past life. Though it is an intimate setting, there's ample room for guests with the 2nd floor seating. I thoroughly enjoyed my last visit and have told all my friends to join for next time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLU9hZEFnEAE",
            "text": "Excited to have this new neighborhood gem in the spot formerly known as Taszo. The revamped space is beautiful, the tapas are fantastic (get at least 5), and management and staff are wonderful.  Can’t wait to come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ek9FVkdiMmMyUlY5V09YZExVRFV0WDFKbFFuYxAB",
            "text": "Hidden Gem Alert: Chez Messy Is the Real Deal\n\nChez Messy might look like just a hole-in-the-wall from the outside, but don’t let appearances fool you—this place is pure magic. The moment you step in, it feels like you’ve been teleported into another world. Warm lighting, cozy vibes, and the kind of atmosphere that instantly makes you feel like you’ve walked into a close friend’s home for dinner.\n\nThe food? Phenomenal. Every bite is packed with flavor, thoughtfully prepared, and plated like a work of art. But what really sets Chez Messy apart are the drinks—and that’s where Ray and Anesti shine. These two aren’t just bartenders, they’re true mixologists. They craft cocktails with precision, creativity, and an obvious passion for their craft. You’re not just getting a drink—you’re getting an experience in a glass.\n\nAnd let’s talk about service: Antonio, the manager, is the kind of host you remember. His energy, attention to detail, and warmth turn an ordinary night out into something memorable. You’re not just a customer here—you’re treated like family.\n\nChez Messy is the kind of place you almost don’t want to tell people about, because it feels like your own little secret. But it deserves all the love. If you’re lucky enough to find it—don’t walk, RUN."
        }
    ],
    "reviews_count": 74
}