{
    "name": "Hilltop Park Alehouse",
    "place_id": "ChIJj4NiqQz3wokRFEzXvdZfoGM",
    "grid": "MN12",
    "address": "3821 Broadway, New York, NY 10032, USA",
    "rating": 4.2,
    "user_ratings_total": 489,
    "phone_number": "(646) 438-9293",
    "reviews": [
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMFQyYzFSMU5hZUhoTGFqVnBlR0ZuVmtsNVdtYxAB",
            "text": "I want to start this by saying that I came in at a Friday night so experience may vary. We went today (partner and I) with our 1yr old. After reviewing the menu online before coming I had higher then usual expectations because of the reviews and prices. We were sat right away, but the host forgot to place the menus on the table so we sat there for 10-15min just chatting and getting our son settled. Once we got our menus and ordered I asked for a cranberry juice for my son (again 1yr old toddler). The drinks came and his juice was served in a glass cup with about 80% ice. Not sure what a baby is supposed to do with that. Then the food came, looks great absolutely no complaints there. I asked the person who brought the food for hot sauce, they gave us mustard instead…. Now I’m thinking okay, there’s no live music, and the speakers aren’t that high, let me try again, so I asked the waitress that took our order, she asked “buffalo or tobacco?”\nI replied Tabasco, but got buffalo…. Now I’m thinking okay there’s a huge lack of attention to detail here. We are our meals the hilltop burger and buttermilk chicken sandwich, both amazing. The burger was cooked perfectly and the chicken sandwich though just a bit messy was flavorful and overall delicious. Asked one of the staff nearby for napkins and for some reason they brought over mayonnaise… again not sure what’s going on here honestly. It felt like our requests weren’t being heard. Overall the experience was mid. The food was great but it was down played but the poor execution of the staff. I have plans to return for brunch with friends soon so hoping for a better experience."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R2MzbHVabFY2YjA5b1dFOXpNM2w0ZWpCVU0xRRAB",
            "text": "The managers are super rude sucks"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZk9XdEJXVzlsZDFwamEyWktZMFJ2YjAxQ04yYxAB",
            "text": "Went around 2 pm, all kind and comforting staff.\nFood was solid, no complaints from me"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1d1RrTkVaME0zVG1wcFRHRTBWM2cyYkVGTmFWRRAB",
            "text": "Food is outstanding here but I have yet to have an adept server. First time here the server claimed they couldn’t print out the check and nearly strong armed us into signing. Managed to get check printed and found they charged us for something we never got. Waiter couldn’t be bothered to apologize or acknowledge his incompetence.\n\nNext time I went alone and waitress was either ignoring her tables or too busy socializing.\n\nAdd that to the fact the food is overpriced and I have no reason to come back. Food is very good though."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSU1ubFdSemRqYlZoa04zZDRPVmN6ZG5RNU4wRRAB",
            "text": "🤢🤮 Bye-bye Hilltop 🐀\n\nHello for Fort Washington Public House, and Harlem Public…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWE5XRnJaM0psUjA0dGRtWlNWa0UwWTNCa2MzYxAB",
            "text": "Everything in this place is amazing, drinks and food. Service is A1 shoutout Jenny the bartender for always making this place welcoming, only downfall lately has been their apps have been down and we are forced to watch save by the bell in a sports bars."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTVgxTlpXalp5YmtkQllURXRjVU5mV1VwM1ZYYxAB",
            "text": "Everything and everyone was great but I came to watch a sports game and we were told their system was not working which was a major disappointment since I really like the place so I was forced to watch Save by the Bell."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeVdIQnllbEptVkdGclJYRjZZMjk2WVU1bVVtYxAB",
            "text": "Incredible experience! The food was absolutely delicious.\n\nService A+++++\n\nDeidre was incredibly entertaining while providing outstanding service.\n\nThe mangers were also incredibly helpful. Amy took the time to introduce herself and see how everything was!\n\nThis neighborhood is lucky to have such an amazing restaurant!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVmNYazRaa1Z4WjJGUU0wTTRkVWxDZEV3NVQxRRAB",
            "text": "Go during the day. The bartender will serve you and the music isn't too loud.\nIf you go in the evening, it's impossible to have a conversation over the music and the bartender doesn't serve you if you aren't her kind.\nToo bad, it could be my regular, but I'll just go down to Surgar Hill. Plenty of other spots that want your business."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbE0weG9TalU0ZEVGMlEwRjVkM1JHZVhKamJuYxAB",
            "text": "💯"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxT1pEZHBZMjh4VDFSSFdDMVZjazFmVFVwT1ZFRRAB",
            "text": "We had dinner at the Hilltop Park tonight and ordered two cocktails each and two main courses. Our bill came to over $150. Unfortunately, it was impossible to get the attention of the server without shouting. I tried flagging him down, but no luck. He did not even turn his head to glance at our table after we received our dishes. I noticed the table next to us had the same issue and I overheard them yelling to get the servers attention. I was hoping to have my water refilled at least once so I could enjoy my meal (it was hot outside, I was thirsty!), and also wanted to order a second cocktail (which I eventually did, but it was a struggle). The place was not crowded - I'd estimate maybe 5 other tables of customers. There were other staff aside from the server and I'm not sure why they weren't helping to serve water, clear the tables, etc. I noticed that gratuity is added to the bill, and in this case, where the service was nearly non-existent, I found the self-tipping very annoying. This place should do as other reviewers have suggested - add gratuity when it's a large party, but let small parties determine the tip. That will keep the servers more accountable for providing service. They have no incentive to do so with the self-tipping method."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUFRqTkxZbkZTYmtKcVExWmZSMkZvUjNSTWJtYxAB",
            "text": "Great meeting spot in the Heights! Had a nice Sunday brunch with drinks. Friendly service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKVDhzSXJoX1l6VzdBRRAB",
            "text": "Just moved to the area and was excited to try this place! food was good and the portions were nice, but was overall on the pricier side. I would probably order from here for takeout, but will never come back in person. After living in NYC for 10 years, this was the absolute worst service I have ever had. The waiter was incredibly inattentive - it was nearly impossible to get his attention. Soda was acknowledged by the waiter as incredibly flat and taken away, but to our surprise was not taken off our bill. We had to ask for the bill 2 times - after asking the first time and waiting over 20 minutes, we FINALLY got the server's attention after multiple attempts to ask again, and the check took another 6 minutes to come. Mind you, it was not busy at all...maybe 4 tables at the time? The real kicker is automatic gratuity for any check over $100. This enables the bad service. The servers don't care about taking care of the guests because they know they're getting a big tip regardless. If this restaurant wants better reviews for service (because I see I'm definitely not alone in thinking this place has horrible service) they should really get rid of the automatic gratuity. Maybe do what most restaurants do and have automatic gratuity for larger parties."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMN3RySktzcEplQ2hnRRAB",
            "text": "Food was quite good, albeit expensive. Service on the other hand… really lazy. Knowingly served flat drinks. Really inattentive. And the kicker: automatic 20% gratuity above $100 spent. So if you’re going with 3 or more people, they know they don’t have to care because they’re getting a big tip. Beware! Wouldn’t recommend to anyone."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNbnRzTF9YdklLSW1nRRAB",
            "text": "Food is good but service is consistently awful regardless of what time I go/how busy the place is. I get the vibe the owners are cutting corners by short staffing bc hosts/waiters/runners always seem overworked and scatter brained."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYWNwcGZQdDhUWEJREAE",
            "text": "I had the best experience and it was on Memorial Day. The server that helped her name was Brianna. She made me feel so welcomed here. She provided the best option for me when it came to food. I would definitely recommend this place to anyone and definitely recommend her service as well. She gave me on top service and she checked on me multiple times which I loved."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ2hyUGEweVlldGNnEAE",
            "text": "This place is amazing! I love the brunch here,  it’s delicious. The price is around $20-30 p/person. This place never disappoints :) and also I want to thank the servers."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VNS29nOFNCOFlHckpBEAE",
            "text": "We really wanted to like this place, but won't be back, for two reasons: The food is consistently, inedibly salty and they often play music sooo loud that it's nearly impossible to have a conversation of any kind. I believe they are trying to appeal to the younger hipster crowd, but for me, they need to focus on the basics of a good food/beverage venue."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdnM3WUVnEAE",
            "text": "I came into institution yesterday around lunch to order myself a burger and to have a scotch you did not have a selection of scotch that I wanted so I just decided to have a Jamison some thing that we know so well I was charged $40 for a water drink.\nI usually only drink scotch, I never is it on the rocks and I haven’t had a drink in over a month And I was so looking forward that’s why I went to a restaurant to have it .\nthat was my first one and I was shocked in a pole to know that your alcohol was watered down the Latina with all the tattoos wearing a white tank top and blue jeans was nice but I don’t understand how a brand new customer first time you’re giving the cheap stuff when you should be giving me the best stuff that I’m paying top dollar for!\nThe cheeseburger good the fries good but to spend that kind of money for a drink that is not even full strength is disgraceful. I don’t know if it’s the way because I am not as everyone else in this community, but I find it to be a very interesting. How do you do to a new customer?"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ODdqbGRnEAE",
            "text": "It’s so precious to have a spot like this in your neighborhood, it’s an institution that’s more than just about the food and drink but as a welcoming third space. In Hilltop’s case I think they do a bangup job with food, beer selection, service (in my limited experience) and atmosphere, but the prices feel fairly disrespectful particularly in the context of the neighborhood it serves. The draft beers mostly range from $9-11, with the bottom of the barrel options (Gansett, Corona etc) at $8; other items correspond similarly. It’s no wonder at all that the clientele doesn’t seem to reflect the makeup of Washington Heights’ longstanding communities and instead comes across as a watering hole for gentrifiers. Say what you want about the ‘new normal’ for prices in NYC, that angle seems willfully ignorant of the difference between high income, well known areas that attract tourists, and diverse working class communities like this. Still, I am glad Hilltop is here - they are probably(hopefully?) doing their best and I will stop by now and again although I wish I didn’t have to think so hard about whether my neighbors and I can afford it. Would rate 3.5/5 if I could"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3azVYeVVREAE",
            "text": "Local bar, great service with even better food. Will be back many times"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMWNQYjh3RRAB",
            "text": "Had a wonderful tomato soup and grilled cheese along with friendly and prompt service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdDQzLTdBRRAB",
            "text": "Walked in for Friday lunch, walked out with a $165 Bill for a burger and 3 drinks(double Milagros and sodas) gratuity added on. The service crew and managers were young adults more concerned with their social lives than doing their jobs. Which would be fine usually but not at that price or quality of food.\nMidtown prices with dive bar experience, in the worst way."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcEpXMlBBEAE",
            "text": "Nick is the best bartender. Had a great time"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXNUNjJnRRAB",
            "text": "The food and the atmosphere here is great. Everything on the menu is amazing"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaWVMSW5RRRAB",
            "text": "Nice place\n\nFried shallots on a burger delicious"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdzVmOWlRRRAB",
            "text": "Great local spot. Absolutely obsessed with their Garlic Parm Fries !!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfc05Ic0VREAE",
            "text": "My favorite bar to walk to. The best desserts everrrr. The chocolate brownie with vanilla ice cream is my favvvvvvv 🤍🤍🤍🤍"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmenBLYnlBRRAB",
            "text": "The team at Hilltop were truly outstanding! Retirement Party was a huge success. In addition, I would like to recognize your onsite staff efforts.  The service was exceptional. I look forward to collaborating on future events.\nDiana Suarez, CUIMC Family Medicine"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmb3JfZk5BEAE",
            "text": "One of the best burgers I recall. I would only change the cheese they used.\n\nThe space is nice, calm, and not overcrowded. The service was helpful and quick."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmajV5dkRnEAE",
            "text": "The mushroom flatbread!!! Yum!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dnF5M3p3RRAB",
            "text": "DO NOT COME HERE ! Holiday party for coworkers and teachers on the last day before winter break, and it was terrible service we got kicked out at 5pm and they said we couldn’t order food when they said it was from 3pm-6pm. The manager woman was so nasty and rude, saying there was another party and that she was “stressed.” Disappointing to go here and to be FROM Washington Heights and see people treat you like this."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bXJyTFJnEAE",
            "text": "Flat breads are highly recommended. Others are average."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MjZ1MTdBRRAB",
            "text": "Wait for a chocolate brownie that never came. Waited an hour for our drinks to come. Food was okay but services was not it."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNW9QWWVREAE",
            "text": "So good! I love this place!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaGFqWGZ3EAE",
            "text": "my roommate and i come here every week for monday happy hour and the prices are super reasonable. $5 for select draft beers and when i ordered a pilsner it came in a massive mug. just went for saturday brunch and they also have a $30 bottomless brunch with drinks included!! to top it all off tara was doing some social media work and gave us the drinks she was photographing for free!! love hilltop. come here for a super chill local vibe. we 🫶 tara."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbU82T3hRRRAB",
            "text": "They were the most rude people I've ever met in my life don't ever go there"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdXRDUzJnRRAB",
            "text": "Just left not to long ago. Walked in and sat myself. Waited for a server who just keep walking past me or looking at me and never offered a menu. Will prob never go back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINXV6aVl3EAE",
            "text": "Charging me $1 for extra ketchup for a burger and fries is beyond the pale--one of the worst restaurant upcharges I've seen in a while. My wife and I ordered two burgers and four beers between the two of us--around $90--and both burgers and fries came with a tiny amount of ketchup. We asked for more--and were not told it would be an upcharge--and received the same minuscule amount. When the bill came, I decided not to argue and instead just tell everyone not to patron this establishment. There's also a credit card processing fee--3.25%--which is obviously more common (I missed it in small print at bottom of menu). Beer was fine, and the burger was well-cooked if a bit greasy. Fries were well-cooked and well-seasoned, and the service was mediocre for it being a Saturday lunch with very few customers. This charge signals a very poor attention to customers, and I would definitely not suggest dining or drinking here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYZ2MtdEVnEAE",
            "text": "The worst service I've ever had in New York. The waiter never checked on us;we had to flag him down for everything including our check. He talked to everyone else in the bar. The food was ok. The atmosphere seemed great, but the service was not worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMl9hRWpRRRAB",
            "text": "Will def go back again when I'm in the neighborhood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYc282eF9RRRAB",
            "text": "I go here regularly (I take visitors and then get drinks once a week). They made a clerical error on the tip when processing my bill last week and charged me 200% instead of 20%. I went in today to rectify the issue and showed them the flag from my credit card company and they fixed it immediately. Everyone makes mistakes and it was wonderful to not experience any hostility or issues. I go regularly because it’s always a great experience but this is just to say this business is doing things right! Wonderful spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMlBqVkR3EAE",
            "text": "[Oct 12, 2024 approx 8:30pm] It's always disappointing when you go into an establishment for the first time and the bartender COMPLETELY ignores you. The bartender was facing the door when I walked in, so he definitely saw me. I approached the bar, and remained standing, and waited while he talked to a woman. They chatted away and he paid me no mind. Finally after several minutes, I said \"excuse me,\" and he walked over, turned his attention back to the woman and continued talking! I stood and waited a full 30 seconds looking at him in disbelief. I also noticed, a man seated at the bar with the drink menu open, but pushed away from him. He had no drink and looked like he was waiting to order from the bartender too. Nevertheless, rather than continue to try and get the bartenders attention - I left and will never return.\n\nWhat a disappointment. I was hoping to find a regular spot near my brownstone. Looks like I will continue to go to my regular spot on 125th St."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucDc3TmJREAE",
            "text": "Neil was amazing! A thoughtful and lovely person!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOHU2UHJ3RRAB",
            "text": "Best burgers and cocktails in Washington heights but definitely not the  Place For Date Nights or outstanding Costumer service. The whole staff doesn't have a uniform nor dresscode which made it extremly  hard to distinguish staff from customers.  Infact someone who i thought was a guest at the bar just walked behind the bar to make her own drinks for her and her friends  which happens to be the General Manager (Amy). I love my local bar but this is getting out of hand."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueTczeExnEAE",
            "text": "Our server, Neal was an ABSOLUTE delight. We came in after a long day of moving my sister into her apartment here in the neighborhood and he could not have made us feel more welcome. Also- 75 cent wings on Sunday?! Can’t beat that. Best ranch dressing in NY too! Can’t wait to come back. Thanks for making us feel so welcome!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaTZMa09REAE",
            "text": "We live in the neighborhood and love having Hilltop around the corner.  The food is consistently delicious.  We’ve taken so many visitors there, and they all enjoy it.  Our server is usually Neal, and he’s so kind and accommodating.  He always takes care of special requests and makes time to chat with everyone at the table, which really makes it feel like a “neighborhood pub”."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucGJmQUR3EAE",
            "text": "Great food and great service, I come here on the regular when I don’t feel like cooking, Parmesan fries are good and the burgers are good as well…the staff are also friendly and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua2FibzRRRRAB",
            "text": "I’ve been coming here for years (1/2 times a week)  and the food has always been delicious. Literally the best burgers in the neighborhood. My only complaint is that I have noticed a change in servers and customer service. I don’t know if it has to do with management but lately the service have sucked. I would highly recommend this restaurant for quality food, but not for customer service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIXy1tSXNRRRAB",
            "text": "Hate to leave this review because I’ve been a loyal neighborhood customer for years, but I just had to walk out. After being sat and ignored for over twenty minutes while others were waited on, what was I supposed to do? Incredibly disappointed to have wasted 30 mins of happy hour. Especially since the waitress made eye contact with me several times.   Update: Happy to change my star rating because I have been a customer for years and will be back, (and had many positive experiences over the years, obviously I keep going back) but the wait staff must have had me confused with someone else I never indicated that someone was joining me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiek4ycVJ3EAE",
            "text": "Visited this establishment based on a recommendation that it was “decent”. A friend and I decided to visit this location and discuss a project we are working on over some food and drinks.\nUpon arrival we waited a few minutes until we were seated. The establishment was semi busy since it appeared it was karaoke night.\nThe menu items are on the slightly expensive side and the portions are rather small. The karaoke which appeared to be an outside vendor or business conducting the evening shenanigans was just absurdly loud and not engaging. The speak system utilized for the event was high? The bass was off along with the treble so every time the gentleman spoke it vibrated off the walls making it hard to have a meal and a conversation. It practically felt like a club.\nService was decent at the beginning but the waitress attending us disappeared after our order arrived. Attempted to track down and locate, we had to flag another member of the staff to get refills on our drinks and take an item home.\n\nI’ll give this spot another chance on a night that there is no karaoke because if you want to go deaf instantly then visit this place."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGaDRpbWJREAE",
            "text": "We had a really good time and dinner at Hilltop Park. My favorite were the mussels (would definitely order that again) and the wings. My hilltop burger was delicious and cooked to perfection. The only dish we didn’t enjoy at all was the salmon burger.\nThe waiters were nice and attentive. Prices are good and reasonable and our party of 8 left very full and satisfied. Overall had a good experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMUs2bGFREAE",
            "text": "Awesome food and atmosphere. Hilltop burger is fantastic. Loved the sweet potato fies. The grilled peach salad was delicious.  Drinks were fabulous.  Service was great.\nI'm running out of adjectives. If you're in Washington Heights this is a great place to stop for dinner. Almost forgot, get the peach cobbler!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5M1B1YTZnRRAB",
            "text": "The restaurant is incredibly spacious, indoor and outdoor. The setting, in general, would be great for gathering with friends and family, grabbing drinks and light food.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad2M3VWZBEAE",
            "text": "I had an amazing experience at Hilltop Park Alehouse on Broadway in New York, NY 10032. The highlight of my visit was their mouthwatering salmon burger. It was cooked to perfection, incredibly flavorful, and paired perfectly with a refreshing beverage from their extensive drink menu. The atmosphere was cozy, and the service was top-notch. I'll definitely be returning to savor more of their delicious offerings!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2eWJTcFBnEAE",
            "text": "Nice little neighborhood place with an indoor bar, tables, and outdoor seating. They had a few beers and a cider on tap. The arugula and wild mushroom flatbread with truffle oil was yummy. The salad with peaches was lovely and fresh. The Buffalo cauliflower tasted great. Our server was kind. Oh, and they have Happy Hour specials. The only sad thing is was that we ordered salmon on the salad and they brought chicken. Regardless, we would recommend this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGODVLRnlnRRAB",
            "text": "Amazing except for the salmon burger. Flavors were there! Great prices. Great service and everyone but the one who ordered the salmon burger were happy. I’ll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROMTRIMUh3EAE",
            "text": "Visited with my husband for early dinner and had an appetizer of chicken bites, two different burgers with fries and a couple of beers\n\nI went ahead and tried something different - afraid I wasn't going to like it but still willing to give it a try - black beans and avocado burger:\n\n10/10\n\nMy husband is a meat lover and he wanted to swap dishes 😂\n\nBest vegetarian burger I have ever had - loved it and would definitely go back to have that same dish again\n\nSizes were pretty good - we even regretted having had an appetizer\n\nThe service was VERY good - cant remember the name of our server but he was very cool and we had everything right on time\n\nNothing special about the decoration or interior design of the place - but it is very clean and well kept - ideal for drinks and a good bite after work 👍🏻"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdG9Ma1pREAE",
            "text": "Pro: large selection of beers and mixed drinks.\nThe decor of the place was real nice and gave off a warm feeling.\nCons:\nI order the southwest burger with fries. Fries were good but the burger so was messy and over drenched in the sriracha mayo sauce that it was all I could taste. I also order the fish and chips... the fish was bland fries were good but luckily the sauce which came with this order was tasty. For dessert I had the Irish cream cheesecake which was yummy yet it tatsed store purchased not like it was made in the kitchen. (Not a bad thing just wanted to point that out). Also the dessert appeared to have had pieces taken out of it.\nLastly I'd like to mention the service. My server never introduced herself never welcomed me at all. She just came over and said what can she get me and not in a welcoming playful way. During the meals she never once came over and asked would I like my beer refilled or glass of water refilled. She actually left the empty glasses on the table until the end but they were already takin up space on it. This was a the worse part of my whole experience here. The server being disengaged and I am not sure if it was just a bad night for her or ot was just against me because the table two tables down received better treatment. I saw the same server go and refill their glasses of water without being asked and she smiled.\nI would give this place another try but not for a while. I feel that this being in the neighborhood would be a nice turn but not when your treating the local demographic differently and unwelcomed."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpZ1plaTFnRRAB",
            "text": "Everything on the menu in this place is good, their short rib and brisket blend burger has an amazing dry age flavor to it. The ambiance is very classic and the staff is great. I will definitely be coming back"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzM3FLQmpBRRAB",
            "text": "Last night was my second time at Hilltop. I tried the \"Hilltop Burger,\" I ordered it with Avocado and sweet potato fries. The burger was exceptional and the fries deserve a trophy. However, they forgot to put the avocado on my burger. Also,…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrNGRMcFJnEAE",
            "text": "Nice Addition to the Neighborhood! This place is like the bar in Cheers. Come for a burger and a drink. Same waitstaff as the tv show. Your food arrives before the drink though.  So try to figure that out when you place your order.  I had…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdTduS1J3EAE",
            "text": "We visit the area regularly and love coming here. Usually not at peak times, but whatever.  The food is very very good.  Burger is amazing, fries too.  Kale salad was a hit.  Shishito peppers, hummus.  Dessert!!!  Peach cobbler was awesome.  Have stopped for a random beer and enjoyed the bar.  Right now the Xmas decorations are wonderful.  Just come here, I expect you'll be happy you did."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDbmRia3BRRRAB",
            "text": "Amazing food and service. The salmon burger was HUGE and delicious. Same with flatbreads. Our waitress, I wish I remembered her name, was so lovely and polite. We were there Tuesday night. They apparently have a new dessert menu and the s’mores in a jar was outstanding. Can’t wait to try the pumpkin cheesecake next time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWNV9PMzVnRRAB",
            "text": "The food and the service was great. The drinks were delicious, we had bellini' and the music from the bartender was totally totally outstanding, had you grooving in ur seat. My family and I totally enjoyed ourselves. Was a great family brunch!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleWJHVFhBEAE",
            "text": "This place was a pleasant surprise. The chicken sandwich was amazing!  I can’t say enough about the superb food service. My server and bartender were extremely attentive, prompt and professional. Will definitely return!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbHFiQVFREAE",
            "text": "Love this place and the fact that they change their menu based on the season. Ordered the Cabrini High (prosecco with mixed berry sorbet) and the Hand Trimmed Roasted Chicken with sautéed spinach, whipped roasted garlic potato and lemon butter au jus. Amazing!!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3bG9UQldREAE",
            "text": "The Hilltop and Southwest burgers were delicious!! It's hard to get a yummy burger in this area so my husband and I were pleased. Our drinks were good and we enjoyed the very casual/chill ambiance. No complaints on the service. Great addition to the neighborhood."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3N3VhV2JREAE",
            "text": "I love this place. Its one of  my favorite.\nThe food is good and has a nice staff.\nI tried the red sangria and the wings and the burger. I recommend the burger of…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNveHNUQm1RRRAB",
            "text": "I ordered the lamp lolipop chops, corned beef sliders and artichoke dip to try. They had this handmade bratwurst in a pretzel hot dog bun that looked amazing but there's no way I'd be able to eat all of that…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNTZpWkRnEAE",
            "text": "The four cheese Mac and cheese was rich and creamy, and good enough for 2. It has a warm cozy look inside but gets vibrant at happy hour."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcDdTdEVREAE",
            "text": "The atmosphere is great here. The severs aim to please. They have one of the best burgers in town and the fish and chips are other worldly. Their flatbread pizzas are excellent and their hot brownie dessert is scrumptious, it’s similar to a hot lava cake dessert. Food is consistently excellent. I love Genesis, one of the servers there, totally wonderful human being. There was a new floor manager there the night I was there last. Very caring. Faultless restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSOXBXWTN3RRAB",
            "text": "Love stopping by here for weekend brunch. The service is quick and friendly and the food hits the spot! Order the peach cobbler. You won't regret it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhdU9HZ2hRRRAB",
            "text": "The few times I've visited Hilltop Park Alehouse it was for brunch. I require egg white which was made very well! The omelette, (with goat cheese and spinach) something new for me, really hit the spot and had me go back for another brunch,…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOZ2ZiRk1BEAE",
            "text": "Live Music on Sunday night,\nVery good food and nice atmosphere with a great service!"
        }
    ],
    "reviews_count": 75
}