{
    "name": "Tubby Hook Tavern",
    "place_id": "ChIJi8Ve7vbzwokRrwx0vD6nSrA",
    "grid": "MN12",
    "address": "4946 Broadway, New York, NY 10034, USA",
    "rating": 4.5,
    "user_ratings_total": 568,
    "phone_number": "(212) 569-7071",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oM05EWXpSVmhwTTA5aVlrVjRTRFZaV2tWbVFXYxAB",
            "text": "great place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbVpUaFlNMHROZWs1M1duTkxTalp0Y1ZObVltYxAB",
            "text": "Friendly and understanding staff with great food and beer options!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzdU8yUXdBRRAB",
            "text": "Local spot for burgers and beers"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMC0tWVVnEAE",
            "text": "The best. Still the best. Bring back the bang bang shrimp"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMldXUXhlRUV0VWpSWVYxaGZUMGhPTWtGRlYxRRAB",
            "text": "Amazing spot! The bartenders make you feel at home, great “cheers” bar !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aZlJGZFVaVFZDVGxCcE5GWnVSVEkxVVMxcWNIYxAB",
            "text": "The WORST BURGER EVER in my Life!!\nIt tasted like a hard ball of dry beef flavored cotton. Totally REDICULOUS.  HORRIBLE"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSFJHaEpTRkpGVjNWQ01tNVlSbmx5WkRkdloxRRAB",
            "text": "This is the best affordable burger in New York. Amazing tater tots too. Wish they had pickles available to put on their burgers. The food is always hot and fresh. I only rate the service poorly because recently there has been a server who, every time I come in, he is always SO rude. He speaks so quickly and quietly that it is almost impossible to hear what he is saying, and he makes you feel so rushed while ordering that it's actually stressful. Everyone else is amazing, but due to this waiters service I have been coming in way less.\n\nOther than this one server everything else is amazing. Unfortunately his customer service is so bad that it majorly hurts the dining experience. I'm a local server as well, and I know how hard the job can be, but he really needs to be coached to treat his customers better."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMTFh3NC12ME52bnBBRRAB",
            "text": "Good bar, good food. Feels like unless you’re a local your second grade. Don’t believe in buy backs for the “normal” customer.  Solid local pub."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdXNhVkVnEAE",
            "text": "Amazing!!! This has become a Cheers for me. (A place where you go to all the time and they know you're name.) If you don’t know the show.?! Great food. The brunch egg rolls are such a great idea!!! Drinks are great. Bartenders are amazing!!! A Must In New York!!!!...."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMkl5VmxnRRAB",
            "text": "Great food, great atmosphere and wonderful service! The Hangover Burger is a MUST!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa3M2VG5nRRAB",
            "text": "Came here for a chill night and Jaz the bartender was awesome I had spicey mex and some wings and they were literally the best I’ve had!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMVA2bVRBEAE",
            "text": "Tubby Hook is a neighborhood fav for my wife and I who live just around the corner on 207. I recently had my birthday party here with about 10 people and it was easy to book and set up. It was very fortunate that they didn't ask me to pay for a reservation for so many people, and they gave me a variety of options for having food and/or drinks served. The service is excellent, the atmosphere is excellent, the drinks are delicious and the food is pretty good."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0enByblF3EAE",
            "text": "Great neighborhood pub with food that's better than the typical pub food. Friendly helpful staff. Great beer selection. Conveniently located near the A train and bus lines. Music is not too loud so you can actually talk with your partner or friends. For a quick drink, a starter from the menu, this is often the first place we go."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXay02NXJRRRAB",
            "text": "We go here often and the waitress is nice, service is fast and food is good. Tuesday is trivia night and Thursday is karaoke night. It's fun, chill vibes. Definitely recommend it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIX2YzMXVRRRAB",
            "text": "First time getting food from here. I called in for an order of mild buffalo wings to go. Quick service, warm and welcoming staff and fresh, flavorful wings. The bleu cheese was really good, too! Can't wait to try their other menu items and dine-in."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNheHRYMC1RRRAB",
            "text": "Nice little neighborhood pub that's been here for a long time. The bartender was capable and efficient."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNlBEMDR3RRAB",
            "text": "This places is trash. Just waited 30+ mins for onion rings and a salmon bowl, while I saw other people getting their food. I finally had to  Ask the bartender for my  tab so far. I used to really like this place, but obviously it's gone downhill. I walked out. Go to the liffy instead."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUb28zcjNRRRAB",
            "text": "Been here a few times, pretty good overall. Staff are always friendly, always a new beer on rotation. Good size servings but the food quality can be inconsistent and is a little overpriced. Atmosphere can also be a mixed bag."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdGN2LTZ3RRAB",
            "text": "Came here yesterday in the afternoon with my friend. Our waitress was incredible. She may be the nicest and most competent server in New York City. We'll remember her kindness forever!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbmRTWDhBRRAB",
            "text": "I went there last night since our original date spot was unexpectedly closed. My girlfriend and I got some sandwiches and sliders. No complaints. Then, we were pleasantly surprised to find out  that Tuesdays is trivia night. I love trivia. We had to leave early but I got info and every Tuesday is trivia, and Thursday is karaoke.  Definitely coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbmJMcXVRRRAB",
            "text": "This place goes above and beyond to celebrate every occasion.  There is definitely a nice community vibe that you don't get from a lot of places in this neighborhood anymore.  The drinks are good. They don't skimp on the alcohol like some of their sister locations. The bar staff is fast and gets along well with the regulars, and the owner is very friendly and inviting.  The wait staff is ver attentive and passes by often to check on you. The location is prime, next to bus routes and trains. They host trivia night and many other events and really know how to get into the spirit of things. The one place I think they could improve is consistency with food. Some of their options are just ok, while some others are good. It depends on your taste.  However,  they have the best hashbrowns I've ever had. They are perfectly cooked to provide the perfect amount of crunch and flavor. Some of their seasonal salads are great, and some soups are good, but some food is typical american bar food. You'll be fine if you're into that. I recommend this place if you're looking to get away from the loud, party spots and just want a neighborhood spot to have a drink alone or with friends.  If you are a loner or prefer groups, you'll be good here either way. They close late , which is a big plus."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREM3UyU1N3EAE",
            "text": "An absolute hidden gem that genuinely surprised me the first time I went here!! This place is fun (trivia night, karaoke night, live bands, special events), the food is good and I've enjoyed pretty much everything I've had here, and the staff is so kind!! Anytime my family or friends visit we have to take a trip inside here. Very much so one of my faves in my neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5LWZDOFZnEAE",
            "text": "Great Staff with amazing attitude. Always specify which meal you want, with a positive attitude. Location roughly about around 45min subway ride from Times Sq."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcS0tdTJRRRAB",
            "text": "Great irish pub style sports bar. More than your typical bar menu, great food and decent pours from fun bartenders. Not the hippest or youngest crowd but also not the loudest/messiest"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxZ29UcTlBRRAB",
            "text": "I've known this place forever. I grew up in the neighborhood. The business has changed hands, but it's still a great place for drinks and food. It's also good for sports too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcm9Xam5nRRAB",
            "text": "This is our favorite spot in the neighborhood - we came up here from Harlem in 2020 and it saved our lives - in an Irish bar where we could get a drink when COVID restrictions were in place. A friendly local pub where the drinks are always good and the food is fantastic AND consistent! Love love love it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWczRhUk93EAE",
            "text": "Didn't have the food yet, but the fact that it was open  late in the middle of the week was amazing. After all, that's what makes NYC special--open at all hours. Post pandemic, this isn't the case. However, this neighborhood gem continues our legacy. Over-all service, atmosphere is nostalgic and is one of the reasons this establishment remains a staple its community. Contrary to some expectations, the crowd was mature, sophisticated and service was above average. Kudos to this business for hiring a strong bartender, she meticulously handled all of us with care. Never let weds night bartender go -- she cares about her customers and made a newcomer (like us) feel comfortable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsZ3NMTDRnRRAB",
            "text": "Super Pub.\nGreat food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMV9lWDFnRRAB",
            "text": "Nice neighborhood establishment,  good Bourbon selection, friendly staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseE5xdndnRRAB",
            "text": "Such a great vibe , service was excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1M0ptalpBEAE",
            "text": "Love Tubby Hook It’s the neighbor to go spot for a quick bite, date night, family dinner or just to  hangout after work"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadk55MjJRRRAB",
            "text": "Great food,  friendly staff"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaejVuelZREAE",
            "text": "Even though I miss The Piper's Kilt terribly, I'm forced to admit that they did a great job renovating this space. The large windows and outdoor space are a great change.\n\nFood, booze, and beer choices are pretty solid, though of love to see some craft beer. The fried chicken sandwich is consistently great and I'll never complain about tater tots.\n\nThe only thing I don't think that they addressed well in the renovations is the bathrooms. Still the somewhat unpleasant closets of days gone by. Can't knock a star for it, though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcmF5cEZ3EAE",
            "text": "Had a great time out with friends after work. Food was tasty and the beer was cold. A Great combination. Would go back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNy1meENnEAE",
            "text": "Miss going there when I return to Florida but every couple of months I return\nDanny is wonderful!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKb2UyeGdRRRAB",
            "text": "Best burgers around"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bDdDaXpnRRAB",
            "text": "I used to go there back in the 90's when I worked up in that neighborhood. At that time it was known as Piper kilts. Good to know that the drinks and burgers are still good. Would definitely go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OW82bjlBRRAB",
            "text": "Nice neighborhood spot, friendly staff, good burgers, Guinness on tap."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cEt1eWhBRRAB",
            "text": "Our crew stopped in here for a burger and a beer during The Great Saunter. The burger was great and so was the service. Just what we needed to keep going."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndUlTY2xnRRAB",
            "text": "Reasonable service.  Reasonable food. Reasonable drinks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdTZpRUZBEAE",
            "text": "Had the fish and chips and it was awesome."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSemF5OUlREAE",
            "text": "Great food and atmosphere"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJMjgyRWtRRRAB",
            "text": "Fine neighborhood option for tasty burgers beer and sports on tv"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURleHJiZnhnRRAB",
            "text": "It took a few years, but Tubby Hook is now an excellent neighborhood pub. The food is better. The burgers are now excellent. The service has stepped up. It feels like it is now in sync with Inwood. It's a pub we can be proud of."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2a1pxYTNnRRAB",
            "text": "Absolutely in love with Tubby! The burgers are highly recommended. Great drinks and atmosphere. Not to mention, the staff is super friendly 😀…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4X2R6eU9BEAE",
            "text": "It was AWESOME! I strongly recommend the fried zucchini appetizer. It was excellent and it was large. The drinks were good too. I had the pineapple margarita and my spouse has the weisshefen grapefruit beer. Yum! (And him not a beer drinker)"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBLTYzb0J3EAE",
            "text": "Came here for lunch just for a bite and to grade papers. I had been here before during football, and their burgers/fries/tater tot bar staples are great, which kept this at 3 stars. If you venture from that, however, do so at your own risk.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdXJTMzN3RRAB",
            "text": "Nice bar right by thw train station in inwoods.. good fish tacos and decent burger. Service was very good. Whenever in the area this is good bar to cath a bite and a drinks."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNEs2N1hREAE",
            "text": "One of my favorite places in inwood heights the drinks are always great and the food is to delicious"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3bmV2ZDdBRRAB",
            "text": "Basic bar with so-so beer selection, too many TV's, and Sysco bar food that will make you feel bloated for the next day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NFkyQjh3RRAB",
            "text": "Love this little place. Reminds me of cheers.   And really enjoy the food.   These steak egg rolls are great!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCc3ItTlRREAE",
            "text": "Went there in mid-November (2022). The mushroom burger was delicious, perhaps smaller than I hoped, the fries were also good but the complementary chili was way too spicy, even for me. Great little place to grab a burger and a beer though, and the customer service is great (something, unfortunately, not common in that area)."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2ak9QSHZ3RRAB",
            "text": "Very low key pub. Friendly staff. Gourmet food. Top quality. I enjoy their fish tacos."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXX3ZfUTlBRRAB",
            "text": "Just moved to the area and Tubbys was screaming my name since I toured my apartment. Good beers, helpful staff, dish envy with every plate I saw that wasn't mine."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyZ2JXYnZ3RRAB",
            "text": "From the second you walk in until you will reluctantly have to leave to face the outside world, this place is a fantastic experience. The menu is diverse and well put together. Their selection of drinks, beers, and cocktails is spot on.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMW91a0dnEAE",
            "text": "Great spot for a burger or chicken sandwich. I've had a few different burgers here, my favorite is the French onion soup burger. The chicken sandwich is also very good. Staff is friendly and attentive. Nice little tavern to watch a game at."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5eHBmb0JBEAE",
            "text": "Having a small dinner during happy hour is totally worth it. Social distanced seating was well done. Food was good, reliable and they adapt the menu to seasonal holidays.  The servers are just the best, extremely nice, it seems like a good…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMTlQRWFnEAE",
            "text": "The place was nice enough. The table Booth seating was very tight not reasonable for 4 people. The burgers are more or less what you expect. The ribs were very tasty I have to say. Free refills is always nice. They did get one of our orders…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLeEszMGZ3EAE",
            "text": "Aesthetics is not special but it's lighting and dark wood furniture makes this relatively clean facility  a great option in the area when we're not under a quarantine lockdown.\n\nGenerally (if you're staying in the restaurant)  the food is very good.  I'd also have to say the staff in the front have always been courteous and attentive.  Presently, as covid restrictions have eased they're still somewhat \"on-it\"; checking temperature and keeping people properly spaced. The only issue I have is their kitchen... If you're a foodie (and unfortunately I am) check your order when you receive it.  Foodie meaning your food choices aren't arbitrary- you know what you want and how you want it.  In at least 4 occasions they've prepared my order \"different\" than I've ordered.  I haven't complained but it's worth mentioning.  They'd get another star if they'd get the orders right... consistently. It's still not a bad option.  Go enjoy."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURta3FlNXR3RRAB",
            "text": "Probably the most racist establishment in the area without a doubt. They do not even hide it, what I mean by that is…I come in with my partner to have some brunch. Greeted by the waitress after some time waiting. We put our order in for drinks, takes more than 15 minutes to receive these drinks and after our placing our order we literally wait an hour. During that same time span, we see white families/individuals come into the establishment getting better and faster service. Even the bartender (White Male) goes and checks in with all these other booths except ours (POC). The food is very mid, I don’t usually write reviews but I had to get this one out. I would give 0 starts if possible, if this was a rating system to see how effectively they can make you feel as a second class citizen they would receive 10 out of 5 stars."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbklxZUZBEAE",
            "text": "Wonderful atmosphere and great staff. Amazing burgers and food. You can eat inside or outside. Dog friendly outside. A bit congested with the bus, but you will completly forget it after a while. Kid-friendly as well."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0LWJUcGd3RRAB",
            "text": "Absolutely love this place. If your from Miami and love ale house then you will love Tubby Hook Tavern. I've been there a few times and the atmosphere is great. It is a super nice a chill spot for a drink or to eat. Definitely my new go to in New York."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4M2VIdkhnEAE",
            "text": "Our server, Edith was fantastic. She was taking care of many tables, yet she still was as attentive as any server i've ever seen. The food is so so, but what you would expect for a NYC pub. Beer was cold and tasty. Solid selection of draft choices."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNHJqUnR3RRAB",
            "text": "I like the restaurant itself, but I haven't been there in person in some time. However my seamless order was lackluster: the poutine tater tots were just cheesy tots, with not much flavor. And the mushroom burger was equally not as flavorful as I was expecting, the beef patty was 1\" thick and the meat was very bland.\n\nThe Chicken Burger was delicious however, the regular fries were too skinny, overcooked and soggy.\n\nMy biggest complaint is that I received  20 ketchup packets with my order. That's way too many for 2 sandwiches with one side each. I really wish they stopped throwing in an obscene amount of non-recyclable, single use condiment packets."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvd0tYLTh3RRAB",
            "text": "I'll always have a special place in my heart for the old Piper's Kilt. However Tubby Hook holds it own. It is a solid place and has kept the old traditional decor.\n\nSadly the burgers aren't as good anymore (Piper's Kilt was rated the best burger in NYC after all). Yet the menu is solid and I'm glad Tubby Hook is in the neighborhood. Still the best burger joint in Upper Manhattan.\n\nOhh, definitely worth mentioning that the service is now very good!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRaWREaFpnEAE",
            "text": "Smaller and cozy bar restaurant, good sports TV, nice menu, good atmosphere and chill music. Its a low key nice place with fair prices for NYC, drinks are pretty tasty as well. Staff is always very helpful and respectful but also super chill."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvMjU2bG93RRAB",
            "text": "Good neighborhood place. Nice music. I went in on a Friday night and it wasn't too crowded.  I ordered wings and they were overcooked. But the chicken parmesan and the sweet potato fries were delicious! I definitely recommend!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnaExUSlN3EAE",
            "text": "I mainly go for Tuesday Trivia, which I enjoy very much, mainly because the host is very upbeat and funny. The wait staff is friendly and attentive. The food menu is somewhat limited, even compared to other pubs, but there are certain…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdFBPRmFnEAE",
            "text": "Nice place but what's up with these baby fries. I had to use a spoon since they were all so tiny."
        }
    ],
    "reviews_count": 69
}