{
    "name": "ROOM 151 SUSHI & STEAKHOUSE",
    "place_id": "ChIJeVp28If1wokRRhNiENgr9lc",
    "grid": "MN12",
    "address": "151 Dyckman St, New York, NY 10034, USA",
    "rating": 4.6,
    "user_ratings_total": 226,
    "phone_number": "(646) 707-0765",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeFNWRmxSSEp6Vm1sM00wMWFZMkoyTFhsQlMyYxAB",
            "text": "Let me start off by saying that if you’re ever looking for a lively place to go to but don’t want to pay an $80 entrance fee at a overcrowded club, this is the spot for you! The staff is very attentive and welcoming, the best Latin fusion food you’ll ever have, and their hookah & drinks prices are hard to beat. Overall amazing experience & I will be coming back!!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MlgwVk1NRGhQVWxCVlZFOXRUV1p5VG5GS2VGRRAB",
            "text": "I love this place and always recommend it to anyone who wants to grab drinks and food in dyckman. The perfect atmosphere for someone who likes the nightlife. Very versatile place as they have many different events and different things playing on their tv screens. I recommend getting the mofonguitos they are so good!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTlEzbEdSUzFQZDBjMlRrRkpUM05WUlZvd1QxRRAB",
            "text": "Good service 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNU1HWkxaV1ZqVWw4eVMyVXdOV051V0hGVGJWRRAB",
            "text": "My experience here was very wonderful because of Manuela. Would come again 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWWJVWjBUMGxIVUMxcmJsTmxOM0JFYzB0VlEyYxAB",
            "text": "Omi was great !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMmIzUkdaRWRQWm1kcGNGZEVkVGx1T0c5blMyYxAB",
            "text": "Place & food & music is good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaVNrSlJhVzVzU1hGdVlVTkJZM0pQUm5CV1NYYxAB",
            "text": "Manuela gave us a 10 STAR RATING.  I recommend to come here she’s very considerate and very great service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JNVkwNVlUR3BEVGtOQ2IyVkxhbEo2VFU5YWEyYxAB",
            "text": "Manuela has great service. Very attentive can’t complain. Can’t wait to go again !!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210M1JVUnlMVzlpTVZoWGVWTmZZbVZ3U0VGbFRIYxAB",
            "text": "great food, great service, manuela was so nice! clean establishment, great music!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNFQwTnJWMDQ0TUZoVk4xSlZXVXBZYlRWNVNIYxAB",
            "text": "I’ve been coming to Room 151 for a while now, and Sundays are always one of my favorites because of their Happy Hour. Good drinks, tasty food, and the staff always takes care of me. It’s a nice way to wind down the weekend without breaking the bank. Always consistent and always a good time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twelZGVTNjR1pGVGxvNU5UUTFNVkZMU3psTE5sRRAB",
            "text": "The place was practically empty (3 separate parties) for a late Sunday brunch. We picked this place because it seemed fun on IG & offered Valet Parking which is a plus for the Dyckman area.\nWhen it was time to get our car we were charged $30!!! We should’ve parked at the garage up the block!\nNo decor, faded grey wall paper\nFood & Drinks were so-so\nWe were the only “big” group there… attentive but felt rushed.\nNo DJ\nWill we be attending again… Nope!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeE1uY3RkSFkyU0RoUFJGbFdVMFJpZW1keVMyYxAB",
            "text": "Room 151 Lounge in Dyckman offers a cozy and inviting atmosphere, perfect for those looking to unwind or catch up with friends. The interior design strikes a good balance between modern and comfortable, making it an appealing spot for casual gatherings.\nThe menu features a diverse selection of drinks, including craft cocktails and a variety of beers, which cater to different tastes. Patrons often rave about the friendly and attentive staff, who contribute to a welcoming experience. Additionally, the lounge sometimes hosts live music and events, adding to the lively ambiance.\nOverall, Room 151 Lounge is a solid choice for anyone seeking a relaxed environment combined with good drinks and hospitality. Whether you’re stopping by for a quick drink or planning a longer visit, it seems to deliver a satisfying experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNlNYSkhUR1o1U1RFMlFtWm1ZVkJ0Y0hKS2RWRRAB",
            "text": "Our waitress was soooo amazing and the food and vibes are spectacular I WILL be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cmFXUXRiVnBTYlZkUGRWUlJYM1J0YUVOc1MwRRAB",
            "text": "i came here to celebrate my sister’s birthday & let me say i thought this place would blow me away but it didnt.\n\nwe ordered our food and literally waited an entire hr and a half for it to arrive. mind you it wasnt packed when we got there. it looks like they left the food sitting because everything was cold & room temperature when we go it. also the portions were so small it looks like they took one churrasco and split it with 3 plates. we were all shocked it looked like a kids meal plate.\n\nthe mimosas was more more juice than champagne all you taste is juice. i had high expectations for this place but we left extremely disappointed. we wont be returning."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214R1drZGZWRUpwTjJsR1dpMUdWbnBIVlZocVNHYxAB",
            "text": "Definitely check this place and ask for Chris. He will take good care of you and recommend the best meals on the menu! I personally recommend the California roll, the sea bass fish chunks, the chicken tacos, and the chicken empanadas!\nWe had a really great time in a nice decorated atmosphere!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUVdVVnNjVVZDVmxCTWVIUlBWbWxhTkdabFprRRAB",
            "text": "Once again, Chris, the waiter was amazing as always , checking up on you making sure everything is great. Julio the bartender he makes the best drinks , The atmosphere and the environment is always a pleasure to be in if you wanna cool, gray chill vibe that definitely is the place thank you guys"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MVFXOVdYMHRVWkhKQ1ZVRnlkbkZ2TmtjeWFXYxAB",
            "text": "I’m surprised they’re not super busy on the weekends. I came on a Saturday and it was just us 4 and the staff for a few hours, no one else. The food is good, as well as the drinks and music. The waitress and rest off staff were very kind and accommodating. Def a good brunch spot in the area!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sb09XbElOMlp1TUdoblNHdzVPRXRNTkRkbldYYxAB",
            "text": "The waitress was such a sweetheart and great service\n\nUnfortunately this place charges a service fee of 18 percent that DOES NOT go to waitress!!!! Now if this fee went to waitress and was gratitude fee then I would understand it but it's ROBBERY. I've been to a lot of steakhouses and my reviews show it. To charge this fee and expect people to also tip another 20 percent on top of that is extremely wrong and dishonest. It's unfair to waitress. I'm paying 30 dollars to just sit at the table???? Just charge a cover charge when people walk in so they know what to expect. When I already got hookah already gotten food etc.\n\nAlso there drinks have barely any alcohol in it. I am light weight I don't drink much so doesn't take me much to feel anything and by two drinks I'm usually good. I was completely sober with two drinks. So avoid the frozen drinks.\n\nNow there hookah is good and there chicken buns are good my partner was disappointed in there steak to charge steak prices but he received a very small portion and wasn't happy with the quality of it .\n\nIf you're looking for a steakhouse steakhouse please go elsewhere but like I said all there other food was very good and I did enjoy it\n\nWe won't come back here due to service charge like I said no high end steakhouses charge that type of fee and expect gratitude on top of it.\n\nUpdate I do want to add that we did zelle the waitress for her to get a tip directly because she made it very clear she doesn't get anything from the service charge"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21od1YxWkdaMVJWUTE5V0xVRkJOMWxwTUdkV2NtYxAB",
            "text": "Love the mofongo 😍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkV1ZFWXlWMXB0TUVWT2JHMXNTVlZZTW1kaGFHYxAB",
            "text": "We enjoyed the food and the service was great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RVRraG1jVmxXWVhSNFdFVTRSMGRITjBoeE1WRRAB",
            "text": "Food is always amazing when I visit here!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R2JTMDBSamxsZUZoYWQxUnlaV290TUMxTVFuYxAB",
            "text": "I don’t understand why I never visited this spot before. The food and appetizers were 10/10, and the drinks were super strong and good just how I like them. Plus, the service was excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMWEzbE1WMFoyVDA1MVNucDBaMGhQWXkxNGIwRRAB",
            "text": "151 is a hidden gem 💎.  I love the vibes here.  My Seastar introduced me last year and it's been my regular spot since.  The food and happy hour selection is great! We've had several birthday gatherings here, including mine in March. The customer service is good as the host and servers are professional and kind.  I've never had an issue with their staff! If you ask for a manager,  they're polite when they approach you and will quickly  resolve your concerns.  You can wait long if there's one server during the week or a big party. Otherwise, be prepared to have fun! Monday & Fridays are my favorite days to visit. I will randomly go other days as well.  So my recommendations would be the fried wings with sweet chili on the side. The salmon with mashed potatoes & veggies. The lobster tail with mashed potatoes. The chicken empanadas, chicken dumplings and the chicken cesar salad. My fave drink that never disappoints is the coconut margaritas. Depending on the day, there are activities such as sip & paint and they give dope prizes, like a bottle of patron! Its a nice space for events and birthday dinners! I had my birthday brunch on a Sunday,  it was 🔥.  Ooh yeah and the brunch deals & menu is official as well.  😊 Thank me later!!\n\nOkaaaay, so these are some things that could be improved...\n\nI used to love the Happy Hour specials. Yall, it was 7 days per week from 4-10. The selection was vast and there was something for everyone. The wings are my favorite! Fast forward to May 2025. My daughter and I came as she returned from college.  I was shocked 😲 to see that the Happy Hour menu changed drastically.  There were barely any items,  thankfully my wings were still there.  So it's a win 🏆! However, my favorite coconut margaritas were gone guys! We could no longer get flavored margaritas at the HH price. It would be $17 versus $8.  Also, we could now only order 2 food items at HH price. Thats insane. I asked for a manager in disbelief as there was no mention of changes prior. The manager accommodated us, which I greatly appreciated. However,  I'll honestly say that the changes in HH has reduced my frequency as the deals aren't that great anymore. The overall vibe is still dope 👌🏾and I always enjoy when I'm there.\n\nWe need a loyalty program for VIP guest so that we continue to get the deals were accustomed to! We recommend you guys.  We host large tables and it's a favorite dating spot for me as I feel safe being familiar with all the staff present. So please hear us!! We want the old menu and schedule for HH. I get maybe not on the weekends as most restaurants don't usually have, however it also set you apart from others!🙏🏾"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJenF3Tmp3Z082ejl3RRAB",
            "text": "I really liked this spot! I’m a huge foodie but drinks and food consistency are best for me! I’ve been to this spot three times with different servers and it’s been the same experience. Good vibes and great taste!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLVNoNzZJNllMSXh3RRAB",
            "text": "Yoel fue el mejor con el servicio. La comida estaba buenisima y todo fue rápido."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMVHFvN0dnMjVlWkNnEAE",
            "text": "Calamari was small and hard, but the fish bites were flaky and good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKM1NtOXl1bGI2UElnEAE",
            "text": "My friend & I randomly came here for brunch on Mother’s Day because the place we were originally suppose to go had a two hour wait time.\n\nThe brunch was two hours that included a two course meal/ an appetizer and an entree along with the choice of 4 different drinks ( can’t remember them all) but we chose the Jack punch and WOW! it did not disappoint! At first I was like this tastes kinda light but after my first cup I felt it kicking in. My friend and I left drunkkkkk in 2 hours and I am not exaggerating!\n\nThe food was also a hit. We both had the same thing, the chicken empanadas for the appetizer and the rice, beans, steak and eggs as our entree.\nTo be a brunch menu the portion sizes were very decent. We were full. I actually didn’t finish my meal.\nThe music was a lot of bachata, not even a lil dembow lol, which was tiring after a while because although we are in dyckman they should consider the diversity of people that sit and eat at these places. My friend is African American so after a while we wanted to hear something different. We did request to switch the music up but you can tell the dj didn’t know what to play but it’s cool it wasn’t a deal breaker.\nThey had hookah and it was bussing for a while so that’s a plus too.\nThe service was a little slow when it came to our food but they kept them pitchers coming!\nPricing was ok. It was $45 plus tax and gratuity but we split the bill and paid $67 each excluding the hookah because we paid that separate.\n\nOverall it was a great experience and I will come again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYjdxY1hHaTY3b2JnEAE",
            "text": "I server was so amazing his explanation how he served you the way he talked to us good recommendation on full drinks what they do how they do it I mean he was a great server. I wish I knew his name and all I can say is thank you for serving me and I hope that I tipped you well food was a 10 out of 10. Must recommend the sushi was the food was good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbHNIRUhREAE",
            "text": "Came here for my birthday 🎂 the drinks were good we had the lobster it was well seasoned a little over cooked. The sushi was the best part honestly. We also got the fish it was dry and the mash was a lil off. Vibes sushi drinks for this place!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeVppQ1l3EAE",
            "text": "Buen servicio angelica una de la mejores me gusto mucho su trabajo"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeWZDRUJ3EAE",
            "text": "Excelente servicio"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeWRDV3pRRRAB",
            "text": "Hice una reservation con Angelica 10/10 todo fue bien nos trato muy Amable la recomiendo"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaWYtcjd3RRAB",
            "text": "Angélica es la mejor ❤️  La recomiendo mucho hice una reserva con ella y todo salió perfecto 10/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaWZDMTlBRRAB",
            "text": "Great happy hour options . I had mojito and it has been a long time since I had a good one ordered 3 ☺️. Had churrasco , salmon , empanadas and all were yummy . Waitress was kind and patient overall staff was good . Good music 🎶 definitely would return"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdTRpYkt3EAE",
            "text": "Joel is the best server! The food and service were great! This is definitely going to be a regular spot for me to go to and catch up with friends!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdEtHY0hREAE",
            "text": "I was excited to visit as there were many great reviews however my experience was a huge let down. Upon arrival I was told by the hostess I needed to have a reservation in order to be seated at a table . Although there were many tables available I had no problem scheduling a reservation to come back later.\nSo I proceeded to ask the hostess to make a reservation which she advised me to go online to book a table. I booked a table for the  next hour and let the hostess know I’ll be back. She then let me know that the time I booked online is not available in-fact, they are fully booked for the day …. I got charged $10 for each person in my party  to cancel a reservation I couldn’t get seated for . I wish things were different."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NzRLenlBRRAB",
            "text": "10/10"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NzZEb1pREAE",
            "text": "LITTTT the food is good. The pitchers rolling roll 10pm. I mean I’m here about 2 times a week."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cjUtRFFBEAE",
            "text": "Amazing service, great host. Always coming back to have a great experience."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cjRlTmRBEAE",
            "text": "El mejor servicio!!! 10/10"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cl91cVlREAE",
            "text": "Angelica es la mejor!!!! 10/10"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cjhQbXBnRRAB",
            "text": "Everything was great will come back again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cjYyRHBRRRAB",
            "text": "amazing drinks and dancing! hosts are gorgeous ◡̈"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cjRqWV9nRRAB",
            "text": "Great vibes"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cjRDbXN3RRAB",
            "text": "Angelica was the best hostess, very kind very attentive, plusss $6 happy hour on FRIDAYS  till 10 ! Can’t ask for anything better thank you"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ejdfX1BBEAE",
            "text": "Angelica is the best hostess ever she is very attentive friendly and has great hospital 100% recommend to come here during 6$ happy hour."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ejVmTXBnRRAB",
            "text": "the hostess is really friendly & accommodating 🩷"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OUppdGdBRRAB",
            "text": "Thank you so much Angelica and Joel special shout\nout! and the amazing staff of room 151. Always so helpful and accommodating!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MUktYVRnEAE",
            "text": "The place offers a nice atmosphere and great food and drinks for the enjoyment of people from diverse backgrounds."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MUxmejBnRRAB",
            "text": "El mejor lugar del mundo, the best."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMHVmVExREAE",
            "text": "Let’s talk Latin fusion! Sushi and steak is such a comfort food when you add a vibrant Latin twist….   The sushi is fresh and flavorful. The coconut shrimp is to die for 😩 crispy and well seasoned.      Happy Hour is the best bang for your buck; loads of options for $6 and less. There’s Hookah for anyone who wants a quick unwind and the Drinks Baaybeee! The frozen margaritas go get you one! The JACK PUNCH!! I had to get me a pitcher.  If you want to celebrate a birthday go on Saturday or Sunday! The DJ plays everything. They bring out balloons, photo props and the whole restaurant turns into a live party. Try it out! Judging by the photos you can see I visited three times 😅"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcnBlX2NBEAE",
            "text": "First visit on 28-Feb-2025. I recommend their happy hour, the $6 deal is absolutely worth it. I ordered fried calamari and a California roll, with 4 whiskey sour cocktails for a total of $36 - I definitely enjoyed the cocktails (please have more staff on hand at the bar) and the food was very good. I will say that the space is a bit tight after a certain timeframe, there was barely any room to dance so we just moved in our seats, and seating on their upper level could/should be revised, as there was a table directly in front of the stairs which is a safety hazard. I chose this venue to celebrate my birthday and there wasn't any acknowledgement of it by the staff or even the DJ (if there was an actual human playing the music), or even someone else who wore a tiara at a table close by - when it's your birthday you want to feel special and they definitely dropped the ball with that. Hookah is available at $40 cash with only 2 flavors which is overpriced as a frequent smoker, you're better off going to a hookah lounge. Overall, I want to return again and I hope I have a better experience if I do."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MmNiV1FBEAE",
            "text": "so loud music where I can barely talk isn't for me. Sports on the tvs made no sense old baseball and muy Thai fights. The waiter messed up our order twice, and I ended up waiting 45 mins for fish that was burnt and turned back. But my appetizer was ok and my date food was nice. Hooka wasn't great, and the huge TV was bright with ads no one cared about"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRb0ptM1ZnEAE",
            "text": "It was great from the moment I walked in.\nWas 30 minutes early for our reservation. I was able to go to the restroom and then order a beer (IPA). We attended happy hour and had a great time. It was a cool place to dine at, for my first time in Dyckman. The music was loud and thumping. Cool"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bEotUTNBRRAB",
            "text": "Must come to!! The hottest spot on dyckman.\nFrom the music to the service top notch!! You can’t miss!!! If your looking for good drink and a vibe that doesn’t break the bank then look no more!! Here it is!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqb29iMXF3RRAB",
            "text": "La experiencia es excelente el servicio y el lugar puedes ir compartir en familia si quieres pasar un rato agradable y disfruta de una buena comida y bebida lo recomiendo"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRejRUdDd3RRAB",
            "text": "Angelica is an amazing hostess. She is super professional and accommodating. Very kind as well. Not to mention, Christian (our server) is incredible as well. He is quick and responsive. I come here every week and always leave extremely happy and satisfied. The $6 happy hour cannot be beat!!! Even the regular menu has amazing options. The drinks are curated so well. The hookahs are $40 with a $20 refill and last a long time. 151 is definitely a spot to visit and keep in your rotation. I will continue coming here because they truly make you feel like family. I bring all of my friends and family here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bE9tdDhBRRAB",
            "text": "The food here is sooo good.. You have to try the mangu one of the best mangu I ever had. The drinks are strong this is my second time coming and my party loved all of their entrees. My party said the steak and eggs are really good as well. I went for BRUNCH! I definitely recommend 🫶🏻."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQN0wzMW5BRRAB",
            "text": "Amazing experience each and every time. From brunch, which serves this delicious jack punch for 2 hours unlimited. To their happy hour menu which has a nice selection of drinks and food until 9pm. To their dinner menu, everything is phenomenal. The service is exceptional. I have made so many friends there. And I'm sure to tell everyone I know about Room 151. Thank you!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bE9tR2Z3EAE",
            "text": "The Dj plays a great mix of music. Drinks taste good and are strong. Food is also tasty. I recommend the steak & eggs and the fried dumplings. Brunch 10/10 definitely recommend on Saturday or Sunday."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneXAyWWRBEAE",
            "text": "I had the pleasure of dining at ROOM 151 Sushi & Steakhouse, and it truly exceeded all expectations. From the moment I walked in, the ambiance set the tone for an unforgettable evening—modern, warm, and welcoming.\n\nThe menu is a perfect balance of top-tier sushi and expertly prepared steaks. The sushi was incredibly fresh, with each piece showcasing the perfect ratio of rice to fish. The chef’s special rolls were creative and packed with flavor, while the sashimi melted in my mouth.\n\nOn the steak side, the cuts were high-quality, cooked to perfection, and seasoned just right. It’s clear the kitchen takes pride in every dish they send out.\n\nThe service was equally impressive. The staff was attentive, knowledgeable, and genuinely friendly, making sure everything was perfect without being intrusive.\n\nROOM 151 is a must-visit, whether you're a sushi lover, a steak enthusiast, or someone who just appreciates a fantastic dining experience. I’ll definitely be back soon!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MUstU09REAE",
            "text": "Upon entering the restaurant, I noticed that the space was smaller than what was portrayed on their Instagram and Google photos. While the Chinola juice had a tanginess taste, it wasn't quite what I expected. Unfortunately, the food for our group arrived a bit on the colder side and didn’t seem fully cooked. We also found ourselves limited to the brunch menu, which might not appeal to everyone. I"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNRLWJJOBAB",
            "text": "We came for Happy Hour, and Room151 just wasn't hitting it for us. The drinks were way too sweet. I had a Long Island Ice Tea, and it tasted like sweet coco cola. The  Tequila Sunrise wasn't good either. I say the only decent drink was the Coconut Margerita. 2 dollar Margerita & 2 tacos.  The tacos were tiny, and my coworker ordered chicken tacos and got chicken nachos. The music is mostly Spanish. What made it worse  was a drunk customer who was very loud, cursing just doing too much. We had enough and left. The spot is cute and cozy, but I guess we just had a bad experience that night."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMzdIdVNREAE",
            "text": "The food was good. Nice little spot for date night. The waitress took forever to come back to the table, and there were barely any customers. But will retry.  Prices were great."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cjg2SjB3RRAB",
            "text": "I definitely recommend this place. The service was amazing our waitress made our whole experience. For my first time I would definitely come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MU1fQkRREAE",
            "text": "went for brunch. music was super low and ambience was bad. food was super cold and bad. could only order from the brunch menu, which was really small. waste of money. bathroom was super ugly and all of the walls in the restaurant were messed up. very small restaurant too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeklfdWhBRRAB",
            "text": "I had an awesome time here! The food was on point, seriously delicious. But what really made the brunch was the staff—they were all so friendly and just great to be around.\n\nEmely at the bar was super cool and made us feel right at home. Plus, her drinks were amazing, Didier was awesome and all about making sure we had everything we needed and was really on top of things. And JC who greeted us—he was super welcoming and set the tone for a great brunch.\n\nOne thing to note: the bathroom could use a bit more attention. The smell wasn’t very pleasant, otherwise great place.\n\nIt was just a really great vibe all around, and I’ll definitely be coming back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bllxY0hnEAE",
            "text": "Food was a hit or miss my skirt steak was really good but my sister salmon wasn't my son said his chicken tenders were chewy. the waitress was really nice and accommodating. There was a guy who seemed to be a supervisor he was making us feel uncomfortable he kept staring at us and when we told him about the salmon he said he couldn't do anything because we ordered it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRejZTUURREAE",
            "text": "I've come her for happy hour, brunch and for dinner service. The food is amazing. The drinks are great and the service is good. 10/10 would recommend and come again."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNXJMcWJ3EAE",
            "text": "Lo mejorrrrrr dios tenía tiempo que no la pasaba de esta manera Jonathan y Oscar son los mejores gloria la mejor mesera el otro domingo vuelvo otra ves"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcTZPMlF3EAE",
            "text": "They intentionally kick you out if you don't like you personally and these establishment needs to treat their patrons with more respect and the security guards are disrespectful and aggressive to customers.\n\nThere is one short dark skin Dominican dude clearly he has an issue with me and lies about me and when I requested evidence of a video tape he refuses to show me.\n\nI clearly just leave showing some bills I have an my wallet and go but this is clearly abuse and I want to seek to it that he gets reprimanded and even disciplined for treating patrons as such\n\nI will pose a complaint with the BBB and the local precinct in this area so this place is shut down for good and a new management can take over."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudU9IdWNnEAE",
            "text": "The newly renovated 151 has sparked, nothing but greatness to me and my friends, every time we visit. It is home to our weekly Wednesday happy hour gatherings.\n\nI definitely suggest going Wednesday’s\n\nGreat food and amazing hospitality !\n\nI love it here"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MHZpaW53RRAB",
            "text": "El servicio súper, la presentación,  porción y sabor de los platos son de la calidad por la cual se paga lo que cuesta. Felicitaciones para el chef.  👏👏👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cFlieTVnRRAB",
            "text": "Pretty decent food, the cuts of meat they offer aren’t the best. I spent $38 on a ribeye medium rare and they brought me a grey extra well done hockey puck that was half fat. I sent it back and what replaced it was fine but nowhere near the level of places in the neighborhood like Fito.\n\nThe happy hour prices are great but they don’t have a happy hour menu so you have to find it online or ask the bartender.\n\nOverall just left $70 poorer feeling like it’s just another spot in the neighborhood I’ll walk past."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqb3RLYmZnEAE",
            "text": "La verdad que ha sido excelente, la comida el servicio, los tragos el ambiente y la música lo recomiendo al 100%"
        }
    ],
    "reviews_count": 75
}