{
    "name": "Napa in the Heights Seafood & Wine Bar",
    "place_id": "ChIJtU0hMdbzwokRVpzLKjVuLxw",
    "grid": "MN12",
    "address": "4927 Broadway, New York, NY 10034, USA",
    "rating": 4.7,
    "user_ratings_total": 118,
    "phone_number": "(212) 942-6272",
    "reviews": [
        {
            "date": "3주 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oS1JVSkNVbDlFZERoNlkwSmlha3BDU2xveFoxRRAB",
            "text": "Estuvimos por el local ayer en la noche, el servicio es bueno, las bebidas y el lugar se ve muy cuidado, pero la comida no esta en su mejor momento, pedi unos calamares y camarones los cuales tenian un sabor a podrido, el cual a primera impresión pense que era el sabor de una primera mordida mal experimentada y trata nuevamente lo que me dio el mismo saber anterior, deben de revisar lo que le sirven a sus clientes todos los platos que pedimos a excepción de la quesadilla que estaba muy bien lograda! Todo lo demás no se notaba fresco ni con calidad!! Por favor revisar la comida y que tan fresca esta para servirla!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oT1dFaHBjV2hNTlhCZlptOHplSEYwTkhSd1dtYxAB",
            "text": "We loved the restaurant, the food was well served and tasty at an awesome price .We recommend it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbFFVTnBibnBwYkVkM1ZteEpRVWh6VlRseGVsRRAB",
            "text": "Good food, good drinks, and relaxing seats"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1a01XNVFOMGRNZW0xU2VEUjVPRTk2ZFc1ZmFsRRAB",
            "text": "Un restaurante que destaca por su excelencia en cada detalle. La calidad de los alimentos es sobresaliente: frescos, bien preparados y con una presentación impecable. El servicio es altamente profesional, siempre atentos y cordiales, lo que genera una experiencia agradable de principio a fin. El ambiente combina comodidad y elegancia, creando el espacio ideal tanto para reuniones de negocios como para ocasiones especiales. Sin duda, un lugar que merece ser recomendado y al que regresaré con gusto."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNVVuRTRaV0kyWkd0dlNGRkRVREZ4UzJKdFpGRRAB",
            "text": "A classy gem in Inwood!\n\nNAPA offers unbeatable lunch prices from 11–4 and consistently delicious food. It’s the kind of place where you can enjoy a peaceful, satisfying meal while locals share playful greetings at the bar, giving it a warm, neighborhood feel.\n\nThe staff are attentive and genuinely welcoming, Yuki attend to me today, but every visit is easy and enjoyable. A go-to spot for a relaxed and tasty lunch or dinner in Inwood."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaWVIaERiMnR5WkcxSlJHbElOMFJhVDBRd1ZrRRAB",
            "text": "Yo llevo desde que empezó el restaurante siendo cliente de NAPA que de hecho su comida es muy deliciosa. Hoy me llevé la peor experiencia de parte de una de las meseras ! Me sirvieron poca carne y yo se lo notifiqué a la misma. Se lleva el plato todo muy chevere y me pide disculpas luego regresa y me dice que no me pueden dar más porque es lo que lleva el especial sin preguntar que si yo quería algo adicional se cobraría extra . Un señor sale y dice la cocinera de la semana hecha más comida y no está supuesto!! Le diré que ponga lo requerido si no que no trabaje más y esto me incómodo. Le respondí que mi familia tienen un restaurante de hace 51 años y aunque la comida esté cara siempre se le da al cliente calidad y cantidad , además le dije que si gusta podía ir a comer de gratis para que probara. La mesera se metió y me comenzó a llamar miserable , muerta de hambre y hasta que me veo que  consumo drogas por reclamar por más carne !! Que si estoy tan necesitada que voy a un restaurante que pago 10 dólares la comida que esa oferta lo que deja es perdida para el restaurante  y un sin número de cosas ! También pedí comida para mi madre y no me la preparo, esperé más de una hora por la comida . La mesera continuó insultándome y amenazando con llamar la policía por defenderme a sus insultos !!! Las otras meseras que han trabajado aquí son muy buenas y nunca han faltado el respeto a un cliente. Es lamentable el trato que recibí hoy fue muy desagradable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPenp6OFg0Z3N2Zm9RRRAB",
            "text": "Everything was delicious and great service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNam9fc2FPcnB2WlBnEAE",
            "text": "Great service !! 5 star food and atmosphere!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3N2MycVV3EAE",
            "text": "Came in for happy hour and they overcharged my card by $8. Sent an email and no response. Bill was $27, left a $4.50 tip, showed up on my card as $40.00 even. Won’t be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMzZmRkNBEAE",
            "text": "Great lunch place, tasty and healthy food"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdkxDUnd3RRAB",
            "text": "The food is delicious! The service is 5 start! Highly recommended!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc055SV9RRRAB",
            "text": "All of these reviews led me to believe this food was going to be great but honestly I was just so disappointed… from the second I sat down I shouldve known this was going to be a hot mess. The waitress came over and handed me a lunch menu at 7pm.. we called her over later and asked if we could have the dinner menu and she stated that the chef had to leave cause of an emergency. Then she said lemme see if the other cook thinks they can make a dish from the dinner menu. She comes back and says he never left and that he’ll make whatever we want. So we order…\nI got the salmon entree which came with mash potatoes, my friend got the skirt steak with whole potatoes and my other friend got the burrata salad. Out of all our meals the only one satisfied was my friend who got the salad (becauee how can you mess up at salad???)\n\nMy salmon was fine but the mash came lukewarm and looked like it was scooped out of a tin and thrown in the microwave for 30 seconds. Completely flavorless.. I can make a better mash in my house and for 30 dollars its like a slap in the face.\nMy other friend who got the steak said it was fine but the presentation was lacking the potatos were dried up and shriveled. She ended up not even eating them. The plate was was honestly sad to look since it was huge and so empty. You can kinda see it in the picture we took for IG but honestly the whole meal was so sad looking we debated even posting it…\nWe also got a side of truffle fries and there was no truffle taste to them no Parmesan… they honestly tasted like McDonalds fries which arent bad just not what I ordered or wanted to pay 9 dollars for. We also got a fried plantain with cheese and it was also meh.\n\nI feel like she lied and said the chef was there when he really wasnt cause this could not be the same food I was seeing in the reviews…\n\nOverall this place was really not it and I would NEVER go here or suggest it to anyone. Thought I found a hidden gem in my neighborhood but boy was I sorely mistaken 🤢"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUR2NDVKThAB",
            "text": "Very tentive and caring waitress! Delicious food and good vibes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYa3BIV09nEAE",
            "text": "Went for the 9.95 lunch special. I showed up right around 1130 so not too crowded but I enjoyed the overall atmosphere and service was prompt. Portions are very good for the value. Recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuX2NiVmFREAE",
            "text": "The food and drinks were so good! Not cheap w the liquor at all!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudWRYMnNnRRAB",
            "text": "lunch special was an incredible value, and everything was very flavorful. i got the grilled salmon with rice and beans, highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURILWJqT2tnRRAB",
            "text": "Such amazing food and drinks, tastes like it was made by an authentic Dominican grandma. Our favorite dishes were the cazuela, chicharrón de pollo with tostones, the burrata salad, and the tres leche. I can’t wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIelBlbzhnRRAB",
            "text": "I came from Boston to hang out in New York. I stopped at Napa in the Heights today and I had Shrimp Quesadillas to start and then i had El Chuleton as my entre. That is a grilled double cut pork chop which was nice, tender and delicious. The food was amazing and affordable. Highly recommended for those who are looking for great food and a nice atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIekxYeHBnRRAB",
            "text": "I visited from North Carolina and the food was excellent, great atmosphere and the service was outstanding. My wife felt in love with the tres leches and the paella. I will revisit Napa in the Heights in the near future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Z3AyT2NnEAE",
            "text": "The best place to eat clean, friendly and good price"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MUwyZ1ZREAE",
            "text": "Comida divina, de las mas rica que he comido y la atención de la mejor, el ambiente para cualquier ocasión bien sea cumpleaños, reunión familiar o solo con tu pareja,  altamente recomendado."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cUxPdWhnRRAB",
            "text": "An amazing fusion of afro dominican  and mediterranean food. I highly recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cU5ueTdRRRAB",
            "text": "Food was excellent and very economical!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cUxLdGNnEAE",
            "text": "I came for lunch for a third time and it was phenomenal. I can’t believe this lunch was only $10. I’ve come at night several times as well. It’s a different ambience with live music. Im super happy they opened in Inwood."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNXZDMVlBEAE",
            "text": "Tuve una experiencia fantástica en\nNAPA IN THE HEIGHTS\nLa comida es exquisita y se nota la calidad en cada plato. Las bebidas también son excelentes, perfectas para acompañar cualquier comida. El ambiente es acogedor y el servicio es impecable. Definitivamente, un lugar que recomendaría a todos. ¡Volveré pronto!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOHRqeTZ3RRAB",
            "text": "I had chicken, rice, rice, bean salad, yellow plantain, green plantain fish fillet, delicious highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicVppaFZnEAE",
            "text": "Great service, fresh delicious food and cool low-key atmosphere. The tres leche was amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyczlLNVhREAE",
            "text": "An amazing small restaurant with character. Friday night 2-piece band Johnny Bliss with Fabio Pimentel, they are incredible they play in English as well in Spanish. Cocktails and drinks out of this world. Great bar staff! Great music"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyZ2F6bGJnEAE",
            "text": "Excellent. Nice place and service."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyN3F2NzlBRRAB",
            "text": "Muy acogedor"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycHZ1RWpBRRAB",
            "text": "Been here with friends, family, and solo. Fantastic food, nice people and can watch whatever game is on and have a drink."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6Z0xIazd3RRAB",
            "text": "best Lunch specials 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUamI2bkhREAE",
            "text": "Disappointing salmon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqM012NHNRRRAB",
            "text": "Good value lunch menu. My husband enjoyed the Pork chops and Moro rice, and the creole prawns were cooked perfectly. Espresso was also very good. Very clean with good service"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdDZEV3VRRRAB",
            "text": "Buenísimas atenciones!!!!!!."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREelBLd0h3EAE",
            "text": "Great live music and cocktails - Try the Charley Brown. Also the best tres leches cake in NYC, hands down."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MzY2ZnJRRRAB",
            "text": "That was an awesome discovery. Just walking the street and find out this place. Live music, amazing food and great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMEpqLXhRRRAB",
            "text": "My expectations were higher, than what I found, I thought it was linked to the world of cork and wine ,  but not really , they do\nhave a selection of wines, but very limited\n\nI didn’t like the atmosphere, very loud music and an unreceptive atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOMWVMUVFREAE",
            "text": "I had their burger and it was delicious! Enjoyed wine and live music on a Friday."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOam82LXRBRRAB",
            "text": "Perfect Saturday date night dinner. The food was delicious. Had one of the best branzino ever. The staff provided service with care and a genuine smile.\nWill definitely return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNlB5TXlBRRAB",
            "text": "Music and therfore conversation too loud for such a small place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsLUwtNEpBEAE",
            "text": "The service and food are excellent.\nThe venue is not easy to find because scaffolding obscures the name of the restaurant in the window.\nThe correct address is 4927 Broadway, not 4931 as listed on Google maps."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGdzZueWlBRRAB",
            "text": "I found out real fast why it was rated 4.9. The staff was incredible kind and accommodating, the food was delicious! the prices for the lunch men were fair. My wife and I will definitely return. In the meantime we'll continue to spread the word."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGOVlxRldnEAE",
            "text": "The pork chop was amazing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGcVllVGlBRRAB",
            "text": "Such a cute spot. Nice decor. Good food and drinks. Good prices and service. Good times."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1a01XY3BBRRAB",
            "text": "This place is a hidden gem! Food was delicious and very reasonably priced. The service was very kind and accommodating. The bartender offered to make me a surprise cocktail with the spirit of my choosing, and it was absolutely amazing. High highly recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1a1pxUHhBRRAB",
            "text": "Great food. Everyday $9.95 lunch! Great food with excellent price !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NFllNlRBEAE",
            "text": "The food was great...had the salmon...delicious. Gene our server was exceptional and the performance on Fridays top notch...johnny bliss and company rocked it.  Will be back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaLWVhRm5BRRAB",
            "text": "The food was amazing, the service was excellent too, the atmosphere was perfect I really liked it. I’ll come back soon, everything perfect!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNac3BtVHNBRRAB",
            "text": "Almuerzo súper rico Arroz/habichuela/Bistec encebollado y ensalada riquísimo, especial del dia almuerzo por $9.95…. Woww,  vendré todos los días, el precio y la ricura lo amerita, y las atenciones única 👌"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKalBpXzh3RRAB",
            "text": "Great low key spot in the neighborhood with exceptional quality and pricing, they have happy hour here as well. Jean, our waiter was awesome! From the seafood to the vegetarian dishes, they were all good. My favorite is the crab cakes! I highly recommend you to order different small plates and maybe one entree if you're not too hungry and are willing to share with others."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbGZMblF3EAE",
            "text": "This is the best new place in Inwood. First time coming here with my wife on a date night and everything was amazing! The drinks, the food, the service and the owner came over to say hello! Support our restaurants up in Inwood. This place does NOT disappoint!!! Carlos and Juan are awesome and Lizette the bartender knows how to make those cocktails! We will be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoelpYVkV3EAE",
            "text": "This is a small hidden GEM! Customer service was warm, inviting and very attentive. Food was EXCELLENT. I had the crab cakes, meatballs, octopus, con con fried rice and the most unique tres leche tiramisu. Every single dish was so tasty. I also tried every cocktail on the menu and not one disappointed. The presentation of the drinks was also a plus. Ambiance and music were amazing, I was there for almost 4 hours 😅 but what really got me was the prices. This place is very affordable without compromising quality. This will definitely be my new favorite spot in Dyckman."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNlBfUXlBRRAB",
            "text": "This place is hiding lol!! It's located in this very unassuming spot under scaffolding and so it's hard to spot, but right underneath that construction zone is a super lovely, super classy, super delicious seafood restaurant and wine bar, which served us the most delicious dishes and great glasses of wine with wonderful service too. It wasn't very busy in here when we stopped in for dinner, and they have a little happy hour too that we were able to take advantage of. It's a higher price tag here for sure, but the food quality is definitely worth it!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKd3MtcDVBRRAB",
            "text": "Beautiful fancy little gem of a restaurant in Inwood.\nIt was recommended to my hubby by his barber, whose also an Inwood local.\nWe came here on a Wednesday afternoon after work.\nIt’s right by the MTA A train Inwood 207th St station.\n\nFood was excellent, service was great and the restaurant itself looks impeccable.\nJust be prepared to throw down at least $100+ when with 2ppl.\n\nMy hubby enjoyed his:\n- Mini Maine Lobster Roll $16\n- Herb Marinated Lamb Chops $29 (very good!)\n\nI, as a vegetarian, enjoyed my:\n- Spicy Cucumber Salad $10\n- Burrata Salad $11 (very good!)\nI’m very grateful for the vegetarian options, even though this is a seafood restaurant.\nThe cucumber salad I won’t order again, instead I plan on ordering the burrata salad twice next time we visit.\n\nWe shared a flan for dessert together, which was really really yummy!\nI believe it costs somewhere around $8-10.\nFYI: There’s no dessert menu, I asked for the dessert options.\n\nThere’s happy hour for drinks only:\n- Cocktails $8\n- Beers $4\n- Wine (I don’t remember)\n\nMy hubby definitely wants to come back to try other dishes from the menu and I’ll be right there with him enjoying the burrata salads!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodElXYzRnRRAB",
            "text": "Found this little place near the 207 street A train station. Very good drinks, specially the Lychee Martini. Excellent expresso martini. The crab cake was very good and fresh.cucumber spicy salad was refreshing. The rice con con… was amazing as the rice was crispy. For a second I thought a paella. If I had kimchi it would have been a bibimbap. I can come back just for this plate. The fish was really fresh and tasty. Returned and tried the Ribeye, and it was really good, medium rare served with potatoes. I also had the Gambas... what a treat.. loved it. and for dessert had the Tres leches and the Sweet potatoes.. wow..try the new drink The Embassy o La Embajada original with black berries, the second one is with raspberry… delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4akk2c2pRRRAB",
            "text": "Have been wanting to try for a while and am glad I did because the drinks, food, and service here are EXCELLENT!\n\nWe came for happy hour and got the cocktails then some wine. The bartender was even nice enough to make me a lychee martini after I had expressed my love for lychee drinks.\n\nThe food was super well seasoned and beautifully plated. We ordered the arroz con con and the branzino with a side of the Spanish lentils and it was phenomenal. Everything was on point, we will be back soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdXBIdndRRRAB",
            "text": "This restaurant is amazing!! It’s beautifully decorated!! The food is absolutely delicious and the customer service is A1!!! And the Happy hour prices!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M3Q2UDZnRRAB",
            "text": "Cocktails were tasty. Service was great. Happy to have this place in the neighborhood"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdk1QRHFBRRAB",
            "text": "While the space and ambiance is beautiful, this spot is way overpriced and mediocre. Their happy hour sign says “cocktails”, but it’s not any of the cocktails on their menu, just well drinks (write “well drinks” on the sign then!) Frutti Del Mar was a tiny portion of overcooked spaghetti in a bland tomato sauce, no lobster included even tho it was listed on the menu. Servers were kind, cocktails were decent, but there are better options in the neighborhood so we won’t be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoazlIV0dnEAE",
            "text": "One of my favorite low key spots for a cocktail & tapas! The espresso martini & tuna tacos are to die for!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURockpmWUp3EAE",
            "text": "Amazing food finally I nice restaurant around the area!\nGreat cocktails\nGreat atmosphere... the only place with great wines for a fare place!\nService was very efficient and friendly\nThe menu is amazing.. the tuna tartare was super tasty!\nI paired the tartare with a nice glass of sauvignon blanc\nThen I tried the crab cake with a glass of chardonnay\nI finally tried a nice steak with a glass of cabernet\nMy dessert was the famous 3 leches\nMaybe the best one on town!\nI ended my meal with a nice port wine!\nI will definitely recommend this place ..\nI will come back for sure!\nFood is really good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScU15NGdRRRAB",
            "text": "This is my first time visiting this place, and it exceeded my expectations. It has a pleasant and relaxing ambiance. Service was very courteous and attentive without being overbearing. And the food, it was excellent! Seafood is my thing, and boy they delivered! I'm a local, and they have found a regular."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdGUtOXhnRRAB",
            "text": "The place is clean and presentable. I got there about half hour after opening at 5:00 in the afternoon. The only bottled water they have is Pellegrino. I ordered the burger and it is quite possibly the most oily greasy burger I've ever had. Two Quarter Pounders two slices of cheese on a really oily roll. I saturated part of the fancy napkin that they give you with oil and there was plenty left. I was there for about an hour, during that whole time no one else came in on a Monday after 5:00. I thought that was strange. I am told that some of the other food selections are quite good and apparently I chose poorly. This was my experience I hope it's helpful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeUktRUlBEAE",
            "text": "Really nice place. Food was exquisitely devine. The staff, Maria, Pablo and Rafael, treated us like we were home. I went there wth my family and we really enjoyed it. Gotta mention the sublime music-it was ethereal. We're going back! Loved it! Thank you to the staff. Keep up the greatness!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbGZ6MGxBRRAB",
            "text": "The cocktails and wine selection here are good. The bites? Not so much. The lobster ROLL (advertised as rollS) was made with TOO MUCH mayo. The WHOLE branzino (advertised) was actually a half filet and was garnished with olives and a sour sweet potato purée. Weird. The filet was well cooked but wasn’t seasoned. The fruitti de mar also wasn’t seasoned. We ordered the cheeseburger medium and we received a rare burger. I may visit again for the drinks but I’ll be sure to eat ahead of time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoLWVUMFpREAE",
            "text": "This is my 3rd time at Napa. Food is delicious!!!\nGreat music & ambiance, food could come out a little quicker.\nDisappointed to find out there is a CC processing fee & not aware of it until your card has been charged."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoa2FLTmdnRRAB",
            "text": "Had dinner with hubby the other night.  The food was delicious.  I had the smash burger.  The best burger I  ever had. Love the atmosphere.  I great for date night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaTVfN2tBRRAB",
            "text": "Such a cute gem in the neighborhood. Great place for dinner & drinks. I ordered the ahi tuna tacos & they were delicious. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScUxUWlpBEAE",
            "text": "Great ambience.  Excellent service, Friendly staff and delicious food! A great place to chill ,and ave a great conversation, and wonderful food ! I highly recommend this place! I will return when I visit NYC again."
        }
    ],
    "reviews_count": 70
}