{
    "name": "Geisha Asian Fusion",
    "place_id": "ChIJtYb5eZj3wokR37WTthV9GQ8",
    "grid": "MN12",
    "address": "4186 Broadway, New York, NY 10033, USA",
    "rating": 4.4,
    "user_ratings_total": 359,
    "phone_number": "(212) 927-1246",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMWEyRlhlVzlMUldodllraDNObTF5T0hCeVRXYxAB",
            "text": "I loved the food the decor the service and the sushi and bento box from here is amazing i got salmon white rice shrimp dumplings and veggies and California rolls"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQ2JFbHNNV2MyTld4WVJrNVZYMWRuT1ROUFozYxAB",
            "text": "The food is good, but the service is terrible."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSFJXMXViWGx6VjFSQ2VGOTNjRWx1UzNoUFJXYxAB",
            "text": "This place had really good food, but the service was a bit slow, especially when it came to getting our checks at the end. Secondly, the place is rather nice and has energetic music and low lighting that give you the vibes of the club, which I wasn’t entirely prepared for, so that’s partially my fault. Despite this, it’s still really nice!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcmFtRllaSEF3TVhOTFNITnNlWGRFUlROZlgyYxAB",
            "text": "Went in last night as a party of two. Sushi was fantastic. Service was so bad it was laughable. Wasn’t busy. Only ordered edamame and 2 sushi dishes: edamame took 45 minutes and the sushi took another 30. They pretended not to see us waiting throughout. Once done, we couldn’t find anyone to get the check. When we finally did, there was already a 20% tip and another hidden fee applied to the total. This infuriating experience should not have taken 2+ hours. Nothing was done to make up for the wait. Avoid!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcmVVaElVelJrU2poU1dHeEJiME51VmpGcFlYYxAB",
            "text": "Fresh food, i loved"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaWRpMHpOMHhLUTFGRlVWZFdNMHRaZVVOTFRVRRAB",
            "text": "Great place to go after work , or any day to enjoy"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTFQzcHlXVk5NVkhGS1NHZEpkVEF6YTNOeVFYYxAB",
            "text": "My bf took his mom and I and we loved it. Sushi was so fresh I ended up going back with a friend. Drinks were great. I recommend the lychee martini and the blackberry baltram (I think I’m spelling it right) lol ambience is a 10/10. Service 10/10"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWc1dYVnVjVkprYURNMVRIaGlVWGhqVUhwWmRsRRAB",
            "text": "ordered a sushi deluxe and Philly roll\ndelicious and fast delivery"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOZlVtMDBUVVYxZFd4WVVXWjJWSFJUWWxKTU1XYxAB",
            "text": "The food here is AMAZING! Dimly lit with electric candles and mural on the intruiging mural on the wall makes for a great atmosphere. There aren't that many upscale restaurants in upper Washington Heights, but this is one! It's also hard to find Saba (Mackerel sushi) at almost any other Japanese restaurant. The salmon skin salad with carrot ginger dressing is heaven. I also order in. I say GO!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKV1JVTldjSGxvZDFvdGRuaE5aSEZXY0ZWSWJYYxAB",
            "text": "I came here today to get some sushi with my friend. We ordered the following: 1 order of pan fried gyoza, 1 shrimp tempura roll, 1 beef pineapple fried rice, 1 chicken w/ broccoli & white rice and a king lobster roll. When the king lobster roll arrived, it did not look appealing so we sent it back. When the bill came, we were charged for 2 shrimp tempura rolls and the king lobster roll. I asked to speak to someone to get the extra items removed and it took 10 minutes to get someone to help us. Mind you, no one was in the restaurant. No one checked on us to see if we needed a refill or how are order was. They ended up removing the king lobster roll off our check but they kept 2 shrimp tempura roll. I asked the server by we were charged for 2 shrimp tempura rolls and she said we ordered that. I repeated we did not and she said she did. This was unprofessional because when she read back our order, only 1 was ordered and that’s all she repeated back. The service wasn’t the best because no one checked on us. This is upsetting because I do love the food but did not have a pleasant experience and I would like to hear from the manager directly since they did not want to approach us while we were there."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNVF6bGtTME4wWjBWNFdteGFNVjl6ZVRSM2NtYxAB",
            "text": "Delicious food.  Fast service.  Nice ambience ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMWJuRTRXVVpsU1Y5aVZqUnBhSFpwZEhGUVJXYxAB",
            "text": "5 stars service. Food was fresh and delicious. Will definitely be a regular."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbFVVeHRXVEUwTFRsRlducFdRVUpZYVhrMmIwRRAB",
            "text": "Muy bueno"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacWVsQXpSbXBoYm05S1NYaGtTR0pRYVhsV1VXYxAB",
            "text": "I have been a long time fan of their takeout and will continue to get takeout.  However this place seems confused between being a bar/lounge and a Sushi Restaurant.  The whole experience was very confusing.  Very dark inside, strange 1980s music playlist that, in my opinion was distracting.   The meal was fine but nothing to celebrate... I won't get into the $$$$, but it was expensive for four people with four drinks in Washington Heights."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSWVYbFNNWGRTT0ZRd2RXeE5ZMGxST1dOTmNWRRAB",
            "text": "I ordered delivery of sushi rolls, which were great. I also got ramen. The tom yum soup was such a disappointment,  especially at $8. It was dirty water with onions, mushrooms and shrimp. I feel robbed for the $8!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeE5EQlFMVFZ6TVMxSVoxbFlORk5TWjI1WVNFRRAB",
            "text": "nasty food and nasty service\nbad experience no recommended for the family and nobody"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdVVHZDBXR2ROWm1WdVRVbG9jVWN5U2t0SmJXYxAB",
            "text": "First time eating here, and it was amazing. The dish was made so elegant, the teriyaki chicken with the sauce was spot on.\n\nThe whole place is really beautiful with a nice choice of music."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWV1dIZFFiRlUxY25WbmJIWTVZalZOZERaU0xWRRAB",
            "text": "Delicious sushi for amazing price. Highly recommended"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMGJGRjZTbkJ4TlhKeGJqRmtPR2RsYzNOWk1tYxAB",
            "text": "I LOVE THIS RESTAURANT! I come to this restaurant occasionally since they opened because their food is really delicious. I recommend the rangoons and the Latino roll. However, sometimes the food takes a little long to arrive especially when it’s busy but the food is totally worth it. The atmosphere is really nice and chill on the weekdays. I think sometimes on the weekends they do some karaoke and play music to vibe to."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poak5YQjBTbWR6YVRsdlFrNUhlRFphZUZsdk5rRRAB",
            "text": "Nice people. food good"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxX3RDdk5BEAE",
            "text": "Predatory price tactics. Female server tried charging us 36%(18% twice) in tips. Also beware of them charging you their CC POS processing fee.\n\nGreat food, but mediocre and dishonest service which does not reflect the prices they charge."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OS1luUndWbE0yWWtodWJFeGlYMEpoVDFWNlpHYxAB",
            "text": "3 stars only because of the servers. Outstanding waitress and waiter.  Food is overpriced. Food is subpar. I ordered the steamed pork buns and they were cold.  I had the \"curry\" Ramen.  I was disappointed to say the least.  It was flavorless.  They served me noodles with water.  Where were the spices?  The crispy calamari were ok.  Then the bill came .  Wow.  Too much.  Never again.   Overhyped overpriced."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSU1dWUjZSVU55YW1OaFRsbHRValZJWVhaNE5sRRAB",
            "text": "I ordered my lunch for pickup in a wrong location, and the staff, especially CK helped me having the food prepared at the location. I really love this place, the food is fantastic. Thank you"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMlkxaFJVMlYwVEcxVlkya3plV00yTkROT01tYxAB",
            "text": "Absolutely amazing spot for genuine Sushi. Can't believe this is in the heights."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPdTlrdUdxX1pEVjhBRRAB",
            "text": "I use to love going here but because of the service I think twice about eating there now. They’re always either forgetting something or getting the order wrong, Then while you’re waiting for them to get it right the rest of the food is getting cold. Ugh! So frustrating"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMFRXTTFVVUYzT0dORU1qaFdNRmhxYUhKMGVrRRAB",
            "text": "Recommended without reservation, the sushi is good and reasonably priced, brunch is great, friendly staff, nice decor, beer is served very cold."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOUzFyLUhMaEp2cVFREAE",
            "text": "Very warm and the host is very very sweet, super hospitable.  I did not get his name but he had a very friendly smile and vibe!  I got a bottle and a bento box dinner.  Everything was delicious omg!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQT20tTF93LXBtM3Z3RRAB",
            "text": "Great place, this place is one of my favorites."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKREFnNUtCbUlHbzh3RRAB",
            "text": "The absolute best chicken dumplings ever! Love love love!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYnowUE9wXzVPQ0x3EAE",
            "text": "Shoutout to server Angelina and bartender Raven! Really good job. Coming here often, never got disappointed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VNbVZpY1B4cTZDdWN3EAE",
            "text": "Ordered combo with spicy tuna salmon and eel, only spicy thing I got is my mood"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZVQ2STZYc0w2cVhnEAE",
            "text": "Delicious food & great attention."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbUtYN2J3EAE",
            "text": "The manager there came to our table asked about the service from our server because my boyfriend didnt tip the server. He wanted to tip the bus  boy cause he serviced us more than our server. The bus boy dont get the tips which the server attended to his girlfriend which was sitting by us. He the manager with black vest talked told us if we not gonna tip wr will not be allowed back in here. Which we said the server (orlando) did not serve us the bus boy deserved it. Never come again video is available if needed of him talking about us to server with the girlfriend that our server went to the rest of his shift."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvekxQNWxRRRAB",
            "text": "First time eating at Geisha and overall our experience was excellent. There was definitely a lively vibe in the restaurant, they had a live DJ playing some trending music. I liked that the music wasn’t too loud that I could have a conversation without straining my voice. The food was phenomenal and it came out pretty quick considering how packed it was when we visited. I recommend trying one of their specialty rolls. They are both unique and delicious, especially the roll made with maduró. Yum! My husband and I ordered bento boxes and honestly it was so much food that we had to take the rest to go. The prices were pretty great especially since we basically had food for two days with the leftovers. We will definitely be returning some time soon 🙂"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaE1PSzRBRRAB",
            "text": "Drinks are great Angel is an Excellent Bartender/Waiter, I'm not a talker when I'm out to eat but he gets you to conversate without forcing, so kind! Food is DELICIOUS Bento boxes are my go to!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMHMzME5nEAE",
            "text": "Pésimo ambiente y servicio( en general no por el mesero)  , la comida demoró casi una hora en llegar ,llegó fría y si no fuera por que pregunte por ella hubiese tardado aún más y aparte cuando llegó vino mal ( algo falto )  , la alarma de incendios sonó como 4 veces y los baños estaban asquerosos 🤢 he ido varias veces y nunca había estado  todo lo mal de una sola vez ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdWR1V2pBRRAB",
            "text": "They need to do better for the money they charge : service was mediocre"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaW92OFR3EAE",
            "text": "4/1/2025: I got a three-piece sushi combo. Ate the food and immediately started to feel sick. Vomiting and diarrhea for the rest of the day and half the day the next day.\n\n4/8/2025: I called the restaurant because I enjoyed their food before and liked the place. So, I called to give a heads-up. I did not ask for money, a refund, did not yell, and respectfully attempted to explain what happened as a courtesy heads up that things may not be stored correctly. The GM, Jacquelin, displayed the most horrible customer experience ever. A customer called, not asking for anything, being respectful, just calling to give a heads-up, and she straight up dismissed me. She then further insulted by calling her employee \"the girl\". I had the great pleasure of speaking with Angeline, who was professional and a pleasure to speak with.\n\nHey Owner, rethink your manager's position. If a customer is calling not asking for anything and just wants to report a possible health sanitary issue, being impolite and dismissive will cause you A LOT of issues.\n\nEdit: The reason I called few days late is because a family member died on 4/2/2025. However, made a mental note to call asap because I did enjoy the place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNGJQLXR3RRAB",
            "text": "first time ordering\nI didn’t know what to order customer service and the food is bomb she runed down the options and what each one comes with patience and a great attitude !!!\nthat’s what counts good customer service and the food is bomb t!!!! Definitely will be ordering again !!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOHVmQnZBRRAB",
            "text": "Um I love it here. Such pretty decor, food fire (americanized but good, still have sashimi) Service is great. Expensive, but typically worth it and there’s a happy hour with $5 beer most days."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMGRmbHp3RRAB",
            "text": "I always get takeout for their lunch special for any three sushi rolls for $18 which is a STEAL. Good quality sushi it tastes great. Recommend"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRb2JhTGVnEAE",
            "text": "This place has  partial Japanese menu with unskilled non Japanese  chef. Terrible! . Do no get fooled by Japanese label. Avoid!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMzVmaXJnRRAB",
            "text": "All entrees are great, be wary of the apps (calamari, pork buns - no hoisin sauce) definitely not made onsite.  Sushi is wonderful, so fresh.  Service is a bit non attentive as they need to notice when plates are done, drinks are low or empty, etc - work the room better - improve upon servicing each table consistently."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnck9XUzN3RRAB",
            "text": "ORDER THIS FOOD!!!!! Uber eats messed up our order- the restaurant independently fixed the issue and sent us new food quickly and without issue. So kind. Delicious and wonderful service. Will be ordering again!!!!!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPLXUyYnp3RRAB",
            "text": "Exelente, comida muy buena y los tragos más que bueno"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdG91dXZRRRAB",
            "text": "I can only assume the indoor dining is attentive. I ordered through Uber Eats and it was a very fantastic lunch of Veggie Pad Thai (with eggs by default), the choice of three rolls hit the spot, and the sweet potato “fries” did not match the image; they were slices of sweet potato in that crunchy batter the vegetables get, which honestly was a much better way. I ordered the Futomaki roll, too, which my kid enjoyed as well."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNUkydExREAE",
            "text": "The food and drinks are great. The server/ hostess was super sweet. But unfortunately there was a roach in my ice in my drink. I can’t go back which is unfortunate. They may need an exterminator but food was good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMl83MXJRRRAB",
            "text": "I went there to eat pineapple chicken fried rice and dumplings. There was a Mexican guy who was walking up and down the restaurant making racial and homophobic slur. He was about 5'4/5'5 a little chubby. I tried to addressed this to the manager but instead of reprimanding his behavior, they supported telling me that he was doing his job by cleaning the tables. Guys, I'm appalled."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc1l5bWlRRRAB",
            "text": "Excelente servicio"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNXF5Sk1BEAE",
            "text": "Buenos precios exelente comida."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYOTQ2VWZBEAE",
            "text": "Visited this establishment based on a recommendation of a friend. I was craving sushi so decided to hit up this sushi spot.\n\nUpon arrival no greeter or staff to greet you. I was seated near another couple who couldn’t stop talking loudly.\n\nThe server seem tired, disconnected or over it. Took him over 8 minutes to take my order and several times I had to flag him down for the check. Mind you, the establishment was relatively empty. He had no issue chatting it up with two other tables. Service needs major improvement.\n\nFood was actually pretty good. I would have issued a 4-5 stars but service was just absolutely awful.\n\nThey have a comprehensive menu and hoping to visit again under better circumstances. I always believe in giving a establishment another chance to redeem themselves.\n\nIf you want sushi, visit Geisha Asian Fusion but take it to go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3X29XNDJnRRAB",
            "text": "All I can say is WoW 🤩\nWe went to see a show at the Palce Theater 🎭\nHad to get dinner and happens to walk buy this little place. I’m so glad we walked in!!!!\nThe food was great! Presented like a picture! Waiter was very attentive but knew not to ask “ How was the food “ when I’m trying to eat. And I appreciated that, next time I’m in Ny I’m definitely coming here. And the drinks  🍹 were spot on."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCd3NMMGpBRRAB",
            "text": "I love this place so so much. Everyone is very kind, from the staff to the manager to the sushi guys working hard in the back. Every time we come here it’s always great vibes and amazing presentation of food. They always take good care of you and treat you well. 1000/10 would recommend. RJ the waiter and Frankie the sushi master are the best. Thank you for all that you do!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweGFPWk1REAE",
            "text": "I have always wanted to try this place. I took my daughter and we really enjoyed it. The food was great fast service also. Everyone from the staff was amazing awesome service. The music keep us hype and the overall feeling of the place was amazing vibe. 👏  Can't wait to go back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbE9XcEd3EAE",
            "text": "Have been here twice so far for dinner after work during the week.\nI’m nothing but positive about both experiences!\nFood is great, service is good and vibe is fun & chill!\n\nThe happy hour menu is wonderful!\nValid every day (besides holidays) from 3pm til 7:30pm.\n\nWhat I personally love about Geisha Asian Fushion is that they have vegetarian friendly options for vegetarians like myself.\nI had the sweet potato and peanut avocado (cooked) sushi rolls and both are delicious ($7 per roll)!\nFrom the happy hour menu I had the scallion pancake ($7), which was a good portion and yummy!\n\nThe owner is very kind and so are the staff! Service is kind and quite fast! If you’re picky with where you initially get seated (like I can be), the owner and staff are very accommodating (depending on how busy it is at the moment of course). But I personally appreciate this very much!\n\nThe establishment is very well taken care of. It’s clean, modern looking with a fun “lounge” vibe to it with Japanese art on the walls.\n\nFYI: 18% gratuity is included already when you get your receipt.\nBut it is done in an honest manner, because there are stickers on the menu that clearly state it.\nAnd the owner also mentioned it when he handed over the receipt.\n\nThe only negative thing I have to say is that I’m bummed out I don’t live closer!🥲(We live a few stops away with the A train)\nI’d pick up sushi every week here if it was walking distance from where we live.\n\nI definitely recommend everyone to give Geisha a try when craving sushi or Asian fusion foods!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXNGIzT2JREAE",
            "text": "After my 3rd time here in a week, I decided I needed to leave a review. This place is exactly what we needed here in Washington Heights. An extremely solid Japanese restaurant with great prices and service. The owner, Sandra made us feel…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5by0yTlZ3EAE",
            "text": "This place has done a complete 180 degree.   This used to be a mom and Pop restaurant that I loved.  It has now transformed into a Dominican night club that serves food.  That said, the waiters are GORGEOUS and the service is BAD and the food is BLAND and the music is LOUD.  Have fun."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbGZtRmlnRRAB",
            "text": "Quick service with freshly prepared food that hit the spot! I loved the bento box with General Tso chicken. It looked amazing, smelled great, and tasted even better. The drinks were bit strong and not my preference but everything was perfect. I will be back soon to sample more dishes."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbEp1MlBREAE",
            "text": "Food is always phenomenal. The food takes a very long time to arrive, the service could be better and is getting better. I would say the manager is very rude to his employees, It feels like he’s always breathing down their neck. The atmosphere is very nice for any occasion whether it’s a date or just getting sushi somewhere nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNnZXUE9nEAE",
            "text": "This new location is a bomb! I know geisha sushi for a while, I’ve been trying it for years now at their original location at the 142st.\nThis new location it brings all the goods to the neighborhood and the restaurant itself.\n\nService is good, quick and easy to order out.\nLocation wise is pretty easy to get to, and the ambience of the restaurant is very attractive.\n\nI feel the fool here more tasty and pleasant Than other location. Their menu is so vast with plenty of options for any craves.\n\nI am happy to have more food options around."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNUk3eUdREAE",
            "text": "Cool spot & great happy hour. I walked by, and the happy hour specials caught my attention. Plates starting at $4 & up. I sat at the bar, and ordered the fried calamari  $9 which looked like onion rings. It was shaped round, good crispy taste served with a brown sauce. And a gyoza plate, $4 fried served with dumpling sauce. I opted for a cold sake bottle $16 instead of drink specials. Together with tip, $39.  Staff was friendly and good customer service. Great vibes. Would definitely visit again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbk1XNnpnRRAB",
            "text": "The sushi was great! The fish quality was good. The miso soup was tasty. The presentation is so cute. The service was ok, they just open. The price is in accordance of what you received. Is the best sushi in Washington heights right now."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNXJYTnVBRRAB",
            "text": "Great beautiful place! I've been wanting to go for a while since they opened and haven't had the chance until today! I love they have a lot to offer for the non-sushi eaters too! I got the Jokester drink, a rainbow 🌈 roll, and a salmon roll. Everything tastes so good! I wanna come back for their happy hour or lunch and go off because sushi can be so expensive! Yummmmmmmmm 🤤"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwakllNGFnEAE",
            "text": "This review is about an order I placed for pick up today July 29, 2023. Everything went smoothly over the phone, placed the order and paid because my sister was going to pick it up. (I was alone with my kids, so she offered to pick it up)\n\nI requested extra ginger for 4 rolls (see picture) , I specifically told my sister to remind them about the extra ginger. When she did the woman in the counter told her “Each roll comes with ginger” OF COURSE! It is not the first time I eat sushi. Anyway, my sister did not check, when she came not only the sushi rolls where squeezed in one box, but the amount of sushi included was enough for one piece (remember I ordered 4 rolls! That is 24 pieces!) that is why I ordered extra ginger!\n\nI called right back to complain about my missing extra ginger, and they in a unapologetic way told me, “if you want extra sushi you should come and get it”…\n\nLast time ordering from this place… food is good, but the customer service is deplorable…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlN2NqS1NnEAE",
            "text": "Tuesday night, dinner was really good. I’ll give it a 10 out of 10 for being uptown. Usually sushi places around here aren’t good and fresh but no complaints.\nThe coconut shrimp really good. I’ll be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyb3FIcDlnRRAB",
            "text": "From the drinks to the food everything was amazing and surprisingly not too pricey. I was shocked when I saw our bill whic was $560 however when spilt between all 12 it was a little less than $50  per person.  They have a live DJ not too loud but enough that you can hear the music and be able to have a conversation.  This place is very intimate so it's great for couples but also great for a small crowd. Also has a bar area to sit. I promise I will upload more pictures when I go back. Been here twice and both times it was great. My new favorite spot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaUttekN3EAE",
            "text": "Been here several times and love this place. The food and drinks are delicious. The happy hour has become one of my favorites. Not having to travel far from home is definitely a plus for this place. Recently I reserved for 4pm for a party of 12 and the service was outstanding and the food was delicious!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcDhyVGJBEAE",
            "text": "Loved Geisha. Went for lunch with a friend and got the 3 roll lunch special + 2 special rolls. We did the avocado, sweet potato, and shrimp tempura rolls for the lunch special and the coco shrimp and Hamilton rolls. We also got the Geisha rangoons as an app. They were so good and perfectly crispy.\n\nEverything was so delicious and fresh and not ridiculously over priced.\n\nThe servers were all very attentive and sweet. Would definitely go back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyakwzUjRnRRAB",
            "text": "Excellent authentic Asian food!!!! Everything in the menu is amazing ambiance is great, they have live music that it was definitely a plus...service great!! Love that the owner is around and go to your table and makes sure you are pleased!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNHBDVE5BEAE",
            "text": "This is the only sushi place I go in this area. As a matter of fact, in the city. I have tried other places after Geisha, and have been disappointed.  I love the atmosphere and the service. I meet here often with friends and family."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NTh2cDB3RRAB",
            "text": "My husband and I were looking for some really good food and decided to try this place,so glad we did. The music was great, the food was perfect and the atmosphere was very welcoming. We were seated immediately and it wasn’t too crowded."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MDd6MUJ3EAE",
            "text": "Good service Great food love the decor good spot to eat right after coming  from work"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMGFyTjJ3RRAB",
            "text": "Second time ordering delivery from here thru Uber Eats.  And I must say I will continue to do so.  I was a bit wary of ordering a bento box for delivery but was not disappointed.  Everything was exceptionally packed with all required sauces."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNmFldXh3RRAB",
            "text": "Salmon wasn't fresh - very pale and had what looked and felt like a worm on it!! Showed it to my friend who's a sushi chef and they also agreed I shouldn't risk getting food poisoning. I love their other location though, so I will stick with that one despite the fact that it's farther away... I tried calling the restaurant but it would beep and hang up. Got my refund via Door Dash."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtblppZjJnRRAB",
            "text": "Everything was excellent!! Loved the service and the food. The appetizers were great and the sushi was exquisite 👌 😋  would definitely recommend this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcS1fSEZ3EAE",
            "text": "Cool staff, good ambiance, staff dressed in collard shirts and the lady customers with their pretty dresses. Food is consistent, always on point. It is accessibility friendly."
        }
    ],
    "reviews_count": 76
}