{
    "name": "The Bonnefont",
    "place_id": "ChIJZVrBiOn1wokRgTOIN3hlOJM",
    "grid": "MN12",
    "address": "1 Margaret Corbin Dr, New York, NY 10040, USA",
    "rating": 4.2,
    "user_ratings_total": 210,
    "phone_number": "(212) 740-2939",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjdE1HTXpTV2cwT0MxTVMxZG9SSGszYW5GWGVtYxAB",
            "text": "We showed up at 3:15 right before the kitchen closed. The matire d took personal care of us to make sure we got our full meal. She gave us extra champaign when our desert arrived late, even though it was obviously because we disrupted the kitchen. We felt welcom, un-rushed, and the food was delicious!\n\nHighly recommend!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201clRFdERSV2RZTlhnNVdVRmlXRjh6TjBrNFkzYxAB",
            "text": "We decided to hold a Celebration of Life for our mother at The Bonnefont given its gorgeous location near the Cloisters, reputation for good food and ideal inside spaces. Everything surpassed our expectations. We had more than 50 folks there and literally everyone commented on how perfect the day went. The staff was on it from the first moment--moving furniture to accomodate our needs, setting things up just right, having the food and wine at the ready. We had a buffet style luncheon and it was all fresh, folks went back for seconds, and the desserts brought it home. The location is gorgeous and the space works beautifully with wine served in the lounge area and the dining and memories shared in the dining space.  It was a tremendous success and highly recommend The Bonnefont as an ideal event space."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeFdXUmxNWEZyUkUwM1ptMUpZamhFVDBSNlMzYxAB",
            "text": "The food was so incredible, that I almost did not want to leave a review but the service was just so terrible. The staff was yelling at each other over tables, and chatting about how to organize tables very loudly. Our server took forever to attend to us even with only two parties in the restaurant.\nAtmosphere is beautiful but lights kept flickering…\nService ruined it"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OYVJFOHlOM1pGYm5KSE1sRmtkbmxsVjB0RU5VRRAB",
            "text": "It's such a nice area nestled within the park. The cuisine was both fresh and tasty, making it ideal for following a walk through the gardens. We sat outside and took in the peaceful scene."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGemJGTmhhVTB3UTBvNWQwRXRaRmRITWxOTE9IYxAB",
            "text": "What a gem! They combine rustic charm and sophisticated elegance. The menu, influenced by French cuisine, has exquisite dishes such as grilled fish and creamy potato leek soup. The staff is attentive, and the setting in Fort Tryon Park adds a relaxing atmosphere. Whether for brunch or dinner, it's a great dining location."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQ1VqRnVZMmxmYjJKU01WaFNNVmhZZFdGcFpXYxAB",
            "text": "We celebrated our anniversary there, and it exceeded expectations. The escargot and tomato bisque starters set the tone, followed by the mouthwatering beef bourguignon. Dessert was a treat: an upside-down cheesecake that was delicious. The staff's friendliness and the park's beauty made the visit unforgettable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oa1ZEQjBaR2MzUms5eVNGcFhNMHhRU0RWT2MwRRAB",
            "text": "I absolutely love this place! The setting is stunning, with lush greenery all around, and the menu includes some truly delicious dishes. It's a fantastic atmosphere, whether you're with family or friends."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeFRYZExibUZ1UzBveFVXaHdkMU5VYkV4cVNuYxAB",
            "text": "As a culinary school graduate I can confirm they doo all the brunch basics at the highest level. A good wine selection. The potato leek soup was excellent. I did enjoy their chicken tarragon sandwich. My friends each were happy with the French toast and egg dishes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSlZsVnpUbmx1VEhVNFNVbFNiVkpHVFV4SlFWRRAB",
            "text": "The Bonnefont, located in Fort Tryon Park, is a hidden gem. The rustic appeal of the stone cottage, mixed with modern additions, creates an unforgettable dining experience. The cuisine is thoughtfully prepared, with selections to suit any diet. This restaurant provides a wonderful setting, whether you're celebrating a special occasion or having a peaceful supper."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTk4weEJObGQzTVdndFNrUm5TVTg1Y0c1cWNYYxAB",
            "text": "I originally visited Bonnefont just after it opened, for Thanksgiving.  The heat wasn't working (IT WAS COLD WITH MY HEAVY SWEATER ON).  The maitre d/manager was surly (and was nasty to the staff in from of the customers), I had a long wait for a table, even though I had a reservation.  The food was passable.    I has to ask several times for bread/rolls, water, and a napkin.  I left a scathing review.\n\nI went back today.  I arrived early before my reservation time.  I was warmly greeted.  The surly maitre d/manager was no longer working there.  I was seated immediately.  The staff was attentive.  The whole atmosphere had changed.  Food was the served the right temperature.  There were napkins, water, etc.  Excellent service and beautiful atmosphere.   It was a good brunch .   Having eaten at Michelin rated restaurants in New York and Paris, I cannot say the food was excellent, but it was VERY good.\n\nI WILL go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM1VtY3RjME5DV0c5UVVsUjBUWEZsVVZkNFgzYxAB",
            "text": "Throughout our visit, Renee and the entire staff were incredibly kind and considerate. They were pleased to comply with our wishes and ensured that everything happened without any issues. Excellent service has a significant impact."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR1lscGxOMjF1WWtzMFEwWm9hRXREYW1GUllWRRAB",
            "text": "I thoroughly enjoyed my visit at The Bonnefont. The location itself is stunning, and the atmosphere makes you want to stay longer. The dinner was excellent—flavors you'll remember. Renee made us feel perfectly at home, and the entire team was really helpful. Definitely a memorable dinner experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wU1ZGUmFlSHBJUVRWSllqQnBWWGRUU1ZWcmVrRRAB",
            "text": "I had an absolutely amazing evening at The Bonnefont. I felt welcome from the time I stepped in. The decor is lovely, and the atmosphere is calm but elegant. The dinner was delicious; fresh, tasty, and well cooked. Renee is simply fantastic, and the entire staff treated us like treasured guests."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOVluNmNnEAE",
            "text": "I went to the Bonnefont one time and had an excellent meal. The next two times were absolutely horrendous. The service here is a mess, the food is terrible, and the prices are out of control. Avoid going here at all costs. The last time I went I sat at the bar at after 25 minutes of being ignored I left. Go anywhere else."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWVh6STVXbkV6UlUxSGRuWjJPWGxYV2pVNU1WRRAB",
            "text": "Outstanding experience.  A must visit.  Very convenient to Mother Cabrini memorial."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSVUwRkJkMDk2U0dVdFkyRXdOWFZrY0c1NFYzYxAB",
            "text": "I recently had dinner at The Bonnefont. The food was delicious, and the service was pleasant and efficient. The watermelon gazpacho stood out for its lightness, flavor, and suitability for a warm day. Overall, a pleasant place with well-prepared food and a relaxing atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNWFsTmFabVpoUzB4VWMzcEljelo1YXpWRE4yYxAB",
            "text": "I loved my time at The Bonnefont! The dish was brimming with flavor, particularly the watermelon gazpacho. Just wonderful, very refreshing and original! Additionally, the service was excellent. You can tell they value quality and appearance."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SGNrWlZOWEZrVm5WZlVHMVVUMmwyWW1SdVFYYxAB",
            "text": "This place brightened my day! The atmosphere was relaxing, the personnel was friendly, and the food was amazing. The watermelon gazpacho was just excellent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTU5UbEJWV0ZuWm5ST00wWlpkbGRGTXpnd2RuYxAB",
            "text": "The food was simply great, and the service was excellent from beginning to end. The watermelon gazpacho was a delightful surprise, packed with flavor!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVlVHWlNaR0poVTBOc09ETXhSVWhLWjFKU00wRRAB",
            "text": "We had a fantastic meal at The Bonnefont. The environment was peaceful and comfortable. The watermelon gazpacho was the standout dish for me. It was extremely well done."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVE9WWnRYMFUyWTNwTldXbzFRMkZxTkRsSlFtYxAB",
            "text": "Lovely location in the park, excellent service, great place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gc2NucHlTa3Q1WDBWaFRrWTRkM2szYjBad01IYxAB",
            "text": "Don’t go for the food!! It’s just bad! I had the duck confit, it was flavorless and the potatoes were mostly burnt! But the place  and the atmosphere is nice! If you really like good food don’t go here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKd2VFZ3lSbDlZWVMxYVp6ZzJTR1ZJTVZKRmNIYxAB",
            "text": "Bonnefort offers a tasty variety of entrees and desserts. Try the creamed honey flavor cheesecake. The outdoor seating on a summer day is delightful"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkd1ZVVmFUSGxUVGtObGFuSnhPSEJXUTB4NFNHYxAB",
            "text": "We went here after a visit to the cloisters - charming, castle like place in the woods! Food was incredible. Definitely get the mushroom medley!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UmIwWnZPVEZ5T0daUVJFUndia3hJWkVkeUxXYxAB",
            "text": "Quaint and charming little French cafe hidden away in the Fort Tryon park. If you are planning to visit the MET cloisters, would recommend getting breakfast or brunch here and start your day. Food is good and if you get a table by the window or lil door facing the garden, you’re guaranteed to have a great time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaWIxVmhlWGRxYjBONVlrTlBUbWRKVlZFeVFXYxAB",
            "text": "A hidden gem in Fort Tryon Park - the food was delicious and our server, Alex, was amazing!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMek9oOHkxbTVhTXV3RRAB",
            "text": "We were so excited to finally try this place after driving past it so many times — it was a last-minute dinner date with my partner, and we were genuinely looking forward to it. But honestly, the experience was disappointing and unsanitary.\n\nWhen we arrived, we noticed a dog roaming freely inside the restaurant. It seemed like the dog belonged to the restaurant, which was confusing — especially since it was actively chasing rats outside in the seating area. The outdoor section is right in the middle of a park, so we tried to understand the reasoning… but then we saw a mouse crawling inside the restaurant near the dining area. At that point, it was just unacceptable.\n\nI understand the location presents challenges, but that doesn’t excuse the sheer number of rodents we saw or the fact that there’s a loose dog inside a place that serves food. These aren’t small issues — they’re health code concerns, and it blows my mind that no one else is mentioning this in the reviews. It made us question how often this happens and what the overall standards are.\n\nOn top of all that, the food was just mid — nothing memorable, especially given the environment.\n\nWe won’t be coming back, and I honestly wouldn’t recommend it until they address the sanitation and pest control issues seriously."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNLVY5Y0tpMFlUenlnRRAB",
            "text": "I have tried to eat here 4 different times. The first time they didn’t have heat and used space heaters which was not great. They didn’t have several things on the menu. 2nd time we just showed up but they had a special event. The third time they cancelled our reservation and asked us to come the next day….which we couldn’t. Today we showed up at 4:40 for a 5 pm dinner reservation and they would not let us in to get a drink before 5. Their hours today were 11-9 but failed to mention they would lock us out at some point. I want to love this place but it is becoming more and more problematic each time. The food we did eat that one time was good. Apparently they still have issues with service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKYXQyZS1kdHJTbFlBEAE",
            "text": "Love the vibes... 😊🤍🙌"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLWt5b19zcTdfZi1RRRAB",
            "text": "We stopped here because it looked like a beautiful place. I had low expectations for it given that every other restaurant I’ve been to in nyc park is basically not great when it comes to food.\n\nThe food was amazing. The music and decor were also very well done."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOZUhsSXpsb2ZDaWNREAE",
            "text": "We were pleasantly surprised and pleased to find that this restaurant had opened. We stopped in on a rainy afternoon for lunch and enjoyed the tarragon chicken salad and the choice of music. It’s nice to have a restaurant near the Cloisters again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLdXBsNUsta0otR3d3RRAB",
            "text": "Upon entering I asked if I could sit at the bar. The waitress with orange hair said, “that’s at the bartender’s discretion”. I guess they are picking and choosing who can be allowed to sit for a drink. The bartender, the only person with a nice attitude, said it was ok for us to sit. Another person walked in with their mom for a Mother’s Day dinner. they hadn’t made a reservation so they weren’t seated. Understandable, except the restaurant was totally empty and they also mentioned they didn’t have enough food which I found odd. It was all a bit messy and surprising for a place that’s been open for more than a year."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb3RqMzZRRRAB",
            "text": "Poor customer service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdmZyLXdnRRAB",
            "text": "Came here with my partner for lunch after visiting the Cloisters and we were seated outside on the patio. The restaurant itself is beautiful and the waitress we had was nice, but the overall service was disappointing. I ordered a crepe, and my partner ordered the potato leek soup and an eggs benedict.\nWe waited one hour for our food before we decided that we were too hungry to continue waiting and decided to leave to go somewhere else. The entire time that we were waiting, we received no communication from the staff, and we were never checked on by our waitress about the status of our food. We noticed that the other parties that were seated after us were asking about the status of their dishes, so we figured there must have been some sort of problem with the kitchen today which we understand it happens, but we would have appreciated some honest communication about the situation. This place would be great for getting drinks but I wouldn’t come here on an empty stomach."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdlpMcXdnRRAB",
            "text": "Guess this was a very off day for them. Must have been short staffed both front of house and kitchen. Sunday brunch. Service was slow. Food took forever and was cold when it did arrive. Except the gratin dishes which were piping hot but kinda pointless. Potato cubes and cheese stuffed in a small tureen that looks like french onion soup. (this is $22 entree???) There was supposed to be smoked salmon somewhere but we found none. So, don't get those. Staff acknowledged that there were problems and were apologetic but we could have been offered a better concession than 3 free hot chocolates."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2Q2ODR3RRAB",
            "text": "Not being from New York, I was visiting the MET Cloisters and decided to walk the Fort Tyron trails around the MET and overlooking the Hudson when I discovered the Bonnefont.  A quaint little French Cuisine Restaurant. I did not have a reservation, but as a party of one, I did get seated within a few minutes, and the waiter was very quick with a menu and water. My order of French toast and made fresh coffee was served within 10 minutes. The French toast was very good as well as the fresh coffee.  I did get a coffee to go. I was in and out in 30 minutes. I'm certain a reservation would be required for a large party. Great staff and great atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMGV6ZXVRRRAB",
            "text": "Amazing location, and delicious food. :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJakkzT3ZnRRAB",
            "text": "A beautiful setting and lovely rustic interior. The food was top notch at our brunch: wonderful herby green salad, unbelievable smoked salmon gratin, chocolate nuage (a sort of molten cake). The waitress was just lovely, knowledgeable and gracious (the hostess, not so much.)\nBut! We asked for a shim for the table which was a bit wobbly--it didn't arrive. We waited a long time for our drinks, tho the place was not full, and then these came after our starters were served. One person's French press tea was lukewarm and she sent it back--then it came nicely steaming. One person's sandwich was billed on the menu as being on a baguette, which she loves--but it arrived without prior warning on sliced bread. Finally the bill came--we were charged for the mimosas which were part of the prix fixe.\nWhat a shame as the food was so good!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeU15dWxRRRAB",
            "text": "Visited on an uncharacteristically warm early spring day.  While likely a bit understaffed and perhaps not fully prepared for the volume of guests.  The servers were lovely, the food excellent, menu offering diverse and exciting all in a charming clean building.  Congratulations to the new business here.  Highly recommend."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdnFMNkpBEAE",
            "text": "Please give them a chance to work out the kinks. We were there on day 2. Some of the reviews are unnecessarily brutal. We found the service excellent. They are trying very hard. The only issue is the heat or lack thereof. That needs to get fixed for sure. The space is lovely. The food was excellent.  The muscles were outstanding. The chicken dish was the star but all were very very good.\n\nWe just went back for a private event (baby shower brunch).  The staff was AMAZING.  They were so helpful in all aspects of arranging for the event, set up, and making sure all the guests were taken care of.  The brunch food was excellent, served hot, and on time as planned.  Quite a feat for 40 people.  Thanks so much for making this joyous event sparkle!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBME5mMUZ3EAE",
            "text": "The Bonnefont is a highlight of the area. The service can't be beat and the food is outstanding. They are so accommodating and really put in every effort to ensure that you are taken care of."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaVBLOXlnRRAB",
            "text": "Had the best hot chocolate in the world from here recently. The most magical winter treat. 🫕"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNHByUTJRRRAB",
            "text": "A magical setting, in a historic building and in a  beautiful park! Kudos to the chef/chefs as the food is amazing. I've been for brunch and dinner, but not lunch. My favorites are the soups and the beef bourguignon. The chocolate cake dessert is really good, too.  The decor and lighting are very stylish and make me feel relaxed when there. I absolutely love the waiters and bartenders - energetic, fun to talk to, and professional, too. I look forward to returning!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcnBqNk5REAE",
            "text": "This is a perfect place to go after visiting the Cloisters. The setting and decor are rustic and elegant at the same time. The gratin was delicious, the service was amazing and the prices are reasonable for such a special place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcGYydTZRRRAB",
            "text": "A gem, with heart & vision. It was so nice to find this inviting restaurant on our trip to the Cloisters. Very fresh ingredients. The chef takes extra care with every dish & the staff were wonderful."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMGQyb1lBEAE",
            "text": "I informed the waitress of my tree nut allergy and then was promptly served a dish with pecans. How did I find out? When the potatoes crunched.…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMGMzdnpnRRAB",
            "text": "If your server is Renee then you are very lucky! The food is great and the service is so accommodating and kind. What a gem!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMFpINldREAE",
            "text": "My friends and I were enjoying a walk through the park and saw the restaurant was open. Renee, our server, welcomed us in and even allowed us to sit in the back patio area with our dog. The service was amazing. She was super welcoming and made us feel VIP. I got the potato leek soup and eggs benedict. Both were delicious. Great service and great food in a magical setting."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdnRMV0VnEAE",
            "text": "My wife and I decided to have dinner here again after a previous experience which left us disappointed because of the service and wait time. This time the service could not have been better. Chef Nicole always serves the best dishes in the neighborhood. Last night, the bartender, whose name might also be Nicole and our server Ian were prompt, attentive and friendly. We were sat right away, served delicious cocktails, and our food came out without delay. What an improvement from last time! We plan on returning soon, and often!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ckxHQ1RBEAE",
            "text": "The food was superb. Excellent. The service was very disorganized and disjointed. Hopefully the service will improve as the food was very, very good.."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOXZ2T3NnRRAB",
            "text": "I've been wanting to go here for many years as I've seen it the first time I visited the Cloisters 7 years ago. Super cute venue and location in the park. That being said ...\n\nAfter being sat we were ignored (wasn't busy) and I had to ask for menus twice where I was told they ran out of menus (wasn't busy).\n\nThe food itself was o...k...but for that price I truly believe it should have been better as well as better presented. An entire meal in a bowl? I don't think so (look at pics).\n\nWhen I asked for the check out waiter was in such a rush that he hit one of our cups with the check clip and almost knocked over one of our cups. I don't want to say too much but I'm known for being brutally honest on my reviews and that's all I felt."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqd0xtX2xBRRAB",
            "text": "We recently dined at The Bonnefont and are eager to return. The owner and chef, Nicole, graciously accommodated some unexpected changes to our reservation and was really kind over the phone. The restaurant is a true gem in the neighborhood, and we look forward to dining on the patio when the weather warms up!\nThe house wine was nice, and our entrees were delicious—no surprise, as I had previously enjoyed the cuisine at Nicole's former restaurant, The Pandering Pig. Our server, Renee, was both friendly and attentive. I'm enthusiastic about the future of this place; it seems to be finding its rhythm, and I anticipate it will only improve with the use of the patio and the full potential of its location as the weather improves."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWX1p2cWtRRRAB",
            "text": "We had a wonderful dinner at this restaurant. We are locals and were so happy to try out this place as we also ate at Pandering Pig when it was open. We had the escargot, the roasted cauliflower, and then the beef bourguignon and the duck. Everything was fabulous- those entrees specifically were SO tender and delicious. Service was excellent- such a kind waitress. Only a 4/5 for at atmosphere because of the climate control on a cold night-  but we’re hopeful once they figure that out this place will be the spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eklMR253RRAB",
            "text": "Came for dinner. The restaurant is in a landmark building in a landmark park. The ambience, both inside and outside, is incredible. Food, wine and dessert are excellent.  Staff are very friendly and elegant. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdE12a2lBRRAB",
            "text": "Had Sunday lunch here recently, and I was blown away! The seared salmon was on point—super tasty and cooked just right. The staff were super friendly and made me feel right at home. Plus, the live music gave the whole vibe an extra touch. Definitely recommend this spot for a great meal! Everything looked great and tasted even better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdUpEejZnRRAB",
            "text": "Super tasty food, beautiful environment, my date and I had the roasted butternut squash the burata ,salad and potato leak soup. Burata was not as soft as I had expected. The salad was the least enjoyable thing. The sunflower seeds tasted stale. Really loved the squash and cherries? You really feel as if you are a million miles from NYC and that’s great. The upside down cheesecake I shared, and it was delicious. I hope more and more people will start to patronize this excellent restaurant uptown and I hope they add a few more vegetarian options."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1cFluWTdnRRAB",
            "text": "I had the pleasure of being able to dine here for their soft opening last night.  The place is still a little rough around the edges as they work to get everything set up for their grand opening.  The food and the service, however, is beyond stellar.\n\nEveryone was very friendly and made us feel welcome from the moment we walked in!\n\nAnd the food! We started with the roasted pear wrapped in bacon.  Perfect flavor combo. The pear slices were hot and juicy.  I can't even describe how delicious the fig and olive tapenade was.  Our last starter was the pate board. My fiance doesn't usually enjoy pate but I think he ended up eating more of it than I did - that's how good this plate was.\n\nWe split the boeuf bourguignon. This is one of my favorite comfort foods, and chef Nicole really knocks it out of the park here.  It really does taste like it's made with love.  The meat falls off the bone. I could have eaten a bushel of the carrots!\n\nI failed to take photos of everything because we ate it too quickly! Oops. Next time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNTZQT2RREAE",
            "text": "Having enjoyed several meals at the owners' previous restaurant, we were pleased to find that the food and ambience was as good as ever and that several tables were occupied on a Saturday evening.  I had the duck confit with brandied cherries and yukons t and my husband had a generous portion of the fish of the day (flounder) Coupled with a bottle of pinot noir, it was the perfect dinner for a chilly night.  Service was prompt and attentive. We look forward to returning soon and trying some other items on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdmJuSGhRRRAB",
            "text": "My potatoes were chewy but I think the rest of the dinner party enjoyed their food. I’m really happy that there is a great restaurant uptown and the atmosphere is beautiful. Highly recommend for an uptown escape in the park!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNVo3VC1BRRAB",
            "text": "This is an amazing restaurant . Went here for a birthday dinner. The staff is friendly and the food is amazing . I recommend getting the duck amazing platting and the sauce was excellent .Love the area kind of  reminded  me of sleepy hollow .   I will be coming back here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaS1QcDZnRRAB",
            "text": "The food and the wait staff are truly excellent! Yes the restaurant is still up and coming, but it's still charming and 100% worth it when you take so much as a single bite of the food (especially the beef bourguignon or lamb shank)--it's beyond exceptional and you get very generous portions! The staff are very accomodating and conversational too, so if there is anything you ever need, don't hesitate to ask! If you ever get a chance to speak with the chef as well, please do; she is one of the most down-to-earth people out there!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNmZ2VWl3RRAB",
            "text": "My husband and I visited The Bonnefont last night and absolutely loved it. We had the mushroom medley and asked for bread to soak up the amazing sauce. The Lamb Shank and Coq Au Vin were also spectacular. Don't skip out on dessert. The upside cheesecake and creme brulee were the perfect ending to an amazing night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaUtXd1hREAE",
            "text": "We ate here on a beautiful early summer evening. They were extremely slow to seat us outside, apparently because they were understaffed. This would be a great place to eat, if only the food was half as good as the location."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWb05haXhnRRAB",
            "text": "Gave the food and service 5 stars because the food and service were excellent. Yes, the building was a little cold. But we knew it would be because the staff informed us in advance. We had a variety of dishes, all wonderful. Our reservation had been lost due to system issues but the staff accommodated us and took great care to ensure we had an excellent time. Very memorable and I hope to return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqamNXY0ZBEAE",
            "text": "Came for brunch on a rainy day and it was a great experience. The menu had a nice variety of dishes with a French influence.\n\nThe atmosphere is really cozy and I look forward to a nicer day to try the patio as it was nestled among greenery but still had views into Inwood.\n\nOur server was friendly and very knowledgeable of the menu.\n\nThe staff was very friendly and warm"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucDlfV0VnEAE",
            "text": "I held a memorial for my father here. The food was outstanding and the staff was very kind and accommodating.\nThe food was excellent.\nNicole the owner, had such a warm and caring energy."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbXBMSm5BRRAB",
            "text": "Just steps from The Met Cloisters, The Bonnefont offers French-inspired cuisine in a warm, inviting setting.\n\nI started with a delicious fig and olive tapenade with goat cheese, though the escargot, served cooler than expected, lacked the garlic punch I’d hoped for. The Boeuf Bourguignon, paired with creamy garlic mashed potatoes, was rich and flavorful but slightly marred by excess fat.\n\nThe standout, however, was the impeccable service and cozy decor, creating a welcoming atmosphere. A must-visit near The Cloisters—just be sure to book ahead!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMZy16andBRRAB",
            "text": "We walked there a long way way on a stormy night and arrived at 8:30.  The signs and google said they were open until 9 pm but they would not seat us. The Hostess was rude. They don't have air conditioning.  We were upset and rejected and will not be back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdi0zN1BBEAE",
            "text": "After strolling through The Met Cloisters last Sunday morning, my husband and I went to The Bonnefont for a wonderful Sunday brunch. The Bonnefont has a historic charm with the cobblestone cottage feel.  We started with great mimosas! Our server, Allen was kind and helpful making the perfect recommendations as well as giving some insight to the chef and french menu! I had the Bonnefont herbal salad and butternut squash gratin while my husband had the smoked salmon gratin.  The food was DELICIOUS and the service was warm and friendly.  If you are looking for a great brunch spot this Sunday highly recommend The Bonnefont."
        }
    ],
    "reviews_count": 69
}