{
    "name": "Cafe Bloom",
    "place_id": "ChIJA3Id8FD1wokRnXFTlhGc1bE",
    "grid": "MN12",
    "address": "4394 Broadway, New York, NY 10040, USA",
    "rating": 4.7,
    "user_ratings_total": 321,
    "phone_number": "(646) 429-8734",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oS2VsWkZSVVUxV0djNVlrdG5VRFJyZG1FelJHYxAB",
            "text": "Cafe was run by family who didn’t seem to understand how food service works. When the daughter came to our table, she literally just stood there, didn’t ask if we wanted anything. I had to prompt her to take our order otherwise we would all be sitting there in silence. She got my order wrong and it took another 10 minutes to get my food. No one ever came over to check on us. My breakfast sandwich was pretty good. But my husband’s plantains had zero taste and were hard. Do not recommend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaldEZHNSRkowUzNKNlNUTjNhbTlSZURacVlYYxAB",
            "text": "you want the tres golpes"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeVZGbFlSRmxHVkVsRlh6UkdjWGN6UXprd1UyYxAB",
            "text": "My friend and I stopped here to grab something to eat on our way to the MET Cloisters.\n\nI wish we didn't.\n\nWalking in, the place was beautiful. Very picture worthy. We entered the cafe and we were able to be seated immediately. We got our menus and decided on what to eat but still wanted to ask more questions before placing our final order.\n\nThe server wasn't knowledgeable about everything on the menu. Which isn't his fault. It's whoever trained him and essentially, management's fault. We ordered 2 orders of the empanadas.\n\nMy friend got chorizo ones and I ordered a chicken and chorizo one since the order includes 2 empanadas of your choice.\n\nOur order came after a while and my friend took one bite into her empanada only to find it cold. I didn't have any complaints of my chicken empanada. However, they gave me a cheese empanada that I did not ask for. I took it as a mistake and asked for the chorizo empanada that I ordered only to have them tell me that I cannot have it because I'd have to place another order.\n\nI decided on not ordering again and moved onto the other thing I ordered which were the turkey sliders. The menu did state that there was caramelized onions so I was excited for the flavor.\n\nHow wrong was I.\n\nThe onions weren't caramelized. They were sloppily chopped and put inside the three Hawaiian Rolls. Between that and the mediocre coffee, my friend and I agreed to leave.\n\nI ordered more food so my friend told them to charge her for her chorizo empanadas. They split the bill to both of our displeasures and charged me the full price for the 2 empanadas; I only had one.\n\nMy friend and I wanted to support this local cafe, they still need some training done. Please educate and train your staff properly. Also, maybe consider not charging people for food they did not eat. We mentioned it to the staff when we initially saw the charged and all we got was a dismissive turn of the head.\n\nHappy this was my last experience here :)\n\nUPDATE: They refunded us!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVlNWSjZTa2wyTWxJNFZHYzFTblYzZGtwQ1VHYxAB",
            "text": "Fabulous little spot. Great drinks and food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRFRETm5ZM2RhUkU5QlkySTVUbEZFY0UwMGRWRRAB",
            "text": "A nice beautiful little place but it feels like home and they also have love music on weekends"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoN1lmSXp3RRAB",
            "text": "I have been coming here for 2 years. The food is always great but the service not so great. I have ordered from here and gone in person various times and they tend to forget some items or they take too long to bring stuff out. They brought my drink when I was done with my order. They don’t double check their delivery orders. And when you call to advise them or make a complaint they give you an attitude and top it off with “that’s perfectly fine if you don’t order from us anymore”. Unfortunately you will no longer be receiving my business"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdE55MXRhemRwVEV0MFNVZFBYM1oxVWtRelZGRRAB",
            "text": "These guys are horrible, we went here several times and they take forever to make the food that’s 1. Two the waiters here all do not provide good customer service . You make an order for an orange juice and by the time it comes out you will already be done with food. Ask for a side order of anything and they will take ages to bring it out you’ll already be done with the food. The waiters all look like they don’t want to be there . The food is pretty good but this place is frustrating they always are making mistakes it’s not just once in a while they are always leaving something out . It’s never a seamless experience and I don’t think that they care ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxek1XeDVUa2Q2WkdWTU4xRkhSRmd5U1ZJdGNXYxAB",
            "text": "I got the iced mocha and it was amazing and the empanadas are so good and I will come back very soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaVVUSmxhakJvV1c5eFIxTlRYMGszZW1GalNtYxAB",
            "text": "Beautiful place. Amazing food. The chicken and cheese empanadas are to die for. The lemonades are made to perfection! Coffee is good. Place is clean and a nice site to see."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNFVqRXlaalJsYzNwaGFrMUhUMVpSUlVsaFpVRRAB",
            "text": "A great community spot hosting open mics, events for local businesses and is a great place for a party. Tostones, yucca, salmon, and great coffee?! Love this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STlVGZFRXVUZpVWxsaVZFdFRURlpWVEhnMlQwRRAB",
            "text": "Nice cozy place with affordable prices."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbE5UZFFlVEZzZFVkWU9VbFNkRkF0VURFM2JsRRAB",
            "text": "Wonderful staff. Great spot for food and drinks"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WemJsWnJhVmxsTkU5NFVWaEVTV3BPTFRsSGFHYxAB",
            "text": "I love supporting business that help uplift our community. Bloom always host wonderful events In addition, the servers are very attentive, and the food is delicious"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsYVZ6RTRUMVZIUlVka1MyZzRaSFJ3V2tOYVFuYxAB",
            "text": "El servicio un poco lento pero nada mal\nEl lugar está lindo\nCon respecto a la comida\nLos wafles belgas no lo son, son más americanos ya que el syrop no está por dentro deben cambiar eso de el menú el resto de el plato bueno\nEl wrap bastante bueno lo único fue que tardaron mucho con la comida de resto muy recomendable el lugar"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSS2FWUkJUVFZUWlMxcGFFSlVUR1V5YTJOdmRrRRAB",
            "text": "Born & Raised in the area, was hoping to find a local stop to frequently go to since we tend to eat out a fair amount. When we reviewed the menu, it was a pleasant surprise that it had multiple Vegetarian/Vegan Items. Additionally, the meat dishes claimed to be leveraging premium ingredients. The menu was the last of the favorable aspects of this experience.\n\nOrder:\nBloom Burger - It had bones, straight bones in the patty. It was also bone dry, so I suppose it was a theme. The fries, on the other hand, were also as equally terrible, so I respect the consistency.\n\nChickpea Sandwich (Vegan) -  I’d say their interpretation of Vegan was very interesting. Meaning that bacon was added,  which I suppose for some would be a pleasant surprise, but not for a Vegetarian and/or Vegan. When it was sent back to course correct the mistake, it was returned in a different bun (Initial Sandwich came on Multigrain, Brioche was Requested) partner checked the inside for any additions, and to our surprise, they missed a piece of bacon. So they basically changed the bun and “removed” the bacon, but not all the bacon. It wasn’t a redo but merely a lift & shift.\n\nConclusion\nI’d consider myself moderately level headed, and you’d see that from all the reviews I’ve left locally as well as throughout the city. This experience left a lingering bad taste in my mouth/stomach, because those bones didn’t go down without a fight."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRelkyTlFPVTFSZDBsSldqWmtWSEpSTUdGcVYyYxAB",
            "text": "Details: Friday morning, half full, beautiful scenery.  They had a nice list of options. My meal was $16. I know I can buy that anywhere else in WH’s for 1/2 price, but they claim everything is clean which is great.\n\nThe only negative is that I waited 30-40 minutes for this plate. The service was sweet, but just doing their job. I bet on a less busy Friday, maybe they would’ve been more apparent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNWRHdG9Nak5XUW14bllWRmlaVVY2ZGxaTU9IYxAB",
            "text": "Love this places. They have a great services and they also support community based organizations.\nFamilies have a great time and they feel welcome."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbWRVUTFTV05IY0ZsbmJUVnZZMkpKVlhWalNVRRAB",
            "text": "Let's just say. From Ohio to NYC..this was Amazing! It felt amazing inside. The customer service was lovely. I didn't get his name but he was so sweet.. My coffee had foam.. very fancy! The waffles had strawberry and the white powder on top which made it flavorful. So I usually don't like bacon but when they made it I was very much a fan. The chocolate croissant was soft and just took the craving away.!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xS2VteFVhV2RYV0dKUWRWUmpaMVZpYkZaR2QyYxAB",
            "text": "Great service."
        },
        {
            "date": "4달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVlVtaFBSMkYxU0hCdk5FUlBZMFpyVXpkSGQwRRAB",
            "text": "Riquísimo 😋\n美味しいですね\n金好呷！\nI recommend Burger, taco, Franch toast, and guacamole. Fantastic flavor!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padVZXRnpMWEZvTVVKbVEzZFFOblZEU1hBMFVrRRAB",
            "text": "Such a lovely spot! I ordered the strawberry limón drink and the lava cake with ice cream — both were delicious. The drink was super refreshing with the perfect balance of sweet and tangy. The lava cake was rich and warm with a gooey center, paired perfectly with vanilla ice cream and fresh strawberries. On top of that, the service was excellent — very kind and attentive. The atmosphere is cozy, welcoming, and super family-friendly. Definitely a place I’d come back to and recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTWVWQmFVREZ2WXpaTmJGTlhORk5yUW0xYU1YYxAB",
            "text": "Great service, delicious food!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVmQxVmpZWEZpYzFaTWVsTTBkVkpYTWtwRFkwRRAB",
            "text": "Cute and intimate café perfect for working on your laptop reading a book or catching up over a meal. Limited seating option but it has high feelings for the face does not feel too crowded. From the service from the employees. All food we tried was amazing, we had the cajun chicken wrap, muffin pancakes, bloom breakfast burrito, and fries to eat. They all had great taste, my favorite was the cajun chicken wrap, it was packed with flavor. And for drinks we had an OJ (felt like it was overpriced $5), tumeric ginger tea, and a coffee. Would definitely come here again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOS1Z5ZFdvNWFpaGp3RRAB",
            "text": "I think it’s very important to support local businesses but this was not a good experience. Like another comment here in the reviews section, no acknowledge at all when we entered. We waited 20 minutes for an ice tea and a cappuccino and 30 minutes for the food (a sandwich and a muffin).\nI was honestly very frustrated because I thought the food was simple for the wait. Because we pay ahead of time, you can’t cancel if it’s taking too long, so you just have to wait there.\nAfter 43 minutes I asked about the muffin and they acted like they didn’t know I was waiting for it, and then grabbed it out the display. I was in complete shock!!! Turned out they forgot about my muffin for 43 minutes and when I complained about it they thought I was talking about the sandwich, that came in after 35 minutes. I refused to get the muffin and asked for a refund and they gave me the cash back but with a certain attitude. The manager claimed that she didn’t know but it was no excuse because she is the manager so she needs to communicate with her staff. The food was ok but the management is horrible and I left the place very very frustrated."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKNnB6NG1rMDRya2lBRRAB",
            "text": "Everything was great. I recommend the chai latte"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPMjh3SzZCb29helB3EAE",
            "text": "Just Great!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdTFrdHF1Ny1xeHNRRRAB",
            "text": "Amazing food and amazing service. Please check it out.!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKbTU3SlRXM0tYdDNnRRAB",
            "text": "Cute spot for a quick bite and some yummy matcha! I had the bloom breakfast with chorizo. I felt like the sandwich/chorizo was a little bland/lacking so I asked for some hot sauce to add a bit more flavor and kick 🤌 I think if I would return, I would try the tres golpe for a unique plate. *note for those who visit in the near future - as of 04/2025 there is currently an egg surcharge added to items with egg, not noted on the menu or disclosed until the bill came so just be aware of that! Understandable, hoping it’s temporary given the egg shortage 🙃"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMV8tcjh3RRAB",
            "text": "Firstly I will say that I am Dominican and a lifetime resident on Washington heights and Inwood.\n\nUpon entry no one acknowledged us which puts a sour taste in my mouth.\n\nWaited 45 mins in a nearly empty restaurant for this nasty sandwich.\n\nI also ordered the matcha and there was barely any matcha powder in it. For $7 I shouldn’t have to ask for my drink to actually be green.\n\nI wanted to support but people need to stop cutting corners and have higher standards. That’s why so many of our businesses fail."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJczZQNUhnEAE",
            "text": "It's my favorite cafe, and I can't ask for better. Their lattes are amazing!!! The staff are so sweet, and they host amazing events! They really created a safe space in the community"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcXJyYnFBRRAB",
            "text": "This place has such a great vibe and great music taste to go with it.  Going from lattes to sangria in one place is amazing. Highly recommend for vibes but also great drinks !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3enVHRllREAE",
            "text": "This cafe has it all. The smell of coffee, oregano, and cilantro greet you at your nose. What’s more decadent than a delicious plate of authentic DR food to start your morning or welcome your afternoon? You can even park up and work for a little with their WiFi password included. Need an cerveza? Mimosa? Wine? And make sure you leave room for a cinnamon sugar croissant to pair with the cortado calling you before you go."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NU9pZ2d3RRAB",
            "text": "Yum yum! Def a do. Everything is fresh including their salon burger which I won’t lie I thought was going to be just ok. It was very good. Follow me on google: Friendly Paws (riverdale ny)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3a05HM2ZnEAE",
            "text": "Sitting here right now experiencing the worst service known to mankind. 1 hour in and my table’s food is still not here at my table. Even forgot part of the table’s drink order. My side was expired almost 4 months. Fun fact: the table behind us ordered the same thing as us 20 minutes after my table and got their food before us. Server tried to make it up by offering some stale tortilla chips. Didn’t help.\n\nUpdate: ended up walking out. Miserable, miserable service. Having a chic place doesn’t make up for bad service! Would never return, nor recommend to anyone!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNDltaVN3EAE",
            "text": "Food is amazing and so comforting. I love the quiet calm homie environment it has. Highly recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMk9ybEdnEAE",
            "text": "Great place. Really nice and relaxed atmosphere, which is rare and appreciated uptown."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdGQzMU9REAE",
            "text": "Cute and cozy spot with good coffee and food, infused with Dominican eats. A good place for remote work. Service is ok."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbWVYQzRnRRAB",
            "text": "Very cute cafe, and very friendly-feeling. It’s fairly small, but the high ceilings make it feel open. We ended up ordering our food (as a party of four) immediately after a party of eight, and it did take a while (around 45 minutes, maybe an hour). They warned us it would, and the wait time didn’t seem unreasonable for a cafe of this size, but I probably wouldn’t come here with a big group.\n\nOur waitress was very helpful in finding substitutions (for meat items), but we were charged for them. It seemed extremely unusual when we thought we wouldn’t be, and I think the up-charge was fair (especially for a side salad), but the avocado was $4 so I would ask about any changes.\n\nThe grilled cheese wasn’t especially good, and I wouldn’t recommend it. Everything else was good, especially the tres golpes, which I would highly recommend, even without the salami. There’s a full cafe drinks menu, and the coffee, the tea, and the specialty drinks (the “sweater weather”) were excellent. (2/18/25)"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtLTRQby1RRRAB",
            "text": "So so so cute! Insanely delicious coffee & the atmosphere is very cutesy and aesthetically pleasing.  Even the bathroom is cute!! They have a great mix of traditional breakfast items mixed with Latin classics. One of the only coffee spots within walking distance of the 1 entrance on 191 and well worth it! Glad to support a very nice small business in the area!  :)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmemJ2V1Z3EAE",
            "text": "Cafe Bloom is cozy and inviting, and the food is always delicious. I've taken many friends and family here, and we always leave satisfied. I'm hooked on their tres golpes. It's made to perfection... their mangu is just so good! The menu has vegan and vegetarian options. The staff are friendly, and the cafe has an easy going vibe. I love this place!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNGNEam9RRRAB",
            "text": "Went to Cloisters with my teenage son. We were hungry afterwards and wanted to eat some local latin food. Found this place nearby. While the menu was not exactly latin, the beef empanadas were fresh and tasty, crunchy enough outside and soft inside. The penne vodka with chicken was wholesome, and the Ceasar salad with chicken was as good as it gets."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmb2J1dEVBEAE",
            "text": "Great place! Large menu with vegetarian and vegan options - chickpea sandwich is innovative and delicious. Staff are very friendly - neighborhood vibe (smallish with some locals), but also welcoming to outsiders, which we were :) Beautifully decorated."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaW82SVZBEAE",
            "text": "Normally a smashed chickpea sandwich can be boring, but the addition of a sweet plantain made it fabulous. I also really enjoyed the vegan chocolate chip scone."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bXQtd2xnRRAB",
            "text": "The space is so pretty and well decorated. It’s really homey, the food is always delicious, and the staff is consistently kind and courteous! It’s one of my favorite cafes i’ve ever been to!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzd2NPbzZnRRAB",
            "text": "Why does it take 30 minutes to get a refill on coffee? It has never been this slow before in my experience... very disappointed."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbE1iNTBRRRAB",
            "text": "Love Cafe Bloom!  The staff is incredibly kind, the vibe is cozy, and the food is fresh and delicious. My favorite local for hanging with friends or cranking through my to-do list. Such a pretty place where I always feel welcome and taken care of."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzZ0lqR2xnRRAB",
            "text": "Small,  quaint spot,  used to be the golden girls Cafe. We made Sunday reservations but they didn't ask for them. Staff were so so nice. Food was ridiculously good ( had the pasta alfredo) . was catching up with old friends and want bothered about staying a long time. Great place!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNzZ5b0pREAE",
            "text": "This spot is really cute and the aesthetics are lovely but I can't help but wonder why the employees look so miserable! You make your way in, find a seat and they take your order. I find that they are not very welcoming. The food was okay.. nothing special. I wouldn't return to this place because in my opinion, there are better places in the neighborhood. Support authentic Dominican businesses that give you the full package and that's being lively and attentive to your customers.. this is also part of the culture."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbm9Ick9REAE",
            "text": "Pretty cafe with good atmosphere. Can’t say anything about the food because I wasn’t served any at all. Nobody sat me down and when I went up to order I was asked if I wanted takeout or to dine in. I told the lady I wanted to dine in and she told me to take a seat. I sat down and for the next 30 minutes I was ignored. Nobody came to give me a menu or to take my order. Other groups of people that came after me were seated and given a menu in a timely manner. I still remained ignored. Terrible service. Never coming again."
        },
        {
            "date": "1년 전",
            "language": "iw",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYa09pMkx3EAE",
            "text": "הייתי היום אחרי ביקור בקלויסטר, היה מעולה, שירות מהיר ואדיב, אוכל טעים, מחירים מאד הוגנים, מקום נעים לשבת, מומלץ ביותר"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdS1mbDdnRRAB",
            "text": "The food here was very good. I had the vegetable sandwich and the onion rings. The sandwich was unique and satisfying with fresh ingredients while the onion rings had a perfect texture and not overly greasy, however I expected the portion of the onion rings to be slightly larger. The coffee I had was made correctly, but was disgusting in taste due to the actual coffee used.\nThe server was pleasant and wanted the experience to be as acceptable as possible. The interior seemed on the right track. Just a bit bland and not as inviting, but that’s easily fixable. The price point here was reasonable. I would happily go back for lunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWeDQzNFh3EAE",
            "text": "12/15/23  this is the first time we’ve been in this neighborhood . My husband had a desire for some coffee and we spotted “Bloom.” it was a great choice. He had a cappuccino, and I liked it so much that he had another with this delicious warm coconut dessert suggested by our amazing waitress Ashley. She is very welcoming, professional, and friendly. We loved  the service, food, vibe, decor everything was great!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNWJMMTJBRRAB",
            "text": "Rainy day and latte, what else can be went wrong. This cafe is soooo adorable and cozy. The food is delicious. Staffs are fantastic attentive. Beautiful environment for brunch or little chat. Highly recommended Bloom burger and the sliders. Well made and the ingredients are hearty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcnR2MU5nEAE",
            "text": "This charming restaurant offers a delightful escape from the bustling streets. The ambiance is very cozy, although it was a bit cold.\n\nThe menu boasts a variety of dishes, and while the food was decent. The portions were satisfying.\n\nThe friendly staff and attentive service elevate the overall dining experience, making you feel like a welcomed guest."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNseGFxeUF3EAE",
            "text": "We were happy to have stumbled upon this little cafe by accident. We came for a breakfast and it was a bit early. The kitchen wasn't open yet but the staff/hostess/waitress was very kind and courteous to us.  We ordered 2 chicken/cheese empanadas, Three Hits, and Bloom Breakfast, a latte and a matcha latte, which were all great and filling.\n\nI'd like to say that I really appreciate the staff who was very accommodating and kind to our toddler and us (hungry, sleep-deprived parents). As mentioned before we came in quite early, and I think the kitchen staff worked a bit early to accommodate us. The staff/waitress made gave us the wait time for some menu to help us avoid a hungry toddler meltdown 😋\n\nWe will definitely come back again and look forward to trying other dishes!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMy1QamxRRRAB",
            "text": "The place has its charm. Two ladies working there were absolutely great, they do all the serving, cleaning and smiling.\nI ordered their breakfast burrito and Halo salad and didn't regret it.\nI think they have a DJ / music in the evening, will have to check that out."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOHFMRU53EAE",
            "text": "My favorite place around the area. Love the ambience, the food, and great customer service that they provide which makes me want to just stay all day :). I’ve had just about everything on their menu and love it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMUxmX0ZnEAE",
            "text": "We stopped for a quick bite before visiting the Met Cloisters museum and ended up in this nightmare of a place. The ambience drew us in, but the service was abysmal. It took forever just to get water, and once we got the menus, no one bothered to take our orders. The lady at the front desk was too busy counting receipts to do her job. This place is a joke, and I will never set foot in it again.\n\nFood is a joke and they forgot my order too. Even after specifically saying that we wanted to try that dish."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxN0tUd29RRRAB",
            "text": "Absolutely delicious food, all cooked beautifully and the boozy hot drinks cannot be missed - divine. Lovely staff and everything cooked fresh to order. Thank you so much!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbDVHWU13EAE",
            "text": "What a wonderful cafe!! Cafe's and Dinners can be very personal for some people.  This place has the potential to be everyone's little corner that they visit whether they are in the neighborhood or from the other side of the bridge.\n\nI got to try their Belgian Waffles and French toast combos wjth soft scrambled eggs and bacon.  Both the waffle and bread used for these came out so soft and delicious. Waffles and french toast can be made poorly if rushed but they took their time here and it shows.\n\nOhh and coffee here is smooth. Not that burnt stuff that plaques a lot of cafe's around the city these days."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMGN6M1JREAE",
            "text": "I originally booked a luggage check for a couple of hours waiting for my Airbnb to be available, I found out the cosiest place in Washington heights. Not only do they have amazing coffees, margaritas and tacos, I particularly recommend the Halo tacos (3 per serving) with their homemade dips, but they have an outstanding Terrasse and a really warm dining room. Didn't had the chance to attend a concert but can't wait to be back to NYC to found out their night vibe!!! I also found out about the Golden Girls, this place is a historical landmark. Special thanks to Melanie, who told me everything about her place!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSazgzSU53EAE",
            "text": "Great staff, amazing coffee, good food, music & cozy chilled spot. Can’t ask for more and I’m glad this is a few blocks away from me. We need more beautiful businesses like this uptown. Highly recommended 👌🏾"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbzVldjFnRRAB",
            "text": "You can tell how much effort and care the owners and staff put into everything. We had the tres golpe, a flat white, and the frappe. Dishes all came out looking lovely, everything cooked perfectly (and tasting great), waitress was so sweet, and the whole cafe is very cute."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIOVkzeDFBRRAB",
            "text": "Acabo de salir de este lugar y tengo para decirles que me encantó todo de allí, omg las atenciones la comida, y ese lugarcito tan acogedor me fascinó de verdad le doy un 10/10 y prometo volver muy pronto🙌🤩😍"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMGVPRWxnRRAB",
            "text": "One of my favorite themed café, Rue la Rue Café, is no longer... Instead, it has reborn as Halo Bistro Café. We decided to check them out one weekend. When we stepped inside, it was almost as if we were stepping back in Rue la Rue Café, but without the glamour and memorabilia that filled the room and the walls.\n\nThe wallpaper, furniture, and other basic designs stayed input. Even the large chalkboard that still showed the enticing menu from Rue la Rue. But then again, it was a bit confusing, it looks as though they are offering those items on the board. However, when I inquired about it to our server, she said that they are only keeping the board as a decoration, and they don’t offer any of the items written on the board…\n\nTheir menu was somewhat small and limited, and a bit pricey… We went with their much cheaper option, Breakfast Sandwich and Club Sandwich. The Breakfast Sandwich was pretty good, and very satisfying. Club Sandwich was very hearty, large in portion and quite filling.\n\nWe also had a dessert to share. We ordered Crème Brûlée. It was bigger than I thought. The bowl was quite hot, but we were not warned about it, so it was a shock when I touch the bowl… They need more training periods with the servers…\n\nOur main server, Mercedes, was nice, professional and polite. Other staffs needs more training on how to serve the table (i.e. how to refill water without spilling water all over the table, or to warn customer if a plate/bowl is really hot). The items we tried were pretty good and affordable. The lunch/dinner menu items were around $30 each, I am not sure how that will be received by the patrons in this area. I hope they will expand their menu a bit, and offer more dishes for lunch and dinner at affordable price."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVM3Fuem53RRAB",
            "text": "Quiet and relaxing environment, espresso coffee was brewed to perfection. For lunch I enjoyed a porterhouse steak which was amazing, very flavorful and tender, I'll be back to try the rest of the menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSN2FXdGR3EAE",
            "text": "I headed here on my way to the Met Cloisters So happy I did! The place is gorgeous, the staff is very friendly, and the coffee is delicious! Will definitely come back when I am in the area"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLS1HQTZRRRAB",
            "text": "Great spot to study, the interior design is lovely and cozy. I ordered Tres Golpes and a chai latte and everything was delicious. The servers were very nice and attentive. I would definitely be coming back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdlBHRlFBEAE",
            "text": "This place was a very nice place for a lunch date, the music wasn't loud, the atmosphere was soothing, the food was delicious and the service was great! Definitely a recommended place and they have a repeat customer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNnBEaFd3EAE",
            "text": "Obsessed with Bloom! Anytime I’m in the neighborhood for work, my colleague and I look forward to ending our day here. My favorite dish is the Tres Golpe. Everything is incredibly fresh and absolutely delicious. Wonderful place to hang out and get work done, as well. Not to be missed!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLbk5pb09BEAE",
            "text": "the most amazing little cafe with delicious food and coffee!!! very reasonable prices and great atmosphere. One of my favorite places in the neighborhood !!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVaWNUVGxBRRAB",
            "text": "Been waiting to see this place. My S.O. is a Golden Girls fan and we didn't have the opportunity to visit the place. The decor is straight out of the late 80s, and has a cool palm club feeling, like you could step out to a shuffleboard…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bUstWndRRRAB",
            "text": "I found this place just by exploring the area I just moved on! Definitely would be place ill be visiting  a lot from now on! Staff is so friendly! Amazing food! The Chai late is exquisite it a must!."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbmYzMlVBEAE",
            "text": "Ordered to pick up, it took a few minutes and I had to wait. I understand the restaurant is under new management but the pricing was a little high for takeout ($20). The food was really good, and I would come back for a sit down meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbnF2akRnEAE",
            "text": "Delightful little cafe! Their vegan chocolate chip scone tastes more like a cinnamon roll than a chocolate chip scone but is still very tasty. Their lattes (recommend the maple spice latte!) are great. Service was fast and friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXNF91TkJnEAE",
            "text": "The place is very cute, chill, low-key and well decorated. The food is great, we had the burger and chicken sandwich. The staff is very friendly and attentive. Would visit again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdnB6a2tRRRAB",
            "text": "Cute cozy and the food was tasty. My kids loved it. We will definitely be back."
        }
    ],
    "reviews_count": 77
}