{
    "name": "Elsa La Reina del Chicharron",
    "place_id": "ChIJH2stGfjzwokR8FZeRLxjKbY",
    "grid": "MN12",
    "address": "4840 Broadway, New York, NY 10034, USA",
    "rating": 4.4,
    "user_ratings_total": 1179,
    "phone_number": "(212) 304-1070",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbFNGWmtZbWRaWmtWVWNYTkxNa3AxYVVFMVluYxAB",
            "text": "The best Chicharron!!! Fresh,crunchy!!!!! Batatas fritas and to stones to die for!!! Highly recommend!!"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSS1gzTmhRMEpHYkZkek0zSTNhbkZuZDFWYVpIYxAB",
            "text": "eso es berda el mejor chicharrón del mundo 🌎"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaWVFeDRNa0p5ZDA1WVl6aFBSbUZVUkMwMVVHYxAB",
            "text": "No al limpieza en la mujeres que sirven la comida y es la factura le cobran transferencia eso es ilegal en New York cada vez que pagó me cobran de mas"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeVVWTllZbU5WUm5Wdk1VZEhVVWx4ZWxOQmQzYxAB",
            "text": "Sabroso fresco"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dWEwbGlhbFphVUhrNE4zVkZWR1p6TTJsSFVXYxAB",
            "text": "The best chicharrones eveRrr"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeE1Fb3RYMUJpTkVoMVZtNWhVbWRqUlZRNFVsRRAB",
            "text": "Best mofongo and tres gopes is the BEST around!!!!!.\nTheir food is DELICIOUS!!!!!."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMFUyaHJjVU50VUZGMFlWQndPWEkzWldSV1JHYxAB",
            "text": "Some plate in here are popular in the area. Try it all."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMFJVTklWRFZOUWpkNlpVUndSVE5uTlZSelNtYxAB",
            "text": "Es agradable comprar en ese lugar. Personal amable y atento."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWlJsbDRWSE5STms0MVkwVkZUMkpuUkdSek0yYxAB",
            "text": "Very good"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NFYyUTBkbXRIVDB3dGVERm9kVE5TTnpKck9VRRAB",
            "text": "Órdenes 2  mofongos de chicharrón y nada que ver , solos,un pedacito de chicharrón,tan delicioso que era antes,nose los que está pasando el peor mofongo🥺…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTmMxcG1VSFoxVlVOT2VuaHVlUzFETjBOSlptYxAB",
            "text": "The chicharrón here is really good, crispy, flavorful, and definitely worth trying if you’re a fan. Unfortunately, the service takes away from the overall experience. This is about the third time I’ve had a really unpleasant interaction with the lady at the register, and this time I even witnessed her being rude to a customer over the phone.\n\nIt’s disappointing, because the food really does deliver, but the negative attitude at the register leaves a bad taste. If you’re going just for the chicharrón, it’s fine. But the service makes the whole visit less enjoyable. Hopefully the customer experience improves, because the food deserves better representation."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCb1JURTVXVkY1Ykc1b1luaElOMnB0VEhwZmRVRRAB",
            "text": "Exquisitos chicharrones"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWZk9GWkZTa1pmZGkxdWJGOHpVWFJFZUd4WFdHYxAB",
            "text": "Expect to wait, but well worth it."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpa3A2cHlnRRAB",
            "text": "Delicious chiccharon is slamming"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0M2EwWXpkVFZ0Y1ROd1NVTjNVMlZvY0VOdFlYYxAB",
            "text": "Me encanta la comida es excelente, PERO...\nEl servicio al cliente para contestar la llamada de los pedidos, deben de una mejora. La persona que me atendió en el día de hoy tenía una rápidez super incómoda que raya en lo poco amable y puede llevar a torpezas y equivocaciones en el pedido.\nNo te explica, cree que tu debes de saberte el menú, y hasta asumió que no quería nada porque me pareció raro que no pudiera pagar con tarjeta y me colgo. En conclusión, marqué tres veces para poder terminar mi pedido, luego a los pocos minutos me llamó para confirmar si el acompañamiento era batata o tostones, lo que quiere decir que ni tomó nota."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNlRtSlhNa1ZPYWxscGNUUTRhM1J0YkRCblRVRRAB",
            "text": "The service at this place is really poor. There's an older lady who makes it very difficult to place an order. I won't be returning, and I recommend avoiding this place at all costs unless you want your day ruined by a frustrating experience just trying to order food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscFRubFBhVVZGWVhsSmNsaEZWRFJmWWpGTlVrRRAB",
            "text": "I’ve heard that the food here is quite good; unfortunately, I couldn’t try it due to the incredibly poor service. I asked the older woman at the counter if they would be preparing any fresh chicharrón, as the one on display looked really dry and dull. She responded that it was all they had. I had to repeat myself several times to get her to prepare me a pound of it, as she seemed more interested in the conversation happening next to her. When she asked what I wanted with the chicharrón, I told her multiple times, but they still wrapped my food without the batatas. As I was telling the other lady who was ringing me up that the batatas were missing, a fresh platter of chicharrón arrived. When I respectfully questioned it, the older lady serving me became very rude and insisted that I take it because she had already cut it up I walked out without my order as the service was ridiculously terrible and I felt beyond disrespected.\nThis isn’t the first time I’ve experienced this; the older lady usually has a very negative attitude, and the service is consistently poor. I will not be returning nor would I recommend this place to anyone."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4M1dUWXpaV1Z5U1dkWlVVUTJhamRDVGxKUmNuYxAB",
            "text": "Dura dura la mejor gente buena y todo muy bueno 100%"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReWNUTlVSMlJYTWtsUWEycDZRWE5DT1RseWEwRRAB",
            "text": "El mejor chicharrón que me he comido en nyc"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSaGVqZEJRVFphTm1GM2MySk9aV3cwWkRsbFIwRRAB",
            "text": "A little small but ok."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQ1NVSmtPVFExVW05aGJ6WTBORE54UlUwMGNWRRAB",
            "text": "Very popular spot in Inwood, usually has a 10-15 wait, no seating but take your food to go."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psR1JqVlpjelJDTVRZemQzcDVZMkZrTldWQ1dsRRAB",
            "text": "I went out today with my partner to Elsa La Reina and we ordered two mofongos de queso and a yuca in the side. They got one of the mofongos correct, but served the other as a chicken mofongo by error. Mistakes happen — I understand.\nThe real issue was how I was treated. When my partner respectfully told them that there was a mistake, the person taking the orders began yelling at me that I actually did order the chicken mofongo. It was an uncomfortable and unnecessary confrontation.\nBesides that, the yuca was forgotten, and I waited a few minutes longer for it, which would have been fine if the problem had been solved respectfully. Unfortunately, nobody apologized — neither the counter person nor the cashier when I was paying.\nThe food itself was fine, but the service was horrible. I will not be returning."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ablptWlRiMVZWY201WWIwUndZM04wU0RaRU9VRRAB",
            "text": "Un servicio excelente.  Buena comida. 👍"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNVJtRlhRbkJSUm5oMVMwZDVjMFJHVTA4MWQwRRAB",
            "text": "Muy bueno todos"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQdWpsSmFQc2Z5aG53RRAB",
            "text": "My last visit to Elsa La Reina del Chicharrón was nothing short of amazing. Elsa truly lives up to her name the queen of chicharrón! perfectly seasoned pork, and the flavor doesn’t disappoint. The chicharrón was crispy, juicy, and full of that authentic sazón that’s hard to find anywhere else in the city.\n\nYou can tell everything is made with love and pride. The service was friendly, fast, and made me feel like family. If you’re in New York and haven’t been to Elsa yet, you’re seriously missing out. She’s simply the best nobody does it like Elsa!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VObTI3NFhaMV92UktBEAE",
            "text": "This is not the first time they give me a wrong  order .I don’t really like to make complains but some times some of them have a bad day   And treated the costumers so bad even if they are wrong .It’s sad because they make an amazing mofongo .The owner has to check what the employees do to make sure everything is running good ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKaTJxNDI1aXI2dk5BEAE",
            "text": "Really good chicharrones!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNWRtcFRibUU0WjBvdE9HSkdVRjh5VjJGd1YxRRAB",
            "text": "Good food"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKN3M5X216dkt1OXpnRRAB",
            "text": "Los chicharrones es lo mejor que tienen , Lo peor es el servicio  , cada vez que he ido el trato es muy malo , excepto una señora de la caja , el resto es muy antiprofesional , se supone que deberían tener un mejor trato al cliente , Pero no es así ,\nPor ello deje de ir , Más por insistencia de un amigo después de 7 meses regresé con  el trato malo como siempre ,\nUn poco de amabilidad haria del ambiente mucho mejor , No solo es mi opinión varias personas me han dicho lo mismo ,\nHacen sentir como si nos hicieran un favor en vendernos comida , Pienso que la reciprocidad es un tema a pensar y  la amabilidad abre puertas"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOaWVtT2YyZzZYWTNRRRAB",
            "text": "Mofongos are really good and they come with a good amount of food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYW8xS3FIeFpYV1hnEAE",
            "text": "The best chicharron in town! Delicious. They also make to order mofongo if you are willing to wait 12-15 minutes. Would recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMFFVbFJVemRmTTNKS01VWTBjVXBoUTJZNVlWRRAB",
            "text": "The food is excellent"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMajAwb2FEcE5IbHJRRRAB",
            "text": "I was skeptical of the self proclaimed best chicharron in the world….but MAN IT IS THE BEST! I will definitely be a repeat customer anytime I’m uptown!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd3FfV2V3EAE",
            "text": "The best chicharron I ever had ! Every time I come here and eat I always wish I had more."
        },
        {
            "date": "6달 전",
            "language": "gn",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvanAzVkhREAE",
            "text": "I love this place for me one of the best chicharrón de cerdo de ny"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJN3N6bG53RRAB",
            "text": "5 five stars"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc3R2cDZ3RRAB",
            "text": "They have almost all the Dominican Classic foods you could ever ask for. Fresh! An area to sit and they do take out as well.\n\nThe Mofongo is absolutely bussin"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydXZ5V1pBEAE",
            "text": "I really wanted to like this place, but it was not possible. The staff were all very nice, but the food wasn't good.\n\nThe meat was dry to the bone and extremely salty. It was hard for me to eat and even harder for me to enjoy.\n\nI don't really remember what the other dish was, but it was the opposite. It was bland and unappetizing.\n\nIt's not meant to be a dine in restaurant, but there is a table that you can sit at. It's worth mentioning that there is no air-conditioning and in front of you is a dumpster."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlM1lxcjB3RRAB",
            "text": "Estuvo bien la comida, pedí la picadura para uno y ensalada de aguacate, lo compartimos dos personas y sobró. El aguacate la mejor parte de todo.\nEl morir soñando la verdad no me encantó y el jugo de Cherry lo sentí muy dulce."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5LXBDV3VRRRAB",
            "text": "Pues les cuento que el Departamento de Salubridad cerre este negocio. Acabo de pasar caminando frente a ellos y tienen su letrero amarillo. Y todo esta cerraro. Es que esa doña cree que está en una una fonda en en campo. Agarrando las cosas con las manos. Y hablandole arriba a la comida dejandole caer saliva, en fin."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCa0tuMG93RRAB",
            "text": "A very reduced location with A LOT  of food options.\n\nChicharrón is TOP TIER.\nFunny thing is, this is a very LATINO CULTURE PLACE.\nYou only have 8 dollars? Ask for a 8 dollar plate.\nYou only have 5? Ask for a 5 dollar option. Well thought and community based attention.\n\nAttention Ladies are warm hearted and manage to treat You as their grandchildren hahaha.\n\nDefinitely a great place\n\nDo yourself a favor and ask for \"cebollita\" (pickle onion) over your chicharron.\n\n*****\nEs un sitio buenísimo y bien cercano a la comunidad\nSe ajusta a tu dinero o pago, solo tienes 8? Pide un plato de 8. También puedes buscar una opción con menos. Las personas de atención son muy amables y te hacen sentir muy bien pues tienen el trato de abuela, pese a que el espacio es reducido, es un ambiente agradable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURSanVNaBAB",
            "text": "Great, unassuming place for authentic Dominican food. The portions are very large and well priced. I had the chicharron and mofongo and they were both delicious."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdmRMUVhREAE",
            "text": "Massive, delicious portion of Pernil w/arroz con gandules (braised pork shoulder with a side of yellow rice and pigeon peas) and the local staple, chicharron (fried pork belly on the bone)!\n\nYes, I had both, dont judge until you eat here! 😜\nThe meat is tender, the skin is crispy, and the fat is sweet and juicy! Best chicharron in the Boroughs by far from a local business queen. Try it!\n\n....why are you still reading this?!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3d3RlNktBEAE",
            "text": "El chicharrón muy bueno Pero desgraciadamente encontré un pedacito de la  fibra con la que limpian la freidora"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNk15YnVRRRAB",
            "text": "Ordered mofongo con chicharrones, which was huge, filling, and super tasty. It came with a nice, warm red sauce on the side that wasn't very spicy. Fair warning, I tried to order via the special's name on the menu (mofongo a la reina) but…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtb3JmcElnEAE",
            "text": "bueno el doctor me dijo no comas comida con grasa pero cuando voy a New York no me resisto las ganas del chicharrón de dónde está muchas bendiciones está delicioso no se que hacer con tantos chicharrón 😋😋🤗🤗🤗🙏🙏"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRX09tVTRBRRAB",
            "text": "Amo el chicharon de Elsa!!! Pero detesto el gentio!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdEk2UG1RRRAB",
            "text": "They have the best chicharrón.\nBatatas and empanadas . 10/10\nMy favorite spot every time I go to W. Heights."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOHBtRVJ3EAE",
            "text": "This place is probably has the best Spanish food in the area. Aside from the chicharrón (pork chunck) that they are known for. The rice orders with any selection of meat are going to be top tier. The flavor is spot on and the seasoning reminds me of my mothers cooking. I’m telling you order besides the chicharrón and you will thank me later. Possibly the best Rabo(oxtail) in Dyckman. The best mofongo in Dyckman and the best meats. The only thing I don’t like is the servers rushing you. I know you guys wanna keep the line moving but they could come off rude at times."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQX0pYVWdRRRAB",
            "text": "This is how chicharrones are supposed to be made! The crispiest, juiciest and most flavor packed I’ve had from a restaurant frankly ever! It’s quick and (not) dirty, you come in eye the golden crispy piece of pig meat and watch them weight it and hack it up, so satisfying. They have a few side options, I went with the arroz moro (which is a black rice cooked with black beans together) and say yes to the gravy. Make sure you eat it quick so the chicharrones don’t soften, mine lasted a brief car ride home (~15 min) but I couldn’t help taking a few sneak bites in the car. Get you some of the sautéed onions with them, delicious."
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDdmRDdU5nEAE",
            "text": "Delicioso el chicharron de cerdo, un poco costoso pero se da gusto de saborear un delicioso manjar en la gastronomia aca en NY"
        },
        {
            "date": "수정일: 5년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjcGItV093EAE",
            "text": "El mejor lugar en NY para encontrar chicharrón fresco, crujiente y a un precio razonable."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLLXZIS3h3RRAB",
            "text": "Fried Sweet Potato with Chicharrones (Pork Belly) topped with Onions! Delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dE16ZGVREAE",
            "text": "We ordered a few lbs for our Christmas party and another time just for a lunch at work. The chicharron was amazing. It wasn’t greasy, it was meaty not just all fat. It was really crunchy even after driving all the way back to work and eating it an hour later. Some places you bite into the crackling and it sticks to your teeth. Not here just a really good crunch and crumbles apart. Will definitely be going back and grabbing some to take home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeXQzN3lnRRAB",
            "text": "I have lived in the area for 3 year, I have tried their food on different occasions. However, I always found their food below average. Rice and beans taste burnt. The meat is unseasoned and their best food chicharrones are average at best. What really sealed the deal, their food gave me food poisoning. I don’t want to trash the place, because the people who work there are sweet. However, the food is a main reason that I would never eat there again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQal9tNzZBRRAB",
            "text": "Elsa restaurant has the best spanish food in the New York City Area. You will never leave there disappointed. They are noted for their Chicharron. Their prices are very good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucXN2SFZnEAE",
            "text": "This is La Isla .... All of them are different in service & consistent on flavor ... I am content for every time I go to this chain- I know what I am getting!\nTheir crackling is on Point ....\nactually people  order multiple plates for dinner ....\nWill return + highly recommended"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbFlHSEVnEAE",
            "text": "I love their food. Amo su comida. Pero el staff muchas veces no es profesional. El cajero siempre está en el teléfono y se le olvida darme parte del pedido ya sea aguacate o soda. Si le pides algo te da actitud. No he vuelto a ir por esa razón. Que lastima que se pierdan clientes por la calidad del servicio específicamente de ese muchacho cuando la comida es tan buena y los precios son razonables."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cTdmNHBBRRAB",
            "text": "Brutal los chicharrones de aqui, la yuca estaba un poco dura y seca, volvi tres dias despues y lo pedi con guineitos. Pero volveria aqui todos los dias si fuera posible! Tienes refrescos dominicanos, red rock, merengue, frambuesa y todo. La verdad! Bien\n\nNote:\nDeberian de tener el lugar mas limpio, hay basura destapada en el lugar donde comen, y eso trae moscas!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNib1llbW9RRRAB",
            "text": "Great lunch plates! The portions were larger than we were expecting- we could have shared, but it would have been hard to choose! The chicken just fell off the bone and we loved the mashed plantains!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cGNmWkhnEAE",
            "text": "Estes es el mejor locacion en qualida para los chicharones. Mejor del la 173. Lo unico es, no se si tienen ese liquido o sason que le ponen en la Republica Dominicana aparte."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MktpZlFBEAE",
            "text": "Today 8/20/24 I was hankering for a sancocho but they only had mondongo. I bought it but I didn't receive a slices of lemon or a sliver of avocado. While paying for my order I had to wait until the man at the cashier finished using his fone. No customer service at. The MONDOGO WAS DELICIOSO."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMkppQk9BEAE",
            "text": "Great tasty food. Reminds me of all my trips to Dominican Republic!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6bk51ZHB3RRAB",
            "text": "I love the Chicharron and I ate it in other Elsa but this is the best I've ever tasted I invite you to come and eat here not only chicharron but a wide variety of meals you have on a daily basis"
        }
    ],
    "reviews_count": 64
}