{
    "name": "Inwood Local Wine Bar & Beer Garden",
    "place_id": "ChIJT1cl8PbzwokRvZOVaH0hQ8Y",
    "grid": "MN12",
    "address": "4957 Broadway, New York, NY 10034, USA",
    "rating": 4.5,
    "user_ratings_total": 240,
    "phone_number": "(212) 544-8900",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbFQyRmFlRmQ1YmpGUVJrZElNR2RmVEZOT09HYxAB",
            "text": "Can't believe I've not reviewed this spot yet!\n\nAwesome local bar. Love the 13+ beers they have on tap and each one always something new. The Korean bbq chicken wings, ribs and burgers are a favorite here. The new small arcade to the side is a nice addition and the atmosphere is super cozy and inviting. Love the fact that the music is not too loud here, but just right. Definitely recommend this bar to locals."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeWQyNXRNRmRRUzJReWVFMXpNMUkyUjJZeGEyYxAB",
            "text": "I am here every Wednesday night for Uptown Pub Quiz, and alternate between the addictive ribs and the huge cheese plate—which can be shared by two hungry people. The selection of beers is explorable by beer fans of all tastes. Gus and Olivia welcome everybody warmly!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS3Y3N3JFeHBTSmpBRRAB",
            "text": "I love ittttt !!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOM0UxTFAtanJDaF9nRRAB",
            "text": "Decent food and cocktail, cool local hangout"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdnpnSXp6cDZ1MlF3EAE",
            "text": "Best place ever!!! The food is always amazing (wings, fries, sandwiches, salads, wraps, cheese board all so good), the service is super friendly, and the atmosphere is perfect—especially when the front doors are open on a nice day. Great spot for both lunch and dinner. Drinks are top tier too. I always leave happy :) Also, the area in the back is super nice for a cool atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOamJxcGVkMWJMdGNBEAE",
            "text": "Yesterday was the first time I'd been back since it had closed during the pandemic, and while it'd reopened quite a while ago, it just didn't seem to fit into my schedule or location.\n\nNonetheless, I was very, very pleased to be back.  I was with a friend who was very impressed and said he wished he had a place like this where he lives downtown.  Casual vibe, very good food and wine, and very pleasant service with reasonable prices, probably helped by not having hard liquor service.   While bespoke cocktails are the rage these days, it's nice to have a place that focuses on wine and beer.  I know that I, and expect that we, will be back soon."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VONzhuTmY1aGEybFR3EAE",
            "text": "It was a nice experience"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRLV9IVXlnRRAB",
            "text": "Love Inwood local.\nFriendly patrons\nBartender was coolest guy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdlAzTEV3EAE",
            "text": "I visited this bar on Friday 04 October. I was in the area whilst on vacation from Liverpool (UK). It was early evening and the bar was quiet. I had a lovely German beer. It was on tap. They have an impressive selection of beers on tap here. The two female staff members were very friendly and talkative. Samantha recommended the lobster mac 'n cheese, and it was very nice. I had a second, different German beer and that was good too.  This is a great local bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIczl5Q3lRRRAB",
            "text": "Nice option for having dinner in Inwood.  Friendly staff, very nice space in the back.   Food was excellent!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3X2Y2N1VnEAE",
            "text": "Cutest date night spot! The food was quite impressive. I wish I took pictures but the food looked so amazing we inhaled everything!The buffalo wings are 10/10 for me, super crispy, good amount of meat on the bones and an amazing tasting sauce. However, the mozzarella sticks stole the show, 10/10. They were huge and super cheesy, perfectly paired with a marinara sauce. The grilled cheese was also good but I would rate that 6/10. The back yard is a beautiful space for a date night or group outing, with a huge tv. They also have an amazing beer selection with so many options to choose from. Definitely coming back here soon !"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRM05Ta2JBEAE",
            "text": "Great place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MWRPWGx3RRAB",
            "text": "So happy this place reopened after being closed from the panademic. The food, service and atmosphere are amazing. Another Inwood gem that is consistent with its food. Every time I go here I always get tuna tar tar, lobster mac and cheese and wings. It always has the same great taste and never disappoints. I've also had quite a few other things on the menu which are always good as well but I love my staples. The beer and wine selection are good as well. They are always rotating new things on tap and posting on there socials whats new. The bartenders and serves are great they make good convo and are attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6aWZPXzF3RRAB",
            "text": "Hidden gem! Support local businesses. Very cute & cozy. Good drinks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd2RpdVlnEAE",
            "text": "Came here with hubby for dinner on a Thursday.\nThe dining area in the back is very cozy!\nWe enjoyed our food and received good service, will definitely come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEME9fYnd3RRAB",
            "text": "Wow this place!!!! The Korean Chicken Wings with Truffle fries, delicious, wing are 100% crispy, the fries have an exclusive taste you can’t stop eating. I feel they need more variety of beers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5cC1MUFVBEAE",
            "text": "I came to this place because it’s 4.5 overall rating. It needs course correcting.\n\nI ordered the fish and chips. Fries were soggy and fish was bland cornmeal breading. Fish was a little “fishy” also.\n\nNot really a great selection of wines or beers either.\n\nThis is a 3 star place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5aG9uT3pBRRAB",
            "text": "Such a lovely discovery. I suggest a stop 🤭"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOW9MdzJ3RRAB",
            "text": "If you're looking for an excellent wine and beer bar with great food and ambiance, I would highly recommend Inwood Local! The extensive wine and beer selection is top-notch, and their food menu offers a variety of delicious options to pair with your drink. You will feel like home with their candid service.The atmosphere is cozy and inviting, making it the perfect spot for a relaxing evening or a casual gathering with friends.\n#bestchickenwingsininwood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcjRYUWJnEAE",
            "text": "This place is nice and intimate, perfect place where you would go for a date night. Great cocktails, wine and beers. The only con it can get extremely warm towards the back room. If you’re sitting by the long tables one could get really warm and I feel like a rotisserie chicken. They also have an outside area that was closed when I visited but it super cute( peaked through the window. Food was really tasty, Cuban sandwich and hand cut fries."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1N3JmTjNnRRAB",
            "text": "Very nice place for dinner and drinks. I attended a fundraising bingo dinner and it was much fun. Awesome place for groups as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabmFLekl3EAE",
            "text": "This is exactly what Inwood needed: a beer garden with excellent customer service and cool ambiance. Perfect for Football Sundays at the Patio or a cold one after work! Ray is that Guy!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaN2RQR09BEAE",
            "text": "It’s a really good place and we enjoy coming here but the waitress they had today really needs to do a better job. It was difficult to get her attention so we decided to leave early after making us wait too long and towards the end she told us she couldn’t get our beer because she was to busy!? Smh"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOHF2dkNBEAE",
            "text": "Good music, good food, good vibes. Ray is the best..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNk1fVk1nEAE",
            "text": "I really like this place as a low key but fun spot to stop in for a drink. Their prices are appropriate and don't make you feel like you're breaking the bank, and they also have a full menu of food to order too. They have an \"outdoor\" patio in the back (when I went it was an enclosed style patio), but honestly I enjoy the vibes of the front half of the space the best."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNWJMZmJnEAE",
            "text": "Can’t yet speak to food, as just stopped in for beers. Great to see so many taps in the neighborhood. Hoping they have a NY themed week on occasion to get local (and local-ish) brewing companies involved. Wish this place nothing but the best; they’re a great addition to the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMmRINGxnRRAB",
            "text": "I loved this place before the pandemic and the reimagined menu they ruled out when reopening has blown me away. Well varied beer list with some nice surprises, a friendly and helpful staff, and a cozy and inviting space round it all out nicely. I'm glad to have them back in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwa2MteWV3EAE",
            "text": "Best beer list in the neighborhood, music is excellent, food is tasty and the service is terrific. Closed on Mondays and Tuesdays. Definitely going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwLU4zNXp3RRAB",
            "text": "So excited! We have an actual beer garden in Inwood/Dyckman!!!!\n\n❤️ the vibe here\n\ngreat food too! had the turkey meatballs (so good) and delicious toasted cheese w/coleslaw\n\nwelcome to the neighborhood!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNweWN6MXpBRRAB",
            "text": "Hidden gem in Inwood. Just opened a month ago. Great atmosphere, service, prices and food. The new local spot."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLenN5WVp3EAE",
            "text": "The best local craft beer and wine bar in New York City. If you're looking for an interesting beer or wine, this is where you would go if you're near Inwood/WaHi. The beers are always changing!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjd2FHNGxnRRAB",
            "text": "Inwood is cozy, the variety of wine and beer is outstanding, food is always on point. I highly recommend this place."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdGVhZ2VREAE",
            "text": "Good neighborhood ambiance. And I had what I think was the best BLT I've ever had."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzdzVQeGFREAE",
            "text": "Great staff and clientele! Love to stop and chill on my way home. Happy hour 4-7 Mon-Fri! Great playlist by Brian!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzc1ppT1JBEAE",
            "text": "A lil tight because everybody loves the place."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzeHRXeVNREAE",
            "text": "Great neighborhood bar. Friendly and honest people."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwaHJIMTNnRRAB",
            "text": "Tasty mainly Mexican food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVN1p1WFpREAE",
            "text": "I've been to this spot about three times, but the food is always amazing. They give very generous portions and the service is on point. Will definitely be coming back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVcllTcmJBEAE",
            "text": "Always a fun place to visit. Very friendly bartender with great music taste and an above average selection of beers and wines. The food has improved over the years but the drinks and ambiance are the strongest draws of this fine neighborhood pub."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVc0tqYUl3EAE",
            "text": "Too dark and not a big selection of cocktails."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrdWFhaERBEAE",
            "text": "Great! I love their fried calamari. Always fast and kind."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrMlA2VkJnEAE",
            "text": "A dump.  As soon as everyone gets a buzz, the fighting starts, they open the back doors and everyone starts screaming and cursing, fighting and lighting up who knows what.  THEY NEED A BOUNCER."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ0NDgyd193RRAB",
            "text": "Excellent customer service!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0cFBDVEZnEAE",
            "text": "Was here Sunday 3pm. Waited over an hour. The order was never placed. No apology was given."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNGNyNWhBRRAB",
            "text": "Good Service, nice back yard seating, need better food options, mediocre nachos and sliders, beer options could improve, one restroom is kind of a problem specifically if you are drinking beer and it's crowded. Comfy place to go alone, friends or even family."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvOF9MaDNRRRAB",
            "text": "I simply love this place, is my go to when a friend is visiting town. Food menu is simple but amazing. Everything I’ve tried delicious! My fav are Kobe burger, Nachos and grilled chicken sandwich."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcUxtbVRBEAE",
            "text": "Always great. My friends and I have become regulars because of the extensive been selection and solid, dare I say great, food. I'm not a beer drinker myself, but Inwood Local has pretty great cider, wine, and cocktails. The only downside to…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdEtfbGNREAE",
            "text": "Awesome beer spot with a huge back patio area and beer garden. Excellent selection of local beer at reasonable prices. Friendly and relaxed staff. Indoor and outdoor seating and goof for large groups. Probably…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnc29qcUxnEAE",
            "text": "This place is like many establishments in Inwood-you want them to be much better than they actually are but they just can't put the complete package together. It often smells like dead mouse and they constantly have issues with being able to accept credit cards. The food is mediocre at best (although they have good pretzels), and the beer list is varied-though finding something you actually want to drink can be a challenge. The craft beers tend to sway towards the odd and are often Porter and stout heavy. Need more IPA's and more seasonal appropriate beers. Service is ok. One bathroom is a problem when crowded. It's pretty family friendly, but their outside space is essentially wasted because you can't really sit at tables outside because of issues with neighbors and noise. I come here often because it's pretty much the only of it's kind in the area, but it really isn't great."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRNDUzVGRREAE",
            "text": "Fantastic beer list (including a house pils, which is pretty solid); good bar-type food with some Mediterranean twists; and a great garden patio in the back (especially good to watch a big game). Only complaints would be the prices are a…"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcnFIanpBRRAB",
            "text": "Inwood Local is one of my favorite local bars.\nWhile they can't serve liquor, they more than make up for it with a wide array of rotating taps and solid bottled offerings.\n\nSitting in the back is my preference as you have a little more space to kick back and relax with your drink and some food.  For brunch, this seating area is perfect for families with small children.\n\nMost of the food on the menu is fantastic. The cheese/charcuterie platters are a real treat and definitely worth the higher price tag."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncjRmUjBBRRAB",
            "text": "It is is such a cute and cozy spot. Went with a friend after work to try it for the first time... So glad I went. They had beautiful live music Sunday night and the food was delicious. The server was helpful with the choices in beer. Awesome service. I will be going back 😊…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBb2RQTHVBRRAB",
            "text": "Good pub for family friendly hangout while the kids snack. Not the most consistent service and, whose the food was decent, I would not recommend this place based on those qualities. The variety of beers and the back patio are the real trophies. If you drink beer."
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdWVMRWNnEAE",
            "text": "Great for any number of people. Small tables for groups of 2-4 or communal tables for larger groups. Cozy bar in the front, and larger beer garden and outdoor patio in the back.\n\nThe French Toast looked DIVINE (stole a peek of it from the table next to mine). Covered in sugar. ::swoons::\n\nReally nice and helpful staff. I had a Pear Cider which was delicious.\n\nHuge projector screen that takes up one whole wall which is awesome to watch the Playoffs (or any game) on.\n\nDef stop in if you're in the 'hood. You won't be disappointed."
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcU0tOC1RRRAB",
            "text": "Best option for micro brews in Inwood. I always find something I like and new to try.  Staff is friendly and knowledgeable for the most part. It's kid-friendly, (especially the back room), during the day. The menu needs and update and it…"
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBaDlQaVJBEAE",
            "text": "a great addition to the neighborhood.  They specialize in craft beers and have 16 of them  at a time on tap, changing with the seasons.  the bar is so cozy and the back covered patio has a few 6-seater high tops, and three 10-seater…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJdnZ5M013EAE",
            "text": "Great food, wines and beers. Cozy and very relaxing place to enjoy a good beer. The staff is phenomenal and the music is always on point. Best bar in the area for sure!"
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReTlQdmxBRRAB",
            "text": "Always a diverse rotation of good quality beers. Early and Late happy hour is always a plus. Big space in the all year around back yard. The food is pretty good, upscale bar food well prepared."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJam8tUjBBRRAB",
            "text": "One of the better brunch spots in the neighborhood. They've got a great selection of beer, and the bunch options are delicious. The quality of the dishes is nice. I'd return for brunch."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMFA3ZmhRRRAB",
            "text": "This bar lives up to its name, offering a casual and welcoming atmosphere for Inwood denizens. Bar seating is in the front, with larger tables and communal seating in the back. Sitting in the Local's cozy outdoor garden is the perfect way…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcHNlMzB3RRAB",
            "text": "Delicious, reasonably priced Weekend Brunch; not crowded on Mother's Day -seating rather hidden behind the bar with view of outdoor patio. (Patio is available for seating in warmer weather.)"
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3MWNpTlNREAE",
            "text": "You can't go wrong with Inwood Local.  The food is so tasty and always consistent. The kobe beef burger, middle eastern meatballs, caprese, pork and beef sliders, and the pizettes are some of my favorites.  The atmosphere is fun and relaxed. All kinds of people come to hang out at Inwood Local. Families bring their young children, which would typically be nuisance, but some how its actually enjoyable to see them running a muck and playing outside in the garden area. Young adults come to gather and enjoy the vast craft beer selections, and older crowds seem to enjoy the wines.  The front of the beer garden is a bar type setting and in the back of the restaurant has picnic tables and high top tables under a tent like room.  Its heated in the winters so you stay pretty cozy as you booze.  Off the back area is an enclosed outdoor garden type setting that has tables and chairs for outdoor boozing types."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRczZtN19BRRAB",
            "text": "Enjoyed my time at Inwood Local, the beer selection was really diverse and surprisingly jg, had lots of options and not just IPAs. Had the beer battered chicken fingers which were excellent. Also enjoyed the Simpsons stream on one of the TVs."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZdUlLQ1ZREAE",
            "text": "Great little hidden gem in inwood. Wine bar,/ beer house, coz, romantic for chill date night... Live and social enough for a get together. Foor is tasty. Prices are good... High end / top shelf, quality craft beers and wines. Heads up…"
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNHV5Y3J3RRAB",
            "text": "Sólo puedo comentar acerca de la comida, la primera vez  comí panini y estuvo muy tostado o duro para mí gusto pero lo demás estuvo aceptable, luego pedí chicken tenders y de verdad estaban muy buenos, la textura no era crujiente, era más…"
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRc1BDbFVBEAE",
            "text": "The craft beer selection is vast.  Always something new to try and favorites to come back to.  The food is excellent.  Great place to meet with friends and be social."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBaksycXlRRRAB",
            "text": "That place prices are so hight. Dont know what so good in there... if you go early there is not DJ, some food are just warm up like wings, the tv’s going on off any time is snowing or raining, a witters change our oder because they dind’t…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0eFAtSGNBEAE",
            "text": "Very Poor Service. Didn't place our food order. After 90 minutes we asked what happened to our order and we were told the kitchen 'lost the ticket. '\n\nWhen we told the waitress we would like to leave, the worst part was she insisted we had to speak to the manager. The inference being we had to pay for food that they never gave us."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cWFpTXZRRRAB",
            "text": "I love sweet potato fries and beer, this place has both."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMDZqRFhnEAE",
            "text": "Great beer selection and amazing French fries. Other food good too, but make sure you get the French fries and ask for their chipotle mayo for dipping."
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZN0ktd0ZREAE",
            "text": "Lugar Tranquilo para pasar buen momento....😉…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnaXBPMWhBRRAB",
            "text": "solid spot, food and pricing was decent. no outdoor eating but still pretty good. recommend but i'd want to check out some other places first"
        }
    ],
    "reviews_count": 72
}