{
    "name": "Lola Lola",
    "place_id": "ChIJSwYI35_2wokRVEMQXx1qz4Q",
    "grid": "MN12",
    "address": "1306 St Nicholas Ave, New York, NY 10033, USA",
    "rating": 4,
    "user_ratings_total": 427,
    "phone_number": "(646) 559-0930",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORVUyZHVPVzQ0TW5kU1NIWkxWRnBXWDBGNVRYYxAB",
            "text": "This is such a cool spot! We went for the 99¢ happy hour - frozen margaritas and sangrias were excellent. From the food, my favorite was the pasta with shrimp. Angel, the owner, is a great guy and made sure everything was perfectly organized for us. Highly recommend!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xObWNsTkJSM1JyY21ocU1WTnBhVXh6WTBoV1dVRRAB",
            "text": "This place is a sham, someone’s closet with cloth seats and $5 waters. The margs watered down and the chicken came medium well- gross"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRFZWZFVUalJmVFhseU9XSkJUMUJrY0c5NGRGRRAB",
            "text": "I only went for hookah. They didn’t have the one I originally ordered, but the one they did have was okay. Good vibes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNE5GSnVkMHBRZGtwYWExQlBNRE55WWxGM1lVRRAB",
            "text": "Angel was just that, an angel. Great customer service even during a busing happy hour."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Jd09HZDRVRVJHUVc5NFIySjVZbEZTTlUxVFEzYxAB",
            "text": "Food was gooood. Loved the Mofongo will definitely recommend. Drinks was good too but you do have to order entrée which is like $25+"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNGJEWnVSVU41WTNGZlFtNXdiRzh6WTJwQ05XYxAB",
            "text": "We visited this restaurant to celebrate our friend’s birthday, and we had a fantastic time. Our server, Angel, was incredibly friendly and attentive, always making sure we were comfortable and well taken care of."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVE5rZDJUV0pEUVdwU1JFMVdRV28zUzNWdmRFRRAB",
            "text": "Our server was Angel. He was chill. Good food. Good tunes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NWRUbEJha1J5U3psUk5XUkdXVkprZFVoQmMzYxAB",
            "text": "The food was really good but the drinks could’ve been better with more alcohol.  The atmosphere is great but it is a bit small. Angel did his best with the amount of people we had (party of 6) and was able to get our drinks quickly. Their happy hours have good prices overall would recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TmVWUlhUSGhhTTFOTGJtUllRbm80UVZad05HYxAB",
            "text": "Angel made our experience here a delight for celebrating a friend’s bday"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadk1XWnVXV3gwTm5STmJGTmxUako0ZUUxRU1tYxAB",
            "text": "DO NOT PATRONIZE! The $8 drinks were so full of sugar. You couldn’t even taste the liquor!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMlIxaGlTRjlSV1RoV2VVWm1VSFJ1Tkc5R1MzYxAB",
            "text": "S o beware of this bar . They charged me and my friend a $40 entrance end it was dead inside . The drinks were whatever and the dj was wack , not to mention the place was empty on a saturday night"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWVJsRTBXV3h4ZW5SUU1USjVjbkJRZG1zdGExRRAB",
            "text": "Fuí con mi novio, los 2 somos colombianos y nos ENCANTÓ el lugar, deliciosa comida, deliciosos cócteles, espectacular ambiente con un increíble dj y una excelente atención por parte de los meseros, en especial la atención de Aiyana... una chica super atentay amable, volveremos a Lolalola.. recomendado al 100%."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobFNWUjRTblF3UXpSWWNWSm1hVmRaT0MxdU4wRRAB",
            "text": "I went to this place for my sister’s birthday on August 2. It was amazing The music was good. Food was great. The waiter was very nice and the drinks were good for $ 1.Dollar. We got there at 3 o’clock in the afternoon and left at 10. We only spend $96 between both of us. It’s a great place definitely worth checking out !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxZk1FUTJVM2xSU3pSU1RuSmpZMmRYYVV4RWIyYxAB",
            "text": "Aiyana was so amazing. She recommended some good food. She was kind and very professional. The food was amazing. The drink was excellent. I like that the cocktails was only 99cents. They had flavor from passion, mango, strawberry, Tamarindo and peach. So amazing. Will be coming back again:"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSWIwcHJZWEp0YWpCVU5YQXdlVWhvVGpseWQyYxAB",
            "text": "Music is great, drinks are cheap, but you will be waiting a long time for your order. Worth it during happy hour though."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSU1WVlVaMDVOTkZGQ00yazRjMGg0WVZaS1RXYxAB",
            "text": "JJ is the bomb he take of  his customers and the best treatment ever thank you JJ"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbVJuZEZiVEkzWjJwTlQxSm1Walp5YkMxQ05IYxAB",
            "text": "OmGooness JJ was the bomb.com. He was so sweet and pleasant. This ws my 2nd time there and it was better than the 1st time. JJ is the best....Love Lola Lola top tier..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMU1rUmZhV3BwZW5OUlZVRjZOMk16Wkd3eFZWRRAB",
            "text": "Horrible food was bad prices are the worst"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeFZWRlhkMUZSWDBWTFFtOHhZbUU1WjB0eU0xRRAB",
            "text": "Oh my gosh, I love everything about this place! I brought my sister who is coming from out of town. When I tell you the drinks, food and the hookah was out of this world! I mean it, and I don’t give everyone a good review. I would recommend this place to everyone and anyone. Oh yeah JJ our server was amazing, very friendly, attentive and patient! I got the penne pasta and shrimp,  and my sister had the garlic shrimp with yellow rice. I wanted to give the chef a kiss for how good it was!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUmRGcGxVQzFUWWpCS2FWY3pkbGhsWTNaSGRtYxAB",
            "text": "I moved to the neighborhood a year ago, and I was really disappointed with my experience here. Charging $5 for a bottle of water feels like price gouging, especially with no prices listed on the menu. That kind of lack of transparency isn’t okay. I wouldn’t recommend this place. This is doing a disservice to the community."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobVEzTnhUWGhpTUVZemIwbzJhRE53VUVOaE4wRRAB",
            "text": "Best happy hour i been too will be coming back soon"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTVZtcFdkVjlYWWxGck9VRmZVVGhQYmpOR1luYxAB",
            "text": "Nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMGNtbHlSalV5Y2tFMk9VaEVWVGhPUWtSdFpsRRAB",
            "text": "This little lounge is in Little Dominican Republic. It’s a small lounge with Latin bites and entrees. I came here for a happy hour and the happy hour prices were decent. $4 beers, $8 cocktails and $8 appetizers. They serve hookah and play good music."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOaXppWTc0OV9fVUtnEAE",
            "text": "My first time at Lola Lola and Omg, Aiyana was the best and very attentive. She explained drinks and food. The drinks were whoo hooo. The bartenders on point. The food was also delicious. I will be returning...Prices were also worth it...LOVE THIS PLACE."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPcUo0TUQ5Z0puSXhBRRAB",
            "text": "The worst place to go... 50 dollars for two drinks!!! The place is very small music is too loud for the space.... don't throw your money on garbage going there"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJMjB5Sl84aXZmWkZnEAE",
            "text": "Mala experiencia ⭐️ la actitud de la mesera no es la que uno espera al ir a un restaurante…… creo que vamos para que nos presten un servicio y por eso pagamos no ha pedir regalado."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeExIUkNBEAE",
            "text": "This is my personal experience and how I felt!! My sister and I was dying for a good frozen margarita after a long day at work and we usually go to La cantina Heights which they are amazing, but this time I told her let’s try this place that I heard about on instagram and it’s literally 3 blocks from my house. We got there and they only had 3 tables with people. I didn’t see no type of decoratio beside two signs on the wall like it was just plain. The waiter seat us down and she was really nice the entire time. We got 2 frozen mango margaritas for $8 dollars and those cups were small and the margarita was not so yummy. We got 3 appetizers and 2 mojitos after that and the mojitos were not bad but the portion were small. The food was ok nothing crazy for me. We go a hooka, $30 dollars the first one and the refills are $20. They bill came out for $85 dollars and the hooka $30. I personally don’t recommend this restaurant. What you see on social media is totally different from reality. Ooh and if you buy from the happy hour menu, you have to paid cash only. Am gonna continue going to my regular spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbUwzTVd3EAE",
            "text": "I give it 1 star for ambience. Tiny appetizers, false advertisement on the .99 cent drinks. They overcharged me almost $50 and tried to blame it on me for having a good time. SO does that mean they overcharge others who have several drinks, and that's okay? hm. Definitely come at your own risk. 0.5/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvenFqTy13RRAB",
            "text": "Angel was amazing!!! So attentive and has a great personality."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvem9pVGdnRRAB",
            "text": "Angel was the best server.  Ask for him next time you come!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveHFuV2xRRRAB",
            "text": "Went here off the recommendation of a friend. The physical space needs a lot of work, it’s a small intimate setting but the decor needs to be updated. The food on the other hand was amazing. Well prepared and expertly presented. The bartender was somewhat limited. All in all it’s worth a visit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdktPaTZRRRAB",
            "text": "The 99 cent drink are not good they are full of sugar."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJLXJyenNnRRAB",
            "text": "Disfrute mucho con mis amigas"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eXJqSFFREAE",
            "text": "I think I may have found the best happy hour deal in Manhattan and it’s just in time for St. Patrick’s Day!\n\nThis wild happy hour is from 4-8pm and includes an incredible deal of just $.99 cent margs and sangrias with the purchase of a very reasonably priced entree! 🍹\n\nThey also have $8 full apps, $8 cocktails and wine and $35 pitchers! 🍷 🥃\n\nHighly recommend this spot for a group party dinner or a fun date weekday date night (or at Patrick’s day lol)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcmNDUWlBRRAB",
            "text": "We went for happy hour and honestly was highly disappointed. Our food took almost an hour to come out for pre cooked shrimp and rice. People came in after the 3 of us and got their food before us. Drinks were mid. I will not be returning."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRb2ZtbFZREAE",
            "text": "La comida es simplemente espectacular, con sabores que superaron todas mis expectativas. El servicio es de primera, con una atención al cliente al 100% gracias a JJ el bartender excelente trabajo. Todo el personal fue amable y atento en cada detalle, lo que hizo nuestra experiencia aún más especial. Es un lugar perfecto tanto para disfrutar en pareja como para compartir momentos con un grupo de amigos. ¡Totalmente recomendado!”"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRb2U3WTN3RRAB",
            "text": "If you’re looking for an incredible drink experience, JJ at Lola Lola Restaurant is the bartender you need to meet! His margaritas are absolutely legendary—perfectly balanced, refreshing, and full of flavor. You can tell he’s a master of his craft with impeccable attention to detail and top-notch mixology skills.\n\nEvery cocktail he makes is a work of art, and he always knows how to craft the perfect drink to match your taste. Beyond that, his friendly and engaging personality makes every visit to the bar a memorable one. If you’re at Lola Lola, do yourself a favor and grab a seat at JJ’s bar—you won’t be disappointed! 🍸🍹👏\n\nBest Happy Hour in Washington Heights! 🍻🍹Margaritas $1.00🍸 it's a plus!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNROHN2R0ZREAE",
            "text": "I decided to visit this place after seeing it all over TikTok. The food looked amazing, and since it’s in the neighborhood, I wanted to check it out and grab a drink with my significant other.\n\nHowever, once inside, I had an uncomfortable experience. It seemed like they didn’t realize I was Hispanic, and I felt discriminated against when I overheard them discussing a lounge fee, assuming I wouldn’t understand. They tried to charge me $40 even though I was already seated and looking at the menu. About 30 minutes later, they suddenly announced they’d be charging at the door, which made no sense since we were already inside.\n\nOverall, it wasn’t the experience I expected."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBXzdfZWpnRRAB",
            "text": "The food was good, the vibes gave aesthetic and was really good but what was cray is that their bottled water was $7!!!! $7 for a Poland spring water bottle that is sold for a $1 in the store ."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBajU2RldnEAE",
            "text": "This please is nice the music is excelent"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBaUx5RUlREAE",
            "text": "You just have to check your bill very carefully. I was charged 12.50 per drink on happy hour. 🤔"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2LWRDTlpnEAE",
            "text": "A little small but good music and they have hooka"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bFBUR2p3RRAB",
            "text": "The food, drinks and atmosphere were great.  The only negative I will share is how close our party of 12 table were to the bathroom.  Literally, I could touch the bathroom door from my seat. Unfortunately, we tolerated a bad odor after another customer spent time in the bathroom.  Additionally, I believe the pictures of the food look better than the actual plate that came out but still amazing food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ak1iM09BEAE",
            "text": "I went last night for drinks they had happy hour but they falsely promote $99 cent drinks but its only with the purchase of an overpriced entree & the only options would be frozen margaritas or sangria, otherwise the apps we got were good, service was good but the place was empty, drink glasses were small and the worse of all for happy hour anything needs to be paid in cash which is ridiculous because i had to go get cash to the overpriced atm plus bank fees etc, in my opinion not worth it & i will not be coming back its nothing special, entress are overpriced anyway."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzek1YRGxBRRAB",
            "text": "We were  a party of 20 to celebrate my mom's birthday & while we were very surprised to see how small the spot was compared to how it looks online, we had a blast!!! The ladies were very accommodating & pleasant to work with, the music was good and it felt like the spot was all ours. We all will be returning to actually eat lol Great choice"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIamRTNzdRRRAB",
            "text": "Buena comida\nBuena musica\nRicos tragos!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiazlDV0JREAE",
            "text": "This place was a vibe during happy hour. The Alfredo had jumbo shrimp and it was well worth the money. I also had their tender ribs and the passion margarita was soooo good."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycEp5UVBBEAE",
            "text": "Perfect for friends gathering or a lively date. The food is great. Music is good and diverse.The music can get  very loud at times, which is why i wouldn't recommend for an intimate date. . Hookah is decent. They only had 1 flavor (mint) hoping they add more flavors at some point. def 1 of my new fav neighborhood spots."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyOUlHZFZnEAE",
            "text": "Yummy brunch! The brunch includes an appetizer, entree, side and dessert. And 2 hour unlimited mimosas or sangria. Thank you for the awesome customer service, JJ!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydHJqWmpnRRAB",
            "text": "The food was delicious, but the waitress was not attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bXNUX1hBEAE",
            "text": "Went to Lola Lola for happy hour with my friends after work and did not want to leave!\n\nFirst of the happy hour prices are un matched, we tried a couple of drinks including the Sangria, Margarita and the dragonfruit mojito as well as the blue hawaiian! My friends ordered hookah which always hits!\n\nFor dinner, I has to try their mofonguitos rellenos and I swear ive never had a better tasting mofonguito in new york city! We also did the pasta and chofan which was cooked to perfection and ended the night with a picadera tray after all the drinks. Lol\nThe food was 10/10 and the service even better! I’m definitely coming back to try out their brunch,  but the happy vibes are a must!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbTZQT2dnRRAB",
            "text": "This was the first place we visited, our first time in Washington Heights and the universe could not have dropped us anywhere anymore special!\nJJ is the best host everrrrrrrrrr, that's him in our snap!!!!! He was so personable and funny, made some amazing drinks aka that apple martini 👏🏾👏🏾👏🏾\nAll of the food we tried was DELICIOUS!!!! We sang (off key so hold all judgement lol) at the top of our lungs and danced like no one was watching. We had such a good time here! Can't wait to visit them again!\nWe tried to come back the following day for lunch, Google said they opened at 3 but when we ubered there, they were still closed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUX3NTS2dBRRAB",
            "text": "Went after work with some coworkers it was a cool vibe and the 99.cent margaritas were great they come in several flavors. (STRAWBERRY THE BEST)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdHVDSDNnRRAB",
            "text": "It’s a trick .. there is no 99 cent drinks only if you buy an entree that is over 25 dollars. Hookah 30 dollars and refill 20. Another trick they tell me cash who carries cash nowadays. Then had to settle for $8 dollar drinks and food. I guess. They are polite and the chicken bites were good. Drinks were like juice had to get an extra shot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaW9qYmhBRRAB",
            "text": "A small location but relatively good place for happy hour as it’s 99c for margaritas lasts time I went and the drinks are pretty good. Not sure about the food. We only had the calamari and chicken bites which were fine, maybe more than average. The only downside why I won’t be coming too much here is parking. Otherwise great place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcl82V0VBEAE",
            "text": "Cash only. One person took our order. Twenty minutes later someone else came to check on us. Twenty minutes after that we got our drinks. Ten minutes after that food came out. Quesadillas were served with mayonnaise. Asked for sour cream but they don't have any….. Save your time the happy hour here isn't even worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMUtLdEFnEAE",
            "text": "Did my first brunch at Lola Lola and it was great. Our server and host JJ was so nice .Food good, great service and vibes. coming back soon, this spot was a vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6LWNyOWtBRRAB",
            "text": "I love the place, great food and service. The only downside is the place is small and it hard to find parking but other than that I love the place."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDN0l6bG9RRRAB",
            "text": "The female owner of this place went the extra mile setting a table for two despite the rain outside. My friend and I has such a blast, this was two hours before they closed and it was perfect. Great music, drinks were strong; Margaritas made with Tequila I LOVE IT. Hookah was on point! I ordered Lobster with shrimps and tostones uuuuh! It was so good my friend ordered chicken mofongo and it was delicious as well. The lady who was taking care of us used to come to our table to make sure we are okay. I am definitely going back! A great place to eat with your girlfriends or so. Try the Patron Margarita! Thank you guys! Keep up the good work! Ooh! Bathrooms were clean 👍🏼 take an Uber is difficult to find parking"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxX0xIVWxBRRAB",
            "text": "Absolutely amazing. I always have an awesome time here. The vibe here is lit 😎😎😎🎉🎊 The drinks are really good abs the food is delicious. Music is on point.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMy1qbHB3RRAB",
            "text": "My family and I love this place! Went to celebrate Mother’s Day and enjoy some yummy margaritas and delicious food. Definitely try the margarita de tamarindo!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURULWF6SHlBRRAB",
            "text": "Went there today for their 99 cents happy hour and was told that you have to purchase an entree to receive the hair hour prices. They could have listed that on their social media or on the advertisement flyer. The food portions were a bit small but the food was decent. They also add an automatic gratuity of 15% and they don’t take cards so make sure that you carry cash 😉."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5MlpHTFZnEAE",
            "text": "So just as a heads up they have a time limit of 90- Minutes. It doesn’t matter what you order or how much you consume or if you even finished your meal. It’s 90 minutes from the second you get your tab. I think this policy is outright…"
        }
    ],
    "reviews_count": 63
}