{
    "name": "181 Cabrini",
    "place_id": "ChIJkQJbFKH2wokRgm5xHrUxe4U",
    "grid": "MN12",
    "address": "854 W 181st St, New York, NY 10033, USA",
    "rating": 4.2,
    "user_ratings_total": 489,
    "phone_number": "(212) 923-2233",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMlExODJSM1ZDU21kTmNqSmFabUpYYkRaMmNVRRAB",
            "text": "While the place is nice and the service is decent, the food frankly is not very good. Had James’ chicken and it was pretty dry and some of the vegetables were undercooked, as well as the flavor not being very pronounced. Definitely better restaurants in the area, wouldn’t waste your time here"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjekxUZG9MWFJ0UjI5NFdrbHZRbW90WTBsNFUwRRAB",
            "text": "Local neighborhood place with good food. Dog friendly outdoor seating."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQU2pwT0R5LVpiYXhBRRAB",
            "text": "Really enjoy the brunch here! The huevos rancheros are absolutely spot on – definitely worth a try. The staff are friendly and relaxed, which gives the place a nice, welcoming feel. The decor is lovely too, with a stylish touch throughout – even the toilets have a great design and a bit of character. Just a quick heads-up: the bacon comes very crispy, so if you prefer it a bit softer, best to mention it when ordering."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eW9XSS1nRRAB",
            "text": "We ate dinner here and it was okay. The food we ordered was definitely reheated frozen food and for the price, was probably not worth it. That being said, maybe we didn’t order their best options.\n\nI would return solely because of the service and the drink prices. Their happy hour is great and we were served by a spry British man who really provided exceptional service. We will be returning, but maybe hesitant to order food. Overall, not bad."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMzd5Y19nRRAB",
            "text": "Great place, food is excellent ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNDQ2S2xRRRAB",
            "text": "One of my favorite restaurants in NYC! Great food! Wonderful atmosphere! The best service!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaTZuZHVRRRAB",
            "text": "Excellent place, food, and service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOVpXakJREAE",
            "text": "This is one of the best restaurants in the neighborhood. Went there last night for dinner and to watch the Super Bowl with my family, including 2 young children. The food was excellent, the service was just as excellent!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcjZTSlJREAE",
            "text": "Good food.good location. Parking is nightmare since it’s Manhattan."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc0xtT25nRRAB",
            "text": "Great neighborhood spot - Sunday brunch turned into coffee turned into HH and finally into dinner. Delicious food and drinks, great service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcFlXdWRREAE",
            "text": "Although a biased opinion simply because it reminds me of a bodega which stood here. I stopped in for melancholy sake since it was where my parents would shop for groceries when we first arrived in this country back in 1971"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbExEZ3Z3RRAB",
            "text": "Hidden gem, steps from the George Washington Bridge walkway.\nCosy, relaxing & friendly atmosphere, exemplary service, the English guy there is one of the nicest & most helpful people I've ever met, the food & coffee was great too.\nHighly recommended!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaThXTGhRRRAB",
            "text": "Great location for a quick bite with friends"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzb3R2NmFBEAE",
            "text": "I’ve been coming here since 2019, the quality of the food and customer service have always been exceptional. We don’t usually write reviews but last night they went out of their way to correct a mistake that a delivering app made. It wasn’t the restaurants fault but either way they went above and beyond to ensure we got our food, free of charge. We were so touched and thankful, dinner was great and their kind gesture made it all the better. Highly recommend this cozy restaurant. Thank you!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrdTdicWVREAE",
            "text": "Great neighborhood staple. Always consistently good. Came here on Taco Tuesday, really enjoyed the pulled pork/kimchi and steak tacos. The fish taco was okay"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYX3NfZVRREAE",
            "text": "Had not been here for quite a while but stopped in this week for a turkey burger and fries. Still as good as ever; everything I've had here has been excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudmIzQkd3EAE",
            "text": "Lovely food, lovely staff. Will keep coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMemFpQXdnRRAB",
            "text": "Good atmosphere, good food, even better beers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6Zzh2TW13RRAB",
            "text": "Great beer and friendly staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMHFiZzB3RRAB",
            "text": "Good food great service relaxed atmosphere 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUME1DaDlRRRAB",
            "text": "181 is one of those spots that has become an essential part of my Manhattan experience. The food is great, I'm particularly fond of the schnitzel with mashed potatoes; the bartenders are all talented and friendly; the beer selection is really solid, particularly if you like IPAs — and even if you don't. It's a place frequented by those of us who live nearby. I love it there, particularly when the weather is warm and you can sit outside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNExEclRBEAE",
            "text": "My favorite neighborhood place.\nReally good food, friendly waitstaff and a great place to watch soccer and other sports."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNEpDNFZ3EAE",
            "text": "Cozy, friendly atmosphere for study, drinks or lunch/dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqci0za21RRRAB",
            "text": "I love the sesame crusted tuna with wasabi sauce"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcjYzMVRREAE",
            "text": "Great stuff! Love the trivia 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbjZHM2h3RRAB",
            "text": "Like this place for breakfast especially but lunch is also good. bartender is awesome. Google has hours listed as 9am open but walked inside today and a rude guy said 10am! Turned me off a lot when what is posted is not what is honored. I like an earlier breakfast -lots of good places for brunch so maybe they should rethink this."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eF9tNEN3EAE",
            "text": "Quiet & quick neighborhood spot for brunch. Food was delicious."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5OWZHZWpnRRAB",
            "text": "Deliciosa comida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0Mk1TYVFREAE",
            "text": "A pleasant place to have lunch with a friend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROLWFLeWxnRRAB",
            "text": "Delightful local restaurant with weeknight specials, pleasant and relaxed atmosphere. Excellent for brunch as well"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURON29IMzlBRRAB",
            "text": "Nice place service was quick and food tasty"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOaXFPai1nRRAB",
            "text": "Drinks was alright, food was amazing though"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOaXF5aDd3RRAB",
            "text": "The food here is always top notch. The ambience is cozy cheek and it's a great place to hang out for drinks and a nice time with coworkers or friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNnRfVmpBRRAB",
            "text": "Great place to eat with a friendly staff!  You can’t miss Drag Bingo every last Saturday of the month as well as trivia night every Wednesday night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsc09PRWVBEAE",
            "text": "Great neighborhood bistro in Washington Heights. Staff is very professional and friendly, bartenders are on their A game, and the bar has a great selection, especially the tap list. Menu has something for everyone and the food is excellent. I go to trivia hosted by Uptown Pub Quiz on Wednesdays whenever I can, but they have great events on other nights throughout the week that bring the most fun people in the neighborhood out."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZcGZXbm9nRRAB",
            "text": "Lindo lugar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNkpDSGd3RRAB",
            "text": "Love it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad1BuWW9nRRAB",
            "text": "I like the activities there like trivia nights and bingo nights. Service it's not good at all the place gets packed and the staff is not enough which impacts the service quality.\nOn the other hand, the Atmosphere is good on those nights, everyone really gets into the games, so much fun!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNzlYTkhREAE",
            "text": "Friendly, neighborly environment. Definitely a place known for regulars. Diverse bartenders. Good salads and tacos!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNnVDaHFBRRAB",
            "text": "Loved everything service was great.  Food was delicious, wings were perfectly crispy and Tacos pork belly wa the best ever tasted 😋"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aDhmRGNnEAE",
            "text": "Great neighborhood place to meet friends for food and drinks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bmNDTHBBRRAB",
            "text": "Amazing community events and drinks, food is okay."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MVl6UTZnRRAB",
            "text": "181 Cabrini is a fantastic neighborhood spot in Washington Heights! Their food is always inventive, fresh, and delicious, the happy hour specials are a great deal, and the staff is among the best you'll find in the city. Great for brunch, happy hour, and especially trivia on Wednesday nights!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OElUczlRRRAB",
            "text": "Had a very enjoyable Sunday brunch w friends."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbWRxYTJBRRAB",
            "text": "Relaxed atmosphere, great kitchen, excellent bar. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdXBPc0hREAE",
            "text": "Love this place! Gerardo, the bartender is an absolute gem! Can’t wait to go back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvbU1mbldnEAE",
            "text": "This is an overlooked, really cozy spot with an awesome menu. We ordered the lamb ragout and shrimp tacos, both of which were beautiful and delicious. We also got the soup of the day and homemade chips which were good as well. They have…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbzc3cERnEAE",
            "text": "I Google this place one Sunday after church. I was hungry and didn't want to wait to get home to eat. My husband and I ordered eggs and in all truth we were very happy and impressed. It was better than I expected. Definitely a find. I am an…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZX0ptMzJBRRAB",
            "text": "Seriously good food, like, one of the best meals I have had in the past year. Wonderful service and stellar cocktails as well. All round, this place is brilliant."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvbU5qSW1RRRAB",
            "text": "*Weekend Brunch Review*\n\nIf there’s one thing I love most, it’s consistency. 181 Cabrini never fails at…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZcGZUcndnRRAB",
            "text": "This was an easy going spot with good food and friendly staff. I visited for brunch with a friend and really enjoyed the food (esp huevos rancheros, coffee and brunch cocktail). I ordered the granola dish that came with fresh chopped fruit…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVOEtTU0VREAE",
            "text": "Great tacos! Portions are a little small for size. Got both chicken and beef, but I'm going to have to go with the beef tacos. It's really well seasoned!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dnNDbFFREAE",
            "text": "Great place (5/5), but meal was just mediocre, (2/5 at best) piccata was just anything but piccata, actually more like a schnitzel.\nIt was so much fun to draw on the ‘tablecloth’. Awesome idea!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydlpiM1p3EAE",
            "text": "Found this place while on a bike ride back into NJ and waited patiently for the kitchen to open back at 4:30 pm. Our orders were taken yet, two other parties that came after, BOTH received their orders before ours."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNanV2ZExnEAE",
            "text": "ULTRA EXCELLENT FOOD AND EXTREMELY DELICIOUS!\n\nThe staff is friendly and wonderful"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBN3R1N0lnEAE",
            "text": "Great drinks and food with friendly service. Pleasant crowd to be around. The sangria was delicious. Go there."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMjZ5aVZnEAE",
            "text": "The blue berry pie and villain ice cream was to die for.  The ginger bear is so delicious I had to order another one.  😋…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaUtfTWxRRRAB",
            "text": "I have been here twice. Once for dinner (they have an outdoor area)and 2 days later for lunch. The food was good as was the service and I recommend it.  Lunch was the Saturday before the Pride March 2022. The restaurant  hosted a Drag Bingo show. The place was packed. The Queens were funny & lipped synced &  danced & in between they called Bingo. It was a fun afternoon. 👍"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNWZ1STdnRRAB",
            "text": "This place is becoming one of my favorite places. It's not very traditional and I like that about it. Staff is friendly always. You can tell when you get your food that the ingredients are fresh and it was made just for you. Prices are…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbWZUTHRRRRAB",
            "text": "Quaint and fairly quiet atmosphere—very “lofty” with antique-ish wood.  The food is good and menu is generally a mix of American type dishes with nice starter salads and basic appetizers.  The service is on point too.\n\nI’d go back again.  The location is nice."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzZ19udUJ3EAE",
            "text": "Great neighborhood spot\nRecent take out: Tues pm 2/10/2020\n\nThe bartender was very kind on the phone answering all of my questions and creating a nice vegan plate for my guest who was sick.\nVery patient and Upbeat.\nNever made me feel rushed.\nWhen I arrived to pick up I saw she was super busy and the only person serving the bar and tables.\nShe was still absolutely great and brought everything to me at the door so I didn’t have to leave my dog.\nGreat customer service\nAbove and beyond\nThe food was perfect."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNXA2dUx3EAE",
            "text": "Lots of coffee choices.  Clean little corner diner with Williamsburg prices. Nice armosphere."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwd056OFdnEAE",
            "text": "Second time here... the same... 30 minutes a meal 👎 someone arrived later than us and got food first. Definitely won’t come back…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdThPc1BnEAE",
            "text": "I really like this place. Omelettes are wonderful, my gluten allergy is a non-issue, staff is very friendly and laid back, coffee bar is self-serve so you don't even have to wait one minute to get your fix, and they offer free coffee…"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURneDRUNDVRRRAB",
            "text": "Excellent food and great drink specials! Best tasting homemade sangria I've ever had! Tonight was pasta night, so the server helped us pick out some delightful pasta and sauce pairings. The atmosphere is pleasant with some beautiful local artwork. Definitely returning."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyajZPazhBRRAB",
            "text": "Very welcoming and warm staff as soon as we set foot in the place. Tasty food and very good Sangria. I will definitely recommend. This is a great late night, after a party spot."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJNHQzZlVREAE",
            "text": "The service is great and the food is very good. They have brunch on the weekend. Table seating, but you can also eat at the bar counter. Weekdays breakfast you can sit at the tables, but you have to order your meals at the bar counter. They…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHM2MyU3BnRRAB",
            "text": "Had dinner here twice - both times excellent.\n\nFirst time had the 181 Cuban Sandwich and the Fried Brussel sprouts. Both were fantastic. I would go as far as to say that was the best Brussel sprouts I've ever had!\n\nSecond time I went with the Schnitzel which was one of the best I have had outside of Austria. Meat was perfectly cooked."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzcFpyRW1nRRAB",
            "text": "Very friendly servers and great atmosphere. I recommend anyone to come here and have brunch with their family and friends. It will leave you feeling filled and happy. Amazing food and great options. Prices are okay but most importantly it is worth it."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcmRLUy13RRAB",
            "text": "A lovely neighbourhood bar.\nThe laid-back atmosphere, together with the barman's 'ready for a challenge' attitude is what makes this little place one I visit with each NY visit.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrd2VQSHVnRRAB",
            "text": "I always passed by this place before but never went inside, until one night  and i don't regret it I had the best Cuban Sandwich ever with delicious fries! wow the mozzarella sticks are amazing also the Tapas, the price is great and the waiters are always friendly and the service is fast! why go to downtown? this is my spot now!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyal91RXF3RRAB",
            "text": "I love this place! Been here a few times. I appreciate the service and food and drinks are really good. My personal favorites Brussels Sprouts, Wontons and fish tacos. The Red Sangria is delicious. Overall great place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRLVlTYl9RRRAB",
            "text": "While the food was good, our waiter ruined our whole experience. He was an older gentleman with glasses and clearly hates his job. As soon as we sat down at our table, he berated the bus boy in front of the entire restaurant - it was awful…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURneG9qZDZBRRAB",
            "text": "This is such a cute little cafe. We sat at a table by the bar, just ordered drinks -the barman was so kind and accommodating.  We didn't eat anything but it smelled great the sangria was great and the virgin drink we ordered was so refreshing. There are tables inside where people were sitting down for meals"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cWZLY19BRRAB",
            "text": "This is THE place to go for brunch in this area. The french toast is so good, it should be illegal. Little muffins are amazing.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlay0tUTNBRRAB",
            "text": "Excellent customer service.  My favorite spot in Hudson Heights."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLc0xieGVnEAE",
            "text": "I went in here for lunch and the sandwich I had was okay but the place was FILTHY!! Disgusting bathroom, no paper towels, no hand dryer and the service was nonexistent. If you’re thinking about going here don’t. Walk across the street to a better place.\n\nI just saw the owners response to my review. First off, you’re in the business of making money, apologize to me as a customer for having a horrible time in your dirty restaurant with horrible service. No one should go and spend their hard earned money at your place. I can’t wait until you close and a good restaurant/bar opens."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dWZIcGtBRRAB",
            "text": "I had the chicken zanny sandwich, it was pretty good. I'm not big on eggs, so I can't say much about that side of the menu.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVMV8tVGlRRRAB",
            "text": "Had a late Sunday brunch with family. We were a group of three and sat upon entry... no wait. We each ordered something different and we all enjoyed our meal. We were not rushed at all and this was a pleasant experience."
        }
    ],
    "reviews_count": 79
}