{
    "name": "Floridita",
    "place_id": "ChIJJZEViZ_2wokRgvvjktJT_B8",
    "grid": "MN12",
    "address": "4162 Broadway, New York, NY 10033, USA",
    "rating": 4.1,
    "user_ratings_total": 1293,
    "phone_number": "(212) 928-0653",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0M1VGcE5UV2h0UkdZdFMwdEtOVlZRYjBreFJWRRAB",
            "text": "I ordered from postmates and they had an offer for buy one get one free boneless chicken chunk meal. Not only did they not follow simple instructions for my order but they didnt bother to call to inform us that certain items were not available. I received one small order of chicken chunks, I didnt receive the moro I ordered instead they gave us white rice and beans 😕. (It was literally printed on the receipt.) With the smallest pancakes imaginable🤨. Its clear to me that whomever was working there didnt give a damn about anything. This used to be my favorite place to order from but times have certainly changed ☹️"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdlgyTndOSGszU1VaT1JUZFhTbnBNVDFKMWFHYxAB",
            "text": "I ordered food for delivery and 2 and half hours passed and I was still waiting I called the restaurant and was told that they were sorry and would start prepping my food i ended up canceling my order and ordered from somewhere else"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oblVFcFlORU5yUVdzeVFXVlljazl2WjJocVlVRRAB",
            "text": "This food is Top Knotch. Best lunch specials in Washington Heights."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWVpDMWtRbHBCTFMxelpTMU5OWEJRY2tRMFUyYxAB",
            "text": "Uff delicioso mondongo con arroz"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbVNVcEtaR2RxYjI0d2NFNVdiV0ZEZUZWalJXYxAB",
            "text": "Food is great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5b1VXcEtNMlp0V2tSb1VrSkRiV3ByU2t4RU0yYxAB",
            "text": "I had a incredible experience here! After a hectic week of NYFW it was super refreshing to sit down and have such incredible service!! The food was delicious and very very affordable!!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNlNGUkhXR2wyWW10T01HTjJUM0Z4Y2pnd00zYxAB",
            "text": "Me encanta el   sandwich cubano!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWFZUQXpkbTF2VFc5eU9HbE9RVzV0U1dGMFExRRAB",
            "text": "Dont order for delivery. Order takes more than 2 hours to arrive"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNVQyVlZlRlU1VURoMk9WOVVaR2x4YkZkTlRuYxAB",
            "text": "I went because I was looking for a 24-hour restaurant. Had steak, that wasn't that fresh. The tostones were fine. The attitude of the older blonde lady sucks. She was despondent most times, and said something in Spanish to her coworker then laughed when I asked where the bathroom was. It was a weird vibe after that, then I left."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdlNFRmhaMEY1TVhaSE0zUkRZV2xaTkhGb1FuYxAB",
            "text": "I ordered over the phone today Mabel took my order over the phone.  This is the problem with all the Spanish restaurants the hire all the wrong people.  They have time to talk and gossip BS about everything in life.  They do not take a moment to acknowledge a guest.  I sat there for 20 minutes not once the cashier Mabel acknowledged me. I love the Cuban sandwich but I come here once a month just because of this service.  They really need to focus on the service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMWR6Wk9iamsyV1d4a1RqYzJWMkZ4TkdwWlQyYxAB",
            "text": "best cuban sandwich ever"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204elJEZHZVbTAzVmxSemFtSmZTV1ZzY0dWT1dXYxAB",
            "text": "Good food, ok service, ambiance was ok. I would definitely recommend for take out as dining can be challenging."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRFRHb3pYM0JMY25CS1dWWkVjVWxZYkRBeFJtYxAB",
            "text": "was very disappointed with their breakfast. it was genuinely tasteless. on the plus side, the food does come very quickly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneldFdFBTVlZYUlhWTk5HNDFhRzl5TWxVd1ZrRRAB",
            "text": "8/11/2025\n\nFood portions are horrible. I had order 2 combo 4 boneless chicken chunks with rice and beans. They had given me a full plate of rice, the chicken chunks weren’t even filled to where only one person can eat the chicken by them selves.\n\nThey had the audacity to say they weren’t going to fill it up but give me another small plate to where only one would be filled. They also gave me a small coke and sprite that two people can drink alone. I was feeding a family of 8. For such portions and pricing it is a disgrace how they could charge me 70 dollars for itty bitty amount of chicken. The lady name is Maricela. She could’ve simply apologized for the inconvenience and filled both plates and went on bout my day.\n\nThe server even said it her self that multiple people have came and complained about the portion. A couple came and even thought that for one combo is worth $12.\n\nThey refunded me my money and lost profit that day that’s on them if you ask me.\n\nThe 69.98 is the refund the 70 is what I paid"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRM1h6UmlhekIxYXpKWE5USkZhelozY1RSNFkzYxAB",
            "text": "Tipycal Dominican joint. Solid Food, Fair prices. Excellent for comforting food after a night of drinking."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRVoycHdSVmxPWWtOb1l6QldRM0l3ZUY5NFowRRAB",
            "text": "The Asopao de Pollo always hits right. The ladies are so friendly."
        },
        {
            "date": "수정일: 3달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZenNMaXpBRRAB",
            "text": "Bueno"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NVVVSmljVFE1YUVadVdWcG9jR0ZxTjNOaVNWRRAB",
            "text": "carne en salsa estaba dura y seca, pollo al horno reseco. Las papas fritas estaban muy buenas, todo lo demás no repito otra vez"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcU9VaHRZemhhUmt0SFRUQjBSMkZWZG10NVMwRRAB",
            "text": "Called and spoke to the receptionist she had issues with the system. Had to answer my number three times. I had to repeat it three times took my order. I asked her for the total and all of a sudden she hung up the phone. Better customer service\n166 Bennett Avenue wrong address on the paper and the delivery man called me to say if i had to come downstairs to pick up my food. I advised him the address says 5H. I won’t be ordering from here again"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NWRHUlBnEAE",
            "text": "once a group of younger guests came in, the vibe completely changed. The bartender became distant and didn’t really engage with us. Most of the conversation around us was in Spanish, which made us feel a bit out of place since we couldn’t understand. We ate, stayed briefly, and decided to leave. I don’t appreciate being made to feel uncomfortable—I wouldn’t return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWk9USktUM3BCTlVGNlZsbDRWa2xwTnpsUE1uYxAB",
            "text": "They should talk about people in Spanish if they are not sure they the language. Bruta"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMVlsZHpkR0UwUlRsVFowaGtTR0ZQYUhkbFYxRRAB",
            "text": "Never delivered the order had to cancel."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLLVBpOS0xa3RmN3ZBRRAB",
            "text": "The food is absolutely amazing!!!!!! Whatever you get will be a treat to your taste buds!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQS3Vpckd5bVBlUGhBRRAB",
            "text": "So I ordered a fried red snapper con platano maduros. I had to wait for over an hour, but know what? It was WORTH IT. It was a big fish and it was cooked perfectly with barely any bones. The platanos were delicious y sabes que? Valia la pena! I’m definitely coming back again! Oh but please be aware of their busy hours, it can take a while to get your food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VFRUVkdVMEpUVFVwaFMxWlljRWRLVlRsaVVsRRAB",
            "text": "Wanda is just the best waiter I’ve ever had she gave me and my family an amazing experience wow!!! Thank. You Wanda"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNNnd1dFBNbl9pRDd3RRAB",
            "text": "Wanda is the best waiter she has been our favorite for years she is very nice and respectful just wow she makes it so much better"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKN3Y2WTI2M09MVGF3EAE",
            "text": "Excelente servicio muy linda atención de los empleados especialmente damerky me gusta mucho su comida 👍👌🏻…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQVDEtb3UtdU5YRHpRRRAB",
            "text": "Awesome food and everyone is cordial. Don’t think just come."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLYlY2N2JXc3ZmeERnEAE",
            "text": "Excelente servicio,  muy buena la comida y las chicas muy atentos. En especial wanda y emy"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKNm84dm1PNDdIdUh3EAE",
            "text": "Wonderful staff and delicioud food!! Wanda and Maricela are the best of the best! Food is amazing and at a reasonable price!!!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcVExWkpaMWhwUjNCUlkycENaRGwwUVRaa01YYxAB",
            "text": "Excelente 👌 servicio en todo, sobre todo Excelente higiene, me encantó lo rápido k me atendieron y la decencia osea humildad con que te tratan te hacen sentir como en casa, Excelente servicio. Att braulio portes"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ObGMwWk9URjlhU0hrMVpsQkRhSE5UZVdONlRWRRAB",
            "text": "Excellent service but Wanda!!!\n\nGreat food and fabulous atmosphere"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ScmJsUkxSQzFmZGs1TlFVaERUWEJXY2pOM2FGRRAB",
            "text": "Good service love the food!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcnY0TlBPNzhuNzFRRRAB",
            "text": "Excellent service food great and the attention is incredibly good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLRGc5cF9ja01PNkh3EAE",
            "text": "The food was amazing, excellent service and warmhearted servers. Recommend to everyone and anyone!!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMFVUUmxaSE14VkZwRlZYVnBabnBTUkRCRVJGRRAB",
            "text": "Wanda La Mejor 💚 un servicio excellente , Muy buen Restaurantr"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOSG10SUM0cFBxRk13EAE",
            "text": "Muy buen servicio, las chicas súper agradables y atentas, la comida deliciosa, volveremos a repetir."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWVpFMXVNVEYxUzA1Rk9GTnhhMEpXVTNaMmFFRRAB",
            "text": "Muy buena comida y el servicio excelente, el ambiente muy agradable"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKQ2FwOGVHbDZ1X0ZnEAE",
            "text": "Waited 45 minutes for food. No water refills during the wait and no communication. Then put gratuity on the check for 3 people"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLTGl1OV9IZzZpYzNnRRAB",
            "text": "First of all, this is not a Cuban restaurant. This is a Dominican restaurant trying to have both cuisines. The food was extremely salty and the restaurant needs an upgrade of fresh paint and clean floors. The whole night I was drinking water because the food was so salty. I even told the waiter. There was no seasoning taste to the food as well. The tostones were not crispy and the maduros were disgusting and greasy. I will never return. And, they automatically charge a 20% tip because they know how bad their food taste."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNWGFvOHFna3N2YjRRRRAB",
            "text": "Nice food and quick service, as I was double parked. The plantain was my favorite dish."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPcndvNWlQMl9qUGVREAE",
            "text": "I work nights and went to make a to-go order to try their Cuban sandwich based on the glowing review from Eater. Ordered the Cuban and fries. Honestly, the sandwich was mediocre at best. It could be that it was cold because the sandwich sat in the bag for 15 minutes because they forgot my fries. I'm guessing they forgot the fries twice because I'm not exaggerating. It was a good 15 minutes and there was literally 2 other customers in the whole place and were already eating. And truthfully, even if it was hot and fresh, it wasn't particularly flavorful. Had I hopes but I definitely won't be returning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNdkl2cVdLMzR5ZmNBEAE",
            "text": "The food takes forever to get ready. They mess up my order half the time. I've had a variety of the food many times and sitting in person and ordering online takes too long that it's not worth it. Will not be eating from here again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYVhfWjZpcWR1MlBnEAE",
            "text": "BEN EATONG HERE FOR OVER 30 YEARS, WHEN IT WAS IN THE CORNER!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKekF4LXpYN092UkxREAE",
            "text": "They don’t speak English so the lady wil just hang up on you when your calling to place the order. I feel bad for the owner his losing so much money with her."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaVBYMHN3RRAB",
            "text": "Buen servicio turno de la noche\nExcelente maniller Pedro 👍"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeU9pTG1RRRAB",
            "text": "El mejor servicio y comida en Manhattan el verdadero sabor latino ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaU5mNXJ3RRAB",
            "text": "Good service on the night shift, very friendly waiters and manager Pedro"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaU9maGpBRRAB",
            "text": "El mejor sándwich lo hace Pedro, solo pregunté por el en la noche, me lo agradecerán."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaUllX1p3EAE",
            "text": "El mejor lonchero del turno de la madruga Pedrito"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzc3E3b2dBRRAB",
            "text": "My mommy wanted something quick to eat. I ordered takeout, but I really wanted to eat there. They had options for you to choose. The food looked delicious and the place looked clean. I will return to eat in."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMTRhZXFBRRAB",
            "text": "Good food! Would recommend the pastelitos! Personally don’t speak Spanish, abut the lady in front was friendly. Was confused where to order when I came in. If I happen to come back, I would definitely try other items on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsOHFlbXlnRRAB",
            "text": "Stopped by for a quick bite before a concert at the United Palace.  This place moves a lot of takeout.  The food was very good, the pork in the cuban sandwich was a bit dry but still tasty.  The chiccaron was crispy and the rice and beans were satisfying."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0eE5uNmVBEAE",
            "text": "Ok ok ok my regular spot to eat is under construction. So I decided to try this place out.  99% same food. The atmosphere and 'look' is definitely 5 stars.   The food did not win me over.* The chicharron and pastelito de queso is definitely gentrified. It's too pretty and not the normal cheap, greasy, and sabroso did that everyone knows. Service, I felt a bit ignored. I saw 2 tables get their food before me. I definitely think there's room for improvement. Will I return? Maybe. Or until my regular spot reopens after construction.\n\n(* I did not try their 'Best Cuban sandwich')"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc0tHMjZnRRAB",
            "text": "I really love the food here, but the morning service needs serious improvement. On two separate occasions within the same week, I stopped by in the morning just for a simple toast, and the server responded dismissively with, “The sandwich man is cleaning,” then continued doing other tasks without offering any further help or clarity. No acknowledgment, no alternative, nothing. Based on other reviews, it seems this kind of attitude is a recurring issue. It’s disappointing when great food is paired with poor customer service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMUlPOVRBEAE",
            "text": "I came here at midnight on a Wednesday after watching the play “Mariposa de Acero” at the United Palace. My friend and I both ordered the sancocho with rice, tostones and avocado. It was delicious and had the perfect amount of víveres and meat. Don’t expect to get great service but if you need something just wave at your server and they’ll be right over. They also take a while to bring you the bill. Bring a hardy appetite and some patience."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZdXJXbVpREAE",
            "text": "Food was as authentic as it can get. The asopado was well balanced and ambundunt. The restaurant was clean and had a great vibe as it has a bar playing music and equipped with tv's. Highly recommend it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIblp1amFREAE",
            "text": "I could sit here all day and watch these wonderful ladies scoop up lechon, pork, mofongo, moro and heap spoonfuls of sugar into coffee. What a gem. Their food also happens to be the tops! Go as soon as you can. Hoping this review gets its own poster, like the one they have of Stephanie G’s in the store."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1aXRxdFdREAE",
            "text": "We went there after a concert. The food was already prepared, but it tasted fresh and delicious. Thank goodness because we had a long drive home. The server was very pleasant. It was our first Dominican dining experience. The vibe was very cool, and they have a bar in the back of the restaurant."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3MG9pNFdnEAE",
            "text": ". Hit or miss spot amongst the 6,354 Spanish restaurants that flood the uptown streets. Cheap eats.  The key is to get there when the food is fresh. I mostly if not always just got a lunch special of white rice black or red beans and baked…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBd0lhUnVBRRAB",
            "text": "The wait for our drink and food was way more than what you would expect for a restaurant that was not that busy, there were a lot of open tables. I ordered a mamey smoothie which took a long time and when i finally got it, it had dangerously sharp pieces of mamey's shell (almost like the one from a brown coconut) i was lucky i didnt swallow any of those pieces because they were pretty sharp. After 30 minutes of waiting we finally got our cuban sandwiches which were really good. The other food on the menu was a bit pricey which i dont mind because it is NYC but  most of it was already prepared sitting in warmers. I do mind paying alot for food thats been sitting there longer than i have. Overall is ok but not great. Service could be more accomodating to the customer. They had many tvs with programing noone was watching and we asked for the billboard awars show that was on telemundo but they ignored us twice. I rather drive to North Bergen for a better cuban dining experience."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNGZhWnZBRRAB",
            "text": "I ordered from this place from many years and i never had a problem.  Today I found a cockroach on my food.  I called the restaurant to talk to someone about it and the woman that answer the phone started to argue with me and told that I…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvZ2RxbmRREAE",
            "text": "Floridita makes a great chicken sandwich, but unfortunately, today I went in person to order, and the person who makes the sandwiches was previously counting register money from the shift prior. Instead of washing his hands afterwards, he did not but just threw on gloves. I informed him this was very unsanitary. Does this place know how much bacteria money carries? This was very unfortunate, and I hope the owner addresses this; throwing on gloves does not mean hands shouldn't be washed, especially in this case. I told the person to forget about the sandwich. This probably happens often, but when you see it, forget about it, disgusting!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJZ1p1ci1nRRAB",
            "text": "Went to eat it there, place wasn’t even crowded. Waited for ever for a sandwich. When I finally got it, food was cold, servers will see customers but instead would rather gossip with each other. Never coming back here"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5NGZmbklREAE",
            "text": "This place is a hidden gem. OMG great servers great food and it's 24 hours. Get your dominican Cuban fix here at 3am or 3pm. It's all amazing food!!! Bookmarked for the next time I'm in the Bronx"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcnFEcUxnEAE",
            "text": "I came here looking for traditional Cuban food, specifically for a Medianoche (iykyk). Having grown up eating Cuban food, I was unfortunately let down - the bread was over-crisped and the mojito/pork combo just didn't kick like a good Cuban sandwich. The staff was very kind and our waitress brought us delicious chicharrones that weren’t on the menu. In general, the food was very tasty and affordable. But it was not \"The Best Cuban Sandwich.\"\nThere is a cute, fun bar in the back and the decor is still true to old Havana. Definitely feels like a relic of a previous generation."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMm9mamhRRRAB",
            "text": "Great food good people atmosphere was awesome"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bkxpZ1dnEAE",
            "text": "Yo\nQuiero q me\nDigan si eso es un mangu? Con ese plátano entero. Puré de papa aguada."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3LXNYZ2pBRRAB",
            "text": "Near little cafe around the corner from United Palace. They have a nice menu for for and a few beers to go with it. I had a club sandwich and thought it was pretty good. My buddy had the Cuban and liked it a lot. This seems like a place…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwXzU3bGFREAE",
            "text": "very spacious, clean, very organized consequently fast service."
        }
    ],
    "reviews_count": 70
}