{
    "name": "Inwood Farm",
    "place_id": "ChIJy1euYgPzwokRh0HmWpSAF08",
    "grid": "MN12",
    "address": "600 W 218th St, New York, NY 10034, USA",
    "rating": 4.4,
    "user_ratings_total": 1075,
    "phone_number": "(212) 884-2111",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NE1XRXlObk55UlZGSlJVZzFXRXc1VTBsb2FHYxAB",
            "text": "Fantastic spot for date night — cozy, warm, inviting.  The food was absolutely delicious.  We had the burger and rigatoni.  Both were great but I’m still dreaming of the rigatoni ❤️Staff was friendly & helpful.  I would definitely go back and recommend to others.  There is also a coffee bar & charming outdoor seating area for warmer weather.  This place is a gem."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNldFVjNlVUl5WlVONldEbDVRVTR3V1dKMGFIYxAB",
            "text": "There is such a great atmosphere and the food is so delicious. I really enjoy being here and the new host gaby is wonderful. Also archy is so adorable and makes it feel like homie. Great experience here."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNGRWVXpjSGhrTlZjdGR6ZHZaMkZ4YkZKZlVFRRAB",
            "text": "Nice bakery the works are really nice and the pastries are really crispy"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaGVreHRNRlp5YVhsNloyWkxaSG94U2tobWJGRRAB",
            "text": "Decent food, but very rude service"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWGNVVklaVXhVV2tWd1ZWazBVVkZzVGtsTU9WRRAB",
            "text": "Visiting friends from out of town we decided to give Inwood Farm a try. I requested a table at 12:27pm. We were informed by the hostess it would be a 30 minute wait. At 1:16pm I asked for our table at this point i saw 2 tables available but the hostess stated those were already reserved but we are next. At 1:48pm after waiting over a hour in the cold, fasting all morning and falling behind our schedules (church, kids at home etc) We asked  the hostess again and explained I have an infant waiting at home. We were finally seated at around 2pm\n\nNot sure if they purposely reserve their tables for their favorite locals or if the reason was because my friends and I were the only ones during this visit of different skin color but we felt we were not treated with respect .\n\nThe brunch meals…\nThe avocado toast was very hard and cold also did not taste fresh my friend would not recommend she did not enjoy the hot chocolate\n\nThe traditional eggs Benedict was also very hard , cold and not worth it for my other friend\n\nThe Farm burger - I had this myself honestly I’ve had better burgers this was mediocre\n\nStuffed brioche French toast - my friend really enjoyed this\n\nWe were not given a drink menu until we asked\nWe paid around $120 and honestly the service was very poor, the quality of the food was not up to our standards.\n\nWe really wanted to love this place and show our support we are all Inwood born natives but some of us moved, have families or have not been to this shop in years. I would not recommend to others the atmosphere was very loud, strollers, dogs and kids in and out. Very disappointed overall"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kc1VYWnhjWFppUlZNNVJuaFZkVWR0YzJOYWNrRRAB",
            "text": "We came as a walk-in on the weekend. We were told the wait would be 30 minutes, which is understandable for a large party. We watched as multiple tables opened but none were being put together for our party to sit. When we were finally sat and ordered, our order of pancakes came still raw in the middle and our chicken sandwich came with bones. It’s clear that the staff is not trained properly to run the establishment, as empty tables sat without being set and drinks came out of order. The only thing keeping this place running is the location."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NE0zcDFhMkU1TlZJMVNFZFZWazVIUmtOaldIYxAB",
            "text": "Absolutely loved this place! The location is stunning, with plenty of tables both inside and outside, and it’s more than dog-friendly — pets are clearly welcome here. The atmosphere is warm and inviting, and the staff are super kind and attentive.\nParking is very challenging, so I’d recommend walking if you can. There’s a beautiful park and river just across the street, which makes the setting even more special. Definitely try the mac and cheese with beef — it’s a must!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTVFqUTBVemRVT1RSRWRFRlRlbUZ1YkZvMlRXYxAB",
            "text": "Great service and food was delicious....had the calamari, wings , and the farm burger. Super delicious all round."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVFpuWkRSRmd3ZHpKWFUwbDNkVjlTYmpSeU5GRRAB",
            "text": "Excellent location for a great meal and a drink  A nabe favorite"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poc1pFZDZkbVZzT0RsWk1ITm9NVzU2Vm1WelpuYxAB",
            "text": "Only giving 5 stars for Leticia, she was the most awesome waitress, she helped more than the hostess (which didn’t seem very happy to be working there on a Sunday morning) food was good, came with my family after church. Family oriented…"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RFJVdHBWVkZFU0hWbGNFSTBNV0pQZHkxRmMzYxAB",
            "text": "I've been to Inwood Farm several times, making the train ride up because some places are worth the trek. The hangar steak alone is reason enough to go — it's perfectly cooked every time. Tom, the owner, has that rare quality in that he makes you feel genuinely welcomed rather than merely accommodated, and that warmth is also true for the staff. Yes, there's often a wait, but it's worth it. The brunch gets most of the attention but try dinner as the food is just as excellent and the space feels relaxed with good music that is just played at just the right volume. You get the sense that everyone, from the couple on a date, to the family with kids and the solo diner at the bar, belongs here. I find myself recommending Inwood Farms without hesitation, even to friends who balk at leaving their own neighborhoods—which in Manhattan is saying something."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNLTZyZ2VREAE",
            "text": "Great meal, cozy atmosphere and friendly staff! I have been up here 4-5 times and recently discovered the menu changed. Wonderful options and the food came out fast. I highly recommend for a relaxin evening with great food!\n\nAdding to this review-was recently back and had pasta con fungi and my friend had the hanger steak-both were phenomenal"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMmNFVjVWSEJyT1V4bmJrNTFMVGhhZWtwWUxVRRAB",
            "text": "Over priced mediocre food. The food is really nothing special honestly. Some staff are friendly but some have an attitude problem. Especially the Spanish heavy set one who works as a waitress. The owner is friendly to whom he chooses; others he just pretends. Real shame since this place has so much potential ."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trME5rdGxWM2xaY1dwU1dIRkxTRGQyU1RSSGJFRRAB",
            "text": "The baristas need to have better customer service. You never know who’s listening and seeing how you guys are treating a customer. A customer wasn’t satisfied with the quality of the drink and one barista said out loud to the other, it’s going to taste the same. Maybe they need to be re-train on how to make better quality drinks. The drinks aren’t free nor cheap! They’re plenty of coffee shops in this neighborhood. Be nice and treat customers with kindness."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyZ01HVk9nEAE",
            "text": "It was ours first time eating there, staff was welcoming and friendly food was excellent served fresh when ordered. We will be back again. To try something else. We ordered farm burger, fried artichoke and bourbon chicken wings it was delicious."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzek5qRlRUMGxEVFdsWlRuTkNNREp0VUV0eVQzYxAB",
            "text": "First off, I have been coming here for almost close to four years. I live in the neighborhood so it’s a place that I go 2 to 4 times out of the month. However, as of late the service has been slow and inattentive. Many would say well if the service is bad why continue to give them your business. I’m trying to look at this as you’re my local eatery that normally did give wonderful service compared to the other businesses on Broadway but now it’s just turned into take the money and run because of the price point of the menu. That being said if I go alone and spend almost $100 for dinner on a Sunday night, I expect to have a bit of service and at least one check back from my server at the very least. And maybe a hostess, who wasn’t reading when I entered the door so I was made to feel as if I was disturbing her from not doing her job. Yes my last three visits there was a 3 to 5 beat before the hostess acknowledged myself or me and my guests because the hostess was engaged with her book as per usual. And that is exactly what happened. My server, though friendly and pleasant, took my order. It arrived, but sadly, there was no second check back. That means if you need pepper, vinaigrette, what have you and the server doesn’t check back for at least 10 or 15 minutes by the time you need something for that order you were pretty much finished. I asked for pepper and ordered a cocktail to which my server then got engaged with guests at the bar and completely forgot that I was sitting there. They got a bit busy and she got a six top so clearly she forgot me not to mention every time she crossed the room, there was nothing in her hands nor did she acknowledge me. My server in the end was the bus boy and the bartender whom I did express my dismay. I am not over the top or high maintenance but regardless whether it’s one person or three you’ve got to do a second check back in less than five minutes after you’ve dropped food otherwise what’s the point? And again if I’m going to spend close to $100 just around the corner for my house and I come there how many times a week I expect a little service. I’m one of those people that seriously does not write reviews, but I’m throwing folks under the bus because you gotta tighten up. Stop assuming we’re all loaded because we live in this neighborhood. Most of us are folks who work more than 10 hours a day and when we come over to your café, just wanna have a nice dinner to reward ourselves for the work we’ve done all freaking week. At least that’s what I was trying to do but I digress. I understand this is a relaxed, casual atmosphere but relaxed doesn’t mean take my money drop my food then walk away and never come back. Yeah I don’t think that’s how that works. Just saying…..\nI do hope you take this review in consideration."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Sk5HVmhiek5wYXpkeVJtdFBhVTlQWjJWT1FXYxAB",
            "text": "Food took at least 45 min to come out. I saw the same issue with a few of the tables near me too. Once it finally came out, the food was cold and fries were already cold and soggy. Not sure what was going on in the back but definitely will not be coming back."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdk96b2N3EAE",
            "text": "Good delicious meal - try the banana pancakes! And the burger, and the rolletinni, and the drinks, and the brussels sprouts, and seared tuna, and…."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GR1EwYzBZMjlqZDJ0TmVVZFpiRzgxYWxaR1VXYxAB",
            "text": "Wrote my confirmed reservation for my bday on the wrong day in the hostess' book. Eventually left after waiting 30 minutes for a table sue to their mishap! Will not be going there again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neVV5MVRjWGRHZUdkVFRuUXhjVzFuT0cxNFdWRRAB",
            "text": "I was excited to try this spot for a minute. Arrived at 340PM on a Sunday to try for brunch and was told that brunch was not being served currently as they were taking a break from the kitchen to reset for dinner. I told the host the menu states brunch until 4pm but she couldn't answer. We waited 15 mins to be sat and the server poured water and walked away. I waved another server down to take our order. She basically took our order and never came back to the table. Server was eating at the bar, Socializing and did not come to check on us. Basically needed water, additional menu items but the service is terrible at this location!!! Wings tasted old, the fried mushroom dish with the cornbread waffle tasted bland and dense. We wanted to leave but it was a little late. Definitely will not recommend this spot at all! Food is bland and service is poor!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRWNGcHJSR2hsWVhKSVdqbEtaMTg1TUROVmExRRAB",
            "text": "The pasta con fungi is absolutely delicious! Highly recommend this place for a cute and casual evening date night or a night with friends!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210YWRsWTNTbGRoVW14UFZsQldNMEpsTVd0SFNHYxAB",
            "text": "Food is ok but expensive. 18% for tips is the minimum while the service far from even 15."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWFFYSlhWbGwzYVVGQ2JHSTBPV281TFhsVE1VRRAB",
            "text": "The food was great, I ate here twice in the atmosphere is incredible...I will become a regular"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMFZHSjVZeTFCYlhNMU4xVllRVTl5UWw4M00wRRAB",
            "text": "They have the best burger, \"Barbeque Brisket Burger\", which is only available during dinner time. So do not be confused with farm burger, that's a different burger."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbVpXUkJOSEIzUkVwWFRHNWZOM0F5YVhkU1ltYxAB",
            "text": "Good food, conveniently located next to Inwood Hill park."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoYWNITnNPVk5oZVdNeU4yaHJOVEp1Y0RoWllWRRAB",
            "text": "The fanciest venue in Inwood? I believe it is. The place caught my attention the moment I walked by.\nI ordered a burger, and it was quite good.\nThe interior is well-designed, with three distinct areas: one for dining, another as a coffee shop, and a space for those who want to work on laptops. There’s also a separate outdoor dining area and small outdoor furniture perfect for enjoying coffee.\nI only had the chance to visit once, but I will definitely return when I'm in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUmVXSkhUM1ZLVFZwNVJVbEhVV3RpYUZwTFZuYxAB",
            "text": "I like the atmosphere, but !! Coffee is awful. That’s how 7$  flat white looks like. No foam, Overbrewed, overburnt, and full of bubbles."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMGMyNHpZMWxZUm5kcVpXdE1ielV5TFhOTFIxRRAB",
            "text": "The food was delicious and the atmosphere was welcoming!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MVgxTlpVblJZYldodlNFdENjVE41YUZsalFWRRAB",
            "text": "There couldn't be a more beautiful place for a restaurant in Upper Manhattan. And the vibe is right, as is the bakery and the cafe. But there are a few basic things that need to be worked on. If you get a table outdoors, on the sidewalk, they'll bring you your food. But not your drink. Why?  This has ramifications for the restaurant too: why would I tip someone if I'm delivering my own drink to the table? Also, when the dirty martini comes (after a 15-minute wait, and the bar wasn't even busy)  why can't it be garnished with an olive, as everywhere else in the world? Finally, don't waste your money on the calamari. It's beautiful calamari, and the dip is perfect. Nice and hot and not too greasy. But it's the smallest portion I have ever seen anywhere. By far. Rather, go for the charcuterie board.\n\nAgain, this is a great place, a cut above  the old Indian Road Cafe that it replaced. But come on, guys!\n\nOne other thought:  because it's next to a park, a lot of dog walkers  end up at this restaurant. That's fine, but being New Yorkers  (as I am) some of them they treat their dogs as if they were their children. That is, they park them right in the narrow aisle where you have to stand if you want to order something, and they expect you to say Excuse me as you walk around them.\n\nThat's right, they're more welcoming to dogs than customers, which is not great  for those of us who don't have dogs, or who are allergic to them.\n\nAgain, it's a great restaurant, but here's the bottom line: I feel like they take their customers for granted. Let's see how long that works!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNVEwbG5kVFJhU1hOd05uWXhPRTU0TVdOTlNrRRAB",
            "text": "Very cute, a little fancy in a laid back way. Has Gelato, $5 happy hour drafts, etc."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSlNFZEpiVmQzV1c0eVZWSlZTa2h5VXpFd1IzYxAB",
            "text": "From SLC to JFK from JFK to Inwood. Perfect place to see lots of dogs and have some great breakfast (brunch)! We showed up too early but the staff kept us entertained as well with the local fire department! A really cool experience, wish this place the best of success!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa2RqUlFjRFZyUjNvNGNrUTJOazlIWVdkc2NIYxAB",
            "text": "Beautiful vibes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTWNHbHRkRTUxV1U1VVpXRnJTRlJzVmxkek9YYxAB",
            "text": "GREAT place!!!  Highly recommend!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMVlrSkdhek5aTTJORVEzcFpSQzFGUVdaMlZHYxAB",
            "text": "Combination bar-cafe-restaurant with a very friendly and relaxed vibe. Great place to relax with friends."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cWNFNWlRM05NVkZKamRIQXRNVXBXUkhSelRYYxAB",
            "text": "The food is incredible here. Ive tried the chicken & waffles (so flavorful) for breakfast, ceasar salad, crab cakes (AMAZING), and the burger. The food was so so good and probably some of the best I've had around here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQlIyTmhWbVZYTUVkSFYwMU1WMkZyUlZCTFMxRRAB",
            "text": "Wow what a spot. Rustic, welcoming, warm. Right by the park and water, you forget you’re in Manhattan.\n\nFood rips. Coming from Florida good Cubanos are hard to find, and whoever they’ve got in the kitchen knows their stuff, best I’ve had in NYC by far, and one of the best I’ve had.\n\nKind staff, good prices, all there. Don’t skip it."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubmVpQTZRRRAB",
            "text": "Great spot for brunch. Worth the wait. They don’t take reservations. We were a part of six. The steak and eggs, eggs bene, biscuits all highly recommended. My wife didn’t love the French toast brioche. Great coffee and delicious Bloody Mary!\nAlso came back with a part of 7 for dinner. The food continues to be good. I had the spaghetti and meatballs which was quite good. Even better was the Broccoli Rabe Orrecheitti. The Eggplant Rollatini was good, the salmon and pork chop was well liked."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MldsaHJlWGhPVUhsMk4yVkZNV0ZFVmtaYVoyYxAB",
            "text": "The place is very cozy, the food was really good and prices were decent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGMFZXRkhabll6V0dwVVZtWjFTV2xqU21oVlpGRRAB",
            "text": "We are in NYC for a few days. I was looking for restaurants that had vegetarian options and Inwood Farms was on the list. We came based in the reviews and  they did not disappoint. The food is really good. Just keep in mind that the portions are small."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SGRYWlFVR3cwVEZaUGNuVkdlRkkwY0ZVeGVWRRAB",
            "text": "It’s absolutely gorgeous place! Very calm & relaxing! Food is excellent. Great atmosphere! Much better than expected!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWlVFbFlMV3A1WDNWalJrRjRNbVYxTURjNVNWRRAB",
            "text": "Good coffee, good drinks, and yummy food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScU1HcHdXVWRTV1hWRlVEY3pkRlkzVm1JMFFtYxAB",
            "text": "Food and drinks are delicious as always, love the ambiance, and the mature crowd. Love this spot 👌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWWNFNTZabW96U0doWVUyUkljVTVVTm1WNkxXYxAB",
            "text": "GREAT Restaurant.  A hidden gem. Had lunch with a friend and had such a  lovely experience. The food , the cocktails and the ambiance. Service was good as well. Totally recommend this restaurant. 💯"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5clozSkhSM0ZhVTNNeVgxQk5lakpNY1RVeGNGRRAB",
            "text": "I go here every morning for coffee and the occasional pastry- staff are top notch! Have had dinner multiple times and recently a lovely outdoor brunch. It’s the cutest place in the area by far: excellent food, friendly, prompt service. I have never had a problem- 100% lovely experiences. Just double check the hours as weekday hours are slightly different. Definitely a must try! I usually get the Farm Burger and hand cut fries- burger is always made to my specifications- perfect and generous portion. I also love their Cobb salad. Ten stars!!! ⭐️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNelUwOUpZVVZYTldsTVducExha2QyT1dKbE1sRRAB",
            "text": "I really miss the old cafe that used to be here. I came to inwood farms with my nieces and nephews for brunch and we were all extremely disappointed. The portions were tiny, pretentious, and they forgot to bring out my niece’s order and hardly apologized let alone offered to make it right- even for a child waiting for her food. None of the dishes were impressive for the price and I will not be returning sadly since it used to have a beautiful family vibe."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cVVqUmhRMHhCUlhaU1lWSlJibFY0ZEZaa1VWRRAB",
            "text": "Enjoyed the lunch special. Delicious lunch"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneFkwd3lWWFJDYlRKWFoxZzJUbWRIVWtkWFgzYxAB",
            "text": "Sooo delicious!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRGFFcHZSMDFUWTFodmFVc3dWSHB5Y1U5alZIYxAB",
            "text": "This is the old Indian Road cafe.  I guess they were too PC for the name, to be clear, there is no farm here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNFNVMUljRXMxZW1oWVVUWkhaelIzWkV4WGNHYxAB",
            "text": "One of the most calm and unique cafes in Manhattan.  Coffee is good but the home made cookies are really the best thing about this place. Great spot for meetings and family get togethers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWFJqbERTM2QwY2tSeVJXRnVTVFJ0YUhwM2JsRRAB",
            "text": "This place is a joke. I came in for breakfast because that's what the website stated but when I came in the cashier stated they only have food in the evenings."
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnX2FqNHd3RRAB",
            "text": "쿠바노와 아보카도 LT 가 맛있었음"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dFUwdHNUM2R4VUdFMFMyOURSMW95YVU1U2NGRRAB",
            "text": "My friend and I went for Sunday brunch, and it was hands down the best decision we made that day. I had the French toast bites and the brisket mac & cheese both were absolutely delicious. My best friend ordered the steak and eggs along with the unlimited mimosas, which definitely didn’t disappoint.\n\nThe food was amazing, the customer service was on point, and the overall vibe was warm and welcoming. It’s a very family-friendly spot, and if you prefer something quicker, they also have a cozy little café section where you can grab something to go. Bonus: they bake their own cookies, and they looked so good I’m definitely picking one up next time!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOWFJucFc3djRXcnl3RRAB",
            "text": "Wonderful cafe. The food is scrumptious. They have quite a bit of indoor seating and also outdoor seating weather permitting. It is right next to the park and across the way from the water so you can get the views. They also have a coffee counter for take out with delicious looking baked goods. We had the mushroom dish and the hamburger - both were excellent and did not leave us feeling uncomfortable or bloated. You can walk in the park after and enjoy the beautiful views . There is very limited street parking. It seems to have wheelchair accessibility. Lots of high chairs. There are things in the menu that kids would like and lots of meatless/ vegetarian options from the menu. Our server was competent but not friendly and did not offer suggestions or speak about the specials. Regardless, we will come back as the food was delicious. (In contrast, the girls at the coffee/ take out counter were a delight)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3X2JqUGJBEAE",
            "text": "Such a cute spot! The area feels like a beautiful escape from the city. My friend and I came here after a run around the nearby park. ✨\n\nWe had the intention of getting brunch, but brunch service didn’t start for another 30 minutes, so we grabbed pasties and teas instead. 🍵🥐\n\nService could have been a little friendlier, but I’m from the south so I know my expectations are high.\n\nI will definitely be back to experience brunch & the beautiful outdoor seating once it gets warmer."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPMkFnTjdsNTVESl93RRAB",
            "text": "Inwood Farm perfectly accommodated my graduation lunch. I secured a reservation by email and they were ready despite the rush. My family loved the cozy vibes and the hearty food. Most of us had the burgers and there were no regrets!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaEtlOHV3RRAB",
            "text": "The brunch breakfast was delicious and filling. I ordered stuffed French toast with a side of bacon as well as Biscuits & gravy with a side of home fries.\n\nThe main dishes were portioned decently and were worth price. However the sides are very overpriced and not proportionate. At $8 per side I would expect more than 3 strips of bacon and a handful of potatoes.\n\nOverall, the experience was enjoyable and the food was great so I would come back again. There are other menu items that peaked my interest."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbUpuWldnEAE",
            "text": "I love to come here, and then take a walk in the park across the street. The bakery is divine, and the tomato soup is one of the best I've had. I enjoy brunch here, especially the biscuits and gravy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxelpxQUZnEAE",
            "text": "Small restaurant on the corner of a park, which makes it a nice stop after a hike in the surrounding parks. We came here to enjoy lunch and we really liked eating here. They have original dishes along more traditional dishes. Pleasant service and a relaxed seating at this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkOWZDaG5BRRAB",
            "text": "Visited for Sunday brunch with my friend. We had lattes, a passion fruit mimosa, and a peach bellini to drink. We shared stuffed brioche French toast, brisket macaroni and cheese, and a side of Brussels sprouts. The French toast was very unique, as were the Brussels sprouts, and all three dishes were delicious! Service was fast and atmosphere was pleasant. They are extremely dog friendly and have treats for dogs! Would highly recommend this restaurant."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdjlMV1F3EAE",
            "text": "What a great spot. I got the bruschetta and burrata toast and was blown away by the flavor. I consider it a little pricey for the area but comparable to what you’d pay downtown for a nice trendy spot like this. I went on a weekend at peak brunch rush and, because I was by myself, got to sit at the bar with no wait. Definitely make a reservation for any more than 2 people."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSekpMZlJREAE",
            "text": "The food was extremely delicious and excellent. They have good quality of ingredients. The place was crowded the day I went there because it was on Sunday. We order tea, hot chocolate, burrata toast, puddle Mac and cheese, Irish breakfast and a lava cake and all was so good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbGVDMjR3RRAB",
            "text": "Food was good! Got the brioche french toast and biscuits and gravy. French toast was flavorful, crunchy on the outside and fluffy inside. Biscuits were a bit different from what I'm used to (coming from the south), but still very tasty regardless and a good sized portion."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4LXN6RmlnRRAB",
            "text": "Hola a todos chicos! Les cuento que este domingo pasado nos fuimos a este maravilloso Restaurante \"Inwood Farm\", pegado al Rio de Spuyten Duyvil Creek. Ya desde unos metros antes de entrar al establecimientos, se sentia una maravillosa aftmosfera. Tuvimos la fortuna de entrar y optener una mesa muy rapido, eso se puede ser que de una forma - \" MUCHA SUERTE\". La comida fue muy rica, todo en su punto de cocción, pero lamentablemente los dos cafes que pedimos llegaron tibios y mi cafe con leche tenia mas espuma que liquido (eso podrian arreglarlo seguramente). Ahora hablemos de la atención de los mozos, me gusto que siempre den una sonrisa a la hora de atender hacia los clientes, eso es un punto muy fudamental para un Restaurante, es la cara principal del establecimiento. También el restaurante por las noches es un lugar para escuchar musica en vivo, amigos. Trato de ser lo más junto con mis reseñas, dar un punto claro y objetivo. Vengan para conocer este hermoso lugar, tiene unas formidables vista del Inwood Hill Park y del Henry Hudson Bridge.\n\nHi all guys! I tell you that this past Sunday we went to this wonderful restaurant \"Inwood Farm\", next to the Spuyten Duyvil Creek River. From a few meters before entering the establishments, a wonderful atmosphere was felt. We were lucky to enter and get a table very quickly, that may be in a way - \"VERY LUCKY\". The food was very tasty, everything just cooked, but unfortunately the two coffees we ordered arrived lukewarm and my latte had more foam than liquid (they could surely fix that). Now let's talk about the attention of the waiters, I liked that they always give a smile when serving customers, that is a very fundamental point for a restaurant, it is the main face of the establishment. Also the restaurant at night is a place to listen to live music, friends. I try to be the most together with my reviews, to give a clear and objective point. Come to see this beautiful place, it has a formidable view of Inwood Hill Park and the Henry Hudson Bridge."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNjV1ZU5BEAE",
            "text": "Really great spot!  Great food, atmosphere and delicious food! The spaghetti and meatballs and the salmon entrees were delicious. The creme brulee dessert was delicious!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMXNMbXNBRRAB",
            "text": "Hubby and I came here on a Saturday afternoon around 4:30pm.\nWe made the reservation online.\nWe enjoyed the atmosphere of the restaurant and its crowd.\nThe service was really fine, not at all as bad as described in some of the other reviews.\nMy hubby mentioned the service was just a bit slower, but to me personally it was truly fine, the waiters showed up when needed and were kind.\n\nHubby had the “honey mule” ($14) and I had the “uptown sangria” ($14) to drink.\nWe shared the “artichoke hearts” ($12) and “truffle fries” ($12), both were very yummy!\nI just bit the artichokes too early and burned my mouth, so just an FYI to give it some time to cool down first.\nI really wanted the “country fried mushroom” as my main, but to my bad luck they were out, so I substituted for the “eggplant rollatini” ($18) which was delicious btw!\nHubby had the “bistro steak” ($32).\nHe was a bit worried that it wouldn’t be filling, but he ended up feeling satisfied afterwards.\nHe mentioned really having enjoyed the mashed potatoes and the salad on the side of the bistro steak.\nWe ended with sharing the “bread pudding” for dessert, which was just okay, I won’t order it again, next time I’ll stick to the crème brûlée.\n\nOverall we really enjoyed dining at Inwood Farm and I have to come back to try that “country fried mushroom” as a vegetarian!\nWe plan on coming for brunch this weekend, so I’ll be updating this review afterwards with more info and pictures.\n\n*EDIT*\nWe came for brunch on a Saturday at noon (12:30pm reservation) and the vibe was so much fun!\nIt was almost fully packed and the coffee station had a bit of a line.\nI had the “matcha affagato” ($9) which was like a cold dessert drink, but it was sooo good and lasted me for the entire brunch.\nI finally had the “country fried mushroom” ($20) and it was okay taste wise for me. The presentation was beautiful, but it could’ve used a bit more seasoning for my taste.\nGlad I had it, next brunch I have my sight set on the “bruschetta buratta toast” (will only update photos, no further revision of review after this.\nHubby had the “steak & eggs” ($25)."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMklhazNBRRAB",
            "text": "Very unexpectedly amazing place! It looks like a bar, but the food is very fancy and tastes great. The home style bread with oregano they served as a small appetizer was soooooo good, very fresh! We loved everything from start to finish.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabU5EbW13RRAB",
            "text": "Love my food and drinks at Inwood Farm. The restaurant is lovely and has a setup that also allows for to go purchases off to the side, so you can grab a coffee and pastry there if you're not looking to sit. We sat and had some brunch, and everything was Delicious. The French toast was magnificent though I will say it did feel a little bit too doughey in the center, but it wasn't so doughey that I felt it wasn't safe to eat. I think it could have used a little bit more time to firm up in the center though. Service was lovely and one of my fave parts was the soundtrack in here. They were playing an abundance of uplifting soul classes. I will be going back here!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMWEzSnpVVkJNTkhwRmNHZzBlVjk0VGxoUlVVRRAB",
            "text": "Super chilled spot that allows pets, the scenery is beautiful and the food is sooooooo good. Just went there and the waitress with the red hair was so good to us, can't wait till I go back again but this time I'll bring more friends. PS get coffee and cookies immediately before sitting down you just might not eat anything else thats how good it is."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMG9DMi1BRRAB",
            "text": "Very cute neighborhood restaurant. Perfect for a date or nice drink and ambience.\nMusic just right, the ambience so cozy and loving. Outside seating very attractive, specially on a nice weather.\n\nPretty diverse restaurant with a coffee shop, restaurant and bar all in once.\n\nAfter waiting for the Right timing to make it to this restaurant, so long between reading reviews and exploring its website to learn more about it, since I enthusiastically looking for nice local spots, I thought tonight was going to be the day.\n\nUnfortunately they seem to be short of staff, service was extremely slow. Me and my friend stop for a glass of wine and maybe a snack to enjoy it on the little outside patio set up, which seems lovely. We waited to be seated when there wasn’t a line nor the restaurant were busy. Once I get the hosts/ server attention, we walked out to the table we picked.\nAround 10 mins passed for the waiter ( another lady) come around with glass of water and left immediately, trying to catch up with the order of another couple we were dining in, and they complained about being waiting so long for the other to arrived and it arrived incomplete. The couple were very vocal and fussy about the service as well.\n\nWe kept waiting for over a few minutes more, at this point ( 15 -20 ) mins, no one has come up to take the order of the drinks at least. We choose to leave.\nWe just wanted a glass of wine and we couldn’t get past a glass of water.\nI’ll give it my benefit of the doubt, and come back once more, hoping for the best."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSmEwUnBWbm80Y1ZwcFNVSlRZbGt3U0U5TlFrRRAB",
            "text": "Ordered 2 Southern fried chicken sandwiches with fries, a regular margarita, and a cactus pear margarita. The margaritas were apparently made with straight lemon juice instead of margarita mix, which we found out upon taking our first, inedible levels of sour sips.\n\nThe staff at the cafe bar where we ordered said the margaritas are “usually sour” but they could ask them to add some simple syrup. It wasn’t until another staff member working at the actual bar asked what was wrong with the drinks that someone associated with the restaurant actually tried them. From there, it became evident that the bottle at the bar labeled “margarita mix” was actually straight lemon juice. Not sure how that happened, but it left us with upset stomachs and burnt feeling taste buds.\n\nThe fries were good but the sandwich was just okay. There was dropped fries and food on the ground under the tables/chairs in the white floored area. Overall, wouldn’t risk returning."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdFBfVGNBEAE",
            "text": "Fantastic brunch spot. Tables of 4 or less are easiest. The frittata was good. Fresh ingredients prompt staff. A nice spot for a causal meal. The coffee and grab and go area is nicely separated from the dining area which reduces the intrusion from the fast counter. A definite spot to stop before or after hitting up the park."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcXNiRWZnEAE",
            "text": "I recently visited Inwood Farm and had an incredible dining experience. I ordered their hamburger and fries, accompanied by a refreshing sangria, and I must say, it was the best burger I’ve ever had! The quality of the ingredients and the preparation were top-notch.\n\nWhat truly set this experience apart was the outstanding service. The staff was attentive, friendly, and went above and beyond to ensure my dining experience was exceptional. From the moment I walked in, I felt welcomed and valued as a customer.\n\nI highly recommend Inwood Farm to anyone looking for delicious food and exceptional service. I can’t wait to visit again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMHN6T2tnRRAB",
            "text": "Grabbed dinner at the place while attending a cultural even at Inwood Hill Park. The food was amazing, but the drinks were a bit watered down for $14 I expected    More of a kick. Staff was lovely and attentive though. And as stated above food was great."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpMnMzWnBBRRAB",
            "text": "Nyc gem. Great food and bartender went out of their way to make us pina coladas on national pina colada day! We love sitting outside by the park and I’m willing to pay a bit more for the atmosphere as this place certainly is not cheap.\nAll the great stuff being said, our waiter was totally scatterbrained. It felt like this was his first day waiting tables ever, he easily could have sold us three rounds of drinks but we ran out of time. His loss, our sobriety. Also the host did not give us a high chair so dad had to go find one.\nOur waiter greeted us within 5 minutes of being sat outside in a hot beautiful summer evening. We were eating with our friends 3 year old. When the waiter came the very first time we asked for pina coladas and ice in a plastic cup for the kiddo. 10 minutes later he returned empty handed as if he never saw us before then in that moment he remembered us and said our order out loud and asked if we needed anything else. We kind of blinked at him. The toddler had now been hand fed ice cubes one at a time from all of our drinks. He returned to our table about ten minutes later again empty handed to get our food order. We had to ask him if there were any specials which he did manage to bumble through but without pricing at one point mentioning leftovers (don’t do that). I had to ask him for pricing on the specials which he said all in a row while squinting his eyes and looking up at the sky so we never really knew what cost what. I ordered the pasta which was excellent we all split two watermelon salads - also excellent; and my friends split the special ribs. His fourth visit to our table 38m after we sat he brought a full to the brim ice water for the toddler in a non child proof clear plastic cup w a lid and the pina coladas. If we let the kiddo handle this ice water (not ice) she would have spilled it all over herself.\nAgain. 5 stars I love this place but know: this was a $140 meal and my friends split an entree. As a person in the service industry ownership needs to either hire more or better servers. And train them haha! We will be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKVHF2SXJ4Z19lel9nRRAB",
            "text": "Beautiful view, kind staff, and I kid you not some of the BEST food I've ever eaten. 100% recommend the french toast, best I've ever had. Feels super fancy and delicious for a fair price."
        }
    ],
    "reviews_count": 75
}