{
    "name": "Brown Sugar Bar & Restaurant",
    "place_id": "ChIJT40YdfPzwokRohbdynCkc5g",
    "grid": "MN12",
    "address": "5060 Broadway, New York, NY 10034, USA",
    "rating": 4.2,
    "user_ratings_total": 937,
    "phone_number": "(646) 688-3504",
    "reviews": [
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjM00ycE9lR0pSZWtsMlRFVlNNemRhYUVWSE4zYxAB",
            "text": "Buen ambiente, excelente para celebrar eventos y buenas atenciones y tienen hookah"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdllqaHlYMnA1YVV0alUwZHFjRUUzTVRkdmNYYxAB",
            "text": "Absolutely fabulous music venue with really great food too. Went for my husband’s 53rd birthday and had an evening we will never forget."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMWVqQk9ObkptWTJGcFRHRjVlbEZ4Vms4M2JHYxAB",
            "text": "I came here on a Sunday after happy hour around 10:27pm. I asked the bartender how much his pitchers were and I thought he had said 17$ for the rum pitcher but when he made it. He gave me a recipe of 70$. How much is your pitcher? I tried to call the lounge but you guys have your number out of service which is sketchy. I got the rum pitcher with a yellow color."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oZmJsVmZZWGhLYTBJMk9HaHBMVFI0TW1GRE5uYxAB",
            "text": "The food and drinks have always been good, but there was no dj and the place was empty. I went on Sept 20th, it was a disappointment. My friends and I was expecting some good music, not the waitress and bartender playing the music"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMk16WjZWRlZSTjFvd1ZtVk9Ubkp1YkdacGVrRRAB",
            "text": "Tip is already included in the bill. Don’t tip again. If you tap to pay you won’t even see that tip is already added. Pretty sure it’s done on purpose."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNWJYQmxPR1JOZVVoVlp5MHlhelkyTkdKVVRsRRAB",
            "text": "Mofongo was mid. And the dish was supposed to come with avocado but didn’t. I had to ask for it twice and they charged me? When I mentioned I was charged for an ingredient that was supposed to come with the food they claimed it was “mixed in” even though there was no trace of it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkU2RGbzFZV2x6ZVVsMk9HNVBXbXhwY1U5NmVFRRAB",
            "text": "Cool spot. Gen was on point with her service!!  Will def be back soon this summer."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONmJGbHNhMlJxYkdORlMyeHNZVTg1TVdVM1JtYxAB",
            "text": "Where to begin, the description it's has is Cuban restaurant. I am from New Jersey Hudson County  we have a gazillion Cuban restaurants and this is not a Cuban restaurant.  From the outside it looks like a real cool restaurant lounge type when you walk in very plastic tablecloths on the table.\nGot there about 7:45 DJ was blasting music.  We had mofongo, super dry  unseasoned nowhere near what we are accustomed to as my husband is Puerto Rican.   the chafue rice at no flavor.  The chicken chicharron had no taste whatsoever.  Overbpriced"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bWMwbG9hbGRPWjFkMVJYa3lRMGx1WldSeVQyYxAB",
            "text": "The food is good as well as the atmosphere is good, but \"They Pull The Old Switch Around\" and tell Customer's their Credit Card Machine is \"NOT WORKING\" and Direct You to Their Excessive FEE ATM Machine.  Especially on Friday's and The Weekend!!!!  BEWARE ASK IF THEIR CREDIT CARD MACHINE IS WORKING."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHMmUtd09BEAE",
            "text": "I love this place the drinks are good..music is on point.. food is delicious best shrimp mofongo you will ever have. Food is a little pricy depending on what u order but you will not be disappointed other than that no complains definitely going back again and again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNN1lxOWlwaXJ2dFZ3EAE",
            "text": "Strong drinks good music good fun"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ1M0WjJiLWVUVk1nEAE",
            "text": "Me and my friends made reservations for mother's day. They had a price fixed menu $40 for 3 courses. They started getting busy really . The DJ was playing great music. Every body started getting up to dance. Really nice place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcmZERkpBEAE",
            "text": "Wasnt like in the past no real.crowd...dj wasnt there...but we enjoyed our food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNnFlcHpBRRAB",
            "text": "I love the restaurant"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2d2VETlJREAE",
            "text": "Crystal is the best"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2N1BXUTZnRRAB",
            "text": "Always have a good time here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdUp2QllREAE",
            "text": "Anthony took great care of us, the atmosphere was amazing good music , clean , the hookah flavor choices were great ,, Anthony has mastered the craft of making the cocktails they did not miss, the menu was great! And the food omg!! The food cooked to perfection the steak , the lobster the shrimp the vegetables , amazing ! What an experience! I kept seeing this place on my instagram and decided to make a trip , you should too you won’t be disappointed!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MmJTRGhBRRAB",
            "text": "Boasting a mixture of Latin cuisine from different cultures, Brown Sugar was a pleasant surprise. Located in the middle of the Broadway strip, this was a gem of a find. At first I was deceived, with the loud music and the lack of a noticeable crowd I was skeptical.  However, the food was sensational, made fresh and to order. From the fresh made guacamole to the well seasoned red snapper. Everything was well prepared. The staff were warm, friendly and attentive. The draw back was the music, it was unbearable and at times inappropriate for a restaurant. It took away from the food and the feel. Nevertheless the food was impressive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3d2M2RFBnEAE",
            "text": "Awful service, jerk wings were incredibly salty, veggies soggy. Drove from Philly and what a waste of time &  money"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiLTdPUl9RRRAB",
            "text": "The atmosphere was empty, and the restaurant also needed new seats as well. I went on a Saturday evening and no one was there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMci1uZWh3RRAB",
            "text": "The Sunday prie fixe is good value.. but at what cost. Two of our pitchers had bugs and hair and the server didn’t even bat a lash. My meal tastes fully like a frozen to microwave dish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMThPZVl3EAE",
            "text": "The food was trash… no taste… waitress was very rude…."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6X19ia1p3EAE",
            "text": "Music is 10 notches too loud, but it is what it is ... it's vibe for sure"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbHVtbmVBEAE",
            "text": "The food was very very good, cooked to perfection with great taste."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaHItLWhRRRAB",
            "text": "Brunch time was nice because that crowd was really good. Sat at the bar, bar service took forever and 2 days. Only 1 bartender during brunch while all tables were packed seemed more like a purposeful set up 😒. 1 drink took 10 minutes, she did her best for being slammed.\nFood was ok. They do beer buckets, something many bars are no longer offering, the hookah was the best part."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOTczbTB3RRAB",
            "text": "The ambience was absolutely spectacular"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd0tTdEdBEAE",
            "text": "The crowd here tends to be young and the music loud, so not my style.  Having said that, if that is your style, you will probably love hanging out here.  I live close by and come here for take-out.  And I can tell you that the food is fantastic!  Excellent Latin food, not expensive, nice portions, served by friendly staff.  Some of the best food in the Inwood neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeDdMeVN3EAE",
            "text": "I went on a sunday night, the atmosphere was perfect and music was nice, I don't give the 5 stars because the girl left us waiting when the entrance were $20, she let us pass by after 10:00 pm and charged us $40 each one when we were there since 9:30, I plan to go back but if that happens again i’m not getting scammed twice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaWZ1aGxnRRAB",
            "text": "If you haven’t gone, get up now, go eat, chill with great music and hookah nowwww. Our favorite is the steak with rice and beans"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNWRLektREAE",
            "text": "Ehhh wasn't anything special. Everything was average. It was all just ok. It's got more of a dive bar feel. Or a tavern 🍺 🤔"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdUpuZV9BRRAB",
            "text": "I would give this place a 10 ⭐ stars if I could. Everything from the food to the atmosphere is just amazing. Came here about 4x with my fiancé and it never failed to disappoint. The DJs are always, always jamming. S/O to the staff here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaDdhRlF3EAE",
            "text": "Great drinks, great music, and good service, but the place can use a little makeover."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwLXNtLTVBRRAB",
            "text": "The drinks are great!! Music and the vibe is super dope! I loved it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNUlEeVRREAE",
            "text": "Gr8 place to chill"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwME9xcTRBRRAB",
            "text": "I came in at 8:00pm the place was empty.all employees were in the side table smoking hookah. Food disscusting. Had the picadera the salad was good but who can mess up salad."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbzd6eTB3RRAB",
            "text": "Great music, chill atmosphere better then I expected. Strong drinks I will be coming back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbGRlb3lBRRAB",
            "text": "Such a fun spot. Went here with my best friend on a Tuesday night and it was still so lit ! Music is great they play a variety of music. Their happy hour is also awesome and so is the hookah."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeElUazNBRRAB",
            "text": "Great brunch spot! Has a little bit of everything you would like. It has hookah so if you are someone looking for a hookah friendly brunch this is it. The music and vibes are there!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLMWVIMTBRRRAB",
            "text": "The food is ok\nBut the drinks, The service and the d.j\nwas the best ♥️💖♥️…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4XzV1ZGh3RRAB",
            "text": "Went here for a birthday party, the place was great! The live music was awesome and loved it all, Except when other people not in the party started trying to talk to us. This is what I didn’t like. They let adults way to close to the minors even though they knew it was a sixteen year olds, and the staff did nothing. The birthday girl would’ve gotten harassed because of this dude, There should be a policy or at least letting people know they can’t be in somebody else’s group."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4a3E3YlN3EAE",
            "text": "Food was very good. Waitress was good but food takes a bit long to serve. Music was to loud. Seems more like a club than restaurant. The younger crowd would like a lot. All in all, it was a fun atmosphere with very good food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSM3J5eWVBEAE",
            "text": "Went on a Monday night. Had 3 happy hour drinks and was not buzzed at all. Told waiter it was my friend bday and that we wanted tres leches cake. Never brought over cake, never sang happy bday. We were legit the only people dining there that night. So idk."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSaTR6c0d3EAE",
            "text": "The food was very tasty, drinks excellent and the music and vibe was fantastic!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbWZTaHFRRRAB",
            "text": "We had a great time here. The space was really nice. I loved the overhead lighting fixture. The food was really good. Everyone had something different on the menu so we got to try a lot of things. My favorite thing was the shrimp mofongo and the passion fruit sangria. We were here during happy hour so everything was priced pretty decently. The music is very loud. So, be warned if you do not like loud music make sure to sit away from the DJ. I would go back and try brunch."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXemZIX3JBRRAB",
            "text": "Mediocre food and small portions.\nGood atmosphere with music and hookahs. This is more of a hangout drink spot; I definitely would not go back for the food. The menu was not very diverse , and it took forever to get our food.\nThe waitress was great, though, and she was very friendly .\nNot much else to say."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdlBmckJREAE",
            "text": "Went to Sunday brunch with a friend. Music is so loud we were yelling at each other lol music was good though , a little of everything. The coconut mojito was amazing. The food was okay. Quesadilla was more tortilla than anything else. The salmon was a bit salty but overall it was okay. Server wasn't too attentive but it was busy so she was all over the place. My friend said the churrasco was amazing ! I had a great time cause of the company not sure if I would go back for brunch. It was over crowded and the setting/vibe wasn't it for me, ppl smoking hookah and kids present...😵 Also why bump the music so loud there was no where to dance!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0NmNlWjdRRRAB",
            "text": "Great atmosphere, delicious food, attentive staff, drinks were on point and so was the music- by the live Dj. Hubby and I went there for a birthday dinner celebration and had a great time. We started of with the crabcake, chicken wings and…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvNnZQbGdnRRAB",
            "text": "Nice vibe. I like this place. They charge 20 at the door. I went on a friday. They close at 3am. They have great prices for drinks. They have hookah. Is a decent size. The bathrooms are very small. The staff was great and nice. They made us feel welcome. It was litt. I had a great time i would come back here."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNnVQRXBBRRAB",
            "text": "Was here on Valentine day and had the Valentine's special 2 appetizers, 2 meals and a pitcher of sangria for $60, what a deal!! I had the skirt steak and I wasn't disappointed, picture below. The clan appetizer was good but a bit cold, stuffed tostones was delicious."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvajlfWGZREAE",
            "text": "I've been here many times and it's either melo during the day or a party atmosphere towards the night. I wish their hookah (vender) wasn't so pricey, only to burn out quick. Overall, I always enjoy their atmosphere."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpbUtURG5nRRAB",
            "text": "Love this place! The service was a bit slow but the food and atmosphere was great. They have hookah too which is a plus."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNGRPcnZnRRAB",
            "text": "10/10 food, music and vibessssss!\n\nDJ Danny had the place jumping! The food was great! Had the brunch, empanadas, chicken and waffles - all the flavors was busting. The vibe was great, everyone was enjoying."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXd3ZLQ2xBRRAB",
            "text": "Nice cool spot in New York City to have some good cocktails, dance, drinks, food, and fun. Hookahs available. Nice dim lighting. Cool music from the DJ. Very New York City vibe with cool adults. Nice and friendly staff. The people make this spot come alive. Limited street parking."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydzR5OVpnEAE",
            "text": "Visited Brown Sugar on a Saturday night. The atmosphere was great with excellent music and the service was beyond great. Our waitress was a sweetheart who came by regularly to make sure we were okay. The owner is a savvy business man who accommodated my group diligently and suggested the best drinks. Thank you G. por tus atenciones!\n\nWe had the small appetizer combo, which was perfect for 4 people. The coconut shrimp were very good, just a little too sweet for my palate, but not for my friends. The mojito for the tostones was very, very good. As for drinks, I had the coconut and the passion fruit mojito. The latter was DELICIOUS, while the coconut one was less tasty. I also tried a salted margarita on the rocks, which was good, but I'll stick to the PF mojito.\nI definitely recommend Brown Sugar."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMXRPNS1nRRAB",
            "text": "I liked this place. The brunch food was very good. I ordered the salmon and adjusted the sides- mangu and two eggs on the side. It was very loud but that’s how my Dominican people roll."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdUtTQVRBEAE",
            "text": "I have mixed feelings about this place. The food is amazing, however if your dont speak Spanish they ignore u. I'll never go back there"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MlpxWjlRRRAB",
            "text": "The food was really good I don't care for there drinks  but I will be going back soon"
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBOTVtMVd3EAE",
            "text": "Excelente lugar para la familia en general, muy buena comida a mano del Chef Cisco. Totalmente Recomendable."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJdnAtMHZnRRAB",
            "text": "According to Brown Sugar's Staff the picture attached to this review is a salmon dish. I think it the most idiotatic thing anyone had said about a dish. You can clearly see that the dish is an Egg Benedict with spinach and fish. To them is…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBeDVDdE5BEAE",
            "text": "What a great place the decor are a little confusing but really nice place none the less food was great the ambience was amazing drinks were on point true authentic Dominican cuisine so much fun very interactive place highly recommend so ig…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNTltdHZnRRAB",
            "text": "music was good and so was the food just bumbed out u only have 90 minutes  to eat"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNnNHQkhREAE",
            "text": "Group of 6 celebrating a friend's bday  food was very good even though brunch menu is a little limited ,drink on point but the music was a little loud for an afternoon brunch. We were not able to  have a normal conversation because of the music otherwise all was good ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMGNlQmh3RRAB",
            "text": "Food was pretty good, didn't have to wait long for our meal. The server was very pleasant I would return"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNHJteDJ3RRAB",
            "text": "Brown Sugar is a cool spot. I enjoyed the food, ambiance, and the music. They have hookah and fun drinks."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNGI3bG5RRRAB",
            "text": "The serivce and server was great.  She came to check on us a few times. I do feel the food lacked seasoning of some kind especailly  since it is a cuban Resturant. The drinks was also average, we changed our drink, then stuck with  water toward the end. The music was bumping and the vanue was clean which were a plus."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxOWZUYjRnRRAB",
            "text": "I celebrated my birthday here. The atmosphere, food and drinks are all amazing. Employees were nice as well. Definitely going back"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMWZpMHRBRRAB",
            "text": "Buscaba un lugar solamente para relajarme y tomarme unos tragos sociales y poder conversar tranquila, y la verdad es que ambiente muy bueno, con música variable, pues estaba buscando algo asi ese dia y la verdad...me gustó!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRNTVMNmFBEAE",
            "text": "Location is great... Went at around 5pm on a Saturday, Dj was present and had music very loud, unable to talk with my party but had fun due to the drinks.. Requested for kids food to be placed in advanced but still got it with everybody…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcWNHVHBBRRAB",
            "text": "Great spot! I love the DJ, waiters & the food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxc19ET2pBRRAB",
            "text": "Good place. Great food. Drink menu is good. Prices are decent. Very lively. Lots of amazing music played by a DJ. They offer hookah which is nice but me personally I'd rather do hookah at a hookah lounge or a bar and not a kid friendly…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvNjh5dFdnEAE",
            "text": "Great food. Presentation and taste. Good music. Great drinks."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnOEpMdXBnRRAB",
            "text": "Food was amazing. Music was bomb. Love this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPX0lPNF9BRRAB",
            "text": "The atmosphere was nice. Great spot for hookah and drinks. 1 out of 10 I would give them a 4 for food. Usually dining out french toast is made with a fluffy brioche not regular sliced bread. Also I wish they had other options of sides that…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2OWVfeDNnRRAB",
            "text": "Great Please nice & Clean! Our waiter Anthony was Amazing always check up on us making sure we were good."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvXzRMZUlnEAE",
            "text": "Excellent the shrimp mofongo. Cute place, very good attention, amazing food."
        }
    ],
    "reviews_count": 75
}