{
    "name": "Inwood Bar & Grill",
    "place_id": "ChIJrY34o_fzwokRWEo4U7Aw8r8",
    "grid": "MN12",
    "address": "4892 Broadway, New York, NY 10034, USA",
    "rating": 4.8,
    "user_ratings_total": 13330,
    "phone_number": "(212) 304-3704",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkd01tMURXbTgwZWxsV2QwNVhhRzh6ZHpBNVRGRRAB",
            "text": "MARGARITAS, GOOD VIBES , CALAMARI & STEAK"
        },
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTWRGRkJXSEJxUVZrNVVXVldTak16WDNwcFlrRRAB",
            "text": "Good taste and perfect price for a lunch special."
        },
        {
            "date": "수정일: 22시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bExWbFhYMmR0YVVGVmFrZGpRekJQY0V0aFkwRRAB",
            "text": "I simply love this place"
        },
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXaE1MZWlRRRAB",
            "text": "Chaney was the best server very attentive great personality and great recccomendations we are so satisfied with this service PLEASE VISIT INWOOD AND THEIR NEW SPOT U BAR SHE TOLD US ITS NEW AND FUN AND ASK FOR CHANTY"
        },
        {
            "date": "1일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRE5FWjJSa1JMZW1FeVduSXRSMmhKVDFGcFEyYxAB",
            "text": "Chaney Fue Nuestra mesera y nos quedamos encanta da con ella la comida fue muy bueno y bebidas excellente pero Nuestra mesera fue un amor tan atenta con una Sonrisa grande y un humor chulisisisimo gracias a chanty por esta esperencia unica"
        },
        {
            "date": "1일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdE9VbFJiR1ZGTFZaTmJUaHhNWFJmVG1KR01IYxAB",
            "text": "Chantynece la mejor"
        },
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2a3FhMTdnRRAB",
            "text": "Chaney was our waiter and she was amazing wow am amazed with her service and attention to detail her spirit was bright made our day better\n\nWish we can get her always at Inwood Best patron margaritas ever! Must try! Best happy hour uptown! Tell’em we sent you!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NE5EZDJkak5vVEVkMGRUUnJaVXh3YVdwaVdYYxAB",
            "text": "La Chanty was amazing what a beautiful funny server she was the best good food good vibes visit them and request her"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSk9HbzNYMmh1U1MxR1JIVllWVkYwWmpSV1EwRRAB",
            "text": "Went around 1pm on a Sunday to watch some football. Lots of screens to watch the games which was nice. As of 11.2.25 the Brunch menu prefix is $20 and even if you sit at the bar you and you only want the entree you will pay for the prefix. So make sure you get soup or salad and your desser. I took mine to go. I had the Dominican/tres golpes and it didn't disappoint! Great spot for a group meet up!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocFJWQnFZa3N5TTE5NVptTkNZekZIVjNSck4xRRAB",
            "text": "Yhessika was phenomenal! Great service!!!!"
        },
        {
            "date": "수정일: 2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2LVo2al9BRRAB",
            "text": "our server Leo was great. the food was amazing and the music and ambiance were great. would recommend and will come again."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMkxUSnplRGxrVEVrNVExTmlSa0ZWWjA5U1puYxAB",
            "text": "This place is very good for food and to have a good time. The only reason I’m giving 1 stars because I would like to catch the owner and the people attending. This pictures the I posting is kids in a club at 12:30am sleep, while their parent are having fun. This shouldn’t be allowed. This place has hookah, had bottles, glass, and pack full of people, god forbid someone start fighting throwing glass and something happens to thus kids. This shouldn’t be allowed."
        },
        {
            "date": "4일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRGExSlpjVlpQZEdSUmVqSmhTV1l4WlVoeGVGRRAB",
            "text": "Chanti 10 de 10 que goza dimos para halloween queríamos sentarnos alante pero gracias a dios nos quedamos en la parte atrás con ella visítenlos y pregunten por chanti"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONGMyMW1NRkU0VDNrMlpVaDJVRGhXVTNNMWFrRRAB",
            "text": "Shanty amazing service she was always making sure we was well taken care of her bright smile made our night the music the vibes the food was amazing this was such a good night our go to spot"
        },
        {
            "date": "4일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eVgxUk5hMVZXYUdJNVFsZHZiVmhKU2pGTVJrRRAB",
            "text": "Chanty primera ves que estoy en este restaurante y lo digo de corazón no eh tenido una mesera tan chula y chistosa como ella tengo muchos anos llendo a comer a restaurante y como ella no hay otra lleguen hay y pregunten por ella la comida y musica bebidas todo 10 de 10 gracias a chanty por hacerlo mejor"
        },
        {
            "date": "4일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdlpHMXdXamd6VW5ab1EwTnJMWEl5VUMxWlowRRAB",
            "text": "La chanty expectacular unica un amor yo vengo solo por ella todo la musica colors bebidas Rico la chanty lo hiso mejor"
        },
        {
            "date": "4일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSkxWQmtUblpZVFhGcFVqSk1NRU5QZDI5MlZIYxAB",
            "text": "Chanty, es una persona con un carisma excepcional , da un buen servicio al cliente , me fascina su personalidad , tiene un excelente valor en su restaurant , me sentí muy a gusto con ella , ya van varias veces que es mi mesera ."
        },
        {
            "date": "4일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WFZYbHZWRGREYlRCUWRGRnZkbWhsUnpWQ2MyYxAB",
            "text": "Chanty, encantada con el Servicio excelente muy complaciente y atenta"
        },
        {
            "date": "4일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ob1FVcDJOWHB1ZGs5R1ZIcG1XSG8yZEdKUVdrRRAB",
            "text": "Chanti 10 de 10 una personalidad que te hace misr de risa su servicio y attention fue algo increíble"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NUxWZFFjSGd4UTBWV0xWTk9kRWRWYzAwdFRHYxAB",
            "text": "Chanty gave us awesome service!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMU0waHVPVFY1TUVoaGFXSmtXRlp5VHpnd2FHYxAB",
            "text": "Great customer service and atmosphere I really love this place my best bartender is lisandra"
        },
        {
            "date": "4일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoQ1gySTJWMnRQVmtoMlFuRjRhR3g1ZDJ0NldsRRAB",
            "text": "Chanty fue muy buena espero a que nos acomodáramos bien y nos trato con delicadeza y con una sonrisa. Muy buena 10/10. Tiene paciencia y humor"
        },
        {
            "date": "4일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WVdsaFBkakpwTXpKSFNXSXpSbE51YkVZM2RWRRAB",
            "text": "Chanty excellent service due in encanto Ella tan chips y am able me hi so their mucho y la comics super"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScVNXUmFjWEY2VFhCbVNWOTNNRnB3Wkd4eVMyYxAB",
            "text": "Nice place great lunch special"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeFMxUjVja3MzVGpkTFdHY3RiR2w1VEdnMWJHYxAB",
            "text": "Lizsandra in the bar, is extremely serviceable and always takes great care of us. The food is out of this world and the drinks are excellent."
        },
        {
            "date": "수정일: 1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dVoyZThRRRAB",
            "text": "Excelente servicio y atención personalizada\n\nSiempre almorzamos en Inwood Bar and Grill, y nuestra mesera Yeidy Veloz hace que cada visita sea una experiencia excelente. Es atenta, amable y profesional, siempre con una sonrisa y una disposición increíble para asegurarse de que todo esté perfecto.\nEl servicio es rápido, la comida siempre llega caliente y deliciosa, y Yeidy recuerda hasta nuestros pedidos favoritos. Este tipo de atención marca la diferencia y hace que regresemos cada semana."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVWVITkhXakpFVW5wNFpYazRkVk40VUhSd1ZFRRAB",
            "text": "If you haven’t been to Inwood Bar and Grill, you’re seriously missing out. The place has that perfect mix of good music, amazing energy, and food that’ll make you forget about your diet in two seconds flat.\n\nBut the real star of the show? Yeidy! She was super friendly, funny, and on point with everything. Drinks came fast, the food was hot, and somehow she managed to keep a smile even when the place got packed — that’s a true pro!\n\nYeidy made sure we were laughing, eating, and vibing the whole time. It’s rare to find someone who turns a regular night out into a great time, but she nailed it.\n\nSo yeah — come for the food, stay for the drinks, and ask for Yeidy. You’ll thank me later (and probably end up staying longer than planned 😅)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMlUxRlFkVzlLWVVwbFpEbEJPVUV6VFVkRGNuYxAB",
            "text": "Chanty was amazing. Una alma de Dios. She made my visit memorable. She’s so insightful, kind, considerate and made me feel seen. You don’t get that often. You’re lucky to have her! I will definitely be back and will look for her every time because of her wonderful customer service. Que Dios me la bendiga!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eVZqZEpVRXBKVVZSUUxYWldiV1JRUTFZNVRVRRAB",
            "text": "Chanty was so sweet and made sure everything was just right. Her energy was great and I will definitely be back soon."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTFRYVXpjVlZHWVVSSVRUWm1jRU5pU1hWeWNtYxAB",
            "text": "Chanty excelente servicio.muchas gracias chanty"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycWRTTUJ3EAE",
            "text": "Chanty is EXCELLENT!!!!! We will be back!!! Above and Beyond service, courtesy.  I Love Chanty! ❤️"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WlZXTjRhbTlZWWw5WVNucGFlbmxvY0hwdVIyYxAB",
            "text": "Chanty me atendió y fue un excelente servicio !!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aR2MzaG1OVTR4TW01UmFGazNXRFI1YmxaTldVRRAB",
            "text": "This place is always great. Whether you want brunch, dinner or something else they have it all. Brunch is the best time to go but there’s barely parking no matter what day or time you go. There’s always great music, there’s a downstairs section if you want something more intimate and the music isn’t as loud. The bathroom is a vibe with giant mirrors, flowers, a beautiful sink in the middle, the perfect place for pictures especially if you’re taking drunk ones with your friends. Their food is always great with huge portions. The staff are super nice, the bar is perfect for game nights, and you can celebrate anything and everything here. Don’t skip this place!!!! 100/100"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeFNGRlZablJJY25aT1J6QndOemgyYWsxbllrRRAB",
            "text": "Walked in and the staff immediately put me at ease.  I ordered the steak and eggs and  it was amazing.  By the way you can get it with some fries or shrimp but I didn't want to ruin my workout.  😊  See you soon."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNF9HM29RRRAB",
            "text": "Great experience Warm atmosphere, friendly staff, and delicious food.  Highly recommend for any occasion – can’t wait to return!"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oc01sbFZiV3RHUVRnMFdIUnNNVFZyUTBaRVRFRRAB",
            "text": "La mesera Karla 10/10, me encantó la atenta que es, es bien carismática y simpática!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMVVtSTRVVUpXWDFsdmJqbFliV2RXV0dRMWFHYxAB",
            "text": "Best place my favorite spot. 100% Recommend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNE9YbzFlV2R4Ykd0MFVUVnRiMmg0YkhwVWNWRRAB",
            "text": "The food itself is good dining in, but God forbid you use Uber eats. The delivery is always wrong without fail. I’d take a picture of it, but I’d be taking a picture of nothing - i.e. missing items."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubGV2ay13RRAB",
            "text": "Inwood Bar & Grill is one of my favorite spots in the neighborhood! Their lunch specials are amazing — Monday through Friday from 12–4pm, with meals starting as low as $5, which is almost impossible to find these days. The food is always fresh and tasty, and the portions are great for the price. And don’t skip dessert — during the lunch special, you can get their flan for only $1, and it’s delicious.\n\nTheir happy hour is another reason I keep coming back! Mondays they offer a two-for-one happy hour, and on Tuesdays, happy hour lasts all night — you really can’t beat that.\n\nI also have to mention their virgin piña colada — it’s honestly the best I’ve ever had anywhere! If you’re a piña colada fan, this is a must-try."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvelMwaFJhblZ6V0RoZmNGQmFjV2t6Y1hoV1JuYxAB",
            "text": "Delicious food and the music is great"
        },
        {
            "date": "수정일: 2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxamRqTmtTV0paWTFCVWNGTjBiRXMyZVhseWJVRRAB",
            "text": "Los mejores es como estar en tu propio negocio las atenciones el ambiente la comida el final 🔥🔥🔥 el servicio es número uno"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMU9UQkpaVjk0T0hONlZGUnFURFl0T1RWRldYYxAB",
            "text": "Great place for food and drinks.  Music is awesome and everything is organized and clean"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JelRIWm5UamxwWW1aMFUydFZka3c1TVdGTmNWRRAB",
            "text": "Me encanta este lugar, mi experiencia fue mi grata, servicio al cliente de primera, cada vez que voy a NY, me gusta ir, el chef de este lugar se merece más que 5 estrellas."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWFZrOWtOa2hXVFRkQ2FYRTVNMnROUmxWYWFVRRAB",
            "text": "The best place to celebrate any special occasion. Good food , good music and nice service from the staff"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMGJrdHpkMEUyY1hKUVJGSlZjMkpGYkVnMk1sRRAB",
            "text": "Guacamole was too mushy, but overall the drinks was amazing!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUldHTm1WRk55Y1RCUGIzQXRkQzFrTlZCbVVrRRAB",
            "text": "Yeidi is the best"
        },
        {
            "date": "수정일: 2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bkt5azVRRRAB",
            "text": "Súper atenta la chica que nos atendió necesitamos más personas como ella. Gracias yeidy  por tus atenciones"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bWJWSlZibFpsTFZRNU1UWlpYMVZFYnpFdGVFRRAB",
            "text": "Chanty un servicio excelente nos recomendó el especial de lo jueves todo rico pero lo que se destaca fue su personalidad tan AMABLE CHISTOSA DULCE Y una atención al detalle increíble yo eh venido a este negocio muchas veces pero nunca eh tenido una mesera como la chanty ELLA MARCA LA DIFERENCIA EN LA ESPERENCIA DE UN RESTAURANTE gracias por todo me hiciste feliz"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjd01rUnRXVjlZVms5YWJHVXhUVnBIU0RGa09IYxAB",
            "text": "Absolutely love it here every time I wanna have a drink and a meal come here. Chanty is amazing!!!!!!! The service is very attentive. Come here yall!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSmVGODFTR1Z1VjBoQ1YwUTJPRVpuV1hWdVVuYxAB",
            "text": "CHANTY WAS AMAZING AND MADE ME FEEL BETTER TODAY WHEN I WAS FEELING MY LOWEST. NO ONE MADE ME LAUGH AND GIVEN AS GOOD AS A SERVICE AS SHES GIVEN"
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMkxXWnlhRGRJV0VGa1VsUlFTbXB0TjA4eU4xRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nExcelente experiencia en Inwood Bar & Grill.\nEl ambiente es increíble, especialmente el patio, que es amplio y perfecto para compartir con amigos. La música, la comida y las bebidas estuvieron de primera. Pero lo que realmente hizo la diferencia fue la atención de Jorge, nuestro mesero: amable, atento y siempre pendiente de que no nos faltara nada. ¡Un servicio de 10!\nSin duda, volveré y lo recomiendo al 100%.\n\nJorge el mesero es el final\n⭐️⭐️⭐️⭐️⭐️\nExcellent experience at Inwood Bar & Grill.\nThe atmosphere is amazing, especially the patio, which is spacious and perfect for hanging out with friends. The music, food, and drinks were top-notch. But what really made the difference was the service from Jorge, our waiter: friendly, attentive, and always making sure we had everything we needed. Service was a 10!\nI will definitely be back and highly recommend it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSVdTMXpTRlZQVG5GV09YRm9UMXBrWW05VmVIYxAB",
            "text": "High 5! I love the atmosphere. You can enjoy the spot without the food. The staff is very organized and the food is good! Check it out for yourself. If you thirsty and need hydration. Make yourself Happy!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NS1qSzZ3RRAB",
            "text": "Ahhhh-mazing after-hours spot on a weeknight! I can imagine the environment on a wknd. 21 yrs & up. We were carded at the door. Impromptu visit, and they searched bags. Confiscated my 16oz water bottle though. We enjoyed the music, crowd, hookah, atmosphere, picturesque restroom area, and beyond. And the food - omgeeeeee the food!!! Drinks were great, we selected a pitcher of the passion fruit Don Juilio margarita - wheeeewww 😋. Lots of appetizers and an entrée for each of us.... Hidden Gem"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreE9XNXNTVEJIVEVsTlpqWklhVGh6VGpGbFVXYxAB",
            "text": "I had such a great experience thanks to my server Chanty. She was so attentive, kind, and made sure everything was perfect from start to finish. Her positive attitude and professionalism really stood out  &  it made the whole meal even better. Highly recommend! Ask for Chanty!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcGRPWVF3EAE",
            "text": "If you’re looking for a spot with amazing BBQ, great drinks, and live music that keeps the vibe going, this is it! The food is packed with flavor, the cocktails are top-notch, and the atmosphere is unbeatable. The place is huge, so even when it’s packed, it never feels overcrowded. It is on the pricier side, but honestly, it’s worth every penny. I’ll definitely be coming back again and again. Highly recommend if you’re looking for a lively, delicious night out!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMWFXRlJSakJpZFdRNFdVWlZUSEU0TFd4aGNWRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nHad a great experience at the inwood bar and grill, thanks to our amazing waitress Chanty. She was friendly, attentive, and made sure everything was perfect throughout our visit. Great service like that really makes a difference. Highly recommend stopping by—and if you get Chanty as your server, you're in good hands!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcmRIOVdnEAE",
            "text": "Inwood bar & grill is a party destination the main floor is the best got to go early to sit there or get lucky it’s the more party vibe. The downstairs is more the food and chill. Still hear the music but not as loud not as crazy. The outside it’s more lounge area the food is good nothing out of the world but the fish today was on point not gonna lie.  Best food I’ve had here so far easily. Overall good music great vibes good time"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNGRISmlZM0pTZUZCNk5tWlFjbTVyVFdJeVQwRRAB",
            "text": "Me encantó el lugar, una muy buena comida, ambiente exquisito y una atención de primera. Me gustó tanto que ya reservé un brunch de fin de semana para celebrar con amigos mi cumpleaños. Buena música, un poco alta para mi gusto; pero una estancia agradable."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCck9VaGxkRkJ4VGtzeVVWQkVPWFpUV2xkT00xRRAB",
            "text": "El ambiente es familiar, la comida es excelente, el precio es muy bueno y los tragos exquisitos, me encanta ese restaurante"
        },
        {
            "date": "수정일: 1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3a3Z2ZWRnEAE",
            "text": "Es un lugar muy muy nice para el público dominicano. La bartender fue muy atenta y servicial, la música uffff si eres dominicano la vas a disfrutar. Merengues de los 80 que me trasladaron a mi niñez. Me tome 4 margaritas frozen muuuuy buenas y unos excelentes calamares fritos y la cuenta me hizo 50 dólares, seré fijo aquí los lunes"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNaUJ2b0doaFA2Z3V3RRAB",
            "text": "El servicio en este restaurante es simplemente excepcional. Desde que llegamos nos hicieron sentir como en casa. El personal es atento, amable y muy profesional"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjdFlUbFlTR1JoTjNoa1kxcFJVVkJ0Ym1GWWMzYxAB",
            "text": "This place has an issue with the hostess, there's never seating in the front and they always want to send you to the back or downstairs. I've been seating here for more than an hour and all the \"reserved tables\" are empty. Either the hostesses are asking for money for the front seats or something dishonest is going on. First come first serve would serve the business better and wouldn't look so scammy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTGQwcFlOMUJVZWxSblNXWnpiMkZOTjJSTWJWRRAB",
            "text": "We went at very busy time. But the waitstaff was very friendly and accommodating. They accommodated our little ones and seated in an area where they were comfortable and not in other patron’s way. The food was very good. The restaurant was well maintained and very clean. That’s why it is our go to place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUlUzb3lkVlUyYWt4cU9ERmxSSGt5TW5NNWVWRRAB",
            "text": "First I would like to start of how great service was. Our server was sweet, patient and also gave us insightful recommendations. She respected our space and time and was excellent!I regret not taking her name, we sat downstairs in a more relaxed vibe. We got our order in and ordered our drinks. I always drink my whiskey (Jameson) neat!  I know my preferred drink very well and can tell when I ve been given another imposter. I called her over and she showed me that in her hand held device that she in fact ordered it (Jameson).  She went back up to the bar and when she came back of course they were gonna say they gave me Jameson. I knew they gave me some cheaper whiskey which was not smooth and way darker in color. I nearly cringed to the taste! Ewwww! Everyone who drinks Jameson knows it's extremely smooth! Now I know why some of my friends makes sure to visit the bar before settling into their tables to make sure their is more than one bottle of their preferred top shelf drinks. Its very deceptive to pay top shelf price when given low grade liquor. There are loyal customers as well as loyal brand drinkers. This is deceptive practice that is seen not only here at this establishment but in others as well. Pre-game for me and a visit to the bar a must! Nonetheless our experience was excellent with food...calamari was meaty and fresh, sauce a bit different, not plain marinara, I enjoyed the fresh squeeze lemon on the side.  Wings were a go!\nI must add that our waitress was very accomodating and willing to change my drink for another option, I still stood with my drink and afterwards ordered Macallan and it was as is. Will revisit for sure with my guards up on the liquor.\n\n*I must add that a review with one star, 7mths ago, also had the same experience with their drink. Couldn't read into more but I'm pretty sure there are more same experiences out there! Please stop this practice, you guys would be better if you played fair!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeWEyOUhBEAE",
            "text": "Amazing time and great service. We were a walk in party of two. I ordered the $20 brunch deal, which includes a three-course meal and a non-alcoholic beverage. It's $40 if you want bottomless alcoholic drinks. I’m usually hesitant on visiting Hispanic/Latin restaurants as a Black woman due to the mistreatment we usually face, but the service was stellar!!! My friend and I truly enjoyed the attentiveness and hospitality of the servers. The salmon was amazing, and my friend enjoyed her steak, shrimp, and fries. The flan Great food! I will be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScVJtOUxSSHBGZUhKUmJYcFRhR3hoUWxOdFlVRRAB",
            "text": "The place is awesome! Had our sons birthday party here and the staff was so accommodating!  Big shout out to Stacy and her husband!  Thank you!  Must go in the Inwood community!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOak9ocXlBOHY3YTd3RRAB",
            "text": "Awesomeness!! Good Food great prices  Awesome  service M-F specials!!"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMVJVOXRjMnM1ZFRGUU9VNVRWVXhITkZsUWVFRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nEl viernes fui atendida por Yeidy y realmente fue una experiencia excepcional. Su atención fue excelente, muy amable y profesional. Me hizo sentir cómoda en todo momento y brindó un servicio de primera. ¡Definitivamente se nota su dedicación y pasión por lo que hace!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNk9qM293RRAB",
            "text": "Yhessika was a great hostess. Very professional and accommodating. The food was great . 10/10 all around. The food was too good. 🤏🏽 And the music was great too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURia3BybnFRRRAB",
            "text": "The food was ok, the server brought it out right away that we order it . We order the spicy wings and they did not meet the taste, the drinks we ordered a frozen Sangria the taste was off sent it back and order a pińa colada. We arrived at around 4 the music was at an appropriate bar standards after 5 it turned into a night club super loud. Maybe I’ll give it a second chance."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMWFDSDR3RRAB",
            "text": "My first time and it was great. Everyone was very attentive and the food was fantastic. Pina coladas top notch best I've tasted in a long while."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ka1ZsRkhObmxUTTB0R2JWWkZaSHB4UW10S1VYYxAB",
            "text": "Always enjoy my time at inwood bar and grill! Food is tasty and drinks are strong. 100% recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaTZhcjFnRRAB",
            "text": "The food was delicious!! We got the mofongo, chef special churrasco, and the Dominican burger. We also had desserts and the spinach dip appetizerss. Everything was delicious, and we’ll priced. I wish I remembered out servers name, she was so amazing. The service was super fast and attentive and the music was lit. I would definitely return and recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaFpXbHVnRRAB",
            "text": "I was here most recently for a birthday brunch. Making the reservation could have been more enjoyable than it was, but it's all good. They sat us next to another party. It wasn't really crowded. We were ALL confused about their decision to do that. They did ask to be moved and were accommodated. One person worked our tables. She was really nice and did a good job taking care of us. She  made no mistakes! She explained things thoroughly. There were no surprises. The food was very good and came out pretty fast. The brunch options are limited.  That may be why. My only gripe was they are usually more timely with the refills. That ended up being okay. We had more to do later. The drinks are potent! The atmosphere was lit at our table. It was usually more crowded, but the weather was nasty. We had a great time! We will be back. 5 stars."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcUlycVdGd01uUnZ3RRAB",
            "text": "Muy recomendado, solo que por ser restaurante bar el volumen debería ser más bajo, en ocasiones se saturaba, y en estos espacios debe quedar una franja sonora para que los comensales puedan conversar."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcEtDVTJBRRAB",
            "text": "It was a very cool vibe for a Friday evening. I got to experience their Happy Hour specials. Their prices are amazing and service was fantastic. Unfortunately, the same couldn't be said about the food. We ordered a selection of the…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWFIxcFphMjB5U0RWdllYTlBOR3hVUnpaQlUzYxAB",
            "text": "They have a $5 lunch menu and it is fantastic! Yummy, big portion, healthy and very important on my 30’ break: fast.\nGreat place to grab a quick bite but also to have dinner with a big party. I will back soon. I’m still shocked with the price and quality of the food. 10/10!\nI got a salad and rice with chicken and everything , plus taxes and tips were less than $13. I loved it in here!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcGFDQnJnRRAB",
            "text": "This is my absolute favorite spot in Washington Heights. There is no bad time to come to Inwood bar and Grill.  There is something for everyone, Happy Hour, Weekend brunch and Live nighttime entertainment.  The food is good the drinks are even better and atmosphere is electric.  My favorite drink is the frozen sangria and you can never go wrong with the oxtails or steak and shrimp."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NzlqYnJRRRAB",
            "text": "We came here for happy hour on a Thursday late afternoon after some appointments and meetings.  Definitely vibe in the atmosphere and in terms of energy was very electric shoot space we sat at the bar and we enjoyed beef skewers and french fries and we had our one of our specialty tequila and tonic with lime.."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVVUzazVOa0p1VTFCRlpVaHJWemhFVG5kMExWRRAB",
            "text": "Our server Chanty was absolutely amazing. From the time that me and my party entered until we left she was super attentive. Her food and drink recommendations based on our needs were on super on point: highly recommended.😍😍😍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTVNHMWxjSFozVkdKMFIzQkNOSEJxY0VoV1NWRRAB",
            "text": "A very lively bar/restaurant, although the music could have been tone down a notch in the main bar/dining area. Thank goodness our host offered us a table by the side of the area overlooking the colorful hung umbrellas. Service was spot on and professional. Our table was bussed and water refilled regularly by the staff. Happy Hour food and drinks were Àhhhmazing and good value. Thank you, will definitely be back when I'm in the area"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRk56TXRWemhEY1VsaFZVVmhiamhyZEc4MmNrRRAB",
            "text": "The food was amazing and worth its price. Service was great, our waiter (Eddy) actively kept track of us and ensured a smooth delivery.\n\nLastly, the atmosphere adapted to fit the scene, orderly and calm in the day, and exciting and fast-paced at night.\n\nInwood was great for me the few times I’ve visited, and I recommend it to just about anyone. Five Stars!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaGEySmdnRRAB",
            "text": "I recently booked the party hall for my daughter's sweet sixteen on February 1, 2025, and I couldn't be happier with the experience! At first, I was a bit nervous about how everything would turn out, but Karen Veras was absolutely amazing. She made the entire process so smooth and stress-free. Choosing this venue was the best decision I could have made! I'm so grateful to Karen and her team for their incredible help, especially with the beautiful table decorations. The food is an amazing. Thank you for making this special day unforgettable!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVVYzcHlSek5ZYWs1eFQwZzVVRlJPYTB0NmFuYxAB",
            "text": "Todo fue grandioso, servicio, sabor, calidad, precio y atención…..gracias!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVM2VWTTBNbWwyVEhwcE4wbHhYM2xEYUZBMVpYYxAB",
            "text": "Our visit to this restaurant was a mixed experience. The appetizers were hot and quite good, which gave us a positive first impression. The air conditioning was comfortable, and the environment seemed family-oriented at first.\n\nUnfortunately, the main courses were a big letdown. The burger bun was cold, the patty barely warm, the steak was rubbery and served cold, and the pasta arrived cold as well. The pasta sauce tasted like jarred Ragú, which didn’t help the overall quality.\n\nAnother concern was the music. For a family-friendly restaurant, the choice of songs—specifically a Bad Bunny track with explicit lyrics—was not appropriate. I don’t want my kids exposed to profanity while we’re trying to enjoy a meal out together.\n\nOverall, while there were a few positives, the main dining experience and atmosphere need improvement before we’d consider returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaUpiUG9RRRAB",
            "text": "This restaurant to celebrate with your family is a good option. You can share the Argentine grill with up to 4 -5 people. Mojitos were delicious, customer service 10/10. The prices are affordable and they have food for all tastes.\n\nFor birthday people ,they give you a good piece of cake and they sing your birthday. For those looking for more to have fun with friends, the best option is the one inside, which is more of a disco bar. for the patio the decoration of the lights and the umbrellas looks magnificent, besides that at night the roof is closed. I wholeheartedly recommend this site and would go back again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobWEzSDdBRRAB",
            "text": "Great atmosphere. Food is delicious. Keep in mind it is very loud in here and they do allow smoking. Prices are acceptable. Do not get the fish bowl if you think your getting a big one. Its literally a small bowl galf the size of an actual big fish bowl. Use my photos for refference."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSllXdFpjMk0xY20xSk1WVXRPR0puVEdkMlMyYxAB",
            "text": "I had an excellent experience at Inwood Bar and Grill. The waitress Chanty was very nice and pleasant, making sure we felt comfortable and well taken care of throughout our visit. The food was absolutely amazing delicious, flavorful, and beautifully presented. I highly recommend this restaurant for a great dining experience. I’ll definitely be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkOXBQa1lREAE",
            "text": "The lunch specials are $5 for a list of GOOD food and drinks. I got the peppered chicken, yellow rice and brown beans/ mango margarita. If you mix the sauce with some of the rice, DELISH! Latin vibe. Hookah $40 served during their dinner time. The music is amazing. I was there from 2:30 - 9pm. The people are so nice, vibe is amazing. Recommend for lunch and dinner. $5 food and drinks stop at 4pm I believe. Enjoy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gb2NEVkpkRkZZYjFGUGEwMWpZelI2U0cxWVNsRRAB",
            "text": "I heard great things about the $5 lunch special and I was not disappointed. Irvin (hopefully I spelled it right) was an exceptional server. The food was very tasty and a generous amount for the price. I will return."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlLUp2S3lRRRAB",
            "text": "I came here one time for Sunday brunch & this has been my go to place for brunch since. They keep your drinks coming! BOTTOMLESS FOR REAL 🍾🥂 What’s even better is you could switch your drinks as many times as you like Mimosas, sangria, Berlin, etc. 🥂\nThe food is great well seasoned. I haven’t experienced a bad waiter, it’s always a vibe, Prices are affordable, drinks are strong (Just how they should be) & brunch includes appetizer, main course, & flan 🍮🤗. Can’t beat that 🥰 10/10 !! & brunch is about $45 pp.\nMake sure to reserve seating because the wait time could be long."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TlJYQkdWMWREVWxkMllsRllhbFJKUzBvM1kyYxAB",
            "text": "Chante is the best server ! She just did her biggest one ! She did everything we neeeded and more ! I love her she never left us without a pitcher and our food came one time !"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfakpya0lREAE",
            "text": "Food taste was horrible the steak nd shrimp no taste at all  salad dry brunch was boring here muis was to low same songs repeat but the service was good .. food was left just like that as you see in picture"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodWRMQnR3RRAB",
            "text": "Food was good. Drinks were not watered down. Some tables were way too close for comfort, but ok. Came for Thursday dinner with family, and was pleasantly surprised to have live music. Nice vibe!!"
        }
    ],
    "reviews_count": 94
}