{
    "name": "Locksmith Bar",
    "place_id": "ChIJ8eptJAP0wokRedQqUtMxdYM",
    "grid": "MN12",
    "address": "4463 Broadway, New York, NY 10040, USA",
    "rating": 4.4,
    "user_ratings_total": 758,
    "phone_number": "(212) 304-9463",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeE5rSlNXVmwzV21kdmQzWjRlV2d5ZUc5aFZFRRAB",
            "text": "The Peruvian here is so good, so delicious, congrats to the chef that was there last sunday, I had lomo saltado, causa acevichada and chicha. The restaurant is awesome with some Peruvian atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbWNYb3dURFpCVm1KemRrbDFVRzk2VmpWSk5rRRAB",
            "text": "Great local bar/restaurant with great food. Chill by day and lively by night."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTkxUbElZa2x5WWt4RFJrcE5NazVMVmxVeGJrRRAB",
            "text": "Mid 🥱"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwd2QwSnFXR3BVZGtRek5qUXhOMUJZYkVwVWJsRRAB",
            "text": "Great drinks and food 9/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSd1ZHOU9NVVI1Wm1scWVWaDJiMVJCYVhabWFWRRAB",
            "text": "Every time I come they run out of Tito’s and it sucks because I don’t drink anything else"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeWJGSkRTbTFUYm1NeWIxZDJWbVZyVkU5SWRXYxAB",
            "text": "I love it here. The music is great, you can dance or vibe. The drinks are strong, thank you beautiful bartender lady whose name escapes me. Definitely recommend"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN0k2TjRRRRAB",
            "text": "July 6th returned again brunch was a bit off but the food is good.Something  felt off about the the brunch but it was good\n\nThis place just never disappoints I love almost everything here it’s not gonna be on your top 10 but it’s amazing definitely a neighborhood gem 💎. The burger always hits. The tots always crispy and salted perfectly. The wings are ok the other burgers and sandwiches are also good.  Peruvian food is also a hit here.  Place is just good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSE9IRnVka3Q1WjJ4VlREUlRNWGhLVjBVM1JuYxAB",
            "text": "Drinks were ok.. margarita tasted like pure mixer ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSFNuQnVYMWwxWVZwM1VHMHpaa3hMV1doNlRXYxAB",
            "text": "Great service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNFFUVjRTMUZKVWxoVGMyaG1UbUZhYTJkVlFrRRAB",
            "text": "Amazing place highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS2QxaHViMnN4TmxocE9XdFdkbVJRWW1oTU0zYxAB",
            "text": "Everything was really great!! We love Locksmith!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMX1Y0ZmlPaktYWlBREAE",
            "text": "Good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZdFowWmhkbEJzWms5YVZsTk5UbDh5UjFKVmVtYxAB",
            "text": "Very Nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOT0FuZW5qLU9DaWN3EAE",
            "text": "Excellent"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOYV85SkdJd2JHdjN3RRAB",
            "text": "The food and staff there are pretty good. Sometimes it's freezing in there or they play derogatory music, saying they can't do anything about it (yes, they can---plenty of restaurants don't play that music) or that it doesn't really bother THEM. It doesn't bother them because the music is not targeted towards them but that's another story. The service fee is also irritating. I do enjoy the diversity in the menu, the food itself and it is close to home so that makes it worth coming for."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMSDFfUGZGbHVYSDNBRRAB",
            "text": "Fast and reliable service!\nI locked myself out of my apartment in the middle of the night, and this locksmith showed up within 20 minutes. He was professional, polite, and got the door open quickly without any damage. The price was reasonable too. Definitely saving their number for the future!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbU83Tk9mX0tET2hRRRAB",
            "text": "Came here for a friend's birthday on a Saturday night and I was pleasantly surprised. Doesn't seem like your average place in Washington Heights; it felt like I was in Midtown or the Upper West Side. Great drinks and service - bartenders look out for you. After midnight it turns into a lounge playing mainly all types of Spanish music and hip-hop. Worth it if this is your type of scene or if you want to check out something a bit different from the typical spots in the area."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKd2RmcjZ3RRAB",
            "text": "This is a $$$ bar.\nNOT a $$ bar."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJemV6cU9nEAE",
            "text": "Good atmosphere, good music, GREAT food. Definitely recommend & 10/10 & the server Karen is always spot on & great service more than once me coming here. Good establishment."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJemUzaWRBEAE",
            "text": "Went for the first time the wings were top 5 and our server Kayla recommended we try the Lomo. Probably the best Peruvian food I’ve had in NYC overall amazing experience and shout out to Kayla will definitely be back to visit her!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cWJidUpBEAE",
            "text": "Nice, chill place with"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURROWYySUVnEAE",
            "text": "Great experience, nice people and vibes. Came. During comedy night on Wednesday."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcWFybVFnEAE",
            "text": "I went there with high hopes to try their Peruvian food. We ordered a few drinks and food, but the drinks took a long time to arrive. Unfortunately, our food never came because our waitress completely forgot to place the order. After waiting an hour, we decided to just ask for the check and leave. The waitress apologized and comped our drinks, but overall, it was a disappointing experience"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnX2EyT0tREAE",
            "text": "Went on a Sunday afternoon. It was quiet with good energy. The bottomless sangrias are dangerously good. I had steak and fries to play it safe."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnM1lDbVN3EAE",
            "text": "Amazing family owned spot. Personalized experience over commercial experience any day. Quality in the food brings me back year after year, so glad it made it through Covid. I think that the community supports me in saying it’s a staple that is loved by many. Definitely check this place out"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNDVQZFhnEAE",
            "text": "Bartender could work on his people skills but other than that the food was good and the atmosphere was ok."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmZ1lDU3pRRRAB",
            "text": "I've been coming to this place for almost 15 years, and it's been consistent throughout. The burgers are amazing, and you can't go wrong with the wings. The chicha morada is delish.\n\nLocksmith is also a great go to for a fun night out. Great DJ lineups. A lot of dancing and shenanigans has happened here lol. There’s also a late night menu."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcXNMUDJnRRAB",
            "text": "I was so skeptical about the place at first but then our server/bartender was so kind. He made us feel right at home. The food is absolutely delicious. Reasonably priced and good portion dishes. Everything we ordered was made to perfection and very tasty. I really appreciated getting my Pisco Sour which took me back to my days in Peru."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmd29UUjVBRRAB",
            "text": "This is a nice pub that serves Peruvian food.\n\nThis time, I popped in for a drink, but I’ve had the food here several times, and it’s always been spot on. The staff are friendly and polite, making it a pleasant place to spend time.\n\nThe prices are a little on the steep side, but that’s fairly common these days. However, the quality of the food is well above what you’d get at most pubs, so it’s definitely worth it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdGMtVVJ3EAE",
            "text": "Loved the ceviche on top of the  plantain and and the vegetables saltadas.\n\nServers were nice"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OVlHQk9REAE",
            "text": "I had Lomo Saltado.  The beef is hard to chew. Not much heat in the restaurant, I feel cold wind."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwbXA2QjRnRRAB",
            "text": "Great place to hang with friends! Food and drinks are great. Music is awesome."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cy0ybWhRRRAB",
            "text": "Five star"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNnNTUnVRRRAB",
            "text": "The food was amazing! Very flavorful and a good portion size."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbFltTXlRRRAB",
            "text": "Love coming to locksmith thank you George !!He Makes the best drinks in the city. Wings were delicious and if you haven’t tried there burger you are missing out will be back Friday"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYM2N1TGR3EAE",
            "text": "Drinks were fabulous. Food was exquisite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuODdEZHRRRRAB",
            "text": "we stopped in for bloody Marys and a snack. delicious cocktail and attentive staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bnJubHRRRRAB",
            "text": "Connor was amazing and we couldn't ask for a better time and meal! 10 out of 10 recommend LockSmith!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NTdfSk1BEAE",
            "text": "TERRIBLE CUSTOMER SERVICE. Security is very unprofessional, kicked me out because I was supposedly sitting in someone’s seat AT THE BAR , there is not assigned seats at the bar. Also, when I got kicked out they made a lie saying I was being inappropriate with woman when I was not, security guard at the door said he’ll check the cameras and he never did. please do not give your money to this establishment , there are a lot of better spots in uptown. definitely not a good customer experience in there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNienMydXVRRRAB",
            "text": "Best Restaurant I ever seen, great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycUlfZnVRRRAB",
            "text": "The service was really good they were all very kind"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycUlfTkhREAE",
            "text": "Great customer service from Kaelyn.  She was very attentive and helped us choose the best options to order.\n\nThe food was great and the cusquena beer was great me and and my wife enjoyed ourselves.\n\nWe defined recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMTlMakZ3EAE",
            "text": "Nice chill place. Happy Hour is amazing ♥️♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeDlMb3l3RRAB",
            "text": "Great spot it just gets way too crowded drinks will creep up on you . Great DJs"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyc3NibHh3RRAB",
            "text": "Excellent food, good atmosphere, and wonderful services. The ceviche de camarones is the best."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeWI2dUJBEAE",
            "text": "Yummmm!!!! Cebiche"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMLTZpOFlREAE",
            "text": "Truly enjoy the brunch and drinks.. everything was plentiful. And the music.. truly a good vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMczhHVV9nRRAB",
            "text": "One of THE best places in the neighborhood, hands down. The burgers are top notch and the rest of the menu offers a good variety of food and drinks. The Peruvian based dishes are worth mentioning as well, especially the quinoa plate. Things start popping after 8p or so, when it becomes more of a lively party spot.\n\nIf you live in the Heights or you’re merely visiting, this is a sure fire bet. As you can see, I also enjoy their margaritas something fierce."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdllHNEpREAE",
            "text": "They have both indoor and outdoor (front) seating. The last time I was there with my boyfriend, we arrived around 5pm and there was a private event in one section, so I can't say for sure how big the space is, but the area we were in was intimate and small, not uncomfortably so of course. We ordered ceviche pescado, blue burger with tater tots and Buffalo wings. Everything was fantastic...except for the wings. They were coated in a sort of thick batter, which did not make it taste good at all. But the ceviche was so fresh and the burger was cooked perfectly!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbnFDN2ZBEAE",
            "text": "Good food, excellent atmosphere and a very nice hospitable waiter and waitress"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHMkp1YU1BEAE",
            "text": "A great local spot to visit for brunch or dinner. The service is great and the prices aren’t bad for the quality of food & drink. I love coming Tuesdays for the Birria Taco special.\n\nThe music is always on point at night, paired with good food and a good gathering of city dwellers. It’s always a good vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dDhQQThBRRAB",
            "text": "I was so impressed with the ceviche, we did fish and shrimp. The flavors were all there. 100/10. Highly recommended. Burger was really good too. I’ll be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMTlMSTVRRRAB",
            "text": "First time at this restaurant and I was amazed from the quality and culinary depth of the food. Even though it was a quiet Sunday night the service was on point and the food freshly cooked. I got the fried chicken with the colorful sauces,…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdHEzNGhnRRAB",
            "text": "Environment is really chill and the food is really good! It's authentic Peruvian cuisine so if you've never had Peruvian food, definitely check this place out.  The service was fast and on point which is always goodbto know when going to a…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROElHUUlBEAE",
            "text": "Great place every causal, comfortable environment. Amazing service. The food is worth the wait and there is a great selection of beers. There have turkey burgers for anyone that does not eat beef, the burgers were very juicy and tender. The…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwLVlXLWVnEAE",
            "text": "The locals know about this place as it’s often packed. Yet, it’s a hidden gem within NYC at large. Best ceviche I’ve found, and at very reasonable prices too! If you’re super hungry, you can upgrade to the ceviche + jaleita (calamari rings) combo, though the ceviche on its own is already a full meal. I sometimes dream about the chicken causa. The birria tacos are amazing too. The food is downright crave-able."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoZzZHQ0t3EAE",
            "text": "Locksmith bar is the kind of place that makes you feel like you've stumbled upon a hidden gem in the heart of the city. The moment you walk in, you're hit with an amazing vibe that's a perfect combination of hip-hop and pop culture. It's the kind of place where you can kick back, relax, and soak up the atmosphere.\n\nWhat really sets Locksmith bar apart is the crowd it attracts. Regulars like Desus and Mero are always here, adding to the cool and relaxed atmosphere. But it's not just about the locals - Locksmith bar is also a hub for global artists like Pete Wells, the New York Times' most prestigious food critic. It's easy to see why people from all over the world come to experience the unique vibe of this place.\n\nAs for the drinks, the bartenders at Locksmith bar know their craft. From classic cocktails to innovative concoctions, they have something for everyone. Whether you're in the mood for a refreshing gin and tonic or a smoky mezcal margarita, the bar staff will hook you up.\n\nBut it's not just about the drinks - the food is also top-notch. The menu is a perfect fusion of flavors, with everything from classic comfort food to upscale bites. The fried chicken is a standout, crispy on the outside and juicy on the inside, and the truffle fries are a must-try.\n\nAll in all, Locksmith bar is a place you want to be. The vibe, the people, the drinks, and the food all come together to create a truly unforgettable experience. If you're looking for a spot to kick back and enjoy some great company, Locksmith bar is the place to be."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NWNXSmFBEAE",
            "text": "Went there with my daughter, we love Peruvian food that's prepared properly and with the correct flavor and their food meets the expectations."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNmRlY3lnRRAB",
            "text": "Fantastic drinks, food, and service in this quaint Washington Heights bar. The ceviche was incredible and the outdoor seating is perfect for people watching on a sunny NYC afternoon. Go for the house cocktails and service, stay for the fun lanterns and atmosphere."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrNWNfLTlBRRAB",
            "text": "Good service and lots of burger options. On the weekends there's brunch and lunch! Some of the food is even Peruvian!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGa2JmbFhBEAE",
            "text": "The bartender Conner was great. The food and drinks were amazing. I’m going back to try some other dishes on the menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOGZESGZREAE",
            "text": "It was my 1st time in Inwood, a beautiful day so I  decided to walk Broadway uptown after an appointment at 181st. Just stopped in this place for food & happy hour. The staff was wonderful and the Blue Burger I ordered was absolutely delicious &  the sweet potato fries were perfectly done. My margarita must have been strong since I floated to Dykeman. The Locksmith Bar is highly recommended & a new uptown spot for me."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvejlMTGZnEAE",
            "text": "One of my favorite places in the neighborhood.\nGreat Brunch menu. Just $6 for Bloody Mary.\nTry their shrimp basket and Mushroom burger with rosemary house potatoes.\nOpen till 4 am. But get’s very crowded on Weekends nights. Hard to find a sit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMTcyWmhBRRAB",
            "text": "Love this place! It’s become a staple for whenever I visit my mom in the city. Food never disappoints. Have brought so many people here over the years!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLMk55QnZnRRAB",
            "text": "I really like this place. I think it's one of the best if not the best restaurant in Inwood. I believe most of this food is Peruvian based.  Great service, great ambience, great drinks, great food and great presentation."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OWVyVk5BEAE",
            "text": "Locksmith have really upped their food game over the years, i love having a beer with some yuca fries and the lomo is hot and delicious and full of onions which i love. This place is always the spot to come chill, packed house on weekends with a DJ so careful on what time and day you come in."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5LXFYX0tBEAE",
            "text": "Burger was delicious and so was the Henny Coolada. Will definitely visit again!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJeTlMSHd3RRAB",
            "text": "Love going to locksmith ! Recently went there with a friend for lunch and had the kick smith burger with avocado and yucca fries and it was absolutely amazing ! They also have a good selection of beer. I usually only go at night for great company and music but might try to change it up and go during the day more often"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2a2NlZ3d3RRAB",
            "text": "Great service and the food is delicious. Try it, you will not be disappointed!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpcVkyVkxBEAE",
            "text": "My go-to delivery place. I get the beyond burger with cajun tots.  I’m always satisfied!  the tots are always perfectly crispy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNteVo3aEV3EAE",
            "text": "Great drinks, awesome atmosphere and delicious food."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRd0xxT0dREAE",
            "text": "Great music, decent location to subway stops,  it's just kinda small. The staff is great and serve drinks pretty quickly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ3BXNzJRRRAB",
            "text": "This is a place you do not order food from, you go there for the atmosphere. if you’re looking to hook up with someone, it’s a great place to go to the drinks are trash the water down ordered Jameson and Coke. There was no Jameson and Coke instead some other liquor. It’s got some decent music when they play 90s other than that it’s just a young people hook up bar."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURtejdsehAB",
            "text": "Very cool ambience for after work drinks ,perfectly cook wings very crunchy and flavorful and the fried calamari were on poin.. I'll be there soon again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwOWJuZ1VnEAE",
            "text": "This restaurant is a staple in the neighborhood. I’ve been a big fan of their burgers for years, but the last time I ate there, the burgers didn’t impress like it used to. Maybe the kitchen was having a hard day, but the ingredients didn’t taste as flavorful or fresh as in years past. The environment is still great with good music and great service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbHVtRy1nRRAB",
            "text": "Went here tonight and the restaurant was packed. The host, servers, and bar staff all were kind and took their time to help us despite the full restaurant. They got us seated and really took their time to make us feel like valued customers. The food was also great. The egg on my sandwich was cooked perfectly (which wasn’t the case at the last Michelin reviewed restaurant I went to). We will definitely be back."
        }
    ],
    "reviews_count": 76
}