{
    "name": "The Hudson",
    "place_id": "ChIJGfQD5f7zwokRvKJ7ouEAXXQ",
    "grid": "MN12",
    "address": "348 Dyckman St, New York, NY 10034, USA",
    "rating": 3.9,
    "user_ratings_total": 2074,
    "phone_number": "(212) 304-1110",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNFVtRkRaRkpWVjBkNWJXeHlSbFpoZGtsdVgwRRAB",
            "text": "Slow service. Mixed up food order. The food is subpar. Long waiting time to get anything - food, drinks, refills, check, etc. The only good thing about this place was a relaxing misic and the view."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVVZYbE9MVUl3TUMxbmMxaGtWR2czYzJoNmFWRRAB",
            "text": "Waited so long to order ay the bar, we sat down outside, nobody offered to my order. The guy who said he’d take my order (Mohawk ponytail) never came back.. it’s really sad how black folks STILL get treated in 2025. Awful… but thanks to the guy who finally serviced me."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CT1kzcGFjV3hqYjFWaFUzTkxSMWRKT1U5V1lYYxAB",
            "text": "Un lugar relax para compartir en familia , parejas  y amigos"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zeWVFbFdaMFI2YWxnMldWaGFlbU5HTTFwUlpGRRAB",
            "text": "Freaking gorgeous place ruined by music so loud is absolutely impossible to hold a conversation. Very pricey, which would be justifiable would they not ruin their ambiance with noise."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjM1QxOUdVVVF0YjBSWGRWcHNZemRITjFjd1dtYxAB",
            "text": "The drinks were great the bad part. All the food is basically fried for such a nice view. And now New York City parks and recreational charge $3 dollars a foot to park a boat. SMH. Overall, I gotta say it’s one of the best views that I ever seen on the Hudson river"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KS2VXdERabU5KVERWTGVpMTNZMEZJUkVWME9XYxAB",
            "text": "What wasted potential! The location and place itself is beautiful but it’s ruined by terrible food, limited options, and bad service. I ordered the lobster roll but it was 90% bread and 10% lobster. The bread was cold and not toasted or buttery. For almost $30 it was terrible. We sent it back and ordered the burger instead- but the table behind us told us that they just sent back their burger because they were bad. We cancelled our order all together. The service was horrendous. We asked for salt and lime for the guacamole (it’s crazy that we even had to ask for that), they never brought it. She took forever to come take our order. I asked for water 3 times and they never brought it. The whole thing was a disappointment and probably worst restaurant experience of my life, which is sad because the location is beautiful and its in my neighborhood!\n\nAdvice to management: You need better cooks, a better menu, and train your staff. No one is going to pay over $30 a meal for crappy food and shitty service. It was dead on a Sunday during brunch. Have a better brunch menu and do some promotions or something. Bottomless brunch?? Literally anything will make the place better."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204d1ZrRnhkRmROUm1SV2FuUnViMmxtZUdvMmVtYxAB",
            "text": "We arrived about 5 minutes early for our reservation and were seated promptly. We were actually celebrating our wedding anniversary and loved the location of the restaurant. But after we were seated, we waited 25 minutes and no one ever came to our table. We stopped the hostess and asked for a waiter, and she said she would send one over soon, but 10 minutes later, we were still waiting. We managed to flag a waiter down and he just seemed annoyed with us. I explained that we had been waiting about over 30 minutes and he dismissed me and said if we gave him the order, he can submit it. No apologies, no empathy. I asked if he understood why we were a little upset, and he explained that that night, there were only 2 waiters working. For a Saturday night, that was surprising. My husband and I decided to leave then, and we ended up going to another restaurant nearby, but we were so disappointed and frustrated from our experience at The Hudson. It was disappointing because we were really excited to try this restaurant and celebrate our anniversary there"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NFpHUklXRXhIT1Zkd2QwcEdXbmh5VVhoa1ZIYxAB",
            "text": "Horrible service I went to my best friend retirement party, first the no many option on the menu , drinks are super small they serve them on a small 5oz plastic cup and full of ice even the mimosa on a very small plastic cup , the food was cold the waiter never come to the table to ask if we need something by the way all the dirty plates left in the table for a longtime sitting there!! Never again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNME1FaFNSV1J6VVhjeVdGUm9UM0V4VjJ4alJHYxAB",
            "text": "The bartender serves very good drinks the best of the best 100% recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMmVtazNOME51UjI1VWVtaFRXSEF0WkhCdFprRRAB",
            "text": "The staff treated us quite poorly. Very poor service. We were a table of 4 and they included a 20% tip when the menu clearly states that it is included for tables of 5 or more people. We spoke to the waiter and he blamed the system (which we know has nothing to do with it). We had to speak to the manager to get the tip they stole back! 08/30/25 7 pm!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xa01ucFVUbnBNUVRacVVrWmhVM1ZLYnpSWWFWRRAB",
            "text": "The worst place to eat, the service is terrible. They’re supposed to add the tip only when the table has 5 or more people, but they added the tip to my table of 4. They charged $70, which I paid unwillingly because the service was bad."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNExWZ3phV0p3TlVOM05YTk9WMW8yZGtWTWVVRRAB",
            "text": "Terrible service. Drinks and food were just average, but the service ruined the whole experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTFFrSmxlVEpEUjNKNGFrVmpZM051U1haVmExRRAB",
            "text": "great location, good food, nice crowd, fun spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcmJEQjZWelp6WkY5SlZteENTVTEzWHpKWmRFRRAB",
            "text": "Island vibes and good food with scenic views."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNU5rSTBkVUppTWxOck5Fa3RTVWRxWjNwVU1rRRAB",
            "text": "Espectacular ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaWJXWmFOVEZ0ZFV0QlVWZ3pYekZFUW1oRlpHYxAB",
            "text": "Beautiful views on the Hudson. The service was lovely and attentive. The food fresh and delicious.\nI had the rum punch, it tasted like vacation in a glass!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcFVVRmlTMVF3YVV4RlltVllZVzVzUzNKM1JFRRAB",
            "text": "I came there on a Sunday afternoon around 3.20pm in the hopes for a snack. First of all, there was a sign in front advertising a Saturday Sunday happy hour that was non existent. The hostess in front also then told me the food service is currently on break and will commence at 4pm. I took a drink while waiting and saw other people getting food and snacks. At this point it was already 4pm so figured the food service had started. I try getting the attention of a server which took a while (was there alone so didn’t want to leave my stuff unattended). Once the server finally came to me he said they don’t serve food right now and wasn’t sure when they will do that. And he had no idea why the lady in front said 4pm. Yet I see other people ordering food all the time. Another server was equally confused why I was told I cannot order. I’m so pissed off and hungry, will not recommend this place to anyone."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMloyOUlNMmxwYm1aUVJrVlNXVkpVZFZOaWNrRRAB",
            "text": "This was the worst place we literally went there and they had 1 menu and it was 3 of us and they had no manners they were screaming and they never gave us our food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJdFNXOHpMVEJZTXpGd2IxUXpZbVZwVldkbVlsRRAB",
            "text": "I love the relaxed and chill vibe The Hudson has to offer. Most importantly dogs and families are welcomed. I feel like this place is not over hyped or over crowded. I have always been able to grab a table by the water and just relax and the staff here is amazing. The pina colada is so good if you’re into frozen drinks on the sweeter side. I’ll be visiting all summer!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veGJrdFNTMHRRU25Jd1RsOVpkRXBSTkZFNWFVRRAB",
            "text": "I had high hopes for this establishment.  When I arrived, my guest and I were ignored completely. Others who arrived after us were greeted and seated and handed menus. It was not till I asked more than one employee that I was handed a menu and told pick a table.  Once seated, I ordered an appetizer. The appetizer was taking a long time to arrive,  so I called for our waitress.  I was talking to her co worker. She came to the table and informed me she forgot we ordered and would go get it. After appetizer arrived, I ordered the main course for my guest and I. My guest and asked for a well done hamburger but was given medium rare. The only saving Grace was a young man dressed in black , wearing a black baseball cap and studded diamond earrings. He helped my guest and I receive the service and noticed we were being ignored. If he was not on duty today the experience would be unbearable and  I would have left immediately. The restaurant is beautiful and it was such a disappointment. Hopefully, staff can be re-trained, it is truly a beautiful location."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMk0xSjZZVEZ2VURsMVNHSmhZMU4zVEU1UlIzYxAB",
            "text": "Must come early for parking and the music was terrible"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbllWa3dOMHRqUmxvMlZHaHFlVWwzYkVsdVFYYxAB",
            "text": "Stop by after bike ride. Nice hanging out place by Hudson Rive on top of Manhattan. Love the outdoor dinning under the shade. Meat Ball is savory. Fix for my small appetite."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQ2IyZHNTakEyTkdONE4wZGxNblYwUjJneVYxRRAB",
            "text": "Love the view, the vibe , the atmosphere 👌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxU09VdzBkRmhHVkZKdWNIcDNkbGc0TFhRMU1VRRAB",
            "text": "The service is slow, and the food is... okay? The cocktails are a bit sweet for my palate. However, the view is beautiful, especially if you can time arrival for just before sunset."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bFRuRnVTMWR2VERRMlNqY3hOWEZRYXprMlMyYxAB",
            "text": "Atmosphere here is amazing, and while food and drinks can be pricey, the environment goes a long way towards justifying it.\n\nIt all falls apart on the service side. I will often go early afternoon for drinks and a light dinner, and while I will almost always have my order taken quickly, any additional service or even getting the check at the end is extremely difficult. Even requesting a check from other service staff, my server will never be seen again. This last time it was bad enough that I left cash on the table and walked.\n\nEverything else here is so great, that I wouldn’t even be mad if they moved to lighter table service during non-peak hours. If it meant I could pay for my check or order additional items, I would be OK using a QR code. Ideally, they would just get the service levels fixed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVlIybHhaMGhRZWt4eFpHeExVV0ZLUW1GSmQwRRAB",
            "text": "AVOID! I was more nickel and dimed here than a Spirit airlines.\n\nService was no where to be found. Half the menu was not available. 35 dollars for a pitcher of soda.\n\nBill arrives with over 30% surcharge with no notice.\n\nThis place is either a scam or a front."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReVFqTlpVbVEzTlRFdExWTnRTRmhpWlZodE5IYxAB",
            "text": "Great place by the river! Adelina was so nice and a great photographer!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRVpUbEdaSGh5T0ZFM1EySk9hMVpaWmtwbmRYYxAB",
            "text": "Horrible place for a casual meal. 4 of us were seated and an event seemed to be happening soon (something I wish they would have told us!) because the entire time the staff was rearranging tables around us and carrying tables above their heads and such. The food was way overpriced and not the best. Waitress was no where to be found except to refill water twice. Had to get up and run around looking for her after 20 minutes waiting for the check only to find another person was now our server. Such a shame for the beautiful view! Maybe it’s better for events, but certainly not a meal with friends."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psZlpEaHZSMnBKZVdoRGRYUXdSbE5qY2tSdmNtYxAB",
            "text": "Tasty food, and beautiful scenery, but food is too over priced. Even a lemonade I ordered was like $10, and they litterly served me a cup to the rim of ice, which obviously produced 4 sips of juice! It's good, but not for that price."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205S09VNWFiSFowWmt0Sk1IWkJUekZSZUVaRFNFRRAB",
            "text": "El lugar tiene una vista hermosa que me encanta. Es fresco, amplio y perfecto para una cita o para ir a un sitio relajado a compartir. Sin duda, el ambiente es uno de sus mayores atractivos.\n\nThe place has a beautiful view that I love. It is fresh, spacious, and perfect for a date or for going to a relaxed spot to spend time together. Without a doubt, the atmosphere is one of its greatest attractions."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aelNuSnhSRlZmTW1GdmJXTm1WRFJ1YzBGUWVYYxAB",
            "text": "The restaurants outside seating was a great environment. It’s right by the water, very clean and comfortable.\n\nThe bad rating is because our server was really bad. The other staff was trying to carry his weight by helping us but they couldn’t make up for him completely forgetting about our table over and over. We were sent the wrong food and drinks and waited too long on a slow night to get anything we asked for.\n\nIn the restroom my door had no functional lock and was missing soap for a while. I ended up having to use soap from the men’s room or I wouldn’t have been able to wash my hands.  It looks nice but I would not recommend going here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVWVHbFpPVmRIWkRCaFRqTjVjM2hzTldKQlEyYxAB",
            "text": "No vegan entrees for brunch—disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSc1REWnhXVUkzVm1aQlYwWlhRakZpWmpGTVZGRRAB",
            "text": "I had a great time at the Inwood Art Works showing of Roberto Benigni’s Life is beautiful!!!\nThe production is great and the ambience and atmosphere including the band was beautiful!!! The food on the other hand from The Hudson needs improvement to say the least!!! The Guacamole was bland and even after we squeezed 3 maybe 4 slices of lime in it and added 2 salt packets it still tasted like a Subway bag Guac!! Sorry but for $16!!! I want more for my money! Also the Corn Rib Elote is very misleading since it has no rib!!! Why do you call something short rib elote if it has no SHORT RIB ?!?!? Again for $17 I expect more than 3 overcooked pieces of corn with chipotle mayo and a couple dashes of Parmesan. The wagyu meatballs were really good and tender and the sauce was very flavorful!! As well as the mozzarella sticks that came out hot and had good flavor!! The only reason I’m giving 2 stars in this review is because as I was ordering the food at the bar, 2 ladies in their late 40s to early 50s were stumbling obviously intoxicated asked the bartender if they can arrange a taxi to get them home!!! The bartender then replied and I quote!! “We don’t have a taxi line here”!!! What!?!? I work in the industry you are liable for one over serving said customers since they both still had margaritas in their hand!! And 2 making sure they get home or somewhere safe!!! I didn’t not want to make a scene but I was very upset at that action! A couple minutes later, I myself saw when I was purchasing totes from the Inwood Arts Works table one of the ladies sitting on the ground and the other one trying to help and desperately asking a man that was walking by if he can help her to hail a cab!! He said no and walked away from them both!!!! I walked over and quickly googled taxi near me and called the first one on the list told them where the ladies were headed to and where the pick up location would be( The Hudson)!!! This took me less than 5 minutes!!! Why would someone refuse to help a guest they over-served I get it, we live in NYC help yourself but also be a human!!! That woman on the ground with her skirt could be your sister, aunt or mother!! Shame on that bartender and shame on Hudson teach your bartenders when to cut clients off and then help get them home if needed! It’s not just the right thing to do it’s law The Hudson!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMFJrMXJTMHhEY0ROaU0wWkdZVWhWYmtaVE9YYxAB",
            "text": "I had my little DIY wedding ceremony here in June and cannot recommend it enough! The views were obviously beautiful. The staff went absolutely above and beyond to help everyone at my event, they were all so wonderful and kind. They even opened up an area that wasn’t included in our reservation so that elderly guests had a cooler and more comfortable place to sit. I didn’t get to try any of the food but I heard it was all wonderful. I can’t believe the services and attention we got vs. the price we paid. AWESOME spot to host a private party or just hang out!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201M1kwUkpRVFV6VldGUWJFTktURGt3T0ZsUFZGRRAB",
            "text": "Great service !\n& Anthony from their staff members very friendly I would definitely pay another visit"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SS1lYWnRVMUZxVG0xQ2NrcHVVVmh6UWpSRGFtYxAB",
            "text": "Great food! Very small menu, but it's perfect, you don't need more. Delicious meal, perfect location on the water. Nice place!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNGFHaG9OVWh1TkRrdE1GRlNSMkUwZVMxeVRHYxAB",
            "text": "Super disappointing.  This place could be the most amazing place.  The location and views are amazing.  Overall the place is run down and dirty.  Ok for a drink just because of the location. The food was less the ordinary and for being ordinary cooked poorly, chicken sandwich was heavy bread and cheese little meat, fries not crisp, eggs Benedict toast or potatoes not crisp."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eFJTMVhlSE0wWW04eVlXMUROak10WDBaWVJIYxAB",
            "text": "Really nice service staff and great ambiance.  Food was surprisingly good as well, great salads"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcmVHWjRlRnBmYldVMmRqSlNPVlJLTlZOUlRsRRAB",
            "text": "After the umbrella fell on our table, we were moved further from the water -the umbrella was broken, they said. 5 minutes later another party was seated there under the same umbrella.  After the umbrella caused some of our drinks to spill, staff said they’d comp our drinks. When we got the bill, drinks! They said they meant we would replace the drinks that you got, but you’d have to pay for them. Crazy.\n\nWhen I noticed people were throwing hand towels onto the bathroom floor, I told the maitre d’ there was no garbage in the bathroom. She immediately went to remedy, but 2 more visits revealed still no receptacle and plenty hand towels in the sink and on the floor.\n\nAdmittedly, having someone in our party who was in a wheelchair, made things a little more complicated, but the restaurant did nothing to facilitate that or any other aspect of our lunch. Too bad because the place is stunning."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VE15MVBjamgwTVVSR1IzQkVURmxDV0RSSGMxRRAB",
            "text": "Went there for a company outing. The view is nice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSGEyOWFVa2ROUm1ZMVl6ZHhjekp0TXpWSWRVRRAB",
            "text": "Drinks were good (water). Food was non existent, and service doesn’t exist. We got seated and waited half an hour to be greeted. We walked out. Location makes for great photo ops but that’s it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVVJWSlFkMnh4TVd0NFV6bHFlSEV0V1d4d09XYxAB",
            "text": "Beautiful setting , service was terrible , we asked for bottle beer list , we were told only presidente available by waitress, later found out there was other selection of beers  , poor menu , also they Automatically added 20 % tip on our check , no where on the menu does it say it ,  Won’t be back and would not recommend ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbmFWTkNWMFpJUWxwVWJVZHBaMnh4ZVVkdlNtYxAB",
            "text": "Went on the 4th of July, the scenery was beautiful, but the service was terrible. We waited forever to order, even though others who came after us were helped first. I had to get up to ask for our waitress. Our waiter was super nice but No water, no utensils, no napkins we had to get everything ourselves, including ketchup. The view made it somewhat worth it, but overall the experience was not."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNWNVdE5la3BJWkVaRVJVNU1UMU52TFVOb1kwRRAB",
            "text": "Good place for drinks amazing views on Hudson. But very bad food come here for drinks and appetizers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOb2VXRnRSbVl5VjFOblZtNVhaVTVPUkhkVlRFRRAB",
            "text": "I was there for a Bar Mitzvah.  The food was very good and a huge selection off a few different buffets. The staff was wonderful at every food station and the place itself, had one of the best locations and views of any place I've been in the City.  You had amazing views in all directions,  parking was easy , loved it!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT1dVRjJXVmhzV0hwR1N6UlJNREJGTmxWSE1IYxAB",
            "text": "We just had my daughter's wedding here and it was a great experience! First of all, the location is jaw-dropping. So everyone came in excited to be there. In addition to that, the service was excellent from the cleaners to the bar tenders. They worked very had to accommodate whatever we needed to make it a joyful experience. And it was. Thanks to the whole staff!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTGJUQnlOa2RKTlZCdFVuVkNRVFZzU2xaNVYwRRAB",
            "text": "This spot is very gentrified. The music is too. The drinks weren’t good. I got a strawberry margarita pitcher and it was so sour, we couldn’t drink it. We got another pitcher on the rocks and it was ok. The food was alright, they don’t have many choices. They have more bar food than anything, and only 5 large plates if im not mistaken.\nThis is mostly a spot where you have a drink and just relax and enjoy the view. That’s all. I was disappointed at the menu, and upset at the drink I had. So 3stars for me!\n\nPS: This is a very beautiful clean place, the view is amazing 😍 it’s a nice place to come chill at in the summer."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNlExWTRTRkZTTFVScmRXOXlMVXQxYW5ORFQzYxAB",
            "text": "We did our wedding at the Hudson and it was great!! It is an extremely beautiful place. The food was really good. The manager Abraham kindly worked with us to make the day very special. It was relatively affordable. Julian the photographer was great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKa1JuQkJlRVZoTlZOb2FXOWhka056TlMxbVpGRRAB",
            "text": "Beautiful views marred by the abysmal service. I met a friend there, it took the servers over half an hour to come take our order, and another 35 minutes for the drinks to come, and the food itself didn’t come for another 15. Quite literally we arrived at 7:50 and our food did not arrive until 9pm. We ordered the bandeja ($45) and a great deal of things were missing from the platter. They added wings instead of chicharron, there were no tostones, or yucca fries either, instead they added fries.\n\nIt’s one thing to get an order wrong but don’t drop a dish that clearly wrong, then don’t address it and try to charge the same amount."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscVZVeHVVMDh0UVhSNk9FTjJTV3RrU20xNFQwRRAB",
            "text": "I want to leave a special review for the photographer Kyle! He knows the lighting and his angles and he’s super communicative!! His energy and professionalism was top tier! He’s going places for sure !!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abmNuQmxhWFZ1V1VkUFNIa3lVVzFRUkRCWmJrRRAB",
            "text": "There’s a not many selections of food 🥘 and the food that it is listed online is not same as the menu that was provided. Online said kids under 8 eat free which is not true. The atmosphere is nice but too many mosquitoes flying around like crazy. I hope this review can help the management to make some changes and can improve a better quality review. I say this with my most sincere and humble comments🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210M1NtaElWREZoUkc4NU1HUkNMVUptV1dscFZHYxAB",
            "text": "The food was tasty—on the pricier side, but overall enjoyable. The atmosphere truly stands out with a beautiful location and great ambiance. Unfortunately, the service fell short of expectations. Our server seemed disorganized, forgetting parts of our order despite having a tablet in hand. We had to ask twice for utensils, and a medium filet mignon arrived well done. Additionally, a gratuity was automatically added to the bill as a “standard,” which felt a bit presumptive given the service level."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZTltcWFMNThlMnBnRRAB",
            "text": "We had our end of the year party here. We had the restaurant to ourselves since we had the party early in the day. Carlos was super helpful. He kept in touch with me and sent me pictures of the layout. Someone came late and we had no food left so Carlos made sure they made him something. The views are spectacular"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaE5UUlBBEAE",
            "text": "UPDATE: I recently returned after the manager invited me back for a complimentary meal, and I’m happy to say the experience was much improved. The staff was warm and welcoming, the food and drinks were great, and the overall vibe felt more put-together. While the initial visit was disappointing, I’m glad I spoke up—it seems like things are moving in the right direction. I’ll definitely be back once summer hits its stride.\n\nBUYER BEWARE🚨REVIEW YOUR BILL BEFORE PAYING!!!!  Long story short after navigating a few detours by bike to get to this place, my friends and I finally made it to this seemingly beautiful establishment.  We were seated within minutes of arriving and ordered  drinks and fries 10 minutes after sitting. Drinks came out 10-15 minutes after ordering and then the fries came out 30 minutes after our drinks. It appeared the kitchen forgot about our order despite it being slow at this place. Fast forward to me receiving the check and paying, I noticed our waitress swiftly tapping the \"No Tip\" button before I had the chance to decide. I made the assumption she didn't think she deserved a tip because of how late our food came out, but boy was I wrong! After tallying up what friends owed me I realized that the numbers weren't numbering. I go to the bar to get an itemized receipt since our waitress left. He calls her they speak for a bit as if I weren't there and to my dismay I see a 20% gratuity charge on the check. Since our waitress left for the night I confronted the manager and he claimed it is a policy they have of charging parties of 2 or more 20% gratuity. However it was not mentioned anywhere on the menu, website or on the sandwich boards within or outside.  Please explain this absurdity! Lastly, if you're still considering dining here due to your abundance of wealth, I urge you to steer clear of the Gruner. It's simply not worth the hassle! Great views, nice staff with the exception of this shady waitress and manager, menu selection nice, fries were 5/10."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eVRFdENaVXRtUjJWb2RUVmlOVXB2TlhoRk5GRRAB",
            "text": "This place is always a good time. I came here for a Que lo Que event and had a blast. The drinks are good, music is good and the food is delicious. I only wish they had more bathrooms. The line for the female’s bathroom gets soooo long. Will be back here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZ3VIRnJBRRAB",
            "text": "Came here on a Wednesday afternoon after work (4:45pm) with my hubby.\nHad a Resy reservation, but there was no visible host to receive us.\nIt was more a self serve type of situation as we ordered our food at the ordering station/bar, seated ourselves and picked up our food when our buzzer went off.\n\nI’m giving 4 stars because they were out of their “sunset hour” sliders (both beef & pork).\nWe got there super early, so not having their happy hour food in stock is quite unfair and unacceptable to be honest.\n\nMy hubby had the other remaining sunset hour food option, which was the:\n- oyster special (6 for $12)\nHe said the oysters were decent.\n\nFrom the regular food menu he had the:\n- clams casino ($16.95)\nHe said they were decent.\n\nI, a vegetarian, had the:\n- fried cauliflower with BBQ flavor ($12.95)\nVery generous amount and yummy!\n- veggie tacos (3 for $13.95)\nGrateful for this veggie option and I enjoyed, but truthfully not the best veggie tacos I’ve had.\n\nAlthough it wasn’t really what I expected service wise, the food being decent, that scenery however is just amazing (weather permitting of course) as is the vibe, so I absolutely will return during next year’s summer season!\n\nP.S.\nI also LOVE that they have their own photo booth! $6 for 2 photo strips!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyZ2NEdUlREAE",
            "text": "We recently  ate here to celebrate 4th of July and were amazed that we could watch the fireworks show off the Hudson River.  Sweet bonus! The food and service were awesome! It us right on the Hudson so you feel a cool wind off the water.  Very lovely  for the su set as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcXUyR1NBEAE",
            "text": "The food was alright — the portion sizes were a bit small. But the views and environment are amazing, especially on a hot summer day. Their bottomless drinks for brunch are decently priced at $25"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6d2NDZ0NBEAE",
            "text": "Found this place after looking for a nice place to go after work. Great find by the water and great vibe. Dog friendly and group friendly. It’s more of a hangout spot rather than a sit down meal kind of place. You come for the water view and cool off after a warm day. There’s a foosball table, shuffle board, and some other game. Just got a drinks and their truffle fries. Their truffle fries actually tasted like they had truffle oil unlike other places that you can barely taste truffle. They have happy hour until 7pm. Getting there was easy right off the west side highway. Leaving at night is one thing. They’re right by a park so it’s open to the public. Try not to linger out in the area too late. The service was good although it took a while for the food to come. The drinks could’ve been stronger, but we ordered during happy hour so that could be a factor. I just liked that it was a good find and it didn’t feel like you were in upper manhattan. Comfy seats and umbrellas. I’d go back again just for happy hour and the fries. They have limited food options so don’t come hungry."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdVptWjF3RRAB",
            "text": "If you are looking for a nice atmosphere this is definitely the spot. Unfortunately that's it.\n\nLet's begin with the drinks. Lucky enough, the drinks were good. We all had a round of Pina Colada's (Virgin and regular).\n\nThe server, recited our order and all seemed in place for a delightful gathering.\n\nThe food... for appetizers we had the popcorn shrimp, stuffed clams and guacamole and chips. The popcorn shrimp were slightly over cooked and the dressing on the side tasted like mayonnaise. Not the greatest. The guacamole was presented in a small dish within a large plate of chips accompanied with a ramekin holding a tiny Tabasco sauce and lime... the highlight of the outing. The stuffed clams were good but a bit overcooked.\n\nFor our entrees... first and foremost we were a party of 7 and they completely forgot to order the hamburger which led one of us to wait for what was described as \"NOT WORTH THE HYPE!\"\n\nThe Lobster Roll- dry and served on slice bread. The butter held an odd smell and taste. Needless to say, unappetizing and went back to the kitchen. Onion rings were ordered which they forgot to order as well.\n\nThe Smoked House Ribs held very little smokey taste  despite being advertised as \"smoked for 10 hours,\" as described by the party.\n\nThe Birria tacos arrived without sauce. When the young man was made aware he went to my plate and stated the sauce for the Birria tacos was on the Steak plate. Smh The sauce was also too spicy.\n\nTwo orders of Salmon Teriyaki, for the most part it was delicious, although slightly overcooked. The skin was crispy and vegetables and mashed potates were cooked to taste.\n\nThe Steak arrived without a knife to cut into it, accompanied with fries. The fries were crispy however I requested the steak medium well and it was a well done steak. =-(\n\nLastly, the hamburger which arrived late due to not being ordered with the rest of our parties food was \"NOT WORTH THE HYPE,\" as described by the patron. You are charged for the patty and bread and any extras are and additional charge.\n\nOverall the atmosphere is beautiful, the view is astonishing and the breeze made the outdoor setting memorable. As far as food the appetizers were better than the entrees. I give this place 2 stars given thr experience/food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1cHJiRldnEAE",
            "text": "Great food but expensive. Is it worth it? I sure though so! Portions were nice as well. The spare ribs I got were very tender and juicy and fell right off the bone! That Mac and cheese was creamy and paired well! The salmon and rice was…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPa0t6V053EAE",
            "text": "The view makes this a 5 star place for a date, a party or if you just want to relax. The fried Fish sandwich was amazing while the rest was decent and nothing amazing. The prices are very good considering most places surcharge for the views.\n\nThey have tons of space, game boards, marina, making a good location for holding parties, where they would bring everything to your table and take the order (from pre-fixed menu). If dining normally, you would need to pick up your meals and drinks yourself."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMzZiaGVREAE",
            "text": "This venue provided a wonderful setting for a family gathering. With a wide range of seating options from indoors to outdoors, we were spoiled for choice. The shared plates offered were fantastic, ensuring we had plenty to take home. The kids' menu was impressive, and the abundance of large games added to the fun atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwLUpidl9nRRAB",
            "text": "It pains me to give only 3⭐️s to The Hudson because I think going there is a GREAT EXPERIENCE. But that is due mainly to the incredible views and breeze, which has little to do with the resturuant. That’s NYC, all on its own.\n\nWe went on a Tuesday evening when it wasn’t very busy at all. Seating took a moment (no one else was waiting), and once we sat it was about 15 minutes before an overworked waiter arrived for our orders (the location is cripplingly understaffed).\n\nA couple quick notes:\n1) the pins colada was only 1/2 frozen.\n2) the Caesar salad had wilted lettuce and red ends. You can see by zooming in on the photo I’ve posted.\n3) the short ribs I ordered came with brussel sprouts on the menu but none came with dish. No explanation given either. Getting a waiters attention to amend would have taken another entire evening.\n4) the waiter - though kind - only paid attention to me and never made eye contact with my partner in some odd way. This happens on occasion when going out, but the feeling of being ignored by a waiter needed to be shared, even though it was not me who experienced this issue."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMzluVHdnRRAB",
            "text": "The view of the Hudson was spectacular. However, that is where it ended. The over priced drinks were poorly made. When I commented to the bartender her idea to fix it was to add more liquor. As for the food, the staleness of the corn made…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOQ0Y2YnozLThEemNREAE",
            "text": "Had a pretty nice experience here, no complaints. As someone who has worked in hospitality for practically my entire life, I was very happy to meet Igor, a bartender, great customer service. Kind of dude that steps the overall experience up. Great customer service, my server Michelle was fantastic too. Very sweet and knowledgeable."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdDZueUJBEAE",
            "text": "The food menu here is not that great if you are hungry or if you are looking for dinner. The view in the other hand is phenomenal from any angle. The drinks are good but very pricey and since it is the only place for a couple of block I…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOZkF6OURSejhuWGdnRRAB",
            "text": "Great location! Very beautiful spot by the water. They had loud club music playing which was pretty obnoxious for a spot by a sailing club??? No idea why.\n\nWe got seated promptly. Once seated 30mins went by.... no one came to take our order. We paused another waiter and they tried and failed to find our server... weird.\n\nWhat's weirder is as we were ordering-- at 6pm (this place closes at 11pm)-- the waiter like hmm, the kitchen might actually be closed.\n\nWhat?\n\nWhy would a restaurant seat somebody and make them wait half an hour if the kitchen was closed.\n\nApparently the waiter couldn't confirm whether or not the kitchen was even open and said she could try to place the order but has no idea if it'll come.\n\nThe table next to us was also frustrated since they had waited 1.5 hours with half the restaurant empty and didn't even have their apps.\n\nSomething seems dysfunctional about this place. Great location, but management is probably skimping on hiring people while charging $20 for a 4oz drink and $30 an entree."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNHNlOFpBEAE",
            "text": "11/10 recommend! had such an amazing time. i went on a monday night all the way from central ct. the music was everything! such a vibe. as for the food, i ordered the roasted adobo chicken (get it. don’t even think, just yes) and then my friend ordered the steak and mashed potatoes. food quality, flavor, portion, was top notch! as for their espresso martinis….. ONE OF THE SWEETEST ones i’ve ever had and it was AMAZING! sebastian and carlos were so helpful and friendly, i’ll definitely be making a trip back out here soon."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxd1A3UjRBRRAB",
            "text": "We came here to celebrate my son’s HS graduation. The atmosphere is so chill and fun. There’s many photo ops around with it being on the water and The Hudson has various seating options from seating at the bar, picnic tables, dining tables…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbDU2X3l3RRAB",
            "text": "It was beautiful! We really were on the Hudson with a good view of the GW bridge, the cloisters and greenery. There was also live music in the corner.\nThere are 2 main areas. One is more in the sun. This area has some couches and umbrellas and there's also tall metal chairs with no shade.\n\nI get hot easily and didn't want to bake, so we moved \"inside.\" It's an open air building with ceiling fans. It was perfect. We got a breeze but still were part of the outside experience. No walls.\n\nThe server was very attentive and repeated everything back to us. They were able to make things spicy or not at all.\nThe family members i was with love alcohol so they all got some kind of fruity drink. I stuck to soda but it was a relatively big glass.\n\nIn terms of food, everyone liked theirs. I was not feeling great so my experience is not as important except to say that i could get something plain if i wanted.\n\nEveryone else tried different tacos and they said they were delish. We also got some sides. The brussel sprouts were fresh and not mushy. We all liked them.\nAnother side was mashed potatoes with parmesan on top. I didn't want any. Nobody really liked it.\n\nEarlier, it's worth mentioning that we got Guacamole and chips to share. The chips were homemade and the Guacamole was really good. But i do think they could have given us a bigger portion of Guacamole.\n\nBy the end of the meal, we were all stuffed but i am always intrigued by sweets. I got a scoop of vanilla and one of chocolate. A very nice hearty portion! There was even whipped cream and some chocolate sauce.\n\nSo, all in all, I would GO. I don't know when it closes for the season but it's like being in another city. You're far enough away from the traffic that you don't hear it at all!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcDZDeDFRRRAB",
            "text": "Come for the view of the Hudson.\n\nI came because of how close it is to HRCS boathouse and the location, service staff, and view did not disappoint. Unfortunately, I missed allergens on my order so that was a bummer.\n\nOrdered the fish tacos with mango salsa and spicy aioli. Forgot to check for allergens and had to send that back, because the salsa had like 4 colors of raw bell peppers. It looked beautiful just not for someone who can't eat Bell peppers. They very quickly remade the meal with out the salsa and brought it to me. Unfortunately, I  ended up with 3 very plain pieces of fried cod on doubled corn tortillas. Fish was cooked well and the spicy aioli was good. But it needed cabbage or something else without the colorful mango salas it was missing a crunchy topping.  The selection of frozen boozy drinks was long, but I stuck with a coca cola. I wish the soda was a fountain drink and not a canned drink for the cost."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4LTliYjJRRRAB",
            "text": "Beautiful view and COVID 19 friendly.\nYou seat yourself and order On your phone so make sure your phone is charged. The sister or waitress will bring your order to your table. The food was a little…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpMW91THh3RRAB",
            "text": "Nice hidden gem in Inwood that transports you out of the city. Not very accessible via public transit but if you’re in the area the views and sunset can’t be missed. The food is good and seems like a perfect place for a group with all their…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3LU9TMmlBRRAB",
            "text": "Lovely establishment, excellent food, and good service. My review isn’t five stars because of three factors: 1) Pricing is very, very high. Like, prepare to spend over $100/person high. 2) The brunch menu and brunch hours weren’t well advertised and we were not expecting a special (smaller) menu. The Brunch menu was particularly limited and some items on the brunch menu are priced higher than the same items on the dinner menu. 3) Not a sensory-friendly venue with very loud music and staff seem to be unwilling to turn it down just a little, even with very few customers dining. Our group of four had to yell over the loud music during brunch even though no one was seated nearby and the restaurant had few patrons. If the place were full or if it were evening hours we would expect louder music, but for a Saturday afternoon with few customers and a calmer/chill vibe, the volume of the music was just ridiculous and harsh."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDenJlUkVnEAE",
            "text": "The food was delicious. The ribs were amazing both the dry and the wet ribs.\n\nI think these are the number one, #1, Ribs in upper Manhattan, second to dinosaur BBQ.\n\nWe recommend the nachos for two, awesome deal, awesome portion.\n\nWe had a pitcher of frozen margarita with mellow mango which was a hit among our group.\n\nWhat we like the most is the self-service! you have control over the menu and the ordering.\n\nYou scan a QR barcode and it takes you to the menu where you place your order.\n\nIt’s 90% contactless\n\nThe one improvement I recommend is:\n\nIf the customer wants shade, please use the umbrellas. They are not for decoration, they have a purpose and that is to provide shade for the customers.\n\nThat was my only complaint, yet I still give you 5 stars!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNTRDdnhBRRAB",
            "text": "A decent restaurant with a nice view riverside. Food is average. I ordered the Belgian Waffles & my friend's ordered lobster roll, chicken & waffles & a fish sandwich. We came for Brunch. Drink options were mimosa, bloody mary & a fritz.…"
        }
    ],
    "reviews_count": 77
}