{
    "name": "Blue Mountain Heights",
    "place_id": "ChIJr14j-4P2wokRIgceLNYTSto",
    "grid": "MN12",
    "address": "499 W 158th St, New York, NY 10032, USA",
    "rating": 4.3,
    "user_ratings_total": 254,
    "phone_number": "(646) 998-5905",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWk1FNWFVV05pUWs4MVlqUmxWWGxuZEdObGMyYxAB",
            "text": "Amazing food. As good as Jamaica. The best I’ve had in America."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tod2FDMU1SbWxOTFVKdWF6Um5SVU14TVRObWNHYxAB",
            "text": "He had the brown stew chicken and jerk chicken. They were excellent! Very friendly staff. We will definitely eat here again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNVlXNTZkamR6U2t4ZmFXVlpaelpsU0ZaRmFsRRAB",
            "text": "Found this restaurant randomly and was so happy we stopped by! Didn't even realize there was a Jamaican restaurant in the heights! Had the Rasta pasta and it was amazing! Shout out to reeka, drinks were on point! Loved the rum punch. Excellent customer service, def will return"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbGVHaG1UbXN0VnpSUVVWUXdRVkpvV25OQllYYxAB",
            "text": "Good food good vibes Would definitely recommend and return"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdmFuWlNjSGx5ZHpoWE5EWm5NM2xtYXpNM2FWRRAB",
            "text": "My Family and I had such a wonderful time dinning for father's day. Very clean,Live Band very soothing, therapeutic Island vibes down to service  server phenomenal, Chef takes you back home,The beauty you can see him preparing your meal.If you have not been back home ,I'm talking about vacation mode very tasty, elegant .The place is welcoming. Definitely brought me back home .Great vibes. All smiles, Owner  great vibes. Wishing you Guys more blessings and prosperity!!!!\nUsually I eat half of my food. My family and I ate our entire meal. The drinks Island vibes!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQUC04dExYNk02T2lRRRAB",
            "text": "Ordered on Postmates 2 large meals brown stew and curry far from large brown stew had 3 pieces of meat curry 4 paid about $35 not worth it probably dine in is better ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbHRpbmt3RRAB",
            "text": "The best Jamaican restaurant in Washington Heights."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNUpqeVhnEAE",
            "text": "I came here in hopes of finding some authentic Jamaican food and they didnt fail to deliver. Customer service was top tier, the oxtail rasta pasta was insaneee. Overall great vibes and amazing food 10/10 recommend. They also prepared everything pretty fast too."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNGZ5eWlBRRAB",
            "text": "My boyfriend and I have ordered Jamaican food here several times, and it's always delicious. We usually get the jerk chicken, which is perfectly cooked with just the right amount of spice. The rice and peas have a coconut flavor that's addictive, and the sweet plantains are amazing. Today, there was a small piece of oxtail in my meal, and it was incredible—falling off the bone! I'll definitely order the oxtail next time. The service is always timely, and I can’t wait to visit the restaurant in person to check out the ambiance. The only thing I’d change is that I wish their jerk wings were grilled without breading, but that’s about it. It feels like a small business that truly cares, serving homemade comfort food. Shout out to them!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLU5tdTV3RRAB",
            "text": "I’m sorry Caribbean restaurant with a Mexican chef the food is horrible hire an Caribbean chef that actually knows how’s the food supposed to taste"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbGFQSnZBRRAB",
            "text": "I arrived in New York, and this time, I did not want a deli anything. I found Blue Mountain Heights, which was walking distance from the place that I was lodging in. Decided to take a chance on them. The food was good, not as heavily flavored as I would expect for a West Indian restaurant. Still, the food was good. I did go there twice during my last trip. So that should say something about it. The customer service both trips was phenomenal and engaging. Overall, I am happy with Blue Mountain."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcmRmRkVBEAE",
            "text": "My wife and I visited Blue Mountain Heights for her birthday and I must say that the food was amazing. The oxtails were delicious along with the mixed vegetables and mac and cheese. My wife love the chicken rasta pasta. The food came at a timely fashion and the waitress made sure we were good the entire time. The atmosphere was nice and cozy also. We left satisfied and full lol. We recommend this restaurant and will definitely be returning back soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYOUtLS2JBEAE",
            "text": "I popped into this cozy spot for the first time yesterday and ordered a drink. I can't remember which mixed drink it was, but it was excellent and a good size. Then I settled into a window both and relaxed with the soothing sound of old school reggae (mostly Bob Marley) playing. A few regulars came in and were friendly enough. The music also wasn't too loud. Just a chill spot to have a drink and look at my phone. I'll be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURud01UNE1nEAE",
            "text": "Wow their rasta pasta is out of this world"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubmRxTFpBEAE",
            "text": "Food is delicious.  Some of the best Jamaican food I have ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieHBTV3JnRRAB",
            "text": "Love it here and the rum Punch is great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybDZldDNBRRAB",
            "text": "easy take out"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNkpPakJnEAE",
            "text": "The waitress Ice was really nice but they gave me these two baby brown stew pieces of chicken. Highly disappointed. For $20 should have been more. Always wanted to try their food and did. There are several other places in Harlem where you get more food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyazctbmxnRRAB",
            "text": "I grabbed the curry chicken for take out that was SO DELICIOUS! Right down to the salad. The staff was so kind, deff coming back to sit and enjoy them more"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6b2ZDMDJ3RRAB",
            "text": "I dine here almost every other week, the food is always fresh, great portion and amazing taste. Their fish meals are amazing it is made fresh. The ambiance is nice and peaceful love it here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ3JHRjdnRRAB",
            "text": "Ive ordered food indoors and for take out and it’s absolutely amazing. Glad spice level and flavor wasn’t altered to appeal out of culture people. 😅 Food and drinks are great and worth price point compared to other places that water down drinks and less flavored food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMlk2ZXlnRRAB",
            "text": "Arrived 7:30 pm 4/22/24 . Was greeted & sat at the bar by a young pretty female. It was 6 of us . Spot was empty ( it’s Monday ). Unsure  if it’s usually busy any other day. The girl was on FT - facetime the entire time we were there . We ordered drinks I had a rum punch rate that a 5/10 could’ve been WAY better. The food was 7/10 for me I loved the oxtail Rasta pasta . It was suppose to be mild but the oxtails were a bit spicy ( not too much ). It was only one chef n the back. The bartender/waitress was all over the place like it wasn’t that kind of day for her to be working. One of the people I was with ordered fried shrimp which came out after we were all half way done eating smh . She didn’t even set out any utensils to our food came.  Definitely the type of spot u eat in and dnt order on Uber eats it’s fresher that way. Quiet in the wall spot I will say ( NO HOOKAH )."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEOWNxLUpREAE",
            "text": "I ordered through Uber eats. I was told that my meal was a large. When I got the food it was far from large and just oxtail bones! I do my best to support black business but this has really broken the camels back for me. They charged me $37.00 for nothing. I don’t like when I spend my money and people take advantage, but I do know that the more you take from others. You will lose the most! I am so bothered by this!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NmFIMGN3EAE",
            "text": "I order the Rasta pasta and added chicken to it and the chicken taco, - they gave me Rasta pasta with like pieces of, I believed to me, it looked like jerk chicken was added to the pasta, and the chicken, which the menu never specified that it would be that type of chicken in both the Rasta pasta and the Chicken taco and it made everything too spicy and like they tried to make a hard shell taco out of a soft shell taco and that made it hard to bit into and chewy...and for the Rasta pasta too oily and to dam spicy....I m good..won't be ordering here anymore."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbnVtMmNBEAE",
            "text": "Wherever I am in town, i go to this restaurant because the prices are affordable and the food is delicious. On a few occasions, i ordered the stew chicken, which my son loves. I was disappointed when i opened the container to see that there was no meat on the legs and thighs in the chicken stew. It was ALL  bones, no meat. It's like the cook gave me what was left at the bottom of the pot.. Just being real!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROaHFxQVJnEAE",
            "text": "This isn’t Jamaican food, I’m not sure what it is but it isn’t plus the woman who are regulars there have the nerve to be fighting other women that they don’t even know just because they are intimidated by new comers and young beauty. Goodbye food is nasty anyway"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxbGRXc1N3EAE",
            "text": "I decided to go to this place today after work originally I had wanted the oxtail meal but the lady at the bar had told me it was gonna be an hour and a half wait I was a little bit disappointed but I decided to get a different meal she had recommended the garlic salmon which I got and I must say the food was good I also had gotten rice and peas and plantains.The bartender was very nice I would be coming back to this place again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxLU1xbWNREAE",
            "text": "Delicious food."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsczR2QjhnRRAB",
            "text": "La découverte de Harlem"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMFl6T3hnRRAB",
            "text": "I spent a very pleasant afternoon with friends at Blue Mountain Heights  Cafe, a small Caribbean restaurant in the Washington Heights area of Manhattan. The restaurant is cozy and inviting with outdoor seating available on warm days. There is a fully stocked bar and reggae music playing in the background to enhance the island vibe of the restaurant.\n\nWe ordered a number of appetizers and entrees. The jerk wings, shrimp salad, chicken tacos and peppered shrimps were all very tasty. The jerk chicken and Oxtail were well seasoned and delicious. The serving portions were also good. For dessert, we had both the Hennessy and Pistachio cheesecake which were amazing.\n\nOur server, Miriam, was a delight. She was very professional, personable and added to our wonderful experience at the restaurant.\n\nI would definitely recommend Blue Mountain Heights Cafe for their food and service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGemZyVGFREAE",
            "text": "Excellent food"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1eE56Wm5RRRAB",
            "text": "Lo mejor de lo mejor."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacEozU1FREAE",
            "text": "Blue Mountain Heights is awesome. The food is so good. Everyone should go here if you want a great meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNmQzbmxnRRAB",
            "text": "Don’t recommend\nThe food wasn’t tasty at all"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadXJtcEN3EAE",
            "text": "Okay so I always check reviews but never leave them But THIS PLACEEEE!! Absolutely deserves one. The food is amazing, done fast, the employees are friendly and radiant, love it here. Absolutely go here if your looking for some good Caribbean food and drinks"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNUpYZTdRRRAB",
            "text": "Got food to go and jasmine was very friendly.\n\n10/10 everything we had was amazing. 100% will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOEp6eXB3RRAB",
            "text": "Extremely expensive , the portions are very, very, very small"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwek5yNFRnEAE",
            "text": "Jerk chicken empanadas and oxtail are the best. Food has a good spice to it.  I ordered n Uber eats."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKc2NQd1J3EAE",
            "text": "Oxtail was so good I had a dream the same night. Everything was great to the point I forgot it was raining outside. My girlfriend enjoyed her food too. Nice place for a date."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdXFqTFBREAE",
            "text": "Decided to try a new restaurant & I am so disappointed. Spent $60 for straight spicy food, I never knew fried chicken could be seasoned so spicy unless you actually ordered buffalo wings. I had BBQ & Henny wings & I couldn't even give it to my son how spicy they were. The presentation was cool & looked like it was fried to perfection but they were all buffalo wings.\n\nLet's not even get into the oxtail....they literally gave the baby ends of the tail it was a toddler's plate with alot of rice & the level of spice on that was outrageous as well and they had the audacity to put gravy on everything so its not like you could of went around it. Forgot to take a picture how vexxed I was.\n\nI will never order from them again even after seeing all those mixxy reviews I still decided to try them out.\nNo thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeXZYTHlRRRAB",
            "text": "The food is real good here and the service was great. Wonderful menu selection and their prices were really good too. Check them out if you're in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMy1TaVJREAE",
            "text": "Amazing place, staff is soooo chill and friendly! Food is awesome and drinks are strong and cheap!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdDU2Sjd3RRAB",
            "text": "Love the overall vibe at this spot! Great happy hour, and friendly bartenders. Always a good time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N0l5Mmt3RRAB",
            "text": "First and foremost I have to say that I have never in my life been to a Caribbean restaurant and the service was outstanding! The bartender was awesome the drinks were on point. The atmosphere was so welcoming. I wish I would of taken a picture of my food but we were to drunk by the time we got home and bodied that food!!! The rasta pasta was so fresh my man had chicken I had it with oxtail and it was great!!!\n\nThis place is definitely a hidden gem!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNktlVV9RRRAB",
            "text": "Closed when I arrived although I paid for food online. Closed over an hour early and wondering if still in business."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSOTlqNTJnRRAB",
            "text": "Food always amazing! No matter the time of day or night! Service on point too! Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdk9TNE9REAE",
            "text": "The food always hits❤️‍🔥🔥\n\n🥹🥹🙏🏽🙏🏽Y'all sent extra rasta pasta and didn't even need to - Thank you 🥰"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobHQzbnpRRRAB",
            "text": "Amazing fool had some crab legs from out of this wirld"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCblBXMGV3EAE",
            "text": "Jerk chicken was not good at all Mac and cheese not good this is not even close to jerk chicken I wish I had read the review before I went to the restaurant"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCOUtQandnRRAB",
            "text": "Stopped by for a crew lunch after a shoot at Sister's Uptown Book Store (another gem) and the food was delicious. Everyone who was a part of our party of 8 thoroughly enjoyed our meals. I had the oxtails. They were slamming. And the food…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXX2NTUElBEAE",
            "text": "Just ordered for Delivery. Evry plate came intact. I ordered oxtail and bbq wings.\nThe oxtail has the perfect spiciness. The wings was very very spicy but good. I recommend and will order again!\n\nI ORDERED AGAIN LIKE A WEEK AFTER!\nI'm pregnant,  can't wait to give birth to actually go to the restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OU1iVkJ3EAE",
            "text": "Very disappointed. I’ve been in the states for 10months and haven’t had Jamaican food. Imagine my excitement when I did a google search n realized there is a J’can restaurant close to where I just moved🙃. The excitement didn’t last long. When I got home n started eating the jerk chicken, with each bite I took the less I wanted the food. All you taste is PEPPER, NO FLAVOR. Didn’t take me back home at all; I wanted to cry… just being away from your home country craving this for months to finally get it and it’s just not hitting.\nEating and your mouth is tingling is nice because I love spicy food, but spicy without flavor makes no sense.\nThe rice and peas and steamed cabbage is just okay.\n\nMaybe get someone who is an expert in Jamaican cuisines, I could taste that the jerk seasoning was an authentic Jamaican/Caribbean brand, but the meal itself is way too tasteless to be a Jamaican dish. Yes, a lot of Jamaicans love spicy, but the spicy should be an add touch to the meal not the makeup.\n\nThe restaurant setup is lovely, the lady in the front is very pleasant and hospitable, music in the background was nice… Just do better with the food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcV9yNUJnEAE",
            "text": "First time at this restaurant it came highly recommended I’m fairly disappointed the mac & cheese is a one that’s kind of reminded me of craft with extra cheese however the oxtails are great perfect spiciness the plantains were very skimpy and the rice and peas were OK I will not be frequenting this place thanks though"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXd19McFdREAE",
            "text": "Great experience and service. Nice music, food was amazing and the drinks, oh the drinks. Went there for one cocktail and had like 4 plus Jamaican Rum Shots."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhM3I2VjJ3RRAB",
            "text": "Absolutely amazing ! Food is fresh always, The servers and the bartenders a very nice and the drinks ? BABY ! Get me right every time lol. So if you tryna chill and eat great food THIS THE SPOT ❤️"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdWRHR0d3EAE",
            "text": "I'm so speechless this place is totally awesome...the food is to die for and the chef James his hands is heaven sent. Me and my wife simply love this place it's very pleasant and relaxing. The bartender Jazmyn is amazing sure knows how to…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNXFHREZBEAE",
            "text": "Ordered on Uber eats a little disappointed, food is spicy. Barely can enjoy it with the level of spice. I expected rice n peas and they sent white rice , food was cold upon arrival ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcFBlZDVnRRAB",
            "text": "The oxtails is literally the best oxtail i ever had🔥it’s flavorful not too sweet not burnt just cooked to perfection. the mac was really good and cheesy 10/10 i highly recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtN2FyQWZBEAE",
            "text": "CURRY CHICKEN GOES CRAZYYY!!! WAS SOO GOOD!! FELT LIKE I WAS ON THE ISLAND NO!! WENT BACK NEXT DAY FOR THE OXTAILS AND ALMOST DIED IT WAS SOOOO GO!!!! WOULD WALK 100 BLOCKS FOR IT!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNOG9fRFZREAE",
            "text": "My new favorite spot! I ordered takeout: Oxtails, rice and peas, and mac and cheese. Delicious 😋 And thanks for the movie recommendation!…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbl9xY3dRRRAB",
            "text": "Food was amazingly tasteful‼️  The rum punch was excellent 🙌🏾 Can’t wait to got back.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJMmRIdnFRRRAB",
            "text": "Food-amazingly tasty. The chefs can cook!!!!! Nice service. Drinks-good and strong  thank you we will definitely return!!!!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MnVmYmtBRRAB",
            "text": "great hospitality. food was tasty and delicious. customer service was lovely. my date had a great time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcU5yVXdRRRAB",
            "text": "Good is Great. I ordered the Oxtails with rice and peas and it was kind of fatty but delicious. Their pepper shrimp is the best. Then I went yesterday and ordered Jerk Chicken platter and it was good also. Jasmine works at the bar and she’s amazing even though I didn’t drink."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZd2VfMkV3EAE",
            "text": "Amazing food and drinks at great prices. Best staff you will ever meet. Highly recommend"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMweWRIZXBRRRAB",
            "text": "One of the better West Indian restaurants in Harlem. Was pleasantly shocked!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4dEtEb053EAE",
            "text": "The veggies are fresh, the serving sizes are hearty, the spices are delicious, and the rum punch is the best I've ever had. The staff are all super sweet and attentive. I cannot say enough good things about my experience. They are now set…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1enZtdzd3RRAB",
            "text": "I love the hospitality here I always get Rasta pasta spicy it’s so yummy with a Henny punch"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldk1fOEZREAE",
            "text": "I ordered Snapper steamed, with rice and peas and mixed veggies. I don't think the fish they gave me was snapper. In addition it tasted like they steamed it while it was still frozen so it didn't absorb any flavor. The texture was all wrong…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReEphcThBRRAB",
            "text": "What ever the owner have to do to keep the chef he better. The food was beyond amazing. I love eating out and been to almost every good restaurants in the city. This place is the best. I am a Chef myself so I am very critical about a clean…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhMlozNUt3EAE",
            "text": "This is THE Jamaican spot to eat at. Everything I've tried tasted amazing especially the rasta pasta with curry chicken ( I drool at the thought of that plate). This place hits the mark every single time I go in and the staff is super…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMXVMOUtBEAE",
            "text": "I have not had jerk chicken and rice and peas this good in a long time.  Good music and nice vibe.  I would have loved to dine in, but the AC didn't seem to be working very well. Staff was super friendly and helpful."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvMC1tNlZREAE",
            "text": "Food is good but the service is where they fall short. Incredibly long wait times for pickup and delivery (well, let’s just say when they even have delivery because that’s slim to none) and they run out of food quickly. Tonight, after…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ0eGV1V3ZRRRAB",
            "text": "called a week in advance to advice of a party of about 15 people for a graduation celebration. We arrived around 5:30pm happy started at 4 but we were not made aware of happy hour, they charged full priced drinks neither were we given menus or water when we arrived. At 6:59 we were then told  \"oh happy hour ends in one minute \"  we ONLY ordered appetizers ( wings and empanadas )and the food took 1 hour and half or more to come out. They brought some people at the time food out on the same plate even though the order was made separately. They never came back to refill water or ask if we needed napkins. Some of the plates were missing wings and that took another 45 minutes for them to make the missing food. Music is great but customer service is horrible and the chef never came out to apologize or put us at ease but he definitely came out and cut him self a slice of cake."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLa3BmSFV3EAE",
            "text": "I was in the area and starving . Being that I’m Caribbean , figure this would be perfect . However as I walked in there was a very energetic young lady who proceeded to tell me the owner just came in 15 min ago to start cooking . We went to order drinks and she advised what she can make and what she hasn’t made . The food was ok , very bland for a Caribbean spot .\n\nWord of advice maybe get some one who is more Caribbean to great and give that island feeling . Definitely didn’t feel that feel nor the food"
        }
    ],
    "reviews_count": 75
}