{
    "name": "Tampopo Ramen",
    "place_id": "ChIJFxsXmaD2wokRfqXPG2eCyDY",
    "grid": "MN12",
    "address": "1 Bennett Ave, New York, NY 10033, USA",
    "rating": 4.5,
    "user_ratings_total": 1206,
    "phone_number": "(212) 923-0575",
    "reviews": [
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jemRYQTVXVWxqVDNKSlVWaHFlamx0UzJKa01tYxAB",
            "text": "Going here is amazing and definitely worth it"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vM2RuSldkazFCV0VGcFFpMVBObnB1TkRaYVYzYxAB",
            "text": "I’ve never been a huge fan of ramen but this place completely changed that… every single dish had the perfect flavor. I’ll definitely be back again!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWU1XRkJXblI0U1ROUFJHMXZiVFJMT0hGa2VHYxAB",
            "text": "I had a frozen beer given to me (best ever to me) but the staff didn’t like the lost of beer given to me and automatically  said “when ur ready for another shot it’s on me”. They saw something, It didn’t  have to be too big or to small of a thing and I appreciate it"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNVdWOUtYMGRHT0Y5aVdFaDRORmQ1TmpGV1VFRRAB",
            "text": "Had brunch with a good friend, we both had meal sets with happy hour drinks and dessert! Came out to about $48 each, and the sake cup with the panda design is free to take back home! This is the best, authentic izakaya-style Japanese restaurant in Washington Heights. Music wasn’t too loud but still contributed to the good vibes. Shout out to our server Peter!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeFNYaHRRWFJKTm5CU2JEazVWa2hUYkU5VGRGRRAB",
            "text": "I always bring my girlfriend to enjoy her favorite ramen"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQmR6aEdkbmxhZDFwRVdXdDBZbU5hWlZSemJHYxAB",
            "text": "The absolute best in food and service"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTmMwVjVYMWhYYWpOR2NtZGhjMHRMVkdsS1YyYxAB",
            "text": "Its a small location, but its got a vibe! The staff were nice. The floor is a bit uneven, bur thats typical of hole in the wall NYac restaurants. Not complaining, though.\n\nSeveral vegetarian/vegan options.\n\nLoved it"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRVluaHdRV05FZGsxcVdVdzBPVXB2TjFWc1ZVRRAB",
            "text": "Amazing lunch specials today: mini ramen with an app and a soda! The gyoza was so crispy and delicate, I ate it up too fast to photograph.... The homemade ginger ale is superb and has magical properties."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214S2JUUlBhVTVqVTBwdFVrazVSVlZZWTJaQ1VsRRAB",
            "text": "Best food Ever"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUWNsb3ROR0pNVFVWQ2MwVjFWbEJIZUhkNWFtYxAB",
            "text": "Easily the best Ramen I’ve ever had in my life. Every single component is so flavorful fresh and carefully placed to just create one of the best things I’ve eaten in my entire life. The whole menu is worth trying. The noodles are so perfectly cooked the broth is rich and flavorful. Even if you want to get takeout the quality is just as good and packaged tremendously to keep everything just as fresh as eating inside. It’s hard to try other Ramen without going back and comparing it to this masterpiece."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KS1pHcGxZa1J0YVdvd1JITTFkM2czVm1RM01rRRAB",
            "text": "Spicy miso ramen is everything you’d want on a cold rainy day. Perfection!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toZmJDMWtZVTFMT1RFNU5UUkJabUZqWDJwVmMwRRAB",
            "text": "This is my first time here and if I want ramen ik where to go now. The food here is so good down to their home made gingerale. The service is great, our server made great recommendations. For sure will be my go to spot for ramen."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMGRHUjBWVUp4TWtoTWRHRTJURzV6VUZOM2MwRRAB",
            "text": "There’s a ton of ramen spots in NYC. But this one is FIRE🔥everything from the appetizer to the entrees and their home made ginger ale goes well with a spicy bowl of ramen ! I got the spiciest ramen I think it had dragon in its name and my girl got the spicy miso ramen…definitely recommend! Try their fried chicken and pan seared pork and veggie dumplings too! This spot was a solid 10 for me 😭"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ZlFWSXhUbDg0ZVVzdFlsVk1NVU5xV0ZoUVprRRAB",
            "text": "The best ramen ever! And fast service. Everything fresh! Everytime i go there i take my miso ramen!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paU1h6WXRURXR6WmtaTFZYSkJWMHhETlU1emVXYxAB",
            "text": "My partner and I love this place for it’s authenticity. The food is very fresh and ridiculously delicious. I love they included a new combo of a mini ramen bowl. Our recommendation will be that the place should upgrade to a bigger spot because it feels very overwhelming when its full and there are other people waiting inside for a spots to be available."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psYVRGZEhRWFpPVlRScE0wcFdOSGt0UkRGbk0xRRAB",
            "text": "The ramen broth was toooooo sweet that it was off putting. I ordered a veg curry ramen and a spicy miso ramen and they were both weirdly sweet. The fried spring rolls were over priced."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWlZDMDFSVVJ3Tm1VeldqbDFWa05KVEZCblQwRRAB",
            "text": "My fav ramen spot in NYC!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUldYaGZXbmRZVVRReE9FZ3lURVJ2VjBGVGFGRRAB",
            "text": "My daughter and I love Tampopo Ramen."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kb05FbzNNVlZSVG1Gek5VeHJUM2RhTms1UlRXYxAB",
            "text": "The food was really good! It wasn’t very salty, great flavor, and perfect amount of toppings. The gyoza and the pork buns were good as well! I would definitely recommend it. Will be coming back for sure:)."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMGVVNXhXVlJXTVhnelRtaE1hQzE2VVVJd1EyYxAB",
            "text": "Yum"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxZlZqZElOekZzTVhrNWJtSnBNelJ6ZG5WdFMwRRAB",
            "text": "La comida tenía poco sabor, no estaba mal pero faltó mejor preparación y estaban algunos elementos de el ramen frío de nevera eso hace un choque al momento de comerlos\nEl pollo frito estuvo bueno y el matcha pero el resto de el combo no\nPor el precio no esta mal pero necesita mejorar"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWWVIWXdhaTFTVTFSelZ6Z3djSFEyUlZReVNXYxAB",
            "text": "Tampopo Ramen is one of my favorite spots in the city. What keeps me coming back is the consistency—every visit is just as great as the last. The food is always fresh, flavorful, and clearly made with care. You can tell that everything is prepared in-house with top-notch ingredients—nothing ever tastes reheated or processed.\n\nThe service is just as impressive. Whether you’re helped by one of the servers or the owner himself (who’s always friendly and attentive), you’ll feel well taken care of. One of the things I love most is that you can actually watch the cooks prepare the food—it really adds to the experience.\n\nIf you’re planning to go, here are some of my go-to favorites:\n•\tThe gyoza (crispy and flavorful)\n•\tThe purple sweet potato\n•\tThe mushroom bao buns (a must-try)\n•\tThe gyudon beef bowl (so comforting)\n•\tAnd of course, any of their ramen bowls—delicious, savory, and very satisfying\n\nPortions are generous, and everything is consistently delicious. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jME5VSjNTRTFwVVU5aVR6ZFNZMUpXVUVOMFUyYxAB",
            "text": "Best ramen soup and perhaps the only ramen restaurant in upper manhattan. Very fast delivery, vegetarian options, reasonable prices, very good for appetizers, great broth, and very good location in upper manhattan close by the Cloisters Museum, Fort Tryon Park, only indoor seating no outdoor seating, not many tables available but still worth the wait. Very good service and waiters."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkT2NXa3hlWEpuVFc1QmRYaERkR0pDTTBsMFdYYxAB",
            "text": "It was okay, it could have been more flavorful. The service was good, the dude is very nice. But the food should be better"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWFMwZGtYMHR6Y0VoYVRVbFFaM2d0WlhNNWVFRRAB",
            "text": "A slay"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UVUwOVJTR3BtVnpOWlFubEdhMWQwZFcxYVNuYxAB",
            "text": "Amazing food, ramen had so many flavours and depth, plus the staff were super friendly. B sure to tip the guy who serves the food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSVlYY3hkRFpCWmtKS2FUQTVRbEF6Y1VWZlRWRRAB",
            "text": "I ordered Ramen for our family delivery, and it was, by far, the best Ramen we have ever had. We were able to customize it all to our individual preferences,  and the food was fresh and hot. We were very impressed and loved it all. We would definitely order again. Highly recommend this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocVJITXRWMUkxU2t4bFFtZHphVmhyVjJsYWVWRRAB",
            "text": "First time visit was absolutely great! We ordered the spicy shoyu and tonkotsu ramens— both so hearty and delicious!! Also our waitress, she was very sweet! Thank you so much!!! I would definitely come again 🍜🌸💕"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWFNYVnBPVzR3ZVd4NVpUVlRRazQwYWtoWlFWRRAB",
            "text": "All the food is SO delicious.\nService was awesome.\nThe music choice is stellar.\nMy 14 year old and I had a 3 night stay and had to go a second time once we tried the food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSVZVVkJaRXBLUzBWelNEUjZNVkJmV201VWRYYxAB",
            "text": "Cool as can be with a great music vibe. Where local folks and artists eat."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNGMwOU1iVFpEUzI1NVNYZHRWRVJ0UVRVdE9IYxAB",
            "text": "The food of this place is absolutely exquisite, is by far the closest you can get to traditional Japanese food in Uptown NYC. I encourage everyone who loves asian food to stop by and try this place. You stomach and your brain will thank you for it 🤌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RFJGYzRjakJMT0cxR2N6TkNVRWhtZW5CbGRsRRAB",
            "text": "Came here for the first time and the ramen is really good! The fried chicken is too. I had a lunch special, and ended up getting extra noodles and another order of chicken. 5/5 100% recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVlJDMXdja1J2V0VwVVRsRlFTbE5oWlZjMmNsRRAB",
            "text": "SOOOOO GOOD!!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRU5FVkhNRWx1WVY4d2FsZE1kSFo1U0ZoSVkwRRAB",
            "text": "Very tasty food, friendly cozy atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNXzloTF93Z1pqamx3RRAB",
            "text": "I love creamy ramen and they delivered. New yorks finest and New Yorks kindest. Also, nice eggs"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLRFIySTNVcWZPTkxREAE",
            "text": "Great ramen place! Especially if you’re a traveling from GWB bus terminal!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJUFR1YUdFcXNxeklnEAE",
            "text": "Ok where do I begin here 😂 so disclaimer I rather go in person than to order but I ordered for the first time and it was still so good\n\nI love it here hand made pasta the broth is amazing pro tip always get the chili oil lol it’s great. Even though I never finish it I always get extra meat normally do two different meats hope they add something like that on the menu one day. Fingers crossed but this place is definitely one of the best Ramen 🍜 uptown for sure.  I’ve had a lot from there menu and haven’t been disappointed\n\nI’ll update a dine in pics when I go in person again till then I have take out pics and videos\n\nPlace is great definitely recommend\n\nLike always thanks so much for the support let me know if you go and what you think about it\n\nLocal gem 💎\n\nMy ig is @imbroke_rob and @imbroke_eats\n\nThanks for the likes and follows\n\nHope this helps have a great day guys"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKTHB0Wnlvb3NPMTB3RRAB",
            "text": "I decided to eat alone in the restaurant on a rainy day. Ordered miso ramen fried dumplings and 2 cans of k pop cocktails and a seltzer water. Before I tell you the price of my entire dinner, let me tell you that the chicken they put in my Ramen tasted like it was frozen grilled and then boiled with no seasoning flavor. The only flavor that it did have was a stale frozen boiled taste. I took all the chicken out of my Ramen did not eat any of it. They did not deduct it from my receipt. The contents of the Ramen were not fresh and the broth from the Ramen was so bland, but for some reason tasted like it was leftover. The veggie dumplings were fried but instide very mushy, Nothing that I ate tasted fresh, except for the three cans of pop that I had. Altogether my meal was $51. $51 for a bowl of toilet water tasting miso and mushy fried dumplings.  I was not impressed with my meal or the price. I tipped $10 to the service because she was very attentive but besides that this Ramen was trash and the price $51 for trash and not fresh Ramen no! I feel like if you can’t prepare Ramen correctly with all of the flavors and freshness, then leave it to the PROS!!!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHcE9POWpRRRAB",
            "text": "Tampopo is a small ramen shop serving up big dishes that don’t disappoint! Get in quick and find a barstool with a view of the kitchen.\n\nThe service is quick and the staff are friendly. But the star of the show is the ramen. Pick your favorite and get ready to dig in. It warms the heart and always fills you up. I love coming here.\n\nBe sure to try the veggie spring rolls or other delicious appetizers to complete your meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdEl2UjlRRRAB",
            "text": "Tampopo is great! It's a very small space, so it's all counter seating which I'm not fond of, but the food more than makes up for that. I understand they'll be moving to a larger space in the near future. The Ramen noodle soups are amongst the best in NYC, and the bao buns are to die for. I usually order take out/delivery, but occasionally if I'm down that way (near Broadway) I'll eat in. Very pleasant and helpful waitstaff."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeU5fSkVREAE",
            "text": "Food is delicious, meals deliver what the description outlines, and the preparation is fast. My recommendation is the Donburi bowl."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbTZuTDRBRRAB",
            "text": "Un service rapids y excelente, el lugar muy acogedor, las gyozas riquisimas y los ramen out igual en especial el shoyu para mi gusto, el house ginger ale 😍😍 amazing!!!!!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndllPa2hRRRAB",
            "text": "Excellent local Ramen place. I had tried every Ramen  in this place, including the curry and the newest Ginger beef one. You won’t regret trying any of them. Broth well made, variety of ingredients and friendly place. Excellent environment.\nAlso deliveries are super quick if you order from home. Are you Hungry? Get Tampopo!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MUtYMVd3EAE",
            "text": "Great ramen bowls here! Not too far of a walk from our Hotel. Lots of yummy ingredients and carefully served. Being seated in a narrow space is a bit awkward, but such a cute place to have dinner!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbVlIVGN3EAE",
            "text": "Food was fantastic, service excellent, and the atmosphere perfect. Get a meal here it's magnificent."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRM0lTRWFBEAE",
            "text": "best ramen in NyC"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncTlXTHJ3RRAB",
            "text": "Delicious, good prices, friendly cozy restaurant"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneVl2N1B3EAE",
            "text": "ordered add-ons but not seen on my delivery order"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnelBIeTF3RRAB",
            "text": "A Must-Try Ramen Spot with Warm Vibes and Incredible Flavors!\n\nFrom the moment we walked in, we were greeted with friendly smiles and a cozy, inviting atmosphere. Offering great recommendations.\n\nThe ramen itself was nothing short of amazing! The broth was rich and full of depth, perfectly balanced. Each bite was comforting and satisfying. I had item N9 “Enter the Dragon Ramen” I like spicy food and this was perfect.\n\nService was outstanding—our food arrived quickly, and the staff checked in just enough to ensure we had everything we needed."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBLTQ3YkVBEAE",
            "text": "Prob my favorite lil spot in Washington Heights."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NmJ2MWNBEAE",
            "text": "A local staple to the Uptown neighborhood for many years, this spot always hits the mark!\n\nThe lunch specials are insane like great quantities, quality is never sacrificed and the taste is jam packed with flavors!\n\nOur host and server is the best with great recommendations and an awesome attitude. He makes our experience 10 times better always!\n\nHot sake FTW"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfalA2TXVnRRAB",
            "text": "My wife and I are regular customers at this place. No doubt they have the best ramen! I love Enter the Dragon with extra broth and my wife always goes with spicy Miso. Highly recommend! 10/10"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdHJueGd3RRAB",
            "text": "An Amazing little Quaint Ramen Asian eatery... My first time here for brunch. I sat and watched the chef cook  these amazing dishes for patrons. It really was delicious on a brisk day to have a hot bowl of ramen with these wonderful vegetables and seasonings. I was really impressed. I would totally come back here again. The service was amazing.. * host Peter was very cordial with customers as the place began to get busier. This little place is a gem in our neighborhood. I can't wait to return.. Kudo's to the chef and staff @ Tampopo..5 stars here !!... See you again"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdmNLS3R3RRAB",
            "text": "Very flavorful, would relieve any hangover or if you’re feeling under the weather I recommend it. The pork buns are my favorite they have this sweet yet not overbearing taste, they’re perfect. Though it’s a really small place to dine in the tasty food makes you overlook this con."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoN2ZEQ3RnRRAB",
            "text": "Tampopo was recommended by a friend of mine who also loved ramen.\n\nMaybe we came on a busy day, they had us waiting over 30minutes, standing by the door and having to move every time someone came in to pick up an order. After standing there, I also believe that they have a huge clientele on delivery orders.\n\nThe place is very cozy, but the service was slow. Some plates were delicious, some didn’t live up to my standards, based on my friend’s.\n\nOnce again, I came with my bf and my (fan lover of ramen) mother… we shared appetizers: Steamed (pork) bao buns, Pan fried gyoza dumplings and Fried pork katsu. For entree I had Shoyu ramen with chicken karaage added on, my mom had Shio classic ramen, and my bf had the Spicy miso ramen with pork katsu added on.\n\nWe LOVED the appetizers, every single one was super tasteful and different in flavor, but we were mind blown by the deliciousness of each appetizer choice!!\nThe ramen were not as we expected… the eggs were so cold, we couldn’t even eat them, my broth was salty, my mom’s broth choice lacked on flavor, they took so long but our ramen didn’t feel or taste like it was freshly made, only some components, like the add ons, but that’s that.\n\nI would definitely come back to try more of their appetizers, try their rices and maybe their stir fry. But for sure wouldn’t come back if I craved ramen only, not my first choice for it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4b2QyWk9BEAE",
            "text": "Had a great experience at Tampopo. Staff was super friendly. We had the chicken and pork Bao Buns and Purple sweet potato Tempura fries. The fries weren't that sweet, but went very well with the curry mayo dipping sauce. Buns were spot on. Perfectly soft with amazing combo of sauces. For main I ordered the Ginger Beef Ramen. I highly recommend adding the spicy chili oil if you want to kick the Flavor up a notch. It was truly perfection"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYektIM2tBRRAB",
            "text": "Excellent place! Bao buns were absolutely delicious. Ramens were good as well.\nVery friendly and fast service. I’ll definitely be back when I’m in the area. Thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcnR1OERREAE",
            "text": "The Shoyu Ramen with added Nori seaweed hit the spot and was perfect. The mixture of the soy sauce and chicken broth was delicious. The chicken version was charbroiled and added to the layers of flavor. It also comes with pork, if desired. The kikurage mushrooms are also very good. I would highly recommend this dish and literally ate every last drop!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjZ01uZmZREAE",
            "text": "Amazing place!!! The noodles are delicious, fresh, and the miso broth is to die for. Definitely one of my favorite restaurants to eat period. The staff is very friendly and helpful. Small space with large flavors and customer care!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCNGZIMm5nRRAB",
            "text": "Such a cute small place with only bar seating. You can see them making everything while you wait. The ramen was really tasty. My favorite were the steamed bao buns!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRX3FXeGxRRRAB",
            "text": "Great lunch experience!\nCozy hole in the wall type of place, there are 2 tables and a rather long bar to sit and eat (as most NYC ramen restaurants)\nIvette was helpful and knowledgeable,  she was able to make recommendations and explain why.\nPork buns were delicious and I went with the spicy miso chicken ramen with pork.\n\nIt was amazing,  the pork was very flavorful and was spicy enough.\nLoved it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdGNMZG93RRAB",
            "text": "Had a craving for ramen and decided to give this spot a try.   Speedy service and friendly staff.  Fried chicken tender appetizer was ok. Tofu salad and sesame dressing was amazing! Would try different ramen dish next time.   Broth needed more flavor. Very small establishment."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeGFxNmRREAE",
            "text": "Awesome service, reasonable prices, great selection of dishes. If you are not familiar with their dishes, they will assist you in ordering something that you will like. Great area and I  didn't  have difficulty finding parking. You can also sit outside. They also had Happy Hour, too bad I was driving. It was something different for me, but it was worth it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMjRQek1BEAE",
            "text": "This is a great small ramen place! The food was delicious and prepared very fast. The staff was very attentive and friendly. The place is rather small so it can get crowded during the dinner hours. I recommend this place to anyone looking for some good food!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRaU5pb0dBEAE",
            "text": "Food so good I couldn't stop to snap a photo of my Ramen.  The pork bun appetizer got a photo but once I tasted the goodness I could no.longer stop, just had to eat.  The Ramen was delicious!\n\nUPDATE: 05.11.2024\n\nI UPLOADED A PHOTO!\n\nWent to celebrate my sons dance recital.   We adore this restaurant!   It's more like not a restaurant but a kitchen where we can eat.  It's very homey."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycXR1UzRBRRAB",
            "text": "It’s been awhile since I ate from here. But I decided to order something today and the dishes were still great. They listen to my request and were nice over the phone. When I’m craving vegan ramen again, I’ll be back to order."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNN1lDeXlnRRAB",
            "text": "Very good ramen and the baos were tasty too. Sake is also good and the price overall is ok, very much in sink with other restaurants in the area.\nThe place is small but nice. There's usually a wait so be ready to have some patience."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJeXBpckhBEAE",
            "text": "Different flavorful Ramen dishes to choose from. Small place, but you won't wait long for a seat. Usually about a 5-10 min wait when crowded. Ginger Beef Ramen and Enter The Dragon are 2 of my favorites here. You can customize your Ranem by adding meats and as many other sides as you want. They also have Happy Hour here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcGNhdkVBEAE",
            "text": "I have to be honest this ramen is very mediocre. There aren’t many places in wahi to compare to but compared to what you get downtown this ramen is nothing to write home about. I had the spicy miso and it wasn’t spicy at all, egg was overcooked and char siu was not high quality and felt lacking. Overall the broth could use more flavor as well, was not very hot, and did not taste authentic. Service was slow but it was new years so they should get a break for that. Nothing was bad per say, just disappointed based on the reviews I expected more. If you have a ramen kick in the area I guess its a good spot to go since there aren’t options but would not go out of my way to come here."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURza3UzYzh3RRAB",
            "text": "I went to Tampopo Ramen for lunch around 1:30, and the restaurant was steady busy up to the time I left, which reflects how amazing the food is. Everything tasted so delicious and fresh! The Shio classic ramen is flavored perfectly. It doesn't have that overly salty or heavy taste that ramen from many other ramen restaurants have. The taste is light and fresh. The owner told me that the noodles are made in house daily, which explains the freshness of the whole dish! Another difference is that this place uses Japanese Paitan chicken broth, instead of Tonkotsu pork broth. The okonomiyaki was also incredible. It was cooked to perfection and topped with fresh flavors of scallions, pickled ginger, and the two sauces. Surprisingly, the homemade ginger ale on their menu is hands down one of the best, most refreshing drinks I've had in a while! I love ginger and could really taste the fresh ginger in this drink, which was so satisfying.😊 The great service was the neat ribbon on top of this dining experience. I have no criticism. It's definitely worth the journey up to Washington Heights!☺"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsM3VQRDdBRRAB",
            "text": "it’s a cute spot for appetizers, to say the least. right off the bat, we were served dirty cups as shown in the first picture. my partner and i ordered the karaage chicken and the veggie spring rolls, and were both yummy! we went on to order the shiyo ramen and the donburi rice bowl and… it was AWFUL. perhaps, either they had a bad day or it wasn’t up to our taste but there was very little broth in the ramen, because the broth itself had somewhat of a bit of flavor. however, i ordered an extra egg, and both eggs seemed spoiled for some reason..? tasted rotten. in regards of the rice bowl, it just lacked flavor. there seemed to be (A LOT) of spicy mayo and barbecue sauce to drown the rice and chicken so it can be somewhat flavorful? we didn’t finish any entrees, and when i brought it up to the server, they were kind enough to give me a fifty percent discount on the ramen, however, i didn’t finish it at ALL. i took at most three bites, so i really wasn’t expecting to pay for it at all, but it’s fine. wouldn’t personally come back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVMTZYOVNREAE",
            "text": "Such a hidden gem! Small cozy ramen restaurant with indoor and outdoor seating. Best edamame I have ever had and the ramen was the perfect portion to leave you satisfied. Definitely will be coming back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdDhYTkFREAE",
            "text": "So Instagram  brought  me here because the pictures  look phenomenal!!! Anyway I'm giving them 4 stars because they had this poor young man doing everything.. from bussing the tables, taking online  orders, doing the dishes, bringing out the food and even wiping ppls mouths after they ate if they asked. Lol (jk about that last part)\nBut the food took a bit long to come out and when we were done we had to wait awhile to checkout as well. As for the taste I thought it was ok nothing special.. my husband  and I tried the hungry man ramen which has EVERYTHING IN IT.\n\nFrom boneless fried chicken,  pork slices, bamboo, seasoned eggs and etc.. you get to choose your broth which we picked a creamy chicken  broth.. I wasn't a fan of the broth needed more seasoning.. I should of tried the other one which we were told was  a bit more spicier  but my husband  wanted to try the creamy chicken  broth...  this bowl was about $23 and we ordered   pork buns  and fried chicken which were really delicious WITH THE DIPPING SAUCES.. I would go back if I'm in the area but I wouldn't go out of my way like I did this time.. .."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNazV5YU53EAE",
            "text": "Excellent service, broth very good , soft boiled egg , thin noodles, pork also had a good taste, this is the only spot we got in the heights ! Thank God and the owners for it 🤣🤣🤣🤣 ... for those who are complaining, ramen spots in Japan are…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKemRtZUZREAE",
            "text": "Ordered Miso Ramen, taste very bitter specially the egg had to take it out and also the chicken.  The crispy shrimp were very good, crunchy and savory.  Probably have to try some another dish. Had to eat some though."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNXM2MWp3RRAB",
            "text": "Very tasty ramen and friendly staff. The dumplings weren't incredible, but everything looked delicious. Cozy atmosphere, but it can get a little cramped during peak hours. Overall, great experience and I'll be sure to come back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJa0lyNFN3EAE",
            "text": "Please improve the quality and taste of your broths. I ordered their big man Ramen which was for $23 and I was surprised to see just a whole egg, two pieces of fried chicken and few pieces of pork if I remember precisely. The broth was horrible. My girlfriend left the entire thing and I was frustrated because we read so good reviews.\n\nI don't know what's the deal with reviews but I was thoroughly disappointed with the taste.\n\nAjisen & Tabata Ramen are two other Ramen place in Manhattan who would beat this place in price and taste."
        }
    ],
    "reviews_count": 77
}