{
    "name": "Cachapas y Mas",
    "place_id": "ChIJ2wU1Owb0wokRSpCLX-FXJtM",
    "grid": "MN12",
    "address": "107 Dyckman St, New York, NY 10040, USA",
    "rating": 4.4,
    "user_ratings_total": 2449,
    "phone_number": "(212) 304-2224",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odVV6Sk9aWGx6VVVFdFQxQjVlRzE0YVhkU01sRRAB",
            "text": "I was in the area and decided to stop by randomly — I am so glad I did. I ordered the cachapa pabellon (pictured) and it was deeply flavorful and delicious. I would absolutely recommend this spot for this dish alone! Can’t want to be back and try more of what the restaurant has to offer."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xndFoxZFliMlJtTWtadmJDMVBPREp6Ym14c1NYYxAB",
            "text": "Ya comer ahí es más caro que una operación de corazón abierto"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTVgwc3RkbWc1TmtaUGRuVjFSMDF4VkZSUVVrRRAB",
            "text": "Love this place for late night food/snacks!!! I love their passion fruit juice and their lemonade."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKV01sUnJSVVJPZFRGNlVFcFJUSG93Y0hOR2FWRRAB",
            "text": "Muero muero muero! Hace mucho que no venia. Han cambiado su locacion y expandido el menú.  Más maracucho/venezolano y menos dominicano!\nLos yoyos de morir! La agua de panela deliciosa. El queso palmita me hizo llorar! El servicio muy bueno. Super atentos y amables. El pan dulce que ni me acordaba de el! La verdad lo único que le falta es poner solo música Venezolana. Muy rico y lo recomiendo literalmente y totalmente!\nViva Venezuela!  Por Venezuela algún día libre! 🇻🇪"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMFNUUnhSRXRLVFdwS1NXOTJVMGhGZG5WdGVVRRAB",
            "text": "Good food. Open late. A bit overpriced but not terrible. They're cheap as hell with the sauce. You'd think it comes straight out of their veins the way they react when you ask for extra."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dUtUb19BRRAB",
            "text": "The food is delicious! I usually order tacuhos, cachapas, empanadas, and jugo de chinola. The service is usually good, but it can be inconsistent due to their extremely busy times! The atmosphere is upbeat and the neighborhood could be dangerous. Be careful when leaving your car double parked to get your order; you can get a ticket."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMFN5MVdSMlEzZGsxbFV6UmthMkY2TFUxclQzYxAB",
            "text": "This place isn’t what it used to be, the personnel there are too careless and rude. Calling to get something delivered used to be so easy and now it seems like I’m trying to call the White House. They put you on hold for 3 minutes and then hang up on you!! This one time it took 2 hours to get a single cachapa to be delivered. On the delivery app( second party)  they use it said my order had been cancelled and then we called and the worker said that the delivery guy had just came(implying he was late and busy). Then the delivery guy told us the truth that they probably had forgot to put in the order because he had just received the request for a delivery. Do better! It’s sad to see a childhood staple go bad. Disappointed"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMFYwMVBRV2N4VUZKTE5tOU1jRmt3WlVsRVRHYxAB",
            "text": "Had the Venezuela burger and the full cheese traditional cachapa. Delicious both and I'm saving more than half for future meals, lots of food. The cane sugar lemonade also great, though a tad too sweet."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbVEwdDZabEJPY1V0MVFVcEdaSFE1ZG05aVZsRRAB",
            "text": "Muy Buena comida pero mal servicio necesitan empleados nuevos me dejaron esperando por más de 10 minutos en la llamada y cuando llegué a la tienda estaba vacío y los empleados se rieron de mí y me dijeron que el empleado que me dejo en espera se fue.( un joven morenito con trenzas )"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTFNIVXRRM1YxY214bGJrcG9WbEF5V0c5dmNVRRAB",
            "text": "The food is absolutely amazing. Ypu must try the cachapa and the burgers. I usually order delivery or pickup, there are tables available though.\nThis is definitely one of my go to places when I want something delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMGNrUlVNa3hQVFRSSlYwUjJjVlJ5ZWxOdGVIYxAB",
            "text": "The arepa didn’t have that slight crunch or that sweetness that I usually love. The plantains were a bit undercooked for me too, and there was very little cheese. It was a fine experience but, I wouldn’t come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WGFGaFVMVk01ZUZBM1R6RTNhVlo1VDBZeU1XYxAB",
            "text": "Cachapas y Mas lives up to its reputation. The personnel deliver care worth noting. The cooking style is distinctive. Their value proposition can't be topped. This place deserves a try."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUGVtSTBaWE5zYlhneE5qRXdaRGhHWDBGeGQyYxAB",
            "text": "Hoy 3 de septiembre a las 9:25 Am, gaste tiempo y gasolina y estaba cerrado. Aun cuando dice aquí está abierto"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKa2QzaFZXakJ5ZWs5WmJVMUdiemgwVTNNeFJHYxAB",
            "text": "Yummy food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMFRVMVhaSE5uYjJReldtSTRZMGcxVURSTFZYYxAB",
            "text": "If this place ever closes I will cry."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdU5YZHFRek5ZWVdsNVZFUnBPSGR3YVROVlRtYxAB",
            "text": "Wow the cachapa was  delicious - so flavourful and cheesy! Friendly service as well. This restaurant is definitely worth the subway ride! After spending the morning in Fort Tryon Park, this was a great place for lunch."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NFVXRkNPWGN6YkdkUWRURTJPVXRPYzNWdWExRRAB",
            "text": "Los Tequeños estaban viejos , tiesos, las empanadas igual son recalentadas, las cachapas no tenían buen sabor , y la cajera no estaba de buen humor , en fin fatal no lo recomiendo vengo de tan lejos y quería comer rico en un lugar venezolano y la experiencia fue fatal. Ah tienes que hacer una cola para pagar y pedir no hay servicio a la mesa .."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMlJuRlFiWHB5WDBoMk5scDRTV3c1WlV4cVVWRRAB",
            "text": "La comida es recalentada. Súper decepcionada y no es nada como una comida venezolana nada parecido a la realidad . Todo asco"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bU9EQTRlakprWm0xb1NFaENXSFZsVFdVNVZHYxAB",
            "text": "One of my favorite places to eat in the city. I come here after every visit to the Cloisters"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeFZVSlJZalJSU0dwbldWRldjVXRLUlVzNFpsRRAB",
            "text": "La comida está muy buena pero el comportamiento de la cajera es asqueroso, parece que está enojada con la vida, con sus expresiones faciales y el tono que usa se nota que odia su trabajo. Lugares tan buenos con malos trabajadores son una decepción. Se que no fui ni seré la única clienta que se sienta de esa misma manera con respecto a la cajera porque todos en la fila pusimos la misma cara al ver su reacción tan no profesional.\n\nfood is incredible but the treatment the cashier gives is disgusting, she’s very rude for no reason.\nHer facial expressions and tone are so unprofessional. If she doesn’t like her job she should quit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MGNHOW1hSGRuWVZwQ2RuaG1WbkY0TkVjeFZuYxAB",
            "text": "Amazing skill evident in how perfectly each dish is prepared. The flavors dissolved slowly while I tried to make them last. They treat you well in an inviting environment. Our meals arrived fast thanks to excellent service. This restaurant showed they appreciated me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNVdYUm9WV2cyVFZoYWIzQmhaRkY2YzBaaU5rRRAB",
            "text": "It’s not for Me and it’s overpriced but to each its own, god bless."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUE0zQmlhMkZIWmtwbFpsaFpiM05XY0U1TVNrRRAB",
            "text": "The patacón was super tasty! I would definitely get it again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RWFua3hNMnMyWkZGT09WVkpiUzFHZEdSU1VtYxAB",
            "text": "It was Great I loved trying this place, I got a Cachapa and it was super good. wish I took a picture 💔"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjME9GQnlabVJqYVRoUWNqRjZTamt5VEU1WlNsRRAB",
            "text": "La comida es buena pero hoy pase compre dos arepas y una empanada y solo me dieron una salsa rosada ? Dios míos con lo que unos gasta una salsa"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MVNXZEZTbmMzUVZoVlFuTXlRakUzTlhKUlNIYxAB",
            "text": "The food was pack to go wrong I try to explain to the cashier but she did not do anything to corrected. Bad experience"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGT1gzbEdUWEJHYzFWMFpWVjZUMU5JZFc1U09WRRAB",
            "text": "Excelente negocio de comida. Se los recomiendo. La atención especial, la comida super buena y abre hasta tarde o hasta temprano en la mañana."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcGQzbHRNR0ZQZGpWaFNVSktORUZmU2pGdlJsRRAB",
            "text": "Vine con mucha ilusión a este restaurante porque soy venezolano y, después de dos horas en bicicleta, quería darme el gusto de comer algo que me recordara a mi país.\nPedí una cachapa con carne asada —como las que comía allá—, y pagué más de $20 por ella.\n\nLamentablemente, lo que recibí no representó ni de cerca lo que uno espera de la cocina venezolana.\nLa cachapa estaba sumergida en una cantidad excesiva de nata, casi como una sopa, y la carne era mínima, a pesar del cargo adicional.\n\nNo se trata solo del precio. Se trata del valor simbólico que tiene para los que estamos lejos de casa: uno espera reencontrarse con su cultura a través de la comida, y duele cuando lo que recibe es una burla.\n\nEscribo este comentario con respeto, pero también con firmeza.\nLos que cocinan venezolano en el exterior no solo hacen comida: llevan consigo una responsabilidad emocional con los que extrañamos nuestras raíces.\n\nEspero que puedan mejorar. Porque, honestamente, esto no fue Venezuela."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORE1qaE1TMjFLWDNFNE4weDBaMVZuZFdSd1NWRRAB",
            "text": "Muy rica la comida y muy lindo el lugar"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25semQyRldTRlI2U2xsMFRFa3RUM28wVTIwNFFtYxAB",
            "text": "I love this place definitely a must go every time I'm around Dyckman, the patacon and the palitos are great I love them. Everything here is just delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdloyZHNYM042ZVd0dFVHbFhRa05YTW1FeVRGRRAB",
            "text": "Busy establishment. Delicious food but a long wait for jt. Cachapas are great, but h suggest calling your order in at least 10 minutes ahead."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcjctR1NnEAE",
            "text": "They have the 2 meat cachapa or the three meat cachapa. Amazing. Have it with the sauce."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ga1JUUlBTalIyU1Y5TE1EWkVjeTFVWWpoS1ExRRAB",
            "text": "Primero que nada que servicio tan malo, la gente parece que se quisiera ir a su casa, realmente pésimo el servicio y no se diga de la comida… no genera ninguna reputación como comida\nvenezolana Guao…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWlFreFJSbDloVDNaVU5uSldVMmhOUjFsUFlVRRAB",
            "text": "The food was ok and the prices are very high. Was expecting better taste! 😏"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBNExYZHBjSFp2UVhCTVRrZHpURmd3VFhkWWJFRRAB",
            "text": "Excelente la recomiendo"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVVdIZHlaWEUwVDBGNGNrdDFjRU4wVW1WVE1sRRAB",
            "text": "I love the cheese sticks best one in the city recommend hands down been going there for 8 years now great atmosphere in dyckman"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1QllYWlVjM0pKVFZOb1UzWnVhVWR6Ym1wMU9IYxAB",
            "text": "NO ES BUENO NO TE DAN LO QUE PIDES Y PAGAS MÁS. La comida es una porqueria. No están vendiendo la misma comida que antes"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvelVrRkZZamxsWjJaalVVd3hhRlYwYTFoVk1YYxAB",
            "text": "Todo muy bueno"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbVZubGFlSFJ5ZG5Wa1RqaEpUV0ZuYjBKM1NtYxAB",
            "text": "Unfortunately, the food served in Cachapas Y Mas seems like a poor advertisement for the country's cuisine. The Arepas Pabellon ( shredded beef) was good but lacked black beans and cheese means it was not pabello, it was arepa with meat and plantain only! The sweet plantain was good.\n\nThe empanadas de carne mecha were over-fried, making a hard texture.\n\nThe tequeños were a complete disappointment; the te queños were undercooked, and the cheese was just a block of cheese inside. It didn't even melt when you opened it in half!\n\nThe flan was so bland that it was not it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUEQ0Wmo1M3VDWEtBEAE",
            "text": "Foods real good fast service and authentic Venezuelian food will be back for more prices are a little high but good food Paulito queso needs to be improved also and save for them needs more flavor otherwise foods good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJT01zcjMtanNPM053EAE",
            "text": "The food was great, and the service was amazing. The workers were incredibly nice, the food was out in a couple of minutes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQzQyTGJIM3BhT2hBRRAB",
            "text": "This place is amazing! They don’t really speak english but both the cachapa and arepa are gluten free and okay for celiac. I had no reaction here thankfully bc it’s so good. Best lemonade ever"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbjdhc1R3EAE",
            "text": "Great place to eat. I have been here few time. I got the most topical dish and it’s was great. They have seats available, in and out doors. It’s moderate clean, but they can do better. The prices is not that cheap. The service is a little slow. I was waiting a little long for my order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIX0lfZFFBEAE",
            "text": "First timer, very easy access via the 1 train. Not even a two minute walk. The service was expected, they took our order, asked if we wanted everything on our sandwiches and asked if we were dining in or to go. Once we ordered it took about 7 minutes to receive our food. They walked it out to us. We sat outside, there are 3 tables there. Today was a nice 70~ day. Now onto the food, it was all delicious, I had the Yoyo Sandwich with mix meat and the Pepito with Polo Mechado. Pictures are attached. Both were great. I would definitely come back again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMi0tTk1nEAE",
            "text": "This is one of my all time favorite restaurants and they never really disappoint!\n\nI will say that there have been times in the past when I would get steak cachapas and the steak would be a little too hard/fatty but I don’t typically order that anymore.\n\nI love the ham and cheese cachapas as well as other variations!\n\nThe palito de queso are delicious as well!!\n\nDefinitely recommend getting one of the beverages available inside!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicUpLS1NnEAE",
            "text": "The cuisine looked very unique and hence we visited this restaurant. We loved everything we tried (all vegetarian) - Arepa vegetariana, cachapa (sweet corn pancake) with venenzualan cheese, tequeno and our two favourites - Patacon with Frito cheese and Chicha (a rice drink similar to Horchata). Service was quick and good. Lots of tables to sit inside and out and a clean restroom."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbS1HdmlBRRAB",
            "text": "Very friendly! I have bare minimum Spanish speaking but they were understanding. I got the empanadas de pollo & limonada. Comes with sauce. It was very good. Very close to dyckman station."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoM2JDWklREAE",
            "text": "Cachapas y Mas, located in the heart of Dyckman, NYC, is a hidden gem that offers a taste of Venezuela in the heart of Manhattan. The tiny restaurant, with its bright yellow facade and rustic decor, is a welcoming and cozy spot that's perfect for a casual meal.\n\nThe menu at Cachapas y Mas is focused on Venezuelan cuisine, with an emphasis on arepas and kachapas - two traditional dishes made with cornmeal dough. The arepas, filled with everything from shredded beef to cheese and avocado, are crispy and flavorful, and the kachapas, stuffed with cheese and served with a side of shredded pork, are a must-try for anyone looking for a delicious and authentic taste of Venezuela.\n\nBut what really sets Cachapas y Mas apart is the passion and hospitality of the owners. The husband and wife team are warm and welcoming, always happy to chat with customers and share their love of Venezuelan cuisine. They also make everything from scratch, using fresh ingredients and traditional recipes, so you know you're getting the real deal.\n\nThe drinks menu at Cachapas y Mas is also worth exploring. The fresh fruit juices, made with tropical fruits like guanabana and passion fruit, are delicious and refreshing, and the mojitos are expertly mixed with just the right amount of rum and mint.\n\nIn conclusion, Cachapas y Mas is a must-visit for anyone looking for authentic Venezuelan cuisine in Dyckman, NYC. The arepas and kachapas are delicious, the owners are warm and welcoming, and the atmosphere is cozy and inviting."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKR3k5NG1leTk3ai1BRRAB",
            "text": "The food was heavy, greasy, and not worth it. The fryers were probably not hot enough, but even if they had been, there was barely any flavor and made us feel gross after eating. We had the one vegetarian option with the plantain, avocado, barely any black beans and cheese that felt like chewing greasy rubber."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibWVYSkt3EAE",
            "text": "Good service, but the food was off\nGot a cachapa and when I opened it\nI found it had some kind of green sauce that I never got in my food the past times I ordered usually they used a different one\nThe queso frito was in fact burned and hard, barely able to bite and the chicken was dried disappointed by it sadly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURib1AzY1V3EAE",
            "text": "Solid authentic neighborhood cuisine when up on the Dyckman. Came after the summer league at the park and enjoyed some quality arepas that made me wanna say wepa!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhXzV2S0lBEAE",
            "text": "I have lived 70% of my life in Washington Heights but never knew about \"Cachapas y Mas\". I have friends and family who drive from long distance to come grab a bite to eat here.  I decided to drive down and try it for the first time.  Don't get intimidated with having to order through their window and seeing a long line - the wait wasn't that bad at all.  (Dining inside was closed).\nThe cashier lady was the sweetest and gave explanation for dishes. She even helped with suggestions.\nNow let's get to the food: OH MY GOD, I am addicted.  Absolutely delicious! We ordered Patacon with pernil, Cachapa with 3 cheeses,  cheese sticks and 2 delicious drinks that I can't remember their names for the life of me!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlXzlYcXBnRRAB",
            "text": "I usually visit the place with and for family to order from 10-20 tequeños (cheese sticks) and other foods like cachapas. Unfortunately, this place has been going downhill in terms of customer service and food quality. I passed by today asking for 10 cheese stick for $20 and those cheese sticks, looking from afar at the warmer oven, appeared to be sitting there for quite a while. I told the staff if I can wait for the next batch to come in since they are always on demand. The cashier said no, that these are good and fresh and passed me the paper bag of cheese sticks from the conventional oven and disregarded what I had to say. The cheese sticks smells like paint and one has a green dot on them and 3 of 10 are really old. I must say that this is a very bad experience and I will not be buying food from there. This will be the last time I buy from there and what a waste of 20 dollars for days off food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbksyVC1nRRAB",
            "text": "The best cachapa I’ve ever had! The perfect combination of flavors I will never get over the sweet corn cakes, chicken, and the creamy sauce. It’s located right off Dyckman street and next to the subway. If you find yourself in the area you…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbnRxbERREAE",
            "text": "Haven't been here in awhile. Friday 10/7/22 I came in around 9:30 pm maybe even 10 and ordered 3 YoYo's. One steak, one pork, and one chicken. I asked for the sauce on the side. I was double parked around the corner so after placing my order I went outside to check on it. There weren't many people there when I ordered but  when I got back there were. I saw they were serving numbers that were greater than my ticker number so I asked the woman behind the counter if mine was ready and showed her my ticket and she said yes. I also asked her if the sauce was on the side because I didn't want the sauce on the Yoyo. She proceeded to grab a bag that was sitting waiting and ready to go and realized it wasn't mine. To my mistake about 15 minutes later she singled me out and I walked over and she handed me my bag. I was talking to a woman who visits family in Manhattan from Massachusetts and orders here everytime shes in town, but that she didn't know what they were doing this particular night. After grabbing my bag I said thank you to the staff member and goodbye to the lady.  I went to my car and drove to Westchester. When I got the food home I started to serve my 2 quests the food and we saw that all the Yoyos were chicken and the order receipt that is usually stapled to the bag was actually inside under the first 2 Yoyos and it wasn't even my number. I still have yet to taste the steak and pork and wasn't particularly happy with chicken as it is not what I ordered. Also to note each Yoyo comes with 3 types of sauce and they didn't put enough in there for one so one of my guests had to eat theirs with hot sauce. I don't know if I will be back and if the prices are the same for all the meats. Disappointing to travel far to get take out food to get home and it to be completely wrong.There was police and ambulance presence at the corner so I didn't check the bag as I didn't want to open each one individually. I advise anyone to sit down inside and check their bag before leaving. Also each plantain was different in thickness in each of the 3 Yoyos. Picture is my Yoyo disassembled and without the top plantain because it was way too thick (both were top and bottom) and the police presence when checking on my car and going back inside to get my food . 15 minutes turned into 35 and I didn't even get what I ordered."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMGFyMTRnRRAB",
            "text": "Un trato excepcional... todo tiene un sabor espectacular... imposible no ir si estas cerca."
        },
        {
            "date": "6년 전",
            "language": "ja",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZak0zVmZ3EAE",
            "text": "★★★★★ 同ジャンルで最も人に勧めたい\n★★★★☆ このエリアに来る人に勧めたい\n★★★☆☆ 人には勧めないが再訪したい\n★★☆☆☆ 自分の意思では再訪しない\n★☆☆☆☆ 誰に誘われようとも再訪しない\n\n南米ベネズエラ料理の店。パタコンというローカルフードを食べられます。パタコンはハンバーガーのようにレタス・トマト・肉などの具をサンドしたフードでパンのような部分は青バナナから作られていてとても硬い\n\n味は普通に良いものの、好みは分かれるかもしれません。パタコン以外も美味しかったです。ちなみに、パタコンのパンのような部分は硬すぎてプラスティックのナイフ・フォークが歯が立たちません、、、"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxa3N2bUxnEAE",
            "text": "Delicious and amazing!! Love the cachapas!! I am Venezuelan and sometimes it is really hard to find a good cachapa but this one is 12/10. We loved it and definitely will be back in my next time in NY"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNFBTUzlnRRAB",
            "text": "Food service horrible. El pollo todo crudo acabó de llamar a dejar mi keha. Horrible. Como es que ordeno una kachapa y me llega toda desbaratado. Asko. Cambien de Griller."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN2VXZUtBEAE",
            "text": "Es mi restaurant favorito pero cada vez hacen la cachapa más pequeña  y con menos pollo si siguen así voy a tener que comprar en otro lado"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzX0liLVNnEAE",
            "text": "Delicious and unique taste. This was our first time tasting Venezuelan food, so can’t really comment on whether it’s authentic or not. We ordered pork cachapa, beef yoyo, chicha, and papelon. The sweet corn pancake (cachapa) was crispy and…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdko3VERnEAE",
            "text": "Una cachapa muy mala aparte le echan tomate mal picado y le echan salsa roja el sabor muy malo. No se lo recomiendo.  La muchacha que atiende es una grosera. Cuando le dije porque me le puso salsa roja me contestó mal.  Bueno allí está la foto. De una cachapa de mano.  Espero mejoren."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncUxtV0lBEAE",
            "text": "Recomendado, uno se teletransporta a los sabores auténticos venezolanos, recomendado al 1000, solo tardaron 20min en hacerme llegar mi pedido un delivery eficiente"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyc2FTemNREAE",
            "text": "Amazing food and friendly staff. You will never believe having pancake taco/sandwich like dish. The amazing flavor made up for my suspicious feeling if something can taste so good. Steak was cooked amazingly with flavor, just bland meat. The mixture of spice and sweet made for a unique blend and style that I couldn't ever place again. The only knock would be price, however the food is way worth it."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdnFmbE5REAE",
            "text": "Best Venezuelan Cachapa🙏🙏🙏 love coming here every Sunday for the best Arepas in NYC❤❤❤they making an amazing Patacones of grill Chicken. I highly recommend this place  for Venezuelan food!!! Prices are reasonable. Jesus Jimenez is a young employee with a charming personality that make sure that all client are treated well."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbDlXOVZnEAE",
            "text": "I love the Cachapas - got the asada Cachapas, and wife got the 3 cheese. 3 cheese was better than the asada."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cUlMa2JREAE",
            "text": "I order from here to go and honestly Victor it’s the best customer care over there, understood in perfection my order. Somebody hard worker and try the best to customer with his Dominican flow 😋"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOUwtcjd3RRAB",
            "text": "Hoy estuve de visita por este lugar en Manhattan NY desde Ohio y la verdad no puedo decir que le pueda dar un 5 Estrella. Aparte de que no me dieron mi orden completa (me faltaron dos Tequeños) no hay un eficaz servicio al cliente. La cachapa que compre de chicharrón no me gusto un 5.5 de 10 puntos. Pero para cada paladar hay gustos distintos. La arepa estába muy rica 7.5 de 10 y la salsa verde aún más sabrosa 8.5 de 10. El cheese cake de Passion fruit estaba muy rico también 7.9 de 10. Y los tequeyoyo eran un poco grande 5.5 de 10. Pense que tendrían plátano frito maduro adentro pero creo era sancochado.  Las empanadas estaban bien le daría un 7.5 de 10."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRc01hWVVBEAE",
            "text": "This is a Hidden gem in the lower East side of Manhattan.   Easy to see right off of Dyckman Street.   A Venezuelan food stop with counter service.  Specialties are their sandwiches with plantains instead of bread.   The pernil is great.   Parking on the street is available but it fills up fast.   We will definitely be going back."
        }
    ],
    "reviews_count": 69
}