{
    "name": "Havana Heights",
    "place_id": "ChIJv5KsAJD3wokRMcTPBAgk-lI",
    "grid": "MN12",
    "address": "4083 Broadway, New York, NY 10032, USA",
    "rating": 4,
    "user_ratings_total": 774,
    "phone_number": "(646) 590-9734",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSE5qVkdPSFpSVDNGM2EyUmxiRFpKZWtWTlVXYxAB",
            "text": "Food was pretty good."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVGNFVkRWV3AyTFhoclkwbG9TR2xVU1d0NVlYYxAB",
            "text": "I never write reviews, only when there’s a higher force involved. And in this case, that force is ridiculously GOOD FOOD I just couldn’t keep it to myself. Everything tastes fresh, homemade, and full of flavor. The churrasco I had tonight was amazing; the yuca fries, rice, beans, and guac were all perfect. Portions are super generous and you can really tell the quality. Seriously, if the delivery is this good, I can’t imagine how great it must be in person. Congrats to the team — you guys are killing it!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcUxYSkhUa1ZETFVkVFpIUnlWR2gzZEhWcVpFRRAB",
            "text": "The chivo terrible the taste was like they didn’t even put the chivo to cook and was hard to eat it even the smell was really bad, and the bean taste like nothing the only good thing about it is the white rice no more than that, I order here because of the good reviews but I’m really disappointed"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeE1tbHZNV1pzU0RGT00xbERZa3RWVkVWSFZrRRAB",
            "text": "Pesimo servicio , He pedido vegetales salteados un par de veces y siempre terminan enviándome vegetales hervidos , según la chica son salteados porque son varios."
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTlEzZzBiMlpIZW1rNFIxVmFWVEZKVlMxaFYwRRAB",
            "text": "He pedido en 3 ocasiones comida de cierta forma y la envía de la manera que les parece, solo dicen que no pueden hacer nada creo es el peor lugar para pedir comida"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaVRreDRSR0oxTlc5Q09HMU9SekpHVWpOTVRVRRAB",
            "text": "Absolutely way too expensive. You can get MUCH tastier food at other nearby restaurants for better prices. Their sancocho is lacking, and the \"deals\" offered on delivery apps are just as expensive. 6/10."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRFNWYzBja2w0YTFFd2QxZE9aVTVGWjI1Rk1HYxAB",
            "text": "Honestly showed up for a happy hour treat as it was proudly displayed outside their restaurant. Upon sitting down at table, we were informed that their happy hour only consisted of 2 drinks and no food. We ordered an empanada and it was very salty. The carrot juice was good. Service was a little lacking. Do not advertise happy hour when it's just 2 simple drinks."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdVpqZzJXSGhTYzNSbVpVTlRXSGxRZDBaVVNXYxAB",
            "text": "La comida, el servicio, los empleados. Terrible el combo completo. Está comida no es auténtica Cubana ni parecida mucho menos la ropa vieja son trozos de carne seca que no pude digerirla 30$ el servicio y la tuve que dejar como me la sirvieron y cabe mencionar que esperé 1 hora por mi comida y solamente habían 3 mesas ocupadas. Los empleados voltean la cara y pretenden que no te están viendo para no molestarse en responderte si tienes alguna pregunta. Me alegro por los que se conforman con este servicio pero yo particularmente no regreso ni lo recomiendo."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scU0wdFJXVE4zZEU1NU1GUmpNbTV6VjJ4M1lYYxAB",
            "text": "This was the worst food I have ever eaten. The pork pieces were not eatable. They were so overcooked, dry and hard that it was not chewable. My friend brought me here for my birthday. Her pork chops  were so overcooked and dry she was not able to eat them. I will never return to this resturant. Lastly,I returned home only to get really sick from the meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbGNIWXdWV2xaTldkV1JIcG5NV1ptTUZCck1HYxAB",
            "text": "Used to visit this restaurant all the time but lately, I've been coming out smelling food and today, I left due to food smell and clothes with strong food odor."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NlMyZERORWwwYTBocVpuTkxXV3hwUjNOMGEzYxAB",
            "text": "Desde las 2:01 pm he estado intentando hacer un pedido. La primera persona que me atendió —un hombre sumamente maleducado— intentaba cobrarme $85, alegando que los impuestos eran más de $20, algo totalmente absurdo. Le pedí hablar con otra persona y, en lugar de transferirme, este señor cortó la llamada cada vez que llamaba. Esto pasó más de cinco veces.\n\nFinalmente, otra persona sí me atendió y tomó mi orden a las 2:20 pm por un total de $76.\n\nA las 3:00 pm llamé para confirmar y me dijeron que ya había salido (vivo a dos calles del restaurante). Son las 3:50 pm, ha pasado una hora y media y la comida aún no llega.\n\nQué servicio tan pésimo."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcllsWTBOVFpTUkVZeFFsQkdTR2h0TTJoNUxYYxAB",
            "text": "Talk about over priced and no seasoning on the food. The pernil is very dry with no seasoning , very disappointed considering its Cuban food and it’s from the heights. All I can say there are no Cubans in that kitchen"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNTRQa2tBRRAB",
            "text": "Have eaten here a few times. Good food. Love the roasted pork. Cuban sandwich is great. Food is fresh cause it always has customers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNT0kxWTJzcEk3MU1BEAE",
            "text": "Great vibes and lively atmosphere, but the food didn’t quite hit the mark. Some dishes lacked flavor and felt underwhelming. Fun for drinks and music, but not the best for a foodie night out. Pricing for food was good though"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJcWVuNWExbGM2cEhREAE",
            "text": "Such a terrible service. Looks like this people don’t even want to work here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLWGVtZmVqbGQ3N3p3RRAB",
            "text": "I normally support neighborhood restaurants and this one is pretty cool  and clean, however the last three times i went there was a white guy who is probably the sons owner because he is either on the cashier and is slow or on his phone, and my order was delayed for a while which is cool but that dude was standing there and one employee was fixing several orders😆 i mean yes daddy is the owner but do something help the people sometimes, stay on ur phone when ur home."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ3MtN2V3EAE",
            "text": "Good ambiance in the midst upper Manhattan"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc1BPdXJBRRAB",
            "text": "Ordered a two deal from Uber Eats, food was pretty nice and I liked the way the boneless chicken was cooked.\n\nMy concern was that when I came in the lady skipped me to service a man. I walked with my baby on me to get our dinner, we walked in first- the man was polite and had me go in first. The person who seats was polite and immediately asked me but I was there for picking up. The place looked empty. She skipped right over me and asked the man something instead. That was really strange and awkward behavior."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdDZXUFZnEAE",
            "text": "Good food,  good servings at a reasonable price."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbk9TMXN3RRAB",
            "text": "Have a party of 15ppl. Food came fast . Drinks were great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcjVtVmtRRRAB",
            "text": "Early weekend breakfas for 4. Service was quick, friendly and attentive. Bfast plate were reasonably priced and generously served. Cafe y leche was aromatic and full flavored also ordered the empanadas which came either in pollo o carne in crispy thin fried crust-sabroso! Dining area spacious and bathrooms clean."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbUxtMXJnRRAB",
            "text": "Problem now! The 2hr eating time per reservation, not enough time if u having a bday and waiting for guest! Changes the e tire experience when u must chew and leave...don't knoe about going back now....!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NmNpbWhRRRAB",
            "text": "Neighborhood Spanish fare wrapped in a stylish Cuban package with some nice artwork, a Latino hip-hop track and a few Cuban specials on the menu. Most entrees seemed Dominican or Puerto Rican to me, although I am not a specialist. Had tasty grilled Salmon and Shrimp platter with a side of beans n'rice. Good avocado salad on the side. Seems a bit pricey for this type of cuisine with so much competition in the neighborhood."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3M0t2ajNRRRAB",
            "text": "La comida estuvo excelente, Steak cocinado tal como lo pedí , buen sabor en todo lo que pedimos, lo único malo es que hay que acostumbrarse a recibir 1 ó 2 de los 3 requisitos, Comida/ Ambiente/ Servicio.En mi caso recibí Comida y buen Ambiente."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1d0xxTUhREAE",
            "text": "Great food great service will go back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaGF5dXN3RRAB",
            "text": "Staff was attentive and polite. Food is fresh and authentic. You went be disappointed!"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnc29paGJnEAE",
            "text": "Definitivamente decepcionada, comida mal presentada y en ima spiders una cosa y te Mandan otra. Para mi le doy un cero"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd2RYZUtBEAE",
            "text": "Great food, perfect atmosphere and good service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaE1fdkZBEAE",
            "text": "I wish I could give a zero star. The Tress Leches cake was spoiled . As you open the cover you can smell the sour milk. Gezz,  ppl work hard for there money and to get items like this is disgusting.\nThe pernil was dry and burnt. The rice had no taste.SMH. I will never buy from this place again. Waste of money."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaEtMX3hnRRAB",
            "text": "Nice place to get a pollo con arroz y porotos negros. But you can get much more than that. They have full cuban cuisin as well as signature cocktails. The ambiance is pretty good, walls are filled with murals and people at the countertop are really friendly. Great cuban spot to spend a nice dinner, cheers🍻 ."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmLWZMeXNRRRAB",
            "text": "It’s average Latin food, nothing special but the people in there offers really good service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dnBIRzFnRRAB",
            "text": "THE FOOD IS DISGUSTING!!!!! I ordered a Sancocho and the chicken was RAW!!!! It was completely raw! Who the hell runs an establishment that sells raw chicken?! I’m pregnant so if ANYTHING happens to my baby I’m suing!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eE1xQVNnEAE",
            "text": "Excelente"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNi1qTThRRRAB",
            "text": "Perfecto! Encanta la música !"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzM2NmSV93RRAB",
            "text": "Buena comida\nLimpio"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOTZmelVREAE",
            "text": "such good food & drinks! we've even ordered from them and the food delivers well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYckxYejJnRRAB",
            "text": "After a long day of walking in New York, we were looking for something nearby to eat and we discovered this corner with the smell of Cuba. What a pleasant surprise!\nThere isn't much of our beautiful Cuba in New York!\nThis restaurant really draws attention compared to the places in the area, all very small and we could say very shabby, this restaurant is very nice, very well cared and we liked the atmosphere.\nWe only ordered a few beers and something to snack but everything was delicious.\nThe service girls, very nice.\nTotally recommendable!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuLThIbEZ3EAE",
            "text": "Although the food of chicken and rice felt basic, I could feel the love, that made me want more and even to marry a Cuban one day."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudkt6aVdREAE",
            "text": "La comida y el servicio son espectacular"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaElQR3R3RRAB",
            "text": "Desde que llegamos nos atendieron y en 4 minutos llegó la comida la comida está delo mejor dios bendiga este restaurant muchas felicidades"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMllhdzB3RRAB",
            "text": "Dinner combo #7 is steak and onions, rice and beans, and salad. There were no beans in the beans sauce, only the sauce. For a large, they gave me two thin-cut sliced steaks with one pound of onions. Sadly, there was no flavor in the food, and everything tasted like nothing to me. I wasted 38 dollars on this meal. In spite of the fact that the person who answered my complaint was unable to understand English, he was unable to help me. I had a bad first experience"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbGJYOU5nEAE",
            "text": "La comida está bien, creo que los precios subieron unos dólares, pero las porciones son reducidas para la carne y los acompañamientos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeXJYSlJ3EAE",
            "text": "Delivery\nThis was one of the worst foods I’ve ever ordered!\nThe rice (moros) was hard and tasted stale\nThe Bacalao was the absolute worst/very overcooked, hard pieces, 3 pieces of pepper.\nThe coco flan which was 2 for 1 looked and tasted like they were trying to get rid of it!\nOne was completely burnt"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINE1UMFFREAE",
            "text": "The hostess at 6pm Friday night with glasses was very rude. Asked her a simple question and with a roll of her eyes she answered short and cut like if I was bothering her from the nothing she was doing. Almost walked out but remembered the amazing service they have at the bar. SIT AT THE BAR service is always a 10/10!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bzlfOTZRRRAB",
            "text": "Nothing fancy or special. Steak and chicken was dry. Server and service was excellent. Sports bar atmosphere. Shrimp was very good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cFpfYkp3EAE",
            "text": "NOT AUTHENTIC CUBAN FOOD."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaE0tOEJ3EAE",
            "text": "I visited here on Friday lunch time. The clerk was really kind. She made my first great cuban restaurant experience! Foods are tasty and satisfying. I recommend Horchata drinks."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNXzgtbEFREAE",
            "text": "This is a new restaurant in the Washington heights area.  The place is nice.  Plenty of seating, bar area in back of the restaurant.  Which I think it’s nice... many restaurants have their bars up front and it’s hard to even get in.\n\nThe food here is delicious. My colleagues ordered shredded steak which I tasted and was well seasoned and tasty.  I had the sea bass and was pleasantly surprised on how  fresh it was.\n\nThe lunch specials are only $10 and the portions  are substantial.\n\nDefinitely a place to visit often.\n\nIf you find review helpful, click like."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxd3BhN3JRRRAB",
            "text": "Everything was delicious, especially the mofongos, we made a reservation 1 hour before arrival and everything was ready. We had some cocktails and strong meals, the only thing I didn't like very much was that I ordered churasco combination, it ended up half sewn and if you see it in the photo it was too sewn, and above all, I expected to see it pink. but it was very cooked.\n\nThe cocktails were delicious and especially the mofongos were very good, in our case the shrimp in red sauce or the criolla was exquisite a little too garlicky. but it was good.\nThe mofongo in white bechamel sauce was super good and exquisite with a unique texture. which we loved with the combination of shrimp.\n\nNote: try to find a parking spot on a corner before arriving, it's a bit busy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MU5ycTZ3RRAB",
            "text": "I wanted to place with great ambience and great food. How's very please to see that I get both. Drinks were great as well as well as they're happy hour till seven p m."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHaDUzVjlnRRAB",
            "text": "Havana is one of my go to spots in my neighborhood for delicious food & drinks. I usually order the Ropa Vieja with a side of tostones, rice & beans. It hits the spot every time. Paired with a Moscow mule from the bar and it’s a perfect combination. The drinks are strong in my opinion so you get your moneys worth.\n\nThe portion sizes are very generous and you can easily have left overs to go for later. When I go out with friends, we order a bit of everything and share across the table family style.\n\nI love the service and vibe of this restaurant. There is always good music playing and the staff are friendly. The restaurant is a decent size and can accommodate large parties either indoors or outdoors.\n\nAlso, Havana is great at catering for events. I have ordered catering for several birthday dinners and my guests have always had good things to say about the Chicharron De Pollo platters & Tour of Havana. So good!\n\nTry it out for yourself and enjoy !"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNi03b0xBEAE",
            "text": "The food really good, recommend if you are craving Cuban or Spanish food. Also go with an empty stomach cause the portion is big. I normally finish all my food at restaurants, but here, I left with two containers. The hostess was also super nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdzZtTEp3EAE",
            "text": "Very pleasant atmosphere\nThe food was delicious I had the Tour of Havana and it’s a plate with different meat and sweet plantain, and green plantain and it was delicious also plenty and of food. Our waitress was very friendly and helpful."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzcFB6U0t3EAE",
            "text": "This Cuban restaurant is amazing. I was here today with my team from Hillsong and we had loads of fun. It’s actually my first time tasting mofongo and it was really a delicacy. I also love the Spanish song playing in the background; I was told the song is titled “Llesgaste a Mi” by Mark Anthony.\n\nThis place is clean and cozy with people all smiles enjoying their meals. It’s also pretty close to the road and can be easily noticed from a vehicle in normal traffic. There’s also wheelchair accessible entrance ♿ for the differently able.\n\n#NYC #Restaurant #Mofongo #Food #CubanRecipe #LetsGuide #OnGoogleMaps #GoogleMaps #UptownManhattan #WheelchairAccessible #Google #Food #BigApple"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcW9tbmR3EAE",
            "text": "Our first time here. Took my parents for dinner and it was fantastic. The food portions were huge and tasty. The server was wonderful.  Can’t say enough about how great of an experience it was!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbXMzQ1pBEAE",
            "text": "The atmosphere is friendly and calming.  The murals and artwork is beautiful and compliments the ambience of the place. All of the food is Delicious. Definitely try the Havana Punch and Sangria."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzOFlpMkFREAE",
            "text": "New spot, as of 3/7/20.  I had the Rabo encendido and ordered a side of platano.  Excellent stewed oxtail but all the food was lukewarm. Very odd, so some work needs to be done between the kitchen and the staff. The oxtail was delicious and…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyLTVUMlhnEAE",
            "text": "Found this place cause my mother is in the hospital and she wanted Spanish food. Found this place close to hospital and I have to say the food is delicious. The decor of the place is absolutely beautiful. Did not dime in took take out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQya2N2eHN3RRAB",
            "text": "Excellent location in Manhattan New York.........food was delicious and customer service was great........................ music and drinks 🍸 and diner are the point in this restaurant................................my personal experience in this place was wonderful 100% thank you all.....................................see you soon"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcnNXVkZnEAE",
            "text": "Tripe soup was so delicious! Cuban sandwich was good. Sampler meats were little dry but with sauces, they were yummy.  Definitely return for tripe soup!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsN3NTMlF3EAE",
            "text": "I would've given them an extra star but they refused to turn the heater on outside. We wanted to enjoy a meal outside with my dogs and they refused to turn the heaters on... why have them then?!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiakozRUFREAE",
            "text": "I ordered a ropa vieja through uber eats and it was the worst food I have ever tasted, the rice was stale and had no flavor, it tasted like it was warmed up in a microwave, the ropa vieja was just as worse, it was not even the right color, tasted like a half bottle of salt was poured into it and mixed with w/ tap water, couldn’t even finish the meal, a waste of $35. I’ll never buy food from there again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbGJDM2xRRRAB",
            "text": "The drinks were really strong but not overwhelming. The food was barely warm we and it was supposed to be a sizzling steak fajita. The service was not the best either. Maybe she thought we weren't going to tip her so she did only what she had to do. Which was to bring all our stuff to us after a long wait."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dVpfZ0N3EAE",
            "text": "If I could give it 6 stars I would. My family has lived the heights for over 60 years. We came to visit my 95 year old Grandma and treat her to a special birthday dinner. The staff knocked it out of the park. The food was excellent, am iance was great, hospitality was second to none.  Jose the manager called out my grandmother from decades ago when he was a kid. He made her feel like a queen and made the evening special. It was a challenge to get her out of the apartment and to walk just a few blocks but it was well worth it. The steak is to die for and so is the flan. The street dining looks like a nice option too (another day). We will be back again for sure !!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dllUaW93RRAB",
            "text": "Unfortunately this was a major disappointment. Our first experience involved extremely long wait times for service, eye rolling, and cold food. We’d only ordered appetizers and got cold food, and asked for it to be warmed or just taken off the check. They were not busy, and truth be told we’ve both worked in service industry for years, and this was just not a good experience overall. We had high hopes and won’t be coming back. Oh, also random people on the street come up to you trying to sell things like bags and hats. The drinks were ok, BUT we ONLY came because their Instagram says it was happy hour for margaritas today and the waiter said they weren’t doing that anymore…so the one thing we came for we didn’t get. Anyway, don’t recommend—additionally, staff wore masks around their chins NOT faces. Kind of defeats the purpose guys. Lol…eye roll.\nI even had to dispute with the waiter about them wanting to charge us for the frozen app. Lol WHAT?? Friday night bummer!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURla3JQdTdRRRAB",
            "text": "Had steak & shrimp combo platter, mofongo, and drinks. Drinks are strong and good value. Mofongo was good but steak & shrimp was lacking flavor. Worst of all, we got food poisoning after dinner. Will not have food here again :("
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLThLckJBEAE",
            "text": "The food is fantastic i order very frequently from Havana and even went with the family it was 9 of us very late at night and the staff treated us amazingly despite it was almost closing time. It was great at easy good food, have great drinks, we took our time, the bill was very economical for all 9 us... we love it. So thank you Havana Heights\nAfter that i have order deliveries few times and my kids love it"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLOEtpTHlnRRAB",
            "text": "Great and speedy service!!! Ladies and the gentleman were very kind and helpful!! Ordered quick bites some empanadas and chinola juice // passion fruit!!\n\nMercedes was a great waitress thank you so much!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNha3RuYUp3EAE",
            "text": "Being of Cuban decent and from south Florida you long for some good Cuban food from time to time and I just found my spot. I had the tour of Havana which is enough food for several people. The ropa vieja was almost as good as grandmas and the lechón was on point. Will be back next time I need my Cuban food fix."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMybWZidk9nEAE",
            "text": "Came here before attending a concert at United Palace. The food was exceptional, drinks strong and the service delightful. One of my sides was not available so the waitress offered to let us sample what was available before substituting. Will definitely be coming back."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4dXNmaFdnEAE",
            "text": "Great service and delicious food! They have a combo #1 that you can order which is way better than Malecon’s combo. The combo consists of a whole chicken with rice, beans, and 1-liter soda the portions are large for a family of 4. I ordered side dishes tostones and sweet plantains.\n\nUPDATE! This place is not the same I have had bad experiences after ordering for a while.\n\n1) I ordered a portion of red beans and the only thing I got was more water and not beans at all.\n\n2) I decided to give it another chance and after I ordered I discovered they charge me twice and it took more than 2 weeks to get my money back.\n\n3) Last chance I ordered a combo #1 and I found a rock inside the chicken and I almost broke my tooth. This place is getting worse and worse!\n\nI DON'T RECOMMEND this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNkxDNVRnEAE",
            "text": "If you want to get good Spanish food this is the place. The moro with guandules and roast pork is delicious. Great atmosphere and staff"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzaDR5ejFnRRAB",
            "text": "Awesome new spot in the neighborhood! Like any new restaurant, they’re polishing the details, but I’m confident this will be a go-to spot for many years to come! The steak was delicious and Gabriel was happy to make sure we were happy and everything was right. Getting good service in NYC can be tough, so I’m happy to see such a welcoming staff right down the road.\n\nAlso, if you’re here during the day, be sure to say hello to Fidel in the attached flower shop."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbU02TmVBEAE",
            "text": "The wait for takeout is absolutely atrocious for 3pm on a Sunday. It wasn't even crowded indoors. While we were on the take out line, 3 people who arrived after us had their orders taken and recieved their orders first. We waited 50 minutes…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNm9XbmZnEAE",
            "text": "In town for work. Made a stop for lunch later in the day. Great location and great Cuban food. The Cubano was perfect. The plantains were amazing. @food_from_the_usa"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzN05yV3NRRRAB",
            "text": "La comida es muy buena ; disculpen las fotos porque se tomo después que habíamos empezado a comer 😁hay muy buenas atenciones y es un lugar agradable 👍🏼…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeThmZURBEAE",
            "text": "Nah.  Heard good things, totally not our experience.  I should have read these reviews before coming. “Hit and Miss” is correct.  Tonight was a big swing and a miss.  Pernil: under seasoned and dry.  Ropa vieja: flavor was ok, but it was tough (undercooked) and it looked like shredding the meat was an after thought. Beans: forgot the seasoning and the salt.  According to my daughter, “the white rice has more seasoning than the beans”.  Yup, she’s right.  On the side that was passable was the mojito, the guac, the chicharrones de pollo, and the maduros (hard to mess those up).  The tostones were “ok”.  The service?  I felt like our mere presence bothered her.  Eeesh.  “Una cara bien pes’a”. As a human being, I just hope she’s ok.  We stayed pretty thirsty too until she brought us a pitcher of water.  The food came after waiting an hour for it.  Bonus 1/2 point: the wooden serving dish for my Taste of Havana combo was cute."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbDZhT0hBEAE",
            "text": "Very nice place, big well decorated, price are ok, food from 1 to 10 is an 8, can improve in a few things like salads presentations, side orders, sauce options with dishes, etc, waitress girls ok but guys meant, drinks absolutely thumbs…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbk5idHFnRRAB",
            "text": "The food was amazing and the drinks as well, was a Monday night so wasn't crazy packed so the waitress was always around to check if we needed anything... definitely will be back when I'm in Ny"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2MzlPbzdnRRAB",
            "text": "One of my fav places to eat! Must try “morir soñando” and the “trapo viejo” are really tasty… amazing place"
        }
    ],
    "reviews_count": 80
}