{
    "name": "Bocaditos Bistro NYC",
    "place_id": "ChIJD6voiPfzwokR8Z2OcFVNnLU",
    "grid": "MN12",
    "address": "4863 Broadway, New York, NY 10034, USA",
    "rating": 4.1,
    "user_ratings_total": 738,
    "phone_number": "(646) 437-8363",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFdFFtb3dWMTlQVVdFMVNGbFJSM04xVVVaVVFVRRAB",
            "text": "Definitely my favorite spot in the whole city. It has everything, great food, great people and beautiful wall murals. We went for my birthday celebration and we were treated like royalty."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTGRYRk1UVTVYUmxFNWNsaEVZMGQwZGkxRFQxRRAB",
            "text": "Excellent and very attentive staff. Food was fantastic and drinks were amazing. Don’t miss this place. Ambiance was awesome. 🥰"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Q1dYTXhZVFZvY25salpWbzFkamRZVTFwR01GRRAB",
            "text": "The place was empty, and my food took a very long time I asked for my burger, medium, and it was burnt They were very unattended. We were sitting for about 20 minutes and then we had to ask for the check. They have never read the book unreasonable hospitality. The only good part about the whole restaurant was the aesthetic. It’s nice for the pictures. I’m only giving you five stars because I know that for every one star you need 40 good and I know you’re not getting 40 good reviews"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNFFXTnVSR0Y2VFhGRVVuRkxXVlJOVVZwUGVsRRAB",
            "text": "Un lugar súper acogedor para celebrar o compartir con familiares o amigos"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTk55MVVablZTTWpSalN6bG9jRFJhYlRBdFYyYxAB",
            "text": "Love this restaurant. they always bring good energy and their decor is amazing! It’s very down to earth and loving, like a dominican household. it’s almost like you’re visiting your dominican chef grandmother haha. great food and vibes and the best drinks"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UVIyRlFTSEpOUzNKMlZ6QklhazAzVUdKc09GRRAB",
            "text": "Stephanie was a great host. The attention was fabulous! Love the place! Beautiful place!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdmNYZG9NWEpRZVZsalEyMURRMGwwYVhsSU5tYxAB",
            "text": "Had a great time at Bocaditos Bistro NYC with a large group of 16+ during brunch. The owner reached out herself to our group and helped make sure everyone was taken care of. All the servers were quick and communicated well, and the food was fantastic. Considering we had such a large group it's nice to see a restaurant that can handle/accommodate that many people with ease. The decorations are beautiful and the music was excellent as well. Thanks Bocaditos for hosting us!\n\nCole & Priscilla"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUlJXcG1SbEJTV1RWb00xSTBNRXhuTkhKV2VWRRAB",
            "text": "I ordered the Ceasar salad with chicken and it was probably one of the best I've ever had. It was a giant plate. Place is clean. We were the only ones there since it was mid day during the week, and they only played maroon 5 the whole time lol. Which wasnt bad but it was just funny. I'd still come back for the food 😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGa1owTjBTV3hyTTNONFZrMVJkbUozVFc5aFpFRRAB",
            "text": "Went here once two years ago and had an amazing experience. Came for a wedding dinner for my sister and didn’t feel welcomed in this restaurant. The service was horrible. The event was understaffed and the food came cold. Very disappointed since we hosted this event here because of our last experience."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPYjBqdEhiaDhIaFhnEAE",
            "text": "I went here one time for brunch & absolutely loved the service & had no complaints. Second time around, I went for lunch & was disappointed. Place had a bit of a pee smell. Bathrooms don't have napkins to dry hands with, nor are their doors secure. Had to hold on to the stall until I was done to prevent someone from coming in.\n\nWaiters were decent and professional, but took quite long to get the food. Food was mid, not well seasoned & pricy!\n\nFor a restaurant that requires an 18% tip, I genuinely think that they can do better.\n\nUpon looking at other reviews, I see I'm not alone in the feeling. Pay attention to those.\n\nNot sure what happened. Please do better!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKalM2X0NNdjZyaTJBRRAB",
            "text": "Un mal servicio y hicimos una reservacion por un precio y al final de irnos cobraron 700 dolares extra y hasta un plato desechables negaron que no tenían muy mal servicio"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMM01wWnJuMUxHbEpnEAE",
            "text": "Me gustó"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOLXM4TlRoOUpEVDVBRRAB",
            "text": "Hice mi ceremonia de boda en este restaurante y fue todo excelente desde la decoración que me la hizo Stephanny y la comida está deliciosa."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMeUNpTGFPNi1LVVhBEAE",
            "text": "This restaurant will meet all expectations and then some. We ordered the octopus, the New York Strip (which was massive!), and the penne lobster. The restauranted gifted us the eggplant croquettes which were a surprise and incredibly delicious. The service was attentive, and the ambience relaxed. A lovely oasis a fewsteps away from the Dyckman."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKYVE5Znpub09IY3hBRRAB",
            "text": "While I've been coming to this establishment for years, it seems to have lost its touch, especially around ordering food. Food took forever to come and at that point, the drink that I ordered filled me up more which was very disappointing.\nAfter getting the bill, I had to inform my waiter not once, but 3 TIMES to take note of the mistakes on my bill. While I know it's not their fault, there needs to be a better way to run this restaurant. Prices are outrageous too for the portions they give.\nUsed to be my go-to but from now on, it's just gonna be an anomaly on the street for me. Atmosphere is what sells this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPYlkxSjN0aWJyV1dnEAE",
            "text": "Decent atmosphere, but it seems like it’s all they care about. We had to remind waiters to take our orders over 3 times, and waited 2 over hours to receive our food. Food came cold, stale and had to wait about 20 minutes for meals to come in between serving. They tried to compensate with a free pitcher of mimosas but for the price and portions, there are better places in uptown for the same price. Do not come here quality is not worth it. If I could give zero stars I would."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNU1p0UHlvMV9lTVZREAE",
            "text": "We celebrated our baby shower there, and from the very beginning, Susana made sure we felt welcome. She helped us with everything! The food was delicious, and our guests had a wonderful time at Bocaditos. Thank you, Susana, for your amazing attention and care, we’ll definitely keep coming back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdWNQc3B3RRAB",
            "text": "I recently came here on Sunday 5/4/25 . The experience was terrible. The food was nasty . And an awful  service  . I had to wait mad long to get seated . They were only focusing on the events that were happening instead of the customers. On top me and my partner had to pay for a food we didn’t even eat . Mind you I had to ask twice to change the food . It’s not my fault the food is bad here . That’s says a lot about the food if me and my partner have to ask twice to change the food ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdnJlMDVnRRAB",
            "text": "Attended an after communion brunch for 12pm. Establishment was unprepared, didn't serve not even water till 1:30pm, needless to say once food was ordered, no one started eating until 4pm. However, any patrons that walked in were seated and served right away. This was a reserved event way in advance and nit a walk in. And the portions of the food were so small that I had to order something else once we left after waiting 4hrs and served such a small portion. Do not book an event at this location. Seems they can only handle the usual walk in crowd."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeHFDM1R3EAE",
            "text": "overpriced, items labeled incorrectly"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeG9EWGNBEAE",
            "text": "food was slow coming out and items were labeled incorrectly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvam9qSWNREAE",
            "text": "Unfortunately the service and food does not measure up to the nostalgic whimsical ambiance. It took over 2 hours for our food to arrive and when it did, it was not restaurant quality. We arrived for a 2:00 Brunch and ended up having a 5PM dinner.\n\nThere was no communication from the waiter or owner about the wait time, or status of our food. Instead they were busy decorating the place. We often times had to remind our waiter to refill our waters, drinks, and to take our orders.\n\nFood is overpriced considering the long wait, bad service, and inadequate food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbV9Tb05REAE",
            "text": "Saw that NYC was holding an event and Mayor Adam's was there. How exciting.. My friend and I said hello and he so elegantly said hello back. Very polite.  Will forever love this place ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveTdDa3Z3RRAB",
            "text": "place was horrible, had gum all over the tables and under, took almost 2 hours and a half to get my food, always crowded, people having gewy stuff in our food and its just terrible, dont spend ur money here yall"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvODVuaW5nRRAB",
            "text": "I would avoid this place at all costs unless you have time to wait 3+ hours for food and drinks.\n\nIt’s exactly what the recent reviews say. Beautiful aesthetic, great for taking pictures, but the service is extremely slow. For no reason. The owner seems more interested in fixing her flower arrangements than attending to her actual business of serving customers. No awareness, no courtesy. Just all around a bad experience. They are ill equipped to handle large parties. Also make sure you bring a fan. The air in here is stale."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOUl1SGdnRRAB",
            "text": "Una sugerencia pero la frase que está debajo del nombre del local más bien parece Para una iglesia ustedes son un restaurante me parece como una falta de respeto a la religión esa frase hay otras más alucivas al tipo de negocio"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMU9XaFlBEAE",
            "text": "The waiters are so nice but the service was so slow. The happy hour service was so slow. People did not get their drinks in time. You had to keep asking for drinks. Food was not as hot and kind of bland. Overall was not worth the $65."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzLXAyeW5nRRAB",
            "text": "Te best place to share with the family and friends. 🥰 thank you guys for the excelent attention…"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bk1UdDR3RRAB",
            "text": "Excelente servicio! En lo personal a mi me encantó el lugar es muy agradable y acogedor, la música perfecta, puedes pasar un momento agradable. Dios bendiga! 🎉☺️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dE83SHhBRRAB",
            "text": "I love this place. The service was exceptional, thanks to Estefani. There was a birthday among us, so cake was brought to the table. That cake was delicious. Loved every unique detail of this place. I would come back in a heartbeat."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MU5HcE5REAE",
            "text": "My husband and I stopped for a drink and a few appetizers, and we waited 45 minutes for some insipid greasy calamari and three sad deep fried salmon tacos, with the tortilla also deep fried, kinda gross. My sangria had zero fruit in them, just some juice flavoring. It definitely wasn’t worth the $74 we spent!! Needless to say, we won’t be coming back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdWY3M1dREAE",
            "text": "I recently made a reservation for a group of 20 at this restaurant, but unfortunately, it wasn't honored upon arrival. Our brunch experience was marred by several issues:\n\n- Food arrived cold at the table.\n- Children's orders were incorrect (chicken tenders were replaced with wings without consultation).\n- Dessert options were unavailable, despite the restaurant being relatively empty.\n- Payment was required in cash, and when that wasn't possible, I was asked to use Zelle.\n\nWhile the restaurant's ambiance is great for photos, the service and overall experience fell short. Unfortunately, I wouldn't recommend it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRM1BTMlBnEAE",
            "text": "Such a cute spot for brunch, would definitely come back !"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneXAtWHh3RRAB",
            "text": "Eye pleasing and good for pictures but food is extremely salty and bad quality. Had their burger and it tasted burnt with a heavy salty flavor that overpowered the meat. Additionally, we waited 1 hour for a table and 1 hours and 40 for the food. Expected better!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVakt6REJ3EAE",
            "text": "Muy buena"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnb2V5UXZ3RRAB",
            "text": "Excelente lugar, ambiente, la comida muy rica muy atentos muy bello lugar tranquilo me gusto le doy 10 de 10 tenia mucho tiempo sin ir, y volver el Domingo y fue la misma atención"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnd2RHVDBRRRAB",
            "text": "I had a great time with my friends for lunch. The handmade coffee was great. The host was amazing"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bWN2ZVNnEAE",
            "text": "My first time at Bocaditos. The best experience ever. The girls and I had a wonderful Brunch!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfa1BxbVR3EAE",
            "text": "Reserved space for private party. Service was extremely slow, they checked on us every once in a blue moon. They listed the wrong food on the menu and certain servers had a bad attitude."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNHNDaFhBEAE",
            "text": "Este lugar es hermoso , pero lamentablemente la comida no sirve , al principio era bueno pero ahora mismo no lo recomiendo , llevé a una amiga a celebrar una actividad y nadie pudo comer , una comida extremadamente mala , sin sabor , la…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Zy1uMl9RRRAB",
            "text": "Wait time for the appetizer and entry is horrible."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQM3ZEckRREAE",
            "text": "Delicious brunch and coffee, everything beautifully presented, in a gorgeous and cozy space, served by very friendly and attentive staff - I will definitely be back and recommend to friends visiting the Cloisters"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdTQ3YTdnRRAB",
            "text": "Las atenciones como de costumbre 1A"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbExMMzhnRRAB",
            "text": "Magical!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIM2JPN3JBRRAB",
            "text": "Excellent service! Thank you to Angel Miguel for his wonderful attentions. The food and appetizers are delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dS1mUXVBRRAB",
            "text": "The food was ok, but they charge you a lot more for the drinks than what it is listed on the menu and they add a Credit card service fee plus the gratuity. Be prepared to pay a lot more than what you order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3d29QdjRnRRAB",
            "text": "Amazing food from brunch to dinner! I have been here several times with both family and friends, each time has been exceptional! From the deep fried appetizers to the bistro Burger, delicious. the Red Sangria is always my \"go to\" for a drink. Highly recommended for a party of any size!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bEtuTkJREAE",
            "text": "Event , July 27,2024\n\n\"Warning: Avoid hosting events at Bocaditos restaurant. My experience was a disaster from start to finish. I paid $1700  for a baby shower event in the main restaurant, but at the last minute, they moved us to the second floor, which was cruel considering my daughter, the guest of honor, was 8 months pregnant. The stairs were a significant challenge for her and our guests.\n\nWhen we arrived, the place was upside down due to a party of 60 people. Everything was dirty, smelled awful, and the floor was littered with trash and spills. To make matters worse, they only provided two servers for our group of 24 people, leading to poor service.\n\nThe food was also a letdown, with mashed potatoes and mac and cheese coming from a box. No one enjoyed their meal. When I complained, the owner offered a half-hearted attempt to make it up, but it was too little, too late. The final insult was when she refused to accommodate my schedule for a makeup event, claiming the offer only applied on weekdays.\n\nAs a former Dykman resident trying to support my community and a female-owned business, I'm extremely disappointed. The owner's lack of empathy and unwillingness to take responsibility has left a sour taste. Don't make the same mistake I did - avoid hosting events at Bocaditos.\""
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMmVUbFVREAE",
            "text": "Disappointing Experience\n\nI recently visited this place for the second time. My first visit was incredible, but unfortunately, yesterday's experience was far from it. It started with the lack of service at the front entrance—no one was there to greet us, so we waited and waited until I finally had to go to the back to find someone to seat us. We had reservations for brunch, but it was clear they were understaffed, especially with two large parties of 15+ people.\n\nAfter being seated, we asked for water, but our waiter was nowhere to be found for 20 minutes. When he finally checked on us, we requested water again, but another 40 minutes passed, and we still didn’t have any on the table.\n\nWhen I inquired about drink specials on the brunch menu, the waiter told us, “Ah, yes, anything you see on the menu is half off.” We confirmed this with him, and my wife also heard it. So, we quickly placed our drink orders since it was already 3 PM, and we had arrived at 2:15. Despite the beauty of the place and our enjoyment of the atmosphere, the service was lacking. The waiter returned and insisted we order all our meals and appetizers at once because the kitchen was slammed, which made us feel rushed.\n\nAt the end of the meal, we were shocked to find we had been charged full price for the drinks, despite being told they were half off. I had even mentioned to the waiter earlier that I wanted to place a third-round order before 4 PM, as the special was ending. He confirmed this by saying, “Yes, I’ll get you the round in a few minutes.” This communication led us to believe there was indeed a special; otherwise, why would we rush to order three rounds before four?\n\nWhen we questioned the charges, the waiter became combative and aggressive. I suggested there might have been a miscommunication, but he responded, “NO, that’s not what I said. Are you joking?” and laughed at us. We paid our bill but made it clear that he should be more explicit next time. Additionally, there was a happy hour menu posted outside on a Saturday that only applies from Monday through Friday. If that’s not misleading, I don’t know what is.\n\nHaving worked in restaurant industry for 25 years, I’ve never encountered such a combative and mocking attitude. There are always ways to mitigate situations and ensure the customer has a good experience, but that was not done here. We will never return. Do better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieXV2V0xREAE",
            "text": "Terrible customer service.... will never go again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoX3BYRmN3EAE",
            "text": "Amazing food paired up with amazing decor. This bustling Latin food joint located in upper Manhattan is a true gem. Plates like the delicious baby back ribs and the mouth watering lobster dish are to die for. Thank you chef for making some of the most incredibly tasteful dishes ever. Surprised that a place this good even exists near Dyckman. Not only are the plates prepared with artistry and great flavors but the atmosphere is excellent. You find yourself gazing all around at the art work on the walls of painted coffee kettles and flowers as well as the real flowery decorations on the ceilings and vases. Great scenery for photos. We came in for dinner, close to Valentine’s Day, so many red roses covered the chandelier, walls and windows. The decoration theme changes from season to season and holiday to holiday. Very impressed with everything, from the food, the drinks, the scenery, the service. Will be coming back for happy hour."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSckppczlRRRAB",
            "text": "The service was excellent. The food was delicious and fantastic 😍. The flavor was perfect and on point. The environment is great and the playlist was appropriate for the time. The drink was well done and my favorite dish was the pasta. The meat was also cooked at the perfection and the dessert that I highly recommend is the double coconut. Everything was impressive."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMExXdFhBEAE",
            "text": "Food was amazing and cooked to perfection! Service was beyond amazing. Very attentive, informative and polite. THE Almond & Goat cheese croquettes are worth every penny(sorry no pic-we were hungry lol) our son ordered the burger bistro and loved it! The fries were so crunchy and delish!! The ambiance is very relaxed and beautifully decorated. Perfect for a date night or an outing with friends for some wine and chit chat. A must!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcEtxcnhRRRAB",
            "text": "Two stars for the decoration and our waiter service. The drinks are totally not worthy we ordered 5 different drinks to give them another chance and ended up drinking beer. Serrano croquettes are okay. Salmon Platter was bad, salmon was overcooked and with no flavor at all and the rice that it came with was wet with what seemed coconut milk. Burrata empanadas are too chewy they should definitely put on the menu that they're made out of corn dough not regular empanada dough. We had to wait a long time for everything to come out, even the drinks and to top off my time here the restroom was DISGUSTING, very dirty and no toilet paper, no hand soap, no paper towels. We came here on a Sunday that is very busy the restaurant was full. They should really pay attention to this things. Came here from NJ with high expectations from what I've seen on Instagram but came out with nothing... too bad cuz the place is actually really nice."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZa0syX3VnRRAB",
            "text": "Went to this place for Brunch with my friends and I absolutely loved  it. The decor is beautiful  it looks like a antique restaurant with the decorations and floral wall paper. The food comes in large portions but  it is absolutely amazing…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOXRybWd3RRAB",
            "text": "The food was Amazing. The ambiance was excellent and the drinks were really good and excellent service. We had the Octopus Ceviche and the octopus was really fresh and the citrus balanced well with the plate. The Tuna Tostones, you can really taste the Hawaiian or Poke ingredients and after that you can taste the crunchiness of the tostones. The Steak risotto, risotto was not over cooked and it had a really great balance with the steak. The Carbonara Fettuccine with lobster was amazing. The Fettucine was al dente as  pasta in my opinion should be served, the lobster was really rich and satisfying. Dessert, we had the Tres leches and it was really good. Drinks. La Chismosa cocktail and the Lychee Martini were excellent. The restaurant has an upper level and a lounge area in the back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaUpHaHFBRRAB",
            "text": "Amazing service, food, and decor! Went for brunch today, and we will 100% be back with family and friends. We got the salmon benedict and the Dominican benedict, and both were delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleC1LSkZBEAE",
            "text": "Cozy and colorful spot. We were able to sit immediately at the tail end of Saturday brunch. The Bocaditos salad and Mama’s breakfast were both delicious and decently sized. The acoustics aren’t great and it was pretty loud with a rambunctious birthday party happening inside. We’d come back but maybe not when it’s too busy."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtel82aHhnRRAB",
            "text": "El lugar es muy acogedor, tiene hermosa decoración con unos detalles muy interesantes para tomarse fotos. La comida es muy buena, me encantó el cous cous con hongo y parmesano que viene de acompañamiento con el plato del filet mignon, la…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZaXFYa0l3EAE",
            "text": "We went for BRUNCH. It was an awesome time. We made a reservation for a party of 15 and they were able to accommodate us. We had their appetizer ceviche, entre of steak and eggs, and their dessert red velvet cake. Everything tasted good. We…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NGJUZmlBRRAB",
            "text": "Party of three without reservation, seated within 5 minutes. The decor feels like a little girls tea house, truly in love and would  defenately go back. We ordered the steak and eggs and eggs benedict, dessert and the coffee were all very tasty. The service was good too.\n\nOnly complaint was the size of the appetizers, too small for the price."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydlk3WVhnEAE",
            "text": "This place is beautiful and unique. Depending on what time of day can be busy or very casual and quaint. My all time favorite dessert is the matcha crème brûlée.. Their tapas are everything anything from Bacon wrapped dates, Clams, Fried Brie Bites, Short Rib Empanada"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNveE0tVnVBRRAB",
            "text": "Excellent food, the atmosphere, decore was fantastic. Loved the Thai lettuce wrap. Drinks were affordable and awesome as well. For dessert try the passion fruit lava cake. You won't regret it. The neighborhood is ok just stay west don't go east. If you find yourself east please be careful of drug dealers and dominican gangs."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNU8zX1JnEAE",
            "text": "Was well greeted and attended very propmtly, the decor and setting felt like home. Alexander was very polite and attentive. The food was to die for, the appetizer Serano Ham Croquettes was very very good, tender and flavorful with a crunchy savory crust.\n\nFor our brunch dishes I had the huevos roto, and let me just say WOW, this dish blew me away, the eggs were cooked to perfection, and the fries were very crunchy on the outside with a tender inside along with the crispy chorizo bits, and the spicy mayo and parmesan drizzled all on top this dish. I would highley recommend.\n\nThe last dish was Mama's Mangu with tres golpe s friend cheese, eggs, and salami, all ingredients were cooked to perfection and complimented each other in their own ways the Mango was made with guineito (green bananas) very moist and smooth with great taste topped with pickled sauteed onions.\n\nThis place has been on our radar for the past 2 years, and we finally made it and we were not disappointed. I would always stop by whenever I'm in NYC. Thanks to the entire staff for giving us such a great dining  experience from start to finish, and compliments to the Chef for creating such beautiful, and tasty dishes."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdG9QUUxnEAE",
            "text": "Food was really good (a little bit overcooked for us) and tasty. Service is friendly and the decoration is colorful and inviting. I will definitely go again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMnJHdDZBRRAB",
            "text": "Wow, Wow, Wow! An oasis in the middle of Inwood desert!\nCrazy colorful design, each and every element has a meaning and Serving of each dish is unique and extremely beautiful that you mush take a photo of each. And now let's talk taste... One big Wow! We came here twice and tried both brunch on weekends onky and regular Lunch menu with some appetizers.. magnificent!\nReminds of Lorenzo Kakalamba in Belgrade Serbia.\nCome feast your eyes and senses ;) you will thank me later"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OTZtMG1nRRAB",
            "text": "I came here with 2 of my friends for dinner and the appetizers, drinks and entrée were amazing. For drinks we had “la chismosa” which i definitely recommend. And for my entree i had the Salmon. I loved how they cooked it and had some crunchy parts. One of the best salmon i had in a while."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyckwtVUVREAE",
            "text": "Very cute and cozy spot to have your meal in Inwood. Eggplant croquettes were good. We stopped for a quick bite during our Great Saunter walk on a rainy May day!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eHBtZlVREAE",
            "text": "The atmosphere was top notch, and the salad I had was unusually delicious--noticeably fresh ingredients, and I don't usually notice that sort of thing. Although it did mysteriously come with bacon was not listed on the menu, which presented a problem to me as a vegetarian, though it was swiftly replaced, so no harm. The tea service was also very nice.\n\nHowever the service was not so much bad as completely absent. Everyone was extremely friendly and pleasant and accommodating but I had the distinct impression that we had wandered into a place that was not actually a restaurant, and everyone at this completely different business was too polite to tell us, and so instead desperately scrambled to put together a restaurant experience while actually being a wedding venue or a nail salon or something.  People--perhaps waiters, but who can say--kept bringing plates and silverware and then taking them away at unpredictable junctures. The menu was inaccurate and I made 3 different attempts to order something off of it before I succeeded. Overall baffling experience, but I couldn't bring myself to get upset because everyone seemed so nice.\n\nI can't really recommend this place in good conscience, but I'll probably come back for brunch next time I'm in the area"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycnJmaEN3EAE",
            "text": "Nice floral ambiance. Includes two levels for dinning. Service was quick and very accommodating. Food was really good. Would definitely recommend."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwaThfRXpBRRAB",
            "text": "From the minute u find the location, you are impressed! It's in the middle of the block but is covered in the most beautiful flowers and had a garden patch in front. Once you enter, it's the coziness place ever. It's pastel pink walls and chandeliers are simply awesome. There are pictures on the walls with inspirational quotes and the place smells delicious with the pot of cinnamon n apples simmering in the corner. The staff was friendly, attentive and accommodating. The menu is not very large but there's something for everyone. We ordered appetizers which were delicious so we knew dinner would be a treat. The presentation alone makes ur mouth water. I would definitely return. Seems like a great place for a girls Sunday brunch."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZbU5ic3h3RRAB",
            "text": "Amazing food and staff!\nI went to this beautiful little place this past weekend with my girlfriends as a dinner to celebrate my big move to FL and there was absolutely not one…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSazRYQ2d3RRAB",
            "text": "Wow!!! The service here was absolutely amazing, from the first day I connected with Stephanny to help me organize my event it was the most seamless and accommodating experience. Not once did I feel stressed out about this event when working with Stephanny. She explained everything very well and was always, always and I mean always available to answer any questions I had. (Even while on vacation 🙈)\n\nOn the day of the event everything went as planned. The food and atmosphere are perfect! I mean the Red Snapper Frito is 10/10. The Chicken Ropa vieja Empanadas and the Patatas Bravas were some of my favs. The drinks were so delicious.\n\nI loved hosting my event here and can’t wait to go back!\n\nThank you so much Stephanny and Louris for making this very special day perfect! ⭐️"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNk5tWmtBRRAB",
            "text": "The place is cute and very cozy, but prices are high. Food is tasty but needs to get quicker to the table. Food is served in a gourmet like style but bigger portions. Coffee is served beautifully 5 stars for that little detail. Other than that, the place is good and pleasant to be in. Will not choose to go back for the simple reason of the high prices."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvaHFMOW1RRRAB",
            "text": "Decorations and ambiance are cozy and gorgeous. We had pinot noir. Thought I preferred them to bring the bottle to us, introduced the bottle, then pour. Instead of pouring the wines at the bar and brought the glasses to us. I was able to…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNHNYR25nRRAB",
            "text": "This place is absolutely gorgeous. We loved everything from drinks to the appetizers to the full course meals. Their meals vary from seafood to comfort food. Our waiter Angel was so great everyone was extremely friendly. Place is definitely insta worthy and it’s delicious. 10/10"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwLWFxN2tRRRAB",
            "text": "Had a great experience. The waiting area is great for larger groups. We made a reservation for a party of 9 the day before and they had no problem. We even added one more person at the last minute and they still accommodated us. Each meal was carefully crafted and we didn't mind the longer than usual wait. Each meal was delicious.\nEven with our large group we weren't rushed out of the restaurant. They helped us take many photos!\nThe decor also adds to the nice atmosphere and our server had great customer service."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0eWJyRENBEAE",
            "text": "I was starving after spending a whole morning walking around the Cloisters. I looked around for a bit but nothing was really standing out…till I saw this super cute yellow place filled with flowers. What a find! Its an elegant (and super cute) place right on the border of Inwood and Washington Heights\n\nFood was amazing and staff was super friendly (thanks Susana!) and knowledgeable. Service is a bit slow but hey, was Saturday! I had the Mexican Benedicts and was really delicious! Hoping to come back with some friends and try their dinner menu\n\nOverall, I would say Bocaditos is definitely a hidden gem in Inwood, tucked away on Broadway with a very unassuming exterior."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabzZLTnJRRRAB",
            "text": "Great vibe, amazing food, yummy drinks, and fabulous service. Had great brunch with my niece and her husband."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdGVMam5nRRAB",
            "text": "Experience was awesome,  a bit pricey,  food was absolutely wonderful,  couldn't drink any of the drinks because they had champagne in them , they don't serve hard liquor which is fine,  server Giselle was awesome, decorations were beautiful loved it ! Live music was beautiful loved it . It's a nice date night place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdWZxZ0pREAE",
            "text": "Wonderful food, beautiful restaurant with an amazing feel. It's like stepping into another world when you visit. Definitely recommend 5/5"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBN3NiY1B3EAE",
            "text": "Lovely place. Specially for lunch when is not busy ;) Good food, fresh & taste, good price, nice service. Didn’t have any dessert but next time I will try."
        }
    ],
    "reviews_count": 82
}