{
    "name": "Saggio",
    "place_id": "ChIJEc6ZPKH2wokRZyyIzHgixT4",
    "grid": "MN12",
    "address": "827 W 181st St, New York, NY 10033, USA",
    "rating": 4.4,
    "user_ratings_total": 755,
    "phone_number": "(212) 795-3080",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taa2VYYzJiREp6TW1aMGRXeEhUVkkzY2sxWk5sRRAB",
            "text": "I know this restaurant is well regarded by other people in the area, but every time I have been the pasta has tasted like something went off. Others I have dined with have said the same thing. I must have given it about half a dozen chances over the years, because it's a pillar of the neighborhood otherwise, but I really don't know what's wrong."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwU05UUlBhV05VWkZsdk5sQlZUelJmYlhOMlNsRRAB",
            "text": "I always look forward to visiting Saggio whenever I'm up in Washington Heights."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adFQzaGtja05XYm14U1ltWkJkSFJFVjNKWE9VRRAB",
            "text": "Saggio is a far and away a main staple of the neighborhood and has been for years. I've been here many times and have never left unsatisfied.\n\nIs it the best Italian you've ever had, especially in a city like New York? Probably not. But they're insanely consistent and the service is warm and friendly--especially their bar staff. They have a lot of employees that have been there for years and very much care for the clientele they serve and they make an effort to actually remember you.\n\nI'm a fan of their frequent rotating dinner specials that change from season-to-season. They rarely miss. I've also never had something off of their main menu that I've ever disliked, and I love to try new things, so it's nice to have a wide spread to let you adventure out, but you can always find the regular go-tos as well.\n\nIt's a relief to have somewhere that you can trust like them in Hudson Heights.\n\nThe wife and I are a big fan of their bottomless brunch on the weekends. Their back patio is a gorgeous little cozy nook in the middle of the city that blocks out all of the noise from the busy street in front of it.\n\nSince they changed out the old tables to booths, the ambiance has felt very cozy. Vibes are on-point.\n\nIf you come back frequently, you'll see a lot of regulars at the bar during happy hour, and people aren't afraid to engage in conversation, which is abnormal (and welcome) in recent times. I've randomly met some pretty cool people."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tob1pVaENVVmxFVkVNeWRFNTZTeTF2YTBsZldrRRAB",
            "text": "Very good Italian specialties in Washington Heights"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMlpGRkZablUwWjNoUFJGQTBWbkJoVWs1UlpHYxAB",
            "text": "Found this restaurant after searching on Google for a location convenient for our visit to the Met Cloisters. Food was great even for our friend who was visiting from abroad, and for my husband who’s normally very picky with Italian food. Quite a few vegetarian options for yours truly. However, what impressed me the most was the quality of service—place was packed, especially with a large group of elderly women on a reunion (seemed like) but we were still looked after well. Despite being a bit cramped, the servers squeezed in and out with everything we needed. They were very patient and attentive. The only 2 reasons why I’m removing one star here is because of the limited space, and because their single restroom has a long waiting line outside it. Also pretty reasonably priced. Overall, I highly recommend this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUVIyVllZVXBMWjJVdFlUTkJhVFJuZDJwWk1sRRAB",
            "text": "Delicious cocktails and super kind service. Came here once before and my pasta was good. The salmon my husband got was delicious but my cacio e pepe (a special) was disappointing, bland with not enough pepper.  Will return, but maybe ask for server recommendations."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVlVrNUlTMGROTUhsT00zVnFVakpRVDA1c01WRRAB",
            "text": "The food is amazing and the atmosphere is quaint…. Not to mention - the service was about our satisfaction!!  It’s a favorite of ours!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNU0wTXRaRFp3UTJGWE1pMDVkV0ZrYmpsYVdHYxAB",
            "text": "My first 5/5! I truly enjoyed my meal here. The service was good but the star of the show was the atmosphere and of course the food. would come again anytime i’m back in NY."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTk5FcG5TMDFTZVhsMFNUWlZRVFptVlhCUE9HYxAB",
            "text": "I went with my husband, we reserved at the patio and had a nice time there, good food, excellent and quick service. 100% recommended."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbFVETXhhVWRSYldnM01YVllhVWxPY3psQ1RWRRAB",
            "text": "Great place for brunch."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205ek9FNWZkMVZ1UlVsUFQwbDZSMUpOUTFsaVpFRRAB",
            "text": "After a long, hot summer’s day, Saggio’s was the perfect place to turn to for delicious food, well-crafted cocktails, and thoughtful service.\n\nIf you’re traveling from the Met Cloisters, or looking for a homemade, cozy spot in the area, I highly recommend this establishment. It’s quite rare to experience good food, drinks, and service in one place, so I was blown away by the handmade pasta, both the Papperdelle Lamb Ragu and the Black Kale and Mushroom Ravioli (Ravioli of the day) in tandem with absolutely incredible service.\nOur drinks were refreshing and reasonably priced, and the food was hot when served and tasted absolutely incredible. It has been a while since I’ve felt so fulfilled after a meal out.\n\nOur host was incredibly thoughtful of our seating outdoors, and made sure we had a nice place in the shade to enjoy our meal. Plates were bussed expeditiously, and when the sky looked a bit dusty, there was someone near to draw the cover on the outdoor seating before rain hit. But the star of the show was truly our server Logan, who was somehow able to predict our every need before we knew them, and was impressively graceful as he gave advice on the menu and managed all his tables. My experience at Saggio’s was shining, and we will definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUmIxTlBkamxFUjJGek5HZHdhMGRmUkU5WlIwRRAB",
            "text": "Nice atmosphere, great service, and *immaculate* food. The goat cheese crostini was nearly a religious experience. I'll be back here for sure."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQzR3S3FWNDQtUUh3EAE",
            "text": "An absolute delight.  We were in the neighborhood for a house concert, and since my wife and I have been to Sicily and loved it, there was no question.  We shared a delightful kale Caesar salad with a light yet peppery and flavorful dressing and tasty croutons (light-years away from the formulaic chinks of romaine most places offer) with great cheese pieces.  My wife had the gluten-free penne with pesto (including potato and green beans!) and I had the skirt steak -- perfectly done, not grainy, and with another delicious salad (arugula) and more cheese.  And a side order of perfectly cooked tender-crisp broccoli.  We didn't have room for dessert but every thing on our plates was both earthy and delicate, full of flavor and color.  A special Hooray for our waitperson RAQUEL who was thoughtful, genuinely friendly, and efficient.  We want to return!\n\nAs an afterthought: there's a blackboard in the main dining room that reads LOVE - LOYALTY - COMMUNITY.  Lest you think that is mere advertising, Saggio engenders such a friendly warm atmosphere that when someone at another table celebrated a birthday and their friends began to sing, the whole restaurant joined in and applauded.\n\nLike dining with your family if they were excellent cooks AND well-adjusted too.  A gem."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKdmU2Sjd1b3ByZUlREAE",
            "text": "The service was very good, the drinks and food also."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbmNnc1dSMDQ2VVF3EAE",
            "text": "Love this place. Food and Vibe are perfect."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHBYanNBRRAB",
            "text": "This restaurant is a hidden gem. It is the perfect ambience for a date, but also for a chill hang out with a group of friends. The waiters were professional and it was a very quick service. I had the penne pomodoro pasta, which I highly recommend. It was very flavorful and delicious. I also had tiramisu for dessert, which is the best tiramissu I have ever had. The prices are also very affordable for such a beautiful place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJanA2dU1nEAE",
            "text": "I've been ordering delivery and dining in on occasion for a decade now.\nThis particular evening my chow now /seamless apps was glitching, so I decided to call. The woman on the phone was very patient with me and my order arrived quicker than usual, and they gave me my olives olive oil extra bread with no charge Thank you so much!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRenVmUTNBRRAB",
            "text": "Great brunch!  Service was amazing, had a slight issue and they remedied immediately.  The ragout dish gets a big recommendation."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMk51di13RRAB",
            "text": "Large portions and delicious pasta at this cozy neighborhood spot"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPLUlLNi1BRRAB",
            "text": "I love this place. Food is great and the service is always friendly and on point.."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBa2ZISDZBRRAB",
            "text": "Great restaurant. Consistently good. Love the vibe of this neighborhood place."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc1pmVzdnRRAB",
            "text": "The only reason this post doesn’t have 1 start is call ANTONIO. Today I was having an AMAZING day and I decided to ended up on my favorite restaurant despite I really wanted to go home early. When I arrive the host denied me a table even when I saw a few tables available with the excuse she had reservations. She told me I may have to wait close to 30 minutes for my table (even when more than 2 tables were open the whole time) I said ok and wait right in front of her face for a spot and told her I want the table cause I did not know if a friend was coming (I wanted the table anyways I said) She let me standing there for 25 minutes ignoring me completely and my mood went completely down, besides, and on the top of the cherry She talk to me after those 25 minutes only for ask me if “I wanted to eat or a table” I found this very disrespectful and rude and even though she was Racist cause I’ve being in this restaurant plenty times with my gringo friends and everything was delightful. After that she told me SORRY i did not PUT YPUR NAME ON THE LIST? What list??? She gave a sit to every single person after me and now one else was waiting there or rejected. On top of that the waitress for my table never came to my table to even bring me BREAD (I was starving for already 35 minutes) and was when ANTONIO helped me and treat me Like a NORMAL PERSON and BEYOND EXPECTATIONS!\n\nThe food amazing like always!\n\nPlease give more credits and Value to the people who really deserved in this place! My experience started AWFUL and ended up very Good thanks to Antonio! We need more people like him! Raising my ONE START OF SERVICE TO 4 only for this person."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdGIzSmdBRRAB",
            "text": "This place used to be excellent, but tonight our food was clearly old and microwaved, cold in spots and hot in others. We had to send an entree back when it was stone cold and our waiter hid from us the rest of the meal. For nearly $100 for a dinner for 2 it’s just not worth it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmN01XOTBnRRAB",
            "text": "Great homestyle Italian. Great!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cmREd1hnEAE",
            "text": "The staff and the food were amazing.  Great experience not to be missed."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2enNYaFpBEAE",
            "text": "Gnocchi is absolutely unbelievable! For years, Saggios has consistently been my favorite Italian food in New York City. Great service, wonderful people and even better tiramisu 😋😉 ALSO, can we talk about their bread????? Sooooo good!!!!!!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrdTdiaURBEAE",
            "text": "Excellent local Italian fare. Great vibe. Everything is good here. Recommended"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbHA3VGlBRRAB",
            "text": "Visiting NYC again and second time here.  We love it! Great food and service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYZzdEU0hREAE",
            "text": "The food and the staff was amazing. The food came out pretty quickly and everything was absolutely amazing. Delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaWVERkxBEAE",
            "text": "I recently visited Saggio, a Sicilian restaurant, and found the experience mixed.\n\nThe interior was inviting, with a warm and cozy atmosphere that made for a pleasant dining environment.\n\nAs for the food, the fried calamari was decent—crispy and tender, but it lacked the standout flavor I was hoping for. The chicken was okay as well; it was well-cooked but didn't have the depth of seasoning I expected.\n\nOverall, while Saggio has a nice ambiance, the food could use some improvement to truly shine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucGNIeXJRRRAB",
            "text": "My first time after planing on going finally did it and I will definitely come back. The food was delicious the service was grate."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuelAzbE9BEAE",
            "text": "Cute place. Food was meh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMExUR1pBEAE",
            "text": "Local favorite of mine. Perfect for a date night, or bringing the family. I've only ever had their pasta, but it's delicious. Very friendly staff. Love!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIejdyRUxREAE",
            "text": "Can’t decide what was worse, the food or the service. Been here plenty of times over the years but the last visit fell way below expectations or general dining standards. Food was either bland, under-seasoned, incorrectly seasoned or all the above. Service was hugely lacking. Not sure what happened since we were last here but have no desire to come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcUxHVVhnEAE",
            "text": "Order the bucatini cacio e pepe and it was cold n unseasoned. We also ordered the skirt steak which arrived super undercooked a side dish of fries that was ordered that never even made it to the table. Plus it took me 20 mins to get the attention of the server to get a coke which arrived flat. Staff seemed over worked even though the restaurant wasn’t pack. Been here a couple times but tonight will be my last especially at 25 dollars a dish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ZzVmT2l3RRAB",
            "text": "this is the place that i always take people when they come and visit. the food is wonderful and well portioned (special shout out to restaurant week, as i don't remember the last time i saw full portions at one), the drinks are legitimately…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibjg3TXhBRRAB",
            "text": "My favorite restaurant!! It never dissapoints, the service is great and the food is delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNieDhLTEN3EAE",
            "text": "Needed a fairly quick meal and only ordered the S&M special (spaghetti & meatballs, that is) and a glass of wine.  Very good and enough of it to take some home.  The service was just right, and the server, especially, was very sweet.  The dining room is a bit sad, especially in contrast to the patio, which is lovely.  I hope that at some point, they can do a quick reno and brighten it up."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNl9xRHRnRRAB",
            "text": "A classic cozy local place with great food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyZzgtWFB3EAE",
            "text": "very good restaurant. no other place with italian of this quality close by.or north of 145 on yhe west side that I know of."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeTlQakJREAE",
            "text": "I was out with my family when we came in out of nowhere. With no reservation, we entered to be welcomed by a great ambience and aroma. The service was exceptional and my black pasta was amazing. My family greatly enjoyed their meal too. Everything was fresh and I couldn’t be happier. The Ricotta Cheesecake for dessert was very nice and unique, not too sweet but of great flavor. I will for sure be back in the future!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMX2E3dkJBEAE",
            "text": "Excellent food, excellent service, and great ambiance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNmMzY3VRRRAB",
            "text": "Number 1, this is NOT real Italian food. NUMBER 2, their service is such trash this place deserves negative stars… I came in with a large table at 9:10. The rude hostess who has no clue about hospitality very rudely is hesitant to seat us and continued to tell us they close at 10… that is plenty of time for us to order and eat. As the restaurant was full with people just beginning their meals. Our server finally came to the table and had zero interest in being friendly or accommodating. He was sweating and rushed and spilling things left and right. We placed a large order and our food all came out at the same time not even coursed or spread out. Our main dish came before our appetizer even did. I had to remind them twice we ordered calamari and salads.. our main meal was sitting there while we waited for our appetizers… the food was DECENT not bad not good. But our server RUINED ANY chance of giving this place a good review. Mind you we spend over 200$ and tipped over 30% even after this horrible experience. When the waiter brought the check to the table he “pretended” to fall and slammed into a gentleman at our table hurting his shoulder. The server seemed like he was on something.. I’ve dined all over NYC and this is on the top of my list of worst service in the entire city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNmVpczR3RRAB",
            "text": "Walked by this restaurant so many times, easily missed. When you walk in, one is taken aback by how beautiful the place is. It feels as if you've gone back in time. Sorry i don't have pictures of the food but we savored every delicious morsel, perfectly cooked. We had the sautéed calamari, spaghetti al limone with skirt steak and tagliati. And, they bring delicious Italian bread with olive oil and  olives. Will definitely be returning to try their other dishes. Service was great. The young lady serving us was very knowledgeable of the menu and attentive. Kept coming back to make sure we didn't need anything else. Don't miss out on this gem! You'll regret not coming sooner, like we did."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMZ29qSmp3RRAB",
            "text": "Low key one of the best Italian restaurants in the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNkxIc2dBRRAB",
            "text": "In my opinion it’s the best Italian restaurant in all Upper West Manhattan. We went to this place to try a different meal in those days that you are bored about the same food , and we love it. The best part is that it isn’t expensive as other Italian restaurants. I personally recommend the lasagna! It’s amazing."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbDZ5LUh3EAE",
            "text": "Interior is very dark and cramped but food and service is great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNWZMOFpnEAE",
            "text": "I LOVE SAGGIOS! I have been in this neighborhood for eleven years and SAGGIOS STAYS CONSISTENTLY WONDERFUL! Delicious Italian food with a welcoming and courteous staff. I have enjoyed lunch, dinner, and brunch here; all equally delicious! Go to their bottomless brunch, it’s a great deal! Also, a big fan of their spinach lasagna!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqN0ozUWNBEAE",
            "text": "Atmosphere is beautiful and the food was delicious. I have texture issues with mushrooms and seafood, so I'm always thrilled when I find a risotto without them. Everything we ate here was lovely, one of our favorite restaurants in Washington Heights."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMUxuYVR3EAE",
            "text": "Love the food and the ambience."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVcnVDMURnEAE",
            "text": "가성비 좋고 음식 괜찮아요 장소는 조금 협소 합니다."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWNmZHdlBBEAE",
            "text": "Had a wonderful dinner last night for my moms birthday. The food was delicious as always,  the service was awesome, they’re very welcoming here and the prices are very reasonable. We had the Ceasar salad and mussels to start off. For our entrees my mom had the skirt steak with arugula and I had the squid ink pasta with calamari. To top it off we had the chocolate lava cake and they were nice enough to add a candle and even comp it at the end of our meal. All of this plus two drinks each and the bill was only $130 !Have been here before but this was the best dinner thus far ! Will be back for sure , definitely a Washington heights gem :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MFAzVnhBRRAB",
            "text": "Really good uptown meal.\nHave been here many times and my rating kinda vacillates based on the dishes I get.\n\nTonight I had lobster ravioli which was very al dente and almost hard on the outer portion - a bummer because the market price lobster made the dish fairly expensive.\n\nThe bar has a happy hour menu which I’ve enjoyed as a quick meet up with a friend.\n\nAlso a back patio area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtc1lqNTRRRRAB",
            "text": "I only gave it four stars because I have only eaten there once last week, but I loved it. Very much a NYC kind of atmosphere, great service (our server was a good guy), it was pouring, but we were in the covered patio area out back (by choice), the steak and eggs were amazing and the gnocchi was off the hook 🤌🏿 The Bottomless Brunch is $35 and I promise, the portions won't let you get but so far. I will be returning...again and again so I can move that food to give stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0eG9DYUlBEAE",
            "text": "Went here to celebrate a birthday during Restaurant Week. They had a good deal that included a glass of wine, appetizer, entree and dessert. The calamari was awesome (both types), as well as the Shaved Fennel Salad, the lasagna with the spinach was enjoyable, and the panna cotta was light and balanced with the chocolate on top. I would come back again."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPZ1BfaGpnRRAB",
            "text": "Oh my gosh, Saggio is incredible! :-) The food is amazing, the cocktails are delicious, the staff are so nice, & the atmosphere is lovely! This is a great neighborhood spot for excellent Italian in Hudson Heights if you're in the area. I cannot recommend this place enough!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqanNXdktBEAE",
            "text": "Best Italian food in the area. It actually might be the only Italian food in the area but great nonetheless. I usually stick to the Al limone pastony with pollo or the raviolis both which are amazing but this time around I grabbed the skit stake with arugula and a side of mashed. Delicious and inexpensive"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNM0pUaUx3EAE",
            "text": "Discovered this gem a while back and it’s become a regular spot. While the dining area is small, they do tend to manage the space well without being made to feel rushed out the door.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MTQzcHRBRRAB",
            "text": "Sliders were amazing. Spinach lasagna was tasty and service was great. They have outside and inside seating. Worth coming here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaXZ2ajdRRRAB",
            "text": "12 of us dined at Saggio on Mon, Nov 13/23. They were very creative in using every square inch of space in this popular restaurant. There were even tables in the narrow hallway to the heated patio where our group was seated, and while the main part of the restaurant was quite noisy, the patio was wonderfully quiet and set up with overhead heaters to combat the cold night.\nCrostini (tomato/basil, goat cheese, and white bean) were enjoyed, particularly the white bean crostini. Our friend enjoyed the kale Caesar salad; and my husband demolished the gnocchi. Tagliatelle ai funghi was tasty, though a bit on the salty side. The panna cotta looked beautiful but wasn't as flavorful as I was hoping it would be; and surprisingly, was quite firm (i.e., no jiggle), though happily there wasn't a rubbery texture. Service was attentive without being intrusive."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5ODc3R1ZREAE",
            "text": "I was in NYC just before Covid, and was taken to Saggio by friends. My meal tasted exactly like what my grandma’s cooking, which brought tears to my eyes. The atmosphere makes you feel like you’re far from a bustling city. I like to think…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeXJPV2pBRRAB",
            "text": "Saggio is cozy and romantic with great food options. We had the pappardelle with wild boar ragu and the gnocchi with sage butter sauce. Would definitely recommend the risotto croquettes and sorbets. Our only complaint is that while all servers were very friendly, the service was extremely slow."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaHJucDlRRRAB",
            "text": "Amazing as per usual, especially the meals and portions. The back patio can get very sunny. Overall an excellent lunch or dinner spot. We love coming for brunch!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdVBLcGdBRRAB",
            "text": "Nice Italian venue, with robost menu. Great housemade pastas, nice setting and friendly staff. Specials were attractive and the cocktails were nice. Tried their Burrata Ravoli which was delicious and Squid Ink Pasta which was also great as well."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVaEpLY19RRRAB",
            "text": "Food was amazing, ordered the pasta al limoncello and was to die for. Service was very attentive Rebecca was very helpful during dinner. And all the staff was very nice. I would definitely be going back!!! Thank you guys, keep it up with…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3N29lOTd3RRAB",
            "text": "Their homemade pasta was AMAZING. We tried both the penne and the ravioli. I definitely recommend the ravioli.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NkxDempBRRAB",
            "text": "met a friend for brunch here and it's absolutely delightful. we sat outside on the patio (highly recommend!) which was decorated beautifully, and the inside of the restaurant looked lovely too. the staff was fabulous and the music playing inside was fab too. THE FOOD. we both loved our entrees, but i must give special props to the blood orange mimosas (so good) and the pistachio milk latte (!!!!). really unique, delicious options that set this place apart from others.\n\nour server was so kind and let us chill out and catch up for more than two hours. highly recommend and i can't wait to return."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJOF9TaDhnRRAB",
            "text": "Fresh pasta for all!! Came here with my fiancé on a Tuesday and we loved it. He had the classic meatballs and pasta and I had the butternut squash ravioli with brown butter sage sauce. We ordered glasses of Pinot Grigio.\n\nI was able to finish all of mine even on a partially full stomach. The wine selection is very good for even savvy connoisseurs. Our waitress (who wore glasses) was funny and friendly, made us feel very comfortable and we both loved her.\n\nWe ended the night with classic Tiramisu and my green tea (they use the Mighty Leaf brand 🍵🍃)."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnLWF2c2NnEAE",
            "text": "I haven’t been here in at least two years but the experience was wonderful and the food amazing. Thanks so much!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlamN2M0JBEAE",
            "text": "Food and drinks are delicious! Staff is very nice and parking was easy! Very nice place!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMGZYNXdnRRAB",
            "text": "I ordered :BLACK LINGUINE 19\nsquid ink pasta, calamari, tomatoes, dried chili. Somehow, there was  dried rosemary all in my meal. I felt it all prickling my mouth and I don’t like rosemary. I order the food based on the ingredients listed.\nThe waitress/server saw all the food on my plate after 20 minutes or so and asked to box it. I said “no.” A server came by  and asked if something was wrong and my mom Explained that the ingredients didn’t mention rosemary and it’s all in the meal. He said “yes it comes with rosemary on it.”  I tried picking it out of the meal, but it was all over and where we were sitting; in the patio, in the dark, I couldn’t take see too well.\nNo one offered to replace the meal, ask what’s wrong to rectify this and we were charged the full amount of the discarded meal. My first time there and I was utterly disappointed. The only good things were the bread and fresh mozerella cheese and the drink was drinkable..\nI went to this place because my daughter lived this place and raved all about it.  Plus, we went to celebrate her work anniversary.. definitely didn’t expect that experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxeUt1QWJREAE",
            "text": "This is the second time at this place and once again the service & the food amazing! They have daily specials and they're always yummy. It's a popular spot and on weekends it gets busy.\nFirst visit the special appetizer was watermelon with prosciutto this time pan seared octopus with veggies and it was delicious.\nEntree last time was steak with arugula and I had a side order of string beans. This time meatloaf and panchetta potatoes. All of it delicious!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRMW9PUENREAE",
            "text": "The food, atmosphere, and service here are all outstanding. We're don't visit NY often so each time we do we try something different. Saggio is the best restaurant we've been to so far."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNTh5Zl9RRRAB",
            "text": "Fenomenal, also the drinks are amazing. I am in love of Anima Nero mezcal base. It’s my favorite"
        }
    ],
    "reviews_count": 74
}