{
    "name": "Fort Washington Public House",
    "place_id": "ChIJE-iZ8mr3wokRtuUpEY3tuM4",
    "grid": "MN12",
    "address": "3938 Broadway, New York, NY 10032, USA",
    "rating": 4.4,
    "user_ratings_total": 626,
    "phone_number": "(646) 813-2210",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SlkzQkxOM1owVkRsQ2RHWXpPRGx6Y1U0dFJtYxAB",
            "text": "Its a bartender she's a little on the big side. Beautiful accent (irish) ( maybe even Australia) she makes poor drinks asked for a long island ice tea and she basically filled my drink with triple sec instead of actually alcohol made my stomach burn bad. The other bartender showed me on video what she actually did and it was horrific. A month later I come back just to order food and she refused to serve me as if I said she poison me it was so unprofessional. Never said she poison me she makes bad drinks her attitude was not good then told me to get out as if she owns the place. Very unprofessional. She also claims because I drunk the long island fast that it was a good long island if you made a good long island its almost impossible to drink it fast lol horrible bartender and having a shouting match with a customer is unacceptable wouldn't recommend anyone to go to this bar."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUFFqWlNUMFpmYzNBeFN6VmZRM05KVUdGZk5uYxAB",
            "text": "Great food, and very, very friendly service. I highly recommend this place!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zd1ZHZFNTa05QVEVKQlFXUXRaVkUwVGpVMFFuYxAB",
            "text": "I usually like the wings. I ventured to the sot garlic wings, didn't like em. But - the wings are usually pretty good.  Great sports atmosphere. Amazing staff. Even the bathrooms are great."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVWR6YzRibEZaTUVadlkzTnROVFZJWmxoS1lWRRAB",
            "text": "Had a great burger, perfect cocktail and great draft beer. Staff was super nice, bartender Jose, true gentleman, Manager Fernando, runs a tight ship, but still knows the customer comes first. A great night out"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adWQzUjZTMjlCUkRoaVlpMHhWRWxVYlRSZk1VRRAB",
            "text": "Not respectful of patrons time. Changing vouchers to fit their need even when they say they can be used. False advertising"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeFNUTnpWV0UxZFdSaFdVaDFhVTlLWDJFeE5uYxAB",
            "text": "The food was good and the customer service was great. My only issue was with the wings.I ordered them and they just weren’t great. My boyfriend also ordered wings the other day and had the same experience. So I’d recommend skipping the wings and everything else was solid."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNlNEaEpjelZYU1hseVZqQjVTelowY0MxclFrRRAB",
            "text": "Welcoming and delicious.  Perfect for lunch while visiting the neighborhood.  Portions were generous, the burger was excellent! Great fries."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbk5FVnllbVZ5VEhrMVdHTk9iVVZFWW1SVE1XYxAB",
            "text": "Bartender with the gauges has a weird attitude and aggressive vibes. The moment I sat down and asked about N/A beer he just wrote me off despite asking for the food menu at the same time. Waited like 20 minutes with an empty bottle before he asked if I wanted another. I asked about the Athletic options, he said they had Golden or IPA, I asked for IPA and he proceeds to give me Golden. Why ask if you are going to do whatever you want regardless? And then when he brought out my food he did this weird thing where he held the plate in front of me for me to grab and put on the bar myself…? Have honestly never seen that before.. Don’t know if that is some power-move bro invented but it’s strange.\n\nTo top it off he did a Houdini and disappeared after I asked for the check. After a long wait barback finally charged my card for me.\n\nI would pass on this spot if you wanted to be treated like an adult by an adult. Server is either on some power-trip or has an odd vendetta against NA drinkers."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BM2FsUktaSEJTZUZoSlZtVkNhM0pVTlVoalduYxAB",
            "text": "Hello, the karaoke night.They have on Wednesdays"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VmNsSkdWVU42V0RaeVVXdEVSemh5YjNobVdYYxAB",
            "text": "After my husband’s follow-up check-up at New York Presbyterian/Columbia University Irving Medical Center, I searched for a place to have an early dinner. I was craving a lobster roll, and luckily Fort Washington Public House popped up nearby. I ordered the lobster roll with fries, and my husband had the same along with the Wagyu chopped cheese. Everything was excellent!\nThe lobster roll was filled with big, flavorful chunks of lobster, and the fries were perfectly seasoned with Old Bay. The Wagyu chopped cheese was a huge sandwich—much bigger than we expected. Both dishes were delicious, and the portions were generous.\nWe definitely plan to come back on his next doctor’s appointment. Highly recommend this spot if you’re in the area!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wV1pXbFBSekZOYkhRNVVHZGliMDh0ZFVGeVlVRRAB",
            "text": "Went there in the late afternoon to try it out. Good atmosphere, plenty of televisions with mostly sports. Our server was attentive and laid back which suited us fine. Our appetizer (pretzel bites) was meh. Our burgers were very good. We both chose to have salad as our side instead of fries, what a great option as we didn't want to eat super unhealthy.  The side salad was great, it filled the plate. The server was present and easily accessible.  All in all, a very good experience.  My daughter will likely frequent this location for food and drink for the next three years while she goes to school very close. She took a picture of the weekday bar activities on the chalkboard to share with her roommates."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTk56VjRUR3htU0drdFpWUkdUekpQUmpoQlpVRRAB",
            "text": "Best. Place. Ever."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SelZGOVVMV053T0c5R01rd3dNM05FUWkxVVkyYxAB",
            "text": "I never thought I’d write a negative review for a restaurant/bar — let alone Public House — but my most recent experience was so disappointing that I don’t see myself returning.\n\nThe male waitstaff were rude, dismissive, and confrontational, which completely ruined our visit. One of my friends arrived about five minutes earlier than the rest of us and was instructed (as we’ve done many times before) to find an open table. He chose to wait outside for us instead, and when we arrived, we headed in and sat at an open table.\n\nAlmost immediately, a short, bald waiter caught an attitude with us — despite the fact that another staff member had just told my friend to find a table. He seemed uninterested in taking our order and was openly dismissive when my friend asked for a drink recommendation.\n\nAnother waiter — an older, dark-skinned man wearing a hat — eventually came by and asked if our order had been taken. My friend kindly requested a different server, since it was clear the first one wasn’t interested in serving us. Instead of accommodating the request and allowing us to enjoy our experience without the passive-aggression, this waiter blamed us for his coworker’s behavior, saying it was because we sat without being told to — even though we were explicitly instructed to do so.\n\nWhile I understand that the bald waiter may not have known about the prior instruction, that does not justify treating loyal, paying customers with hostility. We weren’t rude or confrontational in any way — yet our concerns were dismissed with a curt “okay” before the waiter walked away.\n\nThe entire experience felt unwarranted and unprofessional, ultimately leading us to leave and take our business elsewhere.\n\nI’m writing this review in the hopes that those in charge of Fort Washington Public House take a closer look at how their staff treat their patrons. It’s unfortunate that a place we once enjoyed has come to this."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSFdFeDBSMmczWVRGWlpWOXNYMU5UYjFWcmRtYxAB",
            "text": "Waitress was horrible"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVmRFWjNPUzFFVHpob2R6RnFTRWcyUWpkNFEzYxAB",
            "text": "Great vibe. Excellent burger, cooked perfectly (medium rare), and really nice bartender."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSFVtNUxNSGxYVlZRNVNuTmtOMmRXZUhCMWRXYxAB",
            "text": "Salmon burger was so juicy, my husband said the buffalo chicken wrap was the best he'ss ever had. A little too many fries for me but who doesn't love fries?!?! Glad I accidentally found this place after living in NY forever!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205blRrNTFTWGxtWWxsdk4zWm5iekJtVkRsbFpuYxAB",
            "text": "Great spot! I was there watching the NBA Finals—awesome happy hour deals and super friendly staff. Good vibes, great drinks, and a fun place to chill and catch the game!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWGRFMXVXRVJRWm1aNmVVOVJlR0ZFUzJoQ1ZGRRAB",
            "text": "So it's hard to rate a place you didn't get to enjoy. We walked in, and waited a minute at the door before a bartender noticed us and with good vibes said to sit wherever we'd like, at that moment, another worker that was chatting up a table chimed in that he'd bring us menus. We chose the right corner table at the front of the restaurant. First thing we noticed, the tables were sticky. No big deal, we can ask for a wipe down when he came with the menus. Problem is, he never came with the menus. He went behind the bar to serve the other patrons and then went back to the table he was previously at to continue his chat, which we realized after 10-15 minutes of waiting. So we decided to just go.  Hoping to come again one day and actually try their food and service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVVJEY3RkR1JFTjBobFYwOVhiVWREYkhwb05HYxAB",
            "text": "Fernando is a very empathetic server! He helped me and my friends get a reservation! And he brings service to his customers with a smile!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNVVWSmlVbGhaZFUxV1ZuQm5PRU53UjE5dGJIYxAB",
            "text": "A bar with TV's."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaWEwbDVTa1pGZFRaUGNtZEpkVXcxWjNCallYYxAB",
            "text": "Love this place! The lady bartenders are so awesome they remember your drink and always will make you laugh!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMFJGTlVaVVZOVjBReWIzWnNOVTVPUTJGclYzYxAB",
            "text": "Me and my partner have been coming here for 2 years. The girl server was phenomenal. Now we’ve been getting the same short stocky Hispanic guy. Who is passive aggressive, one time got our order wrong and he came to press my partner and started blaming him. seems miserable and this doesn’t seem like the right job for him. Lack of customer service, poor hospitality."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVzg1NC01LTVtaXNBRRAB",
            "text": "Stopped in for lunch while working in the area, 1st time fish and chips, second time wagyu burger both outstanding"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKMlQwT3VYMkwyNU1nEAE",
            "text": "Nice to have this place as an option in the middle of Washington Heights. Chill vibes, great service, and great food. Really good chicken sandwich and flavorful. The bartender was nice enough to let me charge my phone, which I also appreciated. I live in Jersey right across the river in the Ft. Lee area so I’ll definitely be back whenever I am in the Heights."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMV3o2c2ZSeWVHRG1RRRAB",
            "text": ".\nThe place is darn good, with a clearly dedicated staff.\n\nI tend to dine out regularly and this great location is definitely on my return trip list, even though outside of my usual orbit.\n\nGuinness on tap would be a top magnet.\n."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZalBuSlRnEAE",
            "text": "Our waiter Fernando saved  our night. He was so  attentive and consistently checked in on us and gave us recommendations. At first we were a little bummed it wasn’t but Fernando was just as awesome."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvakpxcDlnRRAB",
            "text": "Great bar and bartender was really attentive watched the knocks game. Food wise great selection highly recommend the fish taco has a slight kick to it really good and Parmesan fries"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaDVIMlJnEAE",
            "text": "We had a great time celebrating Baby Boi, aka Oral Bornday. The food was great, drinks on point and the atmosphere was just fantastic. As you can see, there were 10 of us and we all had a great time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaTlTak53EAE",
            "text": "As soon as we got there today 4/19/25 they asked my brother a student who is completing his doctorate to leave a card before service. On top of everything the food was horrible, drinks hot and service non existent. This is Washington heights !!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJck9mV093EAE",
            "text": "Great food too!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMjhUMWJnEAE",
            "text": "A great place for a great drink and food, get the Buffalo wings or the Nachos great atmosphere too!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJanBicTBBRRAB",
            "text": "My partner went to this bar last night for one beer after a long day at work. His card was charged $60 four separate times. His bank flagged it as fraud and deactivated the card. He had to go to the bank today to have the charges reversed so he could use his card again. When he went today to inform a manager of the issue so they’d be aware of the chargebacks, he was met with hostility and treated as though he was coming after them for money by the two managers on duty. He tried to explain that he simply wanted to inform them of the error so it wouldn’t happen again to him or to another guest, but they kept insisting it was a normal preauthorization process and that, “the charges would fall off in two days.” A preauthorization of $60 at a bar is absolutely ridiculous. We are industry and we know how preauths work, my bar does a $6 preauth on every card and that is the industry standard. It is also not normal to run a preauth FOUR TIMES. They wiped $240 out of his account and then caused it to be deactivated just before the first of the month when we have to pay rent! The fact that they refused to even apologize for the inconvenience or recognize how absurd the situation was tells us that this place is likely laundering money and scamming their customers. The bartender who was there last night was also there today, and he at least was mortified by the situation and extremely apologetic. We recognize that it was likely an issue with the POS and not the fault of the bartender, and we appreciate his attitude and how he tried to help. However, the way management handled this situation is absolutely unacceptable. They had an opportunity to at least own up to the mistake and refused to admit any wrongdoing. When your sub-minimum wage FOH staff are better at speaking to guests than the managers, whose main job is supposed to be dealing with things like this, I’m not sure you should be in the hospitality business. Needless to say, we will never be setting foot in that establishment ever again. If you’re a local, beware using cards if you choose to go here."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRamU2WmdRRRAB",
            "text": "This was the greasiest and saltiest food I’d ever had. Cream Spinach had like chunks of salt in it and wasn’t even cream. Bought a ribmeat sourdough sandwich that was drenched in grease and oil. The bread had literally soaked a ton of it up and there was still half a plate full of oil and grease. I havent felt nauseous in many years but that changed after eating this food. Service and staff were extremely nice though I’ll give them that."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3azhmNXRBRRAB",
            "text": "It’s your typical corner bar. Food was pretty good. Tables pretty sticky and service was a little slow."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRaDdqUDlRRRAB",
            "text": "Melissa is very kind and helpful!"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNTV6S1p3EAE",
            "text": "Maravilloso"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnX2VuYnVnRRAB",
            "text": "Always a great time!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncG9EblR3EAE",
            "text": "Fort Washington Public House is such a great spot!! Located near NewYork-Presbyterian, this is a cozy place for a delicious meal if you’re in Washington Heights. I recently popped-in for lunch with a group of my colleagues, and we had a great experience!! They make a great margarita (I highly recommend the strawberry + rocks). Regarding their menu, there are a bunch of great options!! The Impossible Burger with Fries is excellent. The atmosphere inside this spot is so warm & comfy, and the staff are so, so kind!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBanRIQ1V3EAE",
            "text": "Nice local bar with good food.  Sort of a Cheers vibe (although not as funny 😄)."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfd2JhSEtREAE",
            "text": "Ryan, Eric, and Melissa were all amazing and made our dining experience great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeDlXS1pBEAE",
            "text": "I liked this establishment! Visited on two occasions and hadn't realized the square footage of this place. One side provides a full sit-down dining experience, while through a door and an underpass (which is a bit of a stretch to call it), there's a smaller storefront but connected that sells very delicioussss pizza. They serve tasty NY Slices. Our food at the seated restaurant side was good too; good service, nice workers, clean atmosphere, and picturesque too. The walls displayed old NY, with famous and/or historical landmarks, both of the area and the city (of those I could identify). I'd recommend patronizing both portions of this establishment."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2d2R2YTB3RRAB",
            "text": "Nice Irish pub atmosphere, but the greeter could improve...he led us to a table and dropped of menus with his back to us and walked away.  Kinda strange really.  Other than that odd welcome, the place was great...the server was attentive and the Guiness was fresh and poured properly.  We just had mozzarella appetizers and beer, and both were good.  Will definitely return the next time we are in the heights."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQakk3Q1JnEAE",
            "text": "Love the food, drinks and everything!!"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbDVEMVdBEAE",
            "text": "Acogedor"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzLWE2blpREAE",
            "text": "Avocado toast--a piece of art; best martinis ever!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzM0tXYldREAE",
            "text": "Few things about this place, there margaritas are IT! I was pleasantly surprised by there strength 🙌🏾 You can’t go wrong with the kicking shrimp appetizer and sometimes there’s cool live music"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYLUtHeE9BEAE",
            "text": "It’s nice in here"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNk42Q2lnRRAB",
            "text": "Hier passen auch die Preise einigermaßen."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2ODRMd0dnEAE",
            "text": "Finally got to check this place off my list last Friday as my husband and I decided to do a spontaneous Happy Hour date.\n\nFirst off, such a fantastic vibe. They actually have a live DJ playing the best hits from the 80's to 2000! The music alone is so cool, it would really make you want to stay. We asked for a table inside and we got a nice one near the bar. As for service, we had Lauren who was one of the best ever in this industry. Such great energy, gave the best recommendations and made sure we were taken care of the entire time that we were there. Thanks, Lauren!\n\nAs for the food and drinks, they had great Happy Hour menu. We normally are wine people but Lauren made us try their rum punch and it was delicious, we went for it. We also started off with wings and since I wanted buffalo and husband wanted bbq, they were able to give us the sauces on the side. Fantastic wings too btw! Now we haven't had a meal yet as we fasted prior so we both decided to try the Truffle Burger. It comes with fries but I decided to go for curly fries and my husband went for the loaded fries. When it came we were surprised that they were actually pretty good sized and generous, for $18 each. After one bite, I was converted. The patty is generous and very juicy and honestly one of the best truffle burgers I've had here, such a pleads surprise. This alone would keep us coming back!\n\nWe also finally met Ken, their manager, in person. We first knew him when we placed an order online and he called us to clarify something and took care of our order and has always been great. So nice for him to stop by and chat with us. Also thanks for that round of rum punches, really appreciate it, thanks Ken!\n\nAlso I saw that they have at least 4-5 rest rooms, all clean and I appreciate the sign that shows if one of them needed attention, to just let them know.\n\nOverall, a really fantastic resto bar and also have such a great vibe! Can't wait to come back soon for another HH Friday and bring some friends over!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMjVQMDJBRRAB",
            "text": "Great spot but whatever you do DO NOT LOOK AT THE MENU ONLINE or the one in the bar lol.  Hand cut fries is not a thing and the weekday happy hour specials listed on websites aren’t real specials!   Staff is amazing drinks are pouring but the MENU IS ALL WRONG"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtM0tyR2p3RRAB",
            "text": "Indoor must have vaccine, outdoor  open to all which is great since my co worker is not vaccinated and we randomly went here for lunch. THEIR WARM DRINKS HIT and ARE PERFECT for the cold holidays. Fresh  authentic nachos, hot seasoned mozzarella stick and thick flavorful  wings. great food on top of an amazing friendly and knowledgeable staff we will definitely be coming back!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydnNMRVd3EAE",
            "text": "Had the special burger. Very good. Updated to 5 stars. I Had the Ginger Teriyaki Steak bowl this time. Very flavorful!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cjVtdDRRRRAB",
            "text": "Great experience at this place. Everyone was friendly and helpful. I ordered the Vegan Blueberry BarBQue chicken...\nIt did not disappoint.  I thouggt it was real chicken. It was amazing. The vibe was great and so was the food. Definitely stop by if you're ever in Washington Heights!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbHFhYkJREAE",
            "text": "It's a decent bar in the heights with lots of drink options. I don't know if it was the just that I went there really late, but the bartender said they didn't have any food (as opposed to \"the kitchen is closed\"). Good for a few drinks, but that's about all."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eGNXNkJ3EAE",
            "text": "I have had the gumbo here both times. Second time I asked for oregano. Perfection. It is a nice chill adult spot. No one bothers you. The staff are friendly but not pushy and don't upsell.\nFirst servers were Ortencia and Mimi.\nAlso the manager, Ty, came over when I was leaving to see how experience was.  Siobhan and Sarah, the second time.\nAll 5 are very cool. Jose is always cool and 💯\nHUNTER WAS EXTREMELY RUDE TO .Y COUSINS VISITING!!!  Felt a wp vide towards us poc."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREM2FqaGJBEAE",
            "text": "My husband and I have lived in this neighborhood for years. Most of the restaurants are sub-par at best. This our first time ordering from here and the food was so good. The onion rings hit the spot because I had a taste for them all week and this was crispy goodness. The tacos were a pleasant surprise because of the fusion style. The beef was well seasoned and the toppings were nicely done. My husband loves burgers and this one was one of his top choices. The food was hot and the delivery guy was very pleasant. We will definitely be going back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdjRId2ZBEAE",
            "text": "Not my jam because it was packed and loud, (Fri night) HOWEVER, the drinks and snacks were good!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cDVqQTRnRRAB",
            "text": "OMG THE  FROZEN MARGARITAS!!!!!! Yes, God!!! They are sooooo good. This is one of my favorite spots. You can dine alone or with friends. It's very comfortable and a fun environment. Wait staff is great. Food is good. Can't ask for more!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPek1MX1ZBEAE",
            "text": "Nice place to go have a beer or simply watch a game. Very well equipped with screens everywhere and nice sound. Drinks are good and being at the bar is the best way to enjoy unless you’re with a bigger crowd. There’s tables and high chairs every where.\n\nWill definitely come back to it"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTd3BQZzdRRRAB",
            "text": "Amazing spicy chicken sandwich and fries! Update: Today I tried the buffalo chicken sliders (special) and they were also amazing. Hope they make it a regular menu item and include fries."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIME9LTktnEAE",
            "text": "Had lunch here while staying in the neighborhood.  The lobster sliders were delicious.  Service was excellent (provided free Heineken Silvers during what I can guess was a US Open promotion).  As a side note, I lost my glasses somewhere in my travels that day; I went back at 9:30am the next day (90 minutes before opening) to see if I left them there and they bent over backwards to help me out…still looking for those glasses😂."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcU5pbmhRRRAB",
            "text": "Love the atmosphere and the waiters are amazing. The food is good as well as the drinks, great spot!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbjZ2Q3pnRRAB",
            "text": "Me encantó,  buena musica ,lugar limpio , comida rica , buen servicio .. sin duda volveremos 🥳🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbGNPY2JnEAE",
            "text": "The burgers are so good! I love this place everything came out fast and tasted so good. Our server was amazing too. We left our daughter’s water bottle on accident and he chased us across the street and 2 blocks away to give it to us. Top notch service. I wish I remembered his name but he was a thin guy with a beard (if you see this I am sorry I forgot your name!)and we sat in the street seating which had heaters."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyaktfcWJnEAE",
            "text": "love FWPH! we come here at least once every week for brunch and then occasionally for lunch/dinner.\n\nfood is always good, staff is always friendly and happy to see you, quick service when they aren't super busy.\n\ndefinitely worth checking out or making it a regular spot."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxLWZubTlBRRAB",
            "text": "Great vibe in there. Food was well made and drinks came out fast. Friday nights features a DJ. They also feature PPV fights on the weekends"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWaXRuY0Z3EAE",
            "text": "Really cool, neighbor hood sports bar, with good quality food and drink...\n\nFriendly vibe and atmosoher... pretty decent service as well! good for Few drinks with friends... or a quick stop for a bite, while your out n about in the neighborhood...\n\nSome of the most realistic prices and atmosphere in that area... most other spots around there are trying to be super trendy and very South Beach like...\n\nThis is just a really cool  local spot to chill,with good American style bar food and drink."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHaC15R01nEAE",
            "text": "Only sports bar in Washington heights. No affiliation to a team, mostly just gamblers, but quite a bit of Steelers fans come through. The Steelers stink but if that’s your thing roll on through. If not, that’s cool too. I’m a packers fan and it beats taking the subway if it’s a late game. Early games I’ll hammer DAHN though."
        }
    ],
    "reviews_count": 68
}