{
    "name": "Manolo Tapas",
    "place_id": "ChIJxw-fiJ_2wokRM3GLb_T9TWU",
    "grid": "MN12",
    "address": "4165 Broadway, New York, NY 10033, USA",
    "rating": 4.6,
    "user_ratings_total": 1156,
    "phone_number": "(212) 923-9100",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNE1VSmpMWEpUVlRSUlprRk5ORU5GUWtWM2RIYxAB",
            "text": "I loved this restaurant! An amazing vibe\nJunior served me he was the best!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obWFETjBkVFJVZG1oak1URnFabTlxUW5GRU0yYxAB",
            "text": "Alonso is a excellent waiter!!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RlFtaEZVV0p4YzA5dWVucHFaVXA0WDJacWRtYxAB",
            "text": "Alonso was a great host!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdWRYRmpUVXRmTVU5NmNtNTNTblIzTWs4MlNrRRAB",
            "text": "the food is always AMAZING at Manolo Tapas and the service matches!  Everyone is so attentive and provide a fun and knowledgeable atmosphere everytime I come. Love it here!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUlpWbHlUMUJwZW14VWVWUkZaR2xXWkZWelQzYxAB",
            "text": "Great spot"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5b1gxQjBjME5yV2xnd2NGcE5hSEJQWXpkdlZXYxAB",
            "text": "We’ve been waiting to try this place in our neighborhood for ages and we shouldn’t have waited so long! The sangria was delicious and every dish we had was better than the last. And the service from Junior was truly attentive and fantastic. Thank you Manolo Tapas for an amazing date night."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KYVRWQnVNVFZFVkRoQlJIcEplRVl4VjNaVmVWRRAB",
            "text": "Muy bueno! Toda la comida está increíble! Me encantó!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201Vk1FNDVVemM1UVhKaFdtNUhVMGcxVmt4RWVHYxAB",
            "text": "Have a wonderful evening. The food was amazing and  the wine selection was really good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214M1pFSkJRVlEzTjJWaVgxQmFTa2x3V2kxc2NYYxAB",
            "text": "Cesar and Alonso at the restaurant were amazing! The food, mwuah, Delish. Best food, best customer service and best hidden gem"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabU5sVkVYMEpPY1VSUVNFTlVOMUZoY2xaSGFrRRAB",
            "text": "Super low key Washington heights tapas place… some super traditional, some with a Latin vibe….. great all around!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oclJYVklNbGRzV2pOMmQyaFRjRkZ6TjBOSFUwRRAB",
            "text": "Alonso es una persona muy amable, su amabilidad y trato hace que todo sea mucho mejor. Excelente servicio Alonso."
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxMWREZE53EAE",
            "text": "This is a great and beautiful restaurant, beautifully decorated with a warm and inviting atmosphere. The food tastes really good, full of flavor and carefully prepared. The staff are friendly and helpful, always attentive to guests' needs. Overall, it’s an excellent place to enjoy a delicious meal in a lovely setting. Highly recommended!\n\nEste es un restaurante hermoso y excelente, decorado con mucho gusto y un ambiente cálido y acogedor. La comida tiene un sabor realmente bueno, llena de sabor y cuidadosamente preparada. El personal es amable y servicial, siempre atento a las necesidades de los clientes. En general, es un lugar excelente para disfrutar de una deliciosa comida en un entorno encantador. ¡Altamente recomendado!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxd1RUSklXWEoyZVZrdGVFUnZORGxCUTBVdFdXYxAB",
            "text": "Super atento y muy delicioso, no habían conseguido un sitio que preparara los callos a la madrileña tan bien como este lugar. Gracias a nuestro mesero Junior por su calidad bienvenida y servicio, su crianza española hace que este restaurante se sienta mas autentico. Muy bueno!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvd2FuUkRjbk0yVVU5cVRtTmljMFZEUmxGSFkzYxAB",
            "text": "Amazing Cayos a la Madrileña and Galician Octopus. Great service by waiter Junior which was very attentive, kind and knowledgeable. Overall an unforgettable experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MmEyNU1TVmx6TTNOWFNqSkpUVWMyVGxVNFpIYxAB",
            "text": "Great atmosphere! Great service! Great Spanish food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOV0xTMVJhSFZzT1VobllWTnVhbWRHZG1sbVEwRRAB",
            "text": "Food was absolutely delicious. Consider my rating on that aspect a **** 1/2 out of *****. The service was terrific. It was nice to have a waiter who knew the stuff and was helpful in coming to a menu choice. Had a ribeye steak while my wife had a skirt steak and both were great. Place doesn’t take credit or debit, it’s a strictly cash operation here. They have an ATM on the premises at the least but not to have the option to put it on a credit card kinda knocked a point off. Would strongly advise you try this. The shrimp tapas were out of this world especially."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORWR6azRkSEJhY0c5VlMzWkxNRXBFU0VOYVVYYxAB",
            "text": "Great food and atmosphere, would be helpful if whole crew could speak English, be advised \"cash only \".worth of visiting"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZM1dYaFJNMGhUZW5Kak5UQmpUakZ4U1VaQldXYxAB",
            "text": "The first thing you should know is that this restaurant only accepts cash — which screams “tax evasion.” Typical Spanish… The food is decent and relatively authentic, but nothing spectacular.\n\nWe considered leaving when we found out they don’t take credit cards, but the staff was friendly, and that tipped the balance in favor of giving it a try. We don't regret it, it was a nice dinner, but we won't be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNk5HbEdTamxuYmxWcWMxRlZiV3hrZWw5VlJHYxAB",
            "text": "Hadn't been there in a while. Very good service old school like. We ordered the seafood paella and it was better than we expected. Very good seasoning and lots and lots of ingredients the chorizo was very good. The shrimps would be the hardest to evaluate because they were likely from Asia and not fresh and therefore tasted rather generic. Nothing wrong with them but we just got back from Spain and we know the difference.  I would say the food is a 4.5 not the absolute best we've had but very very good and we also appreciate not having to go downtown to enjoy a diverse and genuine Spanish menu. The sangria was fine and that's where they make their money by the way. The price for the paella for two was reasonable. And we took a lot home.  Cash only and they add an 18% tip to the bill automatically.  The space is a little cramped."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kcE5qUlFNR1kwY0hOMFVGVkRVbDlVTjE5S1NsRRAB",
            "text": "The paella 🥘 was amazing 👏…"
        },
        {
            "date": "수정일: 4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdE5pNTdnRRAB",
            "text": "A mi me encanta, buen ambiente, excelente comida y un trato especial, con mucha afabilidad y respeto. Lo recomiendo!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPMmxwdmlldEotWXZBRRAB",
            "text": "Highly recommended restaurant. Great customer service and food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNYUM2dUxtbDYtYl93RRAB",
            "text": "Delicious food, excellent service. Best restaurant in the Heights!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYWN0T1BUOEpHMjd3RRAB",
            "text": "Absolutely wonderful spot for Spanish food. Alonzo was wonderful, will be back, you made the whole experience exemplary!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNU05vLTZyc2FLSWh3RRAB",
            "text": "Service was great and quick! Loved the tapas more than the pállela. But over all would totally come back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNQ2h4ZVBTdzVHVmt3RRAB",
            "text": "We had a great meal after graduation. Every dish was delicious and our server, Alonso, was very attentive. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQR3c0ZWF6bGZ2TDJnRRAB",
            "text": "Staff was welcoming and professional! The food was authentic and delicious!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcVlxbFhnEAE",
            "text": "We husband spent the night throwing up after eating there."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbG9xYTJRRRAB",
            "text": "The food is delicious! The service was excellent; however, CASH ONLY and they don’t tell you that at front. If you want to come to this place, be prepared to have cash on you."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvay1tRExnEAE",
            "text": "I was excited to check out Manolo tapas, for some Spanish food. The service was honestly amazing — super friendly and made us feel really welcome. The food looked good, but for me, it was missing a lot of the bold flavors I grew up with. It felt a little flat compared to what I expected from Spanish dishes. Still, I had a great time thanks to the awesome staff. Hoping the kitchen can step it up a bit, because the vibe and service are definitely there!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbGVtSWx3RRAB",
            "text": "Muy buena comida muy buena atención le recomiendo las croquetas de jamón y el pulpo con gambas y el jamón ibérico muy bueno.\nLos tragos son otro nivel gracias Richard por tus atenciones\nNo"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbGZHRTl3RRAB",
            "text": "Hoy me sente en el bar! Mi primera vez en este lugar y lo recomiendo al 100. Pase un momento muy agradable.. muy buen servicio. Buenos tragos. Richard el mejor bartender. Gracias por tu servicio. Quedé impresionado para ser un lugar latino."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNWU2R1ZnEAE",
            "text": "One of the best meals ever had"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNWVMcGF3EAE",
            "text": "The tripe stew was delicious!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNWNLXy1nRRAB",
            "text": "A treasure of a place and the service is excellent. Top notch Spanish- from the tapas to the paella."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGNLYzBRRRAB",
            "text": "Literally just walked and spent four minutes at the bar while the entire staff was watching a great game between Madrid and Barcelona four minutes later the bartender looked at me three times did not ask me if I wanted a drink or if I wanted to see the menu. At five minutes, I stood up and walked out. The only reason they’re getting three stars is because I love this place. I’ve been coming here for over 15 years on occasion and have never let me down until today."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvenJPcXpBRRAB",
            "text": "Food was delicious, especially the desserts. Great service as well."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZzV6cUFREAE",
            "text": "I tried the paella negra at Manolo and was blown away—the squid ink gave it such a deep, rich flavor, and the seafood was perfectly tender. The pulpo a la brasa was just as impressive—charred just right and melt-in-your-mouth delicious. Even just sitting at the bar, the service was outstanding. Just a heads-up: it’s cash only, so come prepared!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3OU9hU1p3EAE",
            "text": "Nice place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJd01LUGN3EAE",
            "text": "It was an excellent experience. Our waiter, Alonzo, was extraordinary. He was always attentive to everything. He recommended dishes and additional options. A calm atmosphere where we could share and feel at home. I truly recommend it 100%."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd1B6bWlRRRAB",
            "text": "The food was wonderful, with excellent flavor and presentation. The waiter, Alonso, was fantastic, very attentive, and gave good suggestions. A place I highly recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZ0o2LU13EAE",
            "text": "The food was amazing, great ambience and upstanding service by junior , Alonso, wee the host they really took good care and provide an amazing service. Overalls the service was great love the place . Junior was very attentive and friendly. Highly recommend the place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJLThHcGRREAE",
            "text": "Always a great time with friends and family. Food and attention is great!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMjgteWJREAE",
            "text": "This is by FAR my favorite restaurant in Washington Heights! The food never misses, the customer service is impeccable (thanks Cesar), and the ambiance is always so chill. In me they have a customer for LIFE!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMjdmQkdBEAE",
            "text": "Always an amazing meal! Cesar provides top-notch service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMjllVzF3RRAB",
            "text": "Great atmosphere and great service from Cesar!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbU1Md3RnRRAB",
            "text": "My husband and I love this place . Food is top notch and service on point. Alonso was incredibly accommodating and attentive. We will come back !!"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NDllekJ3EAE",
            "text": "Excelente comida y servicio!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NDd6cTJnRRAB",
            "text": "Alonzo was amazing! Super nice and suggested great items."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bzdTMDVnRRAB",
            "text": "This is a pretty amazing place where the food and drinks are grand. It’s a place that as soon as you step into your transported into a different place."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueTlXODRBRRAB",
            "text": "안짜고 안비리고\n맛있게 먹었어요\n\n단 캐쉬"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNILUtfZ2VnEAE",
            "text": "A true gem where every bite tells a story of flavor and craftsmanship. The service is warm and welcoming, making you feel like a cherished guest. An unforgettable dining experience that leaves you craving for more. Simply exquisite!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MHE2RHJnRRAB",
            "text": "My friends and I had a great experience at Manolo Tapas restaurant. The food and service was excellent! I highly recommend for your special occasion or even just a day or evening out for a bite. The owner came by our table to reassure our experience was top tier."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dGIzNnV3RRAB",
            "text": "Surprisingly, great restaurant with quick and friendly service. Food was great. I wish they had more info in English on the menu. Some items even didn't have English translation. I think, it's cash-only place. Spanish cuisine. Full bar."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMck5ELUtREAE",
            "text": "I must admit, I find it challenging to begin this review without my mouth watering at the mere thought of my delightful experience at this establishment. The ambiance is simply enchanting, with perfectly chosen music that sets the mood without being intrusive. The staff is remarkable, demonstrating exceptional attentiveness and professionalism.\n\nNow, let us delve into the main attraction - the food. As a passionate gastronome who has had the privilege of dining at various restaurants in New York City and around the world, including Spain in 2018, I can confidently assert that Manolo's has successfully captured the authentic flavors that one seeks in Spanish cuisine.\n\nI had the pleasure of sampling a diverse range of dishes from the menu, and each one was nothing short of outstanding. From the delectable seafood to the succulent meats, the tantalizing tapas, and the carefully curated wine selection, every aspect of the culinary experience was truly exceptional.\n\nWithout a doubt, Manolo's has earned a special place in my heart as my new favorite dining destination. I wholeheartedly recommend this establishment and give it the highest rating possible - a perfect score of 20 out of 10.\n***SPANISH**\nDebo admitir que me resulta difícil comenzar esta reseña sin que se me haga agua la boca al pensar en mi maravillosa experiencia en este establecimiento. El ambiente es simplemente encantador, con una música perfectamente elegida que crea el ambiente sin ser intrusiva. El personal es extraordinario y demuestra una atención y un profesionalismo excepcionales.\n\nAhora, profundicemos en la atracción principal: la comida. Como gastrónomo apasionado que ha tenido el privilegio de cenar en varios restaurantes de la ciudad de Nueva York y de todo el mundo, incluida España en 2018, puedo afirmar con confianza que Manolo's ha capturado con éxito los sabores auténticos que uno busca en la cocina española.\n\nTuve el placer de probar una amplia gama de platos del menú, y cada uno de ellos era nada menos que excepcional. Desde los deliciosos mariscos hasta las suculentas carnes, las tentadoras tapas y la selección de vinos cuidadosamente seleccionada, cada aspecto de la experiencia culinaria fue realmente excepcional.\n\nSin duda, Manolo's se ha ganado un lugar especial en mi corazón como mi nuevo destino gastronómico favorito.  Recomiendo de todo corazón este establecimiento y le doy la calificación más alta posible: una puntuación perfecta de 20 sobre 10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNILUlLZnR3RRAB",
            "text": "Always a great experience at Manolo's, Cesar and the other waiters are the best.  They are extremely attentive, polite, friendly and go above and beyond for the patrons. Love Moanolo's."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWalBmX2RnEAE",
            "text": "The food and the service were amazing. the decor was not spectacular, but the food made up for it. I would also recommend the shrimp and lamb chop not pictured. A little pricey and parking is HORRIBLE, so add $35 to your bill!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWMjRxWVl3EAE",
            "text": "I haven't been to this restaurant in a while but I stopped in last night and ordered a ribeye steak with these delicious Spanish potatoes. I had this wonderful salad with artichokes and walnuts and cherry tomatoes and I had these dates wrapped in bacon and syrup. So so good. I sat at the bar and had a wonderful staff. Wonderful service, five stars. Very polite. It was just a wonderful experience and I would definitely return again. It was delicious. Food made to perfection. The only thing bring cash. They don't accept credit cards. Bring cash. Thank God there was an ATM in the basement. I give this place five stars"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eU9IWWtRRRAB",
            "text": "Amazing experience.. hidden gem. The food, service and atmosphere is unforgettable. Thank s a lot to Oliver.  He was an amazing"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dEpEZzBRRRAB",
            "text": "Me encanta este lugar, tenía mucho de no venir y ahora volví para la cena y estuvo como siempre, excelente. Los meseros muy amigables y atentos siempre. El ambiente calmado y relajado perfecto para compartir con amigos y familia ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MFlpb0xnEAE",
            "text": "So glad to find this place near GW! Everything we tried was delicious, from coffee to sangria to paella. Will definitely come back and try other things."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpcDhPSXFRRRAB",
            "text": "From the food to the servers to the drinks and the overall environment , this place was amazing don’t expect to pay cheap prices but definitely expect to get your moneys worth plus if you’re looking for parking there’s a parking right…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dDhPRXdRRRAB",
            "text": "A spectacular place to try a good Spanish food! And the sangria was amazing, the food is tasty and the ambience is great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3amRPOGtRRRAB",
            "text": "Its been 12 years and the still the best in town! I haven’t been here for a while and i came back the the food was amazing! The chef did  amazing job with my special request since I don’t eat carbs. Chefs Celestino is the best and I really recommend this place for a nice and quiet dinner!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOE1hWWVREAE",
            "text": "We had their signature paella and it was perfect!  The best part though was the service - our waiter and their helpers were very attentive and the person serving us suggested  great wine to pair with our food, thank you!\nThe CASH  ONLY option is a bit weird for this kind of upscale establishment, but if you come prepared, no problem. ATMs are close by as well.\nI will definitely bring my out-of-town guests to this restaurant as it is really close to my place and we had such a great experience there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eVliWlZ3EAE",
            "text": "Flavor 100. Drinks good, we went for happy hour. Cash only.\nService 100%. Croquetas de jamón delicious, croquetas de zetas also delicious."
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcE95THV3RRAB",
            "text": "La verdad unos de los mejores lugares, excelente servicio, excelente comida, excelente ambiente y lo mejor una experiencia agradable. Establecimiento limpio. Los empleados a un nivel espectacular. Lo recomiendo al 100%."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbnFmeXZ3RRAB",
            "text": "Blast from the past Spanish style restaurant with stone and tiles and wrought iron trim that evokes old Madrid. Tapas are serious eating here, as the crowd of locals will testify. Croquettas are creamy and full of ham, delicious olives, yummy crab cake, cheeses, Iberico pork, paellas. Their large menu has many options and hearty portions. Fun night out for your taste buds..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMjViLWZnEAE",
            "text": "Found this place on a whim while waiting for Movies with Lin Manuel Miranda at United Palace. Pleasantly surprised by the delicious tapas- garlic shrimp, goat stuffed peppers, sangria and little seafood burrito- and service. Will be back for more!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHN1k3R2tnRRAB",
            "text": "I’ve tried their mushroom croquette, spicy potatoes, shrimp gambas, octopus, bruschetta with steak on top, and dessert. Everything was great. Nice happy hour. Keep in mind that they are cash only"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhLW9PQ2tRRRAB",
            "text": "Visita Dic 19 - Manolo Tapas es un restaurante español realmente para recomendar 100%, la comida es espectacular, hay una gran variedad de opciones. Debo decir que en cantidad viene bastante, los platos principales considero que pueden ser para compartir si es que pides entradas. El ambiente es bien bohemio, las luces son bastante tenues.\n\nSi vas a ir recomiendo que pidas la paella, la puedes ver en las fotos. Las empanadas de entrada también me encantaron.\n\nCuando fui (Dic 19) el pago solo era en efectivo. No se si es que haya cambiado eso."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzem9IdXhnRRAB",
            "text": "We visited Manolo Tapas to celebrate my cousin's birthday. This place has a very nice decor, and it's very clean but it's a small location. As soon as you enter, to the right is there bar location with a few chairs. To the left is there main dinning room. They have an additional private seating area located in the basement, which accommodates about 18 people. The staff was very nice and professional. The server recommended the paella, which he said was there best dish. It didn't have the traditional saffron flavors that a paella has, but presentation was nice. I had the Rib-eye which was under cooked but they fixed that without an issue, but I wanted vegetables but my waiter informed me that it comes with french fries and the veggies is an additional cost. The food was already a little pricey to begin with, churrasco Steak is $34 and Rib-eye $38. I'm not sure if I would return to this location or recommend it, but everyone deserves a second chance."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbThyMGpBRRAB",
            "text": "I celebrated my wedding 10 years ago at Manolo Tapas. I can guarantee that the food has been consistently delicious since they opened their doors. I love the ambiance, the service, and how fast the food is served to the tables."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4c2ZPTGFnEAE",
            "text": "Been wanting to come to this restaurant in a very long time since I loved food in Spain when I went, but having this in my hometown Washington height’s is just priceless, first off I have to say the service is exceptional! Make sure you ask for Oliver, he is a server and bartender he makes the most delicious caipirinha. He recommended the ribeye steak and it was amazing! Loved it! Will come back again for the Skirt steak. They have a full bar, nice tv’s to watch your favorite games and just have a really nice time."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReFBpMEFnEAE",
            "text": "By far the best tapas you can get in New York. The food is not cheap but tastes delicious. Everything daily fresh and tasteful. The serve excellente wines and the service is great ! Our favorite place in the hood !"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzdTVDdDdnRRAB",
            "text": "This is one of the best spots for lunch in the city, IMO! Firstly the service is amazingly good. Both at tables and while sitting at the bar service is prompt and gracious. Secondly the food is both delicious and beautiful. The chicken medallions are gorgeous as is the steak.  The tilapia is likewise lovely. Thirdly the price is great!! Really excellent value.\n\nThey also have a happy hour and live music on the weekends.\n\nAnd although it is CASH ONLY, there is an ATM on the premises."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndi1tZXJBRRAB",
            "text": "The food here was amazing! Really flavorful and delicious. The pacing of our service was great and the staff were all really nice. We had a bit of a wait but that was mostly because it was Valentine’s Day. Totally worth it though. We got the artichokes, croquets, mushrooms, and steak. I would love to dine here again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvMjVtQ0NBEAE",
            "text": "Excellent place for dates, good lighting, the music is diverse at a perfect volume that allows you to enjoy a good conversation and the music at the same time. The food and drinks are very good. I truly enjoy my time there every time i go…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzM0xyNUNREAE",
            "text": "Loved the place, decoration was very cozy and our server was more than wonderful. Explained everything we needed help with. The cocktails were not as good as I expected, but other than that we had a great time. Octopus was a lil but salty…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBa2NXS0l3EAE",
            "text": "This is a bar/restaurant that offers mostly Spaniard inspired food. I've tried many of their dishes and the grilled  octopus is my favorite. On my last visit we tried the paella marinera and while it looked really tasty the flavor was…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVbzVlZ2V3EAE",
            "text": "Awesome Restaurant/Wine Bar,in Washington Heights ,this place decoration is awesome ,you really feel you are in Spain,seats are very comfortable and private loved it,music is perfect,everything is very clean,menu is very complete offering great choices of “Tapas” And “Entrees”,great portions,their wine selection offers you a large variety of wines! ,staff is well educated,courteous,professional and very attentive! food was fresh and delicious! But unfortunately the “Carpaccio” didn’t meet my expectations! I will suggest you to specify the ingredients on it so people can determine if is going to work for them or not! pretty sure lot of people like it there like that!but I’m used to a classic “Carpaccio”,I was extremely satisfied with my experience there and highly recommend you to visit this place,and also they do not accept cards cash only!but is really not a big deal.Thank You."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyZzRxYWlBRRAB",
            "text": "5/5 lugar encantador, un verdadero viaje a España  en pleno Mahattan. La comida, las bebidas y las atenciones exquisitas."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzNlptZThBRRAB",
            "text": "Ducked in here on a cold night and really enjoyed the experience. Great service, fun music, good tapas - which is hard to find in the U.S.\nWe had 5 dishes and a bottle of wine. Turns out that one of the dishes wasn’t…"
        }
    ],
    "reviews_count": 83
}