{
    "name": "RAMEN KU-RAKU",
    "place_id": "ChIJG-jerif3wokR4f40fzi2JTE",
    "grid": "MN12",
    "address": "3952 Broadway, New York, NY 10032, USA",
    "rating": 4.4,
    "user_ratings_total": 294,
    "phone_number": "(212) 568-8866",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMlZXTjZhM1JPYmpKeVIwTnVYMU5VWTJoTU5VRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ 100/10\n\nRamen Ku-Raku is absolutely incredible. I’ve eaten ramen in Tokyo, but this place somehow manages to be even better. Every bite was perfection. The tonkotsu ramen was a dream come true with noodles that had the perfect texture, a broth that was rich and full of depth, and chashu that melted in your mouth.\n\nThe edamame was probably the best I’ve ever had. I didn’t know a vegetable could have that much flavor. It was simple but unforgettable and showed how much care goes into every dish here.\n\nEverything about Ramen Ku-Raku feels authentic and made with love. The flavors are bold, the quality is top tier, and the experience is one you won’t forget. If you love ramen or just love great food, this place is a must-visit. Ramen Ku-Raku is a bowl of pure happiness."
        },
        {
            "date": "수정일: 6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd2VWYzJkamRtZDFBeExXTmhOVFYyU0hOelowRRAB",
            "text": "Quick service, delicious ramen\nHad the Ebi Ramen :)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNVNFVjBObWxYYzI1WmNuQjFhVGQyTUc5c2NrRRAB",
            "text": "A family business well run and excellent tasting ramen food! We had the Tonkatsu miso soup option and the vegetarian soy sauce base soup! Both were outstanding and perfectly salted soup base which is very important for us. A must amd you won't be disappointed!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aV2RUaEVWRlJ6Vmxac1NscDNVamxMWlVoRVMxRRAB",
            "text": "delicious ramen and cheap Sapporo, nothing wrong with that"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUlNsVjJSRWd6ZFV4Q2MwMWFjMGRQWms1dlJGRRAB",
            "text": "We had the best experience at this establishment! Flavorful freshly prepared selections, welcoming and clean environment, attentive wait staff and pleasant dining experience. Not too expensive for its location either. It was empty when we arrived but gradually and steadily filled up. In fact there was a good sized crowd by the time we left."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oT1QwRnVkM2xZYTNaeWNXSkhWblZ4Tm5oU1ozYxAB",
            "text": "Went here for a 3rd time, very friendly staff. Love the food. I'll be coming back again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM1VUWTVRV05pTUVnNWVFcFBlRE5xUXpocVFWRRAB",
            "text": "the ramen is good, but the chicken was a bit thickly sliced. Overall, it compares to the good ramen restaurants of other big cities and downtown, but its a bit pricey compared to other restaurants in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjNWFVWTBOWGxhU1Vwb01qSnBNRzg0ZVV4R1pIYxAB",
            "text": "best ramen in the city by far"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVlVrTkNRVTVwUXkweFR6UnhVbVJzTjNoRlJsRRAB",
            "text": "The whole vibe and area was very nice, staff was quiet and good, food was AMAZING !! I really recommend to go there and try the gyoza and green tea!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeVRXMDFaa2RTT1ZVMlkzWXhlRjl6YlMxQ1ZWRRAB",
            "text": "Excellent beef ramen and chicken gyosa. Also this is the closest a New Yorker will get to an authetentic Ramen shop experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOS243N18wcnNucEh3EAE",
            "text": "Miho was so kind and wonderful. The food was amazing and fresh. I got the spicy beef ramen, it was extremely flavorful and rich."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLZkg0clRYMkxUR19nRRAB",
            "text": "Miso pork ramen and edamame were good. Portions are generous. Eel hand roll was decent but didn't like grilled mackerel as it was too charred and full of bones."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJcjdvNFBpd2RlM1VnEAE",
            "text": "I had high hopes for this place especially on a rainy day. i ordered ramen which i love and usually am not picky at all. but the broth tasted like salty soap water. it was the black shio spicy- i tried to get a replacement but the manager didn’t try to make any accommodations for me, she rudely came up to me rushed and said “because you order what you wanted we cannot change your order.” i was so sick by the way she came up to me and dismissed my experience there. i left the ramen untouched and still had to pay full price. I was very said not to leave the server any tip because she was nice, but i cannot tip for service of that degree. not even to offer another bowl is wild. the apps were good. but best believe i left that ramen outside for someone in case they were hungry, i immediately went to tampopo ramen and had such a solid bowl of soup! thanks to them."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQVDVvS3Z3cVBxQU5nEAE",
            "text": "Food was ok not the best Ramen and for the price it's kind of ridiculous 20$ for a bowl of Ramen that's poorly done the pork was good but the egg wasn't done correct and had no flavor"
        },
        {
            "date": "5달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOZUU5Y3FGZzlpLV9nRRAB",
            "text": "Delicioso !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMklxbVVBEAE",
            "text": "We love it here! Beautiful little restaurant with excellent service, lots of fun appetizers and a lovely little selection of sake and japanese beer. We always leave full and oh so satisfied~ Great value for the price!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJakllVzBRRRAB",
            "text": "Finally tried this ramen. Recommended by a friend who lives around the neighborhood. First of all I wan to praise the place. Its very cozy, just perfect decoration, not too much not too less, simply nice earthy decoration.\n\nFor food. I ordered Pork Shio Spicy, then my friends and I order appetizer ebi fried and grilled hokke. Cant talk much about the appetizer, it just the same almost any Japanese place. Its good and tasty. For the ramen itself. Im not sure. I like the egg in it, very delicious, not too salty just enough salty. Love it. But the pork, for me its toooooo soft, I dont like it. The brith was good but not like great great.\n\nSo, yea, overall for me I give 4 out of 5 rate."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMk92SkxREAE",
            "text": "Went with my family for my sons 7th birthday cuz he wanted to try raman the owner is so nice staff is friendly my kids loved the food and had a good time definitely going again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaC1MZVVBEAE",
            "text": "The service, food, and atmosphere were awesome."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3a3NuR3dnRRAB",
            "text": "First time dining to this ramen spot today with my family, i was a little skeptical because it was dead and empty. Maybe  because it was a monday and early dinner.\nAnyway, the staff are ok not great not the best\nI didnt get to check the bathroom but they have one.\n\nI give the most credit to the chef, they make good food.\n\nWe ordered\n1. Shrimp gyoza, my family enjoyed it they score it 3.5/5\n2. Ebi shrimp 3.5/5\n3.takoyaki 2.5/5 i liked it it wasnt the best but its ok, i hoped for more octopus inside\n4.tokyo chicken ramen 3.7/5 my daughter finished the big bowl she definitely enjoyed it\n5. Beef rice bowl its 3.5/5 was good and portion was good as well.\n\nDefinitely we will return to this spot when we are in the area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdzVHcXN3RRAB",
            "text": "I always order the same thing and always enjoyed it. Either the chef changed or owners have changed, this pork cutlet had zero seasoning and I Cant even chew through it. The  panko is so thick and it is coming off the meat as soon as you move it.. wont be returning anymore"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNUlxeE5BEAE",
            "text": "This is maybe the 6th or 7th time we've been here since we first tried it a few months back in late February. First came here for my daughter's 13th birthday, she is a big ramen foodie and we loved it. We have been back for lunch and dinner. I first tried the Miso Spicy Musashi and as someone who sticks to what they like I can honestly say I can have this every single time and not be disappointed. My daughter has had a different item off the menu and has loved everything as well. Portions are great, pricing is reasonable, and the menu is simple and descriptive.  Staff is very nice and friendly, they are always excited to see you walk through the door and stay that way throughout your dining experience. We love this place and will keep coming back.\n**** Update 09/02/22 We have been back about an additional 10 times since my review. There have been a number of items added to the menu. Some additiins might be seasonal summer dishes but still the menu seems to have doubled and I have extended my options and again, no complaints whatsoever. Since I have ranted and raved about how much I love this place and recommend it to anyone who'll listen, I was asked if it wheelchair accessible. I have never personally seen someone in a wheelchair dining here but since there are no steps at the double door entrance or throughout the establishment I think entry and getting to a table wouldn't be an issue. The seating is a variation of booths as well as tables with stool like backless seats that I would think could be moved to accommodate someone in a wheelchair. I'd think its definitely possible, including the access to a single user restroom, which has a nice wide door to a spacious restroom that is always clean and well maintained. UPDATE  03/07/2025 This has become a staple in our lives. We walk in and are greeted warmly. Staff is kind and very patient. It is a regular stop for us at least twice a month. We've been coming in regularly since they opened up three years ago. As long as they're open, we'll be stopping in. We love to walk in and see other people enjoy and support a small family owned business ❤️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdXRMRkZ3EAE",
            "text": "It was a perfect meal for a cold winter NYC day. The beef ramen I ordered was hearty and savory, with a good amount of meat, some fried onion, and a boiled egg on top.\nI enjoyed every spoon of it. Will be back again.\nPay attention to the building facade - it's beautiful."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbHVTT19BRRAB",
            "text": "Every dish is perfection with the kindest service"
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmb3VPV2J3EAE",
            "text": "Plats vraiment délicieux,  les gyozas sont excellents !\nLes propriétaires sont très souriant et adorables !\nJ'espère y retourner avant la fin de mon voyage !"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmN0xuU2lBRRAB",
            "text": "Highly recommended"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbHZPRVpREAE",
            "text": "Nice place to eat ramen I the winter and probably the same for the all-round year."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NTUtSjZ3RRAB",
            "text": "The Kagua beers are amazing with karaage, okonomyaki, and ramen!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bWVYclVBEAE",
            "text": "Doesn’t actually open at 11"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdjl1WXJRRRAB",
            "text": "Excellent on all categories and then a warm and friendly staff. A real find."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQczhLV3Z3RRAB",
            "text": "Lovely ramen shop with good prices, lots of vegetarian options, and pleasant ambiance"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNmFuTkJnEAE",
            "text": "After a long time found good place for tasty spicy Ramen"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaTlhRkJREAE",
            "text": "Super good service, authentic feeling atmosphere, the food was to die for! We were in a food coma afterwards"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMXVPMjJnRRAB",
            "text": "Stumbled upon this ramen shop on a cold work day afternoon. We were amazed by the quality of food offered. I especially loved the tonkotsu shio ramen. The broth is rich in flavor and it is further complemented by the black garlic oil paired with thin noodles in the perfectly tender consistency. My friend ordered the salmon ramen which is in a soy sauce or dashi based broth I think. The salmon is lightly fried which adds a crispy texture. We both were satisfied with what we ordered. I don’t come to this neighborhood often so I was super excited to have found this hidden gem. Bathroom is very clean too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYd1pIRVVnEAE",
            "text": "The absolute best!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKa3NHc3BnRRAB",
            "text": "Everything tastes great and it’s one of the best places within walking distance range."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMGYybTVBRRAB",
            "text": "Beef ramen was delicious and the dumplings was delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudHZEbG93RRAB",
            "text": "It was a delicous meal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubXJTdHVRRRAB",
            "text": "The perfect NYC dinner after a chaotic day. The staff is very warm and welcoming. The food 🥘 is flavourful and fresh. The menu had options for days. So many choices. Come hungry as the portions are generous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOU1MUEFREAE",
            "text": "I came here as a group of four and the food was great. I got the spicy Tokyo ramen, it wasn’t as spicy as I wasn’t it to be but the flavor was on point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3amUzeEtnEAE",
            "text": "Excellent tonkotsu ramen. A real neighborhood gem. If you’re bringing a loved one who’s recovering from a recent ACL surgery to a follow up appointment with NYP’s finest , Dr. Trofa, do not hesitate to make a stop here on your way home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bGZUVk93EAE",
            "text": "Really enjoyed the food here! Service was amazing, the staff were all super friendly. The price difference for card vs cash is listed on the menu so you know what to expect and there are no surprises! Great experience"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MTZ5eERREAE",
            "text": "Comida muy rica. La atención fueron muy amables y serviciales. Estuve buscando los ramen clásicos pero en el menú tenía más ramen especiales aunque ricos no encontré el que vuscaba."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieHAtS3dBRRAB",
            "text": "Very good food and the best of attentions!!\nWill come back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURia3BpcktREAE",
            "text": "Subarashi!!!!!  Excellent ramen, great service and clean . The Umami hits you right outside the door!!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibU1uYTZnRRAB",
            "text": "Interrumpen mucho. La cuenta la dan sin el cliente pedirla , siente uno como que lo hechan. Bien incomodo.  Igual la comida estaba buena ojala pudiera disfrutarla mas."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNWE3RVFnEAE",
            "text": "My cousin and I used to go to this place lots. When i came back to nyc she introduced me here as it was brand new.\n\nMy recent experience there, i believe i had spent about $85-90 on the both of us. moneys tight, but we like to treat each other out sometimes. when it came to pay, our waiter was a complete jerk. female, i forgot her name but she kept insisting that i should tip more! i still tipped like $5 but im not tipping $24 ??? I dont get why people think tips are absolutely necessary, yes they make money off that, but when begging for it it’s ridiculous. other countries don’t tip!!\n\nbut anyways ever since then, we’ve stopped going. i have really bad social anxiety and she was really pushing my buttons. please get better staff that treat your people right please.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaU1iQ2dRRRAB",
            "text": "soup was flavorless. but the curry was so good. Also it was first time to see the price difference between paying cash or credit card."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OE9PaTh3RRAB",
            "text": "i went here in dec of 2023 and it was nice. i got the pork katsu curry and the tokyo ramen. the curry was nice and the pork was amazing. that came with this japanese ginger thingy and it was sweetish. the tokyo ramen was tasty and not too salty. i liked the meat that came with it. the stuff that comes with the ramen is separated so if you don’t want to add some of it, you don’t have to. it comes with an egg, mushrooms, green onions and the noodles."
        },
        {
            "date": "1년 전",
            "language": "zh",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6ODg3RlZBEAE",
            "text": "今天我点了一碗“Pork Shio Black“，味道还不错，和我在日本旅行时吃过的Ramen比较接近，但是价格有点贵，$19.01再加上18%的小费一共收了我$22.43。我不希望用“不良商家”来形容店家，但至少Smile小姐是“不良收银员”。当我问Smile小姐要账单时，她说：我必须支付小费并且她直接在结账机上替我选择支付18%的小费，一分钱都不能少。我知道在纽约的餐馆用餐需要付一定的小费，但是客人可以自己选择想要付的金额，而收银员不应该强迫客人！最重要的是：当我支付完$22.43后，我问Smile要收据时，她说要等一会儿才能给我，而我最终拿到的收据并没有注明她向我收取的18%的小费，那么我支付的小费去了哪里？"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtZ01UdWRREAE",
            "text": "From the times I've been there the food is never disappointing. Everything tastes amazing, looks amazing. The atmosphere is great. People are very welcoming. I'm always happy to return. One little pointer, from serving experience, the servers could be a little more attentive on the customer's. In regards to checking in on how things are going with the food. Otherwise everything else is great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1eDh5aXlRRRAB",
            "text": "3/5: Very average Japanese food for Manhattan standards\n\nCame here with a date on a Saturday night. We ordered Takoyaki, Chicken Teriyaki, and Miso Spicy Ramen.\n\nThe Takoyaki was solid. Well-seasoned and not-too-hot, it hit the spot and we got our craving filled. That said, it was good, nothing more. Nothing mind-blowing about it whatsoever. Wouldn’t say it was worth $8 unless there were >6 pieces or it were tastier.\n\nThe Chicken Teriyaki Don was alright. Again, nothing crazy. The teriyaki sauce was good, the chicken was well-cooked, and the portion was decently-sized so I left the meal feeling quite full. The price:value ratio was high, so I’d actually recommend this dish.\n\nThe ramen dish was the most mediocre of all. The broth was alright, but the taste wasn’t too strong to be honest. The noodles themselves looked and tasted similar to those of the premium instant ramen bowls you can buy in Asian groceries around the city. So they were okay, but definitely not as good as you’d expect from an actual restaurant. Overall, not great. Thankfully it was my date who ordered this, not me, and she was an L herself so it wasn’t a big deal for me.\n\nThe prices weren’t egregiously high. Pretty standard for Manhattan. Just wish I got more in quality for my money.\n\nService was mostly standard, although one of the servers seemed a bit impatient with us as we were ordering. Not exactly what you’d want when eating out. I see other reviews that are complaining about this too, so this may be a recurring issue.\n\nOverall, if you’re craving Japanese and just need a decent-enough place and don’t mind potentially rude service, this restaurant can get the job done. If you’re looking to taste something really really good, consider looking elsewhere."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0ODkzU21BRRAB",
            "text": "Visited for lunch.  Ordered the spicy 🌶️ miso ramen 🍜 pork soup.  It was very spicy.  Many noodles… not a lot of meat. Tasty… needed a lot of water…\n\nThe service was ok.  Waitress never came to asked if we needed anything.  Especially more water.\n\nMy coworker also got ramen. Soup in a lighter broth.\n\nNo lunch specials.  So a bit pricey.\n\nA place to go to if you want to treat yourself.\n\nThis is a busy neighborhood… parking would be tough.. or you can park at a  lot. Very expensive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aExmYzFRRRAB",
            "text": "Wow! An amazing ramen place in Washington heights.  The ramen was delicious! I ordered squid gyōza. 🦑  the squid was boiled and had no flavor.  It should have been grilled.  The gyōza were soggy and literally fell apart on you. They charge $1 extra to sprinkle chili powder on it. What a joke. My only complaint is that this place can be expensive.  $36 for lunch (drink not included) the restaurant itself is beautiful and spotlessly clean and brand new!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoLWVIM1B3EAE",
            "text": "Have you ever been so hungry but don’t know what to eat? Because that’s how I was tonight, I decided to go with Ramen Ku-Raku- the pork was cooked to perfection. The broth was very light but a combination of both fatty and creamy. Definitely will be returning because I anticipate the other dishes to be as good. Overall $50 well spent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbDlQZzRnRRAB",
            "text": "Came in for lunch on a weekday and I was seated right away. The place might not be ideal for a large party since seating is limited. Our waiter was very attentive and polite. I had the Tonkotsu spicy shio ramen and the first thing that stood out to me was the stellar broth and the thick piece of chasiu. The chasiu was bigger than most ramen spots in the city, but I did find it more so on the dry side and the soft boiled egg was also slightly overcooked and lacked flavor. The portion size was very generous and you would most likely be very full afterwards. As for the price point, I thought it was pretty reasonable($17) for a bowl of ramen in NYC. They accept cards, but they do charge 4% so bring cash if you want to save a couple bucks. Overall great experience, and definitely your better ramen spot in the city."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaLVlyajdnRRAB",
            "text": "Got early dinner at around 6. It was. Good experience. The service was good and the food came fairly quick after I ordered. The food tasted good and wouldn't mind coming back for another meal in the future. If I have to put cons, it is that the seating is kinda limited and there is only one bathroom."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtM0x1bVp3EAE",
            "text": "We ordered 2 ramen and a takoyaki. In the takoyaki you can taste the octopus, were good. The broth was really tasty and the package for the delivery is great ( not extra wet noodles and meat). The service was friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGeHYyb1pBEAE",
            "text": "The yasai ramen I received was not as advertised. Where is the fried tofu and menma?\n\nAlso, after giving a $3.50 tip my total was $24.89? Almost $25 (tip and tax included) for a bowl of $15.95 ramen missing toppings is outrageous, even for Manhattan. I was definitely upcharged.\n\nI was hungry and tired, but I should have been more discerning and fussy. I won’t be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbnVHdnp3RRAB",
            "text": "Ordered Ramen to-go and with  extra protein( pork) , and for the amount of attitude I received from the lady that  checks the food \"quality \" once it's done I was hoping it was at least decent. Nasty dried pork , asked for runny eggs... You can see the dryness in that pork in the photo and forget about the Miso... Miso , Where?? Missed so , Terrible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkczZDcW5nRRAB",
            "text": "Our ramen  noodles were not actual ramen noodles and were undercooked. The staff was rude. At one point my fiancé asked me if I smelled cigarettes, which I did. I asked one of the waitresses is someone smoking in the establishment she responded if someone opens the door and someone outside is smoking it will enter the restaurant. I didn’t reply to her answer as we were the only customers in the restaurant and no one else came in after us. I ended up clearing up our table ( dishes from our appetizers were still on the table as well as ramen bowls) and was in total shock when we were informed that the tip was not included in the receipt. I typically am a generous tipper as long as the service is great, which in this instance it was not.\n\nWe all decided we will never return to this establishment. I would never recommend anyone I know to go here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaLWN2SnBRRRAB",
            "text": "Over all a good experience,\nOrdered spicy miso ramen, while it had a good flavor it was not spicy at all.\nThe egg was cooked but it felt cold as if it had been 'frozen'? never seen this being done before.\nAlso, had takoyaki, i have to say i'm used to the balls being fully round while these had a flat side.\nThe gyoza was okay.\nIts simple and alright but just okay not fresh.\nThats is my experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNy0tVTVBRRAB",
            "text": "An absolutely cozy ramen location offering a limited number of menu items and an expansive drink menu.\n\nTheir ramen soup quality is pretty delicious. Their dining experience is best after dusk where you can enjoy the candlelight dinner with friends or a loved one.\n\nThe wait staff is extremely attentive and establishment decor is tasteful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCZ0txbU1nEAE",
            "text": "Not the greatest pic but def delicious. They have so many options, I can’t wait to try the different ones. I had the chicken ramen.  So good, so much flavor and the noodles didn’t stick together or get hard for the take out. Will def be visiting again for the other menu items. Also the dumplings weee great! Yum"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeE5fXzB3RRAB",
            "text": "Ideal meal for a cold rainy day. The shoyu broth was rich and flavorful, and the ramen noodles had the perfect bite. The place is cozy but has ample seating at tables and the counter. Service was also good and friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcXJMZ2t3RRAB",
            "text": "Solid contemporary Japanese inspired setting with a big open kitchen in front. Solid ramen broth offerings with perfectly cooked noodles. Takoyaki was the standout for me however, and has me excited to try the rest. Worth a visit for sure."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1b1pQV3dRRRAB",
            "text": "Scrumptious ramen spot with a nice menu and lots of options. I had the spicy salmon hand roll and the Tokyo Ramen- both were excellent. The music and atmosphere were very nice as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOXVDQkZREAE",
            "text": "My bf loves Ramen Ku-Raku, so I was very excited to try this place. We came for lunch and I ordered the Grilled Hooke Lunch, which came with hokke (aka mackerel), vegetables, rice and soup. The menu was reasonably priced, but the hokke was excessively salty. Hoping it was a one-off, but will leave to others to find out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdW9hYnZ3RRAB",
            "text": "Everything about this place is truly amazing. The food is fresh and taste amazing. My mother who has severe food allergies went here and they accommodated her so well. This place is a MUST! Can't wait to eat more!"
        },
        {
            "date": "2년 전",
            "language": "zh-Hant",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCODRQQVlBEAE",
            "text": "味道不錯，份量稍少，尤其是壽喜燒拉麵的牛肉少的可憐，提醒大家注意。"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOExfQ1lnEAE",
            "text": "Food was good and portions were big. Really nice staff"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwajg3NjRRRRAB",
            "text": "Authentic Japanese Ramen and Katsu Curry. Lovely atmosphere. Must try!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNHZfZ3NnRRAB",
            "text": "Really, really delicious Ramen. I ordered takeout multiple times and it's always neatly and securely packed. If you are craving a delicious spicy ramen I recommend Musashi Pork Miso Spicy!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1M2ZxV1hREAE",
            "text": "The Spicy Miso Chicken Ramen was pretty good. Food was probably 4/5, but the friendly service pushes it to 5/5."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleDdEN2NREAE",
            "text": "Absolutely Incredible Food\nService & Hospitality Awesome\nGreat music 🎶 yet still able to have a conversation & hear your partner 😉\nPairy our waitess was Wonderful 💐\n5 Gold ⭐⭐⭐⭐⭐ 💥"
        }
    ],
    "reviews_count": 75
}