{
    "name": "Dallas BBQ Washington Heights",
    "place_id": "ChIJ1Tldkpz2wokR1BvQMWlaoOs",
    "grid": "MN12",
    "address": "3956 Broadway, New York, NY 10032, USA",
    "rating": 4.1,
    "user_ratings_total": 4169,
    "phone_number": "(212) 568-3700",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUFFrWkpTbTl2VUVWU2FFVnVaRmRRYW5CalJGRRAB",
            "text": "Food was great and the day was beautiful so we ate outside."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dWNDMTFUazVUVGxKallrNVlXbDlaUm5wWk5GRRAB",
            "text": "Ive loved this place since I was a kid"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WlMxcERUak50Tm00dE0xbFNNSGhIWTFoTGFXYxAB",
            "text": "It is always a good place to eat and drink with the family!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMFNuUTBWVEV3Y1ZocFF5MHdNMlZCVld4RU5sRRAB",
            "text": "Food was Bland the seating location was terrible and  the air conditioner was giving me a headache"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMFFtUkxlRWRWWjE5U2NuUkhhRmhwV2w5bFZXYxAB",
            "text": "Definitely the end of an era. I've been a Dallas BBQ customer since the early -mid 90s. The portions were huge the food was amazing and an hour long wait was worth it. Today not do much. Thursday lunch time, across the street from a hospital and several businesses in the area and the place was empty. Started with the chili, taste was ok but meat seemed liquefied, as if they stole a bag of \"beef\" from taco bell. The corn bread is different, they changed recipe or supplier if baked off site. Service was decent staff was attentive and cleaned up rather quickly. I was brought 2 orders but only ordered 1 and I asked for dark meat but got white meat instead. I dont send food back do I ate it. Again food was tasty enough but portions seemed smaller and chicken was partially burnt. Sad to say I probably won't come back anytime soon, a shame since I used to love this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwM2FVVm5lR0YwT0UxNmEwcEtkVWd4V0V4QlRuYxAB",
            "text": "Been loving this chain forever. Margaritas and wings never disappoint."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odFZrWlZjVnBoVm1wZlltVkhlVlZVTUV4TFJHYxAB",
            "text": "Ugh. I hate writing bad reviews, especially for the restaurants I enjoy the most. This was probably one of the worst experiences I’ve had with Dallas BBQ. First of all, no one informed me of the upcharge on the drink I ordered. This was my…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVWQza3hZWEk1T1hOdVFuZzJlSFZhTjNkcFJYYxAB",
            "text": "Food for 2 always perfection 🥰!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVGVVczNVWE16Tm1zdFowRm5hVmQxWVRONWJHYxAB",
            "text": "Macaroni was bad.  Frozen drinks were great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaldqTjBUR2RtWjBrd1NWWldhMGhXVkRaWlUzYxAB",
            "text": "Service was Really Really good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcFpDMWlabnBXUmtaWVNXaFJNR000Y0ZoTVRrRRAB",
            "text": "One of the better locations. Food is always good. It is a NYC mainstay I been eating here since the early 80's. 73rd street was where I first started to go. Still the same and food still good. It's a good place for a family to eat and enjoy their meals."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSU1GUlFSbkZRVUdoS0xYTlNVSEUzTkhCTGVuYxAB",
            "text": "I really don't care to eat here. Dallas BBQ was never a thing for me. My wife loves it, so we go. On this visit there were maybe 10-15 patrons there, including our daughter, my wife and myself. We saw our waitress 3 times during a hour stay (Initial order, asked for refills and asked for the check). Meaning she only checked on us 0 times. We spoke to the photographer twice 😂. Here's the kicker. She was standing approx. 15 feet away near the kitchen talking majority of the time and were directly to her left..... Still have her 15% tip. We normally give 20 and above. The food was good and the atmosphere was quiet and pleasant. Bring back this red sweet Thai or Hawaiian wings. I can't remember the flavor 😂"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVlJXUkVXalEyT1c1UVV5MXdlVVZ4UzB0U1dVRRAB",
            "text": "I really like to eat there. And I usually get the same thing. Chicken with honey and baked potato but today I decided to get something different. BBQ brisket sliders the worst mistake I ever made. The meat was raw and hard also like rubber.  I would never order that again"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQk9USjJOV1ZqWDJ0UlJrbEhjMGRZY1haWk0wRRAB",
            "text": "This place is lovely my sister told waiter it's my birthday and they surprised the heck out of me the staff started singing happy birthday and all the patrons joined in it definitely a memerabla experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KeGN6UjFTbGhEYTBKTVpGa3hOM2RmTlhseGFGRRAB",
            "text": "If I go to a BBQ joint. I don't want ribs that aren't cooked on a traditional BBQ grill. Food was good tho. Ribs were gummy. Mac was good. Corn cob was good. Salad was small. Chicken was very good. Crispy with a honey type sauce.😋. Would go back but invest in a grill."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMkw2bG5BRRAB",
            "text": "My wife and I had a great evening. The food was excellent and the service was superb."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIaWNxdjV3RRAB",
            "text": "UPDATE: THEY STILL DO NOT USE THEIR OUTDOOR SEATING!!! WHY HAVE OUTDOOR SEATING AND NOT USE IT!?!?! THIS LOCATION IS TAKING UP PRIME REAL ESTATE AND NOT CONDUCTING PROPER BUSINESS! THE MANAGER NEEDS TO GET FIRED FOR THIS!\n\nI don't know what is the point of having outside seating if they never have staff to enjoy it. I lost count with how many times I just wanted to enjoy a frozen cocktail on a hot summer day out here. They didn't even let me pay for it upfront and enjoy it out there. BAD BUSINESS! I guess you don't want to make money"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cGF6Sm1UMk5FWTBsMk1HbElUbWRTYjFNdGNYYxAB",
            "text": "One of the family favorites!  IYKYK!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMlgwVnNXVlowVkRCYVVXVkRTMmRFWjJwdGNsRRAB",
            "text": "MY ALL TIME FAVORITE PLACE.  NEVER GO WRONG WITH CHICKEN."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWmNIRXlNRU5rY2tWalJHTlpSbFpUZUhaeVJsRRAB",
            "text": "Terrible restaurant to order from I placed an order and the employee took all the information knowing full well that they don't deliver to the location that I gave but they didn't have a problem taking my money and the nerve to have an attitude when I called to ask why was the order taking so long which was over an hour and a half. Will never order from here again customer service is terrible nasty attitude because they messed up it's your fault bbq not mine"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWVNsOHlWMnRIWHpkQ1dEQmZNbEpsY1U5SVpVRRAB",
            "text": "Service was good but, NO DRAFT?!?!?!\n\nDidn't bother having food after finding out draft was unavailable, had a few Coronas and went down the block to Ft. Washington Public House."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neE56aFhOM1kyUVhwelRWOVFRVU5oYmw5S01tYxAB",
            "text": "Ok"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT1YyVk5kWFJyWkZsSU5GODNiRGhrV0hwalVIYxAB",
            "text": "I went to the dallas barbecue restaurant in Manhattan in three years ago."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWmIzSnVSMUZ5YnpkRVZ6SnZjM3BsUWpNeFJIYxAB",
            "text": "It was early so it was empty the food was ok they have to get better cornbread and the rice is bland. But everything else was good. The Drinks always hit"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSGEzWXhiMjFmYVZkb1FqbExXa05ZVVRaVVlVRRAB",
            "text": "Food was NYC BBQ, nothing great. They take a picture of your table and try to sell you photos, very gimmicky, felt like magic mountain at Disney. Ordered the large guacamole, and it came with a few chips, not enough to eat the guacamole. Ot was loaded on top of shredded cabbage, which did nothing but act as a filler. Wife got the taco chicken salad, it had more guacamole than the 12.99 app and it had no taco seasoning."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNE9VcERMWEEwWVdFNExVeDNWRkJVUkhwRk9XYxAB",
            "text": "The frozen drinks are A+ food is great . Pricing is pretty good too"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaV9YbTR3RRAB",
            "text": "It was great as always .....I love it there me n the family  had a great time"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMVJVdEJNRUZsV1hwSGJuazRaM1UwV0V0SUxYYxAB",
            "text": "The Hennessy Wings are very good, as well as the Bulldog drinks."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaFQycDVZVzl5ZURWNGNFTjBjRVpVYmtwSWNWRRAB",
            "text": "Was super excited to come here and was quickly denied stating they were closed already at 11pm on a Friday night when online says they close at 12 am. Absolutely can not stand a business that does this."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsck56TnZVM2huVHpsdlNDMU9UbmxFT1ZoTU9YYxAB",
            "text": "Good service. Tasty food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MlJWRnJkemhvZERGVGRqRkRZWFJLZUU5WmNGRRAB",
            "text": "Was good little pricey tho"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNReC1YZnV3RRAB",
            "text": "Fun, great food, great service, good times"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLTDkxdV9GazdQNXhnRRAB",
            "text": "It's always a hit with this place. I've been coming here for years. We do celebrations, family meetings, and just simple outings here regularly. The food and the service is always good. It gets a little busy at night and on the weekends, but they really do move you along fast and smoothly. They have great drink sizes and options. They also have a seating option that sits you near 4 glass windows so it feels like you're outside with the great view minus the heat, wind, and bugs."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NmRtUENBEAE",
            "text": "The food and service were exceptional. Our waitress, Paola, provided excellent care and we look forward to returning. We are especially impressed with the way our waitress, Paola, handled the ordering process and maintained excellent customer service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKRGFpNWJ1MnZ5eDJRRRAB",
            "text": "I went to Dallas BBQ with a few friends and two out-of-town guests for lunch. We've visited this restaurant before and were familiar with the menu. We were seated quickly, and the waitress gave us a few minutes to look at the menu. Most of our food and drink orders came quickly, while a couple of orders seemed to be delayed. Our server was polite and apologized for the delay. Our visiting guests were amazed at the size of the wings--the wings were, apparently, much smaller at their local  restaurants back home. We enjoyed our food and had a lovely time. The only thing that I felt a little uncomfortable about was that the \"accessible\" bathroom for elderly/handicapped guests is located a bit too close to the dining area and the bar. If someone went in there with a gastric emergency, we'd have a front row seat in terms of the smell..."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLem9xdFQ2Mk9ub2lnRRAB",
            "text": "The staff are very loud and annoying. They are actually way louder than the actual customers. Instead of always huddling up and forgetting they’re at work, they should instead find something to do at work such as “working.”"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNemFxN1hFME9HTURnEAE",
            "text": "Es un excelente lugar. Me encantó. El servicio fue excelente. Estuve en el local ubicado en Broadway, me atendió Sandra y fue extraordinario su servicio 100/100.\nProbé sus costillas bbq, arroz amarillo, piña colada; y mi hijo, chicken tenders.\nTodo muy rico. Recomendado."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdU5mR3JRRRAB",
            "text": "Fantastic service without any rush."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPUzhoY2ZNcnN5NjZRRRAB",
            "text": "Over priced but ok."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLN3FyOFdncDdmTXhBRRAB",
            "text": "I was really looking forward to dining at BBQs, but the experience was a major disappointment. The food was decent, but the service was horrible. They made me wait over an hour despite saying it would be just 15–25 minutes. While waiting, staff kept asking how many people were in my party—even after I told them five people multiple times. Once seated, it only got worse. A server hit me in the head while moving a booster seat and didn’t even apologize. Waiters were sitting around eating their own food in front of customers, and one kept walking around yelling at other staff members. It was loud, chaotic, and totally unprofessional. On top of that, my order was incomplete—there was no shrimp like I requested. No one checked in, no one cared, and customer service was nonexistent. I honestly couldn’t believe what I was seeing. This was one of the worst dining experiences I’ve had. I will never go back and would not recommend it to anyone."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOcTY0LUxydkxDT2N3EAE",
            "text": "Ask the waiter for a starters of the wing and shrimp I order at 7:41pm by the 7:43pm the starters what’s at my table 2m, the wing where so saggy and the shrimp saggy, I ask the waiter please take the order back and bring me a new one that’s not saggy took the food by 7:46pm ant took her 1m minute to bring me new starters, if you ask me she just when to the kitchen and turn right back around whit the same saggy food, if you ask me I have been in this place 4 times whit this one, does people don’t care about service, I work very hard for my money, if you don’t what to feel robbed for your hard earned money do your self a favor and avoid this place, trust me this is the 4 time I visit this place, burger and food cold fries saggy unbelievable, but trusts me I took from my time to right this post like that I save people from going and getting rob for the hard earned money."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQWG94ZkRPdWJPQ1lBEAE",
            "text": "I had the smokehouse combo. Would not recommend.\nI recommend a drink, cornbread, fries, chicken, and maybe the ribs. Everything else is \"up in the air\" if you're a foodie 🤷🏾‍♀️🤷🏿‍♀️"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzMXJUcjVnRRAB",
            "text": "I love this place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZN3FlWWF3EAE",
            "text": "Atmosphere is clean and maintained. The kindest servers. We haven't deviated outside simple menu items (early bird specials, onion loaf and chicken fingers), and we experiment with the drink selections."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOHN1MHdRRRAB",
            "text": "The food was delicious and well-prepared, offering a satisfying dining experience in terms of flavor and presentation. However, the service fell short of expectations. Our server was largely inattentive, only approaching the table when called upon, which detracted from the overall experience. Due to the lack of attentive service, I felt compelled to give a lower rating despite the quality of the food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdllLODl3RRAB",
            "text": "Amazing food, amazing service, especially the waitress named Carmen, give her a raise, or else. If you want some Dallas BBQ order from here, whatever you do, do not go to the one down down, unless you would like to throw up your breakfast, lunch, dinner, and tomorrows breakfast"
        },
        {
            "date": "수정일: 6년 전",
            "language": "ko",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3b0tuc3NRRRAB",
            "text": "후라이드 치킨에서 한국의 시골에서 파는 저렴한 통닭맛이 나서 신기했고 사람들이 많아서 늦게 먹으면 나가라고 하지는 않지만 엄청 신호를 준다. 불쾌했다."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuZ2Jtd0lnEAE",
            "text": "가성비"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMnNtcGtnRRAB",
            "text": "No just no avoid this place at all cost!!! Server was trash, mad the whole time, rude, food was wrong 4x like how??? Not seasoned, fries under cooked, worse experience EVER! We went to the one in times Square a few yrs ago the best thought we were getting the same thing!! NOPE not even close than she had the nerve to put on a $30 tip for crap service and nasty food! I think not!!! And let's not mention waited over an hr for our food that came out all different times!!!! Ughh 200 bucks down the drain!!!! PLEASE DON'T WASTE YOUR TIME HERE!!!!!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbE95amJREAE",
            "text": "First time visiting this particular location but since I was in the area I came to check it out. It was fairly busy but the service from the waitress was quick and the food came out fast. The waitress was very friendly and accommodating. The food was fresh, I have never ordered salmon from BBQ, I was a bit skeptical. The salmon was great, juicy and tasty. I ordered a piña colada Texas size with an extra shot which was well-prepared. I also had fried shrimp (your choice if you want grilled). The shrimp were a good size and I got more than I expected (can’t see them all in the pic). Great value, excellent food and wonderful service- can’t complain aside from the French fries (could use more seasoning but I like the fact that they leave the skin on partially)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNTZ2bDh3RRAB",
            "text": "A great place to stop for a cheap frozen beverage, with lots of add on options. The strawberry daiquiri was delicious. The service was friendly and relatively quick. The chicken sandwich was good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNXFxNGdRRRAB",
            "text": "I gave it 3 stars because of the extreme sauce on everything. Everything was drenched in sauce. Ordered the Hennessy wings and they were soggy without and crispy crunch due to the tremendous amount of sauce. The angry shrimp were good but also lots of sauce. The little balls in my pics are the crab cakes. The Mac and cheese wasn’t bad but the cheeses tasted like processed nacho cheese. For 1$ you can get a bowl of ranch or blue cheese. They gave us pink little donut balls. I came during early lunch and the staff was friendly and engaging. My friends and I are quite chatty so we like out going wait staff. Our waitress Diana was very nice and had a good time with us. The baby’s back ribs were ok. Not too much meat and a bit overcooked. Would go back.. is always a good time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX3ByR0tREAE",
            "text": "I love their baby back ribs and their Texas style margaritas."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJXzY2NWJ3EAE",
            "text": "Las de la entrada dieron el peor servico nos dieron los peores asientos no pudieron abrirme la puerta yo con un coche y lloviendo pero la mesera que nos atendio fue muy amable y servicial nos cambio de lugar hizo un exelente trabajo 5A la mesera pero esas watress por favor supervicenla que estan haciendo un pesimo trabajo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6c29lajVnRRAB",
            "text": "Like usual…good wings, and good drinks. Too bad the server didn’t come back to us so we can order more drinks. He decided to sit down,eat, and talk with another coworkers and didn’t come back to our table till 55 minutes later. So yeah we couldn’t order a second round of drinks or order dessert. Never coming back. Not wasting my money with horrendous service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMXZxV05BEAE",
            "text": "I went there for the first time. The indoor environment was amazing. I did takeout order and the waiting time was less than 5 minutes. We ordered Texas Wings which was around $23 bucks for 10 pieces. The portion was very huge as per the cost. Definitely going back for dine in someday."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtd3E3Wnh3RRAB",
            "text": "The size of this place are huge. The sauce with bourbon of the Wings was so yummy. The piñacolada was not really strong and the taste was good. The broccoli was tasty and the ribs come with corn bread and fries. The service was friendly and fast."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURneG9qZFBBEAE",
            "text": "Able to accommodate large and small groups this is a good place for a meal. The food is palatable - nothing too exciting exactly as you'd expect. Heavy and filling - the salads are sad and not particularly fresh or interesting, so stick…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNGNuSFNBEAE",
            "text": "I hired bbqs to cater my companys holiday party. Drop off of food was suppose to be at 5 pm. 5:45 pm and no food. I call bbqs and being put on hold for 15 minutes, I was told they were short of delivery persons but were working on getting someone. They follow up when they find someone to bring the food. The delivery person comes at 6:30 pm. An hour and a half late is unacceptable and the delivery person demands a tip. The tip was already included in the prepayment of the order. We were then forced to tip him because he refused to leave. I call to speak to management am placed on hold for another 15 minutes and then am told to call back the following day. The next day, I called and  I speak to the catering mananger on duty and he is not only rude but not understanding. He states that I should have called the night before. I expressed to him I did and was told to call back. He makes excuses and assumptions first before sharing compassion. My request at that time was only for a refund of the prepaid tip. Now I am sharing my experience in hope that they will train the staff on how to handle these situations professionally. The only good experience in all of this was the food was still hot and good. Staff training  is needed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5aF9xUnpRRRAB",
            "text": "Good food, good location, and good service.  I was there for lunch on a Saturday and it was not too busy. Our food was ready very fast. The \"Sticky Chicken\" is VERY GOOD."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjOG9xdFB3EAE",
            "text": "The food is seriously filling, and you’ll probably end up eating way more than you expect. The drinks are so tasty that you might lose track of time, so it’s definitely a good idea to avoid driving afterward. Enjoy yourself, but pace yourself! 😅🍹"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2aWFUMlB3EAE",
            "text": "Food came out almost immediately after ordered kind of scary , so just understand that everything is precooked and just heated up. Service was decent. Waiter doesn't come back to check on customer the area for the bathroom are not to desirable it needs to be updated."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbzlfQmhRRRAB",
            "text": "Home of everything Hennessey, giant wings and even bigger drinks! BBQs always hits the spot when you want a satisfying meal that fills your belly but doesn't break the bank. And you'll leave with a nice buzz. It gets really noisy here, and crowded so you may not hear your companions. We found our waiter struggled to keep up with all of his tables. But, he was super friendly."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxalBMRjB3RRAB",
            "text": "Comida deliciosa, entras creyendo que sera el típico restaurante que te va a dar porciones pequeñas o normales, pero no, te llevas la gran sorpresa que es un plato en el cual pueden comer 2 personas muy bien, excelente mesero, excelente…"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVMU5INnJBRRAB",
            "text": "The service was warm and friendly. The waiter was attentive.  The food was quick and 🔥.  It was tasty. The place gives you a feeling of serenity and peace"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbUpMUUtnEAE",
            "text": "Nuestra primera vez y nos pareció excelente la comida, pedimos nuggets con papas fritas,  alas fritas, Hennesy Burger, salmón con papa asada y camarones empanados, refrescos y piña colada grande. Todo excelente. Y colocan un pedazo de pan o…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROaTRlSUxBEAE",
            "text": "So idk if this is normal but the food was absolutely disgusting. I had the chicken and waffles which was slathered and drenched in this gross sauce, I don't even know what it is. It made the waffle completely wet. gross!!!\n\nAlso the waffle has a terrible and weird flavor. There's whole onions in it and you can just taste the onion and flour together with that weird wet soggy sauce on top.\n\nThis is an absolutely diabolical, nauseating dish. The chicken was burned and had dark meat inside that tasted like old bones. Very gross and inedible. I would never come back here. Also the server didn't speak English and had no clue what the hell I was saying. I couldn't ask this dude anything. Literally eating anywhere else is better than coming here."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxb0l1dWxRRRAB",
            "text": "I love everything we ate. The sticky wings and onion loaf were the best. Also, my margarita was phenomenal. I would go every time I'm in NY. Very pleased!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodnB5ODhRRRAB",
            "text": "Our waitress was superb, as well as hostess. However, I ordered the baby back ribs and steak medium well. It came well done, dry and tough to chew. I don't like sending back food, so I did end up eating it. Everything else was excellent, especially the veg tempura."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHZ3ZPTXVRRRAB",
            "text": "It was an amazing experience the food was good and in big portions, I had leftovers for later that day the server was very nice and accommodating."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzODd5U2hRRRAB",
            "text": "Not cheap and not great! While the service was very friendly and very quick, the food quality was really poor. I ordered, perhaps not the most popular items, grilled salmon with fries, and the presentation was bad like a prison meal. But I…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvbnFhdWVBEAE",
            "text": "I love the franchise, so it pains me to give this location less than 5 stars.  Hard to overlook The very long wait and overcooked Beef Ribs.  I will try them another day when they aren't so busy"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbU1LYWJ3EAE",
            "text": "They violated me when i ordered some wings for a pickup order. The chicken came in a rotisserie chicken bag that was bought from a grocery store or something then resold. Went and got my money back and they were trying to convince me that this is how their chicken comes and that they don’t do refunds. If you have had BBQ’s you know your food isnt going to come like that. Dont let these people play with you like this. Unacceptable."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLOEplel93RRAB",
            "text": "I had a nice lunch here with my son's. The drinks are good and strong. The honey basted chicken is the best. The chicken soup is so good. Their corn bread is life."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzdTVudFdBEAE",
            "text": "Unfortunately my food (ribs and chicken) was cold and had to be sent back, by the time I got it back my husband was finished his food. I ended up taking it to go. I didn't take a picture of it but, the chicken soup is excellent. Definitely would recommend on a cold day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPM3BEMnVnRRAB",
            "text": "Family outing here after my daughter's graduation. It was super packed but overall good experience. The server wasn't really attentive but the food and drinks were good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5NXZMWkZ3EAE",
            "text": "first it was the worst Dallas BBQ I've ever been to. first when we got there we specifically told our waitress we were going to drink first and the make our food orders. she brought the drink alright. then 2mins after she brought the drinks food hot wings was brought to me but I simply didn't even place order for food yet.\nso we told him we didn't order our food yet but just drinks for now. so he took the wings back.\nwe finally got to our server who was totally confused  that we didn't order our food yet. we eventually ordered which I order for well done sticky wings and corn break but when the food came the wings were raw and tasteless so the manager was brought to us and he decided to bring me well done wings by that time I was really over it and all I wanted was to get my check so I could pay.\nI brought it to the attention of our server and she brought me a check without a check book and I was really amazed cos she came back to the table to pick the check and my card and really had it on her for about 15 to 20 mins and then later came to our table to give me a check again. and I said to her I gave you a check with my bank card about 20mins ago and you still bringing me another check.\nshe said ooh really let me check and came back later with my card and said sorry but I really thought the whole experience was poor and I don't really think I am ever stepping foot in this place ever again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdDdLb1JBEAE",
            "text": "The food was great and the drinks even better!!!!!!!! Our waitress was new so she wasn't as attentive as she should have been but hopefully with time she will get better."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0OGRUQnhRRRAB",
            "text": "Food was good, but crab \"cakes\" are actually balls and ask for sauce on the side. Our waiter, a young guy with blue hair (African American) was the best. He allowed us a sample of the new flavored drinks and we had a blast. You can tell…"
        }
    ],
    "reviews_count": 79
}