{
    "name": "Guadalupe Restaurant",
    "place_id": "ChIJv-bh-PbzwokR-AR_g9KRXLY",
    "grid": "MN12",
    "address": "597 W 207th St, New York, NY 10034, USA",
    "rating": 4.4,
    "user_ratings_total": 1599,
    "phone_number": "(212) 304-1083",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkc1NYVmhUa2RYVlRCaWVrTk1iRUZsTFhweU0xRRAB",
            "text": "Best churrasco!"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNGFHczVOREJ1T1dGTk1DMXJNWEoyYmsxTFRYYxAB",
            "text": "Excelente"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRmJWZFpSV1E1WDB0b1lrNDNNVVJTUzBsdWRYYxAB",
            "text": "Everything was so good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeGJteDNZelZ3TjJKS1pHTm5ORVIzTFhObFYwRRAB",
            "text": "It was a great night, service and food were amazing. The Margaritas ….Wow, Best I ever had. Thanks for making our Anniversary a night to remember."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxd0tuT2FREAE",
            "text": "So Here is the thing I love eating at this Restaurant Guadalupe every Friday night for the past 10  years to be exact, today 9/19 unfortunately I have to write a not positive review to the owner of the restaurant who happened to never be at the restaurant when I come every Friday to eat dinner, the owner was working as the hostess today unfortunately, when I walked in she was very passive aggressive!!! The bar was busy full and no place to seat, I kindly told her that I did not wanted to seat unless it was at the bar, she kept insisting that the bar was full and had no space, I told her that I was going to wait patiently for the bar until a seat came up/ available🤷🏻‍♀️🤷🏻‍♀️🤷🏻‍♀️she kept saying there’s no space and fallow me around and demanded for me to seat a regular table. I completely ignored her and walked off to the bar and find myself a seat!! I do no like when owners try to manipulate or control customers where to be seated therefore I am giving the owner one start for her  passive aggressive behavior!! 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️unfortunately because I really enjoy coming out to eat dinner here every Friday!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOT0xYcGllR3hSYUcxQ09USXdRV1ZmWVZJNVJIYxAB",
            "text": "The food was pretty good. My girlfriend got the fish in lime, and I got the Churrasco. For the price of the Churrasco. I think that should’ve been a little bit bigger. My girlfriend loved her fish. Overall the drinks were good. We had a great night."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNWFWVk5SMjVhWTBsNFFYVjJWM1pxVW1aVmIyYxAB",
            "text": "Excellent like always. Excelente servicio y la comida deliciosa."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSU1YyZzRkMkZyYjJoclVsVkVUbmx4TWpGUlZWRRAB",
            "text": "This used to be one of my favorite places but the fact that they’ve had a “grade pending sign” for almost a year now is really concerning to me.\n\nWhen a restaurant doesn’t pass an inspection the first time they get a second chance to correct it before having to post their score. Guadalupe has yet to post their score. I wouldn’t eat here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNN0t5ZlR1OHFPUkN3EAE",
            "text": "Meh. Good food of course but they deliberately left menu items on their digital menu (easily edited) and didn't bother \"86ing\" these items. Leaving me to have to have something I didn't particularly want. It's ok, just sloppy service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQemsxNnVpNHUzaXVnRRAB",
            "text": "Food was horrible i had returned back home throwing up nauseous and stomach pain. Im sueing."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLcmF3X255aV9DVGN3EAE",
            "text": "La comida insípida cara y no cara  super cara y al pagar la cuenta casi nos echaron terminaron de cervirno la Sangría  en los vasos como de mala gana para que nos fuéramos y como vieron que no nos íbamos ofrecieron pasarnos a otra mesa en la parte de atras , solo falto que nos agarran del braso y nos sacaran"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKSHp0ZUtOdktia2lBRRAB",
            "text": "The food was good, but the porcupines were very small for the price. There was little room to move from one table to another."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKSGI1OGUxc082RjlBRRAB",
            "text": "Service was mediocre, I ordered a churrasco sizzling fajita, and it was regular steak, if you know how churrasco is, very tender, not hard like grilling steak, smh what is this foolishness… I am so mad 😡 because the bald head waiter tried…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc3B6SlFBEAE",
            "text": "Amazing night!!!  Carlo Franco is amazing!!!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOTV5UUl3EAE",
            "text": "I normally go there on Wednesday yo take advantage of their Surf&Turf and it's always good (Fresh). The passion fruit mojito is perfectly made and the customer service with the live singers performing complete the experience"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NEthZTRRRRAB",
            "text": "Excellent atmosphere, really good food,"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aGZxcjB3RRAB",
            "text": "We had high hopes for this restaurant after driving all the way from New Jersey based on a glowing recommendation, but unfortunately, our experience was deeply disappointing. My girlfriend and I were excited to try the food and enjoy what we had heard was a great atmosphere. However, the service completely ruined the evening.\n\nOur server, Joan, was inattentive and unresponsive to our needs throughout the meal. Despite our efforts to get their attention, it felt like we were an afterthought. At one point, I kindly asked Joan to repeat something because the music was quite loud, and instead of a courteous response, I was met with a rude and dismissive reply. It was unnecessary and left a sour taste in our mouths.\n\nWe came here expecting an enjoyable dining experience, but the lack of basic courtesy and attentiveness from the staff, particularly Joan, overshadowed the food and ambiance. It’s such a shame to see great potential wasted by poor service. Sadly, this is not a place we’ll be returning to or recommending to others.\n\nEDIT: ( This is a reply to the restaurant itself or owner that left a comment on this review)\n\nI appreciate the reply and concern for my experience but, to be transparent I did leave the servers name in my initial review ( Joan .R). Furthermore knowing who I am, what I ate and when I visited is information that shouldn’t be relative to the service I experienced. Every patron should have a good dining experience.\n\nIf you really want to make it right, instead of asking me things that will profile me, train that gentleman better so people have a better experience. You don’t want this type of server to represent your establishment."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eFlPVktBEAE",
            "text": "Food is delicious and the waiter who helped our group was great, super funny and helpful.always choose this place cause of prices and the efficiency of the staff,I always ask for Luis cause of the way he is and treats my family… prices and food variety is always good. They play live music sometimes which is great.❤️"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRLU5hR3VnRRAB",
            "text": "Food tasted like it was overly seasoned with Sazon Accent. Waiter service was mediocre. We had to remind him of the missing dishes He seemed annoyed. Drinks and live entertainment was good."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNVkyMHVnRRAB",
            "text": "My husband and I love to come to Guadalupe for special occasions. We live in New Jersey and whenever we get Guadalupe’s craving, crossing that bridge (even with traffic) doesn’t stop us. They have valet parking which is very helpful considering the area."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncV9yMGVBEAE",
            "text": "My friend an I stopped thru on a Thursday. . Service good ... Food ...hella great..! Wanna make plans for an early afternoon return. ."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNELThYLWdnRRAB",
            "text": "I feel good in this place, I love parcha mojito, and the food is good good"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmLUtxTzVRRRAB",
            "text": "La comida excelente! Pero el servicio pésimo  y la tips forzada. Espere por media hora unas bebidas y nadie se asomaba a la mesa, me tuve que parar a preguntar si había algún problema."
        },
        {
            "date": "수정일: 10달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHX2VxaHR3RRAB",
            "text": "Demasiadas mesas para un espacio tan pequeño.\nBuena música.\nBuena comida."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OXNmM3RRRRAB",
            "text": "Delicious 😋"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQM3REY0ZnEAE",
            "text": "Es mi restaurante favorito. Su comida es excelente, las atenciones son muy buenas, el lugar ideal para compartir con familiares y amigos y porque no, también para disfrutar solita🥰"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbGVmcE5REAE",
            "text": "I'm sorry we couldn't give a decent review having had a bad experience.\n\nWe went Saturday evening. It seems there was a shift switch between appetizers and ordering dinner.  We waited almost an hour before deciding to leave. No one came back to the table... not to ask us to order, see if we wanted another drink or even if we were ok.  The place looked nice. We went based on a friends recommendation but they don't think we will be back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQd1BYU3hRRRAB",
            "text": "Good food and drinks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdFlDZkx3EAE",
            "text": "The food was great and the drink was amazing we have the Mango Tango they also have live music very nice environment I definitely recommend this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYd1BiZHR3RRAB",
            "text": "Great food and cocktails.  Friendly personnel."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOU9mMXZBRRAB",
            "text": "I loved the chips and dip! The fries were fresh and the chicken on the nachos were flavorful. My friends enjoyed the Virgin mojito and Pina colada. My two steak tacos definitely were a good choice. We sat and talked for a long time. We split the fried cheese cake and it was pleasant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNVBlNkxREAE",
            "text": "...Had a great time! Food, service and all!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuLUtDeWpRRRAB",
            "text": "Excellent service, musical atmosphere and very good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX0p2NnFnRRAB",
            "text": "Poor service wouldn’t recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMXJfejFnRRAB",
            "text": "Beware when paying your bill. I sat at the bar and had dinner. The bill came and in small print the 18% gratuity was added to the bill already but the sign copy suggests you leave a tip with the suggested amounts added to the total bill which already had the gratuity added to it. If you don’t pay attention you will be leaving a tip on a bill that had already added the gratuity to the charge"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkei1HcHNBRRAB",
            "text": "Nice place and good food. Loved the pina colada."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybUxTLWNnEAE",
            "text": "Good food 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyX2NESGxBRRAB",
            "text": "Always a great time here @ Guadalupe. The food outstanding with its flavors, drinks are strong but great as well and the service we love to get taken care of by the lovely Luis."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bWVPNEx3EAE",
            "text": "By far one of the best restaurant in this neighborhood. There is a reason this place has been here over 10 plus years. Food and drinks are 10/10. Prices are reasonable and atmosphere is 100% Dominican. The service is also very good. I always get different cuts of steak dishes with tostones & frozen margaritas 👌🏽🫠\nHighly recommend this restaurant and I barely do any reviews but for this place they deserve it 🙏🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6c29MVF9BRRAB",
            "text": "I love it ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOU9PdUNnEAE",
            "text": "Best restaurant in the neighborhood"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUX3BqaUZ3EAE",
            "text": "Lo mejor  excelente comida"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydmFUMFVREAE",
            "text": "Stopped by for early dinner around 4:30pm. A few people were inside. Happy hour was going on. I believe it's buy one get one. At first our server was pretty attentive and would check on us. Throughout our time sitting it became less and less. I didn't enjoy their version of baked or clams casino I forget what was the name. Chips & guac and the fried calamari were good. As my main I has the salmon & shrimp. It comes with potatoes and asparagus. The shrimp was amazing! Should've ordered the shrimp plate. Salmon was good too. I'd come back and try some other dishes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbW9LWU1nEAE",
            "text": "Great ambiance and drinks. We went during Happy hour-2 for 1! The waiter was flexible and allowed us to get a different flavor drink. The drinks were delicious and strong.  We had the platter-mini quesadillas, nacho chips, 2 chicken breast and steak skewers and a few coconut shrimp with pico de gallo. The waiters were attentive and friendly and accommodating as well. The music wasn’t that great. Watch out with the parking. Two of my friends got tickets. So read the signs carefully. I parked a few\nblocks away.   The place is quiet, clean and spacious. I wonder what would be the ambience at night? During the day is quiet and not crowded. Overall, I would definitely consider in returning to check out the ambience at night.  Great service!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnX3BtbGJnEAE",
            "text": "My shrimp and mashed yuca was good and fulfilling but the veggies did not taste fresh; Furthermore my dads filet mignon did not taste like quality meat and it was a bit dry . The place is very pricy and the customer service wasn't bad it's…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMHBlNnpnRRAB",
            "text": "The overall experience of this restaurant was actually pretty good. I've heard many stories about how the wait times are really bad and about how it's over crowded, yes most of that is true. If you're planning on eating here make sure to plan ahead. The restaurant doesn't take reservations but will accommodate you and let you know how long you might have to wait to be seated. With all that in mind our wait time was about 15-20mins. The eating experience was definitely worth the wait, the appetizers were amazing (sadly they ran out of guacamole) and the drinks A+. I would definitely come again but I will make sure to do so early Mondays-Fridays. Good luck if you're here during the weekends."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNM2JQU2ZnEAE",
            "text": "It was great! I loved my personal early Sunday dinner here. I got chicken quesadillas and margaritas as if it was happy hour. The game was on and I chillaxed! The atmosphere was quiet. Not too loud and no brunch crowd. TBH, I was looking…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyZ01UdmdBRRAB",
            "text": "Service was very good, was my first visit. Food was good....the only thing I didn't like was that the band was really loud I had to shout to the person right next to me"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDc0o2bERREAE",
            "text": "Food was amazing, we order churrasco , pechuga rellena de maduro and pork chops. It was really tasty my favorite was the churrasco!! I will be back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNaFAzUEh3EAE",
            "text": "We love going to this place their food is always on point, same for drinks. Love their wings appetizer and the Churrasco, I always get mine well done, even though in the picture looks darker than what really was. It was just perfect. My favorite drink there is the mixed berries sangria."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqX0pUbUVnEAE",
            "text": "Went here for a date on a Saturday night. The food was to dieeeeeeeee for! The portions were huge I feel like I barely made a dent in my fajitas. The drinks were delicious and strong enough for a little buzz. My fiancé got the churrasco which was cooked medium well to perfection and I had the mixed fajitas which came with shrimp, chicken and steak which I could not finish because of all the delicious food that came with the order.\n\nFor the drinks we had a mojito and a margarita which were both super good. Also the bathroom was suuuuper beautiful!!! The staff was attentive and we were seated quickly."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdUlLS2JBEAE",
            "text": "Service was a bit spotty, the chips could be a bit better, and the fajitas weren’t too special. But the house special margarita was excellent, and the chicken stuffed with plantains is a marvelous dish."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobmEtVExREAE",
            "text": "Guadalupe Bar and Grill, located in the heart of Inwood, NYC, is a Mexican restaurant that delivers authentic flavors in a casual atmosphere. The vibrant and colorful decor is welcoming and cozy, creating a perfect backdrop for a relaxed and enjoyable meal.\n\nThe menu is a mix of classic Mexican dishes and innovative creations, with an emphasis on fresh ingredients and bold flavors. The chile relleno, a dish of stuffed peppers, is expertly executed with a crispy exterior and a flavorful filling that is not too heavy or spicy. The tacos al pastor, made with juicy pork marinated in achiote and pineapple, are a must-try for anyone looking for a delicious and authentic taste of Mexico.\n\nThe drink menu at Guadalupe Bar and Grill is equally impressive, with a wide selection of tequilas, mezcals, and margaritas, as well as a great selection of Mexican beers. The cocktails are expertly mixed, with a perfect balance of sweetness, acidity, and tequila.\n\nBut what really makes Guadalupe Bar and Grill stand out is the friendly and attentive service. The staff is knowledgeable and passionate about the food and drink they serve, and they are happy to make recommendations and share their expertise.\n\nIn conclusion, Guadalupe Bar and Grill is a top-notch Mexican restaurant in Inwood, NYC, with a relaxed atmosphere, great food, and excellent service. It's the perfect spot for a casual night out or a cozy dinner with friends and family."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtc2JxaWFREAE",
            "text": "This place is amazing to spend time with your family, they accommodate my child. The staff is great.…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxazdXU1VnEAE",
            "text": "Muy buen ambiente, buenos precios...amable personal, comida muy buena. Excelente música en vivo"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMFBPeWp3RRAB",
            "text": "No tienen hookah pero la comida y el\nServicio son excelentes hoy sabado el\nCantante en vivo bohemio me encanta 😻"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJN29EaWlBRRAB",
            "text": "Always go for the same dish, their churrasco is delicious. They cooked for you exactly how you order it. I ask for a side of salad and they accommodate me the best they can, which i love the salad. Didn't order the dressing on the side, and that was the way they presented."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMzVibmV3EAE",
            "text": "Attention was amazing! Was seated quickly and the staff were very friendly. Joan was our server and he made very good recommendations."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNFlxa013EAE",
            "text": "Place looks very good, but service is bad, food is really with no taste, drinks even worst, plus the prices are ridiculous high.  When I walked to a place that looks and have a good ratings I will expect a lot more.  I order a sangria that…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRaXZiMW5nRRAB",
            "text": "Hands down the food the drinks the staff I love ❤ it all I don't mind traveling for this so goodddddd"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5NklmUUJnEAE",
            "text": "Got a quick at-home take away happy hour of a frozen and on the rocks classic margaritas and chips and guacamole tonight. It was just what we needed. And what a delicious margarita!! And perfect guac!! Thank you so much."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndG83U053EAE",
            "text": "This place has some bomb ass steak.. on Wednesday they have lobster/steak/shrimp for the low..…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBa1p5aDhBRRAB",
            "text": "First tine here and loved it, the food is superb and surpassed my expectations"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3ODVtLXh3RRAB",
            "text": "I visited Guadalupe's today as a last resort when my original place wasn't open. It turned out to be a great experience. The food is delicious (the ceviche is not peruvian style ceviche). What really impressed me were the drinks. Delicious…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwd2RtX0R3EAE",
            "text": "Mi experiencia en este restaurante fue decepcionante. Pedí el churrasco y la carne estaba claramente vieja y tenía un sabor rancio, lo que arruinó completamente mi comida. No entiendo cómo alguien puede servir algo así a sus clientes. No vuelvo nunca más"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLeGRTZ2hRRRAB",
            "text": "Our server Halil was the best!!\nVery personable, nice,  made sure our order was perfect\nRecommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ejRyTndBRRAB",
            "text": "The food it was delicious specially  b’ steaks  love it i really recommend them"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvOVlqNVN3EAE",
            "text": "Best fried calamari I've tried anywhere. Service is fast and friendly most of all the the food and drinks are great."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrbFl6cTRRRRAB",
            "text": "Service by both bartenders was excellent.  Food had great flavors, cocktails are well made, best happy hour Uptown."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrNDhlM0hREAE",
            "text": "Great place, good environment awesome service. I will definitely go back again with my family"
        }
    ],
    "reviews_count": 70
}