{
    "name": "El Tanque Trattoria Bar",
    "place_id": "ChIJJcp16iL1wokRmgcBqwUrQVM",
    "grid": "MN12",
    "address": "101 Sherman Ave Suite 3, New York, NY 10034, USA",
    "rating": 4.9,
    "user_ratings_total": 728,
    "phone_number": "(646) 559-0243",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWVRIUlJPV0ZwYVUxMVVrNW9aakJKVFZWUlNIYxAB",
            "text": "Amazing! I can’t wait to go back and have more of their dishes. And the waiter was very friendly and kind. No complaints. Amazing vibes. Music is good. Will be coming back!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQmVWUnJSVjlaVlV0cVdGQkxYMFV6Wm1STFVFRRAB",
            "text": "Great place, food is amazing, and our waiter Michael was the sweetest !! Very homey place! Definitely recommend !!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdmEwMDFkRzR3WTNST1kwRk5kelpQUjJzNFRrRRAB",
            "text": "The food is incredible!!! The pasta was perfectly cooked so it has a good texture. The pizza had various flavors and textures at the same time, and they went well together! I’ll definitely come again .. 🤩🤩 너무 맛있어서 나만 알고 싶은 맛집 !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSemFGZFllbU5NV2tWalFYRnpOVlZ2T1RadFZWRRAB",
            "text": "El Tanque Trattoria Bar is one of my absolute favorite spots in the city.\nThe pasta frutti di mare is always perfection — rich, flavorful, and beautifully made. Their Negronis are unmatched, especially the white Negroni, which has become my go-to.\n\nWhether it’s date night, brunch with the girls, or a quick lunch stop, El Tanque never misses. The chicken sandwich is a hidden gem, happy hour is unbeatable, and the branzino is absolutely delicious.\n\nWhat makes it even better is the versatility - it’s effortlessly casual yet upscale, perfect for any vibe. I’ve brought my boyfriend, my mom, and my friends, and everyone leaves obsessed.\n\nSpecial thanks to Michael at the bar — he always makes it a one-of-a-kind experience with his warmth, attention, and perfectly balanced drinks.\n\nEl Tanque is the kind of place that keeps you coming back again and again."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVExVRlpWRWR2YkhKS1ZFOW1VRVZUVTIxdlgzYxAB",
            "text": "La pizza tanque 56 estuvo excelente, mi trago por igual. Fue preparado por la bartender Paola, muy profesional y amable. Regresaré pronto. 👍"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRFRsRkRjVGRDY25Wa05UbE5WR0ZWVUU1SU1GRRAB",
            "text": "The chicken pesto pizza was amazing. So fresh and super delicious. I’ll definitely be coming back. Cozy ambience and beautiful ceiling decor made the space feel warm and inviting.\n\nThe music selection was perfect and the bartender Michael made us feel right at home. Gracias."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kcGRIWTFaVVF6TUVkc05rdE5UR2w1UkVWZmNuYxAB",
            "text": "Michael is the best host and bartender in the area. I 100% recommended this restaurant and bar"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNM1ExWm1jbU5hZGpVNVFWOXdUazQ0UW14cE0wRRAB",
            "text": "La atención de Paola es la mejor. Es muy amable y simpática. Recomendó el trago perfecto, Luna de miel. Me encantó la pizza el tanque 56 y por último el postre de Helados Bon. Todo fue delicioso y me hizo sentir como en casa."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kcVQxaGhhazg1YVRsQ2FuZGliazVTTlRkaGFtYxAB",
            "text": "I am unsure why this place has so many positive reviews. The portion sizes are ridiculously small and the service is some of the worst I’ve experienced in the city."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRVNqUXRTM1ppZUhselZXOTJZbGhuUWtOTU9VRRAB",
            "text": "This place does everything right!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFd1kyWmpNbmRCTFhkd01XSnVTbW8wVlhZMVIwRRAB",
            "text": "Absolutely incredible! Every dish was bursting with flavor — fresh, perfectly seasoned, and beautifully presented. The staff was lovely and the vibe cozy and authentic. Easily one of the best meals I’ve had in ages. Highly recommend El Tanque Trattoria Bar!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCd1pXOVJiMlJUYVdocFQxOVdWekpSWHpKNGRFRRAB",
            "text": "The best pizza and drinks"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUlRGUnJYMVUzYVVReU4yeDVWR05xVUVoNlRYYxAB",
            "text": "I love the environment and customer service! Especially my guy Michael who holds us down during our Wednesday runs!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdWNFWXRaVVo2V2s5ek5ERm1PVE5SVm1OdWFVRRAB",
            "text": "I Iove the food and the atmosphere every time I visit!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc04xSkhVWEpwT1doTmVTMXdhMWt5YVdwWloxRRAB",
            "text": "I love this Spot great food, and drinks especially after a long day. Great happy hour as well.😎💪🏾💯💯💯"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsc1ZuTldUMGcxVm1aNFlWazNWblZSU2psa2FrRRAB",
            "text": "Love this place, the dishes and drinks are great. Runner friendly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GS1gwaDFOekY1VXpnMFpsOTROamhaTUhoMlZFRRAB",
            "text": "Great food and vibes always 🔥❤️‍🔥"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUUxUWkRhRmRGVFVoRU5GcFdZMVZmYmxNMFFVRRAB",
            "text": "I recently Booked this Restaurant for a friend's Birthday Brunch, We had an amazing time the food was excellent and the Sangia's were delicious 😋, Our server Michael was very attentive and accommodating.   My Penne Vodka was delicious,  had the empanadas to start , all delicious and cooked to perfection. All my friends had a Variety of dishes , steak and eggs,  the Teriyaki Salmon, etc..  All of us just kept saying how good the food was. We did the 90 min Unlimited brunch and our Server Michael made sure that we didnt go empty throughout our stay.. Me and my friends will definitely come back in the near future to try all the other cocktails we saw on the menu!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCV2FFZGZVamRwV1hWeldGTktaRkZhZUdKTk1HYxAB",
            "text": "Michael was really great. On time great drinks. Great service"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sd2IxRmZVRFpmT1UxSVkxVjZaRkpXYWpaM05XYxAB",
            "text": "Me encantó mi ribeye steak con vegetales. Y el servicio de Paola 🙌 excelente."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMFRYVnpjbTlNWkdOMFgwVTNPR0o1U0VkSVYxRRAB",
            "text": "Had dinner here the other night, and it was wonderful! I tried the skirt steak and the Meat Lovers pizza, both were excellent. Shoutout to Paola, the bartender. Her service and recommendations were on point."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVGJreHhlRll6WjJkVVZtVmhOMlJvVEd4NmVrRRAB",
            "text": "The restaurant and service is soo good and it’s very cute and cozy inside movies and books on the ceiling of the bar very asthenic ceiling and the food was very good."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUVpuRkNZa0pwVTBaTGNHazRXVEZxVFVSaFdXYxAB",
            "text": "I had a lovey experience here for a birthday dinner! Paola was an amazing server and was attentive the entire evening! We recommend this establishment all around."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRFRtUjZORXg0YVMxQ2NHNUNhV05RYm1oUVlWRRAB",
            "text": "Paola is the GOAT! Went to celebrate a friend’s birthday and the vibes were amazing. The fries are sooooooo good."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeGVYVklORzFVYkY5T1QxaEtSbHBMUkdaVVEzYxAB",
            "text": "The staff was so kind, helpful, and our server paola was so kind! It was my friend's birthday and she brought out multiple sparklers, free ice cream, and was so accommodating with the cake we bought. Food was also delicious. LOVES THE FRIES OMG. Will be visiting again"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeU5WWjNaME5yUkVFM2JGSmhPVEpxVWxBNFVYYxAB",
            "text": "Had such a fun time celebrating a friend Paola was a great server very timely and accommodating. Definitely would recommend"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRlltRm1WMWh2UlZOUFVISjNSMlJ5ZDJwbGRGRRAB",
            "text": "I had an amazing experience at this Italian restaurant! The pizza was absolutely delicious — perfectly crispy crust, rich sauce, and fresh toppings that tasted straight out of Italy. The drinks were just as impressive — well-balanced, refreshing, and made with real care.\n\nA special shoutout to Paola, the bartender — she’s incredibly friendly and made the whole experience even better. Her attention to detail and great attitude really stood out. You can tell she loves what she does."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMVNETk5NalZ3VFZaVE1WRlhabk5FTFRWb1lYYxAB",
            "text": "El Tanque Trattoria is incredibly expensive and so you would think what is pictured and described is what you would receive. Not so. I ordered a BBQ Chicken pizza. With tax and tip the cost was $36 ! For a pizza ! This is crazy. The pizza was average at best. Average crust and the chicken had little flavor, tasting like a generic plastic wrapped chicken you get at the grocery store. What's worse was there was little to no BBQ sauce on the pizza. I was a bit worried this would happen and was about to ask for Xtra BBQ sauce but was afraid I'd be charged more than the $36 I already spent. First world problem? Sure. Then again, this is a working class neighborhood and money is hard won. Perhaps the quality of the food is different at the restaurant but the pizza I got gets 1 STAR only."
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ScU5sRktkVFkyY2pCNFpHOVVNbUZHY1hOalpVRRAB",
            "text": "Gracias Michael por brindarnos un servicio de calidad..volvere muchas veces mas ahi se siente un ambiente de paz...lo recomiendo ampliamente\n."
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FM09EQnNWRUk0WW1nM1dqbGpjR2x5YkZJNGNtYxAB",
            "text": "Me encantooo mucho todo..la sangria la comida y la.arenxion de Michael fue lo mejor.."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WmRHWkNiV0p1WnpCeGNUaFRSVVpCZEdSTU9IYxAB",
            "text": "In love of this place\nMichael has a great customer service 💪🏻💪🏻"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGT1ZXNXdhVTFoV1RCNWQwWXlVSEZHVGpWV1JWRRAB",
            "text": "Went here for the first time on Friday and this restaurant is fantastic. We don’t have a lot of good restaurants uptown BUT this place is awesome."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNVJYaFdRVEpTU1V4cFVrdHNRMDAyU1hGU2RuYxAB",
            "text": "Had this place saved to come for awhile but never made it. Today on a random Friday, my friend & I was in the mood for a really good cocktail not no typical cheap HH one. Decided to come by since we were in the area & believe me when I say we are so glad we did! Michael the bartender was amazing, this man def knows how to make drinks! Specialty ones at that! If you ever want a high quality drink at an amazing price, please come here! The owner Robert was sitting at the bar with us the entire time making sure everything was up to par, from the customer service to the delicious pizza & pasta we had such an amazing experience. Even Fabiola was amazing, this is the owners friend who was having dinner at the bar next to us made us feel such at home. We will definitely be back! (The sangria tho!!!)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sblVWTkVSeTFuWDNWS0xXRmxPREl6UTNsTmIzYxAB",
            "text": "This is place is a GEM on this side of towm (Inwood). The drinks are amazing MIKE is a gifted bartender ( Yes I said GIFTED) Everyone from the owners, to the chef, to the waiters and bus boys are so pleasant and welcoming. Love place and will keep coming back as I watch them grow! COME check them out and you're welcome."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBNVpXNHRNRTlFWTJkSmNubENPRzVEVm1sdk4xRRAB",
            "text": "This restaurant truly exceeded my expectations. The cuisine was excellent each dish was well prepared, flavorful, and beautifully presented. The drinks were of the same high quality, crafted with care and perfectly balanced. The ambiance created a warm and enjoyable atmosphere, while the attentive service made the experience even better. A wonderful place to enjoy both fine food and drinks highly recommend it. Try any drinks with tequila or mezcal 😉 thanks to the best bartender in uptown Michael"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GS1NsRk9hRTlwTVVweVVrUnJTekE0WlcxM2FsRRAB",
            "text": "This place is super cute and the pizza bianci is 👍🏻. The HH doesn't hurt the wallet 😎 🤑\nMichael makes a yummy April Spritz, too!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMFZWVXlSa1kwY1VoaFJtTkhPVXRtYWtaaVpGRRAB",
            "text": "Uno de los sitios más tranquilos de Inwood, gracias Michael por las atenciones!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeFJYWkRMUzEyTVdKTlYwaENhV295V0V4TFMxRRAB",
            "text": "We had a great time and will be returning. Food was so good, we ordered the Dominican Power pizza and baked clams for appetizer, and shared lasagna, carbonara pasta, and the seafood pasta. Everything was delicious, but our all time favorite was the carbonara. Wow! Michael was an excellent server, and he makes killer drinks. Can't wait to come back. Decent prices, food is amazing!!\nAlso the decor and especially bathroom is really cool, check it out if you're there"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veE9XNU5SbVpMVEUxbGRsSmlPVmhCVDBOdE4zYxAB",
            "text": "Excelente lugar, muy acogedor.\nBuena comida, ricos postres, todo tipo de bebidas; un personal muy amable y atento.\nLos recomiendo."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVmEybDRaVUZwZUdKaWRFNXBSMjg0ZVZGcVlrRRAB",
            "text": "Excelente servicio y un personal capacitado, excelente  comidas . Gracias a Michael   Con su servicio."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMExUVkZXSE5rYUZSb2RXUXdiRmsxWVZSc1lVRRAB",
            "text": "Excellent food, good service and a nice place. The best"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kemRrMUJMVGhPVkRkS1owdFFiVlZIZFdoMFIzYxAB",
            "text": "Celebrated my husbands birthday with a party of 11 individuals. Made reservations ahead of time and planned accordingly with Paola.  We greatly enjoyed our 3+ hour dining experience ordering appetizers, pizzas, different entrees, drinks, etc. the food was delicious and the environment was beautifully delicate. Paola provided outstanding service and catered to our needs. Definitely recommend this location. Can’t wait to go back when I visit NY.\n\nThank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVmIyTm5iMFZDYjBodVFYTTNWMk4yYVZZMGVHYxAB",
            "text": "Food was great and tasted freshly made! We got the pollo al limon and the soup. Music is not too loud so you can enjoy the conversation. We were served by Michael who was super nice.  Will be coming back!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210U1IzQmlkMFV6V1VNNFJ6TTBka3d6WmxWMmQzYxAB",
            "text": "Que experiencia más chula! Esta es mi segunda ves en El Tanque. La comida, los tragos y el servicio de Michael son 1A!!!! El churrasco estuvo ricooo y los calamares ni se diga. Este es mi nuevo lugar favorito."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbFRIQXlYMjkwTFRJelVHeExTMHhhUWxwcFRsRRAB",
            "text": "Everything about this place was amazing. Best service, the food was delicious and the ambiance was great. Paola was amazing, she was genuine and so kind. Service was one of the best I’ve had. I would definitely come back to this spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSlowNUxha3B2ZDI5d2NYSjFSV1kzWHpac2FIYxAB",
            "text": "This such an amazing atmosphere!!!! Michael is great and made us amazing drinks and was so attentive. The food was delicious.I cannot wait to come back!!!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMmVIVjJNR1JCTkVvdGRFOU5SSEJhVTNkWlMyYxAB",
            "text": "Michael lo ma mejoL… buen servicio. Comida buenisisima. 100% recomendado."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbmRsTmhVR1UwTWpsU1lYVmtjSGx3VTJ4aE5WRRAB",
            "text": "Awesome food and service!\nMichael is really welcoming and patient👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMmRXVlBabGhxTXpkTVowVk5hbmwwVFhwNlpGRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nI went to El Tanque with my sister-in-law and had an amazing time! The food was absolutely over the top everything was delicious. And the tamarindo margarita? Unforgettable! I would recommend this place with my eyes closed. Definitely a spot worth coming back to!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxalgwSmlkVWw0UmpCaVgwVlZjbEpaV0ZBNFZIYxAB",
            "text": "Pizza was delicious! Hadn’t eaten all day while seeing MET cloisters and my husband and I each ate a whole pizza afterwards. Tasty!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KU2NGUldWa0p2YjJReVVFNTBlRlpxWWxWUVRtYxAB",
            "text": "This place is absolutely charming, with incredibly intricate decor. The food and drinks were fantastic, complemented by attentive service. The bartender, who is also the co-owner, exuded an amazing vibe. His passion for crafting unique cocktails was evident in every pour. This venue deserves greater recognition; it’s quite rare to find a spot in this area where you aren’t overwhelmed by loud hookah and music. I would definitely recommend coming here for a nice date night, or even a low-key night with friends."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214b2NWQmZSMWxFY3psQk5FbGFlVVphYkZnMGFHYxAB",
            "text": "Stopped by El Tanque on Sherman Ave and was really impressed. The pizza was fantastic — perfectly cooked, flavorful, and just the right texture. The decor adds a warm, stylish touch to the space, and the service was attentive without being overbearing. I came in hoping to try the squid ink spaghetti, but since they were out, I went with the pizza instead. Honestly, I’m glad I did — it was that good. I’ll definitely be back to try more of the menu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUGVrRmFhVmx4WVVSdU1EY3hRMGcwZERKeFgyYxAB",
            "text": "Absolutely love the fusion of these two cuisines at this spot. Really interesting fusion pizza pies. Legit Italian dishes like the charcuterie, the octopus, the baked clams are a must try as well. Had so much fun on a nice little pizza date here last week."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMWJUaHRaR1YyWjFKbFR6TmhkbWxSZVdSWFNrRRAB",
            "text": "This place is easy to miss when walking by, but such a gem in Inwood!\nThe food is soooooo good and the portions are generous. Their food happy hour is $9 which is perfect for stopping by when i’m too lazy to cook, haha.\nFrom the super cute books on the ceiling to the awesome bartender Michael which makes the vibe even more chill, this place is a must! It’s a perfect, fancy enough for a sexy date and relaxed enough for a casual pop in."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVk1IZHhNVGRCTTJWb2FUQTFjbGhMTUd0SlkxRRAB",
            "text": "Visiting NY for the weekend , and my family and I needed a good spot to eat after touring The Met Museum, and I stumbled across this gem. I love the atmosphere, it’s chic and refreshing. The service was great. My server Paola was attentive to detail, polite and efficient. The food was delicious! We had the cheese and beef empanadas to start ,  that were crispy but not overdone. My cousin and I had the Lasagna that was seasoned to perfection with just the right amount of cheese. I also had a mixed green salad that was fresh and a satisfying portion for a side. My aunt had the chorizo fried rice and loved it. We also shared the warm bread pudding topped with caramel drizzle and the side of  vanilla ice cream and fresh sliced strawberries was the perfect end to our meal! Thank you to the Owner , (I’m assuming he was the owner or manager) who came over to ask us about our experience and checking on us at well. Overall a top tier experience and I can’t wait to come again when I’m back in town !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGZmRrcEVkV040YVRjMFpXaGFWbEZVVnpCeFRHYxAB",
            "text": "I can’t sing this place enough praises. It’s cozy, vibey, the service is great and the food is to die for. What I had today, the pizza El Tanque 56, never disappoints but when they brought my son’s shrimp and tostones appetizer, I couldn’t help but order a plate for myself. I fell in love with tostones all over again because of the shrimp and that aioli. My husband had a pasta with seafood that was also yummy but I can’t remember the name of the dish. As for the drinks I had an Apperol Spritz and a Limoncello Spritz. 10/10 everything"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5V2MzWmFiV280UlhCVmJtaFNjM1p6TkRSTk1XYxAB",
            "text": "Excellent restaurant for a relax afternoon… food was exquisite. MUST try el tranque 56 pizza and even as simple as it sounds penne alla vodka was super delicious. The food is freshly made and the drinks are on point!!\nWhen coming yo the restaurant ask for Paola. She is the best! She will give you a professional and cordial treat .\nThis small, cozy place is a MUST visit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd3ZUMUNBEAE",
            "text": "Very nice place! Food was delicious, atmosphere was very chill and the drinks were amazing. Will be coming back here for the shrimp and tostones 😋"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMDZmWTV3RRAB",
            "text": "Had a good time tonight Paola was amazing she had good recommendations and the pizza was great! Nice crispy crust fresh toppings. I will def be back.\n\nCame back here again today! Had the meatballs the bartender Michael suggested and they were delicious the marinara is to die for! He makes great drinks!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbk5Ya3pBRRAB",
            "text": "I don't always experience great food and great service and decor in the same place so wanted to share this hidden gem in the hopes they do well.\n\nBut not toooo well I want to be able to get in. El Tanque is located in Inwood and has mainly italian food with a Dominican twist.\n\nThey do weekday happy hour till 7pm in restaurant, 9pm in the bar on food and drink.\n\nI had two pizzas which were light and delicious and a sangria and limoncello spritz I will make sure to order again.\n\nWhile the bartender wasn't aware of our 16-person reservation, he let on no surprise or annoyance. Instead, he jumped into action and came up with a plan even if it meant him having to juggle 16 people's orders on his own. He was never rude or let on any kind of attitude. He was patient as people reviewed the menu and truly made us all feel taken care of. We ended up staying long past happy hour. He knew what each person had and even let us all pay separately! Unheard of!\n\nI have sent friends since then and they all have commented on how hard the staff works and how much they clearly want to please.\n\nMy friend is librarian and fell in love with the decor. There are so many small touches you can tell the owners took their time to make this neighborhood restaurant just right.\n\nIt is one of my new favorites and I can't wait to go back!\n\nMichael at the bar was also our server and did a great job handling my group. THANK YOU, Michael and the other staff that later came to help!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMU92SWJnEAE",
            "text": "Astonishing food, service and setting! El Tanque Trattoria is a find!\n\nWe were warmly greeted as soon as we entered and seated at a cozy table with a window view. This sweetly decorated, intimate, unassuming spot, exudes tons of charm and serves up perfectly prepared food.\n\nI ordered a pizza, which was delicious, and paired perfectly with a skillfully prepared, Dirty Martini. Mr. Wonderful had a hamburger with hot, crisp fries and a draft beer. We also shared a house salad with two delectable dressings.\n\nNote: Check out the books on the ceiling and the secret bookcase door to the restroom = charming!\n\nEl Tanque Trattoria has a place in our hearts and a spot on our “favorites place” list, for when we return."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa08tMHhRRRAB",
            "text": "Restaurant is small but very charming. The service was amazing! Daisy (our waitress) was so accommodating and vibed really well with us. We ordered the wings which were really good, as well as the Tanque 56 & the Dominican Power pizzas. Both pizzas were delicious but the Dominican Power pizza, which was basically a chimi on a pizza, was SO GOOD! We also got a pitcher of sangria which was so refreshing and gave us all a nice little buzz. I would definitely come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBM1FsbzROV05QVjFCdlJXaGtXbkZOV0dwVE0zYxAB",
            "text": "I can’t say enough good things about this place! Michael made our night with his amazing service and top-notch drinks—he really knows how to make you feel welcome and taken care of. The chef is just as impressive—the food is absolutely delicious, with a perfect blend of Italian and Dominican flavors that’s hard to find anywhere else.\n\nTheir happy hour is a gem in the neighborhood: not only are the drinks affordable, but they also have a great variety of food options (which is rare around here!). It’s one of those spots where you can come for the specials and stay because everything—from the atmosphere to the service—is just that good. Highly recommend checking it out!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOeWNHUnpjazkwUVZnd1kwVkNVbFJ2WVhZNVRFRRAB",
            "text": "Second time coming back to El Tanque, Miguel was outstanding server and bartender! He was incredibly attentive, always checking in without being intrusive, and super helpful with the menu – his recommendations were spot on. On top of that, he’s great at conversation and made the whole experience feel welcoming and enjoyable so growing up in the neighborhood this is honestly rare! My sister and I had to come back. Definitely one of the best service experiences I’ve had in a long time. Can’t wait to be back❤️"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OU1kwcHFiMk5yT0hsV2JYQlFOV2h2UVRod1JIYxAB",
            "text": "Los cocteles deliciosos! Excelente servicio, Paola es lo máximo. Si les gustan los cocteles dulces y refrescantes recomiendo 100%  La Boheme!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcUpmeGNBEAE",
            "text": "I’d give this restaurant 10 stars if I could! The food is incredibly delicious, the service is impeccable and Luis & Adonis made us the best drinks - we ordered the Boheme and Turandot. The pizza tasted very authentic from the sauce down to the toppings. Highly recommend this place if you like great music and food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc2JIbFlZbTFtYkhkalYwTmxXRWhmVUVsM1drRRAB",
            "text": "What a wonderfully cozy place! Definitely highly recommended. The food the drinks the service everything was wonderful. Our server Paola was so wonderful and kind. Servers like this don’t exist anymore. So gracious and generous she even gave us a dessert on the house because one of our dishes wasn’t right. Lovely!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eWJHS19nRRAB",
            "text": "I visited El Tanque Trattoria for drinks and apps, the place is very unique. The sangria and margaritas were GREAT & the pasta (penne in vodka sauce) was DELICIOUS. Adonis our waiter/bartender was friendly, very attentive and made AMAZING drinks. I highly recommend visiting this restaurant/bar. HH specials and drinks are well worth it! I did not take a picture of it but the Creme Brulee dessert is to die for!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNkxpMHpnRRAB",
            "text": "The restaurant itself is one of a kind the concept is amazing I felt in love with it. We choose the Dominican power and tanque 56 pizzas. It was on a other word !! Our server Luis took goood care of us. I recommend the restaurant 100%"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaZ3Zhc1pBEAE",
            "text": "The food was so good! Every dish we ordered, we enjoyed. The drinks were very cute, creative, delicious and strong! I definitely would recommend this restaurant. Our waiter was very attentive and she helped recommend foods and drinks for us."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEZzRqOU5nEAE",
            "text": "Excellent service, came from NJ just to try their pizzas, Miguel and Adonis are the best! Drinks are 20/10, the place is beautiful for social media photos! And the Creme Brulee was so good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbEptMDBnRRAB",
            "text": "When Italy (🇮🇹) meets DR (🇩🇴) 🫶🏽\n\nMy family and I went out to celebrate a birthday on Monday, and we all love to indulge in a good feast.\n\nPlace is small, cozy, and has a homey vibe. It's a great spot to dine with family or catch up with a friend. The food and drinks were delicious. To end the night we had some delicious fresh dessert of crème brûlée 😍 to die for!\n\nHope this place stays longer around the neighborhood!🫶🏽\n\nOur server Adonis was great; be sure to ask for him! 👍🏽"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbU5uUkdRakp0VldwM1dISk1iSGhmZDBoZlJYYxAB",
            "text": "Waoo la mejor comida sin duda esa combinación Italian-Dominican I loved, el servicios los cócteleslo mejor , paola muy servicial te hace sentir muy especial, el espacio muy acogedor un ambiente relax un vibes tranquilo las pizza the best .. 4 formaggi, prosciutto crudo e rugula, la malcriada, el tanque 😍😍😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MGRyMHp3RRAB",
            "text": "I loved the service, Luis is such a great server, he is one of the best assets of this place and the bartender!! Such a great energy he cares about his customers! lots of details, carefully picked and everything is well thought every cocktail is an experience!! Do not skip the luna de mielle, the burrata is espectacular will def come back! I loved this place. Be ready to hear the best of the Dominican Music !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkM3RHdjJnRRAB",
            "text": "Cute and cozy lil place in the Inwood area. Went on a Friday for quick dinner Adonis was our server respectful, very attentive and friendly. The restaurant has a nice ambience and decor. Good music that allows you to have a conversation.\nThe drinks are cute we had Luna the Miel, la Boheme and a classy dirty martini although it was not on the menu they made it for me, which was great. Both kinda de miel and La Boheme are very girl refreshing satisfying drinks.\nThe pizza portions are are good for two is you are not too hungry.\nThe pasta Carbonata was satisfying as well very subtle flavor and good portion. The  Funghi pizza was amazing. The Dominican Power was good although I wish it had a lil more of the chimi sauce.\nOver all a place I recommend work, family or friends. Will definitely come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkd1AyRzlnRRAB",
            "text": "From the moment I walked into El Tanque Trattoria Bar i was greeted with the irresistible aroma of freshly baked pizza… I indulged in a culinary journey starting with fried seafood and zucchini, then unique and flavorful octopus with potatoes  – tender, perfectly seasoned, and a true delight for the taste buds. The main course featured a pizza that was simply divine; unfortunately, its deliciousness left me too captivated to remember to snap a photo! Each bite was a symphony of flavors, with a perfectly crispy crust and fresh, quality toppings. And what is the most important I can customize pizza with cauliflower crust ! 🤗As if that wasn't enough, the burger was a revelation, juicy and bursting with savory goodness. The cozy atmosphere and friendly staff immediately made me feel at home. The menu offered a wide variety of mouthwatering pizzas, pastas each as delicious as the next. The service was impeccable, and the staff went above and beyond to ensure a memorable dining experience. I highly recommend this place for anyone looking for a delightful combination of amazing food and warm hospitality and great music . 🤩"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkeDZLdjVRRRAB",
            "text": "A fusion you need to check out ASAP 🇮🇹🇩🇴\n\nThis is an Italian restaurant with Dominican influence located in Washington Heights that’ll blow your taste buds!\n\nThey have a menu filled with delicious dishes to try from starters to pizzas, pastas & more! You can never go wrong with a Burrata & The El Tanque 56 is a must bringing Dominican flavors into pizza like nothing before. The drinks are super cute & taste amazing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdVNqRnJSbWhUY0RGRWR6SlFkM3BCT0ZkbGNtYxAB",
            "text": "This was my first time coming here and the service was amazing! Our server Michael was very professional, kind and attentive. The food and drinks were delicious! I will definitely come back."
        }
    ],
    "reviews_count": 78
}