{
    "name": "Unique",
    "place_id": "ChIJEyAHVazzwokRqeDuj6t3bvo",
    "grid": "MN12",
    "address": "586 W 207th St, New York, NY 10034, USA",
    "rating": 4.8,
    "user_ratings_total": 178,
    "phone_number": "(212) 451-9556",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUUxWRlNjQzFSU0RCdFRUUktVRUp4V1hkYVZsRRAB",
            "text": "Always delicious this is the only decent Thai place in Inwood. It’s far better than yummy Thai. It can take a while at busy times as they are a two person operation. We love the classics which are always consistent and well prepared."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOZlUyaHFRMjFwUVZwRlIzTmpRa0owTkZnMU5sRRAB",
            "text": "Service was nice but messed up quite a few of our orders. Otherwise food was quite good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOemRGTkZObXd5V1c1UWR6aDVNMEZuTURjMFZFRRAB",
            "text": "Enjoyed an excellent meal here. Delicious food, attentive service, nice atmosphere. We’ll be back! (We ordered mango salad, green curry with chicken, pad see ew with beef)."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNFFWVnFkVU53TURoUlNYTlNjRTR6YXpWaFNGRRAB",
            "text": "Excelente en todo, exquisita comida, una gran experiencia y gran atencion."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xweVZqbDFNVXczY1ZOcVNWcFhibGd4Y0ZOdlJFRRAB",
            "text": "I love this spot! Always treated nicely and the menu is phenomenal! I always try something different. Appetizers and meals are great and good portions, you can't go wrong and I never forget my thai tea!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21walYxWmtiSEE1TW5kTGMxVldXbll0U0dwTlpIYxAB",
            "text": "Surprisingly, one of the best Thai restaurants not just in uptown, but entire NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUFkyMTBTVGhzTTNOTVdFWnZYMnRNY0RVd2FtYxAB",
            "text": "Everything was amazing. The waitress, Bu, was so welcoming and nice. We had Drunken Noodle and chicken Cashew and Skewered chicken. It’s awesome"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGZlMydHNTMFJmVGtFeFJuQTBWbWxTYkZaWlRuYxAB",
            "text": "really good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NlQxQlNZelpOWldsWVpHNDVkMXB0YmtaSVJuYxAB",
            "text": "Food and green tea was great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWGFIZ3pWVkpzT1ZaRFpsRlRjbUpVVGpSNU1YYxAB",
            "text": "After four years in the neighborhood and trying almost every restaurant I can safely say that this has consistently been the best for takeout. Although there are a lot of delicious options in Inwood, if you have somebody visiting from out of town or need an option you know will be good, Unique gets it right every time.\n\nI’ve eaten in-person a couple of times for that super crunchy freshness if I want something fried, but it all travels well if you’re close by. What sets this place apart on top of the deliciousness of the food is the staff. They are so incredibly friendly, it’s a joy to come in.\n\nWhatever you order for your entrée, definitely order the appetizer sampler along with it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSDBxdEtzbTg3a1F3EAE",
            "text": "If you’re craving the perfect Thai food in New York City, Unique is the place to go. Famous for their authentic Thai cuisine, this spot delivers an incredible dining experience that feels both comforting and indulgent.\n\nOver the years I’ve tried most of their dishes, drunken noodles(extra spicy) with ice Thai tea latte, or Salmon steak with Coconut rice (or Jasmine rice if you like the sauce over the rice) are my favorites. But all their dishes are nothing short of amazing. Every bite had that satisfying flavors followed by melt-in-your-mouth goodness.\n\nThe portions were just right generous enough to leave you satisfied but not overly heavy, allowing you to fully enjoy every component of the meal without feeling overwhelmed.\n\nUnique doesn’t just serve great food it perfects a classic Thai dish with premium ingredients, expert execution, and thoughtfully portioned meals. Whether you’re a longtime Unique fan or trying it for the first time, this is a spot that will leave you completely satisfied and eager to return."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOSEoydjZxNk1tTDZ3RRAB",
            "text": "First time here and it was amazing! The waitress is so nice and polite. The food is incredible and fresh! The prices are so reasonable. Definitely coming back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZakxxYklBEAE",
            "text": "Best food in Inwood. We came here for lunch and it was so good that we had to come for dinner. The empanadas are great. My wife recommends the steak one. The sampler was also a joy. Could be enough for lunch of 2."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbU95T2RnEAE",
            "text": "Our favorite place in Inwood! Consistently delicious."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dDQzbmxnRRAB",
            "text": "Very tasty, fair prices"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdGREUlJBEAE",
            "text": "amazing lunch special, great, fresh food, friendly service, I’ll be back for sure!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReFBiekZREAE",
            "text": "Best asian food in INWOOD.  Clean, fast, consistent!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLVpqT09REAE",
            "text": "I dine here often as the food is always delicious and service is great!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcmJmS3F3RRAB",
            "text": "If you are anything like me, you might look at this place and be a little skeptical. After all, how many bad 'Thai fusion' places are there? Many. Most.\n\nWhat are the odds that a place on the East side of Broadway in Inwood is going to do it well? Not high, by my estimation. But I was very pleasantly surprised by Unique, which lives up to its name quite well.\n\nUnique serves both traditional Thai and fusion dishes. I had two of each: traditional dumplings and pad see ew; of the fusion dishes I had a salmon and a beef empanada. The dumplings and pad see ew were both competently done, but unremarkable. It is the fusion food where this restaurant really stands out. You can taste the passion in them. You can tell that the chef put a lot of work into his recipes and pushed his creativity. These are really the dishes that earn five stars from me.\n\nIf you enjoy Thai cuisine and you are willing to try something new, go here. You won't be disappointed."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmN3F1aFRREAE",
            "text": "You cannot simply judge a place by its fundamentals, and Unique is living proof. Its Thai iced tea, pad siew, and standard fare dumplings are perfectly solid. Its fusion foods, like the beef empanada and spicy salmon with deliciously spiced tomatoes are really creations of passion. Great waitress."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2X29qd2F3EAE",
            "text": "Cute and cozy neighborhood spot with lots of vegetarian options. Can recommend the eggplant tofu and mushroom empanadas."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcHVicEpREAE",
            "text": "EXCELLENT!! EXCELLENT!! EXCELLENT!!\nWe ordered a chicken noodle soup.....the brothers was amazing.  And Massaman Chicken....great proportions  and excellent flavor.\n\nThe waitress was nice too. She even explained the proper way to heat up the leftovers.  Highly recommend!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNWVUekRREAE",
            "text": "Great dishes, very authentic, I love the flavours. Service is excellent! 10/10"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzb095c1NnEAE",
            "text": "Such a great spot. Cozy, down-to-earth atmosphere with awesome service (thank you, Bu!) and good food. Perfect for a more intimate dinner. Highly recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbzhmdFhREAE",
            "text": "Unique is a fantastic spot for lunch! They offer a great lunch special that includes an appetizer, a soft drink, and a main course\nAll at a very reasonable price. The restaurant is vegetarian-friendly and accommodating for those with allergies.\n\nThe portion sizes are generous and filling, and though some dishes come with a bit of spice, I found it to be mild enough (personal preference). The food itself was absolutely delicious.\n\nThe atmosphere at Unique really stands out. The place has a cozy, welcoming vibe, super clean and nicely decorated. Overall, it’s a great choice for a tasty, satisfying, and enjoyable lunch!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeWYybDN3RRAB",
            "text": "Quality place, tasty food, best prices! 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIM2NmMEt3EAE",
            "text": "This is a cozy restaurant. I ordered the shrimp rolls, minced beef salad with sticky rice and the spicy eggplant with basil and tofu to go. The food is authentic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NmJLLVRREAE",
            "text": "Authentic pad see ew and great price"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMXN6dVFBEAE",
            "text": "Wonderful restaurant, I have been a loyal customer since they opened. The food is always delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqd2JHNDd3RRAB",
            "text": "The best food, best restaurant and the kindest people in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqN3VqTGtRRRAB",
            "text": "We LOVE coming here! We are regulars, and she remembers our orders. With that said, we have tried many things on the menu and have brought family there and every food item has been a hit. I love the chicken skewers and mango salad! Prices are very reasonable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaGFHNi1RRRAB",
            "text": "...a friend recommended this place to me...and I ordered in dinner.   OMG.   What an amazing Thai meal.   It isnt easy to find some actual Thai SPICE in Inwood...   Well..  This place has it.  I will definitely be ordering again...   Soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeUtqRFh3EAE",
            "text": "Very good food and hospitality. Loved the beef noodle soup, chicken cashew."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5aTctbVZBEAE",
            "text": "Fantastic food, VERY reasonably priced, with lovely service and nice decor, plus soft sophisticated jazz.  Could not ask for a better place anywhere in NYC, much less 1/2 block from Bway in this 'hood.  I had the shrimp over rice (not listed below)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dzluRW9RRRAB",
            "text": "I ordered take out and I was looking forward to this meal based on the reviews but found the food to be very mediocre."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eHJlYWxRRRAB",
            "text": "Excellent Thai food & service.  Lovely dining room."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cUl6REhnEAE",
            "text": "I agree with each and all five stars reviews which emphasize how truly special and outstanding this wonderful restaurant is, especially for the Inwood community.  The food is consistently phenomenal:  delicious, fresh, tasty, generous portions, beautifully presented and so reasonably priced!  What else can you add!  The ambience…. From the moment you enter you are transported to an oasis of calmness and serenity which is not easy to accomplish in the middle of the very busy surroundings.  All of this should be enough but, what truly sets them apart is the service.  Both sisters will always make sure to greet you with warmth, kindness and will never fail to make you feel like you are eating in an a cozy and welcoming environment.  I truly hope that they are here to stay!  Don’t wait!  Try them out!  You will not be disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0aGQzV0t3EAE",
            "text": "Best Vegetable Soup in Manhattan! Extremely friendly staff on the phone as well. There was a hiccup with the uber eats delivery and they handled it SO well. I really appreciated them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0NmY3V3JRRRAB",
            "text": "Food was awful"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOLXVQUlN3EAE",
            "text": "Great people, really busy place. Thanks for the service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOLU1iVzJnRRAB",
            "text": "Good place overall with excellent service. The mango salad was very good, and the dishes were solid. Great portions for the price especially."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWMjRyemRnEAE",
            "text": "The best of the best Thai food in the City."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWOWNEOWxRRRAB",
            "text": "A fantastic selection of food, flavorful and interesting selection.\n\nOne server, who seemed a little over-extended dealing with diners and a steady stream of takeout orders.\n\nWeird and unnecessary music - a selection of instrumental covers in a weird variety of genres, on a short, thus repetitive, loop.\n\nDefinitely worth a visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscGJuRWtBRRAB",
            "text": "Quiet atmosphere, friendly and efficient service, delicious food, reasonable prices. Many vegan options available."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMEtxQzJBRRAB",
            "text": "Fantastic food, service and pricing. The best place to eat out in Inwood!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1c2VpZU1nEAE",
            "text": "Cleaned the plates, it was so good!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NHU2ZVZ3EAE",
            "text": "Unique is unique! They truly have some of my favorite food in the neighborhood. Pick-up and delivery service provide a quick and pleasant experience. Drunken noodles are the best I’ve had in NY. Slow cooked pork tastes tender and homemade every time. I love this place and would recommend it to anyone!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMWJyTUNREAE",
            "text": "Food a service are excellent 👌"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNmRERnhRRRAB",
            "text": "Very good food!\nExcellent service!\nThank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOGJqUjd3RRAB",
            "text": "Food was ok. Customer service was great."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aS1MUEZBEAE",
            "text": "We went into this restaurant while looking around for Thai food. We came across this place in our search and decided to try it. Immediately we were greeted by our waitress who was very friendly and helpful with explaining the menu. We ordered the Thai iced tea and the Lychee Thai iced tea. Both were masterfully made and tasted amazing. The Thai iced tea was a little different than what we've had at other places, but we both agreed it was the best one we've tried yet. It had lots of flavor and wasn't too sweet. The Lychee Thai iced tea was very refreshing and slightly sweet but perfectly balanced.\n\nFor appetizers we got the Mango Salad, Pork Dumplings, and Steak Empanada. The Mango Salad was absolutely delicious. A little spicy, but the mix of flavors and textures really made it stand out. The Pork Dumplings were super flavorful and cooked to perfection. Lastly, the Steak Empanada is what really threw us off; it was phenomenal. I can't explain the flavor used in it, but it was something neither of us ever had before. It's almost like a licorice flavor that's present, mixed with everything else. Normally I'm put off by anything of the sort, but it worked so well. It was also equally cooked to perfection; crispy and flakey where it counts. You only get one, but the size of it is more than enough for an appetizer.\n\nFor entrees we got the Tiger Cry (medium rare) and the Spicy Eggplant Basil with Tofu (we added chicken). These dishes were incredible. The Tiger Cry was cooked perfectly to medium rare, and was full of so much flavor. The portion was also very generous especially considering the cost. The rice and vegetables were a bit plain, but I prefer that so that I can blend them with the steak.\n\nThe Spicy Eggplant Basil with Tofu and Chicken was also packed of flavor, although not as spicy as we expected. Still delicious overall, and it was also a generous portion. We barely finished all of our food.\n\nService was also exceptional. Our waitress Khob Khun Kha was perfect. She answered all of our questions clearly, concisely, and was just pleasant to interact with overall. She was also quick and accommodating.\n\nOverall, this place is an absolute must for anyone looking to try asian inspired dishes in the neighborhood. Cost wise it was way cheaper than we expected but the food and service surpassed our expectations by a longshot. We're planning to return very soon!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeDRqeUp3EAE",
            "text": "I simply cannot emphasize enough just how incredible this Thai food haven truly is! The staff here are absolutely phenomenal - they go above and beyond to make your experience exceptional. The art displayed throughout the venue is breathtaking and adds to the overall ambiance, creating a vibe that is both inspiring and welcoming.\n\nThe authentic Thai cuisine served here is beyond compare. Each dish is crafted to perfection, with a focus on quality and taste that is truly unparalleled. The flavors are rich and vibrant, transporting you straight to the streets of Thailand with every bite. The drinks are not only refreshing and delicious, but they also offer an amazing value for the exceptional quality you receive.\n\nIn summary, this establishment is the epitome of top-notch Thai dining, and I wholeheartedly encourage everyone to treat themselves to the extraordinary experience it offers. Trust me, you won't be disappointed!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaTVhUUFnEAE",
            "text": "A hidden gem in Inwood. Service was quick, food was hot and delicious. Lots of great Thai staples on the menu as well as some variety options. I definitely recommend dining in! Beer and wine are now on the menu!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhNGIyY3VBRRAB",
            "text": "Amazing food, we came up from Hell’s Kitchen to try this spot and it was well worth it. This is probably the best Thai food we’ve had in NYC, everything tasted fresh and flavorful.\n\nWe got the garlic beef with their ginger rice. The rice is the most incredible rice I’ve ever had. I can’t get over it. Also got drunken noodles with tofu which were also great. The noodles tasted very fresh.\n\nSpices were on the milder side, so if you usually go for medium spice, you can probably bear hot here.\n\nFour stars only because the portions felt a touch smaller than competitors but everything was great. We will be back!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzclA3eXZRRRAB",
            "text": "I have eaten here twice and love what I have had so far. The service is very good and friendly. I give it 4.5- I deducted a half star because it doesn't have alcohol"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNNy1Ya2tBRRAB",
            "text": "We recently dined at Unique, the new Asian fusion restaurant on West 207th Street near Broadway. The food is delicious, flavorful and unique. The service couldn’t have been nicer. This was my second visit.\n\nWe ordered the mango salad. As fresh and good as I’ve ever had. They toned down the heat to accommodate my wife’s preference for milder food. We also ordered steamed dumplings. Tender pillows of pork, ginger, garlic and cilantro. A scallop ceviche. Fresh, tender, we drank the tiger milk when finished. That good. Then we had some fall off the bone pork shoulder served with a delicate broth and jasmine rice. We ordered ginger rice as well. Quite tasty. Dessert was a treat. A black rice served with coconut and a small Thai custard (on the House). Plus a Pellegrino Limonata and a large seltzer. Total bill: $54.\n\nOn a return visit we tried the corn cakes (inexpensive appetizer...simple, sublime) and the lamb chops. Both were excellent.\n\nNo alcohol. Please visit. I’d like to see them\nThrive."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVbTZLenZnRRAB",
            "text": "Amazing food in a cozy place. Chef is very talented and satisfying guests request with care. Such a great new addition to the neighborhood with very good prices."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNHUzSDdRRRAB",
            "text": "Amazing service and delicious food. Me and my partner had the mango salad; shrimp thai fried rice. OMG mouth watering 🤌🏼 and prices are pretty affordable ! So this place is a MUST!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMmZLeXFRRRAB",
            "text": "Calm and cozy thai place with generous portions!! We got veggie spring rolls (4), wonton soup (broth was amazing), drunken noodles (med spicy), and massaman curry with beef. All delicious!! Surprised this place isn’t more crowded!! Would highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocTZTSVRREAE",
            "text": "Unique is Inwood’s hidden gem! The workers are always so sweet and accommodating and the food is always super high quality and delicious. Definitely recommend trying the corn cakes because they are incredible but nothing I’ve ever had here eat in or take out has been bad. The empanadas and desserts are super surprising but also delicious. Great fusion food and there’s definitely something for everyone"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwOWVmNHB3RRAB",
            "text": "Walked here after visiting the Cloisters. Food was fantastic. Some exquisite and unique flavors. Excellent service. Highly recommended. I’ll be back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVMzVDNVFnEAE",
            "text": "Wow!  This is a remarkable restaurant!  All 5 stars for food, service, decor and atmosphere.  Attention to detail is present on all levels.  But the food is what you go there for.  Healthy and delicious.  I totally enjoyed the crispy chicken with ginger rice my first time here.  Do not hesitate to come!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNcEl1ZzBBRRAB",
            "text": "I never had a lambchop this good.  It has a twist of Thai flavor to it, very unique.  I ordered it medium rare and the meat was succulent.  Definitely going to try to make this at home.  The atomsphere is cozy and relaxing, looking at the busy street outside almost feel like time slows down.  Its a hidden jewel in this area."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNUpycFJ3EAE",
            "text": "Let me start off by saying this place is amazing. The food is incredible, the sisters who own this place (one chef, one hostess) are absolutely geniuses with food and hospitality. My girlfriend and I have come here about 5 times over 3 months and we can’t get enough. If you’re looking for good Thai Food, this is DEFINITELY the place."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVbzhiUUh3EAE",
            "text": "This beautiful new restaurant is such a delicious gift to the neighborhood. I enjoyed several appetizers along with the Beef Massaman Curry, one of the Thai chef’s trademark dishes. My unexpected favorite was the Shrimp & Chicken Toast! (It’s more complex in flavor than the name suggests! A gooey crispy treat that melts in your mouth.)\nThe interior of this intimate restaurant is just lovely. It’s elegant yet comfortable. Great prices too!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbnAyb01BEAE",
            "text": "I have been walking past this place for months and never thought about giving it a try. So glad I decided to stop in for a quick bite to eat! The atmosphere is chill and I enjoyed most of my food. Definitely will return! Note that they do not sell alcohol."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhNnFpZ0FnEAE",
            "text": "Doesn't look much when you walk passed. When you walk in , it's beautiful. I ordered the pork dumplings and lamb chops with Ginger rice. THE FOOD WAS AMAZINGLY DELICIOUS!!! I plan on coming back over and over again. The service was awesome, the people are super friendly. 10/10 would recommend 100 times over."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMzlyeHRnRRAB",
            "text": "Wonderful find in Inwood. Lovely restaurant, friendly staff and owner/chef. Had a fantastic meal it was delicious 😋🤤. Highly recommended. ,,👍…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhNm9qLVBnEAE",
            "text": "Amazing place, best Thai food we’ve ever had. I’m obsessed w the salmon and ginger rice, so much this is my 3rd visit this week. Staff is extremely kind and accommodating."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoM19IbWZnEAE",
            "text": "I've been several times over the last year and a couple times with take-out. Great food and service. Dining room is small, casual, pleasant atmosphere with light jazz in the background.  Authentic soups, and Thai favorites plus some fusion items (Half-moon Turnover is so delicious).  They now serve wine & beer. My favorite restaurant in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSay1XLVZ3EAE",
            "text": "Excellent food, this is much more than standard Thai food! The Mango salad was very good, and the appetizer sampler was also very fun. Very filling, delicious, and reasonable in price. I only wish we had discovered this place sooner. By far, the best Thai/fusion food in Inwood/Washington Heights."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwLWF2VWJnEAE",
            "text": "This place is gem. The food is always fresh, & the waitress is always sweet & attentive. You step into a different world with the decor & music. Not to mention the food is delicious, be it the Pad Thai or Mango Salad there’s no wrong decision when it comes the menu"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbk1LUlJREAE",
            "text": "Amazing place, service was prompt and smiles all around! Wonderful and great tasting food by the chef! If you want a nice cozy meal with a date or solo with nice calm music and great ambiance then this is the place! If you like true spicy food, which seems rare in the area, then please try them out! Highly recommended!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjZ3VPX0d3EAE",
            "text": "Where to start?! Unique has a great menu full of options which will please anyone.  I was so excited to find a place which has amazing flavors true to the quality of food in Thailand. The staff are such lovely people and they do a wonderful job of switching up the fun specials.  Would absolutely recommend."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpc0tTM1d3EAE",
            "text": "What a treat! The sisters operating this restaurant couldn’t have been nicer and the food was delicious. We ordered the mango salad, the massaman curry, the green curry, and the lemon pie. The flavors were authentic and the ingredients were fresh. Support this local business!"
        }
    ],
    "reviews_count": 75
}