{
    "name": "Jalao NYC",
    "place_id": "ChIJq6rqPh_0wokRYx9DPUPrCJs",
    "grid": "MN12",
    "address": "Inside Radio Hotel, 2420 Amsterdam Ave, New York, NY 10033, USA",
    "rating": 4.2,
    "user_ratings_total": 1054,
    "phone_number": "(929) 688-4684",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ab2MzRlZlV2xUTjBsamQzQndYemN0TVhBNWRHYxAB",
            "text": "Stopped by while staying at the Radio Hotel and decided to try Jalao NYC.\n\nI ordered the Chicharrón de Mar (calamari and shrimp), Oxtail with rice, and a Coco y Whiskey cocktail.\n\nThe Chicharrón de Mar was disappointing. It had too much batter, was slightly over-fried, and only included three shrimp. The shrimp themselves were juicy and flavorful, but the overall dish felt heavy.\n\nThe Coco y Whiskey was essentially coconut water with whiskey, and the combination actually worked well. It was light, smooth, and refreshing.\n\nThe Oxtail and rice had great flavor but was inconvenient to eat. The rice was plated separately for presentation, which made it awkward since the dish tastes best when everything is mixed together. Once I combined them, it came together nicely. The roasted plantain on the side balanced the rich and salty flavors well.\n\nWhat bothered me most was the 15 percent automatic gratuity added to the bill even though I was dining alone. I normally tip 20 percent, but having it automatically included felt unnecessary. Maybe it is common in New York City, but it still left a bad impression.\n\nThe total came to about 78 dollars before tip, which felt high for what I received. The food had solid flavors, but the experience was mixed overall."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WVdYTkRXbTFCVm1oTlRsTktXRWhLYkVSeGFtYxAB",
            "text": "The food was great, the enviroment.  Awsome.  Our server Cintia was great . Will defenetly come back.   Overall a great experiencia....."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UmNsQk5ZbHBHTnpOS1JGRmpOemQ2YVdsMVkyYxAB",
            "text": "Excelente servicio y la comida espectacular, gracias a Cynthia que fue muy amable con las recomendaciones para ordenar."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twa1lYaHdhRVoxTTBGa1MwdExObXhFUkUxeVJrRRAB",
            "text": "Cynthia was awesome, very attentive to detail and very friendly. Loved the food and the ambiance of this place. This definitely made me feel like I was visiting my home country back home."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twM2VXdFZaVGR3ZDNwMFFuTkdhMFZZWVZGcGNGRRAB",
            "text": "Cinthia la mejor su atención fue demaciado impecable i quede más que satisfecha"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WYWNqSjNlVGxTWVRKak9IRldha3hGYm5CRFQzYxAB",
            "text": "The food was delicious! Our server, Cynthia was wonderful very attentive!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSFdESmplbGxTUjE5aFF6QklTMlUyWTJkalRWRRAB",
            "text": "Food was great. Cynthia was very attentive and a great server"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oek4wc3hVVFZVWWt0WVRXMUpSSFI1YlhWak9FRRAB",
            "text": "Cinthia was great, amazing service, very attentive and nice."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wU1ZWWm1Selp0YjBsNGFFUkpkSEl3YjFCbGFtYxAB",
            "text": "Did not\nKnow my\nHotel had free drinks the bartenders were cool too i got the side caesar was good"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200dE1VTnhjVkZETW1rMVNFRlFiSGRYV21jMWFHYxAB",
            "text": "Mary excelente mesera. Muchas gracias por todo"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNFQybGhVbWhuUmpsdmJGRk9URE5aYm1Gd1JXYxAB",
            "text": "Mary fue una excelente mesera. Siempre estuvo al tanto de la meaa. Muchas gracias"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R1RVbzNTRVpWU2kxQ2QyazNla1U1YURkb1YwRRAB",
            "text": "Mary was the best waitress super kind and helpful"
        },
        {
            "date": "2주 전",
            "language": "it",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MllubDVaREU0U0VoRGJGTTBiSE00Wld4RmRFRRAB",
            "text": "Molto bene"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NdGEwRTVVWEZLUVV4eWMyUjRNMkYxWTNjNWRXYxAB",
            "text": "Very nice restaurant, good food, great service from Mary."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNFptNVJRbFphZVZOTmRFSXpkM1JhYWpaeVJrRRAB",
            "text": "Excelente"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taV1IwZDJhbFpKTldWVlZFTkVaaTF1VUZkSGVrRRAB",
            "text": "I went to Jalao with a friend last night for dinner and I have to say, we were nicely impressed. It was our first time there.\nWe walked in and were promptly sat at a table by the window. The decor was good and we noticed that the background music was low enough so that we could carry a normal a conversation\nacross the table. The staff is just excellent. Our waiter, Frederick, was attentive, friendly and professional. He recommended dishes and drinks at our request. We ended up ordering empanadas and chicharron de pollo with tostones for appetizers. Main course was oxtail with moro de gandules and a paila Jalao which has churrasco, chicharron and longaniza with rice and beans and maduros. The presentation was very good, the flavor excellent and the portions adequate. The restaurant has a good variety of drinks and they were well prepared. We found the prizes pretty reasonable.\nOverall, we had a great experience and will definitely go back again soon."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdWFISjFORmxIYzBOTldWQjFTRU4xUkVoUWEyYxAB",
            "text": "Nice place to relax and to enjoy , Delicious food , the atmosphere is good , the volume of the radio is perfect not to loud. The service was great , the only thing is that it took long for us to get the person to get our bill . Other than that it was good ."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdFprMHpjVmx1Y2toWWRXOHpOWEpHT0dsWlpVRRAB",
            "text": "Amazing service and very friendly waiter :) Amazing breakfast too! Joseph was our waiter! Loved him!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205U1FteENhVTFJZGxwNlpEUnhhbVJLWVZCdFVVRRAB",
            "text": "Rude servers. I was staying in the hotel and I never  seen more rude servers. Omg. I really wanted to try the food here twice and both times I left because of how rude they were. Zero."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOV2NGSTVkVkV4Y2xkVlZGSndkWGczUW5wSFJIYxAB",
            "text": "Service is so bad you'll wait anywhere from 20 minutes to 30 minutes for a server to check to see if you need another drink. Servers have bad attitudes like you're bothering them everytime you asked for another beer"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUU4wRnJTRGcyTFdGdlV6QjJYemh6Y1VNNWNVRRAB",
            "text": "The food and atmosphere here click with me perfectly. The restaurant embodies area spirit. Choose randomly—you'll be satisfied. Team members here balance courtesy with professionalism. I'll certainly be visiting again."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVWVqaFFOMmh0U214T05sQndhMUZtYUhSQlFtYxAB",
            "text": "La comida excelente ambiente muy bueno los mueble verdes tratar de  subirlo un poco  están muy bajitos para comer"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVd2VqbHpVazQwUlZWcFRDMVRlVzl1UkRkRmJXYxAB",
            "text": "I want to give this place a 3 start but the food and Atmosphere where 5+ star. Food was delicious and especially the \"Mofongo\" was delicious. Even my Dominican friend that isn't into it loved it. The chicharrón sandwich is what I ordered was very good. It's one of the best Dominican Branches i have been to. They have good taste in music and the atmosphere is lively. Cool decor and we came as a big family group. Great place to have Brunch for multiple families.\nCONS..... Why it's not a 5 star.\n-We paid for \"Bottomless Mimosas\", $26 each, and they would not fill up our glasses. The menu says, \"Bottomless Mimosas but for only 2 hours\". In the 2 hours+, I got 3, and everyone else got 2 mimosas. We literally kept asking for another and where greeted with a smile and the waitress would say , \"Of course, I'll be right back\". But then take 30 minutes or so to come back. When I asked for my last mimosa she said, \"Of course\" and never came back. When she brought the bill she would not make eye contact. Its not high end Champagne, so it's not like they need to save. But this was my only big gripe.\n-I would recommend to just order a individual cocktail and enjoy it. The $26 is not worth it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCc1NscExNMFZ6V0d3MVJIWm9NMGRhT1hsMGRrRRAB",
            "text": "The food is good and the place is pretty. Unfortunately the service sucks, this is the second time i come to eat here and is always the service that ruins the experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNVZtSjZhVUZ6Ym05ek9EZHhSMk5XTkRaUWIyYxAB",
            "text": "Food was amazing, service friendly, and atmosphere great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNFpqSTBTRGswUzBsUGRGVlZYMXBOYzJoVmJsRRAB",
            "text": "I visited this restaurant to get a happy hour drink. As soon as I walked in the bartenders rolled their eyes at me. I asked for a passion fruit margarita and they started speaking in Spanish, obviously talking about me. After just making a drink for a Dominican patron, they acted as if they couldn’t find the passion fruit flavor and made me a peach flavored cocktail. The bartender then asked why I didn’t have a voucher after giving her my cash. She then takes my $20 and walks all over the restaurant speaking in Spanish. I asked her to give me my money back and I’ll go somewhere less racist. I’ll never step foot inside this restaurant again."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSU4wSjRkVkJOVUZFeldscDNUMjlCY213eE9GRRAB",
            "text": "A Los dueños Que Les pongan  fuerte atencion a su negocio en especial a las camareras o no se si llamarles a si esa joven nos brindo mal servicio y una experiencia para nunca MAs volver al lugar. Los Marcos no se sientes frescos, este Plato Que esta en la foto Esa la langosta la masa nunca se queso desperately del caparazon. Las habichuelas no estaban Fresca. Muy bonito el lugar pero no hay buen servicio al cliente y la comida no esta Fresca."
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSmExRTRjRVkzWW5SUGJqRm9TeTFDYVhoaE9GRRAB",
            "text": "Viaje desde Washington DC a visitar unos familiares, mi Familia y yo quisimos tratar el restaurante ya que lo habiamos visto por redes sociales. Fuimos con mucho temor creyendo que hiva a estar super lleno, gracias a Dios no lo estava.\n✅️ Muy bonito el lugar\n❌️ Nunca entendi la espera para sentarnos a la mesa si ellos dentro del restaurante solo tenian 2 mesas ocupadas.\n❌️ La joven que nos atendio en la mesa nos brindo la peor esperiencia y una 💩 de servicio ella fue super pesada que hasta mis hijos que sin unos jovenes me preguntaron mami que le pasa a Ella.  Y claro para nada soy molestosa. Y al vet como ella actuva hasta le hice saber que era nuestra Primera ves hay que si tenia recomendaciones 😂😂 y dijo hay esta El menu yo no se lo que a ustedes les gusta. Si fuera en otro lugas de bajos recurso talves entiendo su respuesta pero no en ese lugar como ellos lo quieren vender al publico.\n❌️ Los mariscos de ellos para nada son fresco tienen un saber como que estan medios dañado y la langosta estava tan dura que la deje entera por que no se queria despegar del cacarazon y tengo mis dientes super bueno, la habichuela se sintio que no estavan fresca.\n❌️ El baño no es problema pero solo le dejo saber que esta del otro lado en el hotel y hay que bajar a un BASEMENT.\nY si deje muy buena propina no me voy de ningun lugar sin dejar propina."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMV83MThBRRAB",
            "text": "Amending prior review: Presently in talks with Management to give a June presentation there as I have a party with a block at the attached hotel. I have had many meals there and most of the food is good but expensive for the portion size.…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUVdsSlBlVXg1U21NMlNETlRUMEp0ZDNZeFVuYxAB",
            "text": "Beautiful place but that’s pretty much it. Service sucked so bad. I had bottomless mimosas had to wait 20-30 mins in between each drink. Food was good I liked it but it just felt like the workers were stuck on stupid. Everyone id bring up the fact I was still waiting on my drink was just giving the same blank stare and would go to the bar. Don’t recommend at all the service doesn’t match how beautiful the place is. 0/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aemEyeDJTMnRrYjBneFJWOWlWR2MzVlRFd1lrRRAB",
            "text": "Really nice looking restaurant in a nice hotel. Probably a good bar and event space. Have known about it for years since the hotel opened\n\nThe food, was good! Especially the pulpo , pero mira. For the price, the portions were much smaller than they should be for that range. I also feel like they may have been understaffed. The waitress was nice for who she was. I also didn’t appreciate the way the gratuity was listed (there is a mandatory btw)\n\nWith that being said, I did see the drink menu and happy hour for the bar, that looked fair in price! Honestly, I’d give this place another shot just to see that"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZlZUWTJObGMzWXpSeFpqbEdRVlpRVm5GdFkwRRAB",
            "text": "Bartender was too busy drinking his own drink to notice I needed my table cleared Hostess is unnecessarily difficult. NO ONE was inside at 4:00pm and she made me create a reservation to enter! Phone number, name, the lot of it! Insanity! DO NOT COME HERE UNLESS YOU WANT TO BE PROFILED\nHORRIBLE, murky, swamp like peach lemon drop drink too"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sT2NreE9hRE5JWVROd05ERTRPWGROVUVwTWEzYxAB",
            "text": "Food is good. I visited the restaurant while staying at the hotel. After my 3rd visit to the restaurant I was not even being brought napkins and a fork out. They brushed it off as I won’t care about the non existent service, and they’ll get…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNGFtdGpVM05RVTNGdVJreHZYMWhvVkZWT2RYYxAB",
            "text": "I wouldn’t recommend Jalao based on my recent experience. My mother and I arrived for our dinner reservation and were seated promptly, but it took over 15 minutes before anyone came to greet us or even offer water; despite the restaurant being mostly empty.\n\nWhen our server, Maria, finally approached the table, she was noticeably unwelcoming. While the food exceeded my expectations, the service fell far short.\n\nAfter requesting the check, Maria chose to continue a conversation with a guest at the bar and then walked past our table to tend to a large table of about 8 people, completely ignoring our request.\n\nUltimately, I had to get up and speak to another server and the manager just to receive the bill, which took another 15 minutes. It wasn’t until I stood up that any urgency was shown.\n\nUnless you have a lot of time and patience to spare, I would suggest dining elsewhere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocmEyTjRkR3RzYm5KTlZVUlhXbmxpYlUxbGVXYxAB",
            "text": "Who would want to go to this place after what happened in D.R???!!! I'd be lucky to finish my food and get out in one piece!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSWFFa3pPRkExZGxwNmNFdFlPVWRLYW1KV2RYYxAB",
            "text": "Stopped by Jalao NYC for drinks while staying at the Radio Hotel, and it was a great experience! The ambiance was lively and colorful, super fun atmosphere with great energy. The bar area was pretty busy, but luckily we were able to grab a table without much of a wait, which worked out perfectly. Drinks were solid, and the music and decor added to the whole vibe. Definitely worth checking out if you’re in the area or staying at the hotel"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkb0xXVjBVbWhQUkRCZk1qSkNkMUozVFVWTmQyYxAB",
            "text": "It was nice and decent. Service was good everyone was polite. Came for a fanmeet for the weekend. Drinks and food were decent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taR2FteGxiVVZST1ZoNlYwTldkMDk2U25VM1VsRRAB",
            "text": "At the beginning, I was a little slow with the service, but then they got on track."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUmNXSnJOREozY1hsYU5YQjJaelF4YkRneFJWRRAB",
            "text": "Honestly, I'm baffled by all the hype surrounding Jalao. I had really looked forward to coming here, which unfortunately made my recent brunch experience even worse. Without a doubt, it was the most underwhelming I've ever had—so far below mid it was almost comical.\n\nThe space itself is beautiful, I'll give them that. But that's where the compliments end, because it simply doesn't compare to the food and service they provide.\n\nFrom the moment I was seated, the red flags started popping up. I sat there for a solid 20 minutes before any service staff even acknowledged my presence, let alone offered a menu or a glass of water. It felt like a significant oversight. That lack of attention set the tone for the entire meal. The wait staff continued to be incredibly inattentive throughout. Getting their attention for anything, from ordering to asking for the check, felt unnecessarily difficult. In fact, while I sat through my meal, I watched as two separate tables sat down, waited, and eventually walked out due to the apparent lack of service.\nTo top it all off, the food really missed the mark too. For a place that's so widely raved about, the operational issues and the disappointing dishes made the entire experience a huge letdown. It truly makes me question what others have experienced there.\n\nGiven the abysmal service and unremarkable food, despite the lovely decor, I would never come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMlZFeGxjMWxQVm5CclFrRmhRV3g1UTBjNVVGRRAB",
            "text": "We were seated and left waiting forever before the waiter even came over. No greeting, no apology — just vibes. The food took a long time to come out, and again, no acknowledgment or update from our server. The drinks were hit or miss, and getting a refill felt like pulling teeth. We had to wait a ridiculously long time just to get more water.\n\nThe food was honestly good, but the service was so bad it completely ruined the experience. For the prices and the hype, I expected way more. Definitely won’t be back"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWmRrUkdXRVJ2ZVhWaVVUSnNXRTVhZVRKM2JYYxAB",
            "text": "Horrible comida y nada diferente"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSU1VSnZSekUyVEd4dldsZEhSbUZGTjJ4MVRFRRAB",
            "text": "Horrible. Never again !!!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOT3BoTkN1cHJmTEZ3EAE",
            "text": "Gabriela nos brindó excelente servicio, todo estaba maravilloso."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJT2NyLUNIZ3FHUnJBRRAB",
            "text": "Horrible just like the owner. Do not buy and come here ever !!!!!!!!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPbU96N0M0eC1LT21nRRAB",
            "text": "I recently visited Jalao NYC. Overall, it wasn’t bad. The highlight of the experience was definitely the service, the staff was excellent: attentive, friendly, and professional. The food was okay, nothing extraordinary but still enjoyable."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQUzM4YlN3X3JyZ053EAE",
            "text": "All the food that could and would be found in a regular Dominican spot for more than HALF the price could be found on ALL OVER WASHINGTON HEIGHTS. PAID $200 FOR THE SAME FOOD. SAVE TIME AND MONEY SND GO SOMEWHERE ELSE"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodUtEdndBRRAB",
            "text": "Last night, we went to Jalao and discovered a traditional Dominican menu that you can find at most Dominican restaurants in the area, but with a unique twist. Dishes like chivo croquetas, braised ossobuco, pastelon with platanos and berenjenas, and grilled avocado stood out. Aside from that, it was a typical Dominican menu. We had a reservation for 7:30 pm, but unfortunately, finding parking was quite a challenge, and we ended up about 15 minutes late. Luckily, we found a garage just around the corner that we missed when we first got there. The parking cost around $20, but when we arrived at the restaurant, we were seated without any problems, and the host was very friendly!\nMy review:\nService: 4 out of 5 - she was nice, attentive, and friendly.\nAmbiance: 4 out of 5 - if you enjoy partying or celebrating, this is the ideal spot.\nDecor: 5 out of 5 - a beautifully designed place with traditional Dominican elements.\nFood presentation: 3 out of 5 - aside from the croquettes, the presentation was just average.\nDrinks: 3 out of 5 - I ordered the Passion fruit margarita, which was just okay, even though I was told it was one of the house's signature drinks.\nFood: 3 out of 5 - Following the waitress's recommendation, we tried the red snapper with tostones, which was quite bland, and the Moro de guandúles, which was just okay, nothing remarkable.\nThe seafood mofongo with lobster had a lovely presentation and was really tasty.\nThe chivo croquetas were a fantastic appetizer choice; they were unique and absolutely delicious. I wish I had just that for dinner instead.\nFor dessert, we had the 5 leches cake, which was good.\nI asked about the bathroom, and it was located out the door and downstairs? I wasn't sure, so I decided not to go.\nOur table was beautifully decorated with red hibiscus 🌺 flowers, but it was a bit wobbly 😐\nIn conclusion, we drove an hour to dine at this place, and I feel like I need to give it another try. However, if you want to bring someone from a different nationality other than Dominican, I’m sure they will really enjoy this restaurant."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQN0MzTnJhMDZYLUV3EAE",
            "text": "Buenisima comida me encantó, el ambiente muy chulo y la atención al cliente 20/10 definitivamente volveré ♥️"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZXN6dXpELWRfUVRBEAE",
            "text": "Excelente lugar Dominicana 200%"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLN2xtX182aF9hTGlRRRAB",
            "text": "Se trata del restaurante del Radio hotel, el día que cenamos el comedor estaba muy animado y el ambiente era muy agradable. La comida estaba muy bien presentada y rica, las raciones adecuadas y un precio razonable para NY. Aunque no se trate de una zona muy cool, el restaurante si lo parece. Por ponerle un pero, el aire acondicionado estaba un poco alto. Los camareros, muy amables."
        },
        {
            "date": "7달 전",
            "language": "it",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNXB5S3J3RRAB",
            "text": "Diciamo che se non sono in zona non vengo apposta fino a qua per una cena!\nL'ambiente è carinissimo, molto particolare e caratteristico, la parte migliore dell'albergo!\nSiccome alloggiavamo lì, abbiamo provato una sera il ristorante e siamo rimaste soddisfatte sia della scelta che dei sapori. Forse hanno esagerato un po' con la cipolla nell'antipasto ma i secondi erano ottimi: il mio Cordon bleu si scioglieva in bocca, mentre a mia sorella hanno dato la scelta di quale salsa accompagnare il suo pollo (un intero polletto) 😲\nIl dolce era talmente buono che quasi ne avremmo chiesto un altro da portarci in camera, nonostante fosse un semplice tortino al cioccolato.\nPrezzi onesti e personale molto gentile e mai invadente."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEN2RLQmtnRRAB",
            "text": "I recently dined at this lovely Dominican restaurant, and while I was impressed with the ambiance and the friendly staff, I couldn't help but feel disappointed by the lack of flavor in the food, specifically for the fried fish. The prices were quite high, especially considering that some items listed on the menu were unavailable. However, I must commend the quality of the drinks, which were well-prepared and enjoyable. Overall, it's a charming spot with potential, but improvements in flavor, menu availability, and pricing are needed to fully satisfy customers."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNVBuT3pnRRAB",
            "text": "Came here on a Friday night for my mom's birthday and it's started off great the atmosphere was cool and inviting and we loved the decor. The food was definitely amazing from all the meats and chicharron and the yuca fries. Unfortunately the service was not as good. After our drink order (no presidente beer btw) we were pretty much ignored. We got some appetizers and after that again left there still with our menus waiting to put an order in for entrées or even get another round of drinks. We had a good time and loved the food just wished there was more attention paid to us especially since it was my mom's birthday"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MzdUbGRnEAE",
            "text": "I recently had the opportunity to dine at a Jalao that had great potential but fell short of my expectations. While the idea behind the place was great, I found that the price of the food did not align with the portion sizes.\n\nUpon entering the restaurant, I was immediately drawn to the pleasant ambiance and well-designed interiors. The atmosphere was lovely, and the decor was appealing, creating a fantastic environment for socializing and enjoying a meal.\nHowever, my excitement dwindled as soon as the food arrived. The dishes were presented beautifully, but the taste fell flat. As someone familiar with Dominican cuisine, I was disappointed to find that the flavors were lacking the distinctive and delicious notes that this cuisine is known for. The beans were low on flavor!!  It seemed as though they were trying too hard to cater to a wider audience, and in doing so, lost the essence of what Dominican cuisine truly is.\n\nFurthermore, I was taken aback by the portion sizes given the price of the dishes. The menu items were fairly expensive. I understand that is a higher end restaurant, but I was truly and sadly disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtb3JiUFN3EAE",
            "text": "A beautiful restaurant with equally delicious food. I loved the ambiance and overall vibes of this place. It features a spacious dining area, split by a bar in the center, and visible kitchen with hardworking chefs.\nI loved the intimate seating with high back lounges and low lighting. It feels inviting. Our service was a bit slow but the food quickly remedied the “hanger.” The food was flavorful and delicious from start to finish. Our table sampled almost all of the appetizers and a nice variety entree dishes. Everyone loved their food. I would highly recommend this location for dinner parties or a nice night out with a love one. I will be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZ2JTcGxnRRAB",
            "text": "Found this little spot accidentally, while looking for a different bar. The decor looked inviting so I decided to give it a shot. Overall the place is ok. Food was freshly cooked and tasted as expected. Drinks however needed a bit of work, ordered a Moscow mule and a classic screw driver. None were made properly. The service was also not what I expected, while friendly the staff were unprofessional and disorganized. Serval patrons (including myself) had our food mixed up. It’s a lovely little spot with a great deal of potential."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbWR5bHV3RRAB",
            "text": "First time visiting this restaurant and would definitely visit again! Food was excellent! Service was quick environment was inviting, music was bumping and the management was very friendly and made sure we were taken care of id recommend to any one looking for a new place to try I don’t think you’ll be disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyd2EtdFR3EAE",
            "text": "Update: Since I'm still at the hotel, I figured I'd give this place a second chance. I'm glad I did.\n\nThe manager must've recognized me from before, as there was an adjustment to tonight's bill. I got the Coconut fish, which was light, crispy on the outside/flaky on the inside, with a lightly flavorful sauce. I sat at the bar this time (get the Jalao mojito) and service was faster. I'm leaving my original review up below, but I will say I was pleasantly surprised on my second visit.\n\nOriginal review:\nI'm staying at the Radio so I figured I'd give this place a shot. The restaurant is beautiful, the drinks are delicious, and the wait staff is very nice but service is VERY slow (my meal for one took over 1.5 hours and the restaurant was fairly empty). I ordered the salmon, which was good...until I discovered it was raw (not rare, RAW). The manager apologized and got me a new order, but this meant I had to wait a very long time for my food to arrive (without offer to comp my drink or meal or anything for serving raw food). I also got the lava cake, which was delicious but also took a while to come out.\n\nI was considering coming back tomorrow, but after this experience, I think I'll try some of the many other options in the neighborhood instead."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUd2FmQThBRRAB",
            "text": "Dominican food is one of my favorite cuisines and this place really always satisfies. The seasonings are spot on and very authentic. Delicious food with a fun environment playing Latin music in the background. Drinks were also very well prepared"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNzVLMFZBEAE",
            "text": "We had the morning breakfast buffet. The only turn off was the fruit. It was an enormous variety of melon and pineapple cut up in bowls. There were apples, bananas and oranges in the whole.\nThe cut up fruit had fruit flies and house flies circling around and landing on the fruit.\nThe rest of the food was amazing.\nA chef was available to make eggs any way you like them."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNEtXOEVnEAE",
            "text": "I really enjoyed the food but had mixed feelings about Jalao and I’ll explain why…\n\nService wise: 2.5-3 out of 5 stars. Need to do better!\nWe were a party of 6, so of course we made a reservation in advance. We had to change it cause we were supposed to be more and then some people cancelled at the last minute. When we arrived they sat us down pretty quick, the table was uncomfortable for the six of us so we asked to be moved. The person who appeared to be the manager/supervisor, his name Corporan, gave the green light, so that was done pretty quick as well.\n\nSo, we waited no time to be seated, at 6pm exactly we were sat down, at around 6:10 they changed us to another table. We had to wait until 6:35pm for the waitress to finally come to our table and take the orders. They had not even served water and we were there for 35 minutes already. I can’t really say how long they took to bring our food or everything else but we calculated a rough 30 to 45 minutes for every course, which was a really long time.\nWe stood up from the table to leave the restaurant exactly at 9:07pm. So that was 3 hours in the restaurant, being that said, if you’re trying to get something to eat and are mindful of time or in a rush, maybe should find another restaurant option. If you don’t mind being at the restaurant for a really long time, then this is the place for you.\n\nI was referred to this restaurant by a friend who also joined me yesterday. She stated the service was very different the first time she came, much faster and far way better. There were all waitresses yesterday, when she visited before there were all waiters, so maybe there’s a difference in service depending on the staff. She also mentioned if she had not visited before and only yesterday, she wouldn’t have referred us to come but she knew they have more potential than they showed yesterday, which was a bummer for us visiting for first time.\n\nFood wise, they deserve 5 stars.\nWe ordered 3 Croquetas de Chivo, Chicharron and Guacamole for starters. All appetizers were delicious and well prepared!\nMost of the table had >>Chivo y Chenchen<< for main dish, everyone LOVED it, specially the Chenchen. I had never had chenchen before, which is corn grits according, and it blew my mind!!!\nI had the >>Paila Jalao<<. It was also extremely tasteful, all the meats were prepared to perfection. The chicharron was crunchy and not too greasy, the churrasco was exactly the term I asked for, the sausages were just perfect!! And there was so much food I had to share with two other people.\nMy mom had >>Sancocho<<, which she loved!!\nShe stated some restaurants make greasy* sancocho, but this was not the case, and it was perfect for the weather as well!!! Delicious and well prepared with all the components Sancocho should have!\nMy bf’s mom had >>Costillas Ñoñas<<, she really enjoyed it and also had to share because it was so much food.\nOut of all the plates the table ordered, the costillas were the flavorless one, in my opinion.\n\nFor dessert we had a few >>5 Leches<< and >>Majarete<<. They were both very good and interesting. We never found out what the five leches were but they were perfectly paired and sweet but not overpowering sweet, which was perfect!!\nThe Majarete was like a Majarete brûlée, which in my opinion is an incredible twist for those who like classic dishes with an upgrade!!! Loved it!!\n\nWe had a few courtesy drinks from our waitress Maria, she had a strong personality throughout the whole night, I rather say strong because we were not sure whether she was going through something or that was her actual personality. The whole table felt a little uncomfortable a few times and we were not sure what was happening. But I guess giving out courtesy drinks made her feel like it would make our experience better, which did not.\n\nI believe the whole Jalao experience will be different to everyone depending on who’s working the day they visit and the waiter/waitress that serves them."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBby1md2JnEAE",
            "text": "I recently visited Jalao NYC and was blown away by the experience. The ambiance was warm and inviting and the food was absolutely delicious. Every dish was packed with flavor and beautifully presented. The service staff was attentive without being overbearing. The decor is stylish and reminiscent of the Dominican Republic. Overall a great experience and I would definitely recommend it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOU83VVV3EAE",
            "text": "We decided to try the restaurant, having previously visited the location in Santo Domingo and loved RD's cuisine. The food  was exquisite.  El Chivo was cooked to perfection, the Churrasco de la Paila Jalao was tender and cooked just right. Our server Yelina and manager Hector provided impeccable service. The drinks were also delicious. It was a thoroughly enjoyable experience, we will certainly return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURELTgyak9nEAE",
            "text": "Such a lovely impromptu brunch stop on a Sunday uptown. Really enjoyed every item we ordered from the appetizers to the beverages. Service was great and music & vibes were modern and representative of the diaspora. Thank you to our great server Nairobi for taking care of all of our requests."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtanJYOTdBRRAB",
            "text": "Overall: this place is amazing! As a vegan I’m always skeptical about going to eat at non-vegan restaurants because I fear that the dishes are going to be quick cop outs just to add something for us to the menu… this was not that AT ALL. I had the Pastelon de Berenjena and the Guacamole with Chips and the food was delicious!! The cheese on the Pastelon had a pull and I couldn’t believe it was vegan!\n\nI wouldn’t go on an empty stomach because the portions aren’t your typical Dominican PLATO but I can say I was pleased. I do wish they had a vegan dessert option because I would’ve definitely ordered it.\n\n—————————————————————————\nHere’s a breakdown of my experience -\n\nFood: 9.6/10 super fresh and amazing taste! You can tell that the chefs truly pay close attention to the flavors, seasonings, and presentation. The way the food looked was just as great as the way it tasted.\n\nService: 7/10 I did have questions and concerns and it didn’t seem like staff was very interested in assisting with anything other than getting you in and getting you out lol. But they did make sure to check in, clean the tables behind each meal, and fill up your water.\n\nAtmosphere: 8/10 the restaurant is extremely well decorated and clean. You can see into the kitchen from the seating area and it’s actually really beautifully done! I enjoyed being able to see my food being prepared. However this place is LOUD the music is blasting and if you’re trying to have a nice intimate date night, baby this is not the place to do it.\n\nLastly, the bathroom sink does not work properly, water doesn’t come out of the faucet so BRING HAND SANITIZER and make sure you use the bathroom BEFORE coming here.\n\nAll in all I would give this place a 9/10 (really a ~4.6 stars)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxd3BpWHlnRRAB",
            "text": "Food was absolutely incredible, I can't say enough good things about the flavors. The presentation was gorgeous, you almost didn't want to eat it, it was so pretty. Wait staff was friendly and checked on us just the right amount. Only kind of annoying part was the photographer going around taking pictures without asking for permission or giving an explanation, and then coming back to try to sell you the kind of overexposed photos in frames for $30. Kind of felt like I was getting preyed on as a \"tourist\" since the restaurant is attached to a hotel. Still, I'd definitely go back for the food. We were unfortunately not there on the weekend, or I would have totally tried their brunch, the menu looked great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlelpDWkZnEAE",
            "text": "I love the theme and aesthetics of the restaurant. The venue is gorgeous and has a great ambiance. They offered a traditional Dominican menu with a twist, but unfortunately did not deliver. The staff needs a lot of service training still. You can tell most of the staff had not worked in the industry previously. We were seated promptly by the host, which was great, but were not greeted by a waiter for 15 mins.\n\nThey were not knowledgeable on recommendations or how to describe certain dishes. We asked several waiters about what whiskey drinks were offered and no one had an answer. The dishes took some time to come out, which can be understandable in a newer kitchen, but they completely missed an entree. The final entree did not arrive for another 15-20 mins. The staff was not attentive, so it was difficult to voice any issues earlier or request any additional items. We had to order a drink at the bar just to get it to our table.\n\nThe appetizers and entrees were enjoyable! Pricey, but understandable for the atmosphere.  The chivo croquettes were my top appetizer, and the coconut filet and the ribs were my personal favorites entrees. Overall, I will return in 6 months to see how the staff has improved. The restaurant has high potential and I am hopeful they can make the necessary adjustments to the service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQM3JmbjR3RRAB",
            "text": "We had an amazing experience here the food was delicious and the service was excellent everyone friendly and attentive. If you stay at the radio hotel, it’s definitely a must stop spot."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaFpMMWRnEAE",
            "text": "It was my first time with my friend from Boston and we came across Jalao and wow !!! It was perfect we ordered the sancocho and costillas Nonas and it WAS DELICIOUS!! Our server was Arelis and she was the sweetest super attentive and it felt like we were at our fam’s house. Super welcoming environment , please ask for Arelist to be a server you won’t regret. We will def come back when back in town . ❤️♥️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoM1o2WVZBEAE",
            "text": "First and foremost this restaurant was on my 2023 list to try. When i want something I go all out to try to get it. I made my reservation on opentable and yet when i arrived my table was not ready for another 30 mins. So we went to the bar to wait and the bartenders were friendly and knowledgeable of the bar menu. When my table was ready I was very upset because they sat us directly in front of the kitchen door and next to that was a door that goes outside which was closed but you felt the breeze coming through the cracks. I asked to move but she gave me the face like she couldn't understand what i was saying knowing she understood me. Mind you there was plenty of other tables to sit us at since the early dinner rush just cleared. I was hungry and just tried to get over it by sipping my drink to stay warm. Service is nothing to brag about the amount of time we waited for our food is honestly horrible we asked twice when would the food becoming. When the food finally arrived it was excellent and the flavor profile is on point. We had the Guacamole with Chicharron so good. The yucca balls were delicious and the sauce is excellent. We ordered both ceviches the Sea bass and the Tuna loved them both.  My friend ordered the coconut fillet and enjoyed it very much. Sitting by the kitchen I noticed the amount of food sitting in the window waiting for servers to bring them to the table is incredible. It’s busy but service is very slow!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtX0xmQ0RnEAE",
            "text": "I celebrated my birthday tonight with a party of 9 and this place exceeded my expectations. To start, let me say it was a surprise dinner. I thought I was just having dinner with my husband. When I arrived, I found part of my party at the bar and we got seated about 10 minutes after I arrived. Once seated the waiters were very attentive. There were at least 2-3 waiters at all times making sure we had everything we needed. The busboys were also very attentive and constantly cleaned our table whenever we finished. The managers came by multiple times and made sure we were enjoying ourselves and didn’t need anything. We ordered 3 appetizers and 1 salad and they were the perfect size for sharing and very flavorful. When it came to our entrees, everyone in my party ordered a different meal and we were all satisfied both with portion size and flavors. The atmosphere and decor made me miss Dominican Republic because everything was so thoughtful from the hand painted table tops to the different masks and the names of the plates. The music was just perfect, the right mix between old school and new. The volume was just right as well,  the volume was not too loud to still be able to hold a conversation with people across the table. The waiters sang happy birthday and we tried the 5 leches and majarete desserts, all very good. Drink wise, my party had the sangria, special made apple martini and the Mercado Margarita. When asked if they could make the margaritas stronger, they complied. Overall it was a great experience, we will definitely be back and I recommend to everyone!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobDczTm13RRAB",
            "text": "The ambiance, the food and the drinks were really good. The wait time was a bit ridiculous, over 20 minutes for our entrees, not to mention the prices were a bit expensive for Washington heights (over 35 for an entree, cocktails start at…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSazl2Mk5BEAE",
            "text": "Food was delicious. The service is good. The noise is something that is too loud if you are going to talk. The value of the food is a bit overpriced for typical Dominican food with a spin. The cocktail was well prepared, but it came after the appetizers. Overall 4/5 stars."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOXVmb0h3EAE",
            "text": "As a Latina, I know the food they make is NOT expensive to make- so why are their prices so outrageous?! Why spend $40 on a plate that you can get for $10-$12 up the block from there at an authentic Dominican restaurant. I can understand fine dining and all, but we're talking about rice & beans and plantain dishes. If you wanna charge a lot for the fine dining, ok maybe $20, but these prices are ridiculous! One look at their menu and I knew I needed to pass. I just ordered an $18 El Carlos Fuentes cocktail. Oh so I thought!! They gave themselves their own tip! I can understand doing automatic tips for large parties, but I was by myself. At the bar. So with tax and tip, it soared to $22.30. I gave the bartender $23, he said thank you, and tried to walk away. I'm sorry, excuse me, where is my change? Did you think I was paying $5 extra for a drink that you claim costs $18?! He responds with, \"We don't do change or quarters.\" I'm now giving him a look as if he just told me a fat lie and he then opens the register to give me one of my dollars back. Good move! So whereas I would love to support Latino businesses, I also want to support myself and my financial security. Especially since people are screaming inflation nowadays. I refuse to return there. And I can see why there were only 8 people in the entire restaurant. You're literally across the street from a safe injecting drug use spot with addicts all over the place and you wanna give downtown Manhattan fine dining prices?! NO! Not even the better restaurants on Dyckman Ave charge this much! If they plan to remain open, I strongly advise that you lower your prices for the Washington Heights neighborhood you're in. You're not in midtown Manhattan within the tourist trap area! Lastly, I went on a Thursday \"Ladies\" night where the prices were supposed to be cheaper for girls like me. That was the cheaper price!?!?! No wonder there were no ladies there! They see weren't even playing music! You call yourself a Dominican restaurant with no music?! I'm good! This place is not it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlX0lQU2dBRRAB",
            "text": "This establishment is located at the ground level of the new “Radio Hotel” in Washington Heights. Upon arrival the hostess greets you and assigns you seating based on the number of people in your party.\n\nThis restaurant is an authentic Dominican Restaurant serving up beautiful crafted dishes to meet your taste buds needs.\n\nThe establishment isn’t very large but appears to fit comfortably approximately 10-15 parties at tables and a few individuals at the bar.\n\nMenu was beautifully presented and offered a wide range of appetizers, drinks and main dishes.\n\nOur server Jairo was absolutely friendly and helpful and even made a food recommendation.\n\nOur appetizer was yuca balls with cheese and it was absolutely tasty and delicious. Our only concern was the uncooked black beans that served as a decor. Just seems wasteful and unsanitary.\n\nOur main dishes were to die for. It tasted just as good as abuela or mami would make it. The servings were large and filling.\n\nOur drinks were decent. We are hoping to return and try other items on the menu along with a more tasty drink.\n\nOur overall experience was great. The vibe feels high end, classy with merengue or bachata music playing softly in the background. We appreciate the attentiveness of the staff and the incredible dishes prepared.\n\nWe hope to return. Highly recommend this establishment if you’re in the mood to eat authentic Dominican food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNXZmdi1BRRAB",
            "text": "Came here with a group of friends for brunch. The atmosphere was very family friendly, the food is a good portion, really flavorful, the drinks were made strong, and our waitress Yelina was the sweetest!! Recommended 100%."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaODdySDJ3RRAB",
            "text": "Okay randomly took my here to lunch on a Saturday afternoon. Exceeded expectations. We got seated right away, our drinks and food were quick and service from Hector was attentive. Of course it’s a restaurant and the food is AMAZING!  One of Best churrasco I’ve ever had. Everything was absolutely delicious."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMllQcnBnRRAB",
            "text": "I wanted to love it, you can tell they are trying to bring something amazing that represents the culture in a very positive (and classy) way to the heights, great concept, beautiful ambience & decor, but it is very overpriced ($52.00 for a 14 oz ribeye), and when asking what are the side options, they tell you those don’t come with it, and you’ll have to order them separate (I rest my case) no need to continue on how overpriced everything else is…  As far as the food we ordered, good flavor although at times it feels that the food goes left field (traditional hand cut fries would have been amazing, the sauce for the fries not the best, the burger bun not so good), the Mofongo with seafood was absolutely delicious! The plantain chips with guac was really good… would have loved for a more traditional Dominican menu, this is more of a fusion and not an authentic representation of Dominican dishes (which are simply delicious and amazing ) … I am glad I came as I’ve always been intrigued , but don’t have the desire to come back.\n\nEdit: Hello Jalao,\n\nThank you for responding to my comments and genuinely taking them into consideration! I noticed you apologized for any confusion regarding the side options for the $52.00 14 oz Ribeye… Are you saying that side options are in-fact included, and we were wrongly told otherwise by the waiter? If this is the case I would like to be the one to apologize… $52 dollars for a 14 oz steak, (with side options) is a bit high to begin with, having to order side options on the side will bring that 14 oz steak dish to over $70 dollars … Yes I think we can both agree that’s a bit ridiculous (not just a bit high), but If there was miscommunication by the waiter, please accept my apologies, thank you."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocmJMNGZ3EAE",
            "text": "El lugar es muy bonito, los meseros amables.\n- The restaurant is pretty a everybody was very kind.\n\nLa comida es buena, no es wao pero buen sabor y las porciones son normales.\nLos tragos no muy fuertes a algunas personas quizas les pueda gustar a mi en lo particular me gustan un poco mas fuertes.\n\nThe food is good, mm not impressive, but good. The portion is ok.\n\nEn mi opinion me gusto el lugar pero no es mi favorito. Si lo recomiendo para que saques tus propuas concluciones🙃"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMakp6Ui1RRRAB",
            "text": "We’ve been to this restaurant many times and they never fail us… I must say that Hector is truly amazing, has great customer service skills, he’s humble, super friendly and the team from the chefs to the bar they all work together and make it happen!! The chef  Carmine  my god he’s the best with his team, he’s skillful and knows his stuff!!!!!.\nNow my boyfriend has a goal to try every main dish and we are almost there, he has not yet been let down, the Sashimi tacos THEY ARE ABSOLUTELY THE BEST I HAVE EVER TASTED SUPER FRESH AND TASTEFUL, again thanks to Carmine!!! THE GUACAMOLE MY GOD DELICIOUS… Man just come here, they dance amongst each other at the kitchen  and just work together!!! Our server tonight was Daury such a nice guy and attentive.  I love this place!!  Oh and the music is great too!! I promise you won’t be disappointed.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsLTVtY0ZREAE",
            "text": "Great spot for lunch. Will return with my parents for dinner soon. Had the fried fish, and it was delicious! The decor and colorful murals are beautiful. The staff is friendly. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCXzhpZUR3EAE",
            "text": "I would have gave 5 stars if it weren’t for my experience on 1/28/23, this was my 3rd time there and the experience was not great. We waited about 35 minutes to get seated. After waiting for so long once we got seated we ordered drinks and food right away. The drinks came in about 10 minutes. We waited 45 minutes for our food. The waitress we had wasn’t good she was not attentive whatsoever seemed to have some sort of attitude or was in a bad mood. The music was extremely loud on this day also, it was very hard to hear anything with how loud it was in there. Prior to this visit I had been to jalao on 1/08/23 and on 1/20/23 both the previous times the service was amazing. We were seated quickly and did not wait long for food.  This last visit on 1/28/23 might just be my last it was upsetting to wait so long to be seated having a reservation. Also wait almost an hour for the food and not receive good service. I have to say the food is delicious. This review is solely based on my experience not the food.\n\n1st visit:\nChips and guacamole\nPaila jalao\nSpaghetti Al pomodoro\nChurrasco\nMimosas\n5 leches\nCheesecake\n\n2nd visit:\nMorir soñando with Tito’s\nBombones de yuca\nSpaghetti Al pomodoro\nSeafood mofongo\nClassico majarete\n\n3rd visit:\nChips and guacamole\nMercado margarita\nCoconut fish fillet\nChurrasco with tostones\nChurrasco with rice and beans\nSpaghetti Al pomodoro.\n\nAll food was extremely delicious. I loved the coconut fish fillet so much it was very flavorful. I was unaware the seafood mofongo had pork in it since it didn’t say it on the menu and I do not eat pork. It was rather upsetting. The spaghetti pomodoro was my favorite the first time I went. However the last two times it didn’t taste as good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMmVld0RnEAE",
            "text": "The interior decor of this restaurant is super cool! The service needs improvement, and so does the taste of the food; the rice was hard and dry and the rabo did not taste good, the maduros were way too sweet as if sugar was added in. I was…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdmNXTVBREAE",
            "text": "This posh Dominican restaurant features absolutely delicious food served with panache. We had the empapadas, shrimp ceviche, guacamole with chicharrón, yucca and plantain chips, and a kale salad. We finished strong with the 5 leches!  Absolutely fantastic. Also the cocktail was amazing."
        }
    ],
    "reviews_count": 84
}