{
    "name": "Monkey Brothers Lab",
    "place_id": "ChIJjxxMP_TzwokRjpBxHi6nq34",
    "grid": "MN12",
    "address": "206 Audubon Ave, New York, NY 10033, USA",
    "rating": 4.6,
    "user_ratings_total": 244,
    "phone_number": "(646) 874-7409",
    "reviews": [
        {
            "date": "4시간 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSWQydGhjSFE1YmxWSU5sODBRbmxDVnpJNWEwRRAB",
            "text": "Si tú quieres una Yaroa con calidad this is the place."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMFVYRnhZblpxWWpaQlNVOU9kVmxQTXpCSk5sRRAB",
            "text": "Used to order long time ago in Uber Eats , they stop serving the churrasco sandwich for a while and I stop ordering. Today randomly on google map saw a location nearby and saw the money that the sandwich was added back . For me that’s definitely their best item …."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOYVNtYzVZa3BoU0dseU1IQXlaVFZUWVMxc2VYYxAB",
            "text": "La mejor comida el mejor churrasco. Monkey brother son Los mejores."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMVVXUllSbkZNTFdad1NUVlBha3hNTFdsR2JXYxAB",
            "text": "Great customer service and the food is deliciousss"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twaWNVaFlVMjlXVG5Gb1pYWXpiWGhDTjBoaFYzYxAB",
            "text": "Amazing service & good food ! 100% Recommend 💕"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RNVl6bDFUbWR3YUd4Nk1HNU9SWGxJUkd3M2FsRRAB",
            "text": "I stopped by Monkey Brothers Lab and tried the Monkey Burger, and wow it was incredible. The burger comes stacked with juicy meat, fried cheese, and eggs, making it a flavor packed combo that’s as satisfying as it sounds. Every bite was rich, indulgent, and perfectly balanced.\n\nI also ordered the churrasco with fries, and it did not disappoint. The steak was tender and seasoned beautifully, while the fries were crisp and delicious a perfect pairing.\n\nWhat I love about this spot is not just the bold food but also the portions and quality. You definitely get your money’s worth, and everything feels freshly made. The service is great (colita eres el mejor, gracias por tu atención), and the food will definitely have you wanting to come back.\n\nIf you’re looking for something flavorful and hearty in NYC, Monkey Brothers Lab is a must try. Highly recommend the Monkey Burger and churrasco!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WFIydE9kVXRKV0U0NFZreE1XbEZtVUZodmRFRRAB",
            "text": "The food here was amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sc1owNUpjbGRIU1VSTFEyeG9TemxUVGpCdVNHYxAB",
            "text": "The food was excellent. The service and the workers were amazing. Great area. Highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWFRWRk1kblZRU1hGRFZIcFlWa0pTUW1OUGNXYxAB",
            "text": "Great customer service, little to no wait and the food its amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMVdqSk1ORUZwVW5sT1psQllNMk40TWkxSE9WRRAB",
            "text": "Love the food🙌🏻"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SU2VHUkdPRll3WW1wc1QybHhUM1pPZHpScmRtYxAB",
            "text": "Lo Mejor 🇪🇨🥷💯🦾"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVlMwZE1TMHRqU1dGamN6SmtiRVU0V0Vwa2JHYxAB",
            "text": "Bueno bonito y barato 🔥🔥🔥🔥 los mejores 🔥🔥🔥🔥🔥 los recomiendo al 100%"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKYTN1YVA2NkxYQWRREAE",
            "text": "This is our favorite Chimi truck to visit late night in the city. I don't know what time exactly they're open till all I know is we've gone there at all hours of the night and they're always there. The food is always good and the prices are good as well my husband always gets the chimi and I get a chicken yaroa both are amazing"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRb3MzNjhBRRAB",
            "text": "I used to love this truck! Not sure if they possibly got a new chef but the quality of the food has not been the same. My fav was the mofongito de pollo but now the food is terrible."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNGYtcUVREAE",
            "text": "This food truck takes street food to the next level! Their Chicken Patacón is the best in NYC—crispy, flavorful, and packed with juicy chicken. The Chimis are next-level delicious, and the Spicy Chicken Roll brings the perfect kick. If you’re in the mood for something savory to share, the Picadera de Tostones with Chuleta is a must-try. With a little bit of everything on the menu, this spot is a street food lover’s dream. Don’t miss out!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOXJQOVZREAE",
            "text": "Very good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaHRER2R3EAE",
            "text": "Best chicken tacos😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaHFDeUFREAE",
            "text": "The best chicken tacos, love the quality of the food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MlB5STdnRRAB",
            "text": "Their food is always Freakinn Banginnnn🔥💥💥💥🤯lots of flavor , great prices … only bad thing is NO DELIVERY 😭 but I still love their food ."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNWZTcklnEAE",
            "text": "Rico todo! Pero los tacos 🤤"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1aGV6Vm9RRRAB",
            "text": "Taste so good made me wanna smack my mama 🥹"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweEpXZ2JREAE",
            "text": "Nunca hay quipes frito ni pastelitos, la salsa hay que cambiarla sabe cruda por dios horrible!...."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NjgyaklnEAE",
            "text": "They are taking street food to another level!!\nBest Chicken Patacon in NYC, Gourmet Chimis, Spicy Chicken Roll, Salchipapa, a little bit of everything."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4amZHQ3BnRRAB",
            "text": "Fast and good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4d0txNVNREAE",
            "text": "Everytime I order they take over two hours to deliver. Who has two hours to wait on food?"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOGFIeUhREAE",
            "text": "Great food and exceptional service. There are many ootions to choose from for everyones taste. Highly recommend it!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoemNtdTNRRRAB",
            "text": "La comida súper rica el servicio es el mejor 👌👌👌recomendado 100%=…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNzkzS0pnEAE",
            "text": "They are open til 5am...need I say more?"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtby1HcUFREAE",
            "text": "La peor salsa de MayoKetchup del área. Solo sabe a vinagre. Lo demás estuvo bien. Pero me dañaron la comida con esa salsa."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1N2JuRFpnEAE",
            "text": "Wow...honestly when you talk about good chimis or frituras, this is a place to come and eat, today I had the best food at monkey brohers lab..they're the best and the staff behind the counter are extremely great employers..thank you guys specially Luis⭐️⭐️⭐️⭐️⭐️.."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MnN5Zi1BRRAB",
            "text": "I went last night I loved it. I called before my arrival and Thou the lady said it’ll be ready in 25 min , it was ready in less than that 🔥🔥🔥 I’m amazed on the portion of meat YALL add 🥰 by the time I finished the tostones I still had enough meat left 🔥🔥🔥🥰  I have to go again so I can take pics  of my next meal 🥰 thank you for amazing services y esa buena jaltura 🖤🙏🏽"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMm9PYlNnEAE",
            "text": "The way they make The Chimi is very different than other places.\n\nMonkey Brothers Lab does not use the traditional Chimi Sauce (mayo, ketchup, orange juice and Worcestershire sauce).\n\nAdditionally, we also notice that they do not put onion on it and use purple cabage instead of the white one.\n\nDifferent style, different flavor, I wish I had the original with the dripping sauce after each bite."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaHZpbUpREAE",
            "text": "Great food every time"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyc28tblhREAE",
            "text": "Great was always"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtb29UVDBBRRAB",
            "text": "Empapizza are the best. They also have a good variety of food to choose from taking into account that they a food truck."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtbjc3MjNRRRAB",
            "text": "The best B"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtem9EQy1nRRAB",
            "text": "Best chimi truck ever. Order ahead of time so you won't have to wait long. Also, you can pay via Zelle or cash app."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBc28yOUZ3EAE",
            "text": "You see and run into some drunk, funny, loud people throughout the late hours but that's just the simple beauty of NYC night life.…"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjOExiYm5RRRAB",
            "text": "muy buena comida y muy bien servicio al cliente, ordene una picadera, (muy rica) y la chimi empanada la cual hoy no tenian, pero muy amablemente me llamaron a pedir disculpa y me enviaron una de pizza la cual me encanto y 2 empanaditas  de pollo😋😋 super recomendado y definitivamente seguire ordenando 😄…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzdnVTSC1BRRAB",
            "text": "I used to love this truck! Not sure if they possibly got a new chef but the quality of the food has not been the same.\n\nI would order from them pretty often and my food had always come fresh and fast.\nI had to give them a break as I got extremely sick once. I am not sure if the food was old or what the situation may have been but it wasn't good at all. I decided to give them another chance and I am sad to say that nothing improved. The meat in my sandwich had to have been sitting there for hours if not days the bread was as hard as a rock.\nThey were also extremely rude when I called to ask if they could possibly remake the food.\n\nWhile the pics look great; you definitely won't get what you expect. Hoping things improve !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5d3ZXbUVREAE",
            "text": "This food truck is so unassuming it's very easy to miss. Structured into a parking lot, you'd be forgiven to wonder if you're at the right place. But when you notice that even in freezing rain there are people waiting on line, you start to…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4azlHU0FnEAE",
            "text": "One of the best food truck in uptown NYC!! Friendly staff and a delicious meal, Always. Their menu is always diverse , so you can always find something good for everyone! Hope you enjoy it as much as I did!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBejlHVVdBEAE",
            "text": "Hands down the best spot I live all the way downtown and I will take a cab or the train just to get the food on those late nights it’s amazing the staff is amazing I have previously worked with a few them and it’s so great to see them and…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpdXNpaFJnEAE",
            "text": "The food was very good, they have a very nice and diverse food menu. I would recommend it to anyone who wants to try good food. Service was fast and great. I am definitely going to keep trying your guys food!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTeU5LdTRBRRAB",
            "text": "Good if you go in person. Horrible if you order with Uber eats or doordash. They always forget the drink and always blame the driver. I have gone through this many times. When you call they do nothing to fix the mistake. Absolutely horrible."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDOUlDeDhBRRAB",
            "text": "Ordered via Uber eats. Food was fine, not super impressed but not mad about it either, price was fine. However, do not advertise Pepsi products as Coca Cola!!!!!! I would have never paid for a can of pepsi. Gross"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBMUpIYmxRRRAB",
            "text": "One of my favorite places to eat late nights. It’s the cleanest, and best cooked food truck in nyc. Every time I go I order something different. Love this place👍🏼👍🏼…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbWJYSDd3RRAB",
            "text": "food was ok. I went for the Patacon and wasn't impressed but that is my opinion. I think the Plantain needs more seasoning it was slightly bland. the service was great for late night side of truck standard.  I would go again if i was in the area."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjMzdDOVNnEAE",
            "text": "Great place, fresh food and amazing welcoming service, the best and freshest tostones I had from a food truck,the chimis aren't soggy and wet like others places, the passion fruit juice is on point. Definitely a place to go whenever you're hungry ⭐⭐⭐⭐⭐"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBaGRTNGh3RRAB",
            "text": "To be able to call and have them prepare my food while I’m on my way is priceless. My son and I love chimis and most truck either too big and not tasty. But Monkey Lab does the right size and fulling. I fully recommend this food truck food (btw they do ubereats 😊:) even better)…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjOEk2aU1REAE",
            "text": "Great service - popular place to get food ! The chimi empanada burger is everything ! The menu has a lot of options and everything looks tempting to eat. Definitely going back 🙌🏼🙌🏼🙌🏼…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReF9IUlZ3EAE",
            "text": "My favorite food truck in the whole world! The churrasco is to die for, so juicy. The chimi empanada is delicious and so are all their empanadas. The mofonguito cups are amazing.  And I can go all day long. Don’t even get me started on the…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLd01pdFpREAE",
            "text": "I didn't eat here but accompanied a friend of mine and he loves it. Chimichurris are his favorite with his usual chinola juice aka passion fruit on ice. Fast and ready to gooooo"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4blltTXBnRRAB",
            "text": "Great food, the lady who helped me was really nice and knowledgeable. The workers worked fast and made sure the orders were correct"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURza3BDVExBEAE",
            "text": "Sin dudas the best of uptown totally recommend!!😍…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLcXAtVHRRRRAB",
            "text": "Food was freshly made and good. Staff very polite. I had the chimi de carne, mozarella sticks and limonada. Tasty and freshly made food cant be beaten."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4azVHSXFnRRAB",
            "text": "Wowwww I just had the mix platter for 5 and it was amazing, the food was delivered on time and was too much food (for 6 people) and still was super full,The best food I’ve had in a while!!!!!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURreTZiT0x3EAE",
            "text": "The food was amazing and the people are great. I recommend the Salchi Papa (not on menu). The 4 hr drive from Boston is completely worth it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdS1ESG9BRRAB",
            "text": "Great food. Fast service. Generous amount of food for the price. Definitely good spot to come to late hours"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDZ1ozUnBRRRAB",
            "text": "Empanadapizza is out of this world. Hope you hungry, great portions. Perfect food after a day of drinking. Must try!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrN3AzMldBEAE",
            "text": "A very cool spot for a late night snack, the food is really good, my only problem is customer service, it seems like it takes a toll on the workers to be nice and cordial, by just greeting each customer with a smile will change everyone’s experience in a positive way and more people will come back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4M2ZxMHR3RRAB",
            "text": "Not for nothing the fact that I come from Long Island to Manhattan to eat at this place can say a lot about the food. If you are in the area you have to stop by you will not be disappointed."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROHZpWkFREAE",
            "text": "I love them. The food is amazing and  amazing customer service.  Food is done in a timely matter."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURra19MYnRBRRAB",
            "text": "Great food. Fast service. Generous amount of food for the price. Definitely going to hit them up when in NYC."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjdTlmOTlnRRAB",
            "text": "The best fritura truck uptown! Generous amount of food for the price, tasty and super fast! Keep it up 🙏🏾😋…"
        }
    ],
    "reviews_count": 65
}