{
    "name": "Patrizia's Taverna",
    "place_id": "ChIJS7R9DdxJwokRUclinYo_2sw",
    "grid": "SI2",
    "address": "2636 Hylan Blvd STE 130, Staten Island, NY 10306, USA",
    "rating": 4.3,
    "user_ratings_total": 174,
    "phone_number": "(347) 855-2078",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdWFreEhUREpMUTJOSFVqRkRRbVJPV2xaS2VHYxAB",
            "text": "Tuna tartare was soggy drenched in sauce and texture was way off. Sea Bass was overcooked and again texture and taste was way off. I tried again but just find it so institutional. Never again"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MU1VOXNTMFZTZGpNeWFFUnJNRXBDYm1RNVdIYxAB",
            "text": "I went there last weekend with my husband and I understand places are busy but I felt like while we were at our table the waiters were constantly speeding past us and even though food never landed on us I thought it was going to.  They put chairs at our table to move it out of the way and then ten minutes later took them away.  I got bumped with it once but I just let it go.  It was not a birthday experience I enjoyed with my husband."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcFdESkZXV2x4ZHpJMVpFZ3dSbFp2T0hSYVVrRRAB",
            "text": "The pizza is the worst pizza I’ve tried in the island. We got the chicken vodka and it had no flavor and the chicken was so dry. The buffalo chicken was under cooked, had zero flavor and is just gross to look at. Even the smell bothered me. As an Italian I would eat dominos over this"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNlRrbzJTamRTTmtwcWVWVm1kR2cyYnpWSFIzYxAB",
            "text": "Great food and staff. It never misses!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSFNUaFNTM2hIZFVwdFQyVlZNRWxqU1VkWGIwRRAB",
            "text": "Food was incredible, service fantastic and friendly, and atmosphere relaxed and clean.\n\nAppetizers are a work of Italian art!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TFQxbElXamhvY1hsVlpVcGtZM1ZtTVZwM1VFRRAB",
            "text": "Definitely not crazy about the pizza at all Buffalo slice very bland both slices I tried very tough and overcooked not the greatest flavor neither"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQlRFSk5YMmN3UTBabk0zbzJhR0pNWm5WbmNtYxAB",
            "text": "I had an amazing experience at Patrizia’s Taverna!\n\nThe food was outstanding. The pasta was perfectly cooked, and the seafood dishes were especially impressive.\n\nHighly recommend this place if you’re looking for authentic, flavorful cuisine and a great dining atmosphere. I’ll definitely be returning soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUGEyRXRRVU5oZDJwRlNqQjVhR2hvYjFwU2RsRRAB",
            "text": "Best pizza and Italian food with good staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMU1sQmtPSEUyUjI1Q1gzZGhWbDk2YjJ3NVVHYxAB",
            "text": "I ordered through uber eats - Im not sure what happened here? First I ordered a panini.  The eggplant was soggy and thick. But was a hero. Why are they putting it as a panini? Also I ordered chicken fingers for my kids- they were hard & you get 4 chicken fingers for 15$!  Lastly and the most concerning to me was the french fries were open and half were missing. Im disgusted. Never had this issue with a patrizias before only this location."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UlgwMVJZbEppV0d3NWFuaHJaa0U1Tm1sa1NFRRAB",
            "text": "We had an absolutely wonderful experience at Patricio on Highland Boulevard. The food was truly outstanding from start to finish. We started with the fried Gallo, which was perfectly crispy and clearly fried with care. The crabcakes were another highlight—fresh, flavorful, and paired with a delicious mango sauce that we highly recommend.\n\nThe staff went above and beyond, surprising us with two complimentary cannolis and a cappuccino, which added a thoughtful and memorable touch to the meal. The service was warm and attentive, and we made sure to tip well to show our appreciation.\n\nI also think Patricio is an ideal spot for larger groups and family gatherings—the atmosphere is welcoming, and the space is great for celebrations or shared meals. We had a great time and will definitely be returning. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbFZFb3hVekpFTmt3M2NYUk9Obkl3UkRGZlUzYxAB",
            "text": "Very fresh food prepared well. Pleasant and attentive service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMlkzTjROMGhCY1RCeFRFTkhjazVSVm01U1VXYxAB",
            "text": "Food looks amazing"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZak1qb1JREAE",
            "text": "I Frequent Patrizia's Often\nI've Had 90 Percent On Their\nMenu Their Food Is Top Notch\nTheir Entire Staff Is Very Nice From The Restaurant To The Pizzeria\nVery Attentive And They Make You Feel Like Family Every Time I Recommend Their Restaurant From Afternoon Till Night 7 Days A Week\nAnd Their Delivery Drivers Are Always Punctual Food Is Always Hot 🔥 And Delicious The Pizzeria Side Is Very Decorative With Different Pizza Box Decore From Restaurants All Over Italy 🇮🇹 Makes It Feel Authentic Atmosphere\n🇮🇹🇮🇹🇮🇹🇮🇹 Come Take a Look\nEnjoy\nRichie Rich 😎😊"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OeFRrRTFiR0phZUZFemEyc3dXVVZEVkdKd0xYYxAB",
            "text": "Was great place. Made my in laws 50th anniversary party memorable. 👍🙏"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVVRWOTRhelZvZEVkNk1tSjNSSEJvVDBGcVdrRRAB",
            "text": "This Patrizia is beautiful.  Of the 3, it wins.   Patrizia of Amboy wins because of the pizza.  Patrizia of Tottenville wins the appetizer race. (The Octopus is insane).  Go to any location, and you will have a great time"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabWNXOWFhbGs1ZVVWeWMyVk1TVVpwTjJkQlNGRRAB",
            "text": "Very good for a neighborhood place! Wonderful staff, good food, fun atmosphere!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSQ1RGRjVjV2swVHpSbFMxVXRjaTFRU2xJemFuYxAB",
            "text": "Pizza here is definitely is the top 10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCalh6VjFlR3AxV2pGNGJVUm9UekYyYTB3MmNsRRAB",
            "text": "Very good pizza very nice service very clean"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOS0cwYzY0Zzg3SGx3RRAB",
            "text": "First time coming here for some pizza, pasta and gelato and it was amazing!! Not to mention the service was great will definetly be coming back for more"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVVdtOU5TaTFzU0RWUVpYSXhSbGhKVkV0bGJGRRAB",
            "text": "Place has potential to really be enjoyable. Understandable we're here during a busy time, but the waiter never came back to check on us once our food was served. Not even once.  Had to ask the food runner for drink refill.  Then watched waiter tend to two other tables who sat long after us multiple times while trying to flag him down to get our check.  Had to ask two other people for it before once again the food runner came to the rescue to ensure we got it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VOTHkzc25LLVp6a0FnEAE",
            "text": "Had a 6pm reservation.\nWas seated quickly.  It was very loud. The waiter took forever to take our order. Never checked on us to see if we needed anything.\nHad to ask 3 separate people for the check. Its safe to say I will not be visiting again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U1Z6Y3pUbFZ0WjNSUlozRmlRazFxZFZocVIyYxAB",
            "text": "Food was good but waiter took about 20 to 30 minutes to give us our check and had to ask 3 different people.They did not even bother to ask us if the food was good.They saw us waiting and was ignoring us."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdW4xbzZJNzdXQVJ3EAE",
            "text": "Food is amazing. Staff is on point and the owner, Antonio and his dad are so nice people. Love this restaurant. A must try."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPcml3c1hFNmUycl9RRRAB",
            "text": "great sauce,great crust and great stuff 8.9.✌️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNM2o5Y3VuXzRmb1pREAE",
            "text": "Peter is a great guy cares about customers and is very polite always asks if everything is doing well and always makes sure the customer is happy Thankyou so much !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQM0cwcnpHbV9yckNBEAE",
            "text": "The food is amazing and the service is wonderful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMQ1F1Sy1rcGFPN2hnRRAB",
            "text": "Delicious food at a reasonable price. Peter provided us with Amazing service. Definitely coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOZWNrSTJVcllPWm1BRRAB",
            "text": "We love Frankie!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQX0hzcGJSOXBXQ2ZnEAE",
            "text": "Pizza was fantastic . Definitely recommend for sure. Owners are from Naples. The Pizza is as authentic as possible. Come on down and try it !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQ2k1SXZLaGViWFJnEAE",
            "text": "Amazing customer service and amazing Roma slice. Would definitely recommend come and enjoy the inviting atmosphere. 10/10."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQempzcnYwMU1TMmpnRRAB",
            "text": "It was great to grab a slice with husband and grandkids before a movie at the Alamo.. The atmosphere was friendly and the pizza was really good. The price was great. I would come here again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQaURrTHZmLW9pVnV3RRAB",
            "text": "Me and my son stopped in and got rolls. We had a Chicken Roll and a Sicilian Roll. Both were delicious. The staff we spoke to were super friendly. Definitely stop in for a bite to eat."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMmtudmp2NXJ5dFJ3EAE",
            "text": "Very helpful, food was delicious, especially the pizza, will definitely be coming back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKX0tuTTZjaUlHMWt3RRAB",
            "text": "It's a little loud but a great place to eat."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMWFUwN1BvaFllaUl3EAE",
            "text": "Love my boys Vinny ,Tommy ,Rocco"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMWEkzT0RXd2YzeXh3RRAB",
            "text": "Unfortunately, my experience with this establishment has been extremely negative.  Two out three times that I have dealt with this restaurant it has been an absolute disaster.  My first experience they messes my catering order and sent the wrong food.  My second time the steak was extremely undercooked. And most recently TODAY - Mother’s I placed a catering order (not sure why!) and 30 minutes prior to delivery I received a message stating that my order was cancelled. When I called to inquire about the problem and asked if I could pick up the order, I was told that they “couldn’t accommodate my request”. I wasn’t feeding 20 people…… I was only asking for a meal for 4.   Poor management, Poor customer service…… I will never go there again.  Neither will my family or friends"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbmItNTJoaDh6NFBBEAE",
            "text": "Food so good my friends robbed me to buy."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvb1lqR1NREAE",
            "text": "Amazing experience. I’ve eaten in the pizzeria and the resturant and by far is the best resturant in Staten Island. From the service, drinks, entrees, and dessert everything is phenomenal every time\nI visit. Highly recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa2ZualF3EAE",
            "text": "The workers are very friendly and welcoming a great atmosphere! The pizza is very tasty as well as the pastas. They also have a nice dine in area. Don’t hesitate to pay them a visit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXJMOWdBRRAB",
            "text": "Great food great service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaUxHZlZREAE",
            "text": "My friends and I were celebrating our (April) birthdays together at Patrizia’s Taverna and they made us feel so comfortable. They were very attentive, checking up on us often, cleaning off plates right away. The food was AMAZING!! Their homemade pasta dishes were very good! A few of us ordered from their homemade pasta section and they did not disappoint! Thank you Patrizia’s! Will be visiting again for our future celebrations!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvb2NhZzJnRRAB",
            "text": "Had an amazing family style Easter Brunch, with the  family, full of seafood, pasta, pizza and more.  The staff was amazing and so attentive. They do weekly events, will be back soon."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJblpuUzh3RRAB",
            "text": "Patrizia's Taverna is a brunch of Patrizia's restaurants. They serve a great variety of Italian cuisine, especially I love their pizza. We went there for a nice quiet dinner with my friend.\nLovely interior, very airy atmosphere, charming decorations. They have bar and dining area nicely separated. And the high ceiling provides that enjoyable space. Outside was stuff but inside the air was cool and comfortable.\nLet me mention the thing I don’t like and do not appreciate. The supervision of the servers were too much. Every several minutes they were asked if everything ok, did we finished, do we need anything else… every server who was passing our table was asking us those questions. It is definitely great that they care but maybe it should be little less pushery. Give customers some privacy and the service still will be great.\nBeet salad was great, thin layers of well cooked beet, crunchy sugary-glazed roasted walnuts, creamy feta and delicious dressing on the top of  fresh arugula made it really enjoyable. For main course we had pasta Fiorette and Linguine with seafood. Fiorette were pretty handmade raviolis filled with silky delicious ricotta with rich mushroom sauce and grind Parmesan on the side. I recommend lavishly sprinkle it with cheese to boost the flavour. For my taste it was lacking a bit of sauce but overall a lovely choice. Linguine was a star dish. Dispute that calamari were slightly robbery the pasta was well balanced with flavours; clams and mussels were well cleaned with just few pieces of sand noted and a right amount of great red sauce.\nConsidering I was in couple Patrizia's restaurants and I can confidently state you will not regret coming there."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNDktMDBRRRAB",
            "text": "Our first time here for my wife and myself. Excellent service, food was great. I especially loved the seafood pestore. We also had grill Octopus. A small Chacuteria board. Orange cake, key lime pie for dessert, and Cappachino's. The weak link at this restaurant is the wine list. Not a large variety and a lot of well known names. But for me I don't drink, it's my wife. Very large menu, with a large variety. Lots of specials every night. I will be going back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubjZIMHJ3RRAB",
            "text": "This review actually requires two parts. Because you have your sit down restaurant and bar area and then you have the take out pizza. The restaurant section is a good size and clean. The service is good as well. Most importantly the food was good. Fried Calamari, Vodka Chicken Parm and the Margherita Pizza were all good. I think the desserts could be better.\nThe take out pizza was expensive. About $52 for two pies. Honestly the pies were average. 7.3 rating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybU9hdXh3RRAB",
            "text": "Dined in the bar area where we received great service and excellent food. All good tasted fresh and was seasoned well. Drinks were also good and mixed properly. The only criticism would be it was a bit loud as it was a packed night but did not feel like I had to shout to talk to my fiancé."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOVAzY3RnRRAB",
            "text": "Patrizia's Taverna is a true gem. Everything is fresh and handmade, making every bite delicious. The service from John was outstanding; he was attentive and knowledgeable. The handmade pasta was exceptional, with perfect texture and rich flavors. I can't wait to return!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvb2NiRVBBEAE",
            "text": "Love this place! They always do it right ..creative specials and the staff is top notch! A must visit .. I loveeeeee the pasta purses"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3d29yYXNRRRAB",
            "text": "Delicious food. Excellent service. Our server John was especially helpful in selecting a great wine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMN0wtZldBEAE",
            "text": "Food is awesome! Everything is fresh and delicious! From bread to dessert! Ambience is very clean and nice,staff simply amazing❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOFlmT3BRRRAB",
            "text": "Amazing food amazing atmosphere !! Owner was very kind and welcoming and our server Mateo was awesome ! Will definitely come back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnanF6SjZRRRAB",
            "text": "Went with a party of 16. No special occasion, just work friends for dinner. Ala Carte (not family style).  We ordered appetizers, pizza's for the table and our entree's and EVERYTHING was delicious.  The wait staff was more than attentive to us and very professional and accommodating. I believe everyone was pleased with their choices and people took food home.  The drinks were also spot on.  The only negative would be the parking but even that wasn't so bad. We were very pleased and I look forward to going back. The atmosphere is much better than the Amboy Rd restaurant.  The noise is more acceptable and the crowd more civilized. The tables are not arranged on top of one another and the decor is nice and as far as I know, none of that loud birthday celebrating every 15 minutes which was great. I enjoyed the restaurant but this atmosphere is much more enjoyable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYOHRxUEp3EAE",
            "text": "Excellent food.  Excellent staff and great atmosphere.  It's a great place.  We usually go to the other location in SI, but this is even better.  Please talk to John and he will take care of you.  Excellent service.  Oh yeah, get the family style.  A must."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6a3ZTcjZRRRAB",
            "text": "Excellent food and awesome ambiance! Vinny and the crew deliver amazing service and the restaurant is beautiful. Great all the way around and reasonable prices, especially for families! Will be back soon!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eUtybG93RRAB",
            "text": "This place is absolutely gorgeous! It's so modern, crisp, and clean. Parking is thoughtless, which is one less stress when trying to have a nice dinner out. The food is traditional Italian with a twist of other flavors and treats. The pizza dough is unlike any other. Most of all, I never feel rushed and always feel like the staff is so pleasant and accommodating. Love it here!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcDdxMzlRRRAB",
            "text": "I recently had the pleasure of dining at an Italian restaurant that truly exceeded my expectations. From the moment I walked in, the warm and inviting atmosphere. The decor was charming and reminiscent of a traditional Italian place.\n\nThe menu offered variety of classic Italian dishes, making it hard to choose! I had the calamari, baked clams and delicious vodka pasta. The margharita is phenomenal.The portion sizes were generous!\n\nOur server was attentive and knowledgeable, providing great recommendations and ensuring our experience was great! The bartenders surprised us with exotic drinks. To top it off, the owner introduced himself to the table and made us feel very welcome. Super friendly, professional and gave us a shot of lemoncello. It was outstanding.\n\nOverall, this Italian restaurant is a true gem. Whether you're a fan of traditional Italian food or looking to try something new, I highly recommend this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRel92MmtBRRAB",
            "text": "I had high hopes when first sitting down on a quiet Friday evening at 6:30 to celebrate my husbands bday.  But as night went on, service went down hill. Drinks were 👎  Food was good so it made up for the lack luster of experience.  Would I come back again🤔maybe?! The pizza was excellent!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveFlxMEd3EAE",
            "text": "The new slice joint on the other side of the restaurant with the best Grandma square after Lenny’s closed on 86th has become one of the best in the city. Thank you to everybody running it inside, it was a class act dealing with Peter."
        }
    ],
    "reviews_count": 58
}