{
    "name": "Arka Mediterranean",
    "place_id": "ChIJCxl5HQBJwokR3hOtKdKQLyk",
    "grid": "SI2",
    "address": "628 Midland Ave, Staten Island, NY 10306, USA",
    "rating": 5,
    "user_ratings_total": 79,
    "phone_number": "(718) 524-4022",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNGJtMTRhMk5tZDFaT2JqVkNRVE4zVG01QmFXYxAB",
            "text": "Hi. What happened to Arka??   I just went in and found out that it sold to new owners.   Where. Where did the old owners and delicious food go???   Please. Open up again. You had the best food.  Location was not great BUT the food was AMAZING. Please come back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213emIyUlZaVGgxWkdKcVJVcEpWakZ0TlhSRmIwRRAB",
            "text": "My boyfriend and I had the pleasure of having early dinner at this establishment yesterday. The food & service was exceptional & the interior of the restaurant is gorgeous. We will definitely be returning."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsM09IZGpha0kxVWxZd1NGSkVNMXBsVDNkMllVRRAB",
            "text": "We were on the way to the beach, we were lucky to find this restaurant.\nAll the food that we ordered were beyond expectation and Di mare risotto was so flavorful, great way to experience mediterranean food !\nWe absolutely loved this place :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTU9GRkJhbEpRTFhsVVZVUTVaMGMwTWpsMU4zYxAB",
            "text": "Vinnie one of the owners was very hospitable.  He made a delicious recommendation for traditional fli and it did not disappoint! Its layered potatoes with honey and cheese on the side.  The ambience is calm and cool. Modern vibes. Great music , low euro pop//Edm. We ordered potato salad (comes with eggs, absolutely delish) with seasoned grilled chicken plus the risotto de mare (requested spicy and accomodated). The risotto was cooked perfectly and the clams and mussels were so fresh. The location is easy to get to with ample street parking. We had the lunch menu. Dinner menu was also available at 1230pm on a friday. The parking lot is strip mall like and since there are no other businesses in here , it makes it easy to park for now. Dessert was fried dough croquettes which tasted like fresh donut pieces and the carrot cake was 20/10 not too heavy. Fresh whipped cream, fresh cake and icing as well.  Will definitely return soon!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQmFFZzJNMmxyVEcxV1IwSjNhRlYwVWtSdU1tYxAB",
            "text": "We were a large party that came in on a Sunday afternoon.  They have a great atmosphere and a clean and crisp atmosphere with fun tunes. Service was a bit slow and the waiter forgot my wife’s dish because he didn’t write any of our orders down as a party of 8. They were apologetic and gave us desserts for the road to make up for it. All in all, a fun place for some cuisine that we don’t usually get:) give them a shot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMlJtcG1iekJDWjJGUFpVaHlNRGN0VVdWWWFFRRAB",
            "text": "Awesome food and friendly staff. The classic burger is sooooo good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQ09YUlBUa1pIVEVKMWFFUjNaakpHUjBWcFVuYxAB",
            "text": "The owner was very kind and attentive, the food we eat is good and taste good and we have extra dessert… we are very full, recommend this restaurant 👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GU01rNVRTVFI2U0Vwb1IyVmZNR3RCUkZSeGQwRRAB",
            "text": "I must say the food was very good!! I'm usually not a RISOTTO kind of person but the PORCINO TRUFFLE RISOOTO was amazingggggg!!! Also the Arka Burger was very good as well.. will be going back!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMldVODFjalIwVG5Sa1VIUjBVbEYxVEZFNGFGRRAB",
            "text": "My son and I very much enjoyed our lunch here. Their menu deserves 10 stars, it has great variety of meats and seafood.  We had marinated calamari and lobster bisque soup. Both were beyond delicious,  especially the soup. They serve tasty…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPcjk2djJFaTgtRTdRRRAB",
            "text": "Great Experience and Delicious Food!\nHad a wonderful time at this restaurant. The service was friendly, and the food was absolutely delicious fresh, flavorful, and well presented!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdVI5SXlvOV83dkhBEAE",
            "text": "Very nice mediteranian place. Food was delish, fresh and made to perfection. Service was very good, owner and waiter was doing great job. Hope to come again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVmR6RmhXVWhRWDNSSlIwSXlhRk00Y0VoYVZGRRAB",
            "text": "Excellent food excellent service one of my favorite restaurants ever !!!! I’m so glad to get a place like this on the island !!!! Can’t wait to go again !!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taS1MzbEpaRTl2UkZkWmNrOXdabEZWZEVsRVRrRRAB",
            "text": "As a new place  it is a really successful Mediterranean restaurant with good food where you can go with your friends I like it here man 🫡"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Q1ZHTjJSR1k0WTAxb2FIaEtOVEJETm5kWWVHYxAB",
            "text": "I saw a post on a local facebook group about this place, the person was raving about the food and decided to give it a try. We ordered food for pick up from the catering options. All the packages were great options very hard to choose from. The salad was delicious, chicken franchise cooked to perfection, eggplant rollatini so good! Mussels were cooked just right. The sauce was so good to dip the bread into. Everyone enjoyed the meal. So happy we got this gem in our neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OU1YyTXhhV2hPTXpaT2FXZGFkRjl5Y0ZKelpIYxAB",
            "text": "The food was incredibly delicious, full of rich, authentic Mediterranean flavors and made with super fresh ingredients. The service was warm and welcoming. Highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOREhuNDZsNy1PTmh3RRAB",
            "text": "Excellent meal! Pasta, entrees,  and dessert all delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLLUswS0tUM09ibUN3EAE",
            "text": "Super delicious food and the service was amazing!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMNndtN191c0l5RjdRRRAB",
            "text": "AMAZING! Chose Arka for a private event/celebration and couldn’t have been more happier! Service was great, food was delicious and the care was superb. This is an example of what restaurants should be like! Thank you guys for making this memory special for us!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObml5dmZuZy1TRWNBEAE",
            "text": "We had a great time at Arka Mediterranean!\n\nThe food was absolutely amazing, everything we picked was full of flavor and beautifully prepared. You really can’t go wrong with any dish on the menu. The staff were warm, attentive, and proactive, making us feel genuinely welcomed throughout our visit.\n\nWe truly enjoyed our time here and will definitely be coming back. Highly recommended!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOU3U2dlczbmZqb0N3EAE",
            "text": "We found our new favorites restaurant on Staten Island . Delicious Mediterranean food and dishes not found on Staten Island .  Love the branzino  whole fish in salt and sardines .  And for the locals a fantastic Italian cheesecake."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLcjVzcUhOcV9QRzh3RRAB",
            "text": "Excellent healthy options. A unique wonderful experience .  The only thing that is better than the food is the service. Everyone who wants to have a great culinary experience must try it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUF9ydkd5MVAyUVRnEAE",
            "text": "Excellent authentic food.\nSuperb service!\nThank you!\nWill come again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNQ0lodXFUMm9ta1ZnEAE",
            "text": "Excellent customer service. Warm,  friendly staff. Had a wonderful Mother's Day dinner. Looking forward to our next dinner."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNkszZXVZcHBmT0ZnEAE",
            "text": "Amazing , welcoming & also great food loved coming here for Mother’s Day. Will come back with my girlfriend !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYlpoTnJLdmZ2ME5BEAE",
            "text": "Everything was delicious and great service and atmosphere. We really enjoyed this place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMnZMYXdnRRAB",
            "text": "Excellent food, top-notch service, and a perfect ambiance!\nFor the main course, we had the ossobuco, ribeye wrapped in beef prosciutto, and filet mignon—not a bite was left, just happy bellies :)\nThe appetizers were just as impressive!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbllfZXdnRRAB",
            "text": "If you’re looking for a phenomenal dining experience on Staten Island, look no further than [Arka Mediterranean ]. Their menu is a culinary masterpiece, offering an incredible selection of dishes that cater to diverse tastes and preferences. The atmosphere is warm and inviting, and the staff is friendly and attentive, making every visit a true pleasure. I’ve dined at [Arka Mediterranean] several times and have never been disappointed – it’s truly a must-visit destination for any food lover."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc2IzZGFREAE",
            "text": "Well now... A nice little Mediterranean place on Midland.  Really good portions, and attentive staff..  we had the fli, a traditional Albanian dish and it was great.  Deep fried feta was very tasty with a hint of sweetness.  We split a lemon chicken and baked chicken... Both were interesting and well made.    Honestly we had no room left for dessert to try anything else.  I would say split some entrees and enjoy the appetizers for a great meal.  Oh .. they had Peja beer which is really good beer that complimented the meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc2U2YlVREAE",
            "text": "Amazing food that came out yummy and quickly. The staff were especially kind, the owners spoke with me and were extremely down to earth. Definitely check it out!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdXBDUHhRRRAB",
            "text": "Good food and great service 👌 👍"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvejhfSEpnEAE",
            "text": "I recently had the pleasure of dining at Arka Mediterranean Restaurant, and it was an unforgettable experience. From the moment we walked in, we were greeted with warmth and hospitality, making us feel right at home. The atmosphere was cozy and inviting, with a beautifully curated blend of modern and traditional Mediterranean decor.\n\nIf you're craving an authentic Mediterranean dining experience with a blend of rich flavors and impeccable service, Arka Mediterranean Restaurant is definitely worth a visit. I'll be coming back soon for sure!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcTQtei1nRRAB",
            "text": "Excellent food and even better service… ask for Albino he’s amazing !!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveTczNWhRRRAB",
            "text": "Skirt steak and lamb chops were amazing, as was the service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvamRUNGN3EAE",
            "text": "This restaurant is new and we went there cause the reviews are high.guys the foods really delicious!! they use fresh ingredients.especially enjoyed their fig buratta and the branzini! Staff are nice!\n\nthe 5 star review didd not disappoint. this team deserves more shoutout!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc1oyZUNREAE",
            "text": "The best Mediterranean food in Staten Island by far…. Even if you’re on the south shore it’s worth the drive to midland Ave. Trust me, you won’t regret it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc2ZIdVJ3EAE",
            "text": "Arka is a true hidden gem. The Mediterranean food is absolutely delicious every bite is full of flavor and made with care. Their coffee is rich, smooth, and honestly some of the best I’ve ever had. What truly makes this place special, though, is the staff. They’re kind, welcoming, and treat you like family from the moment you walk in. The atmosphere is warm and inviting, making it perfect for any occasion. I would 1000% recommend Arka to anyone  it’s a place you’ll want to come back to again and again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOXJQNTlRRRAB",
            "text": "The experience you get at Arka truly stands out as one of a kind. From the moment you step inside, the owners greet you with an incredible warmth that instantly makes you feel at home. Their hospitality is unmatched, creating an inviting atmosphere that enhances the overall dining experience. As for the food, it is simply mouthwatering! Every dish on the menu is crafted with care, ensuring that no matter what you order, you’re in for a treat. Each bite is bursting with flavor, showcasing the culinary expertise that Arka is known for. Whether you're a fan of classic dishes or looking to try something new, you won't be disappointed."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc3ZHSXNRRRAB",
            "text": "Excellent food, service and atmosphere! Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdDR6QXp3RRAB",
            "text": "Arka had absolutely amazing food that left a lasting impression on everyone who visited. Each dish was a perfect balance of flavor, freshness, and creativity, showcasing the chef’s skill and attention to detail. From the perfectly spiced entrees to the beautifully presented desserts, every bite felt like a culinary experience. The ingredients tasted fresh and thoughtfully sourced, and the unique fusion of traditional and modern flavors made the menu truly stand out. Whether it was a casual lunch or a celebratory dinner, Arka never failed to deliver an unforgettable meal.\nOverall owners offer a heart warming experience specially Albino!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdC16c0dBEAE",
            "text": "I had an amazing experience at Arka Mediterranean! From the moment we walked in, the atmosphere was warm and inviting, with a modern yet cozy vibe that instantly made us feel welcome. The staff was attentive, knowledgeable, and genuinely passionate about the food.\n\nEverything we ordered was full of flavor and beautifully presented. You can really tell they use fresh, high-quality ingredients.\n\nWhat stood out the most was the balance between traditional Mediterranean flavors and creative presentation — a perfect mix of authenticity and innovation.\n\nWhether you’re a fan of Mediterranean cuisine or just looking to try something new, Arka is definitely worth the visit. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMXFQN19nRRAB",
            "text": "When I first walked into the restaurant the ambience and atmosphere was outstanding and felt great energy when entering. Grabbed a table and the waiters came off very polite and nice. The food was amazing and very tasty. And what was better since I’m a big desert lover was the dessert."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaV9TWS1nRRAB",
            "text": "I really don’t know where to start with this restaurant. From the decor, to the waitstaff to the food every thing was AMAZING! The octopus was so light and tasty cooked perfectly. The steak was so nice and delicious cooked perfectly and seasoned very well, while all the food we had was amazing the real superstar was the coffee to end a great meal. The foam on top of the espresso held the sugar which is a sign of a great espresso, not burnt and not bitter absolutely the perfect pour. The service was great and the restaurant was very clean. A great addition to Staten Island and I can’t wait to go back! 10/10"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa1A3cW1BRRAB",
            "text": "Came by for lunch couple days ago to try this new local spot. It's very pretty and clean inside. The menu is simple and diverse. The service was great and our waiter was so kind. Our food was very tasty; we got lots of different things to try including the skirt steak which was very flavorful and juicy. I think they can improve on the vegetables it came with, I would substitute that for something else otherwise. Sweet fresh fruit and a cappuccino to end the meal was delicious."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBak1hTnFnRRAB",
            "text": "Arka Bar & Grill: A Hidden Gem with Great Food and Drinks\n\nI recently visited Arka Bar & Grill, and it did not disappoint! The atmosphere is stylish yet cozy, with a beautifully designed bar that makes for a great dining experience. The warm lighting and elegant gold-toned counter give the place an upscale feel, but it’s still relaxed and inviting.\n\nFor my meal, I had a dish with a creamy, pink-hued mashed side topped with a savory sauce, paired with a grilled protein covered in sautéed mushrooms. The flavors were rich and well-balanced—the mash was smooth and creamy, while the mushrooms added a delicious, earthy depth to the dish. Alongside it, I had a cocktail that was well-mixed and refreshing, complementing the meal perfectly.\n\nThe service was excellent—friendly, attentive, and quick without feeling rushed. The portions were just right, and the presentation, while simple, still looked appetizing. Overall, Arka Bar & Grill is a great spot whether you’re looking for a casual dinner, a drink at the bar, or a nice place to unwind with good food and great company.\n\nRating: 5/5\n✅ Great ambiance\n✅ Delicious food\n✅ Excellent cocktails"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM19iSjZ3RRAB",
            "text": "The Tuscan Red Snapper may have been the best fish I’ve had in my life. The atmosphere was incredible, with a dedicated professional team of servers.\nWhen I come back to New York, I’m specifically returning to Staten Island to revisit Arka. It’s worth the schlep for NYC natives and tourists alike."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOXMyVktBEAE",
            "text": "Amazing people, amazing food… the atmosphere is elegant and such a great vibe. They gave us a free cheese platter that words can’t delicious it was. We’ll be back very soon"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbXVQaXF3RRAB",
            "text": "Delicious food, And very great service !!!\nEverything was amazing 🎊"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcmVQTE93EAE",
            "text": "I don’t usually write reviews, but the service really stood out as exceptional.\n\nThe food was great, highly rec the seafood linguini, or the mixed grill (but I suggest u ask for some yogurt sauce on the side)\n\nThe chef came out after the meal which was very nice. They did a lil slice of cake for my bday and sang (not usually a fan of this but was wholesome). Later they brought a plate of sliced fruit probably because they heard that we don’t really have sweet tooth’s. They really went out of the way, and the bill was super reasonable.\n\nLocation is a bit random and can seem out of the way in the winter but I imagine very nice by the boardwalk."
        }
    ],
    "reviews_count": 48
}