{
    "name": "Al Aqsa Restaurant Falafel House",
    "place_id": "ChIJq44gFGFPwokRdXnTv9Al5a0",
    "grid": "SI2",
    "address": "1758 Hylan Blvd, Staten Island, NY 10305, USA",
    "rating": 4.9,
    "user_ratings_total": 587,
    "phone_number": "(347) 825-2032",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkclNqSjNkM1J6V0RCbmIxVnRhVEJHYTI1dFZXYxAB",
            "text": "Best shawarma in new york city, the service is amazing,.the manger is very generous. You should go and try it."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UFJXMUthbmxYZDNaNlNFRnlTRGRuUTBaR2VuYxAB",
            "text": "I had the large chicken shawarma plate and it was delicious! Very large portion as well. They also gave me a sample of the falafel when I asked how it was and it was delicious as well so I got an order of that too. Than I tried their homemade baklava and that was also a hit! Definitely try this place out, the people are also very nice working there!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwQmRtbFlaSFIwZDJaYVJUbHZNVkpVWjIwdGRrRRAB",
            "text": "Restaurant Falafel is one of the best spots on Staten Island! The food is always fresh, flavorful, and perfectly cooked — especially the falafel, kebabs, and hummus. Portions are huge, the fries are crispy, and everything tastes homemade. The staff is friendly, service is quick, and the prices are super fair for how much you get. Definitely my go-to for Mediterranean food!"
        },
        {
            "date": "수정일: 4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcXU3Tm9RRRAB",
            "text": "Very nice stuff, delicious food,  everything is clean. I extremely recommend to try it 👍🏼👍🏼👍🏼"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sc2RXOUtjMDFGVGxOTFRHWjZNRk5uUzNKWloyYxAB",
            "text": "I feel like I’ve had a lot of bad chicken shawarma now? It may be ruined for me forever? Because the wrap I ordered was absolutely delicious. Will be driving over the bridge just to go here. Packed with flavor and really moist chicken. Perfection."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wblVVWkdaV2xVVm1kNGIwMWlOMGxzUzFkUU1WRRAB",
            "text": "Excellent food and really enjoyed the food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSWFYVlZXbHBFWDNRelMxOTJibmRhWjBkVmRYYxAB",
            "text": "Great restaurant with delicious halal food! Everything is fresh, portions are generous, and the service is friendly and attentive. Definitely coming back! Thank you"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeU1sUlhUM2h3UVMxNFZrbDRaSEJUV2kxdmNsRRAB",
            "text": "Great food, great service"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkM1NqaFpNVmhaVUVOUGFERktWVGhtV0RWb1gzYxAB",
            "text": "Very very friendly environment, they have amazing food the best falafel and shawarma you can eat in Staten Island. The Palestine and Algerian flag sewed together was so nice. the people there are very very friendly. Very very nice atmosphere as well, the people there are very welcoming."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oclkxZE5TRGN6VTJoVFJXZDVibVEyUzNsSmMyYxAB",
            "text": "The best food, service , super clean , very friendly, it’s my favorite place"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOc01uRlZaVTVEZVhwTmNXRlpUVTU2Y0hGU1pFRRAB",
            "text": "Very nice staff and husband and wife are professional and welcoming🙏❤️❤️❤️🙏 Big plus in my book 📕 Now to the falafel review : I order two pita bread falafel not the regular falafel in a wrap - their is a difference- but are delicious, I love the pita bread texture- so I’m bias lol. It was so delicious, the elder cabbage, the hummus are fresh! Order fries on the side to dip the hummus and you are on a foodie Heaven dream! We also tried Their cheesecake- the wife - make a delicious simple cheesecake no cream no strawberries- just good delicious cheesecake!  I recommend Only this place for falafel, vegan friendly options, and super friendly staff."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSk4zQnZhUzF4U2xoTVFYRTNhRWxNZEhCTVFVRRAB",
            "text": "Incredible food and service 10/10 would recommend."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TlRXRkxTMjVCWTFoSUxWSm5XRXROYlZOaFZWRRAB",
            "text": "The food was average but I saw someone in there wearing a Hamas T shirt"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOS1NFbHdTM0pzWkRCMVRIVXdiMjlFT1RKNGFXYxAB",
            "text": "very good food good price good service guy was very nice"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNWJXRTBaME5yTkVSeE1rZFpabEkyYlhWcmNXYxAB",
            "text": "Este comida número uno  estás muy rico 😋  quien gusta provar aquí en restaurante te va encantar aquí atiende muy bien alos clientes en este restaurante mediterraneo"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMlQyVkROVFpXVmxwME0zUnJWa1pzUVU5SWQwRRAB",
            "text": "amazing place!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5M1R6RjFjbnA0ZG5rNE1tNHlZV2xYU2t0WFVHYxAB",
            "text": "Amazing food!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadVNVZ3hOMlZCWkZWTU0yMUVWREV4T0cwMlZYYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nAl Aqsa is one of the best Middle Eastern restaurants in Staten Island! The food is always fresh and full of flavor — the shawarma, hummus, and falafel are amazing. The portions are generous, the place is clean, and the staff are very friendly and welcoming. You can really taste the quality in every bite. Highly recommend for anyone who loves authentic Middle Eastern Ty❤️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NWVVZ3pXbEpJWW01MFIzQnhaV3BuUVMxUVQzYxAB",
            "text": "Good food. Staff is nice for the most part except for One guy who works on the register. He is rude and has an attitude and just put a bad taste in my mouth. Good food none the less. Staff could slightly be better. Also please let it be known that bathrooms are not available to the public. Thank you"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Mi11OUdnEAE",
            "text": "Very nice decor and a great small family business with a lot of potential to improve. I love the great Palestinian decor. Food was good but can really use some more flavoring and seasoning with spices. There should be an option for brown and wholewheat wrap for people who are sensitive to White flower. Happy to have another halal option on the island and wishing the business to do well and improve. He's also have some authentic Palestinian Algerian food apart from the generic Arabic food.\n\nUpdate 7/23/25 Great place to make a stop for some lunch. Kofta platter was really good. The pistachio basbusa was good as well. Friendly staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSGVHeFNkVEZST1VaeFNVdzNWWHBFU0drM1YxRRAB",
            "text": "Best place for dine in clean and tasty food great customer service good restaurant for family and friends"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNU1XSmZUVVZLZVZWUmVsbGtTMHhNYTFoQlNrRRAB",
            "text": "OMG. THE BEST FALAFEL I HAVE EVER HAD IN MY ENTIRE LIFE.\n\nEnough with the caps. I really don’t know what else to say except that this beats pretty much every falafel place in the northeast.\n\nThis place is worth a trip to Staten Island just for this amazing falafel. Rant over."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wd1RWVndkMFZQUjFCSGRuRnRSa1pVTFZBdFZVRRAB",
            "text": "Amazing and very very nice environment and staff! 100/10!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aclJuaGllVTFrWjJoUE9VaFVVekZGZVZWd1luYxAB",
            "text": "Food is delicious and so fresh. Never disappoints. Everything they make is incredible and the customer service is amazing. Went in with 2 friends and they even let us try their mint lemonade which was amazing!! Will definitely be adding this to my regular rotation of favorite places to grab a delicious meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVFRuaHpiREJSVUZSM1prRmtkVzh5YVRsaVFVRRAB",
            "text": "Mixed platter with hummus and labni was delicious. The falafels are good too. Their cucumber mint lemonade is refreshing and tastes amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbVVIQlRkR0l6VDFOaVJGaG9ORXBPU2pWWGJIYxAB",
            "text": "I had a fantastic experience. It was unsurprising for the simple fact that I heard amazing things about this place. Really good service and nice people. I’d recommend this to anybody with a soul and a love for Palestinian food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMmFqUkJjMGhoZDJ3MllWVTBNRzlaU0hCcE1IYxAB",
            "text": "I had an amazing experience at this restaurant! The food was absolutely delicious – fresh, flavorful, and beautifully presented. But what truly sets this place apart is the mansaf – hands down the best mansaf in New York. Perfectly cooked lamb, rich and creamy jameed sauce, and fragrant rice that ties it all together. If you’re a fan of authentic Jordanian cuisine or just looking to try something unforgettable, this is the place. Highly recommended!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWlQxWlJNR2xGYlU1WFRYbGlWSGN0VEd0ZlRrRRAB",
            "text": "The food is fresh and delicious!!! I come quite a bit just for the mint lemonade!!! Everyone is kind and always smiling!!! Best falafel on Staten Island!! 🙏"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnek5rdHNSWGhQTUhCM1V6VkVYMGN3ZGxCeVdtYxAB",
            "text": "Amazing food , always fresh , reasonably priced , and everyone is so polite and respectful! Truly highly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSmQwbzJTSEJCWDFkVmFURktZMDVPWVZSb1NXYxAB",
            "text": "The best falafel! No need to drive out of the island to get some good falafel! Great service, and friendly atmosphere!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBd1ZrMUhPR1ZYUVd4aWNETlZVbGd0VW5GSVZGRRAB",
            "text": "Amazing food super clean"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNHVpNmNnEAE",
            "text": "Best restaurant and the food is delicious\n100% clean and the staff is amazing\nThe MUSAKHAN is the best, I felt I’m in Palestine"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVVExVnNPR0ZSTFRFM04zZGZaVmx2UjNZNGRsRRAB",
            "text": "Just ordered a falafel pita, SOOO good 👍.  Very fresh ingredients and huge portion for the price! Probably one of the best I've had, and I've had many. Place an order, you won't be disappointed! Yum!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKV05FdHpaVmgzWlhoU1dtbDNWREJwTkdWdmJtYxAB",
            "text": "I just picked up 5 falafel sandwiches, and they are by far the best I’ve had in New York. They taste just like the ones back near Al Aqsa."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbXFYYU5nEAE",
            "text": "The food is great\nNice people\nI recommend this to people I know"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRmExUktNV2RtVGxadU0wNUZiMjR0V21ONWVrRRAB",
            "text": "Al-Aqsa Restaurant is one of the best I’ve tried. The food is always fresh and delicious, the service is excellent, the place is clean and well-organized, and the prices are reasonable. Highly recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNVVYWnVVMFJrTW5oNlkxRlpTRTlXTVZoQ1RrRRAB",
            "text": "The food is more than PERFECT!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSU1RqaHBkazFvVlZkNFptOUhablJKUTI4MFRYYxAB",
            "text": "Good proportions. Falafel sandwhich and chicken shawatma were good. The deserts are good and cheap and yummy too."
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMVZrTlhWMDVSYVRRMFFYWTJjVEYyVkRoelJXYxAB",
            "text": "5/5 👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odGRHMVdaemhTZW13M1VWQjRRbUZOTUhGNVIzYxAB",
            "text": "Best restautant ever !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNk9UQlRWREoxV1c1eWJ6RldiREo2ZEhWelIzYxAB",
            "text": "f you’re looking for the best shawarma in town, this is the spot! The meat is always juicy and full of flavor, and the portions are generous. I also tried their mojito — hands down one of the freshest and most refreshing I’ve had. The service is super friendly, and the atmosphere makes you feel right at home. Highly recommend this place for anyone who loves great food and a good vibe!”"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPU0h6cEdiam9EaXR3RRAB",
            "text": "If you want fresh and authentic Palestinian/Middle Eastern food come to Al Aqsa Falafel House. Fresh food prepared every day and made with love. Their meat and spinach pies are amazing. Hands down the best falafel’s I’ve had in New York City. I drove by this place about a year ago and considered trying it and since then I’m here at least once a week and I’ve never been disappointed. The chef and owner is on point. Food is seasoned very well cooked perfectly and extremely fresh. Their customer service is beyond great and very welcoming. I feel like I am eating at home. I feel like I am welcomed as if it’s my own business. Thank you to everyone at Al Aqsa. Keep up the great work."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJWERnS2pHOS1pZnNBRRAB",
            "text": "Al Aqsa always has such yummy and delicious food! My family and I always come here and our favorite item on the menu is the shawarma araby. Delicious is truly an understatement, it’s too good!! They also have so many drinks and desserts to choose from.\n\nThe owner and all the workers there are so friendly and hospitable. They always make sure we’re satisfied with everything 😊"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sweGVIRndSM1ZXTWxOUGJsTm1PR3RQV2pWVVFVRRAB",
            "text": "Amazing food with even better staff!! Food is authentic and full of flavor!! Highly recommend!! 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYLTdIODRRRRAB",
            "text": "This restaurant makes most fresh and authentic middle eastern food in Staten Island. The owner treats his customers like family. Authentic Baklava, great quality food, great atmosphere and I will definitely visit again! Thank you!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOXNhb1lnEAE",
            "text": "Amazing Palestinian Cuisine!\nI had an incredible experience at this restaurant!\nThe food was full of authentic flavors, fresh, and perfectly prepared. The hospitality was warm and welcoming, making me feel right at home.\nYou can truly taste the passion in every dish.\nHighly recommend and can't wait to visit again!\nBest of luck for you guy’s 🙏"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdEtLQzVnRRAB",
            "text": "I am hesitant to write this review as I selfishly want to keep this gem all to myself, but this place truly deserves a raving review so here we go…\n\nThe food here is phenomenal.  Today we had the chicken shish kebab wrap with pickles which was packed with tender, flavorful chicken and a perfect crunch. The lamb shawarma on pita was equally impressive, boasting rich, savory spices. We also had the beautifully presented falafel platter, which is the best I’ve had anywhere, ever.\n\nThe restaurant itself is small, with some indoor and outdoor seatings.  Most customers order take out but it is very comfortable to dine in as well if you prefer to eat your food right away, like me.\n\nThe ambiance is welcoming, and the service is friendly and efficient, making the whole experience even more enjoyable. Whether you're seated indoors or enjoying the breeze outside, Al Aqsa provides a comfortable and inviting atmosphere to enjoy some truly outstanding food.\n\nSince they’ve opened couple years ago, I’ve been here no less than 40 times.  You’re truly missing out if you don’t give this place a try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NThQMmNREAE",
            "text": "This is by far the best falafel 🥙 I have ever had! My partner and I were visiting from NJ and I wanted to have lunch before we went to our family’s house. Saw this place online with 4.9 stars and said to myself I HAVE to try this. After finishing our leftovers just now, I am definitely going back for more when I am in the area. The service was lovely 😊 they gave us some falafel to try and it did not disappoint. Everything is so flavorful. Keep up the amazing work!\nParking is available in front of the store or on the street."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJNjZoZFBUaVlPeS13RRAB",
            "text": "I’ve been coming to this restaurant for a while now, and every single visit reminds me why I keep coming back. The food is consistently fresh, flavorful, and made with so much heart. It truly feels like a taste of Palestine right here in the city. And don’t forget to try this Palestina lemon lime flavor çok güzel ya!!! 👌🏻…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM01TMUtZbUV4TkVWdWJqRlNjWFJ6YkZwUFIzYxAB",
            "text": "The best falafel I ever eat in my lives 😋\nEat falafel and live longer\nAlso the Hummus it's like home made\nAnd the workers in the store very kind"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcnQ3d0t3EAE",
            "text": "My husband and I wanted to try something new. We were so googling places to eat in the neighborhood and this restaurant came up. We were not disappointed. The food was amazing, full of flavors and the colors of the salad and pickled veggies were such a sight to see. I had the falafel salad and it was absolutely delicious. The hummus was the best tasting hummus I’ve ever had and the baklava was to die for. Definitely going to be ordering from this place again and again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNTZ1dkdnEAE",
            "text": "This restaurant deserves more than 5 stars!\nYou have to give it a try.\n\nThe food is nothing short of heavenly. Every single bite from beginning to end was delicious.\n\nThe staff is very friendly. They greeted me as soon as I came in with a smile on their face. They also ask for feedback about the food, which means they really care about perfecting their craft.\n\nAnyways, too much talk from me. Come experience this for yourself!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNmMyTXV3RRAB",
            "text": "The place to be ! :)\nThe team especially the owner is so welcoming.\nWe ordered Chicken Shawarma, Falafel, hummus salad. The food was so delicious! The Chicken Shawarma was tender and flavorful, the Falafel was crispy and tasty, and the Mojitos were refreshing. I highly recommend this restaurant for a tasty meal."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5M3BleGZnEAE",
            "text": "I recently had the pleasure of dining at the Al Aqsa restaurant Falafel house in the heart of Staten Island, which seamlessly blends Egyptian and Palestinian cuisines. The food was incredibly fresh, made from organic ingredients, and served with an authenticity that transported me straight to the Middle East. The dishes were not only delicious but also beautifully presented, capturing the essence of traditional Mediterranean flavors. This restaurant is a hidden gem for anyone seeking an authentic and delightful Middle Eastern breakfast experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdFpuWm9XRFJyWW10d05sTkVZMUphTFdWMFJsRRAB",
            "text": "I really enjoyed it! The taste was amazing, the presentation was beautiful, and the staff were very friendly and welcoming 💯"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNwNXN3QxAB",
            "text": "The owner and his wife took care of us like we were family.  The food was delicious.   The flavors out of this world.    You also have to have the hummus.  It's incredibly creamy.  I could have just eaten the hummus snd been happy.  You must visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaHBpY3NRRRAB",
            "text": "The owner and staff are very inviting and the e food they make is amazing! Their original location is in bay ridge Brooklyn which I have been going to for years. When I saw they opened here in Staten Island I was ecstatic! What better than a taste of home, close to home. Falafels are amazing the shawarma is always on point and they always take care of you here. If you haven’t been there yet, you have to put this on your list!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWbHNIeG9BRRAB",
            "text": "I never write reviews but this place was so good I just had to! I came for lunch with my boyfriend to try for the first time and we were blown away but how good the food was. We got the Chicken Shawarma platter (large) and the falafel wrap with fries. We also got the hummus with pita bread. My boyfriend always gets chicken shawarma but he said that is the best one he’s ever had (and he’s super picky). It was my first time trying that and I couldn’t believe how good it was! I will be ordering that next time I come. Everything we ordered was so fresh and full of flavor. The staff was very friendly and the place was very clean. There is limited seating inside but we were able grab a table for the two of us. There is also outdoor seating available. We will definitely be back and we 100% recommend for everyone to try it. We will also be telling our friends and family to check this place out!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYmxfNXpheGNLejVnRRAB",
            "text": "This is my first time coming here with my family and definitely we will come back. the best falafel and hummus I never had in New York their shawarma too it so delicious, the store is very clean and the workers are very welcoming. I really recommend this place for everyone who is looking for clean and delicious food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbHVtM1pREAE",
            "text": "If you’re looking for Middle Eastern catering, this is the place to do it. Staff is really friendly and great people. My catering order was delicious and the Hummus and Falafel is the best on the island guaranteed! I can eat it everyday. Thank you guys!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIb0o2VGNBEAE",
            "text": "I came to state island with my husband I’m from Wisconsin they food was so good and amazing the hummus and falafel and the mix plater so delicious definitely will visit again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMWVUdkJnEAE",
            "text": "My go-to place for food on the island! Great tasting food and drinks! Very good prices and even better service. I always come here and try different things. My favorite is their Mint Lemonade and Strawberry Frozen drinks and their Chicken Shish sandwiches and Mixed Gyro Sandwich! I definitely recommend everyone to come and try!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRk9IcHNabkpEUTIxbWIzQlJkMGd4VGxoRU5VRRAB",
            "text": "Excellent experience from start to finish. Food was fresh, flavorful, and beautifully presented. Service was attentive and friendly, and the atmosphere was warm and inviting. Great value for the quality—highly recommend to anyone ! 5/5"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIZ3JqX1p3EAE",
            "text": "Definitely worth trying out! Food was fresh and tasty. Nice staff and very welcoming. Very authentic taste"
        }
    ],
    "reviews_count": 64
}