{
    "name": "Sea Bar",
    "place_id": "ChIJrzlT8E9JwokRspP_AEGIqSs",
    "grid": "SI2",
    "address": "2636 Hylan Blvd, Staten Island, NY 10306, USA",
    "rating": 4.7,
    "user_ratings_total": 254,
    "phone_number": "(718) 734-2249",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWd1pGSkJVRkZIY0RWRWFYa3lUWFV6UW05cmNGRRAB",
            "text": "Fabulous food and service. Place is spotless. They have booths. We love the place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214YVNWQkRXVEUyV1UwNUxVcHRjMll3VjFCWE5XYxAB",
            "text": "happy hour is immaculate, such great prices for the amount of food you get during it. the freshness of each meal is out of this world. the fish tacos are to die for, all the staff are incredibly nice."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMVdEUmphRVpHWm5JeE1qaFlhVlpMZVZOT1gzYxAB",
            "text": "My pasta was super spicy and no one mentioned it. The waitress was nice and tried to fix it, but the timing was off — salads came after the mains, and pita for spread showed up when we were almost done eating. Steak for my son was also burned. They offered us free drinks, which were fine, but we hadn’t planned to drink more. Overall, pretty disappointing experience."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUlgyTlBPSFYxVjJSQldrbzFVbG96YVhoRlUwRRAB",
            "text": "Food is really good.\nThe oysters were so sweet and fresh, Branzino was  tasty,- nicely done, Octopus was overdone and cut into bite size pieces which made it tough and chewy. Chilean sea bass was awesome, Fagri was delicately flavored. Faroe Salmon was cooked to perfection (medium done).\nThe seating area we were given was at a private section.\nIt wasn't really busy but the service was really slow and the wait staff was nowhere to be seen when you needed one. Understaffed, maybe?\nReservation was at 7 pm and appetizer came in after an hour and main course for another hour and dessert and coffee half an hour.\nIt was already 10pm by the time we left the restaurant.\nWe enjoyed the meal but not really a good experience when all you want to do is sleep right after meals."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVdFFqYzBTa0pwV1hKT1EwTnlla3RhVVRaU1QxRRAB",
            "text": "I am very happy that such a wonderful restaurant has opened on the island, and I want to return there again and again."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdlpERjBjVjl2UVZWeFNqUklUR05QVVVKNlpXYxAB",
            "text": "First time at Sea Bar for a family dinner on a Saturday afternoon   The atmosphere was very nice and the staff, although friendly, not overly attentive. The drink selection was great but unbalanced. So much alcohol you couldn’t enjoy the flavor of the martini. The food was very good with a great presentation, but expensive. I know food costs have risen but this was a bit much .. $46 for sea bass  and the grilled shrimp were dry. The remaining meals were delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toT05HWTFRMFZaUlVSTk1HRnFUVzl1YkhwcGQzYxAB",
            "text": "Just wow. Mediterranean food is so delicious and I can’t wait to try this spot again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaFJuQXdjbk5mY1VkSFJtMUtObFpPUTJSRlZXYxAB",
            "text": "Wonderful service\nJumbo Shrimp 🍤 too much shells and heads. Overall good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVmEwazRTa293UlZadGVHOVNVRkpzTVdScFVVRRAB",
            "text": "My family and I went to Sea Bar on Wednesday, and despite it not being stated anywhere on the online menu or website, they had replaced the entire menu with a four-dish course. We decided to give it a shot anyway, but every dish arrived late to the point that we'd have long finished digesting the first dish by the time the next came out. By the time the main dish arrived we were tired and wanted to go home. The complimentary bread also was not given initially and only came out after about an hour. The food was not bad but it wasn't fantastic enough to warrant the wait."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeVV6UnZObWRYVlVoek1ETnRjbk5oVEVoWVNHYxAB",
            "text": "Excellent  experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkT1UxVlNVWGt5UjJwa2EwZzFUR0ZJU2xRMldrRRAB",
            "text": "Great place, service was good and food was amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toak9Hd3laMUJhU0ZGd1NGQndZM2t6V25CVGIyYxAB",
            "text": "Now all I can say is I found my very place to eat on Staten Island. The whole menu was awesome. My food was delicious from the starter to the dessert. Whoever was the Chef that night was on point. I will go a million times again. The mood was right, friendly people, smooth atmosphere, and delicious food 😋.  Love, love, love ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5T2VVb3hhM1JDUlRSS00zRlhMV3BHZFc1S2VXYxAB",
            "text": "Went there for the first time for lunch and enjoyed it so the next day we took our adult grandchildren for dinner and enjoyed it even more.\nFood was great and so was the service.\nWill definitely go back again😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WME5WUjBOSGhQTlhOQ1ZqRklWVVZuYkU1MmMwRRAB",
            "text": "Food was very good. Appetaizers were very delicious. Octopus, zucini tower and tuna tartar was perfect. Highly recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UlYwbFhSbU5EYzJ3d1JWRjZVRVZRUkZwS2VFRRAB",
            "text": "Everything about this place is wonderful.  The food..service and a clean bathroom! Sometimes you go to eat at a nice place and the restroom is trashed...at this place the restroom is an beautiful as the entire experience. The owner Michael is attentive and professional. This restaurant should be posted all over new york. I will keep going again and again and again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTFNYaHZkbU40ZEY5cVlqUjNZbkZmTWpWc2JHYxAB",
            "text": "Absolutely phenomenal! I didn’t even get a chance to take photos of the food—because we devoured every bite the second it hit the table. This was, hands down, some of the best food I’ve had on Staten Island.\n\nWe ordered a spread of dishes to share: shrimp cocktail, tuna tartare, calamari, feta and tomato salad, grilled octopus, veggie chips with tzatziki and hummus—and every single item was fresh, flavorful, and beautifully prepared. The flavors were balanced, the ingredients top-notch, and the presentation was elegant even without a camera roll to prove it!\n\nYou can really tell when the restaurant takes pride in what they serve, and this place absolutely delivered. Can’t wait to come back and try more!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wa1dWWkJNRzVtWnpWcGFtUlRZVU5TUzNFdGVWRRAB",
            "text": "Ok, here it goes.\nI normally don’t write reviews because, typically, you get what you expect—you go out to dinner, eat your food, and go home. But tonight was different.\n\nWe ended up at Sea Bar completely outside of our original plans, and I can't stress enough how happy I am that it turned out this way. The food was absolutely amazing, the ambiance was beautiful, and our server Gabrielle was incredible.\n\nWhat truly added the cherry on top was the hospitality extended by Michael, the owner. He made sure our experience was flawless from the moment we ordered to the time we left the restaurant.\n\nI can’t say it enough—everyone needs to try this place. If you haven’t yet, please do so soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gb05IUjFSSE5SUWpCWlkyMVhNekphZDBGS1VuYxAB",
            "text": "The food was great. The atmosphere was awesome. All right, the service could use some help."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVVFtbDRjRzlyTTI5WVRtRklabU5uUjJkdk1VRRAB",
            "text": "Underrated gem. Food is flavorful, fresh, and colorful. Environment is aesthetic and pleasant.  Service was seamless. Just the right lighting, music nice volume. Pro tip— try the bougatsa, a delicious custard-filled pastry— WORTH THE WAIT! Even the wine was a perfect pairing. I can’t say enough. Enjoy. (I bought this on Groupon just to check it out. Glad I did. I’ll be back.)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzM1ZrSlJlR3hhUkZGNVoxSXhZMFk0YzJoSFoyYxAB",
            "text": "Beautiful decor. Clean and bright. Excellent staff and food extremely tasty. Highly recommend!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWFgzUmpXRXQwV2pKSVlpMWZWVFptYUhwNllWRRAB",
            "text": "The food is delicious. Everything is unbelievable. I loved it and so did my husband."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SFVXaFRUbk5sVnpkM2FqUmliM1ZITVZST2NVRRAB",
            "text": "Staff was completely overwhelmed and inexperienced - unable to handle a large crowd as they were understaffed both at the bar and on the tables.  Waitress was extremely rude to multiple parties and the owner gave a n obnoxious “speech” to all the customers that was more of a lecture rather than an apology. I have never had an owner speak to customers in that way - very unprofessional. Patrons at the bar were told it would be a 25 minute wait for drinks ( unacceptable) and several customers received their food after a 2 hour wait.  This was a  limited “bar” menu that was offered to a large seated group that had been there several times before.  The restaurant is absolutely beautiful and the owner spared no expense in that regard;  but he should have spent more money on staff and training - he lost a huge opportunity to promote his restaurant and word of mouth on the Islsnd will not be kind to him…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMlduUkpXV0p4UWpsWmRVMU9hR1I2ZDBwSFJsRRAB",
            "text": "Celebrated a birthday there last weekend, we had 50+ guests, I must say, what an amazing experience from food/drinks to service, ambiance and the owner is such a gentleman. Thank you once again for an amazing experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTGVqZzRXRWxPTkhsR1RuRllkVE5PZFRKNlVGRRAB",
            "text": "Great spot, nice ambiance and great food! We had a huge party last night and all the staff was so attentive and caring. We will definitely be back! Thank you!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcDhQWGVnEAE",
            "text": "UPDATE: Since my last review about 2 years ago, Sea Bar has become a go to favorite for my friends, family, and myself. We've made it a regular spot for consistently delicious Mediterranean cuisine and it just keeps getting better!\n\nThey've introduced a flavorful  prefix menu, along with creative new happy hour dishes and handcrafted cocktails that truly impressed.  The addition of live music every Wednesday night adds the perfect touch to an enjoyable dining experience.\n\nThe food remains outstanding, the ambiance is warm and inviting, and the service is always top notch, friendly, attentive and professional. Sea Bar continues to exceed expectations. Thank you to the entire team for making every visit memorable. Highly recommend!!!\n\nFirst Review: My husband and I were just looking for a place to unwind and have a drink. He searched Google and saw that Sea Bar restaurant was offering happy hours from 3:00 to 7:00 pm. We were struck by how clean the restaurant and the open  kitchen were. The aesthetic was relaxing, pleasant, and comfortable. We sat by the bar, where there was a selection of happy hour food and beverages. All blended drinks were handcrafted fresh on site. Though we had lunch earlier, their midday seafood menu until 3:30 p.m. was so appealing that we ended up ordering a Branzino fillet, Muscle Meuniere, Crabcake Burger, and Happy Hour Clams and Oysters. All were fresh and tasteful!! Our daughter came in to meet us after work and we ended up having dinner. Dinner was equally delicious, presentable and delightful. Their dessert menu was fantastic, we ordered the \"Bougatsa\", which was well worth the 20 minutes wait to have it freshly baked. Our first time experience was terrific; foods were delicious, prices were reasonable, the personnel were competent, courteous and friendly. A special shout to our server BAYROUZ, who was magnificent. Will definitely return with our families and friends!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOVE1rNUNLM2JLYXVRRRAB",
            "text": "My family and I had such a wonderful dinner at Sea Bar. The ambiance is beautiful.  Everything we ordered was excellent. Our server Sergio was very attentive and friendly and made our night very enjoyable.  We look forward to returning soon!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQR0d6T0hHMHJ6MDVnRRAB",
            "text": "We reserved dinner through Open Table, it was to celebrate my wife’s birthday.  I chose the Sea Bar because she wanted to give it a go, plus we to love supporting local businesses.  Well, the Sea Bar raises the Bar!\n\nWhen it comes to dining out, expectations vary.  Upon entering you can’t help but notice the decor and ambiance are spot on and very accommodating.  Our server Sonny was very polite, professional, and attentive. We would like to say bravo with thanks.\n\nThe menu was very balanced and featured numerous options, starters and mains. We started off with their Grilled Octopus which we highly recommend.  Sonny had it cut table-side because we were sharing it.  The level of service was noticeable.  We then ordered  their Baked Cod and Ahi Tuna entree’s.  The presentation and, quality were fantastic.  You know you’re in good company when your server asks how you would like your Tuna cooked.  This kind of detail is what defines excellence in the restaurant industry.\n\nThe Baked Cod was excellent and reminded my wife of her mother’s cooking.  My Ahi Tuna was cooked to perfection.  Our dessert was the Molten Lava Cake, which is made to order, and well worth the wait.  It was decadent!!\n\nKudos to Chef Michael for your warm hospitality, we definitely appreciated the food and experience.  Finally a restaurant that gets it.  See you soon."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKYmYtcS1VLU5hRllREAE",
            "text": "Shoutout to Jenna at this location! She went above and beyond to provide exceptional customer service for Anthony and I.\nWe celebrated our anniversary there a few days ago and everything was perfect. The ambiance, food, drinks, and overall customer service was top tier.\nJenna made our experience very special, and we appreciate that from her. If you ever stop by, ask for Jenna. You won’t be disappointed. We will definitely be back soon."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNaTVuZE9LeFpmTjR3RRAB",
            "text": "The food was over the top delicious, amazing, the service was spot on and Michael, owner, treats you like family. Every single of my 70 guests raved how great the food was. This is definitely a ' Go to' for a great dinning experience. Thank you Michael first, Sergio & Bheruz for a wonderful event experience!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNNzZ3cXF0aFoyZlRBEAE",
            "text": "I liked the place. Service and food were excellent as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMQ1B1N1BlX29XWXdRRRAB",
            "text": "Beautiful spot on SI! Went here with a party of 8 for Mother's Day- the drinks and food were incredible, all the staff was so kind and attentive. 10/10 would go back and recommend celebrating your special events here!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLX0Q2TktUN3BpS3p3RRAB",
            "text": "First visit and will not be the last. The food was fresh abd delicious. Service was exceptional. The seafood was soooo fresh abd delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJeVB0ZnlkckwtMWpRRRAB",
            "text": "Best sea food I really enjoyed the oysters and the calamari was yummy very clean and they have great staff very welcoming i highly recommend this restaurant I would love to come back again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMaUVoWWlzbDdDM3VBRRAB",
            "text": "What an absolutely incredible dining experience! From start to finish, everything about this restaurant blew me away. We ordered a variety of dishes — branzino, skirt steak, salmon, calamari, cheesecake, and baklava. Every single item was cooked to perfection. The branzino was flaky and flavorful, the skirt steak was juicy and tender, and the salmon had the perfect sear with a melt-in-your-mouth texture. The calamari was crisp and not greasy at all — a rare find! And let’s talk desserts — the cheesecake was creamy and rich without being too heavy, and the baklava was heavenly, with just the right amount of sweetness and crunch.\n\nBut what really made the night special was the service. Ben was absolutely fantastic — professional, attentive, and just the right amount of fun. He made great recommendations, checked in without being intrusive, and had such a warm energy that elevated the whole experience.\n\nI’ll definitely be coming back — and recommending this place to everyone I know. Amazing!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZXJzTTZHcjVMZGdBRRAB",
            "text": "Omg omg omg this cute Greek restaurant was a hit, came for a birthday dinner close to closing and the waiter BEHROUZ treated us like gold. all his recommendations were excellent (they have an amazing $50 prefix menu great options). They offered hummus and bread super fresh. Get the lobster bisque it had the biggest pieces of lobster I’ve ever seen in lobster bisque!!! The calamari were cooked to perfection. They had the grilled watermelon salad and beets apps. Bronzino was a hearty amount. The drinks were on point. They sang happy birthday and even though the kitchen was closed they made sure we didn’t feel rushed or pressured. Can’t wait to come try more and to get the soup again. See you there 💛"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa2ZEVy1nRRAB",
            "text": "Branzino & lobster bisque 👌 crab burger was good too! Our server was very friendly! Had a good time!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbGI2dUx3EAE",
            "text": "What a 😍 beautiful server!  Food was good too!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNWNDUE9BEAE",
            "text": "The food was phenomenal service also was great just totally enjoyed my visit i will be back again for the hummus 😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveWJQblFBEAE",
            "text": "Great place, foods are sooooo delicious 👍😁"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnJpbGtBRRAB",
            "text": "Behrouz always makes our experience here absolutely incredible! The food, drinks, service, and his recommendations never disappoint. As always, we will be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvem9lUmdnRRAB",
            "text": "I came here for my anniversary dinner with hubby and we loved it! The food was delicious, the service was on point, and it was a nice looking place.\nThe Octopus was delicious and the lobster bisque was excellent!\nWe also got this cheese and fig dish that came out on fire and that was a very pleasant (and tasty) surprise!\nFor the main course, we split the baked wild cod with fingerling potatoes and it was a great choice!\nAnd for dessert, we got some Greek dessert type with a flaky crust and cheese, which was good (and quite large!)\nOh yes, the drinks here were so good! We had the caramel macchiato espresso martini, which we loved!! And a couple more yummy cocktails, too!\nThe bartender was super nice and came around to get our order and give our drinks and make sure we were satisfied.\nThe only thing that I didn't love was the veggie chips (thought they were too oily).\nOur first time here and we will definitely be back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM0xhVnd3RRAB",
            "text": "This is a hidden gem with great service, beautiful atmosphere/ambiance inside, and even better food. We have come here to eat a few times now and it has become a family favorite. Every appetizer and every meal we’ve tried has been excellent. I truly think this is underrated and perhaps an undiscovered SI restaurant because of its location. Give it a try, you won’t regret it!! I recommend the Hawaiian Grouper, Branzino, Chilean Sea Bass and for appetizers the veggie chips, fish tacos…you can’t go wrong with any of the apps :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMzZEeWp3RRAB",
            "text": "We had a great experience at dinner tonight! The seafood was extremely fresh, high quality, and well made. Our server Behrouz was attentive to our every need, and did a great job explaining the menu and creating a fine dining experience. We will definitely be coming back next time, along with friends!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYazQ3dUl3EAE",
            "text": "We celebrated a special occasion at Sea Bar tonight.   Food is very fresh and yummy.  We tried 2 specials: grilled apple salad and the surf and turf pasta. They were so good that my daughter who doesn’t like lobster ate it!  The Branzino is my go-to-dish, perfectly grilled, fresh and tasty.  Staff are very attentive and friendly. I love seeing them supporting each other. Highly recommend this restaurant!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcFozRTF3RRAB",
            "text": "Interior design is so aesthetically pretty and provides a wonderful and elegant dining experience! The service provided by Behrouz was attentive, friendly, and warm, which definitely helped enhance the dining experience! Now onto the main topic, the food:\n\nThis is by far one of the better middle eastern/seafood restaurant in all of Staten Island! The appetizers that were amazing were the chargrilled octopus, which is a MUST-GET, and the half dozen oysters which was by far one of the sweetest oysters we ever had (it was so good we ordered 3 orders!) The tuna tartare, calamari, and lobster bisque were all decent but nothing too special.\n\nFor entree, the lobster pasta was perhaps one of the best tomato based pasta I ever had! Although the amount of lobster in the dish was on the smaller amount for its price, the flavor was so savory, sweet, and perfectly tangy, highly recommend it! The sea bass was good according to my family, but the flavor was on the milder side in my opinion; they liked it nonetheless so perhaps it's just a personal preference at this point. The lamb shank I would not get due to how overpowering it was; the sauce was salty and intense, where it overwhelmed every part of the dish. It was unfortunate because the lamb was so tender and had a nice proportion between its meatiness and its fat content. The dry aged steak was only okay too, since the spinach was so watery it soaked the steak in its liquid (as you can see from the photo), which detracted from the dish unfortunately.\n\nOverall it was a decent dining experience, where some were amazing and others were less so. It's a pricey dining experience but if you get all the right dishes, it's worth the price tag! Definitely recommend giving Sea Bar a try and I can't wait to come back again one day to give them the five stars I know they can definitely accomplish!\n\nThank you for reading and best of luck! (:"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bUtlRWZ3EAE",
            "text": "Had an incredible dinner here! The food was extremely fresh and the attention to detail and the plating of each dish was amazing! We started off with a Tableside Lobster Bisque that was delicious. I also loved the Veggie Chips, they were thin and crispy and the Tzatziki was so good! Make sure you try the Sea Bass here! It is so fresh and cooked to perfection! I also enjoyed the pasta dishes here, the sauces were very tasty and huge portions! Make sure you save room for dessert because the Bougatsa was sooooo good! It came right out of the oven nice and warm! Overall a wonderful meal and I will be back soon!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNksydXZRRRAB",
            "text": "Our brunch was wonderful! Firstly, I have celiac disease which means I have to be very careful in not consuming gluten. On the phone, the hostess and chef were very helpful so that I could understand what was safest to order. Secondly, the food was delicious, the cocktails were creative and amazing, and the service was attentive! Our server was Behrouz, and he answered all our questions, was very friendly, and made us feel welcome. We’ll be back to try more! (Pictured: my salmon over sautéed spinach)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6Z0x1cnlnRRAB",
            "text": "What an amazing restaurant! Hubby and I went for an unplanned lunch date today and we are so happy we did! The food outstanding, ambiance beautiful, and the service was amazing. The food was so fresh and flavorful! And the drinks were delicious as well! We can not wait to go back. We chatted with Mike the owner who is so passionate and it shows! Highly recommend this amazing restaurant."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaWVyN0xREAE",
            "text": "You're treated like family as soon as you walk into Sea Bar. The hostess and waitress were very friendly. Our waitress really took the time to explain certain things. The food is delicious. The tzatziki was outstanding. That alone would make me come back. For dessert, the bougatsa is a must. I'm looking forward to returning and trying different things. Would recommend to friend!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzanE3a1hBEAE",
            "text": "Came here for an anniversary dinner and the service was incredible! Behrouz is so attentive and friendly. Would definitely come back just to see him again! Even walked us out and held the door for us. Food was amazing too. We had the apple spice aperol spritz and coconut pineapple margarita - both were very good! The lobster bisque (served as half portions) and seafood over linguine special for 2 were good as well. We will definitely be back! Maybe for a weekend brunch :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdlkteUZ3EAE",
            "text": "Having such an amazing dining experience at Sea Bar that i’m writing this review at the table. The owner, Michael, is not only incredibly sweet but also a fantastic chef. The seafood was exceptionally fresh, and I love the Greek influence in the dishes. The hummus and various dips, especially the almond garlic spread, were outstanding.\n\nThe decor of the restaurant is clean, beautiful, and modern, creating a tasteful ambiance that enhances the overall experience. The lobster pasta was packed with flavor and truly memorable.\n\nI highly recommend Sea Bar to anyone looking for delicious seafood in a lovely setting."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbjZ5SkVREAE",
            "text": "I went to SeaBar for the first time and had an amazing experience. As soon as I walked in the ambiance of the restaurant was perfect. The owner Michael is an awesome chef and person. Made you feel like family as soon as you walked in. The server Sergio had a pleasant and welcoming vibe aswell. The service was amazing and drinks were top tier. Now to get to the food. Outstanding attention to detail in everything we ordered. The Red snapper was delicious and cooked to perfection stuffed with spices and lemon. Better than any seafood restaurant I’ve had on the island so far. Overall and outstanding restaurant experience. Will definitely be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0bklXVHp3RRAB",
            "text": "Sea Bar is a Mediterranean restaurant with a Greek influence.  A very memorable experience starting with your first impression as you enter. This expansive 200 seat restaurant is so visually pleasing, very beautiful,  a clean contempoary design with quite a bit of forethought.  A stunning bar sits outside a private party room that seats 45 people.  Try some of their signature drinks such as the the blood orange martini, mules or sangria.  Also available is their happy hour  or brunch and lunch menus.  Manager Michael Farace heads  a very well- trained staff of chefs and wait staff who pride themselves on their attentive service without being hovering. Their very fresh Seafood Plateau and Grand Fruits de Mer are a must have. Whether you chose a fish entree or a lamb shank over orzo you will not be disappointed.  Be sure to ask for their array of house made desserts to cap off your dining experience. Plenty of parking and wheelchair accessible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuak02bnpBRRAB",
            "text": "Outstanding atmosphere, excellent service, and above all great food!\nThe grouper soup was delicious and all the enterees. Very nicely served as well.\nWe will be back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcDZMRzl3RRAB",
            "text": "The food is so fresh and I highly recommend it. The calamari was light and crispy, the octopus was melt in your mouth delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dXNhSlhREAE",
            "text": "Sea Bar never disappoints! My family and I had brunch there today and we were blown away. Our cappuccini, cocktails, and dishes (Benedict royale, croque madame, avocado toast, chocolate pancakes,  Baklava\" Cinnamon Walnuts & Honey Pancakes, and \"Tsoureki\" Grand Marnier & Almonds French Toast) were all incredible. Service was attentive and friendly, as usual. Sea Bar is now my go-to place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3emFLYmpRRRAB",
            "text": "Very good and fresh food. Decent portions. Lava cake made from scratch was delicious. Nice service. Little long wait, but it’s worth it. Price above average."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbTU3RkJBEAE",
            "text": "Went with a friend closer toward end of 24. She ordered Fish, Very Dry.. I ordered Steak which I had asked to be medium rare. First time around it was raw… Second time around it was very tough. Uneatable.. was still charged for the whole meal.. Presentation was sloppy.. NOTHING Memorable.  They have put a bad taste in my mouth.. no interest in ever going back. Google wouldn’t let me post w/o giving them a star.  0 Stars.. See attached"
        }
    ],
    "reviews_count": 58
}