{
    "name": "Island Social",
    "place_id": "ChIJgURUsgBLwokRHeklNKDfUOs",
    "grid": "SI2",
    "address": "4060 Hylan Blvd, Staten Island, NY 10308, USA",
    "rating": 4.9,
    "user_ratings_total": 168,
    "phone_number": "(518) 692-3952",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWU1VrMUljRUZVT0hCclRXeEtjMU5PWkhCUFowRRAB",
            "text": "Best & great food for a lounge that closes at 4am enough girls for everybody good music choices dj get to work here no joke all genres welcome & I def seen a few known celebrities pull up"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMVQweFVSR3g0Y205eFgxOVBTRFZ6YmtnMVIwRRAB",
            "text": "Love island social. I come every time larry works hes the best !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaldrRkROSFZ1UlVJeFUzWm5XbTFDVUUxcVozYxAB",
            "text": "Been coming here since the beginning! Love the bartenders especially Larry Mariah and Bella ! Will always come back !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsR1dGRjJORVpPTTJ0cGJTMVpabFJXUVhWRWFXYxAB",
            "text": "Phenomenal food and phenomenal service by Larry the bartender !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMlJtcHdhVVpsV1haVU9FZElRbUpPWWtsdVFsRRAB",
            "text": "The bartender Larry was amazing. I was there for a few hours & he checked in with us several times & was up & down the bar all night but still made sure to engage with my group as well. The DJ was on point, there wasn’t a dull moment."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKbmFuUk1XblpxZFV4U09XUkNVWFpHVEVObllWRRAB",
            "text": "My favorite person is Deina (best bartender)❤️ good atmosphere and amazing food too"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKb1ZsUXhSa3RFY2tnMGFuWk9WSFpFZVRJNGVVRRAB",
            "text": "Islands great ! I sure wish Larry and bella were working Saturdays again! Maybe I’ll come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTWVYUldObE40YlhsQllsUTRVemxyUTJFNWRHYxAB",
            "text": "My first time at island social and all I have to say was Larry was the best bartender I’ve ever come across. Made sure I had everything I needed. I met a few co workers such as Bella and Mariah they were great as well. Definitely will come back !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pObFdEUnFNelZ3WDE5MlJVZDFaMEp4TkVWM1lrRRAB",
            "text": "Atmosphere was great for a Friday night ! Will definitely come back ! Larry was my bartender and made sure my drink was filled without me even asking. Phenomenal service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oU1IxYzFlRlUxWkZsblpIUXpSMnhEYkMxSldIYxAB",
            "text": "I highly recommend the wings any flavor they are all good. Or the sliders🤤🤤. The weekends are the best music is all good and the bartenders always checking in on you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RE5EQkxia053U0daTVUwSlFNeTFCY3poeE5tYxAB",
            "text": "Brought a group of 12 friends there last night for dinner and dancing. I was there before and had a blast.  Food was undeniably great. Drinks had a great kick and the bartendes were absolutely friendly and accommodating.  Highly recommend this bar to everyone if you want a good time.  We'll be back for sure!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNGJEaGlOWEJoUVRRdE9EWm1TekpmVERsdVZuYxAB",
            "text": "Unbelievable atmosphere, food and service! Love this place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCM1FUTXljWEJ1ZUhaSE1YcExNREl0TFVaeE9FRRAB",
            "text": "Great evening at Matt and Mike's place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc1UxazVSR0ZhUkZab2JURm5Oak55Ykdwb04wRRAB",
            "text": "A beautiful experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abVIySlJlV1Z1TUhCamFVWnBSREpSVVVjM2RFRRAB",
            "text": "Food great. Service friendly"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaU5YZFlSRXd0TTJkd01Ea3RTRUZWU1ZOTWIwRRAB",
            "text": "Bartender creates an atmosphere that makes people feel welcomed"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMGVrMUpiVFZTYkZOTFdISlRSRlJpZUVock5GRRAB",
            "text": "Bella is the best bartender on Staten Island"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeWJYWTNSa1JrZFd0SGRXdFNOR1ZyUjA5eVdGRRAB",
            "text": "Ms. Bella is awesome"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210YVZWUTJSbGQxYkRFNE1sVlZWWHBtU1ZaM1YxRRAB",
            "text": "Great an amazing place love to come back for more service amazing, quick and professional"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUGEzbFlVV1JMYnpKcldrWmFMWE4xWnkxSGVIYxAB",
            "text": "Great location, especially with the outdoor seating area. Excellent place for a beer a bourbon and a cigar. Drinks are a little bit expensive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Wk5rVkRZMkZXVVdzd2VVbG1iM2hTVEVOU1UxRRAB",
            "text": "Amazing experience.. mostly memorable because the owner, manager AND bartender (her name was Ashley) made me and my girl bestie feel so comfortable, to the point where we chilled with them for A GOOD WHILE while drinking a decent amount and enjoying some Apps 🤭 We WILL be back. Came on a Tuesday night and had the time of our lives. 100% recommend for food, drinks and atmosphere. Thank you to everyone who made our night ‼️✨️😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bFIwSmtWRXA1Y0hwclh6VTJOR2xRZDJzeWVrRRAB",
            "text": "Bella was the best bartender and gave me the best service. The food was phenomenal thank you for a great night!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUldUQnpja0pxUTBkVmVWZFBjekJRVDBscGNYYxAB",
            "text": "Had a great time here ! Bella is the absolute best and makes amazing drinks !! Highly recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrd0xVcEhUekJ0ZWtOYVRHTmtla0ZrU0c1elNuYxAB",
            "text": "The service was great, Bella is the best!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSME9Fd3dSVmRHVHprM1NFNUNhWHBUUkVoc0xWRRAB",
            "text": "I had the smash burger and it was really good! The food came out quickly, the service was friendly, and the atmosphere was fun and relaxed. I really enjoyed my visit and would definitely recommend Island Social to anyone looking for a tasty meal and a great time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUFZFdHpiMWRoYzBob1ltNXhSVzFOV21WSlQzYxAB",
            "text": "Came to Island social for the first time and let me tell you I will be back. The bartender I think her name was Bella really made my experience amazing, one of the best bartenders I’ve had the pleasure of being served by in a long time. The atmosphere and vibe in this place was truly second to none! Bella made a regular out of me tonight! Thank you island social"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVloybERRa1pLZVU1UE0wOVJVVVF3VUhOcU0zYxAB",
            "text": "This establishment has been my go to since i started coming. There is not 1 place on the island that provides the service and experience as island social\n\nBella & Mariah are bartenders that have made my experience unforgettable.\n\nHIGHLY RECOMMEND!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMlRuVnBWR05yZFROUVYyNXRkbmcyYmtseVFsRRAB",
            "text": "Mariah and Bella have been the best bartenders I have encountered. Greeted me and made me feel welcomed. Mariah has given me a drink faster than I would open my eyes. Bella has given me great recommendations on food and it was worth it ! Definitely a place I would come again all the way from the Bronx!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNdE4xaFNjRjlTZDJGMWJtZDZTMEZEU1c0NExYYxAB",
            "text": "Everything about this place is fantastic starting with the bartenders the service is incredible quick and amusing mariah was great but bella was amazing didn’t have to wait any longer than 2 seconds for food or drinks"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ScVMycHFWRkp2UkZGMmFYUjZRV1ZKTXpWRGQyYxAB",
            "text": "Service is amazing I’ve never been served a drink faster. Mariah has given drinks when I’m a sip away from finishing my initial drink. She knew I was hungry, handed me a menu right away. Love this place love the food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUWVGVlVSalpWTld0T2J6TXphVkpvTjFWQlNXYxAB",
            "text": "I was not forced to write this review"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200ME5XUmZTR3BMYzJSTlpqbHRaMmRPTVRGSlNsRRAB",
            "text": "Dianna was great and made sure my drink was full deff coming back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUWVWRkZiek5yWDFnd1drWTJaVjlTTkVSdVUzYxAB",
            "text": "Diana is such a great bartender. So attentive and makes great espresso martinis"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bFJIZzNiakpRV21OdU5uZEVOR3BQZVhsTmVrRRAB",
            "text": "Best bar on Staten Island! Food is great  staff is amazing vibes are immaculate  and you can’t beat the prices (if your gonna say I can make it at home cheaper just stay home ) burger and beer special 🔥"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3azVHLVd3EAE",
            "text": "If possible I'd give this bar a 6 star review. The owner Matt and the bartenders make this spot a place everyone should go to. Just please be respectful to everyone that is here and you will have a great time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWGNUWXlaMWxNWlc1c1UyVlpZbTAwUkhoeVpsRRAB",
            "text": "From the moment we walked in, the service was outstanding. We were greeted warmly ✨. Our bartender was knowledgeable about both the food and drink menus, offering perfect pairing suggestions. The food came out quickly and exceeded our expectations fresh ingredients,creative combinations, and generous portions. The staff was super friendly and the atmosphere/music was 10/10\nWill definitely return 🙌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VlVHUjFTbXBRU1dJd2MzRmtOV1F6YjJwQ05HYxAB",
            "text": "Drinks where alittle pricey  but the staff and bartenders where amazing made it worth it .Great hang out spot with the boys or girls night out live dj food string drinks ...Just watch the bill when you run a tab  those prices catch up lol when you having fun"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214U1lVdDBhRFZCZFdOMGQwcFdXRVZUVVVrd1pIYxAB",
            "text": "It's a good local spot. Depending on the night you hit the place is a big thing to consider when you go. On Thursday night and Saturday night the crowd is good energy and mature. The outside is a good place to have a conversation you can actually hear but the thing to avoid being there on a rainy day."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kalNETjBTbmRhYTNKWFlrUnNaMFpQY1VSMFMxRRAB",
            "text": "It’s such a vibe\nThey got great food, strong drinks, and music that makes you forget it’s Staten Island. The wings slap, the bartenders don’t play, wanna try the cocktails? Strong, creative, and worth every sip. Vibes are undefeated. Come hungry, leave happy… and maybe a little tipsy. 🍹🔥"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3OU1lWmhBRRAB",
            "text": "5 starzzzz .. great atmosphere and food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybDY3a3lBRRAB",
            "text": "Everything we ordered was delicious. I loved the wings, especially with buffalo and sweet Asian chili sauce. Their sliders and chicken Caesar wrap were very tasty. I really enjoyed the Cesar salad with shrimp, the shrimp was flavorful and…"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJLTRYdzlRRRAB",
            "text": "First thing I gotta say is wow. I had high expectations for this place but still overshot those expectations. Very colorful & easy to spot from Hylan Blvd . Bartenders are friendly & attentive . They were showing sports along with good music . Great energy in this place .  Went for my birthday & had a great time . Lastly , their kitchen is open till 4AM!! Never seen a bar’s kitchen open that late . Comes in handy . Tried the regular cheeseburger & loved it . Zero complaints about this place . Wish I lived closer because I’d be back here asap"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1T1dVWTNZVmhoWVdoUGNtNHpSV2R6ZDFFeVEwRRAB",
            "text": "There was a little hiccup with our food. We ordered from their website to the patio and for some reason it was put with the pick ups. So by the time we asked and they found the order, the food was cold. Matt came out to speak to us about it and made it right. We got fresh food and it was phenomenal! Somehow they made potato skins and pretzels taste gourmet. Lol I'm laughing cause I can't believe I'm saying that about bar food but I honestly don't think I've had better potato skins in my life."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdk1hOTJBRRAB",
            "text": "Tucked away like a secret only the locals know, this cocktail lounge is the definition of smooth. From the moment you walk in, the lighting sets the mood—dim but warm, like a low whisper in a velvet room. The bartenders? Absolute artists. Not mixologists with an ego, just folks who know exactly what you need before you say it.\n\nEvery drink is a story. I ordered the smoked Old Fashioned, and it came out under a glass cloche full of hickory smoke—pure theater. But it wasn’t just for show; it hit like jazz in a glass. The menu rotates seasonally, so there’s always something fresh to try, and they’ll still nail a classic if that’s your thing.\nMusic was great, nothing that fights your conversation. Seating is plush, the crowd is classy without being stiff, and the whole vibe says “stay a while.”\n\nAshley was amazing, ask her to be your bartender next time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOGE3MzRBRRAB",
            "text": "Bar tenders are very attractive and nice.   I love the wings here, traditional but the rest of the menu is sub par to me.  They have a nice 1/2 off apps before 7.  I visit ofter because of this."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdVBMVlpnEAE",
            "text": "Always amazing coming here service is phenomenal, service is amazing, and the personality of the bar tenders is an unmatched 20/10 especially when it’s Bella and Larry at the bar!!! Bella is always spot on whether it’s making drinks, serving the delicious food, or just making you feel welcomed she does it all. If you are looking to have a good time, meet great people, and just have an overall great experience Island is the place to be!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYak9leWpBRRAB",
            "text": "Food is awesome! Service is great! Wish I would have taken more pics of the food! Lauren is the best!!!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNid3FIY3FnRRAB",
            "text": "Island Social is hands down one of the best bars I’ve had the pleasure of visiting! From the moment I walked in, I was greeted with a warm, welcoming atmosphere that sets the perfect mood for a night out. The standout feature at Island Social has to be the incredible customer service. Bartenders Bella, Ashley, Larry, and Lauren truly go above and beyond to ensure every guest feels valued and cared for. Their friendly personalities and attentive service make you feel right at home.\n\nNow let’s talk about the food – it’s nothing short of amazing! The menu offers a fantastic variety, but I have to give a special shoutout to the new Parmesan wings. They are absolutely delicious, perfectly crispy, and bursting with flavor. Plus, the fact that they serve food around the clock, all the way until 4 AM, is a huge bonus. It's perfect for late-night cravings or after-hours hangouts with friends.\n\nOverall, Island Social is a top-notch destination for anyone looking to enjoy great drinks, mouthwatering food, and unbeatable service. Whether you're stopping by for a casual drink or a late-night bite, this bar will exceed your expectations. I can’t recommend it enough – I’ll definitely be back for more Parmesan wings and that outstanding hospitality! Cheers!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRXzcteGJREAE",
            "text": "This is the best bar on Staten Island. The owner truly cares about his customers. The staff is accommodating and always go the extra mile to make customers happy. I would suggest checking this bar out. The food is also fantastic."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQOU9XQUFnEAE",
            "text": "Just want to show some love to Island Social for their excellent customer service and hospitality this Thanksgiving eve. They answered the phone at 1:30am to let us know they were serving food while dealing with a packed holiday crowd and then remembered us at the door. My Jack Daniels Bbq burger was incredible and my friends loved their wings and sliders. Went to three bars that night and this was the only spot that was playing great music. Also the only bar of the night that was happy to keep me and my friends hydrated and serve water/food with a smile and not just take my money. Perfect service throughout from the manager to the bar staff to the kitchen staff thank you guys very much much"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNExYQTVSbDlhUW5JelEwSk9kVlY1UWxoSmFXYxAB",
            "text": "Best bar food in the island! Chicken Cesar wrap and chicken bacon ranch wraps are amazing!! 10/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBOXVuSzlRRRAB",
            "text": "Same location was under new ownership over 3 times now ISLAND social really got the spot on tier 1 with services, food , and nice friendly people from the community, and enough girls  for everyone from Thursday thru Sunday lol 😆"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdlBxWmdnRRAB",
            "text": "Ashley was out bartender and she was amazing! Excellent drink and service! If you go ask for ashely she is the best"
        }
    ],
    "reviews_count": 53
}