{
    "name": "Mansion",
    "place_id": "ChIJ044wt69LwokRin3tbNEPoZ8",
    "grid": "SI2",
    "address": "141 Mansion Ave, Staten Island, NY 10308, USA",
    "rating": 4.5,
    "user_ratings_total": 179,
    "phone_number": "(718) 605-9200",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVFFYcGpXbVJQTVZOUk9UTmxRblZKUjJaM1dYYxAB",
            "text": "I like the Mansion"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQldVaHZVbXBSWVdkWmRtMHdTbUpIYWw5RVNuYxAB",
            "text": "We went to dinner for my husband‘s birthday and were very disappointed. Please do not eat here. The restaurant was completely empty when we arrived (red flag!). Granted it was a Wednesday, but I have never had this experience before. Our waiter was nice but had very limited English ability. He did not understand our questions about the menu and brought wrong items. They served my daughter raw chicken fingers and brought out a heaping bowl of macaroni and cheese when all we asked for was a side of pasta. The food was mediocre at best and way overpriced. They ruined a milestone birthday dinner and I would avoid this place at all costs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CblptOUpiSHBCYWxaU05TMVZkelk0ZFVwWFVtYxAB",
            "text": "Great spot!\nThe Mansion is a beautiful place with a cozy vibe and really good food. Everything we ordered was fresh and flavorful—especially the Branzino and the Lobster Loaded Potatoes. The staff was super friendly and made us feel right at home. Perfect for a date night or a chill dinner with friends. Definitely coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TmJVUnBTVU4zUTBaUU1TMVdXR2hTTjFwM1dIYxAB",
            "text": "Excellent place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaU00wbEtibU5UVkVOcFZuVjFTbXBNUW10dlFXYxAB",
            "text": "We did our baby shower here and we were pleased with food service and prices. Highly recommend to everyone!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTE0zVXlVSEZoZW5oRE5qQjJUR1puU0c5U1NuYxAB",
            "text": "First time here (after hearing about this place since its recent opening) with husband and baby for an early dinner and we absolutely loved it! From the presentation and delicious food to the beautiful place and view to the impeccable service and friendly manager!\nIt was absolute perfection and we will 100% be back -- in fact, we are planning to celebrate our baby's 1st birthday party here in their private dining room downstairs.\nThe manager was extremely helpful and wonderful, both on the phone and in person.\nOur server, Daya, was super friendly and attentive.\nAnd our view from the table windowside on the 2nd floor was spectacular (view is of the marina).\nWe ordered the Brussels sprouts and halloumi salad, lamb harcho soup, shrimp skewers, and Veal tongue with mashed potatoes. All the dishes were so delicious! The standout dish for us was definitely the Veal--- very tender and juicy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NVFXNDNhVlJSVVhaUWFqZzJTV2d0WjJKc2FYYxAB",
            "text": "Food was amazing!! Service was great! Highly recommend this restaurant"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQk0yUnZiM2hQVVhFMFdrMHdaRjlhV1RSR2NYYxAB",
            "text": "You will not be disappointed and the sangria is one of the best."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WVZETkZhblZxTmxCaFlYTmFPRGcwWTNCMlkyYxAB",
            "text": "My Family & I just left dinner at Mansion. I've actually never written a review so close to getting back home. But I HAD to post how absolutely PHENOMINAL everything was. The ambience was totally GORGEOUS. Not a single person in our party of 4 had anything negative to say. From being seated in super comfy, non wobbly chairs and extra ROOMY tables...LOVED the space! The Service was EXTRAORDINARY. Portion sizes perfect and filling. We had the homemade tiramisu and it was SUPERB! Hubby & Dad had double espressos, OUTSTANDING!\nSorry, we didn't take pics, but GO!!! I haven't been to a place to excel so much overall. It's usually, of course, focused mainly on food. At least as the first factor. This was above and beyond all expectations and we will be back!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRE5IWmpZbmhyYmxkQlNXUTFaVkZhYlc5UE5tYxAB",
            "text": "We went out to dine with my husband and everything was wonderful the food and service was great!! Highly recommend"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeGNXUm1RVWw0V1VZeVdHUkRjVVZqWlhweWFIYxAB",
            "text": "We celebrated a baby shower at Mansion Restaurant, and everything was simply amazing! 💙👶🏼 The atmosphere was elegant and cozy — exactly what we wanted for such a special day.\n\nChef and his team created a beautiful setup that wowed all our guests. The food was delicious, the presentation was flawless, and the service was warm and attentive from start to finish.\n\nIt truly felt like a celebration made with love and care.\nThank you, Mansion, for making our day unforgettable — we’ll definitely be back for more events!\n\n#BabyShower #MansionRestaurant #StatenIslandEvents #ElegantCelebration #EventWithLove"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNFgxTm1jMlIxYWpKdVZIb3lWRGx3ZWkxc1EyYxAB",
            "text": "Very nice ambiance. The new owner put a lot money into the place and it's beautiful. The menu is interesting, in that its basically Italian with a slight Russian flair; I'm guessing the owner is Russian. I just had two drinks and two apps and they were both very good. I sat at the bar, which is lovely, and the wine and drink list is excellent. Dimitri nailed my Kettle martini with a twist; it was excellent. I also had a glass of the house Sonoma Cab which was great. Half a dozen blue points, fresh and plump, cleanly shucked, and nice variety of sauces (I just like lemon and mignonette). I also had the Kobe beef sliders. They were good. If I'm nitpicking they weren't sufficiently salted, and more well than the rare I ordered. But they're so small, I really don't think its fair to critique them for this. Overall, everything was really good. I would like to come back and try more."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeVpWbFBOa0V5TFhWdllVb3RjSGhpUTNWV05uYxAB",
            "text": "Absolutely amazing experience at Mansion! The atmosphere is elegant, the service is top-notch, and the food is simply outstanding. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkZk1uWkpRWEpwYjNkbFpHWkRSMHN6VXkxS2VuYxAB",
            "text": "I was just at mansion restaurant with my family celebrating special event, food was delicious,  service was even better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdVNGRlllRlkxWVUwM1QxaENXazlpYmpVMmJHYxAB",
            "text": "I am not a big review person to be honest!\nHowever we had our family reunion at this beautiful place with such nice views. However the view had no match to the worst service I have experienced in a long time. Our server was annoyed at everything we asked for. We told him the family wanted separate checks ahead of time and when we reminded him he was down right mad and we felt so un welcomed I wanted to leave. The food was expensive and not very good. I should have known when I did not see another customer in the place, maybe they scared the other customers away as well.\nWhat a true shame we had a special event at the Mansion and spent a lot of money as well for our special un special occasion..I am so sad because I made the reservations for the family and was embarrassed.The Lesson has been learned and we will not return. PS the hostess was very nice and accommodating.."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCT1IxZEtka3ROZW5NeWJrZG1VMVZ2UTJKdFlXYxAB",
            "text": "Yesterday was my the first  time at Mansion Restaurant with my girls and our kids — and we loved it! The service was amazing, the playground kept the kids happy, and the strawberry dessert was unforgettable. Huge thanks to the chef! We’ll definitely be back. 🍓✨"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNU0xaElkbkpLWTFGTFF6a3lVM0JVVEZwQmMyYxAB",
            "text": "We were absolutely delighted by our experience at Mansion! It’s rare to find a restaurant of this level in the U.S. - everything was stunning. The interior is beautifully designed, every detail is thoughtfully curated, and the space is impeccably clean. The food was incredibly delicious and refined, with elegant flavors that truly impressed us. The service was warm, attentive, and professional.\n\nWe highly recommend not only enjoying the exquisite food, but also immersing yourself in the elegant and welcoming atmosphere. A true gem!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWk1VaDBYMk5vVG5Oc1dFMVNSMVJhUldGTU1FRRAB",
            "text": "I’ve been eyeing this restaurant for a while, and today was finally the perfect occasion—Father’s Day! We made an early reservation and were greeted with a warm welcome. We chose to dine on the first floor, which has a chic, elegant vibe with beautiful décor and a relaxing ambiance.\n\nThere was a special set menu for the day, and the selections did not disappoint. I had the Burrata Salad followed by the Branzino—both were fresh and flavorful, and the portions were huge! I couldn’t even make a dent in my main dish. My husband enjoyed the crepes and the seafood linguine, and he was just as impressed.\n\nThe kids’ menu was a cute touch, especially with the clever dish names. When I asked my 10-year-old what she was having and she replied, “I don’t care,” I was caught off guard—until I looked at the menu and saw that “I Don’t Care” was actually the name of the mac and cheese! So creative and fun.\n\nDrinks were great too—strong and satisfying for my husband, and I was happy to see a solid mocktail selection for non-drinkers like me.\n\nThe only downside? There were only two dessert options available. I was hoping for a bit more variety, especially since everything else exceeded expectations.\n\nOverall, it’s a 10/10 experience, and I absolutely can’t wait to go back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLSFU0Nm5lbXVlemJnEAE",
            "text": "the food is disgusting. Diner level. Horrible service. The prices for this shitty food are very high. I do not advise anyone to go there"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKS2J0ZmlyZ19IX0d3EAE",
            "text": "We went there to finalize party arrangements and were treated like Royalty. Chef Alex came out and was talking about the delicious pear desert that he had prepared as a special for the first time... We were the very first people to try it... it was perfect... we felt as if we are at our favorite relatives house . One of the best experiences we ever had... can't wait to have our party at Mansion."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQNk5vTlRmMWNmU3RBRRAB",
            "text": "I recommend this restaurant. The nursery is a lifesaver. Thank you. Stasi's cocktails are like a separate art form. Alexander and his tiramisu is a delight! Everyone should try it. The most delicious tiramisu I've ever had in my life. Thank you"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNXzUwZFQyM19yLW93RRAB",
            "text": "I had a wonderful time at this restaurant. The food was absolutely delicious — fresh, flavorful, and beautifully presented. The staff were friendly, attentive, and made us feel welcome from the moment we walked in. Especially Stasya. She recommended very good cocktails for us 🎉 The atmosphere was cozy and comfortable, perfect for a relaxed meal. I highly recommend this place and will definitely be coming back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYVkzcFNoczY3WGdRRRAB",
            "text": "We just had an amazing birthday celebration  at this restaurant!!!!!!! Food, service ,  ambiance,  decorations and presentation was top notch!!!! The most important people who work there are amazing people!!! Thanks a lot to the great team, and  huge thanks to Shoka, who is the manager there,  because she  made this day so special for us and our family!!!! All of our guests were really impressed, and we will definitely come back there!!!!!!! Thanks a lot for your hard work !!!!! The best restaurant in Staten Island!!!!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJVDVoSWJHdjZlQUhBEAE",
            "text": "Terrible service. Arrived for my birthday reservations, stood for 30 min with my guests because my table wasn’t ready. We were not offered drinks on the house until I verbally complained several times that it’s ridiculous that my party has to stand and wait over 30 min past the reservation time. Was then seated for another 20 min in the bar where there was leftover food and glasses everywhere. I also requested downstairs seating, but was seated upstairs and when I mentioned it the hostess just shrugged her shoulders and told me that I should have called, when I tried calling the restaurant 3 times that day and nobody every picked up. Multiple times the order was not taken correctly, half of the dessert menu was not available, among other things. Absolutely disappointed, would not recommend and will not come back."
        },
        {
            "date": "5달 전",
            "language": "uk",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLamMwdWZJNV9mNG1nRRAB",
            "text": "У мене не було часу спробувати меню, але мені дуже сподобалась атмосфера. Затишно і привітно, обов'язково прийдемо з друзями і дітьми"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMbTFrcXFJNkt5dkZ3EAE",
            "text": "This place is a joke!!!! We came here on the day of opening (it was a disaster) and returned today, on the Mother’s Day, hoping everything has changed. No, Nothing has changed!!! It’s a whole story, but in 2 words— IT’S BAD!!! For example, $70 steak is thin, chewy, burnt, topped with a sauce nobody asked for and expected to see.\nThe prices and the quality of food and service are heading in the opposite directions. PLEASE, save your time and bring your money elsewhere to enjoy your food, service, and atmosphere!"
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQ1o3WUxzc056UVNnEAE",
            "text": "On y mange comme en Italie, raffiné et savoureux. Une carte exceptionnelle, et un service haut de gamme.Je recommande vivement et à recommencer!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOGNtUTZBRRAB",
            "text": "The restaurant is very nice and the food is very good as wells"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvenBXT0RREAE",
            "text": "The appetizers we ordered were very good (the artichokes and the burratta, the calamari was okay). The mansion cheesecake was AMAZING!\n\nService is good, super attentive, and very nice although we were there during a day where there were very few tables.\n\nHowever, the drinks need some work. For a place like this, with the amazing decor, style, and dining experience, an interesting and delicious cocktail would go a long way to make the place a full five star experience.\n\nMy advice, stay for the food, skip the cocktails and check out other places if you are just stopping by for a drink."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbHJQRHd3RRAB",
            "text": "Cozy place for a date or family dinner.."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJM0xDbnVBRRAB",
            "text": "The food was delicious, decorations were beautiful and music was really good 👍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3azg2djhBRRAB",
            "text": "Had a very pleasant night with my mom at the restaurant that never disappoints!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dkp1WGFREAE",
            "text": "Yesterday I hosted my daughter’s baby shower at The Mansion and I couldn’t have asked for a better experience. From the moment we started planning it, John made everything effortless. His attention to detail, professionalism, and genuine care made the entire process stress free and enjoyable.\nThe food was absolutely top notch. Every dish was fresh, flavorful, and beautifully presented. Our guests cant stop raving about how delicious everything was! The atmosphere was warm and inviting,  creating the perfect setting for such a special occasion. Ours happened to be a pajama party and the entire staff dressed for the theme.\nI’m beyond grateful for the exceptional service and unforgettable experience. If you’re looking for a place to host an event or just enjoy a fantastic meal, I highly recommend this place.  Thank you, John, and the entire team, for making this day so amazing! ✨"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OU5MSzJBRRAB",
            "text": "Really nice place with great atmosphere, really good food and amazing staff. The place is very nice, food tasted great, the fish was amazing. The staff is super friendly and very attentive. Also has Eastern European/Georgian food options."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MEl5bWlRRRAB",
            "text": "Grate place to set  a birthday party,  many different spots for private party. 👍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcHRubTBRRRAB",
            "text": "Wow!  Had dinner here on Saturday night for my SIL's birthday.  I cannot stress how fantastic the night was. The drinks, appetizers, main courses and desserts were amazing!  Even better was the service and eclectic decor (very interesting, thought-provoking pieces throughout the restaurant).  Our server, Erik, was amazing ... responsive to our requests and not rushing us in any way. Highly recommend Mansion Restaurant and thanks to all who helped make a special evening even more special.\nSPASIBO!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdk1LYmJnEAE",
            "text": "Offering a thorough review from start to finish: Our experience at Mansion Restaurant in Staten Island was nothing short of spectacular. The evening began with valet parking that was both friendly and efficient, making the entire arrival process smooth and stress-free. As we stepped out of the car, and at entry, we were immediately greeted by the hostess, who warmly welcomed us and professionally escorted us to our table.\nThe restaurant layout is beautifully designed, offering a comfortable yet elegant atmosphere. The space is large enough to accommodate a steady flow of both staff and guests, yet cozy enough to feel intimate and private. The seating arrangement allowed for perfect comfort, and the restaurant's design is a wonderful blend of classic and modern European influences. The art and lighting create a relaxing yet social environment that made us feel like we were dining in an aristocratic European setting, adding to the experience with my wife and guests.\nOur service was impeccable—attentive, professional, and perfectly timed without ever interrupting our conversations. The serving staff was knowledgeable about the menu and made thoughtful suggestions throughout the evening, ensuring we had everything we needed without being intrusive.\nFor appetizers, we chose the Tuna Tartar, Blue Point Oysters, and Dolce Vita Salad, all paired with cocktails. The presentation was elegant, and the flavors were perfectly balanced—not overpowering, just right. The freshness of the oysters and the delightful crispness of the salad were standouts.\nFor the main course, I ordered the 10 oz Prime Filet Mignon Steak, cooked medium-rare. The steak arrived beautifully plated and was cooked to perfection. Each bite was a burst of rich flavor that only a high-quality steak could deliver. The only small critique would be the presentation of the side dish: grilled broccoli and potatoes, which, while delicious, could have been arranged in a slightly more aesthetically pleasing manner. But this was a minor detail in an otherwise flawless meal.\nThroughout the evening, the server made routine visits at just the right moments, ensuring our glasses were full and our plates cleared in a timely fashion. The transitions between courses were seamless, allowing us to enjoy our meal without feeling rushed.\nTo finish, we were delighted with a collection of desserts and fruit, accompanied by hot tea and coffee. Each dessert was as delicious as it was beautifully presented, capping off the meal on a sweet note.\nHaving dined at Michelin-rated restaurants, I can confidently say that the food and service at Mansion Restaurant are absolutely on par with that level of excellence. This was an unforgettable experience, and we are already looking forward to returning.\nThank you, Mansion Restaurant, for such a memorable evening!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRaTdyNUF3EAE",
            "text": "Great place. Great food, service and drinks."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndVp5QXNRRRAB",
            "text": "Each dish was a masterpiece. The mussels were beautifully plated, bursting with flavors that showcased the chef’s expertise. The skirt steak melted in the mouth. Dessert was equally divine! The wine list boasted an impressive selection of rare vintages and international labels. Best cocktails ever!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndnE3aFlnEAE",
            "text": "I had my sisters baby shower at the mansion and from start to finish the party was excellent! The service and food was exceptional and the room was perfect for the intimate party that we had! I would 100% come again for dinner and plan another event here! Owner John was so welcoming and accommodating to anything I needed with setting the party 🫶🏼♥️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdWJUOUdBEAE",
            "text": "We went for a food tasting today. The fig jam on the cheese platter paired well and so tasty. Drinks were good … we also enjoyed them during happy hour. The Burrata was really good and though my husband didn’t like the beef tar tar.. I loved it. We both enjoyed the fish… it was served on top of potatoes and asparagus. Grilled chicken n pasta & salad. Dessert was cheesecake, pistachio cannoli and chocolate mousse"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eVp5WVRBEAE",
            "text": "As soon as we walked in, the staff greeted us with a big welcome. They made us feel like they were a part of the family. They saw my mother needed help, they came and opened the doors in and out. The food was amazing, very fresh and each dish compliment the other. The portion we ordered were a nice size. The waiter explained what we were having. When we were ready for dessert. The chef came out when we said that they were out of the world. We found out the chef was an award winning chef.  The atmosphere was quaint. Music was light and jazzy.\nThe money we spent was worth every penny.\nDefinitely will be heading back"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dy1hcUZnEAE",
            "text": "Amazing food, atmosphere, and service!\n\nMy wife and I visited newly opened Mansion restaurant with our non-US friends in Aug 2024. It met and exceeded our already high expectations based on pre-open marketing and first reviews.\n\nFood: Delicious, creative, perfectly done, with an amazing aesthetic presentation! See pics and detailed dishes description below.\n\nAtmosphere: From restaurant location across the Marina and creative stylish interior to live saxophone music and staff dress and attitude the atmosphere was truly enjoyable! We couldn’t wish a better place to meet with friends.\n\nService: Precise, attentive, friendly. Our waiter Alex informed us about dishes details and made suggestions on the orders. Food was served at the right times. Empty plates were taken away often. The manager stopped by a few times to check how we liked everything. We felt fully taken care of :)\n\nWe highly recommend Mansion restaurant if you’re looking for an upscale dining with amazing Italian cuisine, awesome atmosphere, and great service!\n\nAppetizers\nBurrata Salad - one of the best I ever tried. Super soft high quality Burrata complimented with some amazing sauce additions and sweet tomatoes. This is a must!\nBeef Tenderloin Carpaccio - perfectly made combo of fine carpaccio Parmesan and all other toppings some of which I can’t even identify. It was scrumptious!\nBruschetta with Heirloom Tomatoes and Pesto Cream Cheese - fresh Italian bread with soft melting pesto infused cream cheese topped with sweet tomatoes. Great!\n\nEntrees\nLamb chops - perfectly cooked to order, juicy, and flavorful. And the portion was surprisingly generous.\nBranzino Fillet - I ordered it grilled and it came with perfect grill cross-stripes. Fish was fresh and not dry as Branzino may be. Asparagus on the side was done perfectly.\n\nDesserts\nFamily Recipe Cheesecake - this was not a classic cheesecake, but was indeed special as promised by our waiter. It was softer and lighter than regular, melting in the mouth. Orange confit on the top was also delicious.\nCannoli - we got them with pistachio filling and they were perfect.\n\nDrinks\nMartini with Passion Fruit Foam - perfectly balanced delicate drink, not too sweet, not too sour, with nice passion fruit notes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bXAzVlNBEAE",
            "text": "From the moment we walked in, we were greeted by a nice and polite hostess. She gave us the option to sit upstairs or downstairs. Since we have a three-year-old, we chose upstairs where they have a kids' corner with toys to keep little ones busy. The hostess then escorted us to the second floor, where three waiters greeted us and helped us get settled at our table.\n\nWhile waiting for our food, the owner stopped by to chat and make sure we were comfortable, even asking if we needed anything else. The food was delicious, and our waitress, Veronica, was excellent! The entire experience made us feel like we were the main guests, though I'm sure all their guests feel the same way.\n\nAs we were about to leave, the owner offered us two shots of amaretto, which were both tasty and smooth—a very nice touch to end the evening.\n\nI’m giving this place *FIVE STARS*!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudm8yV1JnEAE",
            "text": "I had an amazing Wednesday night at Mansion! The luxurious design and chic ambiance set the perfect tone. The food was absolutely delicious—every dish was packed with flavor and beautifully presented. The DJ was fantastic, keeping the vibe alive with an incredible mix that had everyone on their feet. A perfect spot for a night out! Highly recommend!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeV92LVN3EAE",
            "text": "The name of this restaurant speaks for itself and the interior certainly lives up to it.\nWe stopped in for a business meeting and actually had a chance to meet their chef and their barman. While i dont drink, as you probably remember from all my prior reviews, my friends certainly do and thei enjoyed their specialty cocktails. Considering that they kept asking for me - they were great!\nJust their stocked bar and cozy lounge alone is enough of a reason to come in…\nBut then there are 2 floors of seating with 3 additional rooms large enough for any event. Baby grand piano and live music and absolutely stunning decorations!\n\nNow lets talk food - Italian cousin influenced but certainly not limited to it. From raw bar to various meat and vegetarian specialties to finger licking desert called Maria!!!\n\nWe stuffed ourselves! Carpaccio, and caviar for appetizers. I had skirt steak while my friends enjoyed veal cheeks…\n\nThis place is worth every star i gave it and then some! Business dinner, romantic date or just a casual drink with friends - all possible there!\n\nTons of parking and beautiful view of the water as it’s right next to the Staten Island Marina…\nCant say enough"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNGZyQjNnRRAB",
            "text": "I recently had the pleasure of dining at the Mansion, and I have to say that my experience was absolutely perfect! As soon as I walked in, the warm and inviting atmosphere immediately made me feel welcome.\n\nThe food was not only incredibly delicious but also beautifully presented. Each dish offered a delightful blend of flavors and textures that left me craving more.\n\nWhat truly impressed me was the exceptional team that made the dining experience so enjoyable. The staff was not only attentive and knowledgeable but also genuinely friendly and welcoming. Their passion for their work was evident in every interaction, making me feel truly valued as a guest.\n\nWhether you're a food enthusiast or just looking for a fantastic dining experience, this restaurant has it all!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQLTl2M3p3RRAB",
            "text": "Came here a month ago to celebrate my husband’s 35th birthday on a Friday night. I am very impressed with the decor and atmosphere: when you walk in , you see a beautiful swanky lounge on the left if you just want drinks and appetizers. Then on the right is a large dining room with beautiful lounge chairs. If you reserve through open table they let you choose which area you want to sit at. We opted to sit on the top floor. It was very unique. Definitely could hold 50-60 patrons.  The vibe of the top floor is more of a victorian dining room versus the lounge feel downstairs. Our waiter Boris was nice and very knowledgeable over the menu and their specials. Drinks were fantastic, loved my espresso martini it was strong! He took lots of pictures for us and always checked on us to see how we were doing. I really liked their ceasar salad with big chunks of parm cheese and yummy bread basket. Their menu has a mix of Italian seafood meat and georgian dishes so it was hard to choose! I opted for a carbornara pasta dish and so did my husband, its just weird that their alla vodka dishes dont come with chicken- he tried it with salmon. Our friends had the lasagna which looked fresh and a beautiful presentation. Their portions did seem a bit small for prices but a part of me appreciated not feeling bloated after a meal, left us plenty of room for dessert. My husbands birthday was special with birthday candle on their unique maria cake and cheesecake. It was italian style with ricotta cheese.They both were dreamy!! Their irish coffee is DIVINE. Strong and not overly sweet. I also loved their live phantom of the opera music. Way better then the dj and went well with the theme of the restaurant. I also appreciated not feeling rushed like other restaurants do. And there is plenty of parking without the need for valet. I will come back here to celebrate a special occasion for sure."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNjZhWFpREAE",
            "text": "Tonight, my husband and I had dinner at this amazing restaurant!\nThe atmosphere was very pleasant and welcoming. We were able to enjoy a quiet conversation and start our meal, and later in the evening, a DJ arrived and played great music, making it so much fun.\nThe food was absolutely delicious and well worth the price. Our waiter, whose name I unfortunately don’t remember, was incredibly attentive, witty, and professional.\nWe will definitely come back, whether it’s for a casual dinner or to celebrate a special occasion!\nOne of the few truly great restaurants on Staten Island—it’s no surprise they were so busy on a Saturday night!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIakx2R2x3RRAB",
            "text": "Great amazing place! I know taste of good food and here it is. Maxim chef went out to personally present us deserts, we took appetizers of burrata, octopus and baked potato with lobster (!!!), tartare (!!!) for main - diver sol for 2, buckwheat risotto, and bronzino all for 4 people and finished with cheese cake and fried ice cream, and canoli!\n\nI highly recommend this place for casual dinner or a celebration."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIc2REV05REAE",
            "text": "It was my first time at this restaurant. We came for lunch. I absoulutely loved entourage and atmosphere. The service was good,everybody was very friendly and attentive. We got our food in a timely manner. Food was delicious and tablewear was beautiful. We liked one of the wines. But I think that a wine list at such a beautiful restaurant could be bigger and more interesting. Other than that we liked this restaurant a lot and are planning to go there for dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOGJTeHR3RRAB",
            "text": "The perfect place for a date night, or for nice quality family dinner,  in my opinion! Delicious, warm, beautiful, cozy interior. Everything that you need for a good time !\n\nWe ordered oysters and beef tartare with truffle potatoes as appetizers. Everything was brought quickly, and the presentation and serving were excellent. And how delicious it is !!!\nFor the main course, my husband ordered filet mignon with buckwheat (resotto style) - OMG!!! Yam!!!! And I took lamb chops with broccoli on the grill - just PERFECT!!!\n\nEverything - atmosphere, service, presentation, flavor palette, everything is 5 out of 5 !!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNjYycFVnEAE",
            "text": "Loved the decor and service is top notch.  The food was fabulous. Every detail was well thought through making it a distinct experience.  Cocktails were fantastic and the bartender even came out to see if we enjoyed them. Valet parking available on weekends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNHNyVnZnRRAB",
            "text": "5/5 STARS *\n\n\"I've had the pleasure of dining at Mansion multiple times, and each experience has been truly exceptional! The atmosphere is warm and inviting, with impeccable service that makes you feel right at home. But the real star of the show is the food - every dish I've tried has been expertly crafted, with bold flavors and presentation that's almost too beautiful to eat. Almost.\n\nThe chef's attention to detail and commitment to using only the freshest ingredients shines through in every bite. Whether you're in the mood for something classic or adventurous, Mansion has something for everyone. Don't miss out on this culinary gem - book your table now and taste the magic for yourself!\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIX05EUzdnRRAB",
            "text": "We were a group of five and went to Mansion for an early Sunday dinner. The hostess was welcoming, and we immediately liked the ambience. We ordered several apps for the table and each got our own entrée. Everything was amazing—the burrata and tartare were fantastic, and my branzino was perfectly done. The buckwheat side my friend got blew me away, so much so that I asked the chef for the recipe, and he was kind enough to share it. I’m still thinking about that cheesecake with orange marmalade the next day. We’ll definitely be back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbHFtZThnRRAB",
            "text": "First time here and definately not the last. Love the atmosphere the decore and the ambiance. Wait Staff was very attentive. The menu is not too large and not too small, would probably suggest a few more entrees. I definately recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bTdhWG9nRRAB",
            "text": "Mansion at 141 Mansion Ave has officially stolen my heart. This spot is a perfect blend of signature and Italian cuisine, wrapped up in a fun, well-thought-out interior that oozes European charm.\nIt’s my new go-to, and I’m planning on celebrating all my special occasions right here.\n\nThe dishes? Let me tell you, everything is extremely fresh, like they just picked the ingredients moments before plating. And speaking of plating, the presentation is next-level—totally surprising in the best way possible.\n\nThe service is super friendly, though I think a little extra training could make it perfect. But honestly, the overall vibe and quality more than make up for it.\nThis place is a hidden gem, and I’m so glad I found it. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMHZHQVRBEAE",
            "text": "⭐⭐⭐\n\nWe had a fantastic family dinner at Mansion Restaurant on Staten Island! The food was delicious, and the staff was friendly. The kids' corner with toys was a lifesaver, keeping our four kids entertained while we enjoyed our meal. Highly recommend for families looking for a great dining experience! We'll be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cUtHR1pREAE",
            "text": "It's one of the best restaurants in New York. The food is extremely delicious and the service is of a high level! Our server, Alex (Sasha), was super nice. I highly recommend visiting this place to try Georgian food and to enjoy the great interior. Thank you so much. This is my recommendation!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3M3ByZ213RRAB",
            "text": "Beautiful place, amazing service and food just perfection!  Must try salmon risotto, octopus salad and ajarski  cheese pie is another heaven."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubllHeDFRRRAB",
            "text": "I would like to thank the staff at Mansion, and especially our server, Sasha, for making our first visit so special.\n\nThe food was exquisite and tasty, with perfectly sized portions and fresh ingredients. Their marmalade cheesecake is worth a visit on its own.\n\nOverall, I believe Mansion is one of the best restaurants on Staten Island, and I look forward to visiting it again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNianN1dWR3EAE",
            "text": "Today my friends and I dined at Mention restaurant and left very impressed by food service and atmosphere. It is classy and make you feel very cozy. People make you feel special right in the moment you stepped in. Supper friendly and pro service. Food presentation is really pretty and everything we ordered was amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydHJ1ejJBRRAB",
            "text": "The best Fettuccini Alfredo I have ever had!\nStaff is super pleasant, food is delicious, prices are reasonable. The interior is fabulous, I felt like at my Grandmas house. We felt the love and care they treated us with. Marina view is amazing.\nThank you so much, Oleg, Max and everyone who made this experience memorable. Cheers to many more visits 🩵💙 Maral"
        }
    ],
    "reviews_count": 63
}