{
    "name": "Seabass Taverna",
    "place_id": "ChIJKapPRABJwokRJ18rAUVeCw4",
    "grid": "SI2",
    "address": "365 New Dorp Ln, Staten Island, NY 10306, USA",
    "rating": 4.8,
    "user_ratings_total": 252,
    "phone_number": "(718) 808-4110",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSlZGUlVZMUZtVTNobGNqSk5XR3BZTWtaNWMyYxAB",
            "text": "We went today Sunday. We tried the buffet, it was okay. Although, we thought we were going to have fish and seafood because of the advertisement we saw on Instagram. They have a regular menu and they do have plenty of fish and seafood so we still need to go back and try the regular menu. The staff were nice and everything looked clean."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGc1QwbGhaemhLVkhFNFJsVlVXa3h3V0VSYVVsRRAB",
            "text": "The restaurant was real clean, nice atmosphere quiet cozy the host. The host was also the owners husband and wife, of the restaurant They serve the food themselves very courteous and professional I recommend this restaurant👍🏼👍🏼👍🏼"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNVQybG1ZbmgxZGtwMGNsZEhPR1V4YkZCMVRsRRAB",
            "text": "Great neighborhood restaurant. Food was amazing, service was impeccable and reasonably priced. Very relaxed atmosphere food was not rushed. We found a hidden Gem."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdU9GVnNVa2xGVW10RGFrcFFTM1U1YzJOelVXYxAB",
            "text": "Love this place. Ate here a few times now and its always consistent.  Food is fresh and delicious. the drinks are on point, bartender 👌🏼. Service is great, always well taken care of.  Highly recommend."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRFoxWmhURlJpVlhKQ01uUXpOWGh3VWpkbU5XYxAB",
            "text": "Sebastian Raverna, nice ambience, pleasant service and delicious menu items to pick from.  While fish options are my favorite. Enjoy!🐟🐠\nParking available in the back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNWIxVjJOaTFhT1ZWR05GbzFVM0JhWlhOb1ZsRRAB",
            "text": "We visited this restaurant and tried their Spanish Sea food Paella and Grilled Octopus. To my disappointment it was the worst Paella i have ever tried. The rice was super oily and sloppy. Seafood and Octopus were overcooked. The manager held our check for well over 30 minutes cooking and putting in an oven some nonsense called Halva that tasted really awful. It was a real disappointment, considering this place is focused on seafood."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ka1dsOTBaMUExYzFVM1RrUlNRVlZvZG5ab1puYxAB",
            "text": "I can’t say enough great things about this restaurant! We have been wanting to try this local restaurant for a while and I’m so happy we did. The service was spot on, the food was super fresh and prepared well. The staff also went above and beyond to make sure you were enjoying your meal. To start we received a complimentary red pepper dip with pita bread and it was delicious. We ordered the mussels marina, Dover Sole, and the lemon butter cod dish which were all fantastic. For dessert we had the crème brûlée and tea. The chef even came out to ask how we enjoyed our dinner. The owners and staff really take the time to make sure you have a great experience. This restaurant exceeded our expectations and we will definitely be returning!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMmVsWktOWHBJZVc4MlltWnFjVFZ4TWxRdE5GRRAB",
            "text": "Surfboard for 2- portions were good, the food was delicious. Crab cake- i didnt love. Not much crab. But still will go back.\n\nService was phenomenal!!\n\nBathrooms were clean.\n\nThis place is a must!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaE5IQmpMVlZ6YUZwdlkwNXFXSEZMUzNkTFZYYxAB",
            "text": "Wanted a nice night out with my wife. Seabass tavern looked like a nice spot to check out. Well it was more than I expected. Food was tasty could use a lil more seasoning. But for the most part we are already planning the next trip back. To taste some more of the dishes available. Our  waitress Damla was very pleasant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b05VRm5Ua3RRVkdFMFdVTkZjR1Z0Y3pWVFVYYxAB",
            "text": "My friends bought me here for my birthday dinner last night  and everything was exceptional! The food and the service is more than 5 stars. Staff was so sweet to present and cut my birthday cake that my friends brought. We will definitely come back and bring more friends. This retaurant is a definite must try. Thank you for making my birthday dinner special Seabass Taverna❣️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SFRqaFZPRXhaUzJaclQxRlpNVFJMVWpWV1VGRRAB",
            "text": "Amazing night out with family celebrating a very special birthday. The staff could not be have been more accommodating in helping us execute our special dinner. We loved the shrimp and seabass cerviche and Zucchini pancakes. We decided on the surfboard for 4- everything was AMAZING. We can’t wait to come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214c2J6WjNXVXBWWkc4M1dYZHZVMDFrUmw4elZFRRAB",
            "text": "I 've read reviews 4.9. But, such a disappointment.  Truly ,  not good. Don't recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCM2FtcGlSMnh3VlVoamIwRXliMGRTTjBabFUzYxAB",
            "text": "The food here was top notch 👌\nThe only issue I had was the portion size vs the prices. Small portions, high prices."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKalNuZzFhVWhsY2xjMk5WcERZMVpXZFVaNVFYYxAB",
            "text": "We went there for some seafood and the chef did not dissapoint. From Tuna Tatar to main course of fresh fish, everything was delicious. Staff was super friendly and accommodating. Great experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xObVFUVmFNekZZV205UVJTMHhNR0pWVlhsNWVrRRAB",
            "text": "Had such a great time here. We came to celebrate my birthday and I couldn’t be more pleased. The food was excellent, the service was exceptional, and the atmosphere and cleanliness was outstanding. We will definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsZlRsTkNXRFUyTkdKbVl6UlNVRlpUT0doeU9IYxAB",
            "text": "We had a birthday dinner for 12 at Seabass Taverna and they were so welcoming and accommodating, even with our last-minute reservation. We shared a bunch of appetizers — crispy zucchini, fried calamari, spanakopita, saganaki, Greek salad, trio of dips, octopus, shrimp & scallop app — and everything was so delicious.\n\nEveryone loved their entrées! I had the shrimp scampi with risotto (thank you Damla for the recommendation!) and it was perfect. Others ordered the hanger steak, seafood paella, whole snapper, chicken kebabs, and baked cod — not a single complaint at the table.\n\nOur server Damla was wonderful — patient, attentive, and made the night easy for our big group. The space is warm and welcoming and felt perfect for a celebration. We’ll definitely be back!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ga1VreEpkVEIxZVRGRWJYaHlPRkUzZFRNd1drRRAB",
            "text": "Can’t say just good, but AMAZING place!!! Food is DELICIOUS!!! Nice and clean inside, very good service!! 100% recommend to visit this place!!! 💪🏻💪🏻💪🏻"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNM2FDMHRhWGRvTldocE5VVmpjMVJ6TUZoMFJXYxAB",
            "text": "Vine comer  con  mi familia La comida  estuvo  muy  excelente"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VU5XUnhXRVJGVTI1UWEwbFRkazlzVjFCQmJYYxAB",
            "text": "I absolutely love this place\nAs soon as you walk in\nYour instantly greeted\nWith a warm welcoming\nAs if your were visiting family\nFood 20out of 10\nI love the dorado fish and lemon potatoes\nEverything is authentic Greek food\nIf your on the island visit here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVVNqZGlZMlpoVG5WTU1UVmhOMDVTVWw5d1gzYxAB",
            "text": "This restaurant chooses to speak to their customers in a demeaning way. I commented on a post of theirs, stating that I was not content with the quality of food. They decided to state that I’m lying and never ate there lol. Don’t eat here. Food sucks and they’re rude."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVmFFRmhjM1V0YlRGVE5UWTVUa1pMVlhaTE9YYxAB",
            "text": "Great fish dishes, cerviche and octopus and sea bass and red snapper. Harvard dessert great service. enjoyed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQ1EyODJTR1Y2T1haMVRHVnhaMDVuWDBwM2RFRRAB",
            "text": "Excellent service and excellent food will definitely be returning"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeFZGSkxWakJRYUdaM2NXeERkSEZ2VWpaMWNWRRAB",
            "text": "We had a large party For celebration, I saw a lot of good review on Google. That’s why I gave it a try and suggested this place to other guests. We went for the endless menu as we this would be perfect for large party without a hassle what to order. It took a while to serve the first plate cold appetizer. The portion of food is small. Literally each person can only have a bite. I understand is endless , we can order it again and again. But it took a while. We asked for eggplant salad and other seafood appetizers, they still served us with hummus and tzatziki. Which makes me thinks.. these are pre-plated, so what took so longer to serve us. For the hot appetizers , same thing, each guest was only able to get one clam and one octopus at a time.. as soon as mussels put on table, we have already asked for a bigger portion, we want more!!! Stillserved withsame portion.. sighh … finally the main course came. We dont know what is what, but everything were overcooked, everything were dry.\nAll my guests were not satisfied with this meal… very disappointed\nOverall the appetizers were ok except the portion served very small. Main course forget about it .."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBdGVtWm1NMHhpU2s0NE5VRldNWGx4Y21ocmVYYxAB",
            "text": "Went here in search of a night of good seafood and they did NOT disappoint. Not only was the food good but the drinks were grrrreat! Out server Dalma was sweet, very attentive and we were happy with all her recommendations. I would definitely come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMmJuVXliVGR5TFV0WWNYcE5ibTl6WDE5RWJWRRAB",
            "text": "The food and service were both excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSeVMwbFljRlZrTlcwNFZYTmFPR1JJVjFkdlVtYxAB",
            "text": "Everything about this place is wonderful. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oU2FEUlpVbVZIUlMxYWFVcGFPWFZTV0RWV09HYxAB",
            "text": "Herşey çok iyidi çok Teşekür ederim 👋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneU1FMW9kMWxNYXpkMWRsaDVYM2xSV0ZkUFozYxAB",
            "text": "Thank you, Hüseyin. The food was very delicious, with great service and a nice atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaVRqWlNVMUZQZWtGc2ExQjJSbU5TU0ZGMVptYxAB",
            "text": "Great restaurant with lots of options on the menu. We were a group of 6, and everything went smoothly. The service was fast, and the food was really good. Perfect place to enjoy with family or friends!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MFRsVjBTbEp2YzFkSlFtRnFjRjlVUTJaV1puYxAB",
            "text": "Came here for dinner with some of my friends and it was great! The drinks were amazing and the food was even better. Everyone working was so sweet. I will definitely be coming back!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNVdGQlVWRXA2Y0U5cFEzRjNZMGhxYkhCclVVRRAB",
            "text": "Friendly atmosphere and service. Everything from the drinks to dessert were great. Highly reccomend the lychee martini!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQ2RqRm5Obmh4ZEZsU00wbHhZa2RQV1hoRmJYYxAB",
            "text": "Great place! Chefs combo is a must have!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNd1h6ZDZUVlJJYUVGeWVHTlJkVmhVVEZSSlVIYxAB",
            "text": "New restaurant great fish dishes a little overpriced but really good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aZlUwazNTWFU0Yld4blRHUjRTVWhQUzFSb1FuYxAB",
            "text": "This restaurant has truly become one of my favorite places to dine, and I keep coming back for a reason. The atmosphere is always warm and welcoming, making every visit feel special. What I love the most are their mezes. Each one is fresh, flavorful, and perfectly balanced, offering a wonderful variety that never fails to impress. And this place never disappoints. Highly recommended!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RM01uTk1hbEJ0Y1dkR1NsQkhiRlJtVkRsblVrRRAB",
            "text": "Seabass Taverna serves some of the freshest and most delicious seafood I’ve had. Everything tasted very clean and flavorful. Their grilled steaks, chicken, and lamb were cooked perfectly—tender, juicy, and not overcooked. The staffs were also very friendly, which made the dining experience even better. I’m very happy with everything and will definitely be coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Mk1HaDZMV2hPT0c0MU1UVnJWUzFmTlRZNGVIYxAB",
            "text": "I’ve always wanted to try this place and it did not disappoint! The food was delicious, and the best part is how kid-friendly it was. Even my 1yo enjoyed the meal. Can’t wait to come back and try more!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRFpuWm9TbFEzZWxWU1ZqRldkbWs1Vm1SQlUxRRAB",
            "text": "Damla made our experience five stars. Will definitely be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSFRraGFjbVJEZGxZeVdFNXlNRVZwTjBoRFNGRRAB",
            "text": "Food is very delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwa1ZrMVNVRmx0ZUVkdGFIcElVVTl1U0d0QmFIYxAB",
            "text": "Very nice place with great food and impeccable service.\nDefinitely, will be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jd1YxVlRNV3R6UmxkdE5VOXBhSGxtVjI5SFNVRRAB",
            "text": "The service is amazing at this place !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dmNVaFlMVFZWT1Y5c1dqSndhbVpEVTBOU2RXYxAB",
            "text": "Came here for a long weekend lunch and decided to splurge and ordered their Endless Menu for 3 of us. Food was so delicious, and we got to try so many things. My mom is vegetarian, and she ordered the quinoa salad with beets and some vegetarian-friendly appetizers. They were just as delicious and so fresh. We were stuffed to the brim with seafood, and we were given complimentary tea at the end. The staff was so accommodating and friendly.\n\nI’ve tried many restaurants in this area, and this restaurant is one of the few restaurants that I would come back for. Such a gem! Looking forward to next time :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLREM2STNWLU5MLWxRRRAB",
            "text": "Stopped in on a whim looking for a nice fish dinner. We were pleasantly surprised everything was amazing!! The food and service was top notch. We order the fish mixed plate for 2. So much food!! It was delicious. They even gave us complementary Turkish tea and bake Halva which I really enjoyed! We will definitely be back. Thanks to the owners for making it a great dining experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcTl6TnFjeWJUX3dRRRAB",
            "text": "I had my parents birthday lunch there and the service was incredible. We did the endless dining experience, which was divine! Everything we had was delicious:). They also had a surprise for my kids, which we didn’t expect at all. We absolutely enjoyed it and will definitely be back! Thank you for an amazing experience :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbVR4T0RiNTVMbW5nRRAB",
            "text": "My family and I had a most wonderful dinner here for my birthday last night. We advanced ordered the salt crusted seabass; it was a beautiful experience witnessing the unveiling of the fish from the crust. It took a lot of effort and preparation to make this dish; we appreciated and liked it very much! Kudos to the Chef!! Our menu included many other delicious dishes like eggplant salad, acuka, green salad, oysters, mussels, octopus, shrimp scampi and a specially prepared vegetarian dish, along with an assortment of delightful cocktails!!\nThe serving team was very friendly and attentive. We felt extremely comfortable and never rushed. All the food was fresh and super delicious!!! We all enjoyed our dinner and time there tremendously. We will be returning for more happy times and highly recommend this restaurant. It was money well spent!!\nAt the end of the dinner, we were all so stuffed that we did not order any dessert, but the Manager insisted that we stay for a complimentary treat. I was very touched by their thoughtfulness when they brought out a fancy mixed fruit platter to help me celebrate with happy birthday music blasting in the background and the other diners all cheered and clapped for me!\nThanks for the wonderful dining experience, Seabass Taverna Team!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdFpuRjFkRlYzVUhONFprSlJVRlkxZGpFMWFIYxAB",
            "text": "This is a restaurant you would want to come back again and again after your first visit. Beautiful interior and delicious food! Staff is very attentive with great attention to ALL details. I found the restaurant through random google browsing and just couldn't resist wanting to try out this place. Glad we finally made it in, and surely it did not disappoint. In fact, it was amazing!! We tried their Endless Menu, despite just two people. All the food items listed in the first and second selections part of the menu will all come on the table, so you don't have to make any choices. You will choose your entree and your dessert. If you want more, you may ask for more. All items on the menu can be ordered a maximum of 3 times per table. Damla was very attentive and explained all the details and all the dishes to us.\n\nEverything was really good from the first and second selections. The fried calamari was fried to perfection--lightly battered with a nice crunch and the squid inside was so tender, the best I've ever had. All seafood was fresh. We ordered the moussaka and the hanger steak for entree. The hanger steak was AMAZING! You will not be going back to the steakhouse. We had the cheesecake, tiramisu and creme brulee, which were all really good, but he cheesecake really stands out.\n\nCan't wait to come back soon to try out other items on their menu. We will bring more guest for sure next time!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkT2NYWkJSR2gxV0hWM05rbE9TbXR5TVdzM1VGRRAB",
            "text": "Absolutely loved our experience at Seabass Taverna! The food was delicious — every dish was flavorful and fresh. The staff were incredibly friendly and attentive, making us feel right at home. The atmosphere was cozy and inviting, perfect for a relaxing meal. We actually drove all the way from Teaneck, New Jersey just to enjoy their wonderful cuisine, and it was definitely worth the trip. Highly recommend for anyone looking for great food and excellent service in Staten Island!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdFZUZzRTWEEyVEhGcFltZHRZbXBpVTIxTE1tYxAB",
            "text": "We had a wonderful birthday celebration for my friend last night at Seabass Taverna.\n\nTo start, we had their homemade hummus and fried zucchini chips. For main courses, grilled branzino, grilled sardines, and lamb chops, accompanied by salad and roast lemon potatoes. For dessert, a halva pudding.\n\nEverything was absolutely delicious and the service by Halil was outstanding.\n\nWe will definitely be going back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSE5GcGpOV3B0VkVSRFRtZ3lWRlIxYUhWM1VVRRAB",
            "text": "This is my 2nd time this restaurant this week!!\nit is purely amazing. The service is superb, I really felt like a star, Because I received five star treatment!!!!\nDamla, Is the absolute best she is, very sweet and warm and charming! She also encouraged me to try new things on the menu.\nShe is very well-versed when it comes to the menu, (If she suggest something, just listen and go for it)\n\nshe was spot on the baby lamb chops were delicious. !\nAnd the Dorado fish!! I’ve never had it before and never tasted a better fish!!\namazing!\nThey even took\nThe bones out for me ! It was like watching art ♥️\nThe seasoning is superb. The flavor is out of this world the best restaurant I’ve ever eaten at in Staten Island.!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkck9HMXliVXd6UWtWMGNUaHJVWFV5WVRCWWNVRRAB",
            "text": "We stumbled upon this amazing spot while cruising down the new Dorp Lane, and it turned out to be the perfect choice for a birthday lunch! With a fantastic seafood vibe, my husband suggested we check it out, and wow, are we glad we did! The drinks were refreshing, and we were blown away by the grilled octopus, the zesty lemon cod, and the delightful dessert. The highlight? The chef's special red sauce that accompanies the grilled octopus—it's an absolute must-try! We had an unforgettable time enjoying the delicious food and warm hospitality. Highly recommend this gem! 😊"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQNlpfYk9fbUlyeHlBRRAB",
            "text": "If you want good food, calm and relaxing atmosphere, come to Seabass Taverna.\nI came on 5/6 for my nephew's birthday celebration and right away I was hit by the calm Mediterranean atmosphere and decor.\n\nWe ordered family style. Meaning everyone shared the plates.\nAt the start, the service personnel were attentive and curious.\n\nAs the time went by though, the servers stopped dropping by. And the place was not even half of the capacity.\n\nHad to actually stand up to get their attention. Sorry for pointing ☝️ it out, but we were still waiting for other dishes and it was getting late. Kids and all. And my nephew was still waiting for his cake.\n\nPlease fix this complaint. Because I did enjoy the food and the atmosphere. Along with the location and available parking in the back which can make your business thrive. My son enjoyed the mashed potatoes. That says something. He doesn't like anything.\n\nI hope to come back next time and have an even better experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVNE4zWlJWalEwTURoaFMySnNjVmRtVnpFMVIxRRAB",
            "text": "Our first time and won’t be our last! My mother is a very picky, but everything we ordered she absolutely loved! We started off with the lovely Damla asking us where we would be most comfortable sitting and then ran through the whole menu options with us.\n\nDamla also helped my mother pick the specific fish she wanted—they have the seafood on display to choose. We started off with some delicious acuka and eggplant salad served with warm soft pita.\n\nMy mother got the fried red snapper which came with crispy potatoes and salad. And I am vegan and they were able to accommodate me with a baked veggie casserole made of eggplant, zucchini and carrots smothered in marinara style sauce. I also ordered us zucchini crisps which were so thin and crispy!\n\nI actually made reservations to celebrate my mother’s birthday and I included a note in my reservation to help me with a candle for when dessert (cheesecake) came around— and they did! My mother was super happy 🥹\nThey also served us some nice Turkish tea while we waited for her cheesecake dessert which she said was yummy.\n\nThank you, thank you thank you!! We will come again for sure🥰\n\nP.s the place decor is super cute 🤩🌊🐟⚓️🌅🚢🐚"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvX3JUQUJBEAE",
            "text": "First time here. Wonderful service, nice environment and menu offerings.  Ordered one appetizer, two entrees and one dessert with drinks.  No rush.  Not crowded.  Greek cuisine.  Portions were good.  Parking in the back is tight, street parking was difficult although meters stop at 5pm."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMalJ2c2lNaElLRFN3EAE",
            "text": "That was our first time ordering from this place to go. Everything we ordered was extremely fresh and delicious. Fried snapper and frutti de mare was heavenly. Staff is very polite and welcoming. Will be definitely coming back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXZLM3JBRRAB",
            "text": "Glad to have discovered this place! The staff was very kind and attentive. We had a great night, filled with delicious food. Very satisfied with each of our choices, as well as appetizers such as the calamari and greek salad. Smiles all around the table, no complaints here!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNmJXSnBXVlV4V1RkaVpETnhjV3RZVms4M1JrRRAB",
            "text": "Food and drinks were delicious and there was a consistent warm welcome from the staff! Will definitely become a regular spot for my husband and I :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuXzRhc1BREAE",
            "text": "This place is a real gem! The seafood is super fresh, and everything we had was delicious. The appetizer selection was on point, and the fish was perfectly cooked. Great vibes, friendly staff, and excellent service. Can’t wait to come back for more!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poZldFZENablZwUmtVNGNWcG1UVzQ1WW14Q09FRRAB",
            "text": "Me and my girlfriend came here for a date night and we got surprised as it was our first time trying it, a lot of different flavors and everything came presented very well and delicious our waitress was really friendly and helpful with such a warm personality, we didn’t wanna leave 100% recommend is a unique experience to have in New York, shout out to the parking that makes it super easy to come and enjoy"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMeTl0dlhUaWRHUFhREAE",
            "text": "Wow great experience.  1st time here for our 46th anniversary.  Food was fantastic and service was so friendly.  A really nice menu. Wife had shrimp with pasta and I had seafood with pasta."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa01rYzFNVWxXZEZOeVkyZFRRVkZqZGkxS1drRRAB",
            "text": "Delicious/fresh food. Warm/welcoming service. Clean/comfortable space.\n\nWe enjoyed the \"Endless Menu\"."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNjkzdkRnEAE",
            "text": "Seabass Taverna Endless Menu Review!!\n\nThis weekend I went to Seabass Taverna on New Dorp Lane because I *had* to see what their endless menu was all about. At $49 per person (and an additional $22pp for endless drinks), the selection, quality, value, and service were incredible. I love trying unique seafood dishes as much as I like playing the classics, and this place has something for everyone. And since the dishes are essentially served family-style, it’s so easy to try a little bit of everything.\n\nLet me cut to the chase: in a party of 3, my table ordered 26 different dishes, from starters to entrees to desserts. The portions are perfectly sized to be shareable, and the staff was extremely kind and personable, explaining how the endless menu works, describing dishes, and even offering second servings.\n\nThere were no misses. My favorites were the New England clam chowder, grilled octopus, oyster rockefeller, crab cake, penne vodka shrimp, linguine white clam, and frutti di mare. Even the chicken francaise and angus hangar steak were very worthy choices!\n\nCan’t recommend this spot enough. Definitely worth a visit (or several)!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNFZTMDRaVXBFZUZNNFVtMXhhMngwTW1SSVpIYxAB",
            "text": "The food is fresh and very flavorful. The condiments and salt are perfectly balanced. I highly recommend this place if you’re a seafood lover!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bTVhUnBnRRAB",
            "text": "This is so damn good! The seafood is very fresh with great cooking. I strongly recommend their endless menu when it's still available (which might not last for long), so that you can decide what are your favorites and get them regularly going forward."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmZzR2X0V3EAE",
            "text": "I had an absolutely delightful dining experience here! The arugula salad was incredibly fresh and perfectly balanced with its flavors. The jumbo shrimp skewers were grilled to perfection—so juicy and full of flavor. And the grilled octopus? Simply divine, tender, and cooked just right.\n\nThe staff here are nothing short of amazing—attentive, friendly, and always with a smile. They truly make you feel welcome and cared for. This place is a gem, and I can’t wait to come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOTdmcC1BRRAB",
            "text": "Enjoyed a fantastic meal with my wife here on a peaceful Tuesday evening. Their staff, led by manager Halil, were great!\n\nIf you love seafood and/or Mediterranean cuisine, the menu is loaded with options. Lots of cocktails, wines, and drinks too. We had the white wine sangria. Highly recommend!\n\nWe had some fresh oysters and claims, mezzi trio, and the seafood platter for two. So delicious!\n\nWe were informed the chef who made the hummus is from Israel. It was so creamy!\n\nFresh food, great service, good atmosphere. BTW, there is a parking lot behind the storefront that you can enter from New Dorp Lane.\n\nThanks again!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bWFxNmJBEAE",
            "text": "This is an amazing new place on New Dorp la. Food is excellent , service is great too! There are a lot of seafood dishes to choose from, as well as meat and poultry choices. Prices do NOT bite. I recommend this place for anyone for loves good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNTZ6TlJBEAE",
            "text": "Upon entering the restaurant, I was immediately struck by the inviting ambiance. We ordered bunch of appetizers ,for the main course we tried the Dover Sole and Grilled Octopus ıt was perfectly cooked and just melted in my mouth.Overall service was great food was amazing definitely we will go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaVVFNVFhMlJzTFZsSlVVWnRTbW8xVm1KbVYxRRAB",
            "text": "True Experience!\nSeabass Taverna is not just a place to eat — it’s a place to truly experience! Flavorful, delicious, and beautifully prepared home-style dishes come together like culinary masterpieces, all accompanied by top-notch service and warm hospitality from the entire staff. They truly make you feel like family.\nWe explored their extensive endless  menu, and every single dish we tried was fantastic — from appetizers to dessert, everything was absolutely delicious. The atmosphere was also special: soft background music, dim lighting, detailed Greek-style décor, and a professional, welcoming team that elevated our dining experience even more.\nWe’re already looking forward to our next visit — in fact, we were planning it before we even left! Thank you for such a memorable evening."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeVlQVlZBEAE",
            "text": "Absolutely enjoyable.. Halil was fantastic with his service.  49 dollars for an excellent food course and 22 dollars for an hour of all you can drink. You should make it a must go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcDdTYVZ3EAE",
            "text": "My family and I absolutely loved this place.\nFood/salad was so fresh and exquisite, we enjoyed every single bite of it.\nMy daughter loved the cocktails, my husband tried and loved Turkish beer and I enjoyed Turkish wine.\nThe service at Seabass Taverna is exceptional and prices are very reasonable. we highly recommend this place for seafood lovers. They also serve steaks,lamb chops and chicken.\nWe will be back soon.🙏"
        }
    ],
    "reviews_count": 69
}