{
    "name": "Violette's",
    "place_id": "ChIJPzucvrROwokR7y7Tqa-Eul0",
    "grid": "SI2",
    "address": "2271 Hylan Blvd, Staten Island, NY 10306, USA",
    "rating": 4.2,
    "user_ratings_total": 954,
    "phone_number": "(718) 650-5050",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodFVVbE9hMjVPT0ZOSWRrWllXWE5DUVhOVFlrRRAB",
            "text": "Just OK !  Brunch with a group of 25 Just OK  ! 😐"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neFoxaDRTM1ZtYW01VE9WQlVURkZaVmtSRWVtYxAB",
            "text": "Heard so many good things about Violette's and I'm so glad I finally had the chance to try it. The food was outstanding as was the service. Everyone was so welcoming and sweet. Definitely a place we'd return to."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGd2NESjJRa2R6YUdNeU1rOXRNR3haTUZaeVZWRRAB",
            "text": "If I could give the service a 10 I would! I've been served by Matthew a few times and I keep going back to see him! The food is always wonderful and the drinks are chef kiss strong!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbGJrSkVVbDkwYmpKd09HWjZPVlZUTTNSbFozYxAB",
            "text": "👏🏻"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjdGNIb3hUVmxCU0Rsbk4zcEtWamgxWHkxb01FRRAB",
            "text": "Beautiful, cozy dining venu, great price point, delicious dining choices and excellent staff all made for another magnificent Anniversary Dinner at Violette’s. The restaurant presents a magnificent cocktail menu, as well as, an extensive wine list. We enjoyed the Chateaubriand for two, complete three types of mashed potatoes and four types of sauces! Exquisitely cooked to perfection, it is not to be missed. The desserts were uniquely delicious. The Violette’s staff, namely, June, Gulhan, Yuen, Jose and Tatiana are ultra professional and attend to every need. They are truly an asset to Violette’s. We enjoyed a most  memorable evening at Violette’s."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCU2FHaFVORmxYTlRaMU5sWjRZVjlEYjFsaFQxRRAB",
            "text": "I absolutely loved my experience at Violette's, this restaurant was stunning, there were so many rooms, a tasting room, a party room, dining room, the decor was beautiful and unique throughout the restaurant. The vibe was romantic and really felt like we were at a cellar. Loved the dimmed lightning and just sexy ambiance. Perfect place for date night. The menu had a nice variety, we went for the crispy shrimp which was absolutely amazing and I recommend 100%, the spicy flatbread and the pear salad were also delicious. My smoked old fashion was perfect ! This place gets a 10/10 and I can't wait to visit again when I'm in Staten Island."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVVpHRXlORGQ2VFZRMU0ybHRUMHRNUnpoTlExRRAB",
            "text": "We came to Violettes for my father-in-law’s birthday, and it was amazing from start to finish! We brought our own cake, and they brought it out with a candle, which made the celebration even more special. The food was incredible—fresh and flavorful. The Japanese eggplant flatbread was delicious, the spanakopita fingers were perfectly crispy, and the spicy rigatoni was outstanding. Honestly, everything we ordered was so good I’ve lost track of the full list.\n\nOur server (Matt, I think?) was fantastic—friendly, attentive, and made us feel right at home. I can’t recommend Violettes enough for a delicious meal and a warm, welcoming atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMWIzTkNUMWt3UmpOVlZWQTNVVm80U3psT1UwRRAB",
            "text": "Great food and good service, elevated Italian."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdjZ5aERBEAE",
            "text": "We had my daughter’s Communion party here. Everything was amazing! The service, the food, the atmosphere…absolutely amazing!\n\nUpdate: had dinner at Violette’s tonight. I had to update my review to add that our server Matt was absolutely amazing; such a good vibe and made the dining experience more enjoyable with how personable he was. His demeanor matches the excellence of this restaurant and the food was, as always, perfect."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNWMxQnlWRGRTVEdRdGNIZDFjWGw0TWtSNk4xRRAB",
            "text": "Love this spot. Sometimes, when crowded, it gets too noisy for a conversation.  Otherwise  it is great. The best wine!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gb1FrOVFjV3MwTUZSdVdsOVlkMGN6U0d4YWNYYxAB",
            "text": "Excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSb1NrcFhPRWxKZFRjellXWkxUVVpXYlhneVpVRRAB",
            "text": "I recently celebrated a Bridal Shower here and the entire experience was amazing. The food and the atmosphere were incredible, but the service was truly exceptional.One host/ server in particular named Franco went above and beyond and I cannot thank him enough. Overall we had an amazing time and cannot wait to return."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCa00yd3ljbFJ2UW1SNVp6RTBXRk5qWVZGU1ptYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nFrom the moment we walked into Violette’s Cellar, we were completely captivated. The ambiance strikes the perfect balance between elegant and cozy dim lighting, you really feel as if you are in a cellar! As well as rich textures, and a welcoming energy that sets the tone for a memorable night out.\n\nThe food was nothing short of phenomenal. Every dish we ordered was thoughtfully prepared, beautifully presented, and bursting with flavor. You can truly taste the quality and creativity behind the menu.\n\nBut what truly elevated our experience was the service. Our server, Matt, was exceptional attentive without being overbearing, incredibly knowledgeable, and genuinely warm. He made us feel like we were his top priority, and his recommendations were spot on.\n\nWhether you’re celebrating something special or just want an unforgettable meal, Violette’s Cellar is a must-visit. We’ll absolutely be back and we’ll be asking for Matt!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOZWVrOTY0X2JhbE9BEAE",
            "text": "Very interesting menu. I had the empanadas and the steak, which was pretty good. My wife and kids had the fish and no one liked it. Overall the place is nice and unique"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BelMzZHpTR1UyUzBvM1drRlJPSGhRWVhveFowRRAB",
            "text": "Been a while since I’ve been back here and I must say, the food is spectacular, service is immaculate and the drinks were out of this world. Thank you Matt for taking the time to care for us ladies and giving us your best service and attention. Thank you Zack the bartender for the amazing drinks and coming to our table. Experience was flawless here and I can’t wait to come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPQ0FqY1BwNTVxUk9BEAE",
            "text": "Great food! Good sharing portions for smaller dishes. Drinks were amazing! Waitstaff and manager were responsive and kind. Handled billing issue with professionalism and respect. Thank you for your service and highly recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKX0VuZEtmMExqZHN3RRAB",
            "text": "Fine dining at its best! Restaurant prices are out of control, but when you eat in a establishment that creates dishes that are exceptional as Violets Cellar you don't mind paying as much, because it's worth it.\nThe ambiance was beautiful, the service outstanding and the food on the brunch menu was memorable. Every bite of the special zucchini pasta was to die for. My palates were doing a happy dance. Waffle and chicken on our table was also good especially the corn batter waffles very savory, fluffy and crispy. Let me not forget the drinks which were beautiful to admire, and delightful. I sipped my drink slowly to be able to enjoy every flavors that were in my margarita. For the finale I had the tiramisu which was one of the best I've had in SI. Everyone else on my table were very content with their dish. On our way out the Host was a delight and he gave us a tour of this fine establishment. This will be my monthly get together with my friends."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYUJpT0hidTg2LWVnEAE",
            "text": "This is by far the best restaurant on the island! Went for my anniversary today and the service was spectacular. Everything came out quick and everyone was friendly. Our server, Matt, went above and beyond for us! The food itself was delicious and you can tell every single ingredient used is fresh and high quality. I can’t wait to be back!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRazV1YVJnEAE",
            "text": "👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQX1lyN0NYcFBqSDNnRRAB",
            "text": "Everything about this place was fantastic! We have been wanting to go here for years and just never had the time for some reason or another. What a mistake! Don't wait to go here! The food, the service, the atmosphere ... everything was beautiful! You won't regret it!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyZ2FPdUl3EAE",
            "text": "Go to spot for date night....lack of phone service forces you to engage with the other person your with...short rib is like butta. Highly recommend if you're entertaining guests from out of town"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdnJ6YUJBEAE",
            "text": "What an awesome dining experience 👌 Delicious melt in your mouth food 😋 with great drinks and excellent service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb3FPdDhRRRAB",
            "text": "Excellent food. Havent had a single thoming I wouldn't order again. Amazing service and great atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMnJxb3JBRRAB",
            "text": "Outstanding service ! The food was great as well. We are going to come back for their brunch and awesome drinks."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvek1mSl9BRRAB",
            "text": "We recently celebrated our birthdays by doing the Chef's Tasting Menu. It blew us away! The food was so delicious and the service just as good. Loved the private intimate candle lit room. We were impressed that Chef Peter Botros came to us with each tasting and spoke to us. Such a great experience. Well worth the money!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvajVQcXZBRRAB",
            "text": "Just left was there for Easter brunch worst place ever bottom line the food sucked so bad , was so embarrassed for the people we invited to come with us"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvME96TmFnEAE",
            "text": "Visited on Saturday for ny second year wedding anniversary. The place was buzzing so the atmosphere was fab. A good mix of people really lovely to see. The menus are vast so they take a minute to go through. There’s options for every taste. We opted for the lamb chops with chimmichuri sauce. They were excellent. 4 small tender juicy chops. About 8 bites total with an emerald green emulsion that burst on the tongue. My husband opted for the shrimp cocktail which was 4 fat shrimp tail on. He said they were great. We both got the bottomless drinks as if you buy more than 2 drinks each it’s well worth opting for the 90min bottomless drinks. Mimosas, Bloody Mary and champagne sangria all very good. We didn’t really feel like anything else to eat. The appetisers were enough as we weren’t too hungry. The bill with tax and tip was 130 and we stayed around 2 hours. Very happy. Our second visit and we will be back for a third."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcVpfeFRREAE",
            "text": "Delicious steak, atmosphere is so nice. I already took many of my friends there."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3Z29fRVNBEAE",
            "text": "Can’t say enough good things about this place.  We love their small plates, so great to be able to order a bunch of these & share."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyOUwtTXRnRRAB",
            "text": "The food is always delish. 10 out of 10. The service is outstanding. Desserts amazing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eUlmNHVnRRAB",
            "text": "Every bite was excellent!! I had the French onion omelette, patatas bravas, coconut latte… brunch (all exceptional)!\nWe were Immediately seated and serviced; then greeted by the maitre’d. The atmosphere was intimate and classy."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRb191eUJ3EAE",
            "text": "The best restaurant on the island hands down! Service is immaculate! Every employee that works here is magnificent! The food here is top notch quality!! You won’t be disappointed!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN01mcm1BRRAB",
            "text": "EDIT: I’d like to thank Violette’s for listening to customer feedback and working to rectify things. I was reached out to and given some context over that particular day and they’ve made steps to correct it. I ultimately feel in retrospect that this was a rare experience and look forward to coming back here.\n\nFrom my other experiences here, the food is excellent (arguably on par with Michelin Star restaurants I’ve been to) and my service has typically been great. There’s one waitress we always get who’s always very attentive and this has become one of my favorite spots, especially since I don’t need to drive into heavy traffic to come here.\n\nOLD REVIEW:\nI usually come here pretty frequently and have almost never had a bad experience but today had to be the worst experience I’ve received. I went for Brunch and got seated upon walking in. However, we sat down for about 20 minutes without any waiter coming over to take our order. There was one waitress from another table who came by to give us water and she was fine, but we did not get any service at all. I ended up leaving afterward since at this point if just ordering my food is going to take this long then everything else will be too. I’m severely disappointed."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN2NQY3JRRRAB",
            "text": "I came on Sunday March 2nd for a party with more than 100 guests and more than 30% of the guest has reported with gastrointestinal symptoms, including my 5 year old son. A day after eating at Violette's my son was experiencing projectile vomiting- I end up taking my son the ER in worries that he was going to be suffering from dehydration and we needed medical support to help to suppress his vomiting.\n\nOur waitress (middle aged) wasn't the friendliest to my son and I. My son has a few allergens to foods, so the the host of the party let them know ahead of time but the waitress made me feel like she was pretty annoyed that he needed a different item that wasn't on the pre-fix menu. Also my entire table was never offered any drinks- when we asked for drinks she brushed us off and told us to ask another server, but there as no one else to ask because she was our tables server. We were lucky to have gotten water that was already poured out before we arrived. I understand that it was a busy event- but in the 4 hours of the party my entire table was never offered anything to drinks.\n\nThe restaurant has a beautiful decor.. but will not be returning after my experience on Sunday."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdklPM01REAE",
            "text": "UPDATE - MARCH 6, 2025 -\nI wouldn't touch this place with a 10 foot pole. More than 25% of our guests, myself included, became sick with fevers and/or gastrointestinal issues, including diarrhea and vomiting. I did not previously mention that we discovered a carton of moldy cream cheese placed on our table for the family style bread/bagel basket. I usually disregard and not mention small and hopefully isolated things like this because I know restaurant business is hard, but who knows what other unhygienic things happen behind closed doors? This experience has caused our family and friends so much physical and emotional pain.\n\n------\nCame here for my niece's 1 year old birthday party so we were in the private party room. I was somehow assuming that if you are hosting a kid's birthday party that you would be a restaurant that is kid-friendly. Boy, was I wrong.\n\nAs a new mom to a now 4-month old, I do my best to be proactive and prepare for everything. We had the room booked for 4 hours. I am okay with knowing that the restaurant is not stroller accessible - fine, we can deal with that and carry the stroller up and down the stairs from the entrance, okay. BUT when you say you have a baby changing table, DO NOT give us the worst excuse of a table. The changing table was high above the open toilet and only in the women's restroom in only one of the stalls. There was no way I could change her when she was basically face-to-face with me and above my elbows. One wrong move, my baby would have ended up with her head in the toilet. Safety hazard. I was furious to be faced by such a ridiculous situation and not being able to offer my child a safe option to be comfortable at a child's birthday party. I had to change my baby in the corner of the party room in her own car seat and was faced with judgmental stares by the restaurant staff. Unbelievable. When you give me no options, I have to do what I have to do. There were multiple young children in our party and we all had to make do - we were there for 4 hours after all. It would have been nicer to not have any changing table than that one. You probably would have needed to be a 6-foot tall woman to use it. I even had to support my sister-in-law to change the birthday girl (the star of the party) because she was NOT about to be butt-naked in front of all her family and friends in the party room. We had to keep the bathroom stall open because both of us adults wouldn't have fit in the stall.\n\nI haven't even said anything about the food yet either though there doesn't need much to be said because it was terrible. I was left hungry and dissatisfied. I'm not even sure I ate real eggs for my BEC because my scrambled eggs were drowned in the strange cheese sauce. The bread that it was on was the end piece of a loaf. Who serves the end piece of a bread loaf?\n\nSafe to say that I don't ever need to come back here even if my child is all well and grown and won't need any changing table anymore. I'll definitely be remembering this restaurant experience as an immensely negative one in my life.\n\nP.S. To the staff - please do something about the two steps to the party room, if you need to have the host warn people about tripping on those steps every time someone walks by, you should probably have some physical marker to let people know."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRZ2NuZFhBEAE",
            "text": "Try the strawberry (raspberry) soap!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbm9qdURBEAE",
            "text": "Several people on Sunday got food poisoning from the bacon egg and cheese."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc3BDYkl3EAE",
            "text": "It’s a place to enjoy and to comeback"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnd1lIMTZRRRAB",
            "text": "The food was very salty. For the prize the portion was very small. I ordered the skirt steak I couldn’t eat it. Who serve a leg of duck. For the prize it should have been   half of the  duck. No vegetable was serve with meal. No bread  or salad."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNWE2V1JREAE",
            "text": "Amazing place for date night. Drinks are good and food is consistently good as well. Don’t sleep on the charcuterie board—but also expect to be full!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaFlucHVBRRAB",
            "text": "Went for Bruch on 12/29/24. Super Service - John was a hero and his teammates were helpful too which was a nice touch. Food was delicious--seriously (Philly Cheesestake (ribeye) with goatcheese and onion jam plus an over easy egg on top tasted even better than expected). We loved the vibe and didn't want to leave. Drinks were very tasty and unique. Thoroughly enjoyed ...Will definitely go again. Kudos to all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNkpYWHhBRRAB",
            "text": "Amazing place\nUnbelievable delicious food and warm kind service. June was our server with smile and always the best recommendations of food and drinks. Steak is delicious and everything that we tried so far super fresh and tasty\nRecommended it 10000000%"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaU83YVdREAE",
            "text": "The ambiance of the restaurant is very classy and elegant, providing a fine-dining experience with reasonably priced items! The selection is also very varied and they were almost all delicious! The truffled cream corn, lobster benedict, and burgers were all very delicious, with our favorite being the corn with its very potent and delicious truffle flavor! The specialized vacuum syphon coffee was also delicious and was enough for four medium sized cups, though it was made for four! The service was also impeccable with Mario and Kevin providing us with quick and considerate service with everything we requested! Our least favorite was the yuzu iced tea which was bitter and did not yield much yuzu flavor at all, so I definitely recommend increasing the yuzu concentration to make the drink more enjoyable!\n\nOverall we really want to come back soon to try their many other selections! We came for brunch and we can't wait to try their extensive dinner selection as well!\n\nThank you for the amazing service!\n\nThank you for reading and best of luck! (:"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOVl5dFBREAE",
            "text": "Very tasty.was pleasantly surprised! Took dish of the day, red snapper. Prices are a bit overpriced.  Main coarse dish is around 40$. Smoked Mac and cheese just one love. 😋"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cF9uTXBnRRAB",
            "text": "This place was nice! Very cute intimate vibes for a date or a drink with a good friend. Not too crowded. The staff are really friendly and make you feel right at home. I got the Lichee Grand which was pretty good. 4 stars because this food and drinks are a little overpriced."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNkx6WU5REAE",
            "text": "We each ordered different dishes, shared, and all loved everything!\nThe french toast, cookie butter pancakes, mini croissants, and the egg dishes were incredible (11/10) but the chicken and waffles were extra yummy (12/10)!\n\nLast but not least, our waiter was so nice and funny! Would definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNElMeTBRRRAB",
            "text": "Good spot for a group brunch.  Kind of pricey but you get lots of decent food, drinks are strong, and staff is generally good.\n\nHighly recommend the fig flatbread, croissants, and bacon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbTY2UVNBEAE",
            "text": "Came here for a late brunch on a Sunday with a large group. Thankfully the staff was able to accommodate a huge table! I ordered an espresso martini and it was perfect. I also decided to go for the lobster Benedict, even though it was little pricey at $28. Once I got it I realized why, the plate had a whole tail. The sriracha hollandaise was a highlight for the dish. My boyfriend got the chicken and waffles and ate every last bite. The only feedback was that he preferred bone in chicken as opposed to tenders, but he still enjoyed it. I’m curious to check out the dinner menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxMDczVWJ3EAE",
            "text": "Subject: Refund Request Due to Disappointing Dining Experience at Violette’s Cellar\n\nMy girlfriend and I visited Violette’s Cellar and unfortunately had a disappointing experience. Despite a pleasant ambiance and courteous staff, specific requests were disregarded. I made it explicitly clear that I didn’t want any sauce on any of the dishes. However, the strip steak, cooked perfectly, was spoiled by an overpowering green sauce that didn’t complement the dish. Discovering a bone in the calamari was unexpected and concerning. Moreover, the whipped potatoes, which we expected to be regular mashed potatoes, were unexpectedly sweet, orange in color, and had an off-putting aroma. Additionally, the rice pudding, described as such, resembled warm cereal, not meeting our expectations.\n\nFurthermore, there seemed to be confusion or miscommunication about certain menu details during our visit.\n\nGiven these multiple discrepancies during our dining experience, we kindly request a refund to address these issues.\n\nThank you,\nAldo Santos"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcklESXpBRRAB",
            "text": "This place is bar-none the best brunch spot, doing justice to the rest of the esteemed restraunt group that it is part of. Its crew of John, Matt, David, Zach, and all others clearly take a special concerted effort for each visit and event\nI can not recommend this place enough for an elevated culinary experience, done right"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmOXUzRklnEAE",
            "text": "Went there today for a holiday lunch/brunch and was very impressed with the food, service & ambiance!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3b3UzYUt3EAE",
            "text": "Went to Violettes Cellar on their opening night. It was an absolutely beautiful restaurant. The attention to detail was not lacking in any way. Decor was gorgeous with wine cork walls, exposed brick, industrial lighting and a touch of purple tones throughout all parts of the restaurant, party rooms and button room. The food was fantastic! Very well executed, described exactly as served on the menu and nicely presented. Had a chance to speak to the owner/chef and he seems to be a very nice person dedicated to the success of his restaurant that he clearly put a lot of thought and love into. I will definitely frequent Violette's Cellar as it is a gem in Staten Island and exactly what our little island needs. Don't forget to visit the speakeasy The Button Room! It brings you back in time to the 20's and is worth the experience!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXN3FuTWhRRRAB",
            "text": "service was great. Things are on the saltier side when we went like the garganelli, but chili flakes fixes everything. Oysters were fresh and lobster crostini was so refreshing.\n\nFree bread we love that. Pear Salad was good.\nDrinks were good they have so many options!\n\nLobster benedict was salty, charred octopus was salty, but the salad paired well with them both.\n\nDessert was eh, bitter and burnt creme brûlée didn’t get it, cheesecake was... yah no.\n\nWould come back again I enjoyed this place! They actually cook."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcmJ1QkxREAE",
            "text": "Food was delicious. I loved the little outside patio space and our server Matt was attentive and AMAZING!! He gave us a great rundown of the specials and helped us choose from all the yummy options. He also got me the most delicious Mocktail. I will be returning."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbUxDX3RnRRAB",
            "text": "I had a dinner for my tax business here in the wine room at Violette’s Cellar. From the moment you walk in the place has a vibe that is rare when eating out on Staten Island.\n\nOn top of that the drink special was great and the food was some of the best I’ve had in general let alone on Staten Island.\n\nOur waiter was great I wish I could remember his name because I would shout him out.\n\nWe ate like kings & queens and our drinks never went empty.\n\nWill be back, for sure.\n\nShout out to Chef Botros on another great dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROeHB5cFNBEAE",
            "text": "This was our first time dining here. We had the saucy Sunday menu. It was absolutely delicious!  We enjoyed everything from start to finish and added a bottle of wine!  We will definitely be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNzRuN2h3RRAB",
            "text": "Kevin is our server tonight. He’s amazing, excellent service! We love tonight’s special Sea bass with mushroom risotto. However, we were very disappointed because tomahawks steaks were sold out tonight, in a Saturday night… So make sure to call and ask if you are planning to go there for tomahawks."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmZ2Z1c3R3RRAB",
            "text": "Great service, great food, great atmosphere. I love the waiter experience and I love the atmosphere. The food was really good and freshly cooked. 5/5 would recommend you try this pace out"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNGZHM1hREAE",
            "text": "I’m not going to lie I was a bit nervous not knowing what to expect, I booked the wine cellar for my girl friends birthday and everything was absolutely amazing, our waiter Kevin was such a sweetheart and so welcoming, the food was perfect and the privacy with our family was great, this is a must try restaurant, I posted a few pictures below enjoy."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeVplMWl3RRAB",
            "text": "The food is delicious! Love the old standard music by Sinatra and all of those great voices from that era. The waiter was cute too!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcklIbW13RRAB",
            "text": "Love this place it’s decor and it’s definitely one of a kind. My best friends 30th surprise birthday party was held here. It was so cool how behind the doors are other rooms. The food and service was wonderful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocjZqWnJnRRAB",
            "text": "Our experience was fantastic. The food is delicious. The service is so nice. The adult iced coffee is delectable. For sure we will be back again next time."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzX0xtTE9BEAE",
            "text": "Came here for the first time for brunch with my girlfriend's. Such a gorgeous place! We were seated in this little room off of the entrance that was perfect for a party of 6 people. It was nice to have our own little private get together.…"
        }
    ],
    "reviews_count": 63
}