{
    "name": "Wonder New Dorp",
    "place_id": "ChIJN4YVOABJwokRMKLZIbilfWE",
    "grid": "SI2",
    "address": "2530C Hylan Blvd, Staten Island, NY 10306, USA",
    "rating": 3.9,
    "user_ratings_total": 57,
    "phone_number": "(855) 818-5755",
    "reviews": [
        {
            "date": "수정일: 12시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUlFuQkhNa2hoZFZRd1FYcDRPVUpoYVdvdFlWRRAB",
            "text": "50% off the first order applies to a minimum of $15 before the taxes and fees. I brought this up to customer support and they said that the reason the code didn’t work was because I didn’t meet the minimum which was not made known ahead of time. Really frustrating and no resolution from customer support. The salad I got was ok though.  But the truck left a bad taste in my mouth. I wonder whether this business will turn around, looking at the reviews.\n\nAlso the inside of the store  is so depressingly sterile. I went to try to see how ordering inside on the tablet is and while customizing my order, it just goes back and resets after a while. LOL"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTE5sZzVNRlZSTlVOTVZHSmhhVWx0T0d4cFNIYxAB",
            "text": "2025.11 it is a unify kitchen for all reheat food.  I don’t think it is worth"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMlJGODViR2xsZG5SdlZETjVhM2xWWkMxVmEwRRAB",
            "text": "57 minutes to make a single chicken sandwich pick up order. If you value your personal time don’t ever come to this waste of time, money and energy.…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdE5sQkJOM1p3V2toalVrcDJVamt4TlZKQ1pHYxAB",
            "text": "The Marcus Samuelson mac& cheese was wonderful. This is the 3rd time,I've ordered it. However the baby burger griddle burger looked like and was the consistently of a floor tile. I ordered it because I am a big fan of Pat Lafrieda meats. Was hugely disappointed in the burger. I really do like this place,will return for the mac&cheese will try other foods,just not the burger. Atmosphere is nice enough if you can time it in between the High school children's eating times."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVlNuUTVhbE5qV1c4NVJrdDJaazF0YWkxU2QxRRAB",
            "text": "I enjoyed the different variety of foods. Best to come here if you are a picky eater. Everyone could find some thing to eat. Dietary restrictions to fast food. It’s a hit"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tod1YzRlZhbXA0YVcwNGQxTkdiR0ZKWjNOaGFWRRAB",
            "text": "I love it"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Q04wbDNibVpMVW0xNmVsVjRSVlJOWkZad05rRRAB",
            "text": "Manager was so nice helped me find a coupon\nAutumn salad was perfect"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cb1JrTTFWVzl3U0VoTVVHTk5kMnRPYTNKa1FuYxAB",
            "text": "Ordered twice from them. Finally just a simple fresh salad with some quinoa is available on the island . Tastes fresh and good with a different variety of veggies and can even add tofu and avocado for protein."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORGJtSlpiUzB5VDA5S1MyUk9RWEp2WjBGb2EzYxAB",
            "text": "Love this place!! Food great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeGVFZFNTRXROZDA5RmNYRkpXVm93T0dKUU4yYxAB",
            "text": "Love this concept with so many choices under one roof"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdFRXUlNTSG95Tkd3eVpVNVZkRUZaYjNaSldtYxAB",
            "text": "Great idea when ordering with picky kids plenty of options"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQ2FsRjBOV2RtU0VkR1RUZDZjekZCYmkxNk1rRRAB",
            "text": "Got the classic cheese burger from Burger Baby. Cold and it had a disgusting mustard based sauce on it that wasn’t mentioned on the menu…\nFries were good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Zd2NuWlFZakZHWVZoek5UWTROQzF5VjBKTWQyYxAB",
            "text": "Ordered from Limesalt and Yasas. Both had great options. Yasas let you build your own sandwich or bowl. this was great so each of us got exactly what we wanted. Order was ready very quickly, pick up was so easy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WWIyZENNREJ5V2pWVllscEhVWEF3V2tzeU1GRRAB",
            "text": "Order was delivered. Tejas brisket sandwich was tender and somewhat tasty but my partner’s pulled pork sandwich was small and the meat was dry."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNExWOU9hRnBGT1hSeFdWaFNUVWhOYzFsVFRIYxAB",
            "text": "Not good. Ordered the chicken kebab, and it came out rubbery, as if it had just been microwaved. The menu looks appealing at first glance, but it’s just surface-level selection with no real quality behind it. There are so many better places to eat on the island—don’t waste your time here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWblJYUjZRV0p3VUdOSFlXOXNUMTlsY0Uxb2FrRRAB",
            "text": "App said ready for pick up within 6 minutes of ordering so I went in, then was told it needs more time..? Waited additional 5-7 min in store. I knew something was going to be off when it smelled a little weird facing the kitchen. Twice the fire alarm rung very loud as I was waiting for whatever reason??? I seen a women walk out because of that. The Garlic bread was fine.\nThe di fara pizza didn’t look like the ones I seen online. I had both Di fara frozen and from midwood couple times, amazing. THE FROZEN DI FARA IS BETTER than this. DISGUSTING. Had a weak smell, rubbery chewy ah dough, cheese that slides right off in one big glob that was overloaded in what tasted like cheese from mozzarella sticks which I hate because I tend to choke on mozzarella sticks and don’t eat them. Sauce was okay but at the same dry, and was BARELY any compared to the cheese. They only use the same basil from di fara.\nIf u got the 50% of 2 orders from the mail use them to order from third party restaurants listed on their app. Don’t order directly from these scam artists. Bravo pizza across the street or frozen di fara found in supermarkets would save you all this bs frustration smh"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScVdtUlVWbU5DY0ZaWmFFcE5lRUZCTm5oV2MxRRAB",
            "text": "The New Dorp location doesn’t lend itself to eating in but that’s not my thing anyway. This is my third time ordering. It arrives very quickly. I’m in front of my computer all day. I work from home but sometimes I just don’t have the time to make something lunch-worthy. On those days, I pick up my phone and order. It can get pricey but the delivery is free so balance that. I’ve enjoyed every meal so far and look forward to trying other ones. There quite a selection so you can go for a while and not repeat anything. This was a great idea."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUWQyaGtNRUZpWmtwc2N6WmlaRTB3VWtSNFJIYxAB",
            "text": "Drove past the establishment and wondered what was inside. Later found out they had an app, so I decided to download and check it out. To my surprise there was such a wide variety of food choices! They even have local food establishments in the app as well. I would definitely order from here again and encourage all to try as well!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNVRrNXRNVVpRU0RoSWVVbDRiR0ZIVlZoaE0zYxAB",
            "text": "Thought it would have been better than it was. Portions were decent but cooking needed some help (crispier fries, chicken crispier etc). Can’t say I’d must go back but it was ok , just ok"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTmNGWnFUMDVRUTFOV2NuTmpjVGRQV1ZKTmQzYxAB",
            "text": "Packed well and delivered on time."
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORlpFNXRVRU0yYVZoaldubHpaVVJuWWpSV2IxRRAB",
            "text": "Очень плохое обслуживание. Сотрудников никогда нет у стойки заказов. Я просто хочу забрать свой заказ, который уже давно готов и стоит на полке. Но его не отдают, потому что сотрудники не обращают на тебя никакого внимания. Мне приходится долго ждать, чтобы получить свой заказ! Не советую никому это место!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poS2MxQmxRMnhwTVU4M1dISjJjVjlqY1VoV1FuYxAB",
            "text": "wonderful"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSWFEWnlXVzEyVEhoVmRUZE5VMHd0WkhwUVgyYxAB",
            "text": "I've yet to have Di Fara from the original location, and I've heard people say Wonder doesn't make it the same. All I know is that this was by far the best pizza in the area, hands down."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUFprNTFYMkZtT1daT01WaEVNM3BtYUdacVJGRRAB",
            "text": "I've ordered pick up twice so far and it's been fast, efficient, and ready upon arrival. The food is good and fairly priced. Only issue that seems to be arising, and which would've made me order more if this doesn't keep happening, is all of the restaurants are 'sold out' of their items. Also, the items that aren't sold out will state one or more of the ingredients are not available. Hopefully they stock up and plan better for I would be  included to order more often. I favor all the options and like the variety of different cuisines they offer. They are located only 5 minutes from my home so I am looking into getting the Wonder plan if my experience remains positive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdGJtdHdjQzFRWmtocldETmhUMHhhV1RKSFRtYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nI’ve ordered delivery from Wonder several times now, and it’s consistently excellent. The food is delicious—exactly what I hoped for, every time. The app is super intuitive and easy to use, and I really appreciate the live tracking feature. My order arrived right on time, which is rare these days! Seamless experience from start to finish. Highly recommend if you’re looking for great food and reliable service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaV1pYWk1kMDQyY1dnMFVGaEpXaTFTU0dObGEzYxAB",
            "text": "Picked up some food for a late dinner. The cheesesteak was delicious and the accompanying fries were crispy and fresh."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvM2FXazFWSEJEYmxNMFdrdGliRWREZHpodFZWRRAB",
            "text": "There is nothing wonderful about wonder. While the place was clean and the service was very friendly the food was just terrible. I ordered the chicken Shawarma and it tasted nothing like chicken Shawarma.. It had a strange paste on the flatbread, that just overpowered the entire thing. I couldn’t even eat it. My husband ordered general tso chicken and was disappointed in his meal as well. He said everything was good except for the chicken which defeats the purpose of ordering general tso chicken lol I’m not sure if these are freshly made or if it’s something frozen and they heat up day of. But was not happy with the food so will not be returning."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMWVuWm1kVGhQVFhSa05rWnBUMUExVGxJMWFsRRAB",
            "text": "Wonderful customer service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaM1lqTmpZbEpCYWxkWk1ucDJPSFZMY25NM2RHYxAB",
            "text": "Have ordered several times since they opened in New Dorp. Now everyone can find something they like, even from different restaurants, and they all come in the same delivery. Such a smart concept."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeGFqSldVSGN3UzFaeFVWUkdWemRrZDJwR2JsRRAB",
            "text": "Great place where everyone in the fam can find something that suits them. It’s a new household favorite."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSlFUQXpkakF4TWtZMFRVbHNkR3BtT0dvNFRrRRAB",
            "text": "Way overpriced for the food quality. Don't bother with this \"ghost kitchen\" concept"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMlEzTXhSV3hZVm1reVNrUnpZbTg0VFd0U2VIYxAB",
            "text": "Delivery was fast. Food was fresh and delicious. We ordered from Limesalt and Yassos. Both fantastic choices."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWk9GQjNaR1F0TjBWQlJrUXdNR0p0TXpKV2MxRRAB",
            "text": "Enjoyed my meal tonight from Wonder. I will definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swd1pGZGxWM2MzWlROaWMwRnpPR1ZwTUVGV1FsRRAB",
            "text": "This was a terrible experience.  The order took 2 hours to arrive to my house.  Food was cold, which was not a surprise considering the delivery driver rode a bicycle through High Rock Park Woods to get to my house - instead of using the streets.  Cheese only Quesadilla came with meat in it, bacon on burger was raw, steak was ice cold and the best was the cold pizza that was never cut into slices!  It will be a Wonder if this place lasts.  Terrible all the way around."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWlNIZzVhMDFtVG5oRVdrTTJhRzlPWmtrNE1sRRAB",
            "text": "Ordered take out. Pulled pork. Was terrible. couldn’t  even chew it. Small portions. Hard & dry. No sauce. On a McDonald’s bun. Disappointed"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONVUzRkdhak16TmxSNlRsZERXWEoyZVY5M2MxRRAB",
            "text": "Great idea. A variety of foods for the family. Everyone can get what they want. Food is delicious. Service was fast.  I would recommend it to anyone."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWlMzb3RTVmRxT1daRFpHdEpXSFJXWVRaelUyYxAB",
            "text": "I’ve given Wonder a fair chance. The concept is great, but the execution is terrible. The food often arrives undercooked or doesn’t taste fresh. My last order was Magnolia’s banana pudding and it was actually disgusting — nothing like Magnolia’s fresh product. I think If the restaurants knew how their dishes were being prepared and served through Wonder, they’d be furious. Very disappointing overall."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeE1EZGtkVm8xTjBsUVMwcFNNVnB0WldoclltYxAB",
            "text": "Babu tried and failed but Wonder perfected the 'variety' concept. Easy ordering. The food was delicious and reasonably priced. Will make Wonder a habit. The cornbread from Streetbird by Marcus Samuelsson was heavenly. Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVWRWUmhiakExWDFSRFpUaDVSbFpxUjJaUVMwRRAB",
            "text": "Awesome service!! Great idea to have many restaurants in one building!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTUxWRlFTWFJqY0hrNFlYSktZa3gyT1d0NGRIYxAB",
            "text": "I ordered for the first time earlier today, the food was overall excellent. No issues with quality, order mistakes & portion sizes are perfect. Everything is priced below what you would expect, but the quality & freshness of the food is maintained nonetheless. It's primarily delivery or takeout, with some dine in seats. And the variety is unexpectedly deep. I recommend trying a few of the various virtual restaurants on offer, and browsing the app to find something you will like."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMFZWUkpVbGcwYVZoUmFsRktVSFl5U2tsTWJYYxAB",
            "text": "I gave it a try because there was a 50% discount. But I still pay $20 For For the brisket and pulled pork. I cannot believe the portion is so small, especially the pulled pork. They look like leftover. If I have to pay the full price 40 something dollars. I will be super super mad. I thought it will come at full pickle, But it was only three slices."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQ1YxOXNTVGh5ZG1rdE5tMHhXR0ZpTTBKdVlYYxAB",
            "text": "DELICIOUS!!!!!!!!!!\nI ordered food from 3 Restaurants here (which is crazy to say out loud 😂): Limesalt, Burger Baby & Bobby Flay Steak and none disappointed 🤤\nI ordered chicken tacos with cilantro, tomatillo sauce, cheese and sour cream and they were so flavorful! My daughter also loved her cheeseburger 😍 it was so flavorful and the bun was fluffy 😱\n\nSince we went for the grand opening they were also giving out samples of all their foods: Pizza, Buffalo Wings, Brisket and every single one of them surpassed my expectations 🔥 The brisket ofcourse my favorite, incredibly soft and flavorful 😱\n\nHighly recommend! Thank you Dario for inviting us 💙"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Tll6aG1Xa05qZWsxSlIwOVRNRk5qY3pOYWVrRRAB",
            "text": "Nice place for food pick up. It simulates ordering from multiple restaurants but in reality the food comes from one place and you pick up one order. The place offers coupons but without coupons the food from here is more expensive then restaurants around it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNmFYTTBUVXhwUzFvM1gyaGFVWGxvTkVndFUyYxAB",
            "text": "Great service. The chicken tenders from Streetbird were so good."
        }
    ],
    "reviews_count": 44
}