{
    "name": "La Strada",
    "place_id": "ChIJRU83BFNJwokRz3CQN9GZykQ",
    "grid": "SI2",
    "address": "139 New Dorp Ln, Staten Island, NY 10306, USA",
    "rating": 4.5,
    "user_ratings_total": 507,
    "phone_number": "(718) 667-4040",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreE5HaHNRVnBGYzBGMVZ6ZE1VakIwUjJzek1XYxAB",
            "text": "Elegant classic Italian. Generous portions. Heavy pours. Professional service."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdk4yTlBSalUxVTJaVlgzTnZSMW95VDFoSFYxRRAB",
            "text": "Fantastic food. Portions vary from plate to plate. Some generous, some smaller.  When I first was ordering their tiramisu is was double the size. I can't complain though. Each dish I order is delicious. I know I order frequently, for me to continuously order from the same restaurant and being a foodie, means that the business has quality."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNeGNubFRUR3hUVGxkbVVtVlBRVFV4TURaTFJWRRAB",
            "text": "Food and Service was Excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5clJ6SnhNR1JSVjI5eFMwbHdSRkpFU0hadlIzYxAB",
            "text": "Waiter was very accommodating in the beginning of the meal when we were sat in the second dining room. I had stepped outside to mitigate the stress of a loud child at another table, and upon seeing that we had put on jackets, he offered to lower the A/C which we declined.  I explained that I had mostly been taking a breather from the noise and he graciously offered for us to move to the first room. Ambiance was perfect in there as was the temperature. I felt like I was in an Italian restaurant instead of a daycare. The food was spectacular. Mozzarella en carroza was cooked to perfection with ideal bread to cheese ratio. It came with a thick pureéd sauce. The Veal Saltimbocca was not traditional (veal, prosciutto, sage and white wine and butter for the sauce) but their take was a nice change. Thin veal cutlets topped with prosciutto. Halved grape tomatoes with what I believe was salami. This was on a bed of spinach sautéed in garlic and oil. The dish also had 2 halves of a hard boiled egg (overcooked, but not an issue as I don't eat them.) Their gnocchi was cooked perfectly as was the penne vodka and each arrived in a trough. No one would leave here saying they didn't get sufficient portions. The only thing to which I took exception was the decline in service after the entrées were served. I was glad there was a water pitcher on an adjacent table and refilled my own. The bathroom was clean with a kohler sink and toilet. The toilet was running and would not flush, however, I was able to easily remedy this by lifting the tank lid. I had expected the chain to be disconnected from the flapper, but the flapped was actually lodged in the flush valve opening. I dislodged it, the tank filled and it flushed without issue. The time before we were asked which dessert we chose was so extensive, I had given up and stepped outside for a moment, and unfortunately, the dessert order was taken in my absence so I did not get a chance to try the espresso or bread pudding or get a candle in my boyfriend's tiramisu for his birthday. We made do and pretended with a cocktail straw and sang \"Happy Birthday\" anyway. We will, of course, be back and I'm certain the next experience will get the extra star. Street parking is free after 5pm; metered parking before then."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNE1tWk9XR0V4V0VOeU4zZDROMU40UTAxMmNVRRAB",
            "text": "They say in order to be successful restaurant you need consistency well la strada is that no matter what nothing changes here it’s consistent. The food is spot on always , been coming here since i was a kid grew up in this place some of the originals know me 30 plus years here and i love coming back time after time. Hands down the best"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaFpqSldaM0pYVldkaVNrUnBUbkJ6Y1dWQ2IxRRAB",
            "text": "Ordered through door dash two days in a row. Great portions, fantastic food.  Everything had a distinct unique taste. I've been to Italian restaurants in Brooklyn and Manhattan, I feel this supercedes any other restaurant I've been to.\nMy orders both days were within thirty minutes or so, and I'm close by, but not close enough to have my extravagant amount of food ordered and delivered. Everything is packed neatly so it won't spill. Both days they included a salad and Italian bread.\nFresh food and nice portions."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWlNVbFROMEZCYW1wbU5UaFhYMVJ1ZVdFeVVWRRAB",
            "text": "Best best best best Cuisine!!!!!!!!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toM1RXTjBPRGhGTkVGbU5VWmlWak5WU1Zsc01FRRAB",
            "text": "Great experience, old school feel. Food was great, service was really good. Price pretty much within range. Decent street parking."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMVEloLURNdE03WVNnEAE",
            "text": "What a great place, just dined here tonight with my kids and my little brother for father’s day. Very hospitable, accommodating, & great portions.\nCan’t wait to bring them back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLUzh5WXozMkkzODlRRRAB",
            "text": "Good food great service… Sal’s the man"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOU3J6dnpKMi0yTDN3RRAB",
            "text": "Had a dinner party for my daughter . Jimmy and Marco were super accommodating. Everything was perfect .  Never felt rushed . At end of night had guests lingering and waitstaff was very understanding .   Thank you again for our 4th celebration there ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVGwwc3lFMmZ6bTZnRRAB",
            "text": "We hade Mother's Day dinner yesterday with family IT WAS AMAZING!! From the minute we walked in we were greated & sat right away. Our server Jesus along with helpers were just FABULOUS!!  Each dinner was delicious & even exceptions were made on a prefixed dinner. So kind!! Couldn't have asked for better food or service!!  Can't wait to come back!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURnNHRzXxAB",
            "text": "Excellent food. Excellent service. The menu options include traditional Italian-American fare. The servers are professional, neatly dressed, and polite. I definitely recommend this restaurant if you are looking for a nice Italian place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2elpybzBRRRAB",
            "text": "Took great care of our after-funeral luncheon. Service was wonderful with extra care for our large crowd. Helped with the metered parking situation.  Food was delicious with choices for everyone. The staff were always there when ANYTHING was needed."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQZ1pYN01BEAE",
            "text": "My family and I have dined many times at LaStrada, and I have been here with friends many times as well. The food is absolutely delicious, always fresh, and what I like the most about LaStrada is you can tell them what it is you would like to eat, whether it’s on the menu or not, And they will prepare anything you like and do it perfectly. The service is absolutely stellar, and it has become our favorite restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURud2JuYmdRRRAB",
            "text": "Great place for Italian food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINjVERFpREAE",
            "text": "Bestt food and great service! You wont be disappointed! See ya soon!😎"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbXVMcWt3RRAB",
            "text": "Absolutely great service!\nFood is always excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiaWJpZ013EAE",
            "text": "Food was amazing and the portion is very good for its price, me and my girlfriend came here yesterday night and was greeted by the owner, he explained to us their specials for the night and what he highly recommended. Lovely atmosphere, classical old traditional music to enjoy your breadsticks and food! Highly recommend and would be back again! 😃"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NWFiN0pREAE",
            "text": "A nice pleasant surprise. Prices are reasonable, portion size is large, and it was delicious with good service. What more can you ask for?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbll5OU5REAE",
            "text": "Great portions!\nExcellent dining experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbll5QWZREAE",
            "text": "perfect Italian restaurant , the food service and atmosphere is amazing , everything came out fresh and made to order , you cant go wrong here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqN01YNkZ3EAE",
            "text": "Returned with some friends last night after not being here since my dad's repasse dinner a few yrs ago & while the decor is dated the food is still EXCELLENT AS ALWAYS! 5 STARS IS NOT ADEQUATE!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqaXNLTGFnEAE",
            "text": "I love this place"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGOHNyLVlnEAE",
            "text": "I enjoyed my dinner here IMMENSELY! Fantastic from the wine to dessert. First class outstanding cuisine highly recommended! Great fish! Outstanding!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdVAyUUZREAE",
            "text": "Over 30 years and never had a bad meal or problem.   Courteous  staff and excellent meals every time!   Definitely our go-to place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbU5DajhBRRAB",
            "text": "Excellent food. Friendly staff. Make a reservation for weekends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMllUeXBnRRAB",
            "text": "My wife, myself and my children have been going to this resturant since we moved to Staten Island in 1984, The food has been great over the years as well as the service, My favorite dish has been the supa de pece and we wood always order the hot antipasto for 2. This has always been our go to resturant all the years we have lived on Staten Island."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaZzhHT0RnEAE",
            "text": "Excellent food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0cmNUWUNBEAE",
            "text": "Excellent! The food and drinks are always delicious and the atmosphere is great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaVBiMFdBEAE",
            "text": "Great food and attentive staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWMXNXZW1BRRAB",
            "text": "Jimmy is an outstanding server Been taking care of us for years."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMExHcEFnEAE",
            "text": "Prepare yourself for a culinary journey unlike any other! My recent dining experience at this esteemed establishment was an ode to Italian gastronomy at its finest. Nestled in an elegant setting, this eatery seamlessly combines sophistication with exceptional cuisine.\n\nThe extensive wine list was a treasure trove for oenophiles. With guidance from the adept staff, I paired my Tortellini with a delightful wine that complemented the flavors impeccably. The sommelier's expertise in curating such an extensive and diverse selection of wines truly added to the overall delight of the evening."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWNEx2WGdBRRAB",
            "text": "Terrific food and service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGOWFIbFp3EAE",
            "text": "Great place. We have all of our meetings here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGdnNfYUZnEAE",
            "text": "OTTIMO LAVORO from the big famiglia for dinner compleanno everyone so good friendly and food delicious. So success and will return!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGeTcyT2hnRRAB",
            "text": "Un pequeño gran restaurante con una atención impecable y comida exquisita!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGaV9lZDZ3RRAB",
            "text": "I have been coming here for decades. My favorite restaurant. Food is delicious and the service is great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwOTdtcklBEAE",
            "text": "Food and service are always terrific. We were six people, and we had six different items for dinner. Everyone said their dish was delicious."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbGJHaWx3RRAB",
            "text": "We had our wedding rehearsal dinner here last year. They were fantastic. We had the private room to the side with its own entrance/exit door. It was perfect !!! We highly recommend La Strada for the food and private room !!! And great service !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NTVtc3lBRRAB",
            "text": "Took Family to La Strada last night. One of my favorite spots on Staten Island. Great service friendly staff and the food is fantastic! The Pork Chops La Strada is to die for. I highly recommend this spot!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dzUtXy1RRRAB",
            "text": "Looked pretty fancy from the outside, and indeed upon entering you encounter a sanitizer station by the big beautiful bar that leads to the main dining room a reservation of tables dressed in white cloths were impressively adorned by clear glasses and shiny silver wear.  I wish that I was told when I made the reservation that you MUST present PROOF of vax in order to sit in the main dining room. I refuse to present anyone access to my personal choice, so we sat in the out door sitting.  The food was indeed generous portions, however my eggplant was cold in the middle. The waiter took off a round of drinks off the tab for that.\nFact, face masks not mandated in this establishment. Recommend delicious food and generous portions!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MU4tajhRRRAB",
            "text": "Absolutely delicious!! It’s all about CONSISTENCY,  and This is definitely NOT a “hit or miss” establishment. The food, drinks and service are SUPERB!! . The Stuffed Artichoke and Pork Chop La Strada are a MUST, and Michael is a Master Mixologist…he makes the absolute BEST cocktails around🍸 I’d give it 10 ⭐️‘S if I could🤗"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpckllZkpREAE",
            "text": "Love this place the food is absolutely amazing and great atmosphere and the staff is was great made you feel like family we will always come back.🍷🇮🇹…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M0x1d1RBEAE",
            "text": "I ordered stuffed artichokes few times to go, loved them! So delicious and flavorful!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKN3NyT1pnEAE",
            "text": "The Best 👍🏻 Since Going  1984 Long time Restaurant still great Food Excellent, Have taken ppl California , Florida .They Couldn’t believe how Awesome good Truly is. I’ve been so many restaurants, Totally Rip off I don’t mind Paying money .…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCakpianp3RRAB",
            "text": "Great food. Good vibes."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJLXN1Z2h3RRAB",
            "text": "We arrived a half hour early for our reservation, but was seated immediately. The appetizers were on point! Very delicious. Unfortunately, we didn't get to our entrees because we waited a long time for it to arrive and decided to pack it up…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeGJuWEJBEAE",
            "text": "We had our daughter's bridal shower at La Strada because we have been there for lunch and dinner and know the food is terrific.  The manager and staff went above and beyond to make sure it was a success.  Of course the food was great, and…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNWRhb0pnEAE",
            "text": "Really not impressed by the service, empty plates sat on our table. It was my 1st time there in 30+ years, you would think that \"new\" customers would be treated warmly. On to the food...bread basket was fresh and varied, olives were…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeWRqT09REAE",
            "text": "I’ve ate here a few times. I’d say my first 3 times were all excellent. Food and service was good. Then I ordered something to go and it was terrible. My chicken was tough. Couldn’t cut it. I took it as ok it was an off day. Then I ate in…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3Z3FhYXdnRRAB",
            "text": "Outstanding Italian Cuisine on Staten island."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlczZxUW1nRRAB",
            "text": "Since moving from Brooklyn several years ago , my wife and I have been to many good restaurants on the Island. La Strada is our favorite. Never disappointed no mater our choice, as with other reviewers, . I am partial to the pork chops la strada - delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURwODVVYhAB",
            "text": "I went with a group of us of nine people, and they were able to accommodate us. Had the most wonderful chicken francese I have ever had. The service was excellent. Can't wait to go back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZOFBDajdnRRAB",
            "text": "Food was delicious.  Drinks were just right.  Our service was great.  Our Server for the evening was Jesus and he was Awesome, checked on us frequently  and made sure everything  and all of us were happy with our drinks and food.  Would definitely come back."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdjlQM3FRRRAB",
            "text": "The food tasted great and the portion size is very good but the desert was a little disappointing.  After such a good meal the chocolate mousse cake was very dry like it wasn't fresh. I'll try something different next time. Overall definitely worth the trip!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRN3NmalZREAE",
            "text": "Went here for a private party, food was not special. Terrible presentation with no flavor. I expected a lot more from this place. Disappointed"
        }
    ],
    "reviews_count": 57
}