{
    "name": "Pho Rainbow",
    "place_id": "ChIJ3z5wClNJwokRLWUeY2xZXrI",
    "grid": "SI2",
    "address": "42 New Dorp Plaza, Staten Island, NY 10306, USA",
    "rating": 4.5,
    "user_ratings_total": 425,
    "phone_number": "(718) 987-1084",
    "reviews": [
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWlNFRXlWVWRuVjA1UGRqQXlhbGN4VURsWE9YYxAB",
            "text": "Great prices, service is top notch. Make sure you dine in to get the fullest authentic experience and best reccomendations."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeFMyeFNiRUpOV0ZWTlZITlRORTVoWkVGMlFsRRAB",
            "text": "The food here is just delicious and very clean place and the services are very nice"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVVdFSlVPVWhmYlZwQ1ZHWjJjRGRPTkVSM2RsRRAB",
            "text": "This place is my go to for pho!\nI absolutely love it, my boyfriend and i always go here wether its summer or winter, we always enjoy their food which is so delicious, and rachel is such an amazing person, always has a positive attitude and is soo friendly.\nWe will continue to come back for more"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sZmJYTnJVRXBGT1ZCdGJHMUVRVWhrVGxnd2JsRRAB",
            "text": "Amazing food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21reE1sbEJkSFI1WmxWMWQxVXhURTFLTUVaaWRrRRAB",
            "text": "A bit Americanized, but still more authentic than many other places. Prices are fair, and the dishes are tasty and full of flavor."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbVdHdERNVEZGUVMxUU9YaFhORW8wTVZRM1puYxAB",
            "text": "“The pork chops pho here are absolutely amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WT1NtSnZiVE5NV1Rab1pGYzBUa3RQUWxSR1FtYxAB",
            "text": "Good service and food. The pho broth is tasty."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSGQwMHpRbE14YTJNdE0zRklTM0JIY0dWeFExRRAB",
            "text": "Highly recommend all grilled Pork and Chicken dishes. Meats are tender and tasty. They also have a lunch special menu if you want to give it a try."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUGFGTnJVVUpOU2s1RExVOWZZVlJJYmt0eGEyYxAB",
            "text": "Such good food!! The waitress was amazing and the sweetest"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUFdEbEpialZGVGxwelVIQTNkVVIyYkZwbmVHYxAB",
            "text": "10 out of 10 ! Some of the highest quality food in Staten Island can be found here.  I ordered beef cube w fried rice today. ( I usually had pork chop with white rice , want to try something new )The beef is tender, juicy and flavorful !! Good service , good food."
        },
        {
            "date": "4달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOYVlWcHpNM3BsY25oYWEyUnliM0l5YTFsaGMzYxAB",
            "text": "岛上最好吃的两家越南店之一，两家店食物都非常好吃，是我喜欢的味道，这家的服务更加亲切周到，要是星期一有开门就更好了，我们也是星期一休息，老碰不上，只能开车去更远的另一家店了，今天星期五刚好July 4 休息就带家人一起来了，还是一样的好吃😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V1FWRldORkp1VFVjeWJsZHJNR1p4VHpJNVVsRRAB",
            "text": "I discovered Pho Rainbow about 5 months ago when I started working in the area, and I've eaten there once or twice a week ever since.  The owner / hostess is kind, knowledgeable, friendly and professional.  The service is excellent and the food is delicious.  The menu is large and can cater to anyone.  The pricing is very reasonable and less expensive than similar restaurants.  I highly recommend eating there."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodlFVVmxaeTFYUkhjeFVFUTRNbGxsU2poMGFVRRAB",
            "text": "This is a true gem 💎 of Staten Island eateries. Located directly adjacent to the New Dorp SIRT train station, Pho Rainbow is a flawless masterpiece. The service is the best on the Island. If you are a regular be prepared to be pampered every visit including free, delicious concoctions as well as staff hidden specialties. You feel like you’re among family every time. Rachel is an incredible human being.\n\nThe Pho offerings are plentiful and can easily be customized to your specifications. The broths are nothing short of therapeutic even on the unlikeliest of sweltering summer days. Any pork dish is as masterful as flavorful. The Banh Mi sandwiches are the best I’ve ever had. The appetizer selections are amazing and prepared to perfection every time without fail. The homemade beverages such as Rainbow Ice with Coconut Milk and Lemon Iced Tea are better than any bottled drinks on the market.\n\nIn closing not enough can possibly be said or expressed as to how incredible this restaurant is or how lucky we are to have this culinary delight in the heart of New Dorp. This is by far one of the best our Island has ever had to offer in my 47 years as a native. Flawless."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FM1FXSnJlbEIzV21kVllUZzBVRk4xU0dKWk1GRRAB",
            "text": "The broth is typically clear and deeply flavorful, without being greasy, noodles are chewy but soft, lots of toppings, savory.  Excellent service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdmQxY3dMWHBhZGpWaWFXbFlWR1V4UWpoTlNFRRAB",
            "text": "Best pork chop rice !!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKamIzNUw4amRudmdBRRAB",
            "text": "Great atmosphere inside clean, cozy, authentic, inexpensive, and large portions"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNN3o1czNRbHVEYmd3RRAB",
            "text": "Recently introduced to Vietnamese food and this place was really good. The grill chicken in curry sauce was excellent, so many flavors. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPUGNxdUR3cHV2QkZ3EAE",
            "text": "Five stars doesn’t even scratch the surface. Handsdown best grilled pork chop in town!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd3N2cUZREAE",
            "text": "This is a long-established restaurant with affordable prices and good taste. You can only know if it is delicious by trying it yourself. The pork chop rice is so so so good and the Vietnamese noodle soup is also delicious. I come here almost every week . Highly recommend！"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvd2JmeDZRRRAB",
            "text": "I come from a Vietnamese background. My family is Vietnamese, from Vietnam, cooked Vietnamese food a lot. I've been to countless Vietnamese restaurants since early 2000s, through new ownerships , of various types (fusion, authentic, Chinese owned, Thai owned). I've been to Vietnam.\n\nI've been going to this place since it opened. Now it is with new Chinese ownership or management. How do I know that ? They greet me in Mandarin.\n\nI can say with conviction that the pho broth here absolutely sucked and is of poor quality with no flavor. The instant pho bowls from Costco has more authentic pho flavor than here. The pho bowls are $12-14(at the time of posting) and isn't badly priced at first. The Pho Dac Biet has minimal amount of tripe and has no tendons.\n\nThe fried spring rolls here are ok, not bad and meaty. Uses an old school rice wrap instead of the wonton wraps.\n\nI wouldn't come here again. And it's sad to see this place go down in (food) quality. Service was fine and had no issue."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvd2ViWmV3EAE",
            "text": "The quality of food goes down throughout the years i visit. I am Vietnamese and this is so very disappointing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaXAyc09REAE",
            "text": "My favorite pho restaurant on the island. The service was exceptional and the pho is flavorful and the portion is very generous. I got their special."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcTV6a1JBEAE",
            "text": "Pho was amazing, the summer rolls and pork chop also amazing. Will come back again!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNGVPMmx3RRAB",
            "text": "I finally found a great Vietnamese restaurant. I went to other Vietnamese restaurants, but Pho Rainbow is the best so far.  Great experience!!!! Congratulations!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJN3FDY1FBEAE",
            "text": "hands down - the best pho on the island"
        },
        {
            "date": "7달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRX2VqWG93RRAB",
            "text": "食物美味、前台小姐姐很热情  值得推荐👍👍👍"
        },
        {
            "date": "8달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnak1mZXlBRRAB",
            "text": "食物很好。环境安静 干净！"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbGJUaU1BEAE",
            "text": "Great food !Came here with kids and they loved it !Service is great no question"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcHVxbWJ3EAE",
            "text": "Always love eating here. The workers are very sweet and always recommend the best foods. The food is very fresh here and tasty. I love the variety of dishes they have. No long waits. Highly highly recommend"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwOXJlbU1REAE",
            "text": "I love noodle soups, especially in the hot weather. This is one of the best spots on the Island for pho."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNTRIek53EAE",
            "text": "Best bahn mi i ever had icl🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYb043QklnEAE",
            "text": "Hidden gem out in Staten Island , very authentic Vietnamese food with a massive menu. Very tasty, fresh ingredients, huge portions and authentic options that you don’t see in run of the mill Vietnamese places downtown! Great prices too would definitely come back here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bm92TjRnRRAB",
            "text": "This Vietnamese pho restaurant is quite good. The broth is rich and flavorful, which really enhances the dish. The meat is tender and well-prepared, making each bowl enjoyable. They also offer a vegetarian option with a vegetable broth that still captures the essence of traditional pho, which is great for those with dietary preferences. Overall, it's a solid choice for pho lovers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NTYzUkJnEAE",
            "text": "Getting very expensive but good food"
        },
        {
            "date": "1년 전",
            "language": "zh",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OU03MmZnEAE",
            "text": "外卖越来越贵\n量越来越少 面条只有以前的三分之二"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6eE02SV9nRRAB",
            "text": "Threw up that night after eating the Banh mi."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNHJUUVNnEAE",
            "text": "No frills, no fuss, pho restaurant. The outdoor awning and curb appeal of this restaurant looks sketchy and, honestly, that’s oftentimes a sign of really good, authentic tasting pho. That was not the case here as the pho could’ve been more flavorful. I’m giving it five stars to support the business but there is room to improve as there is better pho out there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa29UcDdnRRAB",
            "text": "Small but good Vietnamese food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqZ3FTXzVRRRAB",
            "text": "Great tasting food\nGood prices\nEVEN better portions (probably the best on the island) without sacrificing quality\nNot the most amazing atmosphere but by no means bad\nVery friendly service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbktQeG1BRRAB",
            "text": "I have been ordering takeout from pho rainbow since at least 2014 til now and I am happy to say they have been consistent, delicious, and budget friendly. Their staff are always friendly as well. Never disappoints. I should’ve written this review a decade ago but… I forgot until Google reminded me to. Photos are from last night’s order."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcnB6eWtRRRAB",
            "text": "Pho Rainbow has a small and quiet seating area that creates a cozy environment. I went with two friends and had no trouble acquiring a table. The menu was detailed and helped avoid any confusion. Instead of water they start you off with a teapot, which was highly enjoyable. I got a vegetable sandwich and the shrimp fried rice. I found it to be delicious. Unfortunately, the service was lacking even when we were the only people in the restaurant. Our server hardly checked in on us after we ordered and they even forgot my friend’s main dish. Also, we had to wait forever to get our bill. I would go back, but I hope the servers would be more attentive."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNWRHRGV3EAE",
            "text": "The place will not jump out at you when you drive by, but it does have its own charm. Street meter parking available.\n1. Good selection of Pho style food.\n2. Very yummy.\n3. Have noodles and rice dishes for kid taste.\n4.very cozy atmosphere.\n5. Highchair available for families with small children.\n6. Price is very reasonable.\n7. One more thing. Bridge your appetite since the portion size is generous for the very reasonable $."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4d2ZyY3VBRRAB",
            "text": "Quaint place not overcrowded, truly a hidden gem. The service was excellent, the staff was courteous, and the food was fantastic. Very clean, and simplistic, yet elegantly displayed. I will certainly be coming back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2azZYN2tRRRAB",
            "text": "Went last minute with my boyfriend after another Pho spot ended up being closed and I’m so glad we went :) The mango bubble tea was so amazing and the food did not disappoint! So glad we came to this place and we will be definitely coming back!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcWNMdGNnEAE",
            "text": "Ate here for dinner the other day and the food was absolutely delicious. I ordered the Summer Roll and the Shrimp Pho along with a Mango Bubble Tea. My Mom ordered a pork chop vermicelli bowl and a strawberry boba tea. Everything we ordered was delicious and cooked to perfection. The service was a little slow but the staff were extremely friendly. Would definitely return again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbnNXU0FnEAE",
            "text": "This viet place is one of the better ones I’ve had in a long time! The pho was delicious and that pork chop was full of flavor! The prices are also very decent. Definitely a good place to stop by for lunch or dinner on the island!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnZ3JDUXRnRRAB",
            "text": "The soup base for the pho was rather bland.\nThe pork chop that came with the pho was rather oily and fat.\nThe summer roll sauce was chunky.\nThe spring rolls had a strong flavor of peanut."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNFlMUUhBEAE",
            "text": "One of my favorite vietnamese restaurant here. If you’re looking for good traditional pho broth this is the place for you. Also my second all time order here is Beef Banh Mi ,it is amazing if you never tried it from here you should definitely give it a try!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRanVIbk1nEAE",
            "text": "Love this place. Been coming here almost 7 years now and always have a pleasant experience. Food is delicious and prices are great! I always get #12 on the pho menu. It's my favorite 😄"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRd2Y2QnZRRRAB",
            "text": "The food is amazing. Staff is friendly. Super cheap and filling!"
        },
        {
            "date": "6년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNVpuQ09REAE",
            "text": "Accogliente,pulito,celere nel servizio,cordiali ed educatissimi,la  signora penso sia la propietaria  una donna bellissima ed affascinante dal sorriso carismatico,un consiglio! I gamberetti piccoli vanno sgusciati,sarebbe perfetto. Per il resto eccezionale direi rapporto qualità prezzo eccellente."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcjd2eXV3RRAB",
            "text": "2017 open abt 1 year...close on monday.....1 of the 2 vietnam in the island....their rice menu is better than noodle menu"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4ODlhTmNnEAE",
            "text": "Always loved this spot, service always great and on point\nFood is awesome and price is still great post-pandemic👍👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaHVYYmd3RRAB",
            "text": "Went here with a friend and wow!! Some of the best soup I've had in a long time. I got the vegetable pho and the flavor from the broth soaked into the vegetables and tofu perfectly without making them soggy. Everything tasted really fresh, the restaurant was nice and clean, and the staff was great. Can't wait to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaenF6M193RRAB",
            "text": "Best grilled pork sandwiches I've ever had. Service was perfect. Attendants are very kind and helpful. Food was very good. I can't wait to go again. Gives an authentic Korean atmosphere with the dining experience with soothing Korean songs playing gently in the background."
        }
    ],
    "reviews_count": 55
}