{
    "name": "Ariellas Restaurant",
    "place_id": "ChIJ0b4ayA5JwokRbZmLk07vS9s",
    "grid": "SI2",
    "address": "710 New Dorp Ln, Staten Island, NY 10306, USA",
    "rating": 4.9,
    "user_ratings_total": 122,
    "phone_number": "(917) 830-0230",
    "reviews": [
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twR1QwRnNOV3RUTjFSc05uSllaVVUzTUhvek1HYxAB",
            "text": "Fabulous food and service. Place is spotless. Seating is very uncomfortable"
        },
        {
            "date": "수정일: 4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMmVyY1hREAE",
            "text": "Lovely atmosphere.  Wonderful for a date night.  Staff is friendly and attentive.  Everything was delicious.  Creative and unique cocktails you won't find anywhere else."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVVRrcE1MWE5uWTJKNFJqbHlPRFZtUjJFNVRsRRAB",
            "text": "Nice ambience, food was delicious had skirt steak mac n cheese and Brussels. Drinks were very good as well! Will definitely be back!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRd2JXOVJjVGhsVTNOV2MzZFdOM0J6VGkxa1ZrRRAB",
            "text": "I've been to this place a handful of times, each time trying something different and so far, they have never disappointed. The service is great (look for Brittany), you can tell the owner cares, the food is good, and it's a nice date spot.\n\nI liked the skirt steak with their chimichurri (it's awesome) and the Ariella's Pasta.\n\nTotally worth a try. It's a small place so depending on the night, maybe call ahead."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWmFYbE1jbFpNTTBRd1UwWnVibXN0WmtoU2JHYxAB",
            "text": "First time here and we will be back. Came here for a date night and the service was amazing! The food was really good and I cannot say enough about the drinks! We will be back, this is a great place you will not be disappointed"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRFFtcGtVVGRCUWtsb1dYaHNjMU5UYW1admNHYxAB",
            "text": "What a wonderful restaurant!  Great menu—plenty of variety and great selection for everyone in our group.\nThe food was excellent!\nThe owner Billy was so accommodating and so welcoming!  It’s great to find a neighborhood place with great food and an owner we would be happy to support!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMmNVUk1SbEpDZG14MVgyaENjVmMxY1RkVFFsRRAB",
            "text": "My husband tried Arielle’s for the first time today and loved it.  I’m always happy when I suggest a place to eat that he likes.  They have a lot of different items that you do not find in a lot of small restaurants (i.e., buffalo chicken dip, hot honey chicken, fried lobster fried toast, .lobster po boy, etc.  All excellent."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMWNsbDBWSFpwUldwaFRUTkVNelIxVTNrMlVHYxAB",
            "text": "Nice vibe but need to change chef , food cold and bad"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSVVVRnZlR3BYYjFWcVkwRkdWMEZ2VEdWTVdWRRAB",
            "text": "Everything was excellent. Food, decor and service. I only can name two things that can be improved on. Lava cake was a bit dry and credit card extra charge can be mentioned in the menu. All and all great place I will definitely come back to and will recommend to others."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gd2FWZHFOMFpTWnpjeGJHeEZXbVYwWmxaVlVGRRAB",
            "text": "Went here today for lunch  for the first time and all I can say is wow I will definitely be back was definitely not disappointed. My girlfriend and I were simply amazed on how delicious the food and drinks were. This will definitely be our weekly go to spot for lunch."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWlFXSTNTWEpNYzB0MldEaGhMVEJpUm1FMVMzYxAB",
            "text": "We loved everything about it! It's decorated very nicely and has great service. Great menu and excellent food. We ordered the surf and turf which was delicious and a good value. They also have an excellent brunch. We will definitely be back!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdmEwbzBPRzFZVUZsYU1UWm1PV00zT0RjMldXYxAB",
            "text": "Great food and service. The fish and chips was amazing. Perfectly prepared.Generous portions. Relaxed atmosphere and very clean interior."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dmJEUlpPRzE1Y0ROWmNXa3RiRTFhUW1WM1ozYxAB",
            "text": "Everything was great!! Food was really good and would suggest to the next person"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKalMzbFFaM0ZFY0RSdlZVaEdOa3BSZEhSRlMyYxAB",
            "text": "Really enjoyed the fish & chips, the chimichurri sauce wasn't really to my taste but no points off for that since the skirt steak was cooked to temp and the sides were excellent (got garlic green beans and mac & cheese).  Excellent well-crafted cocktails.  Service was great, friendly and efficient but not rushed,  Prices very fair, portions generous.  Highly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUFIzSlNPVXMyVTJRdFpFWmpOSEZIZW5jeU9WRRAB",
            "text": "It was a great time! Our server Richie was wonderful. My friends and I enjoyed brunch, the drinks were perfect and the food delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdVNFUlBiVVUxT0dWRGFIVlRkM05wVEVVeFFuYxAB",
            "text": "We went to Ariella’s this evening for dinner. There were four of us, and we all ordered different meals. The food was excellent, no complaints. The Pasta Ariella was especially delicious. The servings were plentiful. Three of us took home doggie bags. The atmosphere only got three stars because of the noise. If you don’t mind it a bit noisy, it’s okay, but you have to speak louder to be heard."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GdFMxVTVNbWh4TkhsUVdYUmhOV1JFTkhkbFdHYxAB",
            "text": "First time here. Steak sandwich and lobster BLT were delish?  Sangria was good too although I would have liked a larger serving.  I’ll be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeFozbEhVbmhJYld0Rk5WZHNTVWR0WlVzNVZtYxAB",
            "text": "Wonderful experience, cozy , friendly staff, and the food was incredible , specialty and after dinner drinks were great\n1st time there , found it after a vet visit next door last night\nWill be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQ1lsSTRRaTFzVURZNGVXTkpTbEpmYkUxaVRXYxAB",
            "text": "First time here. The place is so cute inside. We had drinks, appetizers and sandwiches. Everything was delicious. Our hostess/waitress/server was awesome. Will definitely recommend and come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sb01WQnRTbXhDVVhWeWNtNU1WMGhGT1hFNFVFRRAB",
            "text": "This place is awesome. I had the fish and chips. Wow. Nice and flaky and crispy. Good portion too. Enough to bring some home. The egg rolls were very good too. Order the Mema Old Fashion. Won’t be disappointed\nBrittany was wonderful. Helpful when asked advice about which entree to order. Such a sweetheart!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaVlXSnJZVVV0VmtSUFJHNTJaVzlyTTFsR2VIYxAB",
            "text": "I took my wife, Ariella, here for her birthday. The food was very good. The service was prompt and friendly.\nThank you for a wonderful evening."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaGRsUTRWM2RmU0ZVME1XWk1aV1ZIUW5Kd1oyYxAB",
            "text": "Ariella’s Restaurant on New Dorp Lane does NOT DISAPPOINT!! Brunch, lunch or dinner - the menu is so unique and everything I had here was delicious! My personal favorites from the brunch menu are Bacon Egg and Cheese Eggrolls, French Toast Sticks, and Belgium Smash Sliders. Favs from the Lunch/Dinner menu - Chopped Cheese Eggrolls and the Skirt Steak Sandwich!! Besides the food being absolutely delicious, the service is top notch and the prices can’t be beat. Almost forgot to mention the drinks - Tirami-tini, Jelly Roll, Toasted Almond - pure heaven!!! (Disclaimer: I do not have any relation to this restaurant, I was just really impressed with it) 😘"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNFdrbE9Tak5EZERsT2RsWTNlV3hvVUVwRlZsRRAB",
            "text": "Best fish and chips I have ever had and also the Mac and cheese side is also to die for."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOS1l6azBXR3BJWTFVeGEwWlNlRlp6WnpoQk9WRRAB",
            "text": "The food here is absolutely delicious and beautifully presented, it truly looks like a piece of art!  The atmosphere is warm and inviting, and our server was outstanding—friendly, attentive, and made the whole experience even better. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSFV6RjVOR04zWDJjM2QxcHFia2wwYVZoT1RtYxAB",
            "text": "We had a really great meal here tonight - maple glazed salmon was cooked perfectly not dry at all, very flavorful.  The sides were on point also roasted potatoes and broccoli -were perfectly seasoned.  Also had the burger with burrata - delicious and perfectly cooked with the best sweet potatoes fries.  And lastly had the lobster BLT very good, with a side of Brussels sprouts that were perfectly crispy, slightly sweet and tender on inside very amazing.  My aunts had the Painkiller cocktail\nThey loved it. The tiramisu was excellent well.  Service was just as good as the meal, very attentive and extra kind to my elderly aunt.  I don’t prefer to go out to eat anymore. I feel like we spend ridiculous amounts of money for mediocre food and this meal was the exact opposite.  The food and drinks here are really very reasonably priced - I was pleasantly surprised - and the food is excellent.  It was pretty packed tonight and we still had great service.  I didn’t take pictures. We were too busy talking to each other and having a great time ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cb2JHNUVVakJPYWxrNVRFbDJUV1Y1ZWtKWVJVRRAB",
            "text": "First time eating here. Came here for brunch and the food was outstanding. Hangover Poutine fries were fantastic. French toast smash burger is a must have. So many great options. Service could not have been friendlier or more attentive. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RmVWZHBhM2t6UVRnM2IwTXpXRGROWjNFMFYwRRAB",
            "text": "Excellent, friendly service, great food and awesome drink specials. Came for Saturday brunch- Hangover Poutine Fries best fries I’ve ever had! Steak and Eggs sandwich was delicious! Dinner menu looks fantastic as well. Gotta check this place out!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weWIxQjZja2xsTURjeGJscHlTakpoWW1SMlVVRRAB",
            "text": "My server was amazing. Very courteous, welcoming and friendly.\nLove the atmosphere and decor of the restaurant.\nThe food was absolutely delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbVFrTmFabHBxU21SVGNGSk9hbVJSVGpVeVFrRRAB",
            "text": "The food at brunch was excellent! My fiancée and I had the Shrimp & Grits and Poutine, and our server, Richie, provided us with attentive, speedy and professional service! Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOM1NIZG9NV1IxVUVWUVNXb3dNRTB4UjA5SGFrRRAB",
            "text": "Accommodating and friendly staff.  Clean bathrooms."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaFExWXdUa2MzYnpWM2NsQlpkRWxPWlZGSVdFRRAB",
            "text": "My husband and I have been to Ariellas many times and have never been disappointed. We enjoy the welcoming atmosphere, food, and creative drinks. The owner is very attentive to his customers' needs, and the staff is wonderful. Give them a try. You will leave with a full belly and a smile."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oS1JrbFVia3RSVnpkV1YyNTRWMDVXTTJoR1IyYxAB",
            "text": "Billy and Brittany were amazing , will definitely be sharing with family and friends. My experience was amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toemFXZEZXR2s0VjJGMGJrNURhVlp3UTA0MFVVRRAB",
            "text": "Came with a sizable group so naturally we were a little loud but the owner Billy was nothing but welcoming to us & treated us amazing. The food was mouthwatering, I had the Cajun chicken & shrimp pasta. The drinks were also very creative & tasting. All & all no complaints, had a great time !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKa2VYWnFaMjVDTlRKTmJFRjNVa2hwWW5SUlJsRRAB",
            "text": "Billy was great first time here very attentive very fun and interactive and kept the professionalism and made everyone comfortable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sb1RsVm1XWHBrUWpablYwVlZVbnBhZHpCd09GRRAB",
            "text": "Nice restaurant with upscale bar food and phenomenal drinks. Really great place to go on a Saturday evening. They take reservations but we came in with no wait."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMVJIVklja1Z6T1RCdk9WSllOVFZKYlZwM2VGRRAB",
            "text": "I work at the hospital. We order food from here weekly and never a disappointment the owner Billy always goes above and beyond to make sure everything is perfection. And it is… so happy this place is here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONFNEZ3lOa0ZJVWs1TGJtSkhlSEJNTFVrME1YYxAB",
            "text": "Staten Island’s best kept secret! The food, the atmosphere, the service, drinks and owner are 10/10!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRmVHNXRRbWhNT1VOSlkxZDBTemRHVm1KeU9IYxAB",
            "text": "First time at this cute little spot and we weren’t disappointed. Decor is nice and the atmosphere was pretty. We ordered fried calamari and the buffalo chicken dip, which were both delicious. I ordered the skirt steak, a littttle chewy but the flavor was great. All the other entrees which were ordered was the fish and chips, the Cajun pasta and the maple salmon. Everything was great. Will definitely return !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210V1FWUXRjM3BvYTFCWVdIUk1jREpWTmtoWlZWRRAB",
            "text": "Food is always delicious and the red sangria is on point .. the owner and staff are super friendly .. love it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRGNWQlhSMlpaWVVkTlJEbFFXR2xCT0hKNWRIYxAB",
            "text": "Everything was excellent. Hangar steak, pork chops...but the appetizers was unique and wonderful! 3 varieties of egg roll - we had the pulled chicken, vodka chicken, and  crab meat. Wonderful service as well!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcGREVTFTbGh3YWtGNGJsVnRNM2hYZFVreGEyYxAB",
            "text": "My recent visit to Ariella's Restaurant was a fantastic experience, and I highly recommended! Located across from Miller Field on Staten Island, it is a great spot for any occasion. The restaurant has a delightful ambiance; it is inviting with a trendy vibe.\nThe Apple Crusted Pork Chops with raspberry drizzle were delicious! The maple bourbon salmon was cooked to perfection and had a wonderful blend of flavors. The penne vodka kids meal was also a hit. All kids meals are served with a side of fries. My kids ate every bite.\nThe service and genuine care from the owner, Billy, set Ariella's apart. He ensured everything was perfect, making us feel welcomed and valued. The attentiveness and desire to provide a positive dining experience were evident and greatly appreciated.\nOverall, Ariella's offers excellent food in a charming atmosphere. It is a true gem on Staten Island."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKR0RwWlNEcElTd0RREAE",
            "text": "We celebrated my FILs bday, the food was good. Nice big portions with great food flavor. Prices for the food were also good. Our only thing was the service to get drinks took a long time so we didn’t get a chance to have more than one or try other drinks. Would love to come back and see if we could try some of their other cocktails."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aU1gxRklkMnhSVUVwQldGWXhlWFpHUmtGR1NXYxAB",
            "text": "I came here for a birthday brunch in honor of my friend. We had such a great time! The food is amazing. Everything is made fresh and amazing quality. We will definitely be back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQOUp6TmRnEAE",
            "text": "I recently dined at Ariella's Restaurant\nAnd it was outstanding! The ambiance set the perfect tone for a delightful evening. The decor is charming and inviting, making it an ideal spot for any occasion.\n\nThe food was absolutely delicious! I was impressed by the variety on the menu, catering to all tastes and preferences. I got the salmon, my friend got the steak everything was cooked to perfection, all the sides were excellent, and the bacon ice cream was phenomenal.\n\nThe service was exceptional as well. The staff was attentive, friendly, and genuinely seemed to care about ensuring we had a wonderful experience. They were knowledgeable about the menu and offered great recommendations. What stood out the most was the affordability of the prices. Given the high quality of the food and service, I expected to pay much more. It's refreshing to find such a gem that doesn’t break the bank!\n\nI highly recommend Ariella's Restaurant to anyone looking for a pleasant dining experience filled with delicious food, great service, and a lovely atmosphere. I can't wait to return!\n\nTry it, you will not be disappointed!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbHFyS1JREAE",
            "text": "Update Review: May 4, 2025 - Ariella's restaurant is what I hope every other restaurant would strive to become; after hearing about our imperfect experience, they took our criticism to heart and drastically improved everything we critiqued. This time around, the buffalo chicken dip was juicy and tender, which is evident in the picture! It's the perfect appetizer that I can imagine eating while watching the Super Bowl; it was flavorful, tender, creamy, and the amount of shredded chicken was plentiful. The coffee-rubbed ribeye was cooked perfectly medium rare this time, and paired with their soy glazed Brussel sprouts was the definition of perfection. This experience is what I always knew Ariella's restaurant is capable of, ever since our first time dining with them. Not only did they surpass our expectations, but they also respected our voice and took the steps to perfect their minor imperfections, exemplary of what exquisite dining looks like. We look forward to coming back to try the many more new additions to their ever evolving menu! Definitely give them a try and I promise you won't regret it! (Please consider adding the Lolipop lamb chops to the regular menu!)\n\nThank you for reading and best of luck! (:\n\nOlder review: The loli-pop lamb chops were by far the best dish we had at Ariella; the soy brussel sprouts were so incredibly rich and flavorful that it was the best brussel sprouts we ever had! The lamb chops were also plentiful, delicious, and cooked perfectly medium rare! The chicken vodka parm was also very tasty and creamy, a perfect balance! I definitely recommend trying them and I hope Ariella will consider putting both on their regular menu since these were from the Easter Dinner menu.\n(:\n\nOlder Review: January 2025 - A great new addition to Staten Island. The zucchini fries were delicious but the breading fell apart quite easily, which should be an easy fix! The steak was delicious and cooked perfectly, which we highly recommend! The burger was incredibly rich which can be nauseating for some due to how sweet and heavy it is. Our least favorite were the corn casserole appetizer and the grit which was a bit on the blander side of things. Overall it was a good experience and would definitely come back to see how much they improve since when we went they were just opened for less than a week. Can't wait to give Ariella the 5* I know they are capable of!\n\nThank you for reading and best of luck! (:"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmamNuVlBnEAE",
            "text": "Staten Island hidden gem!\nThis restaurant has opened nearby, so we decided to try it during the holiday. The environment is quite nice. Although the restaurant isn’t very big (which I personally prefer), the service was excellent. The staff were very friendly and even chatted and interacted with my kids. The food quality was good — I’d say above average. The price is very reasonable. Definitely worth recommending!\n\nAriella’s restaurant\n710 New Dorp Lane, Staten Island, NY 10306"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WS2NVeEhXbWRXVkRWVlJWY3djbmhvU1Rsb2VrRRAB",
            "text": "Had a baby sprinkle here and the food was phenomenal !! Billy  is so accommodating. The place is perfect for a small party. Very cosy and the food is top notch !! Richie and Brittany were so sweet answering all of our needs. Love love this place highly recommended  to anyone looking for a place to host a party"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNU1QSHdnRRAB",
            "text": "Last night I had the pleasure of dining at Ariella’s, and I can honestly say it was an unforgettable experience from start to finish. The moment we walked in, we were greeted with warm smiles and an inviting atmosphere that set the tone for the evening.\n\nThe service was nothing short of exceptional. Our server was attentive without being intrusive, always checking in to ensure we had everything we needed.\n\nNow, let’s talk about the food! Every dish we ordered was a masterpiece. From the appetizers to the desserts, each bite was bursting with flavor and creativity. I highly recommend trying the salmon & the skirt steak! Dessert was unmatched.. the bacon maple icecream- no words! Outrageous!\n\nThe drink menu was equally impressive. We tried a few cocktails, and each one was expertly crafted, balancing flavors perfectly. It’s clear that the bar team knows their craft and is passionate about providing an outstanding beverage experience.\n\nThe ambiance of the restaurant added to the overall experience. The decor was stylish yet comfortable, creating a perfect setting for both a casual dinner or a special celebration.\n\nOverall 10/10! Excellent service, delicious food, and delightful drinks come together to create an extraordinary dining experience. Whether you're a local or just passing through, do yourself a favor and pay a visit—you won’t be disappointed! I can’t wait to go back and try more of the incredible offerings. Bravo to Billy, Chef J Ron and the entire team for a job exceptionally well done!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaUppYnVRRRAB",
            "text": "Ariella's Restaurant offers an exceptional dining experience with excellent food and attentive service. The ambiance is inviting and pleasant, making it the perfect spot for a memorable meal. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOb1VEQm9MVkV5VUhvNVUxOHhjbTB3UzIxNWNYYxAB",
            "text": "Great place! Great service!\nFood/brunch menu was delicious! 😋\nLoved the ambiance.\nWe happen to be there for sing a long.\nSo much fun!\nOops! Forgot to take pics of food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMmVsOVdUbE14WDNWNWFIZEtPWGhrU0VaU1lXYxAB",
            "text": "Went for a brunch for a party of 6 and we all loved the food and drinks!  Everything I had was so flavorful and our server was wonderul in attending to us. Super friendly.  The cocktail and dessert variety options look so good! We definitely will come back to try the rest.  So glad to have found this gem in a quiet neighborhood"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdmVVOTRlR2h4VUdVeGRGVkhXVWRmYkRnMVdsRRAB",
            "text": "I went to Ariellas restaurant for brunch on a Saturday afternoon and the food was simply outstanding! The biscuits and gravy dish is dangerously comforting. Coffee was great. I also have the Belgian Waffle Sliders with fries. Everything was cooked to perfection. Highly recommend!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdHZyVXBnRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\n\nAriella’s Restaurant is an incredible new addition to the New Dorp area! From the moment you walk in, you’re embraced by the warmth of family tradition. The atmosphere is inviting, and the decor, adorned with butterflies, beautifully honors the owner's mother and her fight against lupus. There are also some random and fun artsy statues, photos, and additions throughout.\n\nThe food here is nothing short of flavorful. Each dish bursts with taste, showcasing a perfect blend of family culinary wisdom. Don't miss out on the fun cocktails—they're as delightful as they are unique!\n\nThe staff are exceptionally friendly, making you feel right at home while providing attentive service. And if you have a sweet tooth, the desserts are a must-try, crafted using cherished family recipes that add a special touch to your dining experience.\n\nOverall, Ariella’s is a hidden gem that I can’t recommend enough!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkZkxWRmlTRXRDTldGeE1qVjJTVzFIVEZKUmFFRRAB",
            "text": "I came for brunch this Saturday with my friends. Everything was excellent! We had the bacon egg and cheese egg rolls for the appetizer, and I had the hot honey chicken sliders as my main. The hot honey sauce was amazing, and the bacon on it goes perfectly. I highly recommend Ariella’s for brunch, lunch, or dinner anytime!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKeFFpMU9ObWR5UkZoTWVuVnJhMjAzZVdoZmFYYxAB",
            "text": "Lovely cozy place. The food was good . The service was excellent. The owner Billy was very accommodating and easy to work with. I had my Son’s 40 surprise party there and everything was wonderful. All my guests had a great time and loved this place. Thank you again Billy and Staff   !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tac1ptVXRlVE00VDBnd2JGZFVVWFJDUVd4b2QxRRAB",
            "text": "Great little spot on New Dorp Lane by Miller Field. The staff is amazing!! Very friendly and attentive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSlJHOXNhbE52TTJFeFZ6aENjVzl0YjNWek4wRRAB",
            "text": "Went to Ariella’s and I ordered wings which were delicious.  My husband ordered the strip steak which was cooked to perfection.  The drinks were way better than the drinks I have had in other restaurants.  Definitely will be back and highly recommend this restaurant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aE5qc0J3EAE",
            "text": "Former Fig and Vine spot - so small space but cozy. Really great apps, and entrees, desserts and drinks were definitely on point. Great Staten Island addition."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2a28yZlRREAE",
            "text": "It was a very cold & windy day.  We were on the way to another bar, when we stumbled up on Arielle’s.  As usual my curiosity made me walk into an unfamiliar place, and I was very surprised by the warmth & smiles my husband & I were met with.  We found out that the owners were having pre-opening food tasting & we were invited in to taste food with everyone else inside.\nNo lies: the meat dishes that we were offered were the tastiest we ever tried.\n\nA month later, when the restaurant was already fully opened we went there again and again we were not disappointed by food or drinks.\n\nLadies & Gentlemen let’s help this brand new Staten Island location thrive.\nBecause they really deserve being supported - it is really difficult to find someone who cares so much about what they serve to people.\n\nThe picture that I’m posting is not how this dish was presented to me :) i stole my husband’s French fries, because they were just way too yummy 😋"
        }
    ],
    "reviews_count": 59
}