{
    "name": "The Stone House at Clove Lakes",
    "place_id": "ChIJme4PuWNOwokR9h6JDoqmSFA",
    "grid": "SI2",
    "address": "1150 Clove Rd, Staten Island, NY 10301, USA",
    "rating": 4.4,
    "user_ratings_total": 1272,
    "phone_number": "(718) 442-3600",
    "reviews": [
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhbXIyenVnRRAB",
            "text": "We used to love this place, but things changed.Used to be one of the best burgers on Staten Island, 3 visits, and they were absolutely lousy. Drinks are extremely weak, a straight up drinks are so short it’s ridiculous. We might be done with this place, even though it’s a beautiful restaurant with a fabulous atmosphere. Very sad to see it go down hill."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205alNrdFVkVzVIY2tsU1FtcG9Ua1JJT0c1elduYxAB",
            "text": "Warm, welcoming, and inviting with a wonderful ambiance. Sitting by the fireplace gave cozy cabin vibes. The lobster tail was incredibly tender and flavorful, and the vodka sauce was perfectly made."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUU9WaFpTVk5DUVRaRk5WSlNkRko1VEhsTWNHYxAB",
            "text": "I’ve come to stone house for a few times - when it’s catered it’s great, ala carte is full of mishaps. Every time food is ordered something’s messed up or mixed up or not delivered-  The prices are also INSANE and not justifiable whatsoever like $14 for a side of fries ? Insane. It’s aesthetically pleasing but insane prices for just OK food and service- a wedge salad with some lettuce dressing and few pieces that my protein was forgotten $19 -22 for a salad ?"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oZllXTlFibmx1TWpoaFYyMW9lamxPZURadWRsRRAB",
            "text": "I had the pleasure of having my daughter’s bridal shower at this amazing venue. It was a year in the making and started with Nadia Beck. Nadia could not be more accommodating to my every need from when we 1st visited to booking and then finalizing the week before. Pedro was our main waiter on this very special day and tended to our every need. He made sure I knew each step and when each course was ready to be served. We encountered an unseasonable hot day in Oct and he made sure our guests were comfortable by turning on the fans and lowering the shades when we needed to block the hot sun. The food was exceptionally good and service was impeccable. It’s been about 2 weeks since the shower and I am still getting calls & texts on what a wonderful party it was. Thank you to the amazing staff at The Stone House. Please consider this beautiful spot for your next party and even for your weekly dinners, lunches or the amazing brunch that they have on The Weekend\nYou will not be disappointed. Thank you\nRosanne Alaimo"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGelpXaDJiWEJxWkdsT1EzQTFSVk5aV1c5MmRWRRAB",
            "text": "Beautiful restaurant with a cozy atmosphere. Took my father here for his birthday, and everyone was pleased with their meal. The small plates were absolutely delicious!! The espresso martini is a unique touch to dinner! Ramon, our waiter, was very attentive, and the staff was on point. Thanks again!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRWRFOHpjSE5NWkhONllVcEthRTFJWkVOUWRHYxAB",
            "text": "Special occasions or just a great dinner experience this is your place. And the setting is amazing"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNU5tMHpTME4yV0RneldEVnJiRmd4TkVaRmNsRRAB",
            "text": "Beautiful wedding venue!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNlVWZG5NM1JNUTNNd04yaEtjVlUzT0ZCblpFRRAB",
            "text": "Me and my wife have been coming here for 2 years. We literally love the aesthetics of this place. The manager, the staff. Everything about this place is amazing. I highly recommend this place for date night."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNWQwTk9Tbmc0U1V0clpISmFXamxLY2pWbU4yYxAB",
            "text": "You would not believe how tight the seating was for a wedding here. Absolutely, not even kidding, the WORST wedding I have ever been too. You could not move your elbows and you needed to keep your hands in front of you between your legs so you did not bump the person next to you! No that’s not an exaggeration. So disappointing and would NEVER recommend this place.\n\nAdd in the fact the tables were set up in a rectangle fashion with around 20 people per side so half of every table has their backs to bride and groom and dance floor… with NO space to move in between the tables. It was horrible.\n\nIt is up to the venue to tell the bride and groom what works with the space they have…. This was obviously not done and the bride and groom were not aware how tight and uncomfortable everyone would be.\n\nOpen on one side, overlooking the water, it was muggy and warm with NO airflow whatsoever. No air conditioning units! They tried to put out fans but there was absolutely no room to do so and they placed one directly next to a couple! About 5 minutes later, it was removed after the couple said they were not having it….You cannot ask for a worse set up and it’s too bad the bride/groom had to pay as much as they did for this set up."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSlp6RnZNV1pXYlY5ZmFUSnFWWEpaY0RGUVVsRRAB",
            "text": "Went there for a wedding. Food was excellent. Great ambiance."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRWF6bGlWVzFHYm5sM2VYUkdSMjlZVmpKTFRuYxAB",
            "text": "When your 14-year-old asks for a Picture Perfect and “ yammy “ birthday spot… the pressure is real 😅 After lots of searching (and a few sleepless nights), we landed on The Stone House.\n\nAnd wow, it’s just as magical in real life as it looks in the pics and  the food was absolutely delicious, the drinks were on point ( old-fashioned table serve must have) , and the service was just amazing….\nHighly recommend trying the fresh oysters, pork chop, burrata, seared tuna and seabass—they were incredible!✨ We’ll definitely be back to explore more of the menu ( have my eye set on halibut;).."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUVYyUk9kVWxpWVdJeVYyVnVUSGRITm01ZmFtYxAB",
            "text": "This restaurant is a neighborhood Gem!!! Delicious food, excellent cocktails, great service and friendly staff! I highly recommend it and I drove from Long Island."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SlNscEhXbTVxUlRsV2NYVnRlV1JFVVhkT1pHYxAB",
            "text": "Was there recently...everything was great.  Spent over $1000  and they charged me $18 dollars for a small loaf of bread split into 2 baskets...  you would think they would of given that on the arm...for that reason I will never go back"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMmEwRlpZemhXU2psSVNqaElSRlYzY3psek5GRRAB",
            "text": "Excellent lugar para ir en pareja"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdGRsTjZNM3BzVmpRdFVXTk9hV2t4V1RFM1RXYxAB",
            "text": "J.D. AND SARAH HAD A BEAUTIFUL CEREMONY TO MAKE SURE WE ALL KNEW LOVE IS STILL A THING IN THIS WORLD\nGOOD FOOD AND GOOD PEOPLE ALWAYS MAKE A NIGHT GREAT!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUGF6QkJPWGhmWVVsc1JFNHdZemR6VjBOSFVYYxAB",
            "text": "Extremely pleasantly surprised. Although I will be having a function here I've never eaten here the food was absolutely delicious. Someone told me their portions were super small absolutely absolutely not huge portions the food was so delicious went for their lunch menu so reasonable so reasonable A full glass of wine a soda on the side The lunch itself and a coffee withoutbtip not even $46. Most of their lunch specials are $21 you cannot be that the view is amazing The staff are very nice.  The only thing I had trouble with was their bathrooms in the back extremely extremely small and I alerted one of the ladies that the lock has to be dealt with and the sink very hard to get your hands under the sink because of how the spout is located but there is one more bathroom on the other side to which I didn't know about.  All in all a beautiful beautiful experience. Can't wait to go there for my function."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMk5VTmpaRTlDY1hvNU9EaFBjRTlpY1hSeVFsRRAB",
            "text": "The place is fantastic and romantic as you can wish\nThe service is poor due to lack of English speaking waiters\nThe food is really bad considering the price you pay"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseFZGZExlVkZNTlVReGJIWTRNM0ZpWkVsS05uYxAB",
            "text": "very fancy, love the atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prd1QxbFdURmRaT0VWSVZHbGFObWRoVTBZek9YYxAB",
            "text": "Beautiful setting.  Great food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRFREZDZUV1ZKTVROMVFtUnJYMWhPTkd4Rk5XYxAB",
            "text": "⭐⭐⭐⭐⭐\nI had a wonderful experience at The Stone House! The food was absolutely delicious — my burger was perfectly cooked and juicy. My server, Pedro, was attentive, kind, and always there when I needed anything. He made the dining experience even better with his sweet and friendly personality. The ambience was warm and inviting, making it a perfect place to relax and enjoy a meal. No complaints at all — great service, great food, and I would definitely recommend The Stone House to anyone!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSlZtVlVhbVpIWlU5eGRFWnNTbWRpV0RJeVFtYxAB",
            "text": "Great place for an event !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeloydFFSakZ2WjE5T1kybzFUV1puVFdNM2EyYxAB",
            "text": "I loved the Stone House. They did a really nice renovation. It's very cozy and warm. I was there celebrating my anniversary and it felt romantic. The food was amazing! I wasn't a big fan of my server ( Carlos). He wasn't very friendly and didn't check on us much. I had to ask the bus boys for small things and they were helpful. Other than that we had a great time I really enjoyed the man singing at the bar area. He was a great singer and so sweet. I'll definitely be coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oc2RtWnJiR3N6UWpKSVRVazRjMGhKV1U1ZlMzYxAB",
            "text": "Overall 5 stars"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNFgwbG9SRzR0VTNCeGFHVjZTM1ExYjFGR1oyYxAB",
            "text": "One of my favorite places on the island. Rarely ever seen it busy so there’s never a wait for a table, the atmosphere is cozy and cute and the strawberry peach Bellini is delish 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMk4zZGxiMVJHTmxWR1YwNTZOM1JqVVV4d2FIYxAB",
            "text": "the pure fact of been in the  park is beautiful ,the service and food are excellent. no matter the occasion is worth it you must try"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMU5YbDJiVEpxTFhCQ09YSTJNRUkxYWxGbFQzYxAB",
            "text": "Beautiful place, amazing atmosphere,,delicious food, music.\nHighly recommend ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaFNIVlFkak5PYUZCRFgwUTRZM2RCT0hSRlFYYxAB",
            "text": "Food was good  and the views was amazing. The service  was ok the staff was moving  things around tables and not really paying attention  to the customers  but over all it was a good experience  the ambiance was amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMFpVMXZha1ZFUTBSamIxZG9ORWxzT1ZOM2VXYxAB",
            "text": "A 5 star experience!! The food is delicious, lots of variety - seafood, steaks, veggies, fish! The best dish here, hands-down, was the truffle mashed potatoes!!! Absolutely divine! 😍\nThe service was excellent- our server was great, very friendly and attentive but not lurking. And you cannot beat the atmosphere-- we were seated outside and it is absolutely beautiful there, a table lakeside! Definitely planning to come back here soon!\n*Bonus points for being in a park!! Great for going for a walk after your meal!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poa1RtOHRVWGREUmtwdVpUbFRXVkJmWjFKSk1tYxAB",
            "text": "Great view"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSVpHbG5UbmhHYVcweVJGWXhOR3BzUlU5UlFXYxAB",
            "text": "I gave service 3 stars because it really depends on your server. Most times, we got good to excellent service. But the one time we had a bad server, a bald headed male (not the bartender), completely turned us off to this place in case we ever get that guy again. Just left a bad taste in the mouth and we haven't been back since. Lots of other places to go to.\n\nThe good.\nThe bit of the menu I have been able to try has been very good. The Shrimp Cavatelli is damn good. The bartender is super cool, fun to talk to, and came by to check on us a few times. If you sit outside, you can see turtles coming up to greet you. The place is beautiful. A little pricey.\n\nThe bad experience.\nThe server recommended our out of town guest off of what they wanted and suggested the most expensive item on the menu. He basically ignored our table and the place wasn't even packed, but there was one table that got ALL the attention. When we asked why the food was taking so long to come out, his answer was because my gf ordered a medium steak which takes longer to cook, obvious BS. Half the time, we couldn't find him, and the rest we couldn't even signal him because he seemed like he was deliberately not looking our way. We ended up asking for things from the bus staff. We kept talking this place up to our guest and when we left, we left red-faced with embarrassment."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRU5WUkpWMVkzWVU1TE4wMW1XRkphTTJSZmVGRRAB",
            "text": "My wife and I were there last weekend for a family member’s party and had a wonderful experience. The venue was amazing. It had a beautiful space, a great atmosphere, and everything was set up perfectly for our group. The restaurant itself was also fantastic. The food was delicious, the service was quick, and everything came out just right. We were also lucky enough to be greeted by Alyssa at the host stand. From the moment we walked in, she was warm, welcoming, and professional. We were genuinely surprised when she mentioned it was her first day because you would never have known. She even helped make sure we had the right music for the party, which really added to the vibe. Her customer service was excellent and she helped make the whole night feel smooth and special. Big thanks to the entire team and especially to Alyssa for making it a night to remember."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbVoxOW5kQzFUUWpsRGVrNDRUbTlIU1hKQloxRRAB",
            "text": "Pretty location but food isn’t great at all. Expensive drinks. Pretty quiet during the week and now I know why. Dessert sucked and entrees were no big deal."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQ1VXRkJSRWxGZFVVNFJ6VnlWRzlrY1dSWVNsRRAB",
            "text": "Beautiful place on the water. The second event was held there with excellent service and food. It was a hot day and the outdoors was very uncomfortable even with fans, but that is not something controllable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNE5XOUdOM3BWUTJkVFEzY3RNMlIxTVVaV2FHYxAB",
            "text": "The Stone House at Clove Lakes Park is a beautiful and elegant restaurant with lake views.  We hosted a party of 45 guests and were impressed with the excellent food and outstanding service. Nadia was incredibly helpful with the planning, and Alexandra and Dan ensured everything ran smoothly. Highly recommend for any special event!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVFRFUkVWRXN4ZVVkc2IwWkhRMng0TTJOMFlrRRAB",
            "text": "Had family dinner to celebrate our Grandsons graduation this past Saturday night. This beautiful restaurant did not disappoint. The grounds are stunning and inside the restaurant is lovely.\nEverything was delicious. Our servers were excellent. I look forward to going back again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dU0yYzRibHBSYkZvdFZHcE9lVWRyVUdJeVdYYxAB",
            "text": "Beautiful location, delicious food, and amazing service. Such a peaceful and romantic spot, can’t wait to go back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaFdEQnNkVE51YWpkWk1sWmlZa05LUmxGbmVGRRAB",
            "text": "Best food on the island"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twc1ZtZExZeTFpU1VndFJITk5TbXBpYUdKRGFFRRAB",
            "text": "Alrighty, so first of, the atmosphere is 100/5, Stone house fits the atmosphere, this restaurant is amazing, the furniture is great, next of the service, service was very good and nice, the cashiers and servers were too nice , I loved the place, the food, I’m not going to even talk about it, 1000000000000000/5, this restaurant should have the Michelin Star, did the food critics ever come? Like seriously, when did they come last time? Or never? This restaurant is AWESOME, the food is AMAZING!!! I loved wearing my “Real Energy” hoodie that was yellow, THIS PLACE IS DA BEST!!!!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKdnY3ZjNXMWFPY0d3EAE",
            "text": "This was our first visit and food was absolutely amazing.  Our server Joe was best server we had  and we go out a lot. He was absolutely excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSYVdHOVJXbTl5VmxkWmFVcGtiWHB6TUdaVlYyYxAB",
            "text": "Great atmosphere for dinner...."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNDhmNjFnRRAB",
            "text": "It’s a charming space on a lake. The atmosphere is great for hosting events. The views are nice and they made good use of the location. We tried the restaurant and can’t say the food was very impressive. It was mediocre at best which was a bit of a let down. We tried the eggplant steak and the redfish. Both of which weren’t bad but we got bored of the food quickly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdDhYSkhREAE",
            "text": "I ordered a banquet for the family on the occasion of my daughter's birthday. An amazingly beautiful place! Majestic interior! Delicious and very unusual dishes. Everything was fine and I had only a slight organizational inconsistency when placing an order through the Open Table service. Convenient parking is, as you understand, also very important for New York. Definitely, we all liked it and we are satisfied! We recommend this restaurant!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNmVQNnZnRRAB",
            "text": "What a great experience at this restaurant. The setting was dimmed, romantic and perfect for date night. Everything from the decor and service to the food and drinks were amazing. The servers were attentive but never made us feel rushed as we dined and talked for almost three hours. The smoked old fashioned was so smokey and delicious and my salmon was cooked perfectly. My boyfriend said the steak he had was one of the best he ever had lol overall a wonderful experience and I hope to return again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNnBmXzRRRRAB",
            "text": "My boyfriend and I came here for Valentine’s Day and to also celebrate our anniversary. The atmosphere and ambiance was lovely, especially for being a winter night. We were seated in an outdoor/indoor section that was nicely heated and our table was decorated to match the love vibes. Our server, Carlos, was wonderful and very attentive, but not to the point where he was bothering us too much. He made sure we had everything we needed. Since it was Valentine’s Day, there was a pre-fix menu, so we made all our choices at the same time. Everything was delicious and my boyfriend and I sampled each others’ dishes as well. This wasn’t our first time at The Stone House, but our first time with one of their pre-fix menus and it was lovely. I’ve always loved their food and I look forward to my next visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeXJiY3JRRRAB",
            "text": "I was here for a wedding reception. The location is second to none, surrounded by trees, the lake. There are different sections to this venue, a seated outside area, bar area, dining area, function room area ( when set up, has an external bar, fire pit.\nThe food was excellent, canapés through to desert and the waiting on staff were attentive, constantly topping up the water glasses, coming round with the food, clearing tables.\nIf I was to hold a function on Staten Island first choice would be here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLXF1TGRnEAE",
            "text": "The ambiance is very warm and welcoming, with a beautiful view of the lake that's filled with dishes, tadpoles, and turtles. The service is also very attuned and quick, especially Antonio who delivered exemplary service and provided us with everything we asked for. The food was also quite delicious, albeit on the more expensive side, but the quality of the food is definitely on the higher end! Our favorite is definitely the crab and egg, which was delicious with its accompanying sauce and side, we just wish it was either a tad bit less expensive or comes with a larger portion for 28 dollars. Unfortunately our over easy egg was over cooked and they didn't have any poached egg option, which would definitely make the dish even more aesthetically pleasing and delicious!\n\nWe are looking forward to coming back with our friends and family next time to enjoy the beautiful view, the amazing service, and the unique variety of foods!\n\nThank you for reading and best of luck! (:"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbjVDalZnEAE",
            "text": "This was my first time at The Stone House and I have to say it was beautiful. I love the view of the lake and I love the vibe of the place. The staff were wonderful very nice. Thank You to Carlos O., Alfredo and Ramon for your service. They made the drinks special for us and it was delicious. It was my 17th year anniversary and they made the food with love. I had to meet the chef cause the food was perfect. The service was excellent and I definitely recommend The Stone House and I will be back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eTZiMVFREAE",
            "text": "Very romantic dinner at The Stone House.\nThe outdoor seating was absolutely fantastic with the lake view.\n\nFood was amazing and everything just perfect!\n\nWhen the sky turned dark and the mosquitoes started to bite, we asked to sit inside, it had live music!! So glad we got to enjoyed the outdoor view by the lake before dawn and enjoyed the live music after dark, it\nwas truly phenomenal and absolutely will come back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGOS1YSnRBRRAB",
            "text": "I loved this place  it was cozy the service experience was the best. The waiter knows about wine, knows how to serve elegantly..\nThe only reason they don't get a 5 star on food is because the steak was not cooked like we requested and the prices were a bit too much. Steak do not bring a side nor a vegetable, no salad. And each steak is aaround $45 if you want a side you will pay $15 extra. It was odd to me.\nAppetizers were priced high but,  they were all good, except the burrata.\nCocktails were great. Wines were excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOEpYck53EAE",
            "text": "The steak and apps were absolutely delicious and perfect! We got the lamb chops, burrata and bacon slab. For dinner we had the ribeye and skirt steak. Sides of string beans, whipped potatoes, mushrooms and creamed spinach. Everything was phenomenal, steaks were incredibly tender and cooked perfectly!!!! Service was great, would absolutely recommend!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueGZPeHBnRRAB",
            "text": "Had my daughter’s 1st birthday there this weekend and everything was outstanding! The setup was great. They were able to match the tablecloths and napkins to my decorations and I loved it. The atmosphere, staff and the food couldn’t have been any better than it was. Friends and family were texting us after the party saying how great the food was and how beautiful the restaurant is. The pasta with mushroom and sundried tomatoes was a huge hit! Definitely booking future events at the stone house again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJMzI3WUtLeElqakxBEAE",
            "text": "Brunch was delicious. Service is great. Relaxing atmosphere."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHa3N1WTl3RRAB",
            "text": "I really can not recommend the Stone House enough. If I could give it a 10 star rating I absolutely would. In fact, I wish I was there right now instead of at home remembering how good everything is here. The service is always wonderful and the atmosphere is very relaxing and charming. I always enjoy my time here immensely and immediately start planning my next trip as I'm walking to the car.\n\nThe most recent meal I had here with my family for my birthday is definitely one of the best of my life. The butternut squash soup was so rich and delicious that I was sad when I finished it. The strawberry salad was full of flavor and my mouth is watering just thinking about how good it was. My vegetable pasta with chicken was incredible and the cookie butter mousse parfait was unbelievable, melt in your mouth, perfection.\n\nAfter you're done reading this you should immediately make a reservation here, you won't regret it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0d3OHVFOEtid3lRRRAB",
            "text": "What a wonderful brunch for Mother’s Day. They offer a variety of meal options to select from. That’s in addition to the croissant pastries and sides. They wrapped the meal with two dessert options.\n\nStaff were wonderful. Hostess treated us and we were immediately welcomed. Service was excellent. We were well taken care of with whatever food and drink options we wanted. Excellent location in Clove Lake Park."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdGJUN2lBRRAB",
            "text": "Went to The Stone House per a friend's recommendation, since she is a musician and plays there every week. The food was delicious, and the service was outstanding. Very friendly waitstaff and the place was decorated beautifully for the holidays. We got a $100 bottle of wine and were given complimentary bottle service, and our dishes were just so tasty. I highly recommend the lamb shank-- the meat falls off the bone because of how tender it is! We enjoyed ourselves and will likely come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoLUlIZUxBEAE",
            "text": "What a gem, charming historic building, so romantic. Excellent service at birthday party dinner. Staff amazing, food delicious and plentiful. They have a few events coming up for Valentine's day and weekends. Well worth it. Ate the Chateaubriand before I realized hadn't taken photo. It was too good to wait."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXeXM2SzV3RRAB",
            "text": "We started out by having lobster bisque which tasted great and the pieces of lobster thrown in were cooked to perfection and buttery. Then we had our entrees my friend had one of the specials the tuna steak with risotto she said it tasted great, I had the seafood medley which had a array of seafood mussels, shrimp, lobster-which was great except my lobster was a bit chewy, and the sauce was watery- but the flavor was there. We had some amazing cocktails - and to finish we tried the creme brûlée and the cookie butter mousse both were great but the cookie butter needed a little something more. Over all the service was great, the flavor of the food was great, and the restaurant has this charm that is breathtaking now add some music from a solo guitarist to enhance the mood and you have the perfect Saturday night ambiance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNnJQdE1nEAE",
            "text": "First time here for our wedding anniversary. No one acknowledged that, it would have been nice.. the waiter seemed very disinterested.\nThe octopus special was nothing special- a little dry. I ordered a Med-rare filet mignon and I got med well- the waiter didn’t seem to care to ask how our meal was. Was a meh experience- if you’re gonna charge Manhattan prices, you might want to be sure you’re giving Manhattan food, service, and experience. Our fault for not vetting a place for such a special occasion."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2Ml95STBnRRAB",
            "text": "The place is a pleasant restaurant right in Clove Lake's Park! Food is fairly reasonable with entrees starting in the low $10 range up to the mid $40 range. I went with two other friends and we had the shrimp scampi lunch special, halibut and lamb chops. Service does take a while though and is spotty. Food was great though."
        }
    ],
    "reviews_count": 59
}