{
    "name": "Harvest Cafe",
    "place_id": "ChIJuWekL0hJwokRrx2XEx2c7k8",
    "grid": "SI2",
    "address": "694 New Dorp Ln, Staten Island, NY 10306, USA",
    "rating": 4.7,
    "user_ratings_total": 290,
    "phone_number": "(347) 857-6888",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SM2FrazVVSGx6TFVKQ1MzVnRTMjlwUmtSblFrRRAB",
            "text": "Nice warm comforting food amazing prices, I had a fantastic waitress Nicole pleasent lovely patient and really knew her orders. The cooks ben and nick my goodness they make the best most flavorful food I have had in a long time I will be returning often"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210QlVESlhOMDFJT0RWamVrSjRTVFYwUVhweWRWRRAB",
            "text": "This was a pleasant surprise.\nThe restaurant is newly renovated, simple, home grown. You feel like your visiting family\nThe staff is spot on, friendly and accommodating\nThe food was fresh and hot\nA must stop on the island"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSFpuUm1Rek5yYm5jeGNrZHlhMVpUWTFoWlFsRRAB",
            "text": "Very clean, so cozy, really nice stuff. The food is good.\n2 dishes for breakfast, one coffee, one tea and pancakes, for $45."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMVRYUTJia0ZrUldkT1VEZHZNV2hJYm1OemFWRRAB",
            "text": "Absolutely loved our brunch here! We ordered the Bananas Foster Pancakes, Cinnamon Toast Crunch French Toast, and the Chimichurri Steak — and every single dish was incredible. The pancakes were fluffy and rich with that perfect caramelized banana flavor, the French toast was crispy outside and soft inside with a nostalgic CTC crunch, and the steak was perfectly cooked and packed with flavor.\n\nThe staff couldn’t have been friendlier — genuinely warm and attentive from start to finish. And the bottomless mimosas definitely sealed the deal. 🍊🥂\n\nIt’s rare to find a spot that nails both food and service like this. Definitely one of Staten Island’s best brunch spots — highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNE0xRnRNRXB0TkUwM2VHTmFVRzlMWTJ0dE0xRRAB",
            "text": "First time I ever been there, Went last night and I didn’t know what to expect, didn't even get any apps and had trouble finishing my plate.just renovated so super clean inside\nFood was actually excellent. Two people"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOd2JGSjJURUp2YkVGZmRIaFBWa1Y0Y2psNlpuYxAB",
            "text": "Food was delicious! I was impressed! This place is a hidden Gem"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcVlEdHV3RRAB",
            "text": "The food was excellent. Staff was great  very helpful . Can't wait till they reopen again. Miss them.😊☺️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6ckstczZRRRAB",
            "text": "Enjoy the amazing food with a good cause.\nThey trained and hired servers with disabilities, this is not only a restaurant but a good organization with mission.\n\nTheir Benedict is my all time favorite.\n\nSpace is not big but spacious between tables, very friendly staffs, great place with love, just lot of respect for the people and the restaurant(organization)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1X05qb3p3RRAB",
            "text": "Amazing service and food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMkptWlBBEAE",
            "text": "Stopped in for late breakfast/early lunch and had a great meal. The breakfast biscuits with sausage and eggs were really good. Coffee was fresh and kept on coming! Great meal all around!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbllXUUx3EAE",
            "text": "Saw this place on a stroll back home after work one day. Decided to try it out and had a really good experience. The staff were very friendly and we were greeted immediately upon entering. Was a little sad that I was not able to try to crab cake Benedict but will definitely come back again to try them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNWJHd3BnRRAB",
            "text": "Harvest Cafe is my FAVORITE restaurant to go for breakfast!! Staff is always amazing and super kind and helpful and if you go you might see Head Chef Joey Pascarella, the nicest man you will ever come across!! I drive out from Long Island because no place has better Service, Food, and Atmosphere and for the price, you just can’t get better!! 10/10 Recommend, they will treat you like a regular whether it’s your first time there or thousandth. Everything is fresh and made by Chef Joey. Definitely gotta head over and give it a try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNWVHZjl3RRAB",
            "text": "Finding Harvest Cafe has been a blessing. Upon first coming in you get greeting by a wonderful staff that treats you like family, the menu offers a wide variety of food making you want to come back and try some thing else, once trying the food I knew this was a place I would be coming back too. Being from Long Island the drive is definitely worth it for the amazing food, staff and atmosphere. The chef Joesph Pascarella is a master at his work and really creates phenomenal food and adds in fun ideas to food combinations.\nIf I could give this place a 11/10 I would!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcGFTRFJBEAE",
            "text": "Always good food and friendly service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MnJEV1lBEAE",
            "text": "Amazing restaurant!! With an incredible mission and outstanding staff!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5OGF1Zmd3RRAB",
            "text": "My experience with this place it's not bad.👍😊 It's just the people I went with,were a bit cranky. The food was spot on. The inside was business and home like. I was supposed to go somewhere else with a group of people but instead I went here. To be honest, I wanted to go here. When I looked up this place online, it favoured my interest.😊 They had good choices for breakfast, lunch and dinner. 🧇🥞🍳🥪🍔🍝 The prices are a little steep, but I enjoyed it.👍 They had a bathroom but didn't have time to experience it. They also have desserts and pastries up front. I brought white chocolate pretzels 🍫🥨 for $3. They accepted cash or credit 💳💸 which was good for me. I might come back here again for another choice, maybe this time with people that are decent. 😊👍 No pressure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dDRDeVdREAE",
            "text": "Wow great good and great portions. The workers are so so nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5LXJyakNREAE",
            "text": "The food was delicious! The service was excellent. The staff was on point courteous and had my coffee filled all the time always asked if we need anything. The atmosphere was comfortable and cozy. Would recommend I had a wonderful day!👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkaDY2MHRRRRAB",
            "text": "We had a great experience here. When we first arrived, the hostess let us know that a large party had just been seated, so it might take a little while longer to be served. Not a problem. Our waitress, Victoria, made sure our coffee cups were filled and updated us every so often that we'd be served shortly. To be honest, she made our visit! She was upbeat and peppy - really made us smile. Servers without disabilities could take lessons from her! The breakfast sliders were delicious (just loved the flakey biscuits) and the waffles, tasted homemade. We will definitely be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkcWFLY1V3EAE",
            "text": "A little cafe tucked away in a busy part of Staten Island. We went for breakfast. Food was a nice portion and staff very welcoming. It was nice supporting such a great cause-a restaurant providing catering training experience for people with challenges & disabilities!!  👍…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMnRMS0dREAE",
            "text": "Everything was fantastic. Service. Ambiance. Food. Will definitely be returning. So glad my friends and I decided on this place. It was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxcGEzcVNnEAE",
            "text": "My husband and I met a Friend at the Harvest Cafe for Brunch. The atmosphere was very pleasant. The food was delicious and the service was excellent. I would definitely recommend the Harvest Cafe to anyone looking to enjoy a a great dining experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcHM3cGJBEAE",
            "text": "Very kind courteous people. They were so kind with us with a baby. Made sure the baby is prioritized and made sure to keep us comfortable. I really need to mention the food was great and we love brunch so this is now going to be our staple brunch spot in the island.\nWhoever goes here just remember you too need to be kind to the staff and your kindness goes a long way!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxa0liZjB3RRAB",
            "text": "This is a very special restaurant.  The wait staff was incredible and the food came out fast and hot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsczZmSUl3EAE",
            "text": "Love this place.\nWill be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOWFucDFnRRAB",
            "text": "I crossed over the bridge from Brooklyn to spend the day in Staten Island. Stumbled upon this restaurant during a brief Google Maps search and I’m beyond glad that I did. The mission is what drew me in.\n\nUpon entering the clean, quaint establishment, I was welcomed and seated by Jess. She was such a gracious, attentive hostess and server. I ordered the garden salad with crab cakes and a Belgian waffle. The food was amazing. I also had the pleasure of meeting a gentleman (either named Jake or Drake) who was so pleasant and courteous.\nIt was the end of the shift and Jess ensured that he had change for the bus and their interactions warmed my heart.\n\nI must also mention that the prices were great. I would definitely come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaa2FIczJBRRAB",
            "text": "A lovely local restaurant. I love its Eggs Benedict.\n\nIt has very nice brown sugar tart also."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOXRpZC1BRRAB",
            "text": "Just discovered this small amazing place. A MUST!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaZ05teXZBRRAB",
            "text": "Everything was delicious and a very friendly environment."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabllTUFpREAE",
            "text": "Absolutely love this breakfast and brunch place. Not only because the foods are delicious also they have a mission-The mission is to provide developmentally disabled Staten Islanders with opportunities to develop skills after graduating from high-school. I’m really amazed by that."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVMFBxRnJ3RRAB",
            "text": "Great place for brunch and lunch. The staff is friendly and attentive. The food is reasonable priced and good portion. They have a 20$ brunch that includes a booze drinking, brunch food and dessert. Plus there are two tables to sit outside and watch an amateur sport game."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcF9XaHJRRRAB",
            "text": "Excellent food and staff. We sat outside which was perfect with the summer breeze. The inside looked nice and cozy as well. The staff was very helpful and considerate. We got the crab cake Benedict which was delicious, with possibly the best home fries I’ve had. On top of all of it, the cafe has a noble mission which we appreciate. We will be coming back if we are in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwd3RLVVV3EAE",
            "text": "Super friendly service 🙂\nAwesome concept and well implemented 💪🏻\nTasty food and ☕️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwLUpQemtnRRAB",
            "text": "Amazing place! Lovely old fashion style diner with exceptional service and extremely kind employees"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMVlfbkFREAE",
            "text": "Have been here many times, loved it each time. Great food and service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcXFMRjFRRRAB",
            "text": "We love harvest cafe!!! It’s nothing fancy, just traditional, diner-style dishes, but it’s always a nice experience. The staff is the best! very friendly and attentive. They also FINALLY reintroduced a full-sized menu recently (it was limited for a while after Covid). They have good-sized portions and a decent variety of options on the menu. I like the crab cake benedict."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaE9laXZ3RRAB",
            "text": "Great place and location for breakfast and lunch.\nExcellent service and good food. 👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSa3VLa3l3RRAB",
            "text": "Very sweet place but the food isn’t good at all - very bland. Would come back for the people but not the food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSOUpyUWpBRRAB",
            "text": "This is truly a hidden gem on Staten Island.I had no idea this place was there until my friend suggested it. It is a wonderful dining experience with a feel good mission. We got lucky the day we went was not crowded for brunch so it was very enjoyable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNjRpQjZBRRAB",
            "text": "The people that work here care about the people and the food that you’re going to eat. The place has a real ‘home cooked meal’ vibe about it. The food and service are excellent. If you’re in the New Dorp area, drop in and see what this place is about."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPZ3ZUYVNREAE",
            "text": "First time trying out this place. It’s very quiet, nice people. I was not a fan of the French toast. For me it was very bland, my daughter enjoyed her waffle though. I love what they stand for though!!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndEpEM3RRRRAB",
            "text": "This is the first place we ate during this week long stay on Staten Island.  It is very bright, cheerful and clean. We only saw street parking but easily found a spot across from the restaurant on a side street.  We wanted breakfast but they stopped serving at 11.  Lunch is served from 11 am-3pm when they close. The lunch menu looked great also. My daughter ordered a Caesar Salad with grilled chicken which was very fresh with crisp homemade croutons.  I ordered the loaded tater tots and asked for fried eggs on top which they were happy to make even though breakfast was over.  It was so delicious!  I couldn’t eat all of the tots.  The loaded tater tots are definitely sharing size!  To get such a great lunch with tea and tip for only $25.00 is incredible! We were surprised by how fast our food arrived at our table. The staff were all so professional and attentive.  They were also some of the sweetest people we have ever met! We were treated like Royalty.  Our waiter, John, actually walked outside and thanked us and welcomed us to return. Please visit Harvest Cafe, you will leave a happier person and not just because of the great food and service!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnaV9LLVNBEAE",
            "text": "Food is delicious! The service is outstanding and the prices are just right! You get your money's worth and then some.  The meals are home made meals, not processed and plentiful.  I'm a repeat customer! This has been the spot for me and I've introduced this location to friends and family."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoelBYMWxnRRAB",
            "text": "Lovely restaurant! Feel the warm homely welcome . Will definitely back there again.\nFrench toast is not my favorite but I love my son's waffle🤣"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMTVuZFNREAE",
            "text": "Wow. Really. This truly is the best place for breakfast on Staten Island. I just had the best poached eggs I have ever had and the french toast was so delicious. The prices are unbelievably reasonable for the quality of food you get here. I…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodm9UUWRBEAE",
            "text": "Want to give a HUGE shoutout to Harvest Café for hosting a beautiful breakfast buffet yesterday on the morning of my son’s Baptism. Head chef Joe and his staff were so sweet and accommodating. We had about 40 people and they were so impressed with everything. The food was cooked fresh and absolutely delicious. Included in the buffet were pastries, bagels, danishes, muffins, biscuits, fresh fruit, bacon, sausage, chicken and waffles, scrambled eggs, pancakes and tater tots. They also served us freshly made chocolate chip cookies and brownies. As soon as something ran low they immediately refilled it. I HIGHLY RECOMMEND having your gathering here or even just stop by for breakfast or brunch."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1OVpiZ01REAE",
            "text": "This place was great nice and clean friendly and the food was great the prices are great as well.  This place employs handicap people how nice is that. I recommend the vanilla French toast as seen in the picture it was delicious as were the eggs and potatoes . We will be going back we are glad we found this place."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcjczVlpREAE",
            "text": "2018.06 2nd visit... Can't do meaningful things daily, but whenever I can.\n\nwant to visit for long time...  This is a very special place and meaningful.  Food are great and reasonable price.  Crab cake... Waffle... Coffee is nice."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVN0k3SVZBEAE",
            "text": "Had a fine meal here. Nice cafe, nice interior, accessible, cheerful, friendly, and tasty. Had a good salad and a good cup of coffee. Staff was attentive, helpful, and friendly. Good crowd of diners. Def give it a shot."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZcW9YZ0x3EAE",
            "text": "The food was really great, the people were friendly, and the atmosphere was very relaxed. It also offers a slew of healthy options for low prices, and it's not served to you on cheap disposable plates. A great place to have brunch and catch up with friends!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHLTZ5Q3d3RRAB",
            "text": "Everyone talks about how nice this place is so after my doctor's appointment I went here. The place is clean and staff were great, the only thing was as I was eating the folks that served me left to back home so I did leave a tip but wasn't sure if I needed to. I would definitely be back."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJek9tYnJRRRAB",
            "text": "Great place to eat especially breakfast. large quantities at reasonable prices and very good service by developly disabled people. Pictured is the French toast with walnuts bananas and bacon."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDOGNxemh3RRAB",
            "text": "First time here and it was delicious! Everything was fresh and tasty. Will 100% be back!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNMGJpcmhnRRAB",
            "text": "This place is great.The waiters or waitresses are nice.The food is delicious.In the picture I ate some already and it is a nice little snack or light meal of avocado toast"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeElPZEZREAE",
            "text": "This place is what every neighborhood needs. Great food, great prices, it’s clean, good vibes and always a blast. The food is always done proper, cooked well with generous portions. The cook named Joey is phenomenal, he is as talented as he…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoZ2VMdC1nRRAB",
            "text": "My sister held my nephew’s baptism breakfast here. Forty people attended & it was buffet style. The food was delicious & there was something for everyone. The wait staff was top notch & very attentive. The buffet was never left empty. They…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNNy1YOW5BRRAB",
            "text": "We went here for a surprise birthday party. They closed the restaurant because we were 100 people. The food was great. They serve breakfast and lunch. They also  do brunch. This is run by people who are giving young adults that are mentally challenged. They are teaching them to earn money, a skill and how to survive in real world. The food is very good and full portions. The service is exceptional. Give them a try. Your money will be very well spent. And your patronage will be most appreciated. Street parking and handicap ramp. Very clean and well managed. Sorry it took me so long to write this."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCekxhMTNRRRAB",
            "text": "This is a wonderful restaurant with a beautiful mission of helping people with learning differences gain experience for the working world. Worth going just for the fabulous food and friendly service, but knowing that they are doing this extraordinary work makes it even more memorable. Worth the drive from Manhattan!"
        }
    ],
    "reviews_count": 58
}