{
    "name": "Boriken Restaurant & Bar",
    "place_id": "ChIJbTwNVwBPwokRJ0IZxOeqQzU",
    "grid": "SI2",
    "address": "704 Bay St, Staten Island, NY 10304, USA",
    "rating": 4.2,
    "user_ratings_total": 96,
    "phone_number": "(347) 466-5021",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNlpqbFdTRFJJVVdoWVJVcHNPSEZIVHpsV1dGRRAB",
            "text": "Boriken Restaurant & Bar your food came out hot and fresh at just the right time. The food is well-spiced. Costs are fair and service is good. I feel at home at the Boriken Restaurant & Bar. Restaurant employees show true friendliness. This place has too many highlights to mention."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUlJGOVFkVXBuUjFSMmRHUlBiV00zV0ZocVdrRRAB",
            "text": "Excellent restaurant serving Puerto Rican cuisine perfectly. The staff is amazing and on top of their game. I thoroughly enjoyed eating here. It’s hard to find authentic Puerto Rican fare on Staten Island so thank God for this place."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GV1RsUnRhbTVCYUZab09USjFTemMzV2tSQ1ZXYxAB",
            "text": "Was very excited as there are not many puerto rican restaurants on the island. I travled from the south shore with my freinds and our kids to treat them to their first pr meal. Food took over an hour to arrive when I ordered drinks and an app [the most expensive one picada] She said I had to put it in when I'm ready to order my meal...? Also asked for a refill on my cocktail which never came. App came eventually.. and entrees didnt come for over an hour and a half.. Kids getting restless.. The 2 pork dishes that came were undercooked but my freinds didnt want to send it back since we waited so long. My churasco was OK I felt not seasoned well.. Platano soup was really good actually. This place I wanted to really like but gotta keep it 100 si o no 🇵🇷. I think this place is newish and still maybe needs to get the kinks out.. Will give them another shot in the future hopefully they take some of the constructive criticism here on their reviews and tighten up some other things and come back strong. Good luck!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NE0zcFBlV3B3VTNVeFdHMWtNVkphWm1OSFozYxAB",
            "text": "All I have to say is thank you for bringing flavor to this Island. We have nothing of this sort here and I was so excited to go here especially knowing their other locations are so good. The food was amazing they even were able to accommodate my vegan diet! The drinks were delicious and Jessica hooked it up , she was alone and hustling and her energy was still bumping she never skipped a beat. It was my dad’s bday and they made it very special. The music was perfect and the decor truly reminded me of PR. Loved this place will be going back! Please never leave ?"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TFdtdHpkVlk1TTFCSWNtVXhVbkV0YTJOUWVHYxAB",
            "text": "Straight up authentic puertorican food. The chuleta kan kan is nice and crispy.  The steak and onions,  very tender. The service is great , as well as the atmosphere.  Everyone is very attentive to one's needs. Definitely recommend it."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcmIzWjRlRTlPT1dkTlUwZzBTV3BTVUMxSlZVRRAB",
            "text": "I love this restaurant for their authentic puertorican food but unfortunately due to lack of professionalism and requiring a reservation when tables are empty, will bring them down. Patrons walk in and they dont even have a sign such as WAIT FOR HOST TO BE SITTED. I went on their first day opening and I hoped they would get it together.  But they haven't, I recommend numberous couples to this restaurant as I am myself  Puertorican but they were unable to even accompany then to eat by the bar. First come first serve should be there motto. I hope when my husband and I reviste they prove us wrong.  My  update from my previous visit. Food is great like it always has been. They now have Happy Hour and no longer need reservations. Friday and Saturday is recommended because that's there busiest"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWFdtWklNVm8xYkVsRVdsVlJUazl6VFVST1YwRRAB",
            "text": "Food on point\ndrinks are delicious\nLegit flavor\nVoy a regresar ... muchisimas bendiciones"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GME5rMUVOamxyZG5WdFFYTXRWWFpSV1d0bVFWRRAB",
            "text": "If you’re looking for authentic Puerto Rican food, this is the spot! The flavors took me straight back to the island — from the perfectly seasoned arroz con gandules to the crispy, tender pernil. Everything tasted homemade with so much love and tradition. The staff were warm, welcoming, and made me feel like family. You can tell they take pride in their culture and cooking. The atmosphere was vibrant and full of life — just like Puerto Rico itself.\nHighly recommend the mofongo and alcapurrias— absolutely delicious! I’ll definitely be coming back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todVpWSndjRTlDVkhodk4wVk1YelJEWDBWRWRWRRAB",
            "text": "This place is A1!!!!!! Food was amazing vibes were great 10/10 I do recommend!!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNFFtcHZhWE14YW5wNGVGQnhhMUZoYzJSVlNWRRAB",
            "text": "I wanted to love this place but it’s mediocre.\nThe drink I had was great - the Old San Juan .\nBut unfortunately that was the one highlight.\nIn short, the food was cold.\n\nApps:\nBeef Alcapurria - lack seasoning\nBacalaitos - too greasy\n\nMains:\nBistec encebollado with arroz con gandules and maduros - the maduros were good and hot, everything else was barely room temp\n\nMofongo with Garlic Shrimp - again barely room temp\n\nSalmon Al coco - the rice was hard and again the food was barely room temp"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CM1V6TmFlV1pTVWtoR1VHY3hVRzFqVm1STU4xRRAB",
            "text": "Met up with friends to have some drinks and dinner here.\n\nAs a Puerto Rican I don’t say this lightly. That pastele was just as good as my abuela. That’s highest praise I can offer.\n\nThanks for bringing me back to my childhood! I’ll be back for sure!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200M1JWaG1OVGt5VlhkM1kxQnJibkEwV2pWemIzYxAB",
            "text": "We had a last minute booking for 16 and not only did they accommodate us, but the service was amazing! Jessica was our waitress AND bartender and she was a total rockstar!! She had the patience of a saint, helped suggest drinks and appetizers and was overall just great to deal with. The service was amazing, everyone was so friendly and the food was delicious!!!! You will not be disappointed if you stop here for a meal or a drink."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTGFWaFBORUZZWTA1VGJtVXlPV3BZVUhGQmVXYxAB",
            "text": "My second time here and it’s just amazing! Jessica was our server and bartender for a group of 16 that Al really accommodated so well! I can’t say enough wonderful things about this restaurant and the people that work there . Thank Jessica for your making service and drinks!!! Food and drinks here are wonderful !"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WmNFNUlWMUUxZEZWWmIyZ3RhbGhLZDAxWU1GRRAB",
            "text": "I’d recommend to anyone to give this establishment a try. You will not be disappointed. From atmosphere, vibes, service, foods and drinks,- worth the money!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wS1FtVnJkM0ZwWDE5MFpVRmpTMmRWU21WSmEzYxAB",
            "text": "As first-generation Nuyoricans (New Yorkers of Puerto Rican descent), we know a thing or two about authentic Puerto Rican food. If you're craving the kind of delicious meals your abuelita (Puerto Rican grandmother) used to make, whether it was during your trips to Puerto Rico or in her cozy kitchen somewhere in NY, look no further. Borikén Restaurant and Bar has arrived in Staten Island, ready to transport you back to those cherished childhood memories.\n\nFrom the complimentary sopa de plátano - a thick, hearty plantain soup, perfect for a cool, fall evening - mouth-watering alcapurrias and bacalaitos as appetizers to the savory, gigantic pork chop (chuleta kan kan), and the pernil and pasteles that remind you of holiday feasts, Borikén offers it all. For drinks, why not indulge in their red sangria or a refreshing cold Medalla, Puerto Rico's own beer? It's a rare find outside Puerto Rico, but Borikén has it covered. The restaurant may not be huge, but it exudes a warm, homey atmosphere. The decor is reminiscent of Puerto Rico, complete with a large screen TV displaying stunning scenes of the beautiful island. As you dine, you're treated to a delightful soundtrack of both classic salsa (Hector Lavoe, Frankie Ruiz, Tony Vega) and modern salsa (Marc Anthony, Victor Manuel, Rey Ruiz, Luis Enrique), with a touch of Bad Bunny and merengue. The music is at the perfect volume – loud enough to groove to, but not so loud that you can't enjoy a conversation.\n\nWe had a fantastic experience. The service was great, with friendly and attentive staff. The food portions were just right, and the prices were reasonable. We will definitely be back! The hardest part was deciding what to order for dinner and then realizing we ordered so much that a take-home bag was inevitable. But hey, that just means we have amazing leftovers for tomorrow's lunch!\n\nWe HIGHLY recommend Borikén to anyone who loves Puerto Rican food and misses their abuelita's cooking, as well as to those who have never tasted Puerto Rican cuisine and want to give it a try. We wish Borikén much success on Staten Island and hope they will be around for a long time so we can visit often."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUlkwVlRVRE13YUVsd1ZYa3daMHh4ZWxsMU1sRRAB",
            "text": "This place seemed like it would be great and I wanted to try it but on 3 separate occasions I was told they only had like 20-40% of the menu available. The first time I tried was grand opening and the owner was not welcoming, the bar was maybe open and we were told they wouldn't have the full menu ready to order for at least an hour. The owner on grand opening said he had just got to the restaurant 25 minutes before opening and found out they were behind. As someone with restaurant experience, I'm sorry but as an owner on grand opening, you should not be getting in 25 mins before first day of opening. I'm sure the food is good, I just never got to taste it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMk9GZzFjekJXTTJOWkxUWk1PRzlKUVV4U1YxRRAB",
            "text": "My wife and I made a 5:45 reservation, we arrived on time. The restaurant appears very small when you walk in there are only about 5-6 tables but there is one empty. The “Hostess” approaches (with a not so friendly look) and asked if we have a reservation. She finds the reservation and says “let me go get som one to seat you, which we found odd… I mean there’s and open table right there but ok.  We wait a server comes over, says follows me and starts to asking to the kitchen (also odd) l. We realize there is more seating in the back where we see other people eating, we think ok so we’re sitting here, but nope… she keeps walking. We finally arrive way in the back seat n a tent like area that is COMPLETELY EMPTY and dark ( no people, no bar, no music, no light… no LIFE! We ask can we please sit in one of the other two areas with the rest of the patrons and are told no because people have reservations… but wait WE have a reservation and don’t want to sit in the dark by ourselves, no the experience we want to pay for. Bottom line, we leave! We don’t play the games we are self-respecting paying customers! We leave l, we go to BESOs where the experience is fantastic. We don’t pay our hard earned money to be mistreated. You can keep your trash restaurant. My guys is you’ll be gone in 2 years or less."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNWNsRjRTVTkwTWtObVpsRlZTa1p6T1RReVNVRRAB",
            "text": "Wow. This place is a gem. The taste of the food was authentic and delicious. Love the decor. Very cozy. My mother-in-law who is a great cook loved the food. We all loved the food. The food presentation was very appealing and impressive. We all had alcapurrias, yummy  😋 🤤 They gave us complimentary platano soup. My wife had kan kan chuleta (wow, yummy) with rice, salad and avocado. I had Christmas anytime  which was pernil, pastel and potato salad and rice and peas. My mother-in-law had shrimp al ajillo with rice and peas and salad. The server named Maribel was great. She was very attentive and kind. She gifted my mom a coqui . My mother-in-law has dementia and this kindness meant so much to my wife and myself. The entire wait staff was great. Thank you so much for making this a great experience. 😊 We will definitely make a return visit soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMFJsZEhTRmRSVVRCUUxVUnlSbk52VVZaS01GRRAB",
            "text": "Great Puerto Rican food. Little noisy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WM2EzcHJPRVp1Wms1SmVVTjFOSFpGVTB4bE5YYxAB",
            "text": "This is restaurant is great! When I called ahead for reservations, they were kind and helpful. The place looks small but they have space in the back. The vibes are chill especially with the music and good energy from the staff. The food is fantastic! From the appetizers to the dessert, you will leave full and happy. We ordered Alcapurria de Guineo (delicious), Surf n' Turf Mofongo (scrumptious), Chuleta Kan Kan de la Isla (Bangin'), Creamy Guava Cheesecake (succulent) and I forgot that they first served us Sopa de Platano (SO GOOD!) which is like their pre-game for their meals. You can probably tell by now, I highly recommend this restaurant and I wish them the best."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NelZIZGZMV3RCUkhnM1RFVjNSM05IUkhrMlQzYxAB",
            "text": "A few friends told me I had to try this spot because they know I’m a foodie, and wow, they were right! I came with my husband and our 10-year-old, and from the start the experience was top-notch.\n\nWe were greeted by Jessica, a warm and friendly lady who also turned out to be our waitress. She sat us in the tent outside, which gave off a beautiful tropical vibe with the flower wall and bamboo furniture. Such a nice touch! Jessica was pleasant, attentive, and checked in often to make sure we were good.\n\nNow let’s talk about the food. because this is where the magic really happened. We started with the Alcapurria de Guineo (plantain stuffed with ground meat). All I can say is, we should have ordered two! My 10-year-old had the Camarones al Ajillo and polished off the entire plate. My husband ordered the Mar y Tierra de Aguadilla and could not stop saying, “Babe, you have to try this.” He was right, the steak was cooked to perfection and full of flavor.\n\nFor my dish, I went with the Snapper with plantains. Let me just say, I never finish my meal. But this time, clean plate. The only thing left was the fish head!\n\nThe drinks were also on point, and honestly the whole experience transported me right back to San Juan from earlier this year. Huge thanks to my friends for insisting I try this place, I can now officially declare it’s in our rotation. And Jessica, you’re awesome! We’ll definitely be seeing you again soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNVIyMHlkMlExVVRWSGVrNUVSVzFoYnpkdldXYxAB",
            "text": "After visiting Kiosko 787 for our anniversary, we were excited to hear that the owners opened a new location on Staten Island. Borikén Restaurant didn’t disappoint! The food was once again delicious and the addition of a full bar and larger seating capacity elevates the experience. The service was exceptional!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WlExYzVZamRDUmxVMGMza3RjbUkwYzJ4M2NHYxAB",
            "text": "Food was ok, service was slow, people sitting next to us were loud and obnoxious. The restaurant opens at 2pm. Why the kitchen opening up around 2:45pm? I appreciate that they at least gave us a free soup to help make up for this. Also, not sure why the table next to us got served their food before us. They arrived after we did. The overall experience was just meh."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VM2RGaGtRa2Q1U1dOcUxUazVPR2hoVFVwcmNGRRAB",
            "text": "Party of four, Sunday, 9/21.\nAlthough atmosphere was beautiful it was too dark. I needed to use my  phone to see the menu. Most of the items we ordered were not available. Eg. Salmon, Modelo, steamed vegetables, flan, among others.\nThe food was ok but didnt taste like authentic Puerto Rican food. I am Puerto Rican and eat Puerto Rican food often, at home and at Puerto Rican restaurants, and my dish was missing the Puerto Rican ingredients,  flavor."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSZlNWcFlOVEpYWHpKTk56Rm1aamRtYjJ0eFpGRRAB",
            "text": "went there on a Saturday night recently it was pretty full but we had reservations its very nice inside I had the sopa de pollo which was very good and the boricua potato salad which was also flavorfully the drinks were also very strong which is a plus the waitress was very nice about  the wait time that was the only negative but I understand its not easy running a restaurant I would go back and wish them the best"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOT1VVSnFaa3BHUlVWdlpXWXpOVkF3V0c1SVNtYxAB",
            "text": "I ordered shrimp mofongo and it was good.\nThe server did not have too much experience. Her opening line was \"let me tell you all the stuff we don't have and that a cook had left \"\nWe do not need to know the behind the seens stuff. My husbands chicken was overcooked and not good at all. Don't think I'll return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTmFtWjRPV3MxUkZkM09VczFjVFpOWlY5VFpIYxAB",
            "text": "We went the week they were opening and it was on point! Everything was great and the drinks were even better! Can’t wait to go back!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KT2QxZ3RaVjlLTUVOQlIxZzRiREZZTTJWdFgzYxAB",
            "text": "No matter how empty the place is they advise that they only take reservations and no walk ins. Disappointed because that’s not advertised on their website. This was on a Wednesday by the way. They accept walk ins. They require reservations for weekends. I walk by the place everyday. Saw it empty and was denied service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMVJqRlhjV2hVTjB4NlJuTXhhR2gxYkRBeWRsRRAB",
            "text": "I am sorry to say the food was a disappoint and expensive. I ordered the red snapper and it was dry , overcooked, and tasteless. My companion ordered the steak and onions and it was also tasteless although it looked beautiful. We ordered yuca alcapurias. They were small which was unusual, and also not tasty. It seemed none of the food was spiced properly which is what Puerto Rican food is known for. Even the juice drinks seemed watery."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVlZHdEdUWEp6WjFOVFZGRTNZVk5pVTI1bVVFRRAB",
            "text": "Boriken was true, pure authentic Puerto Rican food. They offered us complimentary plantain soup which was very nice and delicious.\n\nEverything food wise was really good, 🇵🇷 but was lacking that dining/ service experience. It was giving “survival vibes” as I had to wait to order waitress/hostess/bartender  (all one person and very sweet, bless her) an item I wanted they didn’t have and so I asked her if there was anything else they didn’t have and to my surprise the list was 5 items long including avocado and octopus. 😩 we had to patiently wait and hunt our server down for water and refills (not something I enjoy doing when I go out)\n\nThe cherry on top was that they gave us someone else’s bill my husband almost paid and I said the price didn’t seem right thank God I checked it and questioned it and she told me she was sorry it’s so dark.\n\nit’s just a shame because the food was so delicious ♥️but I can’t see this place staying around long if things don’t improve😮‍💨"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVVVWWlZhVXRpWm1kVlRWTnJUVGgwYlZOeExWRRAB",
            "text": "Muy ricas comida y muy buen ambiente"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Q2FVZHlWVFpFT1ZCUE1VTk1hVlZvU0dOdExWRRAB",
            "text": "We had a 630 reservation for four we were seated quickly. That is the only positive thing that I can say about this place. We ordered our food three orders of Mofongo with Pernil and two orders of sweet plantains. and an order of snapper. When we sat down, there was one table of four people and no one else was sitting in the room with us. We ordered our meal and we waited and we waited and we waited atter 45 minutes.The waitress came over to us and said the kitchen was backed up and our food would be out shortly. At the hour mark, she told us that our food was being plated and would be out in a few minutes at this point, our waitress was doing shots with the table behind us and another table of 10 people that sat down after us were being served their food. We continued to wait for our food and after an hour and a half we got up to leave and as we were leaving, and we passed the KITCHEN. We were told that they were just preparing our food. Needless to say we left hungry. I do not recommend this restaurant. The service is atrocious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUU5rSmtPVXRuWlRRNWIxWlVPVUZsWmtKSU1GRRAB",
            "text": "We made a 6:30 pm reservation for Saturday night.  Got here and was placed in a small room.  There was a big table set for 12.  None of the people were present. There was only one other table occupied with four patrons.  The waitress told us they didn’t have Salmon, avocados and two other dishes we couldn’t make out what she said. She then left and came back to take our order.  Meanwhile the party table filled up and got drinks.  At 7:30 pm we asked the waitress where was our food. We were told all dishes made to order and take some time. We had ordered Mofongo with pernil, sweet plantains and red snapper as entrees. Seems pretty basic to me. We ask for some bread or tortilla chips to hold us over til the food comes out. She brings us a small bowl of plantain chip which looked like they had come out of someone’s snack bag. The waitress then tells us the food coming shortly.  At 8 pm. We are told it’s being plated and will be out. At 8:15pm still no food so we got up to leave. Almost two hours of waiting. And in the meantime the party of 12 got drinks and appetizers.  And the table of four behind us had their food and they had 5 rounds of tequila shots with the waitress!  In between this time another party of four arrived and the received drinks and food. Unfortunately we will not return here and I seriously advise not to go unless you are not hungry and like to wait hours for your food to come out.  With the party of 12 and the table behind us doing shots it was so loud we couldn’t even hear ourselves talk. I can’t even rate the food. And honestly service and atmosphere are not even worth one star."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200d2JGQnZWRzgxWVVob1lrOWFiV3B1V2w5alVWRRAB",
            "text": "My bartender adriana is wonderful I have not seen customer like this in a long time . She is very helpful my husband and I like to come when she is here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSmEydERiRlZaV1doVWRIUkhiVFZSV0dSSlJuYxAB",
            "text": "We did reservations for 2:30. They were supposed to open at 2. They opened at 2:35. We were finally seated at 3. It took almost 40 min after we sat for someone to take our orders. I can say, the food and drinks were delicious but service needs to excel for me to come back."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SGIwWkRabFJwWVZkaVJFazNObmxxV210RFIzYxAB",
            "text": "5 Stars a true taste of Puerto Rico!!\nWe just returned from Puerto Rico and have been craving authentic Puerto Rican Cuisine. From the moment I walked in, I felt like I had been transported straight to the heart of Puerto Rico. The warm, welcoming atmosphere,  the lovely esthetic, the sound of Classic Salsa playing in the background made us feel like we were dining on the Island. Every dish was made with love and tradition in mind. Lets begin with appetizers; the Arepitas were perfect sweet and savory bites. The Piononos perfect combination of tasty seasoned Carne Molida and Maduro, if you know you know. Our Entrees; The Chillo Frito so flavorful took me out with the side of Yuca Escabeche. We  ordered the Chuleta Kan Kan and it was fried to perfection. The Chicharon to Meat ration made the perfect bite. Saving the best for last my comfort food a simple dish of Arroz y Habichuelas were perefct addition to the Chuleta. My daughter had the Mofongo with Churasco and Shrimp and it was excellent, savory broth and tasty/tender steak.\nBut, what truly made this experience special was the heart behind it. The staff treated us like family. Checking into make sure everything was perfect and even sharing some of the stories behind some of the dishes. You could tell this is a labor of love and pride in Puerto Rican culture.\nIf you're craving real authentic Puerto Rican food, this is the spot. I left with a full belly and full heart.Can't wait to come back!\n\nGracias por todo!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ac2QwUlhZa2t6WldWdlVtUnRSRkJ3Y2xkUkxVRRAB",
            "text": "Made reservations for 4 people for the same day and was able to get in. We were seated in the outside area which was more quieter then inside which wasn’t loud either. It was a little chilly out but it was fine. Service was good but a little slow but there were a few tables and it is new establishment so I understand. Food was good had flavor  but could’ve been hotter it was just warm, and they did run out of shrimp so one of the dishes we wanted was unavailable. The dessert was good, and also they ran out of the guava empanada but over all it was decent place probably - will give it some time before going back to try again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRlV6RjViMUV4Tm10alYwMUViblIzTmpSd2JXYxAB",
            "text": "Excellent service , food was delicious drinks were amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeFlsVjNhVmhFT0daaU5FVXpMVEU0U3pGMmQzYxAB",
            "text": "If you’re craving authentic Puerto Rican food, Boriken is definitely the spot! The flavors are fresh, homemade, and full of love — just like eating at a family gathering. Portions are generous, so come hungry!\n\nI had the Chuleta Kan Kan, Pulpo A La Parilla and Alcapurria De Jueyes and everything was beautifully seasoned and delicious. The Lychee Martinez was creamy and balanced!\n\nThe staff is super welcoming and makes you feel right at home. The vibe is cozy, laid-back, and full of that island warmth. Whether you’re stopping by for lunch, dinner, or just a quick bite, you won’t be disappointed.\n\nHighly recommend if you want a taste of Puerto Rico right here in Staten Island! 🌴🍴"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVFQzRnNkVU5yV21Sa0xVcHNMWGhHVURCbGFuYxAB",
            "text": "Great food! Actually incredibly authentic GREAT food.\nHonestly the best Puerto Rican food, I've ever had. We where 4 people and everyone absolutely loved it.\nThe cocktails top top notch.\n1 came with a flower, the other with a gummy bear.\nTrust, it's the right choice to go here. Ambience is correct, vibe is absolutely what you want.\nMaitre D Alfonse was so great.\nTop notch attention to detail on everything.\nVery cool place.\n5 stars easily."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xV05Xc3liSFpFZDI1VFltTjZXRlZPUlhOWlNWRRAB",
            "text": "Love the piononos sweet plantains, tostones were just as yummy. Chuleta kankan had amazing seasoning powder and our pernil was moist in such a good way not the usual dry, but is some parts fatty i dont mind.\n\nDid come here twice already and I love the alcapurria yuca, better than alcapurria crab meat. Crispier and much better flavor.\nI love their ketchupmayo its got a lil tang, such good portions(for entree), my tostones side wasnt a lot but overall everything fits well and i always have leftover to take."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sa1EyRkVWV0YxYUZSc1EwMU5hV0pvYWswNE5GRRAB",
            "text": "Theirs a new hidden gem 💎 on Staten Island a long awaited authentic Puerto 🇵🇷 Rican cuisine that focuses on flavors of our beautiful island.  Once you are seated you are transported in time ⏲️ the decor atmosphere ✨️ feels like you are in Puerto 🇵🇷 Rico.  I had the pleasure 🙏 to order the chuleta kan kan, it was very flavourful and tender and delicious its a must-have off the menu. Me and my son had a great time, friendly environment Great customer service  5 stars 🌟\n\nCongratulations to my good friends  Sophia, Richard & Al  much success 🙌\n\nChef Billy Jack & Chris Perez"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeFdscDVOVGc0U1RKWE4yZHZVbGhwWDJOVk1VRRAB",
            "text": "Wow what a beautiful place! Being from PR, I'm always on the hunt for authentic food from our island, and this place hit the mark! The mofongo was out of this world and my family loved their dishes (pollo al ajillo) as well!! Friendly service, cute surroundings, salsa in the background!!! I wish you guys so much luck!!! Cant wait to come back!!! Bendiciones!! ❤️🇵🇷"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNGRXSnZTVkpmWWxkR2QwcGtPRVZ6WVVwWlMyYxAB",
            "text": "I visited Borinken Restaurant with a previous reservation with a group of relatives and\nmy experience was sweet and sour. We made a reservation, but they weren't prepared with our table, and the waitress wasn't ready for us on time. we waited a couple of minutes to be seated. The wait time for our entire food order was long it took like 1.5 hrs to be served in our table and they give you a complementary platain soup, but the manager apologized to us because they recently opened the restaurant which is nice. The portion was small for the price."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Rek1IRmFPRU52YUdKcVFqZzVUa1ZKUjJWaGMzYxAB",
            "text": "Absolutely delicious and authentic Puerto Rican food! From the start, they serve a comforting sopa de platano that tastes like it came straight from your abuela’s kitchen, instantly transporting you to La Casita Blanca in San Juan. The alcapurrias were perfectly made—crispy on the outside, tender and flavorful inside. The mofongo and arroz con gandules were seasoned beautifully, but the standout was the pulpo a la parrilla—easily one of the best you’ll find in NYC. Don’t miss their homemade pique for an extra kick! Beyond the food, the warm decor and lively salsa music set the perfect vibe. Finally, a true Puerto Rican destination in Staten Island—I’ll definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214S2MwWlBZWGd0U25OU1YwRXRPRll3TVRodlFVRRAB",
            "text": "Came for drinks and appetizers with the hubby and can say we weren't disappointed! First, let me start with the Lychee Martinis... AMAZING!!! This is my 3rd drink and wish i had taken a picture before taking my sips. 😩😋😍 The food was ON POINT... DELICIOUS!!! 😋 Definitely will be back again and will be telling my friends and coworkers about Boriken as this has been the talk of Staten Island since they opened up!!! 5 STAR FROM US! 👌🏽"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MFkyZ3dVWFpRY0ZKQ01rdEhRMkkxZWtkV00zYxAB",
            "text": "This restaurant is small but full of Puerto Rican energy and a lively Latin music vibe. The staff was very polite, and when I asked a gentleman about outdoor seating, he mentioned it’s coming soon—which I think will really enhance the atmosphere.\n\nMy friend had made a 6 PM reservation, but unfortunately, we didn’t receive our food until around 7:30pm. I started with an alcapurria, which was overcooked, dry, and lacking flavor. However, my main meal was absolutely delicious and packed with flavor, which made up for the appetizer.\n\nI had booked a reservation weeks in advance which happen to fall on the following day with different friends, but I decided to cancel since my other friend surprised me by bringing me here during my visit. With the long wait for food, I didn’t want to risk being disappointed.\n\nThat said, they are still new and clearly getting situated, so I’m giving them grace for the slow service. I do recommend giving them a try, and I’ll definitely be back to see how things improve as they get more established.\n\nThank you, Boriken, for bringing authentic Puerto Rican cuisine to Staten Island!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWVJuUkNhVm96Y1hKalVFMWxSVEJSU0UxaExXYxAB",
            "text": "We went for my wife birthday  … we greeted as soon as we walked in she was very nice and personable… we were seated within 5 mina they brought us out a plantain siup that was so delicious our daughter slurpped up… the appetizers were on point… the bacalitos , pastrl and aculparia were excellent it been long time i hadnt enjoyed those items and they took me back to my childhood … my wife had the mofungo  and i got pernil i could have eaten two plates almost did as my daiughter got the same and waas way too much for her …. My wife enjoyed the mofungo and the leechee martinez  drink she had … overall it was good experience love the decor very authentic puerto rican feel .. would definitely recommend as well as revisit"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQk9VOW5TRlJGY1c5NVowUlJiRmgyYW5KaFNrRRAB",
            "text": "I finally made it to Boriken and it did not disappoint. I had the chuleta Kan Kan with rice and beans and it straight up tasted like food from la isla  it brought me right back. The pork was perfectly crispy on the outside and juicy on the inside, and the rice and beans were full of flavor, just like abuela used to make.\n\nThe portions were generous, the staff was warm and welcoming, and the whole place had that cozy, familiar vibe. Would 100% recommend this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVFltVkJWMVJ5YkhwM2RWQkVRMWRHTUROaU1rRRAB",
            "text": "This small cozy place has the best Puerto Rican food I've ever tasted. Ive been to several places where the food was OK. I came to this place to compare the food at Lola's in Puerto Rico to the food served here. I travel to PR every year. Have been to many Puerto rican restaurants in Dorado and the food is absolutely delish. This restaurant has the makings of a real Puerto Rican menu.  The food is absolutely delicious and yes.... its the best restaurant if you want to taste a Puerto rican dish. .The servers were very nice and professional. I rate this place 5 stars! Thank you to the owner and family who finally got the same quality food served like my Puerto Rico."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTFVHcFNNbVZHU2tGSGRqVXpPRU42YjFOb1YyYxAB",
            "text": "Went there to see what the hype is all about.  I was there super early so I waited outside until I was close to my reservation time. There were several tables unoccupied which I didn't understand the wait.  People reserved for 2 had better seats. I didn't know the place was bigger either,  when I called yesterday I wasn't offered a table in the back.  I was told several items from the menu were already out and it was at 6pm I was surprised.  I ordered the alcapurria de jueyes.  It tasted crispy thin of the masa and the jueyes was white not like how they make it in PR.  I ordered the chuleta kan kan with arroz con gandules.  They gave me a small portion of rice,  the.  pork chop was very hard to cut, dry and no flavor.  The arroz con gandules wasn't all that flavorful either. The hostess was nice, the server wasn't too knowledgeable regarding the menu or made any recommendations.  The chair i sat on was wobbling cause of the uneven tiles.  Place was clean but didn't see any decorations unless I went further in the restaurant.  I'll may go to Kiosko 787 and order something different I'm not sure."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preU1rRXRXR1JKUkVwU1RUTkhhRWxhZG1GUllXYxAB",
            "text": "My husband and I enjoyed the food and dessert. As an appetizer we had alcapurria de guineo. My husband had the Chuleta Kan Kan and I had the Bistec encebollado. We shared maduros and tostones. For dessert we had tres leches. Everything was delicious. The service was also great. We would recommend to our family and friends and return for another date night."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaVVYVjFUakJKTW1KdmJXWjBPVlZwTmt4U1gxRRAB",
            "text": "We visited opening day and were excited. Unfortunately, it was not a pleasant experience. The food took over an hour to get prepared. I wouldn’t mind the wait if the food would have been on point. The rice was cold and undercooked, the steak with onions was not seasoned properly and had little taste. The tostones were not cooked right- burned outside but not cooked inside. The beans were tasty. The waitress didn’t even know what a pana is- lol. I was born and raised in PR so I can tell you this food was very disappointing. The alcapurrias were nasty and lacked the filling. I wouldn’t recommend this place- you are better off driving into the City- go to Adele’s. And the owners didn’t once ask how things were!!! Poor service and food no good. Sad"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acFVWaE9OVGh6WTFKcVUzTkpPVkZTTldkdFRuYxAB",
            "text": "Great spot. Felt cozy in the front. Bigger back room and further back is outside dining as well . Friendly and helpful staff. Tropical drinks and delicious food. Made me fell like I was sinking my feet in the beautiful and warm sands of Puerto Rico."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNWMySnhXbEE1Wm10TkxXRkZlblkyUzBKMFNGRRAB",
            "text": "As soon as I walked inside, I felt like I was home with my abuela (grandmother) in Puerto Rico. The textures, fabric, lighting & aroma provides an intimate experience with excellence customer service. If you never have been to Puerto Rico or tasted the island’s unique & exquisite cuisine, you definitely came to the right place! The staff sat with me and actually had a conversation about life! Now, that’s a place where you can build new relationships, memories and a community of culture."
        }
    ],
    "reviews_count": 55
}