{
    "name": "Griff's Place",
    "place_id": "ChIJsxDGJ0hJwokRkd8lwFeA7VY",
    "grid": "SI2",
    "address": "702 New Dorp Ln, Staten Island, NY 10306, USA",
    "rating": 4.6,
    "user_ratings_total": 470,
    "phone_number": "(718) 668-2645",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbGJrY3pTMmxYU0RCVVNFUXlXV2hvYVZSUlQzYxAB",
            "text": "Devin was the best bartender this is the second time I have come here he always accommodates all of my groups needs thank you Dev!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTVpURTJRekpJTmxwRk4ycElibUZaTlVwdVdVRRAB",
            "text": "Best place ever"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bU55MDFkekZ2WTIwd1NqWmFYM1pTVlU1dU5HYxAB",
            "text": "Amazing service, the best food"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMU0U0ZkNUeXY3OGFREAE",
            "text": "Go to spot for good food. A staple in the neighborhood for years. Burgers on point...steak delicious..good prices too"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOcmxpdGV1eU03REFnEAE",
            "text": "Good daily specials and great drinks 🍸.  Griff and the lady's behind the bar will take care of you."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPSzYwb1hndC1fSDd3RRAB",
            "text": "Great burgers and friendly wait staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMREprcm5GaHFLdW9nRRAB",
            "text": "Some people claim they have the best burgers on the island - they don't! They're just enormous. They lack flavor, seasoning, spices, etc and my medium burger was well done! They also messed up our check and gave us someone else's check...twice! Gotta make sure and read before paying otherwise you'd pay for other people's food. 😒🤦🏼‍♀️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNdWR0NmZlbzZ6YWF3EAE",
            "text": "Went there yesterday for dinner n the seafood fri diavlo was a special so we figured we try it .. it was horrible.. sauce was brown not even red .. one of the fishes in it had to b bad .. I get that everywhere and I can’t lie it was the worst I ever had .. didn’t even eat it n they didn’t even ask why just took it .. it was very fishy which it shouldn’t be .. no spice which is what it was supposed to b n it was disgusting 🤮  the Ruben was ok but no thousand island dressing on it .. n I paid 100 for a Rueben that was 15 everywhere , the nastiest seafood I Eva had n a hot dog kids meal ..food definitely ain’t like it used to b …"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX2FyOHFRRRAB",
            "text": "I have been coming here for years and never left a review. This is the place to be. Not your typical bar, the food is hands down the absolute best with the most flavor. You are treated like family here. The bartenders are always friendly, Bobby Phil & Ronnie are the best!!!!! So are the waiters, Frankie & Maryanne. The owners Griff & his son Devin run the best establishment on Staten Island. Love them all!!! An absolute gem, I hope Griffs stays open for 100 years!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJa2Zmb3hRRRAB",
            "text": "Never was here before, and my father-in-law brought us out for some food and drinks. We were blown away by the food. The steak dinners were absolutely amazing and I can honestly say they live up to any good steakhouse you can think of if not better, their burgers were huge And offered a wide variety of toppings and bun types. The drinks were cold and the atmosphere was very upbeat and positive there’s not one negative thing I can think of to say about this place and I highly recommend it to anybody that’s looking for a great steak.  Better than the Westshore Inn hands-down."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbHJUdHlBRRAB",
            "text": "4 Stars"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bDRXQU1BEAE",
            "text": "I love Griffs place, perfect for any occasion. The baconoator, chefs kiss"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cXF2bWxRRRAB",
            "text": "Sports bar, service was friendly and efficient, food well.prepared, portions huge..had the crabcake which was the size of a pancake.  Full bar."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneW9QLUl3EAE",
            "text": "This is the best bar! The food is phenomenal, the ribeye steak is always cooked to perfection, and the cordon blu appy is a must have! Every single staff member is awesome and so helpful!\n\nI love coming here"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBamVxeVRnEAE",
            "text": "Yes it's a bar n unique n say tje food is top notch staten island untold secret it's old school n I promise hands down order there steaks the rib eye is a monster n promise in no way can finish it in one sitting n have plenty of great left over smiles the next day!! Most of all won't get ripped off n comes with alot of sides compared to other places who charge extra for a side !! Service always a pleasure"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfX19LMEp3EAE",
            "text": "The steak set to die for"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdXAybld3EAE",
            "text": "This place is amazing I can't just recommend one thing everything I had was amazing go try for yourself!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdE5fTm1BRRAB",
            "text": "Went in there tonight and the bar was flooded with kids drinking at least 100 of them with fake ids and they are stupid enough to be talking about what high school they go to most of them go to Farrell and tottenvill  so parent be ware this bar is getting your kids drunk cops were called and reports were made also reaching out to the BBB"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdHZDZUhREAE",
            "text": "Great local place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cWUySExnEAE",
            "text": "Great food"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbnQyZTN3RRAB",
            "text": "Great place to enjoy with fr!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeGIyZXF3RRAB",
            "text": "Great"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcGNYM25nRRAB",
            "text": "Great sports bar. Large menu and portions. Owner super friendly and so is the crowd. Even the parents with kids are nice ( but nerve wracking to keep the rambunctious one in his chair LOL). Prices very reasonable!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubUlfMGxnRRAB",
            "text": "Went there for an early dinner on a weekday.  Nice little place.  Atmosphere was very friendly.  Food was delicious!  Service was excellent!!!  Server was very friendly, fast, and efficient!!!  Will be back to try other items on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuN3NpR21RRRAB",
            "text": "Walking  into this place on a random night I did not expect to have the experience I had. Devin the bartender was knowledgeable, related to anything I could think of.  As a blue collar worker getting off work on off hours in need of a space to unwind I found Griff’s,  with quick draw live and thriving, bar games played by locals and an overall atmosphere that speaks come in you are welcome here anytime. Culmination in full delivered by Devin. For sure will come again!! Can’t wait to try the food one day as it has been spoken of an experience in of itself."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybzdTLVpnEAE",
            "text": "Food is delicious, the service however is not enough, you can see them all angry and overwhelmed, the owner needs a couple of more people for service, especially on a Friday night it's a mad house and there's only 2 people serving the whole place. Great place otherwise."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNXN5djV3RRAB",
            "text": "Food is great here, and the staff is always top-notch.  I highly recommend this place for a good meal and some cold suds."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MWNfdDl3RRAB",
            "text": "Great atmosphere, burgers are great and huge\nChilliwas the best"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkOU1LMnJBRRAB",
            "text": "Great food, great service, and real great people 🤘 love this bar!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0M0llWVB3EAE",
            "text": "You can not get a better Ribeye steak 😋 on the Island,  but it's a neighborhood bar with sports on the TV's an it's loud there"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxb3VQcG9BRRAB",
            "text": "Food was great, loved the pork chops\n,"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxOUxpdThnRRAB",
            "text": "Had a fantastic evening at Griff's last night. Great food and wonderful staff. Thank you, Lisa for your warm hearted hospitality. ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaGZIR3VRRRAB",
            "text": "First time there, heard good reviews by several acquaintances. The critics weren't wrong. Food was tasty and cooked correctly. Portions are substantial and prices are still reasonable given current economic conditions. There are new prices projections for almost every facit of  the economy now. Griffs pricing just keeping with the changing times. Very happy with presentation and will return to sample other items offered. Too much to try in one sitting. Lol 😂  well done 👍!!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaDVEVld3EAE",
            "text": "Amazing food. The steak was better then any top rated steak house on staten island.  I'm going back to try the rest of there food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCby1MdW9BRRAB",
            "text": "Surprisingly enjoyed this place.\n\nThank you Lisa for serving us you were so nice and friendly :) I’d love to come back again because of it and the food are tasty!\n\nI pass by this place thinking it’s not for kids since it looked like a bar.\n\nBut saw a comment recently that it has kids menu so thinking to come back again with kids :) looks like there’s more good food to try 🥳"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcUtpNEJREAE",
            "text": "From the outside Griff's Place looks like an ordinary neighborhood bar. It's off the beaten path so it's easy to drive by. Don't, you'll be missing out. Big time.\nThe food is excellent. We ordered 3 appetizers for the table, hot wings, potato skins & fried ravioli. I'm not a hot wings guy but the others were very tasty. Had the stuffed shells as a main course, sometimes risky in a bar, but they were top notch. Other main courses were a Chicken Cordon Bleu wrap, a burger, & Broccoli Rabe Quesadilla. The steak is said to be outrageous!!\n\nThe Atmosphere was super, & Frank, our server was both friendly and informative. Give them a shot, I think you will be very pleased."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1X2Jqb1BnEAE",
            "text": "Had a wonderful meal there with my girlfriend. I got around to trying their famous burger and it was absolutely delicious. Highly recommend people to go there and try it. Along with the dessert, which was a chocolate peanut butter pie. Great atmosphere and energy because the Giants were playing. Marianne and Christian were very accommodating and friendly. Phil made good drink as well."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSa3FLQU93EAE",
            "text": "Best hamburger I've ever had. Amazing food and tons of choices. Cute, chill atmosphere if you're on a date or just hanging with friends. Definitely would recommend to anyone. The bar also stays open until 5am and the bartenders are so friendly and awesome."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMDhUeFhBEAE",
            "text": "Took the ferry to Staten Island to go for a bike ride along the FDR Boardwalk and Beach. Decided to look for somewhere bike friendly to get something to eat. A quick check of Google maps and I found Griff's Place in New Dorp. It was a short ride from the beach bike path and had a back patio where I could park my bike.\nAll I can say is 'Wow, what a find'.\nWent inside and I was greeted by welcoming staff and the owner sitting at the end of the bar on a quiet Saturday afternoon. I ordered a cheeseburger and a beer and the owner chuckled. I asked what was funny and all he said was \"you'll see when you get the burger and good luck riding back to the ferry.\"\nWell, the burger arrived and I saw why he was laughing. It was huge! With that he laughed again and bought me a fresh beer. The burger was absolutely delicious, the beers were cold and the staff and a few regulars were chatty and friendly.\nI did finish my burger out of respect and I did manage to ride back to the ferry to get home. I also found a nice place to stop for a bite and a beer on an afternoon bike ride along the beach on Staten Island. I will return to Griff's the next time I am riding my bike in that stretch of NYC."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaE4ycGNBEAE",
            "text": "I have no words for Griff's except: Sensational! The Food quality and quantity for the price is remarkable!\nIt is a Must try!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHb1p1R1dnEAE",
            "text": "If your looking for a Great burger & the skirt steak sandwich was awesome.. gonna have to go back soon I heard the ribeye is amazing!!!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3bkxPd3R3RRAB",
            "text": "Great place to watch a NBA game. Food is delicious and came fast. Mike it running and doing every table. But still is friendly and does a great service. Definitely will come back here. Kinda missed the music tho"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJajZmYzFBRRAB",
            "text": "For a bar with really good food at a fair price, fantastic."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwc3J5cnNnRRAB",
            "text": "The burger is tremendous!  Perfect meal.  The waitress was not only funny but extremely helpful picking off the menu.  Small outside area to sit out back and nice interior with a pool table in the back.  Highly recommend stopping in here if in the area."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzOE1iQ1Z3EAE",
            "text": "Great steaks. BEST French onion soup."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNveGMzVWl3RRAB",
            "text": "The food is outstanding....and the staff so very friendly great place to unwind and have a great time. Definitely will come back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRODZ1ZDRRRRAB",
            "text": "I personally like the atmosphere here. Great drinks, awesome food, & the workers are always friendly. There's a small pool table & a digital jukebox to play your songs. There's an outdoor area to sit & eat, drink, or socialize. This place…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHcjVLQXhnRRAB",
            "text": "Great food and the place is festive& fun"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNi1EYVdREAE",
            "text": "Went in on Valentine’s Day with girlfriend and sat at a table. The bartender was serving drinks to some patrons. No one greeted us, no one stopped at the table with a menu. Fifteen minutes after sitting at the table with no menu I looked to…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMmVtTl9BRRAB",
            "text": "First time here. Burger and service was great. Will be back to try the steak"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1NkthWnF3RRAB",
            "text": "Attempted to eat here twice, both times waited over 7 minutes to even be greeted. Legitimately two songs passed. Felt invisible. Must be because I’m too dark, young, or not a cop. Do better."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyc3BtT3hRRRAB",
            "text": "Absolutely one of the best steak dinners we ever had ribeye with fried onions was AMAZING! cool neighborhood vibe. Totally unexpected how good all the food was. We heard it was good but it was amazingly good. We came on a weekday therewasnt…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldWRyemt3RRAB",
            "text": "I walked by with my kids in the stroller and we decided to try the food from them. So happy to see they had a kids menu too. We ordered a cheese steak along side a kids meal of hot dogs and fries. The cheesesteak was so delicious. Better then ones from the famous Philly cheesesteaks everyone raves about."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZMVpuYUNREAE",
            "text": "The atmosphere here is great and staff were extremely nice. The food here was okay, pretty mediocre. There is a cool wing challenge where you can win an alcoholic drink if you finish hot wings by yourself. There was also a cute costume theme event for Halloween. This is an extremely popular place that people love."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOWNHd1RREAE",
            "text": "Old reliable. It doesn't get better than this for your local watering hole. Food is much better than you would expect and portions are GENEROUS. Most of the staff has been here for years, and the vibe is good. GO HERE for low-key good food and good drinks. You won't regret it."
        }
    ],
    "reviews_count": 55
}