{
    "name": "South Fin Grill",
    "place_id": "ChIJMyD2axhPwokR1ii-S0XaIWs",
    "grid": "SI2",
    "address": "300 Father Capodanno Blvd, Staten Island, NY 10305, USA",
    "rating": 3.8,
    "user_ratings_total": 523,
    "phone_number": "(516) 744-3862",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTGNtc3pXR1p6VkZsRlQxVm9XRU5OZDB4T04xRRAB",
            "text": "limited menu, a little disappointed in how small it was. no specials. servers were excellent.  pretty restaurant.  this evening there was salsa music on the deck, looked like folks were having a great time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMFpIbHNhVmh4VWtoc2MwVjVTVkpaYTFWaVprRRAB",
            "text": "Brittany Felice went above and beyond!\nWe planned a 90th birthday party for my dad.  The weekend of the party my mom had a massive stroke.  We had to cancel the party within 24 hours.\nBrittany service, loyalty, professionalism and compassion never wavered!   It was a full year before my mom recovered.  We planned the dinner party with Brittany again - SHE NEVER LET US LOSE A DIME!!!  The party was completely paid for the year prior!  She applied everything to the dinner - now a 91st birthday.\nI cannot say enough about Brittany - she kept in touch with us, people she didn't know, for an entire year!\nThis took a long time coming, but I am still grateful that there are people like Brittany that truly live commitment to hospitality."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cFZVSXhhMGRuVEUxamRUaGxlazh3UzJKT05uYxAB",
            "text": "Food is good. But they don't have a variety of dishes that consumers can choose. Just a very short selection in its manu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214R1IwUXRTMUZJVHpGM1VXVnNVbFZaYUVGRWFWRRAB",
            "text": "This place lacks good music and vibes.  I have to say that I got ripped off and will never go back again.  I ordered a prosecco and was charged $19 and it was served in a plastic cup and it wasn't even full.  It was La Marca which sells for $15 a bottle!  I frequent nice places and have no problem paying for drinks, this was ridiculous!  I will not spend my money at this place, its the principal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRFNsUTRaWGRoV0VwQlF6Wm5VR0Z2WWkweGNGRRAB",
            "text": "Dined in Saturday evening at a water view table .  Junior, our server was great . We had the baked clams app along with salmon and ribeye entrees . Perfect . To top it off it was Latin night on the deck . Absolutely  a great vibe"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrdE0ycFdaa2hHYW04emRrNTRYMmRxU1hkS1lXYxAB",
            "text": "My 2 stars are only 2 stars because the food itself is decent.  Over the years I had been here for dinner a couple of times, And each time I left disappointed. It had been a while so when my group suggested going there for dinner and drinks afterwards I agreed because I believe in second and third chances.  Firstly we waited 10 minutes for a maître D to even come to the front so we could ask for a table.  We ordered drinks and a bottle of white wine.  When the wine finally came we were told it was warm and the server left it in the ice bucket apparently to cool off?? I mean we didn’t have 30 minutes to cool off a bottle of white wine that should’ve either already been chilled or another option should have been suggested.  So we opened it ourselves and asked for ice, which never came.  After getting a manager he brought us a colder bottle.  Bread took about 40 minutes to come after asking for it three times.  At that point we had finished appetizers and the dirty plates sat there for a good 30 minutes.  Water was not refreshed.  When we finally were able to place our main orders that took a long while and one salad order came about 30 minutes after the rest of us had gotten our meals and we were almost finished eating.\nIf you want to come here come for drinks only and don’t expect too much.  Go somewhere else first for dinner.  Of course the atmosphere is nice because it’s right on the boardwalk but nothing has improved otherwise over the years."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeE9HSlFUalpWY0RKQlVXeDNXRXMzYUZWUVYxRRAB",
            "text": "Lovely time here. And to see the older crowd get wild and crazy was a pleasant surprise!! If return just to party with them in the evening.\n\nOh yeah, service and food, phenomenal. They did have to recook my stead twice but in the end, perfect! Service was great and they handled it so well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQcmZfdnVJejZUOHNnRRAB",
            "text": "food unfortunate....beautiful place . very kind servers."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZkJrTzNYNGVhdVV3EAE",
            "text": "Came for Mother’s Day and South Fin received my mom’s stamps of approval and she is a big restaurant critic. The food was great, place was clean, excellent view, and the staff were great. I would recommend this place. It is not 3.8 stars it is def better."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLeXBxN3pEMmV2M2NREAE",
            "text": "Made Mother’s Day reservations for my family. Food & drinks were great! My server Samiera was amazing! Very friendly atmosphere"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLLXQtcUdhemVxMDh3RRAB",
            "text": "Went to eat with my mom today for mothers. Day. Samiera was our server. She was. Absolutely amazing. Very attentive and very sweet. The food was delicious my mom was so happy and the drinks were. Great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNSHJoci1MOXVpVjRRRRAB",
            "text": "Absolutely horrible horrible horrible!!! Overbooked on Mother’s Day. The manager Sim just kept lying to people on wait. The hostess at the desks were so rude. They were frustrated and instead of giving great customer service. They continued to take it out on the patrons. People continued to walk out not because of the wait. But because of the lack of professionalism. DO NOT COME HERE!!"
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VORHhqTHlqajVpX0dBEAE",
            "text": "Cocktails excellents, wings incroyables et température juste ce qu il faut. Serveurs agréables et souriants, un sans faute, la première depuis notre venue à New York"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveTktb0t3EAE",
            "text": "Love it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOU5IQ0pnEAE",
            "text": "I ate there today Sept 1 with 2 others and we had the Seafood Tower. It was horrible and we told the manager Jose. The tower was $119.00. This is the next to the last day they are open for the summer and the seafood was horrible. We asked for a significant discount and they gave us $25% and we go there almost every Sunday in the summer. I was very disappointed. View of the ocean is great but I don’t pay for the view. Very disappointed and will not be seeing us again .Too bad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ai16dERnEAE",
            "text": "Amazing food, great view, great drinks, and very friendly staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NXBlWkRnEAE",
            "text": "Beautiful views from inside on beachfront."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3OEo3SXNBRRAB",
            "text": "The food was absolutely delicious. The steak was perfectly cooked and incredibly juicy.\nMy favorite was the salmon very flavorful and moist\nOn weekends at night, they have a live DJ, which was a great time. Definitely a nice crowd and afterwards you get to walk the boardwalk there’s nothing better definitely recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNienBETHBnRRAB",
            "text": "Service was terrible and so was the food. We have given them ten chances but today was the worst. Wow. They brought us someone else’s food and we even said. ITS NOT OURS but they don’t speak English so it was left there for 30 min. The…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOXBYOW1nRRAB",
            "text": "Fantastic views and atmosphere, even better food and service! Whether dining a la carte, everything is always top-notch!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMC0tdk9BEAE",
            "text": "Food sucks as well as service! Never again!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKLUlTM2NnEAE",
            "text": "They must hire more bartenders,waited 25minutes to get a drink,along with everyone else .4 Bartenders to serve a packed house on a Friday night .Also may I add no busbuys to clean up the empty cups all over the place all night long .Maybe they should start with hiring a new manager !🤔"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyX0lPU3R3RRAB",
            "text": "Horrible place. Service is the worst. The wait staff is terrible,  un polished , and lacks customer focus. The food was average, with no flavor. And they use very cheap ingredients. The shrimp were good and the calamari. Raw clams were not fresh. We asked for butter to dip our lobster in , and they brought out CORN OIL. It was not butter. The pasta had zero flavor. The best thing was the view that is it. This place was great before the pandemic. Now it's the pits. $ 35.00 for a dozen clams on the half shell, are you NUTS!! Every other seafood restaurant on staten Island charges around 22-24.\nWe shared our Diner one surf and turf and one south fin pasta with seafood. Where did you get your wait staff?? They have zero common sense. Small wine selection. $295.00 for two. I'd it was good who cares but when it is bad, sad very sad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyM1BMZjVnRRAB",
            "text": "Too bad, all the cold shrimps are bad, not fresh, I will never come again, please don't come"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMX1pLMzFRRRAB",
            "text": "Undercooked chicken, long wait between courses and very noisy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMc2ZQellnEAE",
            "text": "Your Staff is lovely. I was there on a wednesday evening and their were 2 waiters responsible for the whole restaurant. They didn't have time to take the dirty dishes from the tables where the dishes remained. Your food was delicious. You really should hire more Staff to get the restaurant in shape so your patrons don't have to view dirty dishes on the table. The ambiance really is lovely but you have to get the dirty dishes off the table."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMM0pqYkJnEAE",
            "text": "Nice atmosphere, but young, inexperienced staff. Drinks are too pricey."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdFBfWlVnEAE",
            "text": "I had a reservation for 5:30 and came in at 4:30 because I was walking on the boardwalk. All the bathrooms on the boardwalk were out of order so I asked if my 8 yr old son can use the restroom before my set time. The hostess looked me up and down and said no. I was shocked and very upset. I cancelled my reservation right away. The food isn't even that good. I just happened to be in the area relaxing by the beach. That's a terrible way to treat your customers. I'm a huge restauranter and foodie, had planned to have a few drinks at South fin over the summer but not anymore. Not getting my hard working money! I'll always remember this and I'll be telling others about my experience. Treating a kid like that?\nRestaurants you should try..\nBaci, Blue, Violets Cellar, 286 South,\nSkinos near Wall Street*"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdnJDT3NnRRAB",
            "text": "Service was extremely slow.\n\nThe chowder soup came with a piece of “skin” on top (because it was sitting somewhere before it was served), we had to return it.\n\nBeer was in room temperature (waited too long).\n\nThere was a hidden fee - 18% deck fee when the bill came but it was never communicated with us before."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdmFmSkpBEAE",
            "text": "Friday night, first night of summer nights was an absolute nightmare. We had a 7:30 reservation. 8:30, still no water or cocktails. Apps came out, no utensils or napkins. Waiting and waiting, we ate the baked clams with a spoon from our dip, and they were cold already. I went into the bar to get our first drinks from an hour ago. Only 2 bartenders inside. Our meals come, still no utensils or napkins. Our poor waiter had nobody to help him and was running all night. They need busboys and/or runners. We ask for another drink: no more blueberry mojito, I get a coconut one. Upon finishing it, I ask for another. A half hour passes, waiter said no more mint. I heard others saying the bar ran out of many types of alcohol. Extremely unorganized, and food isn’t even that good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqc3ViR093EAE",
            "text": "My husband and I celebrated our 50th wedding anniversary at The South Fin Grill on April 27th. We couldn’t have chosen s better place. From the moment we met Brittany the coordinator, we knew it was the perfect venue. The food selection was delicious and plentiful. The servers and bartender were fabulous and the ambiance of seeing the ocean made it even more special. Brittany made our special day go so smooth. She was there from the start of the party until the end. She was wonderful. We definitely recommend having a party there. We will be back for many dinners at The South Fin Grill…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOE03a25RRRAB",
            "text": "The fold was exquisite.  My wife enjoyed her surf and turf and i the flank steak.  (Medium rare)  cooked to perfection. The sautéed spinach was a treat and the fruit salads as well. The desserts ate so delicious as  well. Shrimp cocktail for an appetizer was also a treat. The horse radish always pairs well"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOFpDM05BEAE",
            "text": "I have celebrated 3 milestone parties at South Fin and the Vanderbilt. Brittany, Michelle and Amanda are amazing. They helped make the planning and day of organizing smooth. I continue to choose these venues to celebrate with because of the attention to detail, ambiance and delicious food. Every party I have thrown has been wonderful and enjoyable for the guests! The team is extremely accommodating and thoughtful. If I could give them 10 stars, I would!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad2FTSkZnEAE",
            "text": "👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOHFxQ0dnEAE",
            "text": "Amazing food and great staff! Cant wait for it to open again for the season. The chicken sandwhich was excellent"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadUtxY2N3EAE",
            "text": "Customer service was good, the foodand drinks was hhhmmmmm GOOD 👍👍👍👍👍👍👍."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabUlmbkRREAE",
            "text": "Great food."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaUtuSzRRRRAB",
            "text": "A friend of mine was in town so we decided to do a girl’s night dinner at South Fin Grill. It was pretty empty, but there were a fairly small amount of diners. Mature crowd. We came on a Wednesday evening in July. We opted for outdoor seating. The outdoor seating is enclosed with retractable tarps. There are ceiling fans, so even though we came on one of the hottest evenings of the summer, outdoor dining was very comfortable.  The view is gorgeous! Service was great. Ambiance of the restaurant was impeccable. Prices were decent. I’ll be definitely come back again.  Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcmRmYUVnEAE",
            "text": "Food wasn't to my expectations might have been me. Menu seemed very average and limited."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcHJMTUJnEAE",
            "text": "A great place to eat and the food was great.  We also had a great time."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyX01iWmZBEAE",
            "text": "Not very impressed with this place. To start off the food was not very good. The food was either drenched in butter and oil or covered in salt. The soup was cold and the seafood was not fresh. The waiter was not very friendly and would disappear for 30 min at a time. Overall, I would not come back here. The only reason I’m giving 2 stars instead of one is that the other staff members were very friendly and were able to give me a table without a reservation."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhbkkzTHFnRRAB",
            "text": "The food was DELICIOUS. Luis was our waiter who was super friendly, personable, and attentive. We loved his charisma. For drinks we had a glass of Prosecco. For appetizer we had the spinach artichoke dip and grilled chicken Caesar salad. For entree we had the Pan Seared Salmon with Red cabbage and Mashed potatoes, and Ribeye steak (medium well) with Grilled onions and Mashed potatoes.  That was was everything!!! The ambience was super chilled with the neon lights and cozy sitting indoors. Every Friday and Saturday after 8 pm, you are able to see fireworks at the beachfront from the restaurant. The DJ wasn’t there tonight to play but usually the DJ is there especially on weekends to play and slay!!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZdjgzWFFREAE",
            "text": "Beautiful restaurant on the boardwalk in a great location if you love the beach. Our service could definitely have been better, but maybe they were short staffed because it was Memorial Day. Our mussels appetizer tasted too fishy although they looked very fresh. We ate half y them and left the rest. I ordered a pasta with marinara that needed more sauce, but the waiter was never around when we needed him. My husband ordered an arugula salad that was on the small side, small plate made it look bigger, with shrimp, he never got the shrimp on it. We really liked the place itself and hope the manager sees my review to address these issues for future custom."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NnR1X1RnEAE",
            "text": "We went for our one year anniversary. Gorgeous view of the bay and nice indoor and outdoor seating. The bartenders were very welcoming and accommodating to me and my partner’s requests!! Wonderful drinks and a well priced menus for a nice artisanal dinner. The burrata was my favorite dish we had there but we also had the scampi linguini and the Scottish salmon which were both absolutely divine! Thank you to all the staff who made our anniversary memorable and fun🫶"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeFlmN0J3EAE",
            "text": "I loved the food here and the management is really friendly. I saw him going to tables asking how they were doing. Class act.\n\nThis place is classy, too. They have a dress code for dinner....so don't expect to walk in this place at 5pm in shorthand sandals. Business casual works better at night.\n\nThe view in this restaurant is wonderful, too.\n\nThe one downside to this place is the cost.\nBut I assume this restaurant doesn't stay busy in winter."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwb082MTh3RRAB",
            "text": "This place is actually worth it (I’m gonna say the entire thing are superb from customer welcoming  to food) calming atmosphere highly rated now (I can highly recommend for food would be only. My fav here are ‘white creamy Spanish mushroom pasta’ , fish sandwich , must have to try these .drink I love pink lemonade (recommended specially for Mediterranean ). Have a great beach view must check prices also before u go this place cuz its quite expensive was for new customers depending on what would u like to eat but I’m gonna say this place is worthy.💯😋👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaFlxMFpREAE",
            "text": "First time at the South Fin Grill yesterday and it was amazing. Warm and friendly welcome by the staff as we entered. We sat outside and enjoyed the view. Our waitress was Sophia M and from the moment we sat down everything was perfect. She was so friendly and professional and explained everything in detail. We started with the  crackling calamari which was tender and very tasty. For our main course we had the Braised Pork Ragu which was delicious. For dessert we split the brownie with vanilla ice cream\nGood selection of wines (a bit pricey though).  Overall a great experience and I’ll definitely go back."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRd1lHXzVRRRAB",
            "text": "I would give this place ZERO stars, but Google doesn't allow it. To begin drinks took 20 min, obviously because they were switching waiters while we waited. A woman took our drink order and the most unintelligent man took her place.\n\nI'm a born and bred true Brooklynite so I speak loudly. Yet this waiter was unable to hear me, perhaps if he paid attention he would have heard me. I had to ask for my water to be refilled and plates to be removed off my table.\n\nMy entree was inedible. I was SUPPOSED to get a 1.25 # lobster. And recieved a 0.5# rubber dish with roe. The waiter was aware of this as he brought me a bowl of sauce \"because the lobster is clearly dry\". I explained it was inedible and the roe needs to be removed and I would like a new dish. He had the hostess bring me back THE SAME plate covered in sauce! Are you serious?!\nI then sent the plate back a second time and asked for the check. After waiting for 10 min while this fool is apologizing to the table behind me for their drinks not being ready; I had to walk to the front and ask for my check!\nThen the hostess had the nerve to tell me that she did me the favor of removing the inedible meal! You better have. Then told me she looked at my plate and made the cook staff aware that they should not send out inedible meals. How does that help me now?! Its 9pm on a Sunday and I'm still hungry, out $130 bucks and no where is open!\n\nSTAY AWAY IF YOU ARE HUNGRY.\n\nSide note: they will serve you, until you are unable to stand as proven by the drunk woman rolling around in the grass outside. At least she had a good night!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURreS1MeWV3EAE",
            "text": "Amazing view & location. We loved having dinner right by the beach, Nicole, our waitress was so nice & helpful, the manager was very welcoming & helped quickly resolve the minor issue we had. The raw bar is very fresh & the Papardelle pasta was very tasty. The red snapper wasn't that great though, and its side, the \"forbidden rice\" doesn't really taste like rice at all, may be some sort of burghol,so you might want to try something else for the money you'll pay! Overall, beautiful place, very upbeat during the summer, if you want to stay by the bar & the music, but you can also enjoy a quite romantic dinner on the other side by the beach, we're definitely coming back!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3Z0xibVJBEAE",
            "text": "I’ve been here many times, each time the story is the same. Great food, good drinks, unreasonably long wait for EVERYTHING. Tonight, for instance, we waited 30 min for someone to pick up our credit cards and let us GO!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVbXUtU1pnEAE",
            "text": "Food were ok, drinks were amazing!! Service was great but not professional enough"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBLWQ2ZkR3EAE",
            "text": "Wonderful place for a night cap and delicious desserts on a warm summer evening.  We sat at the outdoor terrace and enjoyed the chocolate fondue and expresso creme brulee washed down with excellent Irish coffee.  Great location to work off…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxeHRqVUtBEAE",
            "text": "I was here for my sister in law’s wedding snd the venue was beautiful. The staff was very attentive and friendly. I would definitely visit again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBeVlXSUFREAE",
            "text": "The food was much better than the last time I was here.  The service is horrible.  The waitstaff needs to be trained.  The view of the Verrazano is beautiful"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncDdDY2p3RRAB",
            "text": "Held a birthday private event here for 25 people including 5 little kids. It was on an afternoon on the weekend. It was wheelchair-accessible for my family. Great service: the event coordinator that attended to my regular questions days ahead of time was reachable and responsive; the floor manager & waitress were attentive, patient & friendly. I asked for a table just for the kids and they arranged it. The food was great. The chef even came out to greet my party and ask how the food was. I was impressed with this place. Was able to have a table display for 3 cakes and a picture collage that guests can write their messages. The staff provided a table cover for that display. Music was great-light, with a mix of jazz and dance. I chose this place because I liked the setting-on a boardwalk with a view of the beach, high ceilings-something I a particularly like for venues, and with colored lighting. I would return in the future."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyeGZMZTZRRRAB",
            "text": "I had a great dinner and experience at South Fin Grill the other night. The menu has an awesome selection to choose from. My favorite dish of the night was their Thai steak salad. Such a unique and tasty dish with great flavor. The steak…"
        },
        {
            "date": "수정일: 9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnb1lfQ0lnEAE",
            "text": "Practically everything about the restaurant was fantastic. The food is delectable and well prepared. The layout with two bars inside and out on the boardwalk provide the views. Djs spin good freestyle and disco music on the weekends, plenty…"
        }
    ],
    "reviews_count": 57
}