{
    "name": "The Manor",
    "place_id": "ChIJ22lI-5xOwokRy7IUlY1H1dw",
    "grid": "SI2",
    "address": "917 Manor Rd, Staten Island, NY 10314, USA",
    "rating": 4.5,
    "user_ratings_total": 525,
    "phone_number": "(718) 698-4433",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTWRucFRPRWRGTkdSWFEzaFljWEV3VEc4MmQyYxAB",
            "text": "Our bartender was amazing.  She works lunch time during the week. The food tastes so much better when the staff is so engaging."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMFJHMXFiRmN6ZURWaE1rUXRXSEJsYzFaSFkxRRAB",
            "text": "This place is absolutely amazing from friendly staff to amazing food. I can not say enough good things"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNFkxRXdPSEJNZEY5clYyRm9jM0pPZDBWek9IYxAB",
            "text": "Ok place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oalRYUlRSSEo0UWpGQ1RrZFlaR1JzWDJoTU0yYxAB",
            "text": "Everything was great.\nJust that there is no parking.\nI you invite 25 or 30  or 50. people that’s going to be a problem. I got there one hour ahead and had to park in Walgreens parking. After purchasing something there."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSE0yMUZabTV0V0hOc01USk1jMlpLYVZBMGIxRRAB",
            "text": "Great food reasonably priced. Nice atmosphere. It was just a little loud. There's nothing to absorb the noise."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWGFXOVlla3BRWW1KVFVpMXBSVEkwZVRSVVJrRRAB",
            "text": "Had a great lunch today! My thanks to the exceptional service received by Eddy, ..fabulous. cocktails, delicious food.. beautiful environment, friendly service. People..! Ty. see you soon!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbGF6QTRSbDh0ZDB3d1ZGOXVOR3hzUms0eWVFRRAB",
            "text": "Love, love, love The Manor. If you want a nice, sit-down dinner, some quick apps, or just some pizza, The Manor has it all. The food is delicious, the portions are huge and the price is fair. The staff is extremely friendly and helpful. The atmosphere makes everyone feel at home. The Manor is a family favorite!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NVNFWlVOMEV5TkZsR1pVNU1SV294UVc1bVduYxAB",
            "text": "We had a school reunion here. About 30 peeps, the service and yummy trays of food was flowing all night. The bar made gr8 dronks. Music not too loud.  Perfect."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQM3U0NzdibnF6ZmZnEAE",
            "text": "Don't miss the chicken wings as an appetizer."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJV1VvcXFGeWZpc0pREAE",
            "text": "Nice lunch menu.  Attentive service. Quiet."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbWZ1ZFA0bmFlejNnRRAB",
            "text": "My home town bar. It has a great atmosphere and food too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKMlJ4dVRCbjZ2SGtnRRAB",
            "text": "We stumbled upon this place for dinner after a work appointment.  Upon arrival, we were greeted warmly & seated.  Staff was accommodating & attentive. Food came out in a timely fashion.  We had the French onion and beef barley soup.  Tasty - Chicken vodka was full of flavor.  i cheated on my diet and had a cheeseburger.  Delicious.  Fresh, tasty and cooked perfectly!  The bar was upbeat and trendy.  A great find!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dzR2SGd3RRAB",
            "text": "Food is excellent service is friendly, but atmosphere is deafening, people are screaming ."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncUlqNzNBRRAB",
            "text": "Love Manor house and we Love Jen 🩷🍸"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnay1qdHdBRRAB",
            "text": "Sunday Brunch - no flavor to eggs - waitress was great - reasonable pricing but you get what you pay for!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncHM3cmtBRRAB",
            "text": "Great Island find.  Friendly staff.  Good food.  Nice selection."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeFpUb1B3EAE",
            "text": "I can't complain. Food and service were decent. The number of tables could be a little complicated sometimes but I guess you need to get a reservation."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMzhueFBBEAE",
            "text": "Great Restaurant! Food was amazing!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzX1o3d1NREAE",
            "text": "Always delicious. I had a business lunch there and it was perfect. Quiet atmosphere to talk. We had ordered a pizza and a burger. We were both happy. The food was delicious. The service was good. The fresh bread is amazing.\nIt gets livelier at night but the food is always consistently tasty.\nThey were also very accommodating about my dietary restrictions/allergies.\n\nI've been back many times, it's a local hangout and consistently good. Eggplant Parm, arugula salad, French onion soup area all great choices"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMXJUa0FnEAE",
            "text": "We went for a repass and the food was good, very accommodating. The service people were friendly and kind."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMHUzX0FnEAE",
            "text": "Absolutely blown away by The Manor! The octopus appetizer special was the best I've ever had - perfectly cooked and seasoned. And the shrimp parmigiana in vodka sauce dinner special was equally amazing. The service was top-notch, and the atmosphere was cozy and inviting. Can't wait to go back and try more of their delicious food!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeHZUWEJREAE",
            "text": "Great food, great service\nA little noisy sometimes"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhMXZ6VzZRRRAB",
            "text": "The best local spot for dinner and drinks! Make a reservation for the weekend especially."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQza2NiUjBnRRAB",
            "text": "It's a nice cozy place, we had brunch and we really enjoyed it. The price is great for the pre fixed brunch special. The food was really good, parking was kind of tight"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzb1BpUGNREAE",
            "text": "Great place to watch sports"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRX09XU1p3EAE",
            "text": "Great staff owner is always there to greet people. Very friendly atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaUxuSTJBRRAB",
            "text": "Food is delicious and prices are reasonable. Every time i have gone there i was not disapointed. Excellent food and service. Highly approve."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMFpLSGJREAE",
            "text": "Always a good meal at The Manor. The staff is great, very attentive and definitely not overly distraction"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMHFTQkR3EAE",
            "text": "Always a good experience.  My wife and I went for some wings and cosmopolitan. Great drinks and wings were delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3b19UbGFREAE",
            "text": "Most Terrible place to ever eat all around 0/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bDVya013EAE",
            "text": "I really enjoyed the food. The pasta was my favorite. The place is nice and clean and quiet. Very nice place to have a small get together. The staff was friendly"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBeHRUT0xBEAE",
            "text": "Always a great meal at the Manor House. Probably one of the best steaks you will ever eat. Mussels in red sauce to die for."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaEl5YU93EAE",
            "text": "Been to the Manor many times and never regret a single thing about the experience. Staff is friendly and attentive. Had a brunch burger and I loved it. They were playing Bingo which was hilarious and lots of fun which distracted me from taking a pic of the awesome burger. Give them a try, the food is amazing!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbVpTT29BRRAB",
            "text": "Muy buen sandwish"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNmZ6U1FnEAE",
            "text": "Great food, clean place, and good atmosphere. Some of the food was a bit spicy which was a shame because my girlfriend has intolerance to spicy food, but other than that, all was great and I'd definitely return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeU9LOXVRRRAB",
            "text": "Great people Excellent staff Excellent food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdnNMYUJREAE",
            "text": "The decor is updated and beautiful. It is also well lit. The service left nothing to be desired. The atmosphere is welcoming and I truly enjoyed my delicious meal. My other half ordered a cheeseburger with sweet potatoe fries. I ordered the chicken rollitini with angel hair pasta in a vodka sauce.  Both meals were delicious, we were very happy with our choices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdEtuc0lnEAE",
            "text": "What a great little restaurant.seated promptly and enjoyed the small dining area.Our server was new and clearly learning but he gave it a good effort.Food was excellent as both chicken dishes on point.French onion soup sealed the deal.Parking is limited but a definite keeper.Thx TN"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNFBUUFJBEAE",
            "text": "The new renovation inside is absolutely fantastic! Great place to get a quick bite to eat. Outdoor area is very nice, service is always really good and food is pretty good. Definitely recommend the burgers and french onion soup! Do not recommend the baked clams!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbVl5YlZBEAE",
            "text": "We do order a lot from the matter take out. Everything is always pretty good very little complaints. However, me and my wife went to dinner Is The manor house. Salad and appetizers were delicious. I ordered a steak my wife ordered the pork chop. Steak was delicious. The pork chop was not edible due to the fact that it was fatty and had a lot of grizzle. Waitress asked us if we wanted to take something else home. We declined but we did get a desserthat they asked us if we wanted. Then to receive the bill and see that the pork choppers on there. And they didn't take one thing off the bill. The pork chop had two bites taken out of it and was cut up to find the piece that there was not fat or gritzel. I just thought that that was poor business."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNwX2E4SRAB",
            "text": "I had dinner with my friend and he’s two daughters at this restaurant today. We four of us went there for lunch. The restaurant welcomed us with warm and friendly.\n\nthe place was clean and waiters with their uniforms were clean and behaving polite so one of them took our orders.a few moment later the side dishes was brought to us we really enjoyed it. The mains was good with all of meals we love.  We had few beers and few shots, it was amazing thanks to Eddy, and I want to thanks specially Michelle and Eddy for the great service,\nWe really recommend the restaurant, because the taste of the food is incredible, the prices are affordable and the atmosphere and attention from the staff is amazing. Thank you and wish you all the best❤️"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNLVBXaFlBEAE",
            "text": "I was here for a private party and I can't say anything negative about our experience. The staff were very helpful and accommodating, the service overall was excellent. The food was fantastic, the London broil was tender and delicious as well as the salmon fillets. Great place overall"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMnF6Y2d3RRAB",
            "text": "A well established restaurant in the heart of Staten Island. We have had many events here. Recently took my beautiful wife out on a date and this place did not disappoint. Great food, fresh and the best service around."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4aDgtZ29RRRAB",
            "text": "Hidden gem! Food was amazing, and the staff were very friendly. Prices are very Decent and so are the portions!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMGZPTXRnRRAB",
            "text": "From beginning to end, the experience was very positive.  I need to thank Deborah for saving the day.  In short notice, she made the celebration happen at The Manor.  Many thanks to her.  Also, the atmosphere, food, and services were all excellent and professional.  Staff were very accommodating and professional. All the guests were very happy from beginning to end.  Many Thanks!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOU5mc1JBEAE",
            "text": "Had a really nice experience! Had a big group of family, they let us wait outside and order brunch. When the table was ready inside after brunch had ended was still able to enjoy the air conditioning and the brunch menu and pricing without issue. Steak and eggs was absolutely delicious!  Service with a smile as well! Great experience, will definitely dine again and can't wait to try the dinner menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaU5tMjdnRRAB",
            "text": "Nice dinning experience with my Family, very nice waiters, all the food was good no complaints."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMjZ1V1ZREAE",
            "text": "Great place ! Great Staff! We had our Reunion at the Manor! Debbie did an excellent job of walking us through everything and was very knowledgeable with the coordination of the event! We had a great time! Special thanks to Joe Territo for being so understanding! Highly recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoM2VuMV93RRAB",
            "text": "Good local place to eat. Service is good. The dinner menu is a lot better than the lunch menu. I wouldn't recommend the sandwiches or burgers because they're not anything notable.\nAlmost everything else, from the steaks to the pizzas to the pastas to the seafood are very good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcjluTk5BEAE",
            "text": "Love this place, great food, attentive staff and many choices on the menu. Pics are a Ribeye steak always cooked perfectly, and Salmon Blancas, which is unique to the Manor Restaurant, with white beans and escarole, absolutely delicious! Staff is great, and the bar is a popular place for watching sports"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtN05DMHRnRRAB",
            "text": "I’ve been coming here on and off my whole life. It’s a warm, cozy restaurant, nicely decorated. Good is good and pretty well portioned. Monday nights at restaurants are sometimes no-manager nights so tonight wasn’t as good. Staff was nice but a bit young, less experienced\n\nThe disappointing thing was I was there for my one night out for Christmas with my mom.  They turned off Christmas music and blared surround-sound the NFL game, all the commercials and sports commentary throughout the place for dinner. There were 5 or 6 ppl at the bar.\n\nDuring long half time talks, I asked if we could change back to music and the staff just looked at my table. Maybe other nights or for other diners it would be better."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMXR2c05nEAE",
            "text": "We had a group of 18 adults and 3 children for brunch. Our primary waitress was Michele and she was great. Our food came out all at same time and was hot. We never had to wait for anything and Michele was so attentive. I would recommend the Manor House highly"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNRaVBCbxAB",
            "text": "We had my Mom's 70th birthday here and what a great choice we made!!! The food was delicious and the staff and service was excellent.The owner Joe was present throughout the entire event and took great care of us and made sure everything…"
        }
    ],
    "reviews_count": 53
}