{
    "name": "Brioso",
    "place_id": "ChIJE6ZeU1JJwokRA87myOkZKro",
    "grid": "SI2",
    "address": "174 New Dorp Ln, Staten Island, NY 10306, USA",
    "rating": 4.3,
    "user_ratings_total": 374,
    "phone_number": "(718) 667-1700",
    "reviews": [
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBektPZDRnRRAB",
            "text": "I absolutely love this place!  I go there or order take-out every week or so.  Everything is beyond delicious from their Lobster Cakes, Zucchini Flowers, Truffle Risotto, fish dishes and let's not forget the perfect White Sangria!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JdFlVSktVRkJWZFVreE5YTlFVRGR0ZGxsNlUxRRAB",
            "text": "My husband and I had a late lunch here over the weekend. It was the only food we had all day as we were busy and had no time to eat earlier. We 100% got sick from the food and I’m pregnant, so there is extra concern. The service was slow and we were the only table there for quite a while. The food was off as well. The fact that the servers don’t know if the cheese is pasteurized and didn’t even bother to ask the kitchen or the owner is even more concerning. The appetizer was wrong but we weren’t charged for the discrepancy, so there’s that. We are so disappointed since we have been here a multitude of times with no issue and have never had a bad experience. Super bummed by this."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT1JrdHJlRUpNU0dKclFXaHpSV2QzY0RremJtYxAB",
            "text": "I am jewish I stay away from junk foods."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVGR6ZGxMVTh6U1RSUmRrcFFTMVJwWkhscGJIYxAB",
            "text": "Food and ambiance was excellent. Service was so-so"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnaGFlS3F3RRAB",
            "text": "One of my most favorite spots to eat in Staten island!!!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbFVGTk9WWGxwVFhJNFNrSktVVk5sWkZkdE4wRRAB",
            "text": "Been here a couple of times and the food quality is top notch.  Huge menu menu and lots of specials as well.   I don't live in Staten Island but I can tell that the standards for Italian food in Staten Island are very high.  If this restaurant was located in the suburbs or another city, this restaurant would be rated with better reviews."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMFNrdzROelpyYkU1SU0ydFhRak5rYlZnM1ZIYxAB",
            "text": "The service was very professional and food was great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tveWJGcHVaVXBDU2sxMGIwZE9hVlEzYlZwNFpFRRAB",
            "text": "Been going here for years....Peter keeps the place with excellent food and desserts...specials are always key!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KclJtMXliVmMwUzJaWVRITnZNemxMWmxKUVduYxAB",
            "text": "Great food, awesome service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSd2NIZFBPV3AwZG5CUU0xTjBZMVJtTTNGMVlrRRAB",
            "text": "Great service best Italian food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkT1gyRlNZbHBUUlc5ek9FWjBaR3BOVFc5MlVrRRAB",
            "text": "This location has been here for many years which speaks volumes in itself. Feels like you are walking into an Italian wine cellar. Food options are excellent.\n\nA must try for Staten Island."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWU1GRTBSbFZMTm1aeE4ydDVVRkV4Y0ZaTVZVRRAB",
            "text": "Was there a few weeks ago.  Very good food"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OVAyemFnEAE",
            "text": "Always top notch fresh and flavorful traditional southern Italian dishes matched with excellent service. Everyone at Brioso is pleasant and professional. The decor and atmosphere gives you the feeling that you're eating at someone's villa, eating outside at night feels like you're having dinner at a village square Cafe. Brioso, always a great experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOSzVxXzdKMjVPVTFBRRAB",
            "text": "It’s been long time since I have eaten here. Went with friends and it was just as good as I remembered."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQXzQwYm54eDlPckV3EAE",
            "text": "Food is delicious! Pizza is straight from the brick oven, excellent. Calamari Fritti not over done, Osso Bucco with polenta was perfect."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLWo2YlA1czRfVjhRRRAB",
            "text": "Just looking."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNXU2YkV3EAE",
            "text": "Excellent food and service!! A must visit!! Everything is delicious!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbDltdnVRRRAB",
            "text": "Great atmosphere, food and service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNk1DUUtREAE",
            "text": "Disappointing. Have been coming here for years   The food was always good. What Happened.! Ordered from here and it was so bad."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRalpDWjlRRRAB",
            "text": "Excellent the best restaurant I've been to in a long time"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBN2R1eTJ3RRAB",
            "text": "The best Italian I've had in years. Homemade, family owned and operated."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQLTQ3SUVnEAE",
            "text": "Food and drinks were amazing. I'm definitely coming back real soon."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaDdqeGl3RRAB",
            "text": "Best food on Island"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdklhYVFBEAE",
            "text": "We came for my Aunt’s 90 bday and the food and service were so great! Would definitely come back next time we are in town."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYekl1d1RBEAE",
            "text": "I work as a food delivery man. When I come to a restaurant for my order, the staff has a very ugly attitude towards the drivers, as soon as you enter they show you the door and ask you to wait outside. The customers are people and the delivery men are dogs or something. Such an attitude is a disgrace to people!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMmZqSV9BRRAB",
            "text": "Everything is fantastic, this is the real Italian food! High quality food, wonderful place, perfect welcome and staff, it's the perfect restaurant! 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOHBqc0h3EAE",
            "text": "We decided to stop by one night in the summer to enjoy their outdoor dining. I ordered chicken with artichoke and spinach in a lemon sauce. When I asked what it came with I was told “artichoke and spinach “. I then asked if I they could please put it over pasta  (using the same sauce as the dish). I was told that the chef could not do that. I was obviously willing to pay for the additional pasta, however they said they could only give me pasta with tomato sauce in a separate dish because, if they “did it for me, they would have to do it for everyone “. The waiter then said he would ask the chef and see what he could do. When he brought out the food - guess what ? No pasta! He said they couldn’t do it. I then went over to the manager to explain to him what happened. He yet again said if we made it for you, we’d have to do it for everyone and we are trying to keep the food “authentic “. I literally asked for pasta in an Italian restaurant. I don’t think I asked for anything that was too difficult to make. I won’t be coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdDZhUDFnRRAB",
            "text": "Food was delicious. The pasta is phenomenal. Great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NHBmcGdnRRAB",
            "text": "This place is very elegant and everything was fine. They deserve 5 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibjhmODBBRRAB",
            "text": "I had a great filet mignon here! I heard the freshly made pasta was a must, so I'll have to comeback. I decided to get the steak for some reason, and I was not disappointed. The steak was tender and melted in my mouth like butter."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibklfa3J3RRAB",
            "text": "The best on Staten Island . I drive from New Jersey just to eat here ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiN3F2VjNBRRAB",
            "text": "Terrible service, drinks are small and watered down, food is not exquisite but isn't bad"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZN2RqZFlREAE",
            "text": "Update 2024: Absolutely unbelievable how abhorrent this place has become. From 5 stars\nto 2. Imagine a waiter (Pedro) not checking after the meal to see if one requires anything. Not checking on you after a busperson finally clears the table and then finally, when a check was clearly requested, he's just standing there and has to be told again. Door was open and it was so warm it would have been better to be outside. Specials were abundant but not printed out. Martini was clearly shaken, not stirred (despite no request for such) and watered down. Ambiance was nice if it had been cooled properly. Burrata was delicious. Chicken was pounded thinly, however was overcooked. The sage was nice in the saltimbocca. Mashed potatoes:no flavor but crushed red pepper and black pepper saved them. They were smooth. I can't speak to the dessert now. Ladies, dress down. This place is not worth your little black dress and heels.\n\nPrevious review:\n\nThe goat cheese salad was on the bland side but after some fresh cracked pepper, it was tolerable. The filet mignon special was cooked perfectly and tender and delicious. Their french fries were the thinnest I have ever had and definitely worth going back for. The tiramisu was so decadent, I am pretty sure it was sinful to eat it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6cllmcXZ3RRAB",
            "text": "We love this place! The homemade pasta is phenomenal! The service here is always outstanding and the drinks are fabulous! However, it gets very loud. Almost to the point where you can't hear the people sitting across from you. With that said, it never deters us from returning and the little almond biscottis they serve with espresso makes up for it!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNlBDTkF3EAE",
            "text": "If you want Authenic Italian, you must try this place. It's amazing! The food was delish. Staff is very friendly. Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUazltb2dnRRAB",
            "text": "Swordfish was not fresh...fishy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUczhyZHdRRRAB",
            "text": "Food always good find for price service waiters inattentive"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqanZxODBRRRAB",
            "text": "Delicious food and the best Cosmopolitan cocktail."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhcDhHV2h3RRAB",
            "text": "I had a fish dinner from the specials the night a had dinner at this restaurant. It was a filet made oreganta style. It was excellent. Also had fried Calamari which was excellent. I would definitely go again to this restaurant. Update 3/19/22 went back for St.Joseph dinner. The Pasta con Sarde was not made the right way. It does not have a red tomato sauce. Way too much tomato sauce in their version. I have never seen it made like this. Disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcHJTXzNnRRAB",
            "text": "Brioso was nice place for everyone"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweExXaFlBEAE",
            "text": "This place is fantastic and perfect for a  date night or an afternoon business lunch. Located right smack in the middle of New Dorp lane. You can’t get more convenient. I’ve eaten here many time i think its in top 5 restaurants in the borough and top 20 of New York IMO. They make their pasta fresh adding to taste and never makes my stomach hurt after eating there. You can taste every ingredient they use. The wine list is great and cocktails always match the the season. Make the trip."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwdEoyMzJBRRAB",
            "text": "Finally have a chance to try this place for my wife birthday. I would say it is just alright, some hit and misses. Burrata for appetizer was ok. Order the special tomahawk steak and was told it can feed 2 person, I would say for the portion it's only for 1 person. It was a bit over charred and a few pieces were inedible. It's not worth it. The bolognese was great, pasta was cooked perfect and sauce  was flavorful. Compared to the salmon pasta... undercook pasta and salmon was fishy.... For dessert  had the Italian cheesecake which is not the best (took one bite] and tiramisu was good. House red wine is good too.  I tried to inform the waiters about the food and was hoping someone would ask about how the food was. It wasn't busy at all so they had the time to come by. They had the busboy take the plate away so I wasn't able to tell them then until the table was cleared and dessert  was order. At that time I told the waiter and he didn't seem overall surprise or concern. If I had the dish there  he could have smelled the fishy smell. Overall verdict, I will try another place, but if I did come back I'll stick with the classic dishes and skip the fish. For the quality, portion, and price. Not worth it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDel9YaWNREAE",
            "text": "Great food and great setup outside with live music  Service was slow but that was because there were two new servers and we were not in a rush. Waiter was kind, friendly and funny and took care of us with dessert."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGeEtlVEZ3EAE",
            "text": "Screw this place La Strada is MUCH nicer, more professional, and is right across the street!\nWhen someone orders an espresso,  the waiter should bring a BOTTLE of Sambuca so a few drops can be added to the coffee. NOT HERE! They charged me FULL PRICE for a drink! This is enough for me to say SCREW YOU I'll go to LA STRADA from now on! They ALWAYS accommodate good customers!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVMmF2NGxnRRAB",
            "text": "Very displeased and will not return!\nDisrespectful wait staff. Sub par food.  Greasy non flavored artichoke heart. Mushy mozzarella triangles. Small portions. Do not recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtczVQZkNBEAE",
            "text": "Delicious food, great atomosphere,  perfect service & over the top🍸martinis.. PERFECTO! Thank you, enjoyed a beautiful birthday lunch at Briose! (compliments of KC) Grazie👌…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMTVfWHJBRRAB",
            "text": "Fabulous and the prices were great as well! Friendly staff, delicious food.  Can’t wait to go back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0dFBXNzhnRRAB",
            "text": "Had a Terrible experience here on Saturday night. Had a table of 3, Waited 20 mins for waiter to take drink order, then another 20 mins to take food order. Waited another 45 mins and still no appetizers , no one bothered to ask if we needed  anything. We finally found the waiter , who simply blamed the kithchen  for not getting our cold appetizers ready, the restaurant was only 1/2 full. . We asked for the manager who just threw his hands up and walked away, when pressed he asked what did we want him to do.\n\nCant comment on the food as we never ate, we walked out 2 hours after sitting and having 1 drink and piece of bread."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBek5TUWpnRRAB",
            "text": "This is a great Italian restaurant with a warm atmosphere and friendly attentive staff. We are a group of retirees who get together each month for lunch. This is such a welcoming place we frequently lose track of time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCanEyZURnEAE",
            "text": "A great dining experience with a huge diverse menu and delicious Italian cuisine. Wonderful friendly and helpful service in an attractive atmosphere."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dzhQZWpnRRAB",
            "text": "I had a wonderful time at Brioso's. The cuisine is always excellent and the service this time was excellent, as well."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSaDV2aUVREAE",
            "text": "Rubbery shrimp. High prices for low quality food. Salmon was 40 dollars and was about a 3 oz piece.  The calamari was rubbery also.  Waiters and staff were not pleasant, we felt very rushed.  They had a great jazz band but that was the highlight of the evening.  I won't go back, the food I had and everyone at my table had was disappointing and had the same experience.  My friend had the tuna and said it was bland.  By the way, I am Italian and so is she, so we know food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5aDRQcnJnRRAB",
            "text": "Delicious food served in authentic Old World Charm."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdW92TEt3EAE",
            "text": "My family and I honestly cannot say enough GREAT things about this establishment !! I hosted my husband's surprise 60th dinner and have received nothing but rave reviews from EVERY single guest !! Dealing with Peter was amazing and he was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdTVUTk1REAE",
            "text": "Brioso was my mom's favorite restaurant on SI, so it was only fitting we had her repass lunch for her there. From a table of 2 to one of 63, Peter and his friendly staff make everyone feel like family. The food is always consistently excellent no matter lunch or dinner. Thank you!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bmJUUnZRRRAB",
            "text": "Saying the food is delicious is an understatement! From the bread with olive oil and an eggplant spread, to the salads, drinks, entree, dessert and coffee, everything was top notch!\nExcellent Service ✔️\nAppetizers ✔️\nSalad ✔️\nEntree ✔️\nDrinks ✔️\nDessert and coffee ✔️\n\nPeter the Manager is always there making sure everything is perfect!\n\nA definite 5***** Star Pizzaman rating!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHOUppMmhnRRAB",
            "text": "We recently had had the repast after my mother's funeral    at Brioso on a Saturday afternoon. The owner and his staff  could not have been more accomodating.  The food was wonderful and the service great. The atmosphere is very pleasant. You cannot go wrong with a meal or an event at Brioso."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBXzRIazZBRRAB",
            "text": "My husband and I had dinner on Thursday evening and were very disappointed.  The salmon with risotto was a rather salty rounded lump of chopped pieces of salmon and hard, partially cooked risotto.  Not even a side vegetable and if there was any in the risotto, he never found them.\nMy steak tasted grainy and dry and had no flavor There were a few side vegetables (with one asparagus thrown in) which were terrible.  Again, no flavor besides tasting on the bitter side.  I ate almost nothing.    We did eat the appetizer which was okay.  The staff was not at all friendly or pleasant.  All in all, it was a total waste of money.  We'd been there half a dozen times in the past, though not for a year or so, and thought the food was good, but will never eat there again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVcDhYZkJBEAE",
            "text": "The food was excellent but in typical fashion we had the dishes taken away before we finished.  It's a phenomena that has swept across the restaurant community.  As someone who has worked in the industry for years, it stems from what I call the \"diner mentality\".  Years ago you would have young men from the neighborhood busing the tables but with the influx of cheap labor pouring into sanctuary cities employers opt to hire undocumented immigrants.  And with that the need to prove themselves over and over at your expense. I find this to be the case even if just three tables are full....amazing.\nThis is yet another wonderful restaurant I will boycott for one year.  Its my own way of handling this matter but what else can one do?  To date I have boycotted about 21 restaurants on Staten Island.  Most for one year, some for eternity.  Recently I had business cards made up....nothing fancy....just a card I leave at the register as I exit.  The card simply states I will not patronize businesses that hire undocumented.  It did impact two restaurants......one of which I now frequent.  Enjoy!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyd29MaU93EAE",
            "text": "The St. George Theatre is so thankful to Brioso for being a restaurant sponsor at our May 7, 2022 gala.  Peter is always wonderful to work with...so generous and giving. The food was presented beautifully and of course DELICIOUS. No wonder they're one of our favorite SI restaurants !!!    And did I mention they make the best martinis?  Thank you ~ Thank you ~ Thank you ~ not only for your continued support but for being  so community minded.   We are so grateful for all you do.  Staten Island is a better place thanks to you.  xoxoxox"
        }
    ],
    "reviews_count": 60
}