{
    "name": "Pizzeria Giove",
    "place_id": "ChIJTVnfcVJJwokRanxhOiUrj64",
    "grid": "SI2",
    "address": "278 New Dorp Ln, Staten Island, NY 10306, USA",
    "rating": 4.5,
    "user_ratings_total": 537,
    "phone_number": "(347) 286-0635",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMk5XRndVRTF4YW5OTFZtSkRZbkZ5WVRsTGJWRRAB",
            "text": "Disappointed after having a great experience the first time. We came in during lunch time and the place was empty. Our server was not attentive at all and did not check on us throughout the entire time we were there. We ordered buffalo wings and got plain fried chicken with NO sauce. We ordered a prosciutto crudo pizza and got something totally different. When it was time to pay we left our card with the bill and waited 10 mins for someone to come get it— again, the restaurant was EMPTY. Horrible service this time around, would not come back during lunch hour."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWclVsOXRMVXhxVm5od1dtbGZlVGxvVUU1RlVYYxAB",
            "text": "I recently celebrated my birthday and ordered from Pizzeria Giove, choosing a couple of pizzas and a variety of desserts. I tried a pepperoni and mushroom pizza with added chicken, but unfortunately, the pizzas were extremely salty. We ended up having to throw them out entirely, as the saltiness made them inedible. It's worth mentioning that the restaurant wasn't busy at all, with only one other table present, so it wasn't a matter of them being rushed.\n\nOn a positive note, the desserts were fantastic. The tiramisu was delicious, and the ice cream flavors-vanilla, chocolate, and hazelnut-were all enjoyable and met our expectations. We definitely ended up enjoying the desserts more than the pizza.\n\nIn total, we spent around $92 for two small pizzas, two tiramisu, and three ice creams.\n\nI hope this feedback he¹ future customers!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobmNrTmFaVUprVlhvM2VHRm9XSHBQU3pKRVgzYxAB",
            "text": "Prize winning pizza was dry n salty."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNjdQdWFBEAE",
            "text": "This is the best pizza on the east coast. Everybody likes pizza, giove takes it to a new level. They have pies that won international awards, beat bobby flay as they mention, and there is a reason for it! Naso pie is the best pie I've ever had. I wish there was a giove close to me. I do have 2 great pizzerias near by (crispy freehold, PAT D'S howell!, both must try) but honestly, noone has pizza like giove.\nEvery time I go to staten island I drive out of my way to get pizza from them. The wings are also excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWGIyTnZZazVFWkdwNmVVSXhZbWRRVVRkSWRIYxAB",
            "text": "Bad customer service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOeVduQXRjalZLYkVGV1JucDBhRFZKYUZSYVgxRRAB",
            "text": "Early dinner on friday fantastic"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ST2FVMDJhRUl5YTJaeVgxTjNTM1JwTVZOd1lXYxAB",
            "text": "The pizza was horrible."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oelpqZFZZVTAwVjFGZlRsTXphVkoyV1d4NU1GRRAB",
            "text": "Pizzeria Giove\nEst. 2011\n\nLayout/atmosphere\n*Tables; two TVs; open view of pizza oven in back\n\nFood/drink\n*Variopinta (Stracciatella, pancetta, zucchini, garlic & herbs, extra virgin olive oil) [white pizza] (small/six slices) - Good; very thin, crisp crust"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeFNtOHdOM3BqZFdGTldsaE9Ra3hoUjI1ak1FRRAB",
            "text": "Great food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NVdYVnlRVzgyU1c1SWFtdGhTM0ZZZWpSclFWRRAB",
            "text": "Everything tasted fresh and homemade."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPenRLbVFREAE",
            "text": "Pizzeria Giove is the best wood burning pizza on the Island. I love their story as told on their menu, even though they spelled Pizzaiolo wrong ... We went on quiet Sunday during 4th of July weekend and we were the only people in the restaurant. We ordered a caesar salad and fried calamari to start. The apps came out quickly. The caesar was good, though I prefer shaved parmiggiano on mine. The calamari was underseasoned and came with the tiniest shot glass of sauce, which wasn't enough for half of the platter. It was a good amount of calamari. Now onto the main event, first off the menu is broken down into 2 pricing categories: small and large. The small 14\" pizzas (6 slices) run around $15 and the large 18\" pizzas (8 slices) run around $32 and up... Unfortunately, they don't allow you do do half and half pizzas, which forces you to order 2 small pies. The pizza took forever to come out. We were the only ones in the restaurant and if you are making true wood burning or coal burning oven pizza, they shouldn't take more than 2 minutes to cook. The margherita was just okay. The pizza texture is extremely thin and crispy, which I like, but I prefer some small air pockets on thin pizza, yielding a nice chew. The specialty pizza we ordered was called the Gustoso, which had straciatella, hot sopressata and sweet sausage. It was excellent, like hard to stop eating even though we were so full. Stracciatella is mozzarella stored in heavy cream so it's like you are eating cream sauce on your pizza, which is really tasty. If you are stopping on for the first time, try the small specialty pies."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMak5rdTM4NmVuRWdBRRAB",
            "text": "My family and I have been coming to this place for a while now. Always is amazing food, amazing service, even the owner always says hello. Wonderful place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQLVRpOWlQbmV2b0FnEAE",
            "text": "The calamari alone is reason enough to go to this place. Delicious light crispy while the calamari is still tender. You can tell the cooking is done with care and attention."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMXBuWnFRRRAB",
            "text": "Ordered on Sunday online . Got multiple calls from the driver / doordash/ slice that my food is “no good”, “ on the ground “. Called restaurant and ask to refund/ send new order . Non of that’s happened. $75 for pizza and calamari is a bit expensive and u had non of that nor money back . Take care of your costumers better"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJLWUzUE13EAE",
            "text": "A unassuming gem of a place. Pizza was delicious  but an appetizer of mussels were phenomenal. Give it a try, you won't be disappointed."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aEtpTzNnRRAB",
            "text": "I used to love this place but my most recent order was so bad.  I ordered 3 pies that didn’t have any meat listed on them, and ended up with meat on each pie.  I was really hungry at that point so I just picked it off, but that shouldn’t be happening. The crust was dry, burnt and stale. Lastly, my family and I all had stomach issues for two days after eating this pizza.  So many better spots on the island, this place lost its touch and is over rated."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3a01UcVl3EAE",
            "text": "Amazing gem in New Dorp ( Staten Island ).\n\nJust a 5 minute walk from New Dorp Subway & you arrive to this haven. Really as they promise, it's an award winning 🍕 and the Tiramisu was out of the world ( it will stomp you directly to Italy ).\n\nI was there for a late evening liner ( lunch & dinner ) and it was amazing. The whole team from the welcome to the order taking to the food quality & the warmth of the place was a vibe.\n\nKeep it up guys! You are doing an awesome job. You know what you're doing & that's your USP. Kudos to all of you ! 🥂"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRal9DeEhREAE",
            "text": "The best around"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRazY3RHpBRRAB",
            "text": "One of my favorite places. Old school prices, old school service. Thankful"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRck15OG13RRAB",
            "text": "Really great pizzeria! I do both, dine in and take out.  Never disappointed in any of there food.   The pizza is so good, I ordered it every night for 4 days straight last week. Calabrese & Quattro Formaggio my go to!"
        },
        {
            "date": "8달 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaXFYbnlRRRAB",
            "text": "코코넛 밀크 피자에 좋은 필카카를 곁들인 지오베 콜랑귀에테. 최고의 피자 중 최고예요."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmejhIT3N3RRAB",
            "text": "Avgerage at best! The mozz sticks and fried calamari was delicous… My shrimp parm entree was very good as well.. The pizza on the other hand is awful! Burnt crust and barley had any of the toppings my wife ordered. And a traditional pie that she ordered with olives, proscuto, and artichokes calls for fresh mozz. Instead they used the reg pizza mozz which was awful.. 19$ and they barley put any toppings on the pizza.. The waiter we has was god awful. We had to keep flagging him down when we needed something.\nOne last thing is we found it to be loud in there!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bDRHaHNBRRAB",
            "text": "Good pizza.  It’s kinda flat/thin style pizza."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQN19DZ0lnEAE",
            "text": "Pasta and sauces are outstanding. Pasta is Al Dente and perfect"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbFppck13EAE",
            "text": "For past 10 years only pizza place for my family ."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5Xzh2R3dnRRAB",
            "text": "Simply amazing thin crust Italian pizza!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbDQzT09REAE",
            "text": "Went tonight for my nieces birthday. The pizza was so delicious and so thin. I had the sausage and broccoli rabe pizza was phenomenal! ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzZ3R1NkpBEAE",
            "text": "The pizza is outstanding here. We drove in from Manhattan to try the pizza. I’d definitely return to try more of their specialty pizzas. We started with the Margherita—it had a thin, crispy crust, though the sauce and cheese were milder in flavor than other Margheritas I've tried. The sauce is fresh and so are the rest of the ingredients in the pizza. The pizza really shone once we had another with toppings. We ordered the Paris, one of their specialty pies, topped with San Marzano tomato sauce, stracciatella, flat pancetta, crimini mushrooms, and a soft garlic & herb cheese. The combination was outstanding. The restaurant is large and inviting. The service was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYM3ZYYXRnRRAB",
            "text": "White pizzas are delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMlozN3JnRRAB",
            "text": "I had simply walked in before they had opened to ask for a glass of ice and it was no problem there was so nice that I sat down to have an incredible piece of pizza I really suggest that everybody and their family definitely come to here"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRaktyX3F3RRAB",
            "text": "Love it here.\nGreat food, the mussels are delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINFpMZ3JnRRAB",
            "text": "Recommended by a friend! Fantastic!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINVBIcWx3RRAB",
            "text": "Was a good place until we reserved a table for 4 people, ordered two pizzas and got only one. The guy just forget about second one and after 15 min we got a second pizza completely cold"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaWVUdjlBRRAB",
            "text": "Very good, though on the pricey side. My favorite is their Variopinta pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyb0otN2N3EAE",
            "text": "Drove here 1.5 hours to find out that they are closed. No information anywhere online"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNDktTDBBRRAB",
            "text": "I’ve been going to Giove since day one and quite simply put, this is one of the places that makes you proud to be from Staten Island.\n\nOver the years I’ve made it a point to try almost every one of the dozens of pizza offerings. Not one has ever disappointed. Giorgio is a virtuoso and the most talented pizza visionary ever on Staten Island.\n\nI highly recommend the following pies: The Re, Prosciutto Cotto, Naso & Millenium. I guarantee you’ll love any of the aforementioned!\n\nRecently I learned that the owner’s family is also Barese so maybe it’s just in my DNA and I’m predisposed to loving this place, who knows? If you’re visiting Staten Island in search of great pizza or you’re a resident looking to flex your borough’s pizza superiority, Pizzeria Giove is the place for you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMHY3NU5BEAE",
            "text": "One of the best pizzas I’ve ever had. Other foods were great as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKN2V2QXJRRRAB",
            "text": "This was my first time here and I must I enjoyed myself. We arrived for our 7:30 reservation and we were promptly seated. We could see this pizza being made right behind our table ( this fascinated my kids). It was served nice and hot. A great treat by all seated.  Excellent pizza, enjoyed my dinner. ( We had started to eat the appetizers before I realized I had to take pictures 😂) .\n\nAll in all, this was a good experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6amQtTENnEAE",
            "text": "I got the margherita pizza which was really good! On the dave portnoy scale i would go 8.1. I will say it got a little samey towards the end but thats probably just on me for not getting a more interesting topping. My wife got chicken parm and penne vodka. I did not like their vodka sauce so would not get that if we go again. It tasted kind of like the fake texture of kraft mac and cheese. Their chicken was also thin and not very good. Would go again for the pizza but not the entrees. Also they never came by to refill our waters or asked if we needed anything hence the low service rating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOcklibW53RRAB",
            "text": "Regular pie was average. Crust was well done. Vodka pie was a mess. It was floppy and looked like the cheese wasn't fully cooked. A slightly off taste on the Vodka pie. Fair amount of seating and the restaurant looked nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtc2JTWnJRRRAB",
            "text": "Great place for authentic Italian style pizza.\nDough was thin and crust. We chose the classic Margarita and Toscana Pizza  (but without flat pancetta). Both were very delicious.\n\nDefinitely will come back for more."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdWVmdUF3EAE",
            "text": "My favorite place in Staten Island !!!! Best pasta, pizza and salad. I truly love this place even for lunch or dinner. The pasta is so perfectly cooked and made. I come here for some of my favorite dishes that I've included in my review. Best fried calamari along with their seafood pasta dish , faveeeeeee!!!!! Never disappoints."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXLVA2VjNBRRAB",
            "text": "In the conversation for best pizza on Staten Island. Their specialty pies are absolutely amazing and award winning might I add. They are now making their own mozz sticks and were probably the best I've ever had. 100% recommended eating here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNWJibmdBRRAB",
            "text": "This restaurant was so nice. I love the atmosphere and the open kitchen where you can see the pizza being made. The variety of pizza along with other foods here was phenomenal. The staff was extremely pleasant and helpful when trying to choose which pizza to try for the first time. The ingredients were extremely fresh and it showed in the taste of the pizza . It's a fun place to go with friends or even a date. I recommend it and plan on returning soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURELU1xaXJRRRAB",
            "text": "Best pizza I’ve had is at Pizzeria Giove in Staten Island and is highly recommended. You can’t go wrong with any choice. We’ve been coming to this place for years and don’t even live in the area. Place is casual, clean, good distance between tables, great service and delicious food. I would say “gourmet pizza!” One of my favorite is the Del Pizzaiolo -made with Stracciatella, Crimini mushrooms, sweet Italian sausage, and truffle oil topped with arugula & Parmesan cheese. Absolutely delicious!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnenZlR0V3EAE",
            "text": "The service is fast and the employees are very friendly.\nThe Atmosphere is simply lovely and I personally loved the tags on the wall and the pictures of Italy and Italian actors and actresses.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwczlyZWxBRRAB",
            "text": "Needed a spot to eat and found this nearby. Apparently, they were on throwdown with bobby flay and I am a huge fan of the food network. The pizza that was on the show was kind of funky but it worked. It was some kind of white pizza. The chicken parm hero was ok. Not my fav. Chicken parm tasted like something from a normal corner pizzeria. Stick with the pizza here."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcjRXZkdBEAE",
            "text": "Finally had the chance to try this place for lunch. My wife wanted a white pizza and I got a panini. The pizza was good and thin. The sweet sausage and broccoli rabe panini was quite different it was thinner then I expected but it was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMElMZE13EAE",
            "text": "We went during Father's Day for the first time and the food was amazing!  A definite repeat customer."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRc1pQOUdREAE",
            "text": "Always great. Family run. Consistent and always welcoming. The pizzas are all fantastic. The margherita is unique; thin and perfectly cooked crust with the best combination of cheeses and pomodoro.  Giorgio will make you smile and make you a regular. Mention Mike..... Lol"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNM2R1V1d3EAE",
            "text": "This place is a gem of pizza on Staten Island and of restaurants in general. We started with the fried calamari appetizer. It was light and crunchy with a savory and sweet marinara sauce that paired perfectly. A definite recommendation for…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN2RXc2RnEAE",
            "text": "Very nice pizzeria but there are some caveats.\n\nThe appetizers were very flavorful and the best part. I especially liked the calamari and the mozzarella sticks. Very fresh and tasty. If I only ate these I would give this place 5 stars.\n\nThe pizza looks beautiful and picture perfect but it’s not as great. It’s expensive (up to $35 a pie) and some of the pies we bought either had a funny taste (fishy?), not enough flavor (almost bland) or were burnt like charcoal on the bottom ruining the taste of the pizza. I’ve heard when the boss cooks the pies they come out immaculate and is why they have all their awards, but this time we had one of his staff cooking all the food. Maybe next time I would get lucky and have the boss himself make the pie."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVZ0lXZTB3RRAB",
            "text": "This place used to be good, however they have gone downhill. Everything we ate was over salted. The fried calamari tasted off, the sauce that accompanied it was watery and tasteless. We stopped eating it after a few bites. We had to wait 40 minutes for our pizza, yet there were maybe 3-4 tables occupied in the restaurant. The La Saporita pie had no fresh mozzarella as advertised, the cheese that was on the pie was greasy and chewy. The sauce was orange and extremely salty, definitely not indicative of what I expect from San Marzano tomatoes. The crust was dry and brittle. Toppings were sparse and not even distributed evenly. The servers didn't seem to care much at all. This restaurant is definitely living off it's fame from the Bobby Flay Throwdown and not from the quality of its food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvaC1EUnhRRRAB",
            "text": "Hand made pizza with best ingredients, great service. Loved the pizza and Giorgio, Tiramisu was amazing ❤️❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaGZlTlZ3EAE",
            "text": "What a beautiful pizza pie! Excellent pizza here one of the best around. Been here before and it never disappoints!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOU9DekpREAE",
            "text": "OMG, how come we didn’t try this pizzeria long time ago?! Amazing unique pizza ever tried in my life.. much try😋😋 sorry I forgot to take the picture earlier lol…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1cFlQMjlnRRAB",
            "text": "The pizza crust has a very distinct taste. I loved it! I prefer a bit more garlic on my pizza but that's me. I got the 4 cheese white pie.   We thought it was delicious. Zucchini sticks were perfectly crispy and seemed homemade. Everything seemed to be from scratch and that makes a big difference in taste. They had a special mortadella panini - normally I'm not a fan but wow! It was sooo good! Highly recommend this place! So many options and evening I tried was worth the trip from Jersey."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCak5xcVJBEAE",
            "text": "Awesome food here! Excellent appetizers, fried zucchini, prosciutto, calamari, bread. Wonderful pizza. Reasonable prices too! Going back!!! Good service too. Especially noticed the warm, clean plates delivered to us for our pizza."
        }
    ],
    "reviews_count": 58
}