{
    "name": "Lilya's Restaurant & Grill Cafe Gourmand",
    "place_id": "ChIJK8bBozRJwokRNy88hNFUgFA",
    "grid": "SI2",
    "address": "548 Lincoln Ave, Staten Island, NY 10306, USA",
    "rating": 4.6,
    "user_ratings_total": 378,
    "phone_number": "(718) 351-7575",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkT2VGVm5WMmR6Y1VNNWFVcEdSMUJxY0U1blYyYxAB",
            "text": "This is one of the best taste in NYC if I ever taste,  a special soups. THANK YOU 🙏"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJNGJVVndNRU01TFV4c2VrbEJWa3BVU1VORlVXYxAB",
            "text": "it was the best experience in my life. Food was great as well as service.  Very friendly environment, live music and very well trained Personal."
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGYWRWODFXV294VWxac0xXVm9UazFhVmxsNlVsRRAB",
            "text": "Очень вкуссная еда, и шикарное обслуживание 👌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUlYxbFZNbTVPU1VaUE5rWXdhRXQxUmtaNlNuYxAB",
            "text": "Was invited on birthday party, and loved service and food, will definitely recommend and  will visit agsin"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRFNYaElUVE5ZTmt4dFIyOW9ZME13YWtSUlpVRRAB",
            "text": "Khachapuri khinkapuli khinkali bomba - love it all from bbq to salads and all Georgian dishes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSmJsUlhXVlIwVDNoNFl6Uk5TSFU0UlhnNFJrRRAB",
            "text": "We recently celebrated my husband’s 50th birthday at Lilya’s Restaurant & Grill Café Gourmand, and it couldn’t have been more perfect! From start to finish, the experience was absolutely outstanding.\n\nThe team went above and beyond to make the celebration special — the service was warm, attentive, and seamless throughout the night. The food was exceptional: every dish was fresh, flavorful, and beautifully presented. Our guests are still raving about how delicious everything was!\n\nThe atmosphere was elegant yet cozy, making it the perfect setting for such a milestone occasion. Roma and her staff treated us like family, and we truly felt cared for in every detail.\n\nIf you’re looking for a place to host a special event or simply enjoy an incredible dining experience, I can’t recommend this restaurant highly enough. Thank you to Roma and the whole team for making my husband’s 50th birthday unforgettable!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVlkwaDBOM0pSZVRSUFluZ3RSWFkwU1dGUGQzYxAB",
            "text": "Delicious, amazing, very professional ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQ1dUZ3hjeTAxTkVObFJFOVdjMWxtV1hkR1YzYxAB",
            "text": "Amazing place! Amazing food, perfect service.  Roma and Sveta ,thank you, will definitely come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dGRVMTRaMjVoV1hBelIwSlhiWFZXUzB0VVRWRRAB",
            "text": "Outstanding service , great food and cozy atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SYWFYRndjalpKV0cxR1duTkpVMU54TmpWVFRuYxAB",
            "text": "My favorite place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTVF6Wk9kRTgwVldKc1JWTm9VMkkxTkhkVWRtYxAB",
            "text": "Amazed by a selection of international dishes  and such a large menu when not sure what to order as so many good choices, very welcoming personnel"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdlpqRjJYMGR6U0dKVWExaEdjM1o2VTJoWlYzYxAB",
            "text": "We did a birthday party here - amazing service, quality of food and selection\nHighly recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaVJuRk1TbWRPWTNaVlUxbGpRM3BSTUVKTlZGRRAB",
            "text": "I recently had dinner and it was excellent experience from start to finish.The atmosphere was cozy and welcoming .The staff were friendly and the food wsa absolutely delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUWVqQTJZWGRNTFd4a2RsSlpOMjVFYUU4NVlrRRAB",
            "text": "Delicious food excelent service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUlREQmxaVk52YWxkRE55MU5TMkprVEZreVVIYxAB",
            "text": "Excellent service delicious food cozy atmosphere would go back any day"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbGVWazRlVE51VVMxS2RXVXpiemxxTnpoU05XYxAB",
            "text": "Very good food,  and very friendly  people are working  in this restaurant.\nThank you."
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMFJ6ZFBWelJDTmxCbmRqUlRXWFJrZEhKcGRFRRAB",
            "text": "Очень доброе место и веусное"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYmQ2dHZrdnVpUGFBEAE",
            "text": "Delicious shish kabob and homemade soup.\nGreat service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLdWs0X3p2N196Zm9nRRAB",
            "text": "We celebrated our son First Communion at Lilya's Restaurant & Grill and we couldn’t be more happy. We completely love this place, food was amazing, service so fantastic and the place was beautifully decorated. They have great menu options for all kinds of events and they are very pleasant to work with. We truly couldn’t be more happy. Everything went super smooth from the beginning to the end. Thank you kindly 👍😀"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNTC1qWl92cF8zdkJnEAE",
            "text": "Wow I’m so amazed by the service and quality of food\nDefinitely coming back worth the drive from Bergen county"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQaVBwTmpjcmZlMFRnEAE",
            "text": "Awesome family oriented place with great music"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQX3BwcFA5OE83Z013EAE",
            "text": "Perfect place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbkhrc1M5aWQ3ck1BEAE",
            "text": "Best Armenian barbecue in the entire tristate and that’s a fact! Now this is the authentic taste we needed all along. Can’t wait to try other dishes from the menu - they have everything I missed. Delicious food and fantastic service:  qualifies at least for one of Michelin star restaurant’s criteria - which is WORTH THE TRIP- if you’re coming from Manhattan, take the ferry! It’s so fun!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPQ3MxSmJTbl9Yb1Z3EAE",
            "text": "We had lunch there after a funeral. Unlike previous times when there was plenty of good, home-tasting food, it was embarrassingly scarce and tasteless. For 65+ service fee."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdE5qX2dBRRAB",
            "text": "Great place to celebrate special occasion on weekend with music and dancing or just have a simple dinner during during the week"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMTZuenl3RRAB",
            "text": "Celebrated our anniversary at this place. Can’t wait to go back! The food , the music, the service and the atmosphere were a top notch!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMUxHbjd3RRAB",
            "text": "The delicious food, the lively atmosphere, and fun live music made our celebration unforgettable. The staff is attentive and pleasant. Highly recommend this restaurant."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOWNHVTN3RRAB",
            "text": "Delicious food and friendly service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbUsyNEJ3EAE",
            "text": "We had a great birthday dinner."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReDdMTkFnEAE",
            "text": "Lilya’s Restaurant & Grill Cafe Gourmand is a fantastic spot that excels in both food and service. From the moment you walk in, the warm and welcoming atmosphere sets the tone for a great dining experience. The staff is attentive, friendly, and always ready to make sure everything is perfect.\n\nThe quality and freshness of the food stand out, making every visit enjoyable. Whether you’re stopping by for a casual meal or a special occasion, Lilya’s never disappoints. If you’re looking for a restaurant that truly values its customers and delivers excellence, this is the place to go. Highly recommended!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaDhySGZ3EAE",
            "text": "Good atmosphere service and food, good selection, fresh and welcoming. Highly recommends"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbW9QMk9nEAE",
            "text": "best place on Island"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdGFhdzVRRRAB",
            "text": "The food is fresh and authentic and the service is top notch as always."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMzlmdDZBRRAB",
            "text": "It is a very nice place with a wonderful friendly service and great delicious food!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd01XZ1J3EAE",
            "text": "Good atmosphere, delicious food, nice people. We were really enjoying our time there"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmajZ6T0tnEAE",
            "text": "Very beautiful place! We celebrated my husband's birthday, he was happy! The food was very tasty, the service was top notch! The music was such that you wanted to dance! I recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOThLbVhBEAE",
            "text": "Great food and service, menu selection oitstanding"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmZzVXS3ZnRRAB",
            "text": "chilled here with friends – cozy vibes, great food, and manager Roman is a total charmer. armenians , you’ll love it. perfect spot for everyone)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZzRMRkp3EAE",
            "text": "It's a great place, delicious food and a friendly restaurant, and the manager is a very polite young man."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmeHBQa2JREAE",
            "text": "Was very good food end service recommended"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMklXdGpBRRAB",
            "text": "My wife and I came here for the first time. Recommended by my wife's friend. Rusian,Eastern European,  Mediterranean food. Prices were a little high for the portions that you received. Some dishes were a little too salty for our tastes. Very quite,  but it was a Wednesday night. The service was excellent. I diffently will go back to try other dishes, and to try their dessert, unfortunately we did not have any on this visit. Large menu, big variety."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvbXZEY2lnRRAB",
            "text": "The restaurant was nice.  It was for my nephew's first birthday party and the setup was well done, even though the space wasn't that large.  It's not a very big restaurant.  Our party took up the whole place.  Service was very good.  They were on top of things like changing your plate out.\n\nI didn't touch most of the stuff but to be fair, my sister-in-law did order a whole LOT of food.  I didn't even know what most of the stuff was.  Russian food in general tends to be a lot of tubers and pickled items.  For instance, we had an entire plate of pickled fruit that completely grossed out the kids.  My son couldn't stop gagging at the food on his plate. He was hungry, so we gave him a little bit of everything so he could try.  To his credit, he did give it all a taste but he couldn't get through the first bite.  Then the smell made him want to hurl, so we just had to remove the whole plate from him.  There was a pickled herring that even the Russians at my table wouldn't eat.\n\nThere was one very delicious entree.  It was some kind of battered fish with white sauce, rosemary and lemon.  It was very good, super clean and tasted like really moist white meat chicken.  Overall, though, the food wasn't fantastic and would not revisit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbllUS0Z3EAE",
            "text": "Well ok, this place in Staten Island is a fancy restaurant and is a great place to eat if you want good food and a nice place to eat. Seems like they even have weddings at this place.\nI was there with family end of December in the afternoon. Food was great and they have many different culturally diverse dishes but Middle Eastern food is their concentration but yummy food after all.\n\nOverall, was a great place to eat and price may seem high but you don’t eat here every day so it’s worthwhile.  Definitely try their Dolma which is the stuffed grape leaves.\nI would recommend this restaurant to everyone at least once."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdHZENkh3EAE",
            "text": "Went to dinner at this Georgia (Russian) restaurant in Staten Island.  I ordered the lamb Shish kabob.  The lamb was very tasty but a little over cooked with some pieces very tuff to chew.  Other pieces of lamb were a little more tender.  The palmeini was veal stuffed and delicious. The other appetizer,  the cheese stuffed bread, was also very good and there was plenty of it.  For desert, cream puff and espresso.  Delicious!  For a while the service was excellent,  but later the waiter was busy somewhere else so we had to wait for a while for the check. Also, I must say that this restaurant is a little pricey."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3bU92WUhnEAE",
            "text": "Been to this place multiple times for birthday banquets. I would say one of the best places to celebrate. The food is great, I absolutely love their foie gras, never had a dish there, that I didn't like. Their waiters are attentive and the…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bE15YVpREAE",
            "text": "I recently hosted a big party at Lilya’s Restaurant and Grill Cafe Gourmand, and it was absolutely amazing. From the live music to the dance floor, everything was perfect. It’s the only place on Staten Island where I can truly make the event feel like my own, almost like hosting a party at home, but with a stage, a dance floor, and the most incredible food I’ve ever had. Their bread is out of this world, too. it’s so divine that sometimes I go just to order a ton of it! The atmosphere is so welcoming, and my friends had an unforgettable time dancing and enjoying themselves. I couldn’t have asked for a better place to celebrate. highly recommend it for any special occasion better than any place i have tried."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhaThEYkl3EAE",
            "text": "Perfect place, we’ve been here before with our family, and after that I decided to celebrate my Birthday with friends! Everything was very nice! Decor! Atmosphere 😍 My guests are satisfied with party and food and personal and Live music!🤩🥳🔥…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLeTdpUWNREAE",
            "text": "The food was horrible.\nThe friends of mine invited me to come here.\nSo we ordered shish kebab with grilled veggies and puree, julienne and salads.\nThe salads were OK, julienne was way too salty, vegetables were good.\nBut shish kebab was horrible, it was either done with the not fresh/frozen meat or it was cooked couple of days ago and waiting for us in the fridge.\nI was unable to eat it, took it home, but once I got there my family shared my thoughts telling that it smells the strange way, and same thing with the taste, so we just threw it to the garbage."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzaU1pX25RRRAB",
            "text": "Wonderful food and service had enjoyed the kebabs just the way I remember my Armenian friends had prepared soo juicy and delicious not overly dry that is hard to bite . For the deserts we tried a variety and they are no mach to rest of the food Napoleon, baklava cakes were too dry and not tasty at all wish they were a bit better to make it tge perfect experience.\nAll in all loved the place and would definitely recommend and come again.\nThank you!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQOG9HbWF3EAE",
            "text": "The ambiance of this restaurant is simply fantastic! The cozy atmosphere, soft lighting, and elegant decor create the perfect setting for any special occasion.Great music ! If you’re a foodie like me, you’ll love this place! The menu has a fantastic selection of dishes, and we loved everything we tried .I can't wait to come back again!The staff here truly cares about their guests. A big thank you to  Roman, for providing outstanding service throughout our meal. Roman made us feel like VIPs :)"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbFkyZ3N3RRAB",
            "text": "\"Great food.  Excellent service. Good entertainment\" this was my review half a year ago. Went back to the restaurant 2 days ago and the food was not as great, overdone shish kebab , especially liver. At 10:30 pm we were told to leave the place because they were only open till 9pm and we overstayed as is . When we booked a party of 10 nobody told us the place was only open till 9. We were promised music if the banquet was for 10 or more people, but at the last minute the music was canceled."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjbDluNXJ3RRAB",
            "text": "Classic Russian cuisine with some Mediterranean and Italian notes. Great food, lively atmosphere. Very decent performers on occasion. My one request would be to keep parties' children at their respective tables, not a fan of having my things knocked over repeatedly as I try to enjoy my meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObk5xU0dnEAE",
            "text": "I've been invited there 2 times, love it. The best one!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cExuTnZBRRAB",
            "text": "Dear Svetlana and Roma,\nWe would like to express our heartfelt thanks for hosting such a wonderful celebration at your restaurant. Last Sunday, we celebrated both my husband’s and my birthdays with family and friends at Lilya's Restaurant & Grill Cafe Gourmand, and it was truly an unforgettable experience.\nThe food was absolutely delicious, the music was fantastic, and the atmosphere was warm and charming. Your exceptional service made the event even more special. We are incredibly grateful for everything you did to make our birthdays so memorable.\nWe look forward to returning in the future and will certainly recommend your restaurant to others.\nWith warm regards,\nIrina & Dmitriy"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmaHRyVG5RRRAB",
            "text": "We’re excited to come here because there aren’t a lot of Armenian restaurants.\n\nTerrible service.  Food kept arriving at random times—some people had their main dish, others had to wait another twenty minutes for theirs.\n\nWhen food finally arrived, many of the dishes were tepid, lukewarm.\n\nThe khachapuri was made with mozzarella instead of the traditional suluguni.\n\nFood wasn’t flavorful.  Very few vegetarian options.  Food was not tasty at all.\n\nBread was not fresh.  Not a single item was a pleasure to eat.\n\nOverall, one of the worst experiences in a restaurant.  Shameful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzLW9MMUlnEAE",
            "text": "This restaurant is outstanding! The music, atmosphere, and food are all top-notch. We hosted four banquets (for 20+) here in two weeks, and each one surpassed the last. Highly recommend for any event!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWaXNxR3h3RRAB",
            "text": "Unfortunately we were there not for the best occasion - it was after the funeral dinner.\nHowever, the venue is impressive. The food was really good, the service was great. They were very attentive, but not over the board, as it happens in such cases.\nThey also let you bring your own alcohol, which makes it easier.\nI believe, everything went quite smoothly.\nThe interior and ambiance are quite nice too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWckk2dnZBRRAB",
            "text": "We celebrated my husband's birthday at Lilya's Restaurant & Grill.\nThe food was excellent and cooked perfectly.\nThe service and life music were unbelievable.\nThe owner came to our table to introduce himself and took time after the party to talk to us and listen to our suggestions.\nOur waiter was so attentive and accommodating.\nWe had a wonderful experience at this restaurant!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aFBpcTF3RRAB",
            "text": "A wonderful place for a birthday party with family and friends. It has everything you could possibly wish for: amazing food, very friendly and attentive service and lovely music. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxeGViMzRRRRAB",
            "text": "Had my mom’s surprise party here and I can’t say enough about this place. It wasn’t our first time here and definitely won’t be our last. Tanya the manager was extremely helpful , sweet, and easy to communicate with since day one. The staff is super friendly, food is great, and the music, dancing and atmosphere overall is all you could ask for. Can’t wait to be back for another party already! Highly recommend!"
        }
    ],
    "reviews_count": 60
}