{
    "name": "The Basement",
    "place_id": "ChIJefAANdNPwokR1c7ubg4iRKU",
    "grid": "SI2",
    "address": "11 Schuyler St, Staten Island, NY 10301, USA",
    "rating": 4.6,
    "user_ratings_total": 189,
    "phone_number": "(718) 791-0027",
    "reviews": [
        {
            "date": "3일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGd1FqUnpNV0p3UTFkNU4wZDBVamhvUm1WMFZHYxAB",
            "text": "Excelente restaurante.  Ambiente, servicio y comida. Muy sabroso y abundante. El personal muy atento. Lo recomiendo!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weGVrczRPRnB1YkhSV01sWk1VSE5TUVV0TVYwRRAB",
            "text": "Went as a walk-in on a Friday night. The Rib eye steak was insane!!  Service spot on and even had Guinness."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUGNsYzFMVzl1ZWtsTmNrWjNaMVoxTUhOZk1WRRAB",
            "text": "I arrived at the restaurant half an hour early for my reservation and was seated right away! 😄 The food was absolutely amazing 🍽️, the service was fantastic 🙌, and the cocktails were delicious 🍹. I loved the unique atmosphere too! 🎶 Plus, it's just a short distance from the Staten Island ferry 🚢, which makes it super convenient. Great experience overall! 🌟t a short distance from the Staten Island ferry 🚢, which makes it super convenient. Great experience overall! 🌟"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toa1l6TnNVbWxETW1aV1JVbE5OV1EyTkZKaFVVRRAB",
            "text": "Had never been to Staten Island before, and visited on Sunday to see a play across the street. Checked out the website ahead of time, and booked a table for six for Sunday Brunch. Just a terrific spot with a creative menu. Two appetizers and six different meals, and universal five-stars from the entire party. Highly recommend. If you're coming from Manhattan on the ferry, it's a five minute walk."
        },
        {
            "date": "1주 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMFpWSk1NVWhoVUVwblFXUjRNWGg1WkhSRFJtYxAB",
            "text": "Dieses Lokal ist sehr zu empfehlen. Ambiente u Sevice sehhhhr gut u das Essen war spitzenmässig . 👏🏻👏🏻👏🏻👏🏻👏🏻 (Vorallem die Nachspeise)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzNWIxOU1SakpaZDJ4Q2RreExSWE0zWTFWUGVVRRAB",
            "text": "They have great food a good atmosphere and they prices was reasonable"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNWNGcDZkVXd4Y3pCWlptOHhiRk5yY0dOc05sRRAB",
            "text": "The experience was great, staff was nice. Not vegan friendly. But will still recommend. Great vibe."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeGEwRnRVWFZWWTBsc1JVaHVjVmxLWlV4YVRGRRAB",
            "text": "Pretty good prices and the food was amazing thanks"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTlQwWkVlbkpJTUd4RldYTkRaRXh1YjFad01VRRAB",
            "text": "Unique book themed atmosphere. Good for a drink whilst you're waiting for the ferry. Staff are sweethearts. Way more welcoming than other places by the ferry. Beware cocktails are strong."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVFdVZzFNVVZhVlRoQmNubE1SRFJLTFV0VGRWRRAB",
            "text": "Great experience, food and service was excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdE1YYzBRMUJrVjFWVGNsVnRaMGxrU1dkMlpuYxAB",
            "text": "Hidden gem of Staten Island.\nGreat atmosphere. Food was very good for 98% of people. I am super demanding that is why 4star."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeU9VbE1RbGRGUTBKNWJFTjVRbmxaZDB4cFNYYxAB",
            "text": "Nice place, excellent food, perfect service.\n5 stars💫"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUE56WmtOa00xZUhwZk5raDNNVlZoVTJWQ1RIYxAB",
            "text": "Unfortunately was disappointed with this place and was really looking forward to going. The grilled octopus was so over cooked it was basically rubber and the steak was asked to be medium rare and came out well done. In addition to this we asked in advance for a candle to be on the dessert as a surprise and it was never done. No place I would run back to"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOd01HdFNNMk0zTWpSME5DMUlOVmxYVkRSelZWRRAB",
            "text": "Terrible customer service, the hostess has an attitude. Food was mediocre. Never going here again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOelRHOXdWVEYwTWtkNFQwa3RhVkJ3ZWs1b2NGRRAB",
            "text": "Great find! The service was great! The food was great! Kevin the bartender made the perfect dirty Tito’s Martini! Happy Hour Deal!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WYVpERmpWVmRPUjFORE5WZzBNRTFqV1Y5UGFrRRAB",
            "text": "The place and the ambience is beautiful but they didn’t give us a table, and i saw many tables for 4 during our last dinner together, the bartender was really nice and the food a little bit salty"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GS1l6ZFlkbUp6VjBRNGEycFpkMXBWU1ZKTGQwRRAB",
            "text": "Absolutely loved both the food and atmosphere but the service was so slow. At times, it felt like we were purposely being ignored. Very odd."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNFYwdEllVVJNYW5aR01XSjRVMWxQZFdaR0xWRRAB",
            "text": "Bustling eatery. Excellent menu and presentation. We had the mussels— the sauce is to die for! Steak was also perfectly charred on the outside.  Delicious!\nClever variety of cocktails with literary names, affordably priced wine by the glass.\nSeveral options for dessert.\nThe host actually read the note in the Open Table reservation and addressed my need for\ngluten free options."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKellUSm9SVmhaVmtONVNGTjJSR2xvWjFCNWQwRRAB",
            "text": "Go now, their mussels in champagne sauce will have you melting. I live no where close but if I did, I would quickly become a regular."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRk9YRnNTMUZ5V1d0Qk1IWjJSVlpFVm5sSlluYxAB",
            "text": "Super cute. Great food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKelZXcFZNREpEYkdSNmR6RlNkRGxyV2t0YVptYxAB",
            "text": "Amazing food. Felt like I was dining in some trendy Manhattan restaurant. The service was impeccable too."
        },
        {
            "date": "2달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVWVqaEdXa2hmYWt0VldHazRabFpHYVUxbmNYYxAB",
            "text": "Szok!!!! Restauracja która przywraca wiarę w kuchnie, serwis i wystrój. Byliśmy w prawie 20 osób. Odważne dania które na długo pozostawiają cudowne doznania, shrimps carbonara rozwala system. Sałatki pysznie skomponowane i doprawione . Mięsa, ryby, makarony idealnie dociągnięte. Brawo brawo brawo!!!!!"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMFJGcFhObkpUTjNKeFgySm9NMEZGVldkd2EwRRAB",
            "text": "Ottima cucina, camerieri gentili e bagni puliti. Ristorante da consigliare.\nExcellent food, friendly waiters, and clean bathrooms. Highly recommended.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxblZXRmlSWFZaTW1odUxYbFVjR1ZCUldjNFZXYxAB",
            "text": "Great three course dinner available Monday to Thursday.  We'll worth the money."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTGRHOHlOVXQwUmtGSmVHVmZSMWgzZDNVMlJtYxAB",
            "text": "We came here to celebrate my mother’s birthday, and unfortunately the entire experience was disappointing and unprofessional. I had made a reservation in advance and specifically noted it was for a birthday celebration. I even reconfirmed with the host during the meal that someone would be bringing out a dessert for my mom.\nOur server, Bryan, never once checked on us during the night. He seemed completely unaware of what was happening at our table and, frankly, gave the impression that he had no clue what was going on at all. The only thing he did quickly was bring the check at the end of the night, telling us to have a good evening — without any mention of the birthday.\nI went back up to the host (a woman working behind the bar, clearly overwhelmed), and explained the situation. Bryan came over asking what I needed, and when I told him, he admitted no one had told him about the birthday. He went to the host to ask, and instead of handling it professionally, she literally turned to me from across the room, shrugged her shoulders, and shouted, “I forgot.”\nThis was supposed to be a special night and a surprise for my mother, who I rarely get to see since we don’t live in the same state. Instead, it felt careless and dismissive. Between a server who was inattentive and a host who openly admitted to “forgetting” in front of the whole room, the evening was ruined. I would not recommend this restaurant for any special occasion."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWU5EUkdSbkJVZWpCaWFVWlpWVWQ1TVhCcGQwRRAB",
            "text": "The vibe of this small restaurant was amazing, the decoration is stunning. The food was very good and the quantities were very big."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eE1tcFhiSHBUY1hSQ1dsQjBkRXBWTnpRdFRWRRAB",
            "text": "My husband and I were treated to dinner for his partners birthday . And we are so glad he chose this restaurant. We felt so comfortable here . Sean was amazing he not only seated us , but he was also our waiter . He was very friendly and very professional  and tended to our needs . The structure of the building is very unique . The food was delicious . I cannot say enough about this place . We will def go back again . Thank you"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQUGM3NS1rNHVQYUJREAE",
            "text": "The Basement is a hidden gem across the street from the Staten Island Ferry terminal.\n\nThe food and service are wonderful!  We started with great cocktails, followed by steak and swordfish, and for the finale, a delicious crème brûlée!\n\nWe had a toddler with us and they kindly gave us a booth on the end with a banquette so she could nap!\n\nBy the time we left at 8pm, the place was packed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dlZrVkVOemhYWVZvMllXdzRaR1prYWtGb1MyYxAB",
            "text": "Food was very well done, price was decent for what you got served. Especially nice to combine with a trip with the staten island ferry."
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSWRHVkplWGQ0VmpneFVHNDNTWEZTU3pkTlRsRRAB",
            "text": "Superbe expérience. Un resto très bon, on y mange bien et pour des tarifs raisonnables. Si vous passez pour le outlet, faites une escale ici pour manger, ça vaut vraiment le détour."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSblEzVlFVM2hOWlRaaFlXeG1TVlpFTjB0Q05tYxAB",
            "text": "Was absolutely amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRFFUVnJSbkJ1ZUhaR2JFVldOMDFMZVV4ZmJHYxAB",
            "text": "Good experience! Nice vibe"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVFkwdGhlRWRNYTNKaE4zVjViVnBEZEhSRlRXYxAB",
            "text": "The food, the service, everything was amazing!!!!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUVNuSXRVRU0xV2tKYWNXZG5Oa0ppZFdkdk5VRRAB",
            "text": "Un local muy bonito, donde se esta a gusto. Servicio muy atento y amable. La comida se hizo esperar, pero merecio la pena, todo estaba muy bueno. Excelente relacion calidad-precio."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMkxVZzBNM2R5Um1KeFpITm9kbTVxZW1kVk5rRRAB",
            "text": "We both ordered a burger. Cooked very well. Good flavor. Curly Fries. Good. But reminded me of Arby’s. My wife had the petite salad as her side and it was actually very big. Good service. Great atmosphere. I was amazed at the kitchen. Several were seated at the same time. One was a big group. They got all of our food out at about the same time. All hot. 😊"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaV1VEVjRSM0Z5Vkc0MVRWUjZVMGx4TmpGQk5sRRAB",
            "text": "Wonderful spot! Really cool place. Loved the books all over & the food - oh my - very delicious! The drinks were excellent too! I had a white sangria & the Banana Foster alcoholic beverage. Thanks so much for a wonderful time!"
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVGRYRXlTbWxIZFdseFZYcFljVFpUWW5wcGJXYxAB",
            "text": "Avis à tous les touristes de Manhattan: prenez le ferry pour Staten Island (gratuit) et venez vous régaler (enfin!!!) dans ce restaurant très bon rapport qualité/prix. En tant que Français, nous désespérions depuis 5 jours de ne pas manger de la cuisine fraîche, savoureuse et manquions cruellement de légumes et saturions de gras! Ici tout est bon, frais, savoureux et surtout copieux! Le cadre est très agréable avec une décoration originale et de bon goût. Bref, je recommande à 100%"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM1drcEZSMWh3Y1dOSVFraGtiM2RrVWxwaVFsRRAB",
            "text": "This place was so cozy! Food was great portions and great taste.  Service was fast and friendly!"
        },
        {
            "date": "4달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeWNVaFhWbTVsU2xaWlZsTklOalU1TURGRE1HYxAB",
            "text": "Essen sehr gut, wie auch der Service.  Gute Möglichkeit, um auf Staten Island eine leckere Kleinigkeit zu essen. Preise gut. Wir würden gerne wiederkommen."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTWFIVktZMm81UldkNGFWOUVlWEJPT0ZWWmFGRRAB",
            "text": "Good food, friendly personell and a great atmosphere. If you're on staten island, visit."
        },
        {
            "date": "9달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBemJ1STdnRRAB",
            "text": "페리 타서 세인트조지 도착한김에 그냥 근처 식당들어가봤는데 미국에서 먹은것 중에서 제일 만족감 높았습니다.\n음식만을 위해 이곳을 방문할 가치가 있다는 점에서 창슐랭 별 2개 드리겠습니다."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UWVURlVhMWg1TVdocFZHSTNVVlE0WnkxTWJYYxAB",
            "text": "Great food, service and atmosphere. Reasonably priced, great cocktails. It was a busy Saturday night and they were super kind and worked to find a table for us. Waiter was great and attentive. We shared 3 entrees and an appetizer. Perfect amount of food for a family of 5. We were full at the end, I wish I wasn’t, because their desert menu looked good, especially the cocktails. Planning on going back to try it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSV1NXa3lSbVZIWm1WaFEyUXdRMGxrVlRCTU5XYxAB",
            "text": "What a cute place. Books & Booze theme.  We came here because the hubs was looking for a dive bar he used to frequent. Bar still exists, but not so much a dive anymore. I had the Southern Waffle Brunch Plate and it did not disappoint, Lord, Two Pork Short Ribs, Three Chicken Wings, Two Waffles drizzled w/Hot Honey & I choose side salad, I could not finish it all. The meats and waffles were fabulous! Sorry but I am not a take pictures of my plate kind of girl, so I dug in before I took a Pic, but once I tasted everything I knew I had to. And I loved the decor and the genius placement of the (hidden) 😉 restrooms."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUVpqTTFYemN6WkVVNGNIazVRMVJmVHpRdFZIYxAB",
            "text": "Note: I took pics AFTER I started eating. lol It didnt come to the table that way!\n\nMy wife and I live a block away, and we were waiting to check this place out!\n\nFor locals, it is where Beso used to be.\n\nThey a beautiful new design and I really love the book store feel to it. It feels very intelligent. ONE THING: Their music selection hurts the atmosphere.  90s dance club music and famous literature do not exactly blend well. Plus, the place is small and sound makes objects vibrate.\n\nSTILL...not a biggie.\n\nMy wife and I had a prefixed menu order. She had filet mignon, caesar salad and chocolate mousse.\n\nI had shrimp cocktail, chicken valdonza and blueberry cheesecake.\n\nI also love bloodymarys so I had an AMAZING  one!\n\nThe food was delicious and portions were generous. We had to take ours home.\n\nCost for 2 came out to 140, so we cant go here all the time but its a nice treat.\n\nWe will be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOVB2a3h3RRAB",
            "text": "This restaurant is located where the old Beso used to be. But they changed decor so much and it looks good. The food was good. Service was good. Nothing really jumped out at me but I think maybe because it was busy. We’ll have to come again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdExyZHBnRRAB",
            "text": "We loved the atmosphere. Very lovely books of inclusion displayed prominently on the walls. It makes you feel very welcoming. We had the tacos that were very flavorful as an appetizer. Definitely recommend! The chicken and waffles with fried ribs were just 2.5/5. The waffles were hot but the combination of hot honey drizzled over the waffle, chicken and ribs did not do anything for me. The burger was medium rare beautifully plated just came up short on the flavor and a tad dry 2.5/5. The biggest pet peeve of mine is not making sure the customer understands that you are charging per glass of soda. Don’t play word games. I had to ask if we were being charged per glass. Be transparent on the beverages…I will take it out your tip."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dFBhLWZ3EAE",
            "text": "The room is really cool, I like the design a lot. The scallops francese were fine. Duck spring rolls were way too overstuffed with meat. It made the bite too heavy.\n\nShrimp carbonara was an odd profile. Not very reminiscent of a carbonara, more cajun. The short rib dish was really good, a tad over-salted.\n\nI wouldn’t order any of these dishes again frankly. Might consider a second meal here but I doubt it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNHZDWm5nRRAB",
            "text": "he Basement is a true hidden gem near the Staten Island Ferry! The atmosphere is perfect for a romantic and laid-back date night, while the bar area offers a lively, social vibe. The service was outstanding; our server went above and beyond, making us feel so welcome even with our 9-month-old in tow. And the food? Absolutely mouthwatering—don’t just take my word for it, check out the pics! If you’re taking the ferry, you have to stop by and experience it for yourself!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcGRtc3lBRRAB",
            "text": "Restaurant is extremely cozy and aesthetically pleasing, perfect for a date night or some family quality time! Our waitress, Paula I believe, was friendly, sweet and kind! The food, however, was quite a miss for us. The wings came with three drums and one flat, which was uneven but an easy fix according to our waitress. The carbonara had nice flavors, but the bacon was over-charred and was extremely salty, which detracted from the dish's overall enjoyment. My favorite of the dish was the shrimp, which was cooked PERFECTLY and had a nice bouncy texture! The bolognese was also overly salty as well, which was worse than the carbonara because it was the entire dish, whereas the carbonara was just the bacon bits (though the bacon was quite vital to the dish). The French onion soup didn't really char the cheese as evident in the photo, which resulted in goopy cheese instead of a nice crisp one.\n\nOverall, the Basement has a lot of promise and there's still so much on the menu that I would love to try! Unfortunately this time it was a miss for us, but I would love to come back again someday to give the Basement the 5 stars I know they are capable of!\n\nThank you for reading and best of luck! (:"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfa3FXMWZ3EAE",
            "text": "First time here, definitely won’t be the last. Went during happy hour. Prices were great for both food and drinks, very cozy atmosphere. Talked with customers all around the bar. Lots of fun! Definitely recommend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2czdmaFJBEAE",
            "text": "Love love love this spot such an amazing hidden gem (hopefully it stays hidden) in downtown Staten Island walking distance from the ferry. The oweners  revamped an already Staten island favorite (besos, which moved around the corner check them out too). Oh but when I tell you it’s like walking into another world it’s filled with a ton of fun books and in every corner there’s a moment to post. Now the bartenders all on point and consistent with their pour. The happy hour is super cute delicious & affordable! However the main menu is a must try. I’ve tried about 50% of it and it never disappoints. Go try it out but only tell your special friends about it. 💛"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOEtUYnVBRRAB",
            "text": "I was not expecting any less from The Basement being that it is one of the sister restaurants to Blue and Beso. Everything was great. Of course the food was delicious. We ordered the frisse salad and the sweet potato fritters to start. They split the salad for us which was a nice little surprise. We both got chicken dishes, the chicken martini and the rustic chicken Parm. They even have Eggers ice cream! Big portion sizes. The drinks were strong and good. I definitely will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcF8za0ZBEAE",
            "text": "Came here for dinner- great food and drinks and amazing service! The decor is perfect for any book lovers! Definitely recommend and can’t wait to try out their brunch and happy hour next!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d19pSTN3RRAB",
            "text": "Everything was incredible.  We had the chicken martini and truffle chicken entrees and a side of the cheese risotto.\n\nThe decor is incredible and the service is great.\n\nWe will definitely be back!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMUxxZ1dBEAE",
            "text": "Book decor and menu to match. Love the ambiance here.  Place was busy on a Thursday night and rightfully so.  Great drinks, and we shared appetizers and a dessert which were delicious!!!  Street parking with meters until 7.  Definitely returning"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncTUtZTZnRRAB",
            "text": "This is a can't miss restaurant! It's the cutest place. Every wall is lined with books. The service was friendly and efficient. The food was great! I will definitely be back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMXJYUEJnEAE",
            "text": "Had such an amazing time when I went with my friends. They are so kind and they gave us so many recommendations for what to get. This place was recommended to us by a coworker and we are so glad that we went. 10 out of 10 I definitely will be returning."
        },
        {
            "date": "6달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM3FfU2xRRRAB",
            "text": "Adorei. Um espaço muito bonito e acolhedor com aquele aspecto de pub inglês. A comida deliciosa e staff bem qualificado."
        },
        {
            "date": "5달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYXR0YmVneWEybFhREAE",
            "text": "Wir haben hier einen kurzen Stop eingelegt um einen Drink an der Bar zu nehmen. Das Ambiente ist sehr schön und die Toilette sehr gepflegt.\nDas Personal war nicht sehr freundlich aber das Ambiente entschädigt."
        },
        {
            "date": "9달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMXR1WGpnRRAB",
            "text": "Gostei muito,  lindo e aconchegante ambiente,  extremamente bem decorado.\nUm achado..\nPedimos 3 sanduíches e estavam deliciosos.\nSuper bem servidos e saborosos.\nAtendente educada e discreta.\nRecomendo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaS1uaGxnRRAB",
            "text": "Shared an amazing meal with my family! The food was delicious. The service was friendly, attentive and prompt. Can’t wait to come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sd1ZXdHRWVGRoWmxsVlkzQk5USGR0ZWpKRFJGRRAB",
            "text": "Great decor and excellent food with a bar that can't be beat"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dlRVaDJVVGhpZUROUmJIbG9lbFl4YTNSbWFXYxAB",
            "text": "I was a very loyal customer to the basement until the manager Maureen and Kevin treated me like my business isn’t any better. Me and my best friend used to go there very often but the bartender Kevin is very dismissive, does not show any care for customers, he does not take criticism very well as his drinks are subpar, meaning he doesn’t know how to make an old fashioned. Many times I tried to be nice and not complain about his terrible drinks so I didn’t have any much issues at my favorite spot, until one night I decided to bring my husband’s family to this spot for dinner. Ricardo was always very sweet and very attentive but because he knew me and my friend. Kevin instead would ignore me and my family, did he even ask if we wanted water?? Absolutely not! But the manager Maureen thinks his bartender is right and me the customer who always brought business to them was wrong. However, one day, me and my friend went one night to enjoy the night because it’s our favorite spot and the manager was MAD and CONFRONTATIONAL about what happened. We were never disrespectful to the staff, never yelled or cursed, but SHE SAID WE DID. I hope the owner reaches out and come to a resolution. I am the type of person that believes that the customer is not always right but it doesn’t mean we get to disrespect CUSTOMERS business and discriminate because of how the look and how the speak English."
        }
    ],
    "reviews_count": 63
}