{
    "name": "Don Cheech",
    "place_id": "ChIJ51mKm6xPwokRMnqlSGSflz8",
    "grid": "SI2",
    "address": "1271 Bay St, Staten Island, NY 10305, USA",
    "rating": 4.7,
    "user_ratings_total": 413,
    "phone_number": "(929) 392-2652",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkM1VIVlhkMkZCYkRKUFdrOVRNbFpLYTBReU5uYxAB",
            "text": "Delicious food. Excellent service. Lovely place. Grazie mille Chef Massimo! 👨‍🍳"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pab2FFWXliRUZ3TUZsb1RtMTRaR28zVjFKelRsRRAB",
            "text": "Massimo and his team never disappoint. Get the shoemaker entree just incredible. Love they have the vinum meatballs."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxR1FubHNPWEphWTBkR1VEQkJXa0Z3YWxCUVJHYxAB",
            "text": "1st time diner. Delicious food and Attentive staff. Large portions. Definitely Will be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNWFXMTVka0pZVW5aMFdHTTFUazlRWVdkNFJsRRAB",
            "text": "Food was excellent.  Try the vegan food. Drinks are amazing lots of top shelf options. Miguel is the best server and mixer!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRVYxaHpaRnBSZUZnMWRsbzNVSFp1U0VOdVQxRRAB",
            "text": "Miguel was the greatest! Super friendly and inviting - definitely kept a smile on our face the whole time!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TVIyMVhkbDlYUW1aUWVrMVlRMmxMVUZsclpsRRAB",
            "text": "Although Food is good, service isn't.  Two servers only for a full restaurant on a Friday evening.  Very noisy! Definitely need to hire more servers.  Waited a long time to get main course."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMFZVbExlWG94VjI5cFMzUkljRkZrVlVRNVUwRRAB",
            "text": "My partner and I chose to celebrate our anniversary with dinner at Don Cheech because there were vegan options along with the regular menu (I am a mostly vegan eater). The staff was welcoming and friendly (especially Adrian), the atmosphere was lovely, and the food was delicious!\n\nIt is so hard to find a place that has strong opinions for both vegans and omnivores, but Don Cheech fit the bill! We’ll be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GT1RXbEhSMUpHWWt0bFZGOVdRbWxYUTJoT1RFRRAB",
            "text": "I see why everyone raves about this place! I wasn’t sure how much I was going to like it because I like Italian but I’m not obsessed like some people are. But everything was so delicious and perfectly cooked. I had squid ink pasta pescatore and it was perfectly Al dente. It’s hard to find homemade pasta and a pasta that even outshines the fresh seafood it came with. The tripe is the silent appetizer that wins my heart. It was soothing and clean. I want this every time I come here. Our server Adrian was incredible and very kind. I will recommend this place to anyone who asks! Please come and support, I want this place to be here forever!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUE1YRmtOR3hoYlc5clJWUjRRVkl3WlcxT1lVRRAB",
            "text": "Unbelievable food, fresh ingredients. Great service, can’t recommend enough."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGc1ZuRjNiREJuTVdSWU9WaHNWMDVwTFZwdFNVRRAB",
            "text": "Service was fantastic! We had such a lovely  evening and will be  back again, thank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRFJYRkxkRlpCZFhSR05IRmpiazVxWVZWWlRYYxAB",
            "text": "Celebrated my 41st birthday with my family! My son love it and keeps talking about it!Don Cheech was amazing, Service was excellent, food was delicious with generous portions, and the atmosphere was beautiful. Highly recommend—Chef Massimo is the best!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNU5rY3hZbmxXYkdocFNXZEZTVEpuTnpWYVlYYxAB",
            "text": "Best food, thanks"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNFVqSkhaMWhrUjAweWNFOHRNMVJLVTNrdFVXYxAB",
            "text": "Excellent food and service. Between the chef and waitress the whole experience was amazing. They even gave a bottle of champagne for my sister’s birthday. Such an amazing experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aVVYbDBablJoTmxsaldWSktTemhtUlVSNFJtYxAB",
            "text": "Superb dinner at Don Cheech! Cauliflower Steak, stuffed zucchini flowers and truffle meat balls were exceptional! The  Bucatini La Zazzoni was divine!! Not to be missed. The service, venue and wait staff are above and beyond! Thank you, Chef Cheech, for an exquisite dinner once again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eVJsSktaR1JwYmpGd2JrZFBVVGhaWjFvMWJtYxAB",
            "text": "Outstanding service and traditional dishes like nonna made. Chef introduces interesting and flavorful twists on many entrees. Chef is around to talk about food and ensure quality. Very welcoming and is upscale without upscale prices. Try the desserts too. Don Cheech will be in my rotation."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMGVuVnhZVFF6TnpKaGVYUnROazl1YUhsR1dWRRAB",
            "text": "Thank you Lisette for phenomal service!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwemJIRTRURGswVUZvd2EyWkdkMXAwVXpWM01HYxAB",
            "text": "Lisette was awesome! Food always great!!!!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcWQyeFdWRFZsWlRKU1JXazNZMWgzV2tsR2RuYxAB",
            "text": "I recently used Don Cheech to cater an event for over 100 people. I couldn’t be happier with the experience. Not only was the food delicious, the delivery was flawless. It arrived on time, hot and easy to set up.\n\nI have also ate at the restaurant and had a great experience there as well. I highly recommend!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdFpWQllkMVJXU2prelNHdFNMV1EyVlRkSGJYYxAB",
            "text": "AWESOME"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMVpISlljWGs0V1hWRUxVMTJaR3czTTJKb01YYxAB",
            "text": "Delicious dinner, attentive wait service, valet parking."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeFpWbHhkMWhMTVRNd1NqaGhZbmhQVEZwdFVtYxAB",
            "text": "The food at Don Cheech was absolutely amazing. Tasty beyond words. Server Adrian was pleasant and efficient. And kudos to the superlative chef."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdlEyMWFSVVF6WjFwMmFYY3dhMnhQTTBOcVVVRRAB",
            "text": "We’ve had the pleasure of eating at Don Cheech many of times and each dinning experience has been a pleasure. Massimo as owner and chef is hospitable and he makes it personable and welcoming. It’s like eating Sunday dinner with family every day of the week."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WeldrbzFTRzlLTUhoMVZrcFVTMlZvTnpaQlEwRRAB",
            "text": "Had such a great night at Don Cheech. The service was warm and welcoming, and the food was truly some of the best Italian I’ve had in NYC. The pasta was outstanding, fresh and full of flavor. I tried wild boar and duck prosciutto and salami for the first time, which were unique and absolutely delicious. The wine list is impressive too, with some incredible bottles that made the meal even better. Definitely save room for dessert. The napoleon was unbelievable with perfectly flaky layers and the most delicious custard cream. Overall, a wonderful experience and absolutely a place worth coming back to."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbXRIVkl3EAE",
            "text": "Evened Italian cuisine. Beautiful outdoor space. Massimo and Deya keep outdoing themselves!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTmVFNUtjVXQxVkMxNFpVaGtWRVZJT0ZKU1VuYxAB",
            "text": "We had a wonderful Wine dinner experience. The food was just stunning and excellent presentation."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMWJuQjVNbWMwTXpoVE5HOVVZVU5xVXpCdFRFRRAB",
            "text": "Probably the best restaurant in Staten Island. Great atmosphere,  the service punched well above its weight, and the food was incredible. Definitely check it out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GYWJqY3hYeTFrYzBsclFUaFpWVmM1UzBGbGVYYxAB",
            "text": "The sausage pizza with vegan cheese was a 10 out of 10 I would definitely return. Such a great option for dairy intolerant people"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKYWRHcFROVmhXWjBoemIxSm9hSGhqWTFKSmIwRRAB",
            "text": "Dined at Don Cheech this evening and the food was extraordinary, but the best part of the experience was our server Miguel.\n\nThanks, Miguel you moved the experience to the next level!\n\n~ Dr. Janet Leslie"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeVRtOW5UMGR1TFhOSmVEVmtNbGxFTlhGQlkxRRAB",
            "text": "I had the pleasure of dining at this dynamic establishment. The food, atmosphere and service were top-tier. Miguel was our server and I cannot describe how incredibly professional, kind and courteous he treated us. I will definitely come back again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVGR6aFhjekZDWmkxYVVVOXdNRkU0TFhCdE4wRRAB",
            "text": "Miguel was a great waiter and the food was amazing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVFEyMXNSVU5wYlhGR1RuVjJTRVpFVlVNMlFYYxAB",
            "text": "Meatballs!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWaWR6QTFPWHBYV0VobFYwUlRNVXd6WTJodmFsRRAB",
            "text": "Absolutely phenomenal meal at Don Cheech today—every dish was bursting with flavor and the service was top-tier. Five stars without question."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSZlN6Skdiek5XV2tzdE9USnVRVnBpWlU1MWNsRRAB",
            "text": "I am writing this review more for the owner than anything else.  The food was amazing.  Top notch.   Appetizers , Entrees ,  great selection.  Food was delicious.   Where it fell way short was the desserts!   The description of the desserts made your mouth water , and based on the food I just ate , I was truly looking to a great ending.  I ordered Tiramisu and my friend ordered the cheesecake.  So disappointed.  I was expecting a nice square fluffy creamy piece of tiramisu and ndtead I got a champagne glass with a dessert that was like paste.   Sent it back.  My friends cheesecake was a circle.  Lont story short it was like they bought these desserts at Costco and pulled them out of the box.  Again I am saying this because this is a very good restaurant, and I hope it’s around a long time , but you have to up your dessert quality.  Good luck.  I will be back amd I hope to see and taste a higher quality dessert"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWk1rWmtiSGxWWDA1aFlXeG5UVWMzVFRWcVJXYxAB",
            "text": "Had a lovely time there for Sunday brunch.  The staff was pleasant and attentive.  The food was amazing!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGU1VtdHBRbk42UjAxTmN6Sm1Wa1I1YUVoUk0yYxAB",
            "text": "We had the best experience at Don Cheech! Our waitress, Tori was incredible! We cannot wait to come back to try all of the menu items! We ate the chicken parm , squid ink pasta and many others that were tremendous. Ask for Tori, she is the best !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMFFrOTRiMnN3TUMxdlZtcHdhSFYzUW1jMmMwRRAB",
            "text": "Mike was very attentive. the entire order was correct and we finished everything on the plate. the oyster's on the half shell were fresh and a nice start. we gad the veal chop, the bronzini, and the salmon.everything was cooked perfectly! we can’t wait to return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVWVqaExkMDl3VFdkTVVEWkpUMHh2UjJaeVNWRRAB",
            "text": "Darling Italian restaurant in Staten Island! Chicken and meatball parmigiana were excellent and Adrian was fantastico! Excellent service!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMFMwOVRRVVpDUm5acVNtaEpWelZXTms4dGMxRRAB",
            "text": "No me puedo quejar, este lugar es unos de mis favoritos es la primera vez que visitamos este lugar y nos encantó buen servicio buena comida"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZk1FTlphMFJLVnpaRGVHaHZlRk5hTkRsV01XYxAB",
            "text": "Excellent food, great presentation, very prompt seating and service. Chef Massimo and his wife are always very warm, welcoming, and down to earth"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waU5XMXdaRFJhYUU0eE9HRmpXakEyZVRCbFNIYxAB",
            "text": "We came on an anniversary trip and Don Cheech was recommended. The service was impeccable, the good delicious, the atmosphere was quaint and intimate.We recommend this restaurant if you want a great authentic Italian dinner without the Manhattan prices."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdnN2dmxRRRAB",
            "text": "Dinner at Don Cheech in Rosebank, reputed to have one of the best chicken parms in NYC.\n\nWe started with their spicy fried calamari. I had the filet of sole Milanese with salad; my friend had the chicken parm (which was excellent) with cavatappi.\n\nIt’s a lovely dining room and the service is very attentive. I will definitively be back. It’s a large menu and there’s lots to try."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdG9yTjdnRRAB",
            "text": "Where do I begin? Don Cheech is a hidden gem. Everything about this place is special. We were lucky enough to be introduced by Staten Island natives. This was our second visit. From the time you walk in, you are treated like family. No expense is spared with the finest quality ingredients. Miguel was our host tonight. He is a very special person and made the experience all the  more memorable. He knows the menu inside out and was eager to recommend dishes for us to try. Andrew the parking valet was the nicest person and went above and beyond as well. Treat yourself and your family to authentic Italian cuisine. Go to Don Cheech, today! I guarantee you will have a culinary extravaganza!  Back again and received the long list family welcome and treatment from Lizette. Don’t miss out. Got to Don Cheech today!!! God Bless Blue & Gold! God Bless America! Remember Everyone Deployed Everyday!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfX3RqaXlBRRAB",
            "text": "I highly recommend this fabulous restaurant. The food was so delicious. I actually can’t wait to go back there again with friends. The service was great and the ambience was adorable. The owner and his wife really know how to work a room and stop at every table and actually took the time to speak to people which I thought was really beautiful.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sb1kxaEdkbTVJWXpnMk0xbGpMVmhDYkRSWGEzYxAB",
            "text": "We were pleasantly surprised. From appetizers to dessert, everything was delicious.The Duck was awesome!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbjYySTJBRRAB",
            "text": "After my marriage ceremony, I couldn’t be happier with my decision to celebrate at Don Cheech. This restaurant exceeded all expectations in every way.\n\nWe ordered a variety of appetizers, including baked clams, meatballs, calamari, burrata with tomato, and Margherita pizza—each dish was simply outstanding. Every bite was bursting with flavor, and the quality was exceptional.\n\nFor our main courses, we enjoyed the chicken parmesan, veal chop, steak, burger, and rabbit, and once again, every dish was executed to perfection. The flavors, presentation, and preparation were all top-tier.\n\nThe service was equally remarkable. Our server ensured that everything flowed seamlessly, checking in regularly to guarantee that each course was perfectly timed and that we were all satisfied.\n\nThis was an incredible dining experience, and I will absolutely be returning. Don Cheech is truly a gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEM1l1YXdRRRAB",
            "text": "My boyfriend and I went to Don Cheech last night for the first time and it was incredible. We were warmly greeted by the hostess upon out arrival, and then walked into the back dining room which was absolutely STUNNING. The food was AMAZING! Everything exceeded our expectations and was delicious. The service was lovely as well, we will definitely be back for future date nights."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCd3Fmd0JnEAE",
            "text": "Food was delicious.  My orders didn't come as presented in the menu...Nonna's chicken, vegetable and tortellini  soup...didn't include the tortellini...once they acknowledged it... ditalini was sent  in instead🤷‍♂️...ordered the salmon bread crumb & pesto included with asparagus....missing the asparagus...spring vegetables  were sent instead...a bit disappointed  since all the food was delicious..but not as ordered\nService  was a bit rushed...maybe because it was a Saturday night... great tunes playing all night & romantically lit..#Happy56th!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPWHpfT0Mwa3NuVy1nRRAB",
            "text": "I just attended the wine dinner at Don Cheech and it was fantastic!  They have these dinners every month, at the end of the month.  The dinner is a 4 course meal, including wine pairings and a delicious dessert. One of my favorite moments of the night was when Chef Massimo cut the Porchetta. You can hear the crackling of the skin like a crisp \"potato chip\".  It was a fabulous experience and the food was mouth watering!  I will definitely attend these dinner's in the future!  Amazing experience!  I can't believe I that I missed out on the previous wine pairing dinners.  You must attend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcE9TTkF3EAE",
            "text": "I’ve been here multiple times and am writing this review to give 5 stars for the gluten free chicken Parmesan. It is perfectly thin cut, cooked crispy, and huge portion. If you’re gluten free like me, you’ll know how difficult it is to find GF versions of this specific dish, especially one that is done this right. I don’t particularly care for the service as the waiters are a little strange and not like the typical personalities you see at most restaurants on Staten Island…but this dish is so good I just have to keep coming for it.\n\nPS. They need to improve the GF chocolate cake because it is incredibly dry and needs something to give it more moisture. I appreciate the effort however."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJcXlqWmpJb2FXcnN3RRAB",
            "text": "We celebrated our daughter’s First Holy Communion at Don Cheech this weekend, and the experience was nothing short of exceptional. From the moment we booked, Massimo and his wife Deya were incredibly kind, attentive, and deeply committed to making our event special. What truly set them apart was their personal touch—they were present on the day of the celebration, checking in multiple times to ensure everything ran smoothly and that our guests were happy. That level of care and attention is rare and incredibly appreciated. The food itself was outstanding—every dish bursting with flavor and deeply authentic. If you appreciate traditional Italian cuisine, Don Cheech will taste like home. I highly recommend them for both special events and everyday dining."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3Z0luWnBnRRAB",
            "text": "Don Cheech does not disappoint! The service is top notch and the diverse menu offerings will satisfy any appetite! Everything was perfectly cooked and presented. A must go to and now at the top of my dining favorites!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPN0s3YWJREAE",
            "text": "Restaurant was decorated amazing!! City vibe, vibrant colors, jazz dinner music..excellent. Cocktails were amazing, oysters, entrees were big and tasty. Would’ve been a 5 star however, The one issue Don Cheech suffers from is poor service. We had a pretentious waiter with glasses who never introduced himself to us, and we waited 30mins before receiving our first round of drinks. Luckily we were saved by another staff member Taylor, who literally became our “waitress” for the remainder of the evening. If Don Cheech can hire more help like Taylor & not “pretentious glasses man” they’ll do great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbmZTOEV3EAE",
            "text": "Mike was amazing! The customer experience was out of this world. Lizette and Victoria were the kindest souls I’ve ever met. They brought an atmosphere to the restaurant that I’ve never felt before like let me tell you I’ve been to places I’ve been to Italy. I’ve been to Spain. Nothing compares to what the experience I had with Lizette and Victoria.They have a bartender named Joe. I highly recommend him and the food oh my! I tell you what it was by far perfection. I highly recommend and definitely will be back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOU0tS2dBRRAB",
            "text": "This place was so delightful. Nice little touches. The bathroom smelled like roses. I loved the plushy seating and decor. Seemed very clean. Both of our pasta dishes and the chocolate ganache cake were *chefs kiss*"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfODYzUjJnRRAB",
            "text": "We just had my grandmothers 75th bday on 1/25/2025 and it was AMAZING!!!!! The service was AMAZING our host Lissette was AMAZING!!! The food AMAZING !!!!!!! We had a large group of 20. (I did make a reservation bc it was a large group) it truly was such a fun time. The price was affordable which i liked. And the venue is also beautiful. I HIGHLY RECOMMEND DON CHEECH. I’m definitely coming back. Thank you to Dreya and Lissette"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6bkl1QzdRRRAB",
            "text": "I can’t say enough about Don Cheech Restaurant.   I had my daughter’s graduation dinner (5/30/2024) at this restaurant.  Lisette was amazing from the first day I called her to set up the dinner.  The food was amazing.  The service was great!  Lisette above all was phenomenal!  She certainly made the evening special for my daughter, but also for my entire family.  Thank you Lisette for your hard work, professionalism and for attending to our every question and need.  Will be going back soon!!\nThank you! The Vega Family."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1bTRXQmJ3EAE",
            "text": "Outstanding drinks especially the house special cuban old fashioned. Appetizers are authentic well executed, high quality ingredients and most importantly very pleasing to the taste. Spanish white sardines are exceptional and the carpaccio is to die for."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRVprRXpWRk0xWVhGblNHeHdYMjg1VVRoRlVuYxAB",
            "text": "I have been to Don Cheech on numerous occasions. My wife and I celebrated our 36th Wedding Anniversary there on 6/17. We had a Gift Certificate from Vinum who informed us that it would be honored at Don Cheech their new location. My Wife and I were very disappointed when we were informed the Gift Certificate would not be honored. While I have enjoyed the dining @ Don Cheech,  I will not be patronizing the establishment any longer.\nThat is no way to treat loyal customers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0aE1lb1p3EAE",
            "text": "This restaurant is next level. Food is out of this world fantastic and the cocktails are terrific. This place will impress even the most seasoned guests! Highly recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdS0zNlJREAE",
            "text": "It’s a fairly new restaurant and I was not disappointed. Food and desserts were delicious. Restaurant is beautiful and very welcoming. The waiter we had was attentive, but seemed like he didn’t want to be there, but it could’ve been nerves since it is a new place. I will definitely revisit. I had the stuffed gnocchi cacio de Pepe, and my family had the chicken parmigiana, Pennette arrabbiata, cheesecake, tiramisu, the garlic bread focaccina and more."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaWR1d2VnEAE",
            "text": "I recently had the pleasure of dining with friends at a wonderful Italian restaurant on Staten Island called Don Cheech. I would like to share my review. Here are some of the highlights:\n\nFood\n* The food was absolutely delicious, with a wide variety of traditional and inventive Italian dishes, gluten free and vegan to choose from.\n* Our table of 6 friends ordered and shared multiple appetizers which included: stuffed long hot green peppers, Fried Calamari sautéed with cherry peppers, old school meatballs which were so light and truffles in carrozza. Each dish was expertly prepared and bursting with flavor.\n* I ordered tuna which was a special for the day. It sat on a bed of arugula and a delicious pesto that had a touch of walnut. The presentation of the entree were also beautiful, making each dish a feast for the eyes as well as the taste buds.\nService\n* The service was top-notch, with friendly and attentive staff. Owner and Executive Chef Massimo Felici made a point of visiting our table and was happy to answer any questions we had and made excellent recommendations.\n* We never felt rushed and were able to enjoy a leisurely meal.\nAtmosphere\n* The atmosphere was warm and inviting, with cozy lighting and tasteful decor.\n* The restaurant had a relaxed and comfortable vibe, making it the perfect place to unwind and enjoy a meal with friends or family.\nOverall, I highly recommend Don Cheech to anyone looking for a delicious and enjoyable dining experience. We are looking to return soon."
        }
    ],
    "reviews_count": 61
}