{
    "name": "Taste of India II",
    "place_id": "ChIJ1_AfcVJJwokRqIHq3OuJwow",
    "grid": "SI2",
    "address": "287 New Dorp Ln, Staten Island, NY 10306, USA",
    "rating": 4.4,
    "user_ratings_total": 659,
    "phone_number": "(718) 987-4700",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcFdUZFlNMkoyU1U1UmNHODFjalZIYjFod1JXYxAB",
            "text": "Ordered takeout from here twice, the price to quality ratio is good for the curry. The samosa and roti r kind of overpriced for how much yhey give you though"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSlJFMWxOVk5EWVZwWk56RlNWSGcxYURCb0xYYxAB",
            "text": "As a frequent traveler who lives in New York City with access to many top Indian restaurants, I am quite fortunate to be a regular at Taste of India, where authentic dishes are created by natives who are expert in the cuisine.\n\nI start with a cocktail, and my wife and I have had many great ones, which is one of the surprises that awaits you at the restaurant.  In the photos, you can see my chocolate martini, replete with chocolate powder, chilled, and a cookie. It’s delicious every time. When I finish it, and I do so rather fast, I am always asked if I want another, yet It’s strong enough that I have to stop at one, since I’m the driver. I’m a lightweight!\n\nI then shift to appetizers, beginning with Nan. I can assert with great confidence that a few if any make it better. I’ve tried nan everywhere and none compare. It’s crispy, it’s hot, it’s buttery, it’s flavorful, there are many flavors to choose from. It’s seasoned perfectly.\n\nAnother favorite appetizer — shown here in the photos, is vegetable Samosa. It is always served hot it is sort of an amazing Indian version of a knish. Delicious!\n\nFor dinner, I typically get the tandoori chicken, which is hearty, perfectly cooked, and seated on a bed of onions and peppers, served sizzling hot on a skillet. Another version of tabdoori that I get salmon and it’s flavored perfectly, with the fishy taste baked away and seasoned deliciously, served on a skillet rather hot as fish should be.\n\nThe dining room feels as you want it to feel at an Indian restaurant, with seating and ornaments that give you all of the feels an Indian restaurant and certainly not a cafeteria as some do.\n\nThe staff is genuinely friendly, helpful, attended, and thoughtful. On my latest visit, my waiter, who is always so kind and welcoming, rattled off everything I wanted even before I said it, Because he knows what I like. That he remembers is a great thing isn’t it?  Then he suggested a new dish, which you see here in the photos and I loved it, the reshmi chicken, which was tender, juicy, and seasoned perfectly.\n\nTaste of India is my go-to for Indian cuisine, and I hit pay dirt having it just blocks from me."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMjRiUVFBEAE",
            "text": "Consistently excellent and the service is attentive and friendly.  Highly recommend the lamb korma and lamb chops (ask for mango chutney for the chops). Taste of India is also a great choice for anyone who has celiac disease and needs gluten free options."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMGIwWnZaVzFTZWt0ZmRraG1XRlJJWjA4MlRVRRAB",
            "text": "Our absolute Go-To for fresh, delicious savory Indian fare! We've been coming here for the better part of their 35 years in business and have never been disappointed! Every time we dine at Taste if India, they work their magic with a myriad of spices. The service is top\n-notch and they even have an enviable drink menu. Definitely a must-try if youve never been there!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjeWFWcHFUbXBWY0ZsR00ybHVjRE0wYVRjM1dHYxAB",
            "text": "Had a 60th birthday lunch party for my husband, there were 35 people including children. The setup, buffet and service was excellent. The appetizers, followed by lunch and dessert was excellent too. Everyone loved it. The ambience was great, we added our own little decorations and brought our own cake. The owner Mr Raman, the manager and the staff were very good, they served us well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbFJrZzNRVFJzY25WS2IxOXRNelp3VDNCa2MwRRAB",
            "text": "Amazing Indian food and very good service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVGJFZ3RVMWhaUmt3eGFrazBMWHB0VG1kdWNYYxAB",
            "text": "It was great. The vibe is great! Foo is even better!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNlNYTmFSMm90TlROU2RGOVNORFZVWjBOdVlWRRAB",
            "text": "Food is flavourful and tastes indian, we had a few items all perfect, but they need to indianize their chicken tikka. This one item took away the 2 stars in my review.\nService and atmosphere is very good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSVdrMHpaMVZvUTB4MlRTMHdhVzlpVms4M1EzYxAB",
            "text": "Had Samosa Chaat and a Prawn dish with vegetables.  I cannot remember what it was called but it was delicious, as was the Samosa Chaat. Will definitely return."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNEkyYmxBRRAB",
            "text": "I'd say it's the best Indian food in town."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaFZIQjBPRzV1TW0xUGVYTkNUa3g2YUVGcVoyYxAB",
            "text": "Great authentic Indian food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWa2MwNXFjMjh4YWt4UVNtZHpkSHAzYlVKNmMyYxAB",
            "text": "good food, service and ambience! the dal makhani and garlic naan tasted really authentic and everything else was also delicious, they were super accommodating for a wheelchair. beautiful on the inside with the lighting and wall art"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SYVRtMU5SSHBQYVhONVNqUkRXVGd6U1Vod1RGRRAB",
            "text": "Only place we go to for Indian. The good is delicious and waiters very nice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGc1EyeDZORmRITlROUGRqVlBTVFJ1VGpabE1XYxAB",
            "text": "Taste of India II is probably my favorite place to eat on Staten Island. They have a ton of vegan options, everything is delicious and flavorful, and the service is top notch. I come here for a lot of special occasions such as birthdays, anniversaries, and family outings. I highly recommend it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbVFVdzNTbFkzTlhaeVlsOTBSa05QYVMxc1prRRAB",
            "text": "First time trying Indian food and it’s really great tasting really enjoyed it"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMVl6STVSbWxQT1VWRlVYRndMVEZ1TTA4MFIwRRAB",
            "text": "Ordered takeout from here and it was the most delicious meal! flavor packed dishes, large portions, worth every penny! My favorite is the curry chicken and aloo paratha. So glad this place is nearby. Can’t wait to order again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVVpXMHlaVEJIYmpsMFZFcFJObnBCTWw5WVEzYxAB",
            "text": "Decent food. A bit too expensive for the portion sizes they give."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJVzltbzdqXzl1QlRBEAE",
            "text": "Mango lassi was the most expensive I've seen ($10 for a SMALL glass). Food portions were medium."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNE1lVHp3RRAB",
            "text": "Food is good the service is probably the best I've witnessed in a long time. Also the best I've had."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLX2J3TWJZMXZicXpBRRAB",
            "text": "Fantastic India food spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNWJ5aHZRRRAB",
            "text": "This was one of the best Indian restaurants I have ever been to. Everything was great including a flavorful lamb chops. This was an amazing experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2U2RTJnRRAB",
            "text": "My go-to Indian restaurant in Staten Island. Everything’s good from staff to food and ambience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdEphVkR3EAE",
            "text": "So good for real , I just ordered chicken curry so delicious 😋 the best until now in nyc Staten"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveWFDeE53EAE",
            "text": "I never been to this restaurant to dine in, but I have been ordering from them through uber eats and I must say, I’m in love with their food! I have ordered multiple times and they never disappointed! Looking forward to the dine in experience soon!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRZ3BIWExnEAE",
            "text": "The restaurant presented welcoming. And upscale The staff were friendly , professional and helpful. Food was delicious ."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMy1pOGVREAE",
            "text": "We recently ordered food for a group of over 10 people, and the experience was flawless! The delivery was right on time, and the packaging was incredibly well-organized—each meal was packed individually, making distribution super easy. Not a single item was missing, which is impressive given the large order. The food itself was fresh, flavorful, and exceeded our expectations. If you’re looking for a reliable Indian restaurant for group orders, this is definitely the place to go. Highly recommended!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbWNYV1JnEAE",
            "text": "I can't stop raving about this place!!! I don't think I have ever had food that was this delicious.... imo 5 stars isn't enough to properly rate it. Even when full I couldn't stop eating it!!! And the prices are great!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOHQtcTlRRRAB",
            "text": "This place is fantastic. I love their food and I try to come here whenever I’m in the area! Try their goat dishes and chutneys if you get the chance!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbklPRmtnRRAB",
            "text": "Amazing spot in Staten. Food is always full of flavor and the drinks are amazing,strong and well presented. Only thing I would wish for is to see a manager so I could congratulate him for having such great staff!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdHNQN3lRRRAB",
            "text": "This was my first visit and last in this restaurant sitting and service was good but food was not good i had navratan corma was tasteless gravy was half cooked.And also dall makhni was very watery. They call dall makhni but makhni also was missing🤣 sweet lassi also very sweet very small serving glasses and price to high ."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMXRqOWJnEAE",
            "text": "My husband and I went for a late anniversary date with our little girl.. we've been in a lot of Indian Restaurants and really love the food! This place is clean, fancier than i thought 😀 and very hospitable crew! The food is so good.. my husband love spicy 🌶️ and what i like is some places have very spicy that you don't appreciate the flavor anymore.. this place has the right spice and much flavor at the same time! check it out!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeGNITlN3EAE",
            "text": "The food was so delicious!! Will definitely come back! Thank you!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfcFBmYXlBRRAB",
            "text": "Amazing food! The naan and palak paneer is perfect and fresh"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNnVMa1p3EAE",
            "text": "My wife and I have been coming to this restaurant for quite a while, and it has become our absolute favorite Indian restaurant! The food is consistently amazing, with authentic flavors and a great variety of dishes to choose from. The service is always top-notch—friendly, attentive, and welcoming every time. We’ve never had a bad experience here. Highly recommend this place to anyone who loves Indian cuisine or is looking to try something new. A true gem!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MmI3cVJREAE",
            "text": "Been coming here for over 20 years, always been a family favorite. My parent took us as kids and now we’re doing the same. Very nicely decorated. The ambiance is great. Great date night spot or girls night out. The food is always delicious and the staff is extremely efficient."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NjR6ZG1BRRAB",
            "text": "Very clean, friendly hospitality, delicious food. Probably some of the best indian food ive ever had. I had the chicken vindaloo and told them spicy is fine by me, they didn't disappoint."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cTltbGh3RRAB",
            "text": "My experience at this restaurant was excellent. The food, service, and atmosphere was great! Very grateful to have had my parent’s anniversary dinner here!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eTkzTHdBRRAB",
            "text": "Perfect place for the family and friends. Love the food, Specially made to your taste. Spicy or non spicy. Delicious drinks, friendly staff, cosy corners for couples, spacious for family gatherings.\nHad family party last night. Loved every thing about the Restaurant!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbzVIMkRBEAE",
            "text": "delicious food, friendly service and good ambient."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNWFhMGtRRRAB",
            "text": "Wonderful food and exceptional service! Although I am rating 5 stars and will be back, I think $13 for a can of Rupee Pale Ale is a little much. That surprised me. Beer drinkers beware, lol!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6NTlDMnhBRRAB",
            "text": "I went to lunch yesterday with a friend. The atmosphere was very relaxing. As you may know, some dishes are spicy. The waiter was very helpful in making suggestions for mitigation of the heat. I am anticipating my next visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdnVEbkJREAE",
            "text": "So whenever I travel far to try out a new restaurant I always call ahed to see if they offer halal meat! The manager told me besides chicken the goat & lamb is halal . So that's a relief So if you are living in the island , and wanna try some good food & spending little extra once in a while is not a problem, give this place a try .\n\nI traveled far just to try out this place . Was it worth it ? It was for once in a while , if I don't feel like going to the city then I will definitely come here . For one person to spend almost $60 on lunch , what you all think ..? I can't effort that on a regular basis !\n\nFirst of all end of the day if the food is good I tend to say less about the price . Especially where the restaurant is located , I will not complain much about the price .\n\nThe second I get seated someone came to give me some water , asked me if I liked to drink anything! I highly appreciate that !\n\nThe food was good . Especially the lamb sheekh kabab . $22 for 4 small skinny kabab was a bit pricy ! But it tasted great ! Not dry at all. The goat curry was ok, never seen small pieces like this on a goat curry before ! Cutting the meat so small & putting it on a wider plate to make it look a lot ! The bigger pieces were all bones . The rest was too small, Atleast it didn't taste nasty ! The regular Lassi was good . Loved the naan .\n\nBtw, you can see the place is beautiful! You know me & I had to check out the restroom. it was clean & big enough!\n\nAnd loved the service .  My server was ISHAAN He was polite, helpful. Didn't had to ask him anything, he always kept checking up on me. Much appreciated! Thank you so much !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURELU1TMkRREAE",
            "text": "We had a girls' night out on Friday, March 29th.  We have been to this restaurant before, and it never seems to disappoint you.  The quality of food is amazing, the atmosphere is nice and the drinks are tasty."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVb3BHVFB3EAE",
            "text": "I was in the mood for some Indian food so decided to try this place out. I made reservations online and when I arrived I found parking on the street. When I walked in I was greeted by the manager and taken to my seat around back. The ambiance was really nice and clean. Our server's name was Denzel and he was very nice and attentive. For drinks I ordered a Pomegranate drink and a glass of pinot nior. My friend ordered a double shot of Hennessy. The drink was very refreshing. For dinner I ordered the channa marsala with roti and my friend ordered two meals of course which he couldn't finish lol. The goat with spinach he ordered looked good and he loved it.  He also ordered salmon in sauce and I tasted the sauce and it was really good. My channa marsala was very good with the roti. All in all my experience was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiajcySFdnEAE",
            "text": "2024.08 haven’t visited this place for a long time.  Don’t hv much Indian food exp.  So far all Indian restaurants I went have pretty much same menu and same taste.  This one naan is good. Food are a bit spice to me but taste good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbDhIcnBBRRAB",
            "text": "First time dining here and it was a great experience. The ambiance was nice and cozy. Great Service that was attentive and timely. The food was very tasty and the drinks were good. It's a very good spot for a date Will definitely dine here again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMta0piLXpBRRAB",
            "text": "This is the best Indian restaurant I’ve ever been to! I’ve been going here for years (before the renovation) and it is absolutely amazing. I moved to NJ and I come back to Staten Island just to come here every few weeks! The food is always amazing, flavorful, fresh, hot. The staff are always friendly and patient. The food is on the pricey side, but you get what you pay for…I would eat here everyday if I could. Absolutely delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCd3V5M05BEAE",
            "text": "The food was amazing. The tikka masala was delicious and the vegetable samosa was insane and was a hefty size !!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocVppT2RnEAE",
            "text": "There were two dishes we were not a fan of: pickled mango [too grainy] and the rasmalai [dense]\nI really enjoyed the sweet lassi and my friends enjoyed their specialty drinks. The service was attentive and friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd3VuTFlREAE",
            "text": "Every taste was simply amazing 😍!!!\nDefinitely coming back!!!! 😭❤️❤️❤️❤️\nI 1000% recommend this place to anyone looking for good food on the Island and beyond. You will never regret it!!!\nBest place I've eaten on Staten Island!!!"
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0cUp2bU1BEAE",
            "text": "Не раз бывала в этом заведении ,и каждый раз очень вкусно ,сервис отличный ,а атмосфера спокойная ,отличное место !"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3bk9QODBBRRAB",
            "text": "Very nice place and good food. Also felt welcoming right away by greeters at the door. This place looks clean and almost a little upscale. Indian food 🇮🇳 is very delicious and here they know well how to present and make it delicious.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MkpteV9nRRAB",
            "text": "This is not my first time here!We absolutely love ❤️ this Indian cuisine restaurant. The food ,cocktails dessert are amazing. A must if you are in the Staten Island area ❤️🙏Ps the staff very welcoming 👍👍👍👍👍👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c3MzR3NRRRAB",
            "text": "One of the best restaurants in the city. I love going back here when I come home. Such a nice atmosphere and outstanding staff. Great food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtcl83ZE1REAE",
            "text": "The food is awful. Not fresh and hot. The chicken was not seasoned well. The service was okay. I would not recommend this place to anyone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkcEp1bkJBEAE",
            "text": "Never disappointed. I have been going to Taste of India ll for many years, since long before the remodel. The food and service has always been great. The atmosphere is much nicer after the remodel. The owner is not always there but when he is, he makes a point to go around and check in on everyone. He's always so kind. My husband and I went for dinner tonight and the food was delicious as always but the best part was the exceptional service from our server Shaan. He went out of his way to accommodate us. We are so grateful he made our special evening even more special. I highly recommend this place and will continue to visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEOU1pU2xnRRAB",
            "text": "I went there for my daughter's birthday. The food was fresh and delicious and service was the best. The entire staff was very attentive and very nice to us. We were so full from dinner and didn't have room for dessert,  but the staff brought out a delicious piece of cake,  free of charge, for my daughter with a candle in it,  and played a birthday song over the restaurant speaker.  She was so surprised and so happy.  Even other customers were wishing her a happy birthday as everyone was leaving.  The staff really made my daughter's birthday a very happy one. We will definately be going back. I love this place and the staff went above and beyond!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvaGZhSjFBRRAB",
            "text": "Food was terrific. I got a take out dish of butter chicken. It was lightly dry. Sauce was great. Garlic Nan was very tasty."
        }
    ],
    "reviews_count": 58
}