{
    "name": "Raval Steakhouse",
    "place_id": "ChIJ5Zfe7DVPwokRVyoUHJ7ei04",
    "grid": "SI2",
    "address": "12 Minthorne St, Staten Island, NY 10301, USA",
    "rating": 4.8,
    "user_ratings_total": 200,
    "phone_number": "(718) 247-2323",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUlpEaDNVakpNVVRkM2RsaG9NWGhCVDA1WGRsRRAB",
            "text": "The experience at the Restaurant was top notch. The food was amazing and the staff were outstanding. I would highly recommend this restaurant, you won’t be disappointed."
        },
        {
            "date": "수정일: 6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0ek4wUTJhMVZmUXpkbFZITkhhMmx0YVVOTk0zYxAB",
            "text": "For my birthday, I chose a steakhouse I'd previously enjoyed. They offer a party menu for groups of 7 or more, with a great value \"Good Life Menu\"  for $90 per person. Adding $15 per person allows for unlimited wine for two hours.\n\nThey serve in a family-style style, so all the dishes on the menu are served (according to the number of people). The service was excellent; drinks were constantly refilled, and there was no charge for cutting the cake (unlike many restaurants need to charge for cake fee). Overall, it's a highly recommended restaurant, perfect for celebrations and gatherings with friends."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWU9GWjVWek5PUkVKUlJWQnJaVWt5WmpWMmJsRRAB",
            "text": "For the first time eating there it really was excellent. The service was on point and attentive. We went on Friday night and we're not rushed out, for the first time it was very relaxing. They had valet parking security/door man in front outside. We will definitely be going back. The filet mignon that I had was probably the best I've ever had. The drinks were strong and tasty."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSk1rSjJVRFV6V1VwVGMwUklUa2hRVVRoWFgzYxAB",
            "text": "We celebrated our anniversary at Raval Steakhouse, and everything was absolutely perfect from start to finish. We shared a Ribeye steak, oysters, creamy spinach, crab mac & cheese, and bone marrow  every single dish was cooked to perfection and full of flavor. The steak was tender and juicy, the sides were rich and delicious, and the oysters were incredibly fresh.\n\nThe service was exceptional  our server was on point the entire night, attentive without being intrusive, and made sure we had everything we needed. The atmosphere was cozy yet upscale, perfect for a special occasion.\n\nWe truly enjoyed every moment of our dinner here and will definitely be coming back. Highly recommend Raval to anyone looking for a top notch steakhouse experience!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMGNrOHhZV3BZUjFKcU4yVTFUblJhVEdWUGFYYxAB",
            "text": "What could I possibly say.The first time we went here. Was a truly amazing experience. The food was amazing the service was amazing. How they treated you was like family. Let’s talk about the food a little bit. I’ve been to many steakhouses but will put this as ##1. I had the age porter house. It was cooked to perfection. I just shot out a bunch of txts to my friends and family to definitely make it there busy to try to go there. Again you will not be disappointed….!!!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcFlsVkJRMTlmTFZCRVRWQmFVVmN0V0VSd01VRRAB",
            "text": "A local gem of a steak house. Steaks were  cooked to a perfect temperature, rare for filet and medium-rare for porterhouse. Perfectly pre-cut. Filet was buttery soft, absolutely incredible. Peppercorn sauce was mild and complimented the steak well.\nTop notch service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOak5ESlFlQzFVTjIxaVNtZHBTMkY0TXpCTloxRRAB",
            "text": "We ate at Raval Steakhouse tonight. It was 6 of us. First of all, the staff was welcoming when we arrived early and they were still setting up. They didn't turn us away insisting we have a seat at the bar. We were seated promptly at our reservation time. Staff was attentive and friendly. Food was DELICIOUS. Definitely the best steak on Staten Island and comparable quality to nyc or nj. Ambiance/decor was upscale. Would definitely go back as would everyone else in our party. The bill came and the total was reasonable considering the great experience high quality, tasty food and excellent service. Best part no tolls. Shoutout to Nezir and Gent the owners who couldn't have been nicer and their professional staff. Best of luck!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNVFWRjZVV1JYY3pWalMxWlNjMnRKTjFaU2JFRRAB",
            "text": "Ok, lets start with the good. The porterhouse was cooked perfectly. It had a nice crust and tender inside. The shrimp in the cocktail were fresh and large.  The French Fries were crispy and tasty. The cheesecake was soft and smooth. Ok, now the not so good. The popovers were more like crackers.  The wagyu bone marrow barely had bone marrow.  The porterhouse steak for 2 was more like 1 1/2. The wagyu skirt steak was so small it looked like it was torn off of a mini cow's skirt. The carrot cake was so dry you needed the sauce they put on it. Also it was like a hard overcooked slice of bread. The service was extremely slow and forgetful. You have me paying Manhattan prices for Walmart service and food that is not amazing every bite. About $700... $117 per person and not being totally happy is a bit much. (2 of those people were under 9 🤦‍♂️)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UVZEWjBjRmhGZEVKdmFVcGtTR1pvTlRJemNFRRAB",
            "text": "Fantastic food and incredibly friendly staff!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCU01YSnhaM2xXVkU5blJHZzFUVE5XVEV0d2RtYxAB",
            "text": "Came hear for Wedding Anniversary.   Great food, and top of the line service!\n\nWe ordered the Porterhouse for 2, wagyu skirt, mashed potatoes, chili shrimp, and homemade Cavatelli lobster mac n' cheese.\n\nTaste of each dish was superb.  Save the chili sauce from the shrimp to dip your bread, and even steak into as it is delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OZlRUTTJUR295VjBSb1lWcE9NbGxpYTFaT01WRRAB",
            "text": "This place is top notch for staten island if you havent tried this steakhouse do yourself a favor and go ! From the food to the service and the atmosphere everything was 10 out of 10 ! Definitely coming back i got the skirt steak with lobster mac n cheese ! 10/10 It was amazing and we got the bone marrow for appetizer ill give that a 6/10 and to end the dinner order the carrot cake it was so good !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQlIwMDROMHBrWm5GTVdVNVFUV3BsYVhKTU5FRRAB",
            "text": "We were looking for a steakhouse and we found it!!! Hidden away at the bottom of Victory after Bay next to Flagship Brewery. We were pleasantly greeted by the host and seated. I did make a reservation online and although at 630 it was not super busy, it appears to me that reservations are a good idea. Staff was friendly and courteous as if you were a long time customer returning. The menu had a wide variety of steak. There were a couple of non steak items but most items were a form of steak, marrow and  a wagu burger included. I had the skirt steak, my husband had the new York strip. We ordered Mash and shrimp on the side. Everything was delicious. The steak was tender, flavorful and juicy. I had a signature cocktail, I cant eber the name but it was very refreshing. If you are looking for cheap, this IS NOT the place. But cheap will get you cheap food. The food here is top notch and thats what you are paying for. We were two people, two drinks each, main courses and two sides and our bill was over $200 but well worth every penny."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sd1JqTlJjRzEwYVhJMk0xazVkbHBwYjNKamIzYxAB",
            "text": "The  food and service was excellent from the appetizers to the main course ..Fantastic !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kZk4xWktlbmN5ZGpKcFdVMUZiRWhRUlhObGJuYxAB",
            "text": "My  friends and I visited on a Sunday evening and were glad we had a reservation, as the restaurant was full. It's a small, intimate space with a handful of tables, so booking ahead is a must.\n\nThe atmosphere inside was a little dark, but the decor was quite nice and the staff were friendly. Upon arrival, there was a doorman outside, but he was preoccupied with his cell phone, so I ended up opening the door myself. Once inside, we were promptly greeted by what appeared to be one of the owners or co-managers, who then seated us.\n\nOur server, who also seemed to be one of the owners, was very attentive at the beginning of the meal, though he repeatedly asked us about ordering drinks. This was a bit bothersome after the first few times. He took our entire order, including our appetizers and main courses.\nAfter we ordered, our server seemed to disappear. He didn't check on us again, even after our appetizers were served. The restaurant didn't appear to be that busy at this point, so this felt a little strange. When we were finished with our meal, we had to wait a good while to get the bill and process our payment.\n\nDespite some of the service issues, the food was excellent. The shrimp appetizer was fantastic—the sauce was so good that we were given extra bread to dip in it. I highly recommend using the extra sauce for your steak as well. I would suggest skipping the clams, however. The steaks were cooked perfectly and were very flavorful.\n\nThe desserts were decent but small and nothing special. Overall, despite a few service hiccups, the excellent food and nice atmosphere make me want to give this place another try."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0V1IxZDFhMmhtV0hkRVNGUnBTSGhEUmtwWk1FRRAB",
            "text": "Absolutely amazing service and food. The experience was top notch! Highly recommend going for any occasion or even if you want a luxury experience for a girls night out or date night."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKR2NHcFBkR0o1UVVoS1NtVTVYM04xVTB4WlNHYxAB",
            "text": "Absolutely wonderful, everything was done perfect from the food to the decor to the service. Excellent attention to detail in everything, loved the setting was very romantic. Thank you so much for the wonderful dinner!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWWNuaERMVlp1TkRGYVpETk5iV3hYU2tST2NVRRAB",
            "text": "I had an exceptional dining experience at Raval Steakhouse! The food was outstanding, with every dish expertly prepared and presented. The service was top-notch, and Gent went above and beyond to ensure we had a wonderful time. The attention to detail was impressive, from the decor to the carefully crafted menu.\nWhether you're a steak lover or just looking for a great dining experience, Raval Steakhouse is a must-visit. Highly recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReE4wbHVPVkZ2TUVvMFdGbHRaMjlLTmtFd1gzYxAB",
            "text": "We had the most amazing family dinner at Raval this evening. The restaurant is cool and trendy yet classic with an incredibly upscale ambiance. Everything about the place was picture worthy. The staff was incredibly attentive and friendly. We ordered a bunch of appetizers and every one was better than the next! My steak had so much flavor and was cooked to perfection. My fiancé and sister both ordered the wagyu burger, which of course I had to try a bite of, and it was mouthwatering. The lamb chops, filet mignon, and new york strip were all 10/10, this place doesn’t miss! The dessert melted in our mouth and Gent’s customer service, professionalism, and expertise is unmatched. Would recommend this place for a family dinner, special event, birthday, date night etc. So nice to finally have a place like this on staten island!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbVlraEpNekk0YTBSNVdrWkxZVkZPVGtoeFkyYxAB",
            "text": "Amazing/tasteful food and amazing service/staff !!\nwent for my boyfriends birthday dinner and I would definitely go again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbFZFZE5aa0kxUm1GV01HMVZVMWhDUjNSYWEwRRAB",
            "text": "Me and my husband had an amazing experience!\nThe service was very good and attentive. The quality and taste of the food was amazing as well! And the atmosphere very romantic with good music!\nWe will definitely come back again! Thank you !!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkZlNWbDZSbEIzWlY5U2RqZGxhbTFhYWw5S2NHYxAB",
            "text": "Food and service were great!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVVNqWmtNbnBYZWpaNmJHYzRlbnB6ZGpWcWFWRRAB",
            "text": "If I could leave 10 stars I would!!\nI booked my uncles surprise birthday dinner at Raval for tonight and it was truly amazing!!\nNezir, Gent and the rest of the staff were absolutely wonderful!!\nFrom the start we were treated like royalty!  from picking the food on the family style menu, the personalized menus on the tables for all my guests to see the attention we were all given especially myself to make sure everything was perfect!!\n\nThe food was like no other! It was seasoned perfectly the appetizers the pasta the steak the chicken parmigiana (my fave) was so delicious my family couldn’t stop talking about it!! Thank you really for a truly amazing experience and making my picky Italian family so happy! Especially the birthday boy 🥰😘❤️\n\nWe will be back soon\nWith love\nMelissa"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMVdqSjBjRE5MUm5Ca1NXdE9VMm95VVdWa1ZIYxAB",
            "text": "Beautiful place, beautiful experience! Amazingly professional staff! One of the owners Kent couldn’t be more gracious!, the food  was not only amazing but cooked to perfection. Can’t wait to go back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRlZEZG1iRXhIZWpGdlVFdEdjbFZpYTAxRFpGRRAB",
            "text": "Bay and Street & Beyond conducted their event at RAVAL. It was a wonderful experience. The food and service were exceptional. I do hope more of us stay on the Island to support our local restaurant. If you want a great meal with service to match then please come to RAVAL."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KT2JYbHBWa2RLZDB4VGN6aFpkbXBPVEhKaVZFRRAB",
            "text": "Great experience at Raval\nAmazing food,service and drinks!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUloyOXlkVFIyWlhFeldVSXRZVlpCU210M2VWRRAB",
            "text": "First time in and first time in NY. Came for a date night after taking the ferry, and it was the best experience ever! NICO, our server, went above and beyond and gave us the best service we have had in YEARS while dining out. Steaks to die for, mashed potatoes and scallops were HEAVENLY, and the even better service from our server, Nico truly tied it all together. We’d fly across from\ncoast to coast for a dining experience like this again! Thank you Raval and Nico!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xseGRUVkJNVWRrUVVWYVgyTmxha3g1YzNKcVlXYxAB",
            "text": "We made a reservation for Raval online. That was easy. Raval is a really quaint restaurant. Nice ambiance. Service was excellent. I ordered from the restaurant week menu>>shrimp cocktail, grass-fed skirt steak, string beans and cheesecake. The shrimp cocktail came with 3 shrimp, the skirt steak was very well done (like I like it) but not as good as my own, the string beans were super hard with no flavor, and the cheesecake did not taste like cheesecake, at all, and not in a good way. My husband ordered the wagyu skirt steak (not from the restaurant week menu), he could not really tell the difference between mine and his.  He got the grilled caesar with it. My son got a wagyu burger and fries. Fries were good. We also ordered the chili shrimp appetizer, which was excellent. They did bring us a piece of the homemade carrot cake on-the-house, which was nice, but very dry, even with the sauce they poured on it. To be fair, the food was edible, just underwhelming and no complaints were made at the restaurant. I will reiterate that the service was excellent. I did look up reviews before going here and considering all the other positive reviews, I actually would recommend giving this place a shot if you live on SI and don't want to travel into the city but unfortunately, we will not be returning."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeFFXazBXakJIWld0d1FVUnNWSGx1WlVoQ2RGRRAB",
            "text": "We went here for the first time tonight and the four of us loved it! We ordered wagyu steak, ny strip, lobster Mac and cheese, and sides. I didn’t care too much for the grilled Caesar salad (just a personal preference) but everything else was amazing. The service was top tier. Some dishes were expensive but they had price friendly options too.  Altogether we really enjoyed this place and will visit again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNVdsOHpSRko2UlU1cVUzVnhPVEJDWkhoelYyYxAB",
            "text": "Came here for date night and absolutely loved the place. Food was great and the atmosphere was very warm and inviting. We got the restaurant week menu course and it was absolutely delicious. I personally loved the seared scallops. Will definitely come back again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVFVVWlpTbUp0ZW5oYU9WaENOVnBwUWs1dlUxRRAB",
            "text": "Raval Steakhouse invites every guest with the scent of expertly prepared meat alongside a welcoming atmosphere that is safe to say is extraordinary. Founded by long time friends Gent and Naz. Raval is a passion project stemming from a deep rooted affection for the industry and the people.\n\nLets shift the focus to the cuisine offered at the restaurant and how every single dish is crafted to perfection. They offer a wide variety of perfectly aged steaks, sides, appetizers and amazing cocktails. Every ingredient used in the restaurant is of the highest quality, which together with the bold yet refined flavors drawn from the high end cuisine that combine beautifully.\n\nThe atmosphere at Raval Steakhouse is nothing short of exceptional effortlessly blending modern sophistication with a welcoming warmth that makes every guest feel like part of the family. Whether its your first visit or your tenth, theres a magnetic energy here that invites you to relax, connect, and savor the moment. With an affection for the community alongside the industry, this place brings their passion to the table with authenticity that is impossible to find.\n\nRaval Steakhouse isn't just a place to eat its a place to return to again and again.\n\nHighly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRlF6RlRjMVZSVFRka1kyNVBZekJZU1VkNE5IYxAB",
            "text": "Extremely good service and great ambiance. Multiple sides and starters all maintained a consistent high quality. The porterhouse was a particular standout."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSclRIRXlVVW81VFhSc0xYcGhTWE5yV2w5clpHYxAB",
            "text": "Love this place.  The food is really good and so is the service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5emRHWmhWak01TUZwRVlUSk1jelE1Um5BNFJYYxAB",
            "text": "The atmosphere is amazing and the design is straight out of a movie!! But the main thing about this spot is the food (especially the steaks). Everyone I bring here tells me how amazing the food is. Would highly recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMU0wNDBSMFJpVG5CWGVXOWFTak5PZG0xaU4yYxAB",
            "text": "Excellent experience. Great food and atmosphere. Will go again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SGVsbFNhR2hZYVRWVVJWSkRSSEZMTVhWcmVHYxAB",
            "text": "The food was awesome and the service nothing but respectful."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScmJWOUdRbWwyVkdacmNrRmhSWGhLWlc1TVZtYxAB",
            "text": "This restaurant is exceptional from the moment you walk in the door, till the moment you leave. The greeting, the service, the food are all beyond expectations. About the food…sublime! So creative.  Baked clams with some sort of pearl pasta on top instead of bread crumbs! Ravioli stuffed with wagu cooked to perfection. Even my drink was creatively delicious! The ambience is elegant but not stuffy and the lighting makes the room, and the people in it, look beautiful.\nWait staff were all excellent and very attentive. Special shout out to Gent. Thank you, Gent, for making our night so memorable!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVmNXWlZlakZ2ZWtSQlVsTlphMFZ5ZVZaVlkxRRAB",
            "text": "Very disappointing..service was poor.. and the steak was nothing to write home about and the Caesar salad that I ordered was full of pepper not a place that I would be returning to anytime soon and my bill was approximately $600 and for that kind of money I expected a lot more than what I received but then again I'm sure there are other people that have a different opinion but for what it's worth that's mine"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWd1JHMHRRVWQwTUZaSVVFSTBTVVJQUW1OWlMwRRAB",
            "text": "Drinks were good, as well as the food but I didn't like the desserts at all...\n\nThe staff was aware that I was disappointed in the desserts an had me try another one that I didn't like an it was taken of the bill\n\nIt was a satisfying experience 😌\n\nI recommend trying this place..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKYU0xaHliWFZ3VWpKaVJXNUxVbGhDZFRNMWNtYxAB",
            "text": "Lamp chops are really tasty!! Niko treated us really good. Recorded 100%"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVlVuSlZUVW90ZVRaWFlreExMWFZyUkZjNGNGRRAB",
            "text": "Awesome staff, went there for anniversary celebration. The food was 10/10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTmNuVkVOVGgxVlhaa1kycFNZbk5MVUhZNVRuYxAB",
            "text": "Excellent, the atmosphere of the restaurant is cool and relaxing even when it’s fully packed, my wife and I got the wagyu skirt steak which is packed with flavor and worth getting. Also have to shout out the lobster Mac and cheese.\n\nWe ended the night with cheese cake , carrot cake and coconut espresso martini which might be my new favorite version of the drink.\n\nCan’t find a single thing wrong with the spot, will come back here many times again and recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeUp1UXNBRRAB",
            "text": "I had a great time at Raval on a super busy Saturday night. I remembered seeing their cool Instagram videos and decided to check them out. They were fully committed and it was 9:30, with a closing time of 10:00pm so we had to settle for bar seating. But it turned out to be a great choice!\n\nThe place had a great vibe. The decor was beautiful, and the wall of wine bottles separating the bar from the dining area was really cool. The playlist was perfect, and the ambiance was great.\n\nOur bartender was amazing. He gave us recommendations on what wine to get based on what we were going to order and even helped us with our dining order. His recommendations were spot-on, and everything we ordered was delicious.\n\nWe usually go into the city when we want to visit a steakhouse, but we're so glad we found this hidden gem on Staten Island.\n\nThe bread service was 10/10, the bread was perfectly toasted and came out warm and the garlic bread they served with it was amazing. I usually pass on bread but this one shouldn't be skipped! The Australian wagyu we shared was perfectly cooked and so flavorful. The sauce it came with was great, and the fries we ordered were perfectly cooked and crunchy.\n\nThe grilled chili shrimp we paired it with was also delicious. He gave us a tip to dip the steak into the broth, and it was a game-changer! The homemade spaghetti cacio e Pepe was also super tasty.\n\nWe were surprised with a carrot cake in the end that we had no idea we needed!! It was the perfect close to an amazing meal!\nOverall, it was a 10/10 experience. I'll definitely be making a reservation so we can explore the menu and tell everyone I know about Raval."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMWV5alV3EAE",
            "text": "My husband and I dined at Raval for our 1 year wedding anniversary.  This restaurant is phenomenal. From the food to the service. The steaks were SO tender and flavorful. The drinks were made with love and detail. The owner was so kind and welcoming. The restaurant is also so beautiful. If I had to give any critique, it would be to add a staple chocolate cake to the dessert menu as well as a different type of pasta for the mac and cheese (e.g., cavatappi, shells, elbows...). Raval had a great selection of wines and cocktails as well! Overall, 10/10 experience! Run, don't walk to Raval Steakhouse! You won't regret it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NjhTYWZREAE",
            "text": "Came to this fabulous place for a friends grand opening dinner. The service and hospitality was top tier, they set up the table for us so beautifully and a specialize family style menu personalized to the special occasion !! The food was so  tasty made with love. The variety of steaks were all different and all juicy & tender. Everything was delicious including the drinks. The owner is so proud and gave us such great attention. Can't wait to come back to taste the rest of the menu."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M2NQNXJ3RRAB",
            "text": "I CANNOT EXPRESS ENOUGH just how AMAZING this place was !!!\nAs soon as I walked in I was in awe of how beautiful this place is you immediately feel regal and upscale. The service was top tier they made sure I was very well taken care making me feel like royalty ! The food was out of this world !!! The steak was buttery soft , tender and incredibly juicy with great portions. The sides complemented the meat perfectly and they had a great selection to choose from but my favorite was definitely the sausage ,Caesar salad , creamed spinach and lobster Mac and cheese … clearly you can see I have a hard time just picking one favorite.\nThis place truly is the perfect place for a memorable dining experience without having to go to the city"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOHRYczBRRRAB",
            "text": "New place on Staten Island. Food is good but the menu need’s improving. Need to add more appetizers. Decor is beautiful. Service was slow. Also, this is just a thought when the same couple shows up at your restaurant twice in one week you could at least buy them around of drinks or send over an after dinner drink as a good gesture, especially considering they spent almost $1500 in your place between the two nights…we went on Saturday and my husband brought others last night. Food is good for Staten Island. Will be back but like I said some good gestures go along way!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bE5MRm5nRRAB",
            "text": "An Unforgettable Dining Experience!\n\nFrom the moment we walked in, this steakhouse impressed us with its elegant and well-appointed ambiance. The atmosphere strikes the perfect balance between sophistication and comfort, making it an ideal spot for a special night out.\n\nThe food was nothing short of exceptional. We ordered the hanger steak, which was cooked to perfection—juicy, tender, and packed with flavor. The lamb chops were equally impressive, with a beautiful sear and a melt-in-your-mouth texture. Each dish was expertly seasoned and presented with care.\n\nWhat really stood out, though, were the unique and creative drinks. The cocktail menu was inventive and thoughtfully crafted, offering flavors that complemented our meal perfectly. It’s clear that the bar team puts a lot of creativity and passion into their work.\n\nThe service was impeccable. The staff was attentive, knowledgeable, and genuinely friendly, making us feel well taken care of throughout the evening. They were happy to offer recommendations and ensured our dining experience was seamless.\n\nThere is no doubt we will explore the rest of this tasteful menu!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaGNHcVBBEAE",
            "text": "Last night we celebrated my son’s birthday, and it was amazing. The ambiance was warm and welcoming, it has that NYC upscale Steak House vibe- the perfect setting for a special occasion. The  drinks were expertly crafted—bold, flavorful, and just right. The food? Absolutely unforgettable—every dish was incredible. The presentation, flavor, and portions- 10/10.\nThe staff went above and beyond checking in often and ensuring every moment was perfect. Please don’t hesitate—make your reservation now!! Thank me later!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVNWNHNXpZbmRzTkdSZlVtbERiRFZxUzJWblZVRRAB",
            "text": "Had dinner for two at Raval and really enjoyed the experience. The steak was cooked perfectly exactly how I ordered it. Also tried the pasta, which was tremendous. They actually make their pasta in-house, and you can taste the difference.\n\nThe ambiance was cozy with a stylish interior that felt welcoming without trying too hard. The staff and service were friendly and genuinely seemed to enjoy what they were doing, which added to the relaxed vibe of the place. Definitely a solid spot whether you’re going out with a friend, family or just looking for a good meal in a relaxed setting. Will be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQU1JtSnJIamZ1bkJnEAE",
            "text": "Upon arrival greeted by one of the owners Naz and once you walk in the door the vibe is set! You know you've came to the right place! The service is top notch & your not left unattended ever! Constantly being checked on and staff is extremely friendly! We had a perfect meal my steak was out of this world! I had the Raval Cajun Ribeye! My table had Charbroiled Oysters,Cavatelli Lobster Mac &\nCheese, Watermelon & Feta salad,Lamb Chops and a couple Steaks! Some creamed spinach and whipped potatoes on the side! Everything 10/10 .. Once you come here you'll be talking about it to everyone! Sexy Vibes! Be back soon!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOGRIZjBRRRAB",
            "text": "5 stars for customer service, atmosphere and steak quality! From the moment you walk in, you’re treated like an absolute VIP- minus the pretense and pompousness most higher end steakhouses have. The waiters were incredibly attentive, patient and personable and truly made the entire experience. I felt like I was in an old school Manhattan steakhouse, yes I was opposite a Staten Island train station. Highly recommend! No need to go to Manhattan anymore for service and food this good."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmM09lM3RRRRAB",
            "text": "Insanely good! I had the Australian Wagyu skirt steak med rare with a side of fries. The steak was one of the best I've had in so long! The fries were top tier. Goes perfect with the Deja vu cocktail."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQMXVlQmh3RRAB",
            "text": "If you’re looking for a spot that specializes in its quality regarding service, the food, and the atmosphere Raval is your place. The food is just perfection, the service is on point making sure everything is right and you are enjoying your stay there as they are very welcoming. As for the atmosphere it is incredible, it gives a western vibe, very cozy and warm. Definitely a spot that you must try whether or not you are from Staten Island."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbkwzMXRBRRAB",
            "text": "True Manhattan feel you can now have locally. Seriously, the environment is so warm & welcoming, you want to come here for that hospitable experience. Food is great, staff are great and plenty of parking too. Steaks are top notch & you won't leave disappointed. Crab cakes, tuna tartare, filets (& many others cuts), & every drink possible are here with experienced staff who want you to enjoy your dining experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNQ3YtZmJtc1BYV2NREAE",
            "text": "Finally an amazing restaurant on the island! When you want a nice night out without having to go into the city, this is by far the best option. Food was delicious, service is exceptional and the ambiance is a vibe. People say “its as expensive as the city” well yes because the restaurant belongs in the city so if you want great food, great service, great atmosphere, then you can’t expect it to be like every restaurant on Staten Island."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMNjN6OEQxcl9fdEt3EAE",
            "text": "Raval Steak House – An Unforgettable Experience\nHad an amazing dinner at Raval Steak House! The service was top-notch, thanks to Gent who welcomed us with warmth, professionalism, and genuine hospitality – he truly made us feel at home.\n\nA big shoutout as well to Besi, the cocktail master. His Smoked Old Fashioned was absolutely perfect – beautifully presented, perfectly balanced, and full of depth and flavor.\n\nAs for the food… simply outstanding. We started with the charbroiled oysters and baked clams – fresh, flavorful, and perfectly cooked. The watermelon salad was refreshing and creative, while the grilled Caesar salad had a delicious smoky twist. And of course, the star of the night – the Porterhouse steak – was grilled to perfection, tender, juicy, and bursting with flavor.\n\nA true fine dining experience with exceptional food, cocktails, and service. I’ll definitely be back – highly recommend to anyone looking for a special night out."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQaUMxZFA2dHRubXF3RRAB",
            "text": "Sleek and modern and totally on point! Zucchini appetizer was amazing and a total star of the apps. Steak Tartare was out of this world-a definite must order. It’s a classic steakhouse with a modern vibe. Food is exquisite. You really feel like you’re eating in downtown Manhattan staff is lovely will definitely be returning."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdHJ2NXd3RRAB",
            "text": "Raval Steakhouse offers a fantastic dining experience with top-quality meats, cooked to perfection. The ambiance is cozy yet upscale, making it perfect for both casual dinners and special occasions. The staff is friendly and attentive, always ready to recommend the best cuts and sides. Prices are fair for the quality, and the flavor truly delivers. Highly recommended for steak lovers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMVIwSTBOVWRsWVhReGVtMXNNbkpDTm5GNGJXYxAB",
            "text": "Raval Steakhouse is a true treasure on Staten Island.Naz and Gent have created a warm, inviting space that feels like home. The steaks are incredible perfectly cooked and bursting with flavor.\nWhat really stands out is the friendly staff they make you feel like part of the family. Raval is the perfect place to gather, share stories, and enjoy amazing food. Highly recommend!"
        }
    ],
    "reviews_count": 59
}