{
    "name": "Ayat Staten Island",
    "place_id": "ChIJESDr4gRPwokRXHaFj_J23Yw",
    "grid": "SI2",
    "address": "2018 Hylan Blvd, Staten Island, NY 10306, USA",
    "rating": 4.6,
    "user_ratings_total": 711,
    "phone_number": "(718) 362-1619",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdFNEWlRkRnBaU1RaUU5GRkZRMVkxUmxOUmVWRRAB",
            "text": "Great food and service"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcVpuUkZSWGhGYW5rM1JtTXRUbDg0ZGtFM1owRRAB",
            "text": "Currently my favorite weeknight dinner spot! I love love love the hummus and the chicken skewer is my no-think order. I feel like I’m eating healthy and it’s super fast.  The chicken is so tender and juicy, it’s just absolutely delicious. I’ve sat in the restaurant a few times and the food is equally as good.. I also went to the Brooklyn location and the hummus seemed different but was as good.  I also love the vibe and art in the restaurant."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMWJuWlJPR00yWDNWYVUzSjFXRlJsTlV0UU9FRRAB",
            "text": "Delicious"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dWNWbFJjMWRST1c5UFJHTkxZa2hKZGs1bWNtYxAB",
            "text": "Fabulous authentic Palestinian restaurant! The falafel and hummus were amazing!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcmRIZ3lXblI0Y0RreVZVd3hNRTV0U1ZCak5WRRAB",
            "text": "Delicious food, great selection of mocktails and drinks, excellent service. Great place to hangout without being rushed. Try the platters and kebabs"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVE0zUmZSV3hVVFMxMGRpMXJSMTl6YTBSWWNVRRAB",
            "text": "Its really nice and cozy restaurant. The food is great and service top notch. Their authentic food never disappoints"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcVMybHRNbkIwVUVod2NraHpUbTR5VWxZMU9HYxAB",
            "text": "Ayat deserves to be nominated as the #1 Palestinian restaurant in NYC!!! I’ve been to their Brooklyn which was okay - before but this Staten Island branch is something else. First, we were greeted by Ameena - a young lady with a pretty face & a super welcoming smile . We ordered a small Fatet djej, tabbuli, watermelon halloumi salad, Ramallah mocktails, msakhan & maqloobi. Absolutely delicious options & sooo generous with their portions too! Ayat is like your Mom’s Palestinian kitchen - you can taste the homemade flavor in every dish for real. Their interior is also beautiful; you’ll see hand painted decor in every corner of the restaurant."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa1pHTjRURVZGWDB4SE0zTjJSMDV6WVdkM1RYYxAB",
            "text": "Amazing Ambience. Food is delicious and staff was great. Very Authentic food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxS1QzWlVOM1p0TUZKSmJURm1lSGxrWVRSaFRtYxAB",
            "text": "I had a dinner last night with my family we came all the way from long island but every single bite was worth a mile we traveled."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOTHVrNnlENDVmWVZBEAE",
            "text": "Simply amazing!  Salads are spectacular, dishes made with attention to every detail.\nJust found it and already been back 2 more times.  Excited to try the next dish.  Chicken dishes done to perfection.  No one serves a more tender chicken.\nDecor is original and very beautiful.  Service was excellent.  Hope they stay and linger in Staten Islands culinary future."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUVJEaFNSVkJpZEc1UFdVSmFlRVUzY0hGV1NrRRAB",
            "text": "Amazing PALESTINIAN food. FreeFalastin"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeE4wRlZSRU5EY1hSWFNIRmhWRnBQVEhoWmJsRRAB",
            "text": "Every time I go to Ayat no matter the location I always have some of the best food and service I’ve ever experienced. I get chicken shawarma. Very good, big portion sizes. I also recommend their hummus, and their tahini ice cream is very good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5clRHSjNOMU5NVFZkSlIxOURSM1ZCTUdGaU1WRRAB",
            "text": "On a total whim me and a friend stopped here. I was absolutely not prepared for how out of this world delicious the food would be. Service was also amazing - super fast and respectful. I'm floating on a cloud. Ate too fast to get a good photo so you'll have to live with me gremlin gobbling my food.\n\nP.S. definitely get the hummus!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VeVRVNHlWblJNTUdKdFUzUk9kRkl3TjJaWldIYxAB",
            "text": "I wanted to wait to post this since i personally reached out to the restaurants site (inquiry 782020) on Sept 7th to hear back from them, but it has been now 10 days and no response. This is somewhat concerning that either they do not want to respond to this and sweep it under the rug or the off chance that it fell through the crack. But I'm seeing them respond to these reviews faster than website inquires. Just to let management know what is happening at the S.I. location\n\nMy family and I had dinner on Aug 29th (party of 4). My wife and I came here several times before and wanted to share the amazing experience with the family we had here before.\nFirst, we asked the waitress for us to finish our appetizers before the entrees came out, but the mains came out anyway shortly after the apps, overcrowding our table and leaving them to get cold.\nSecond, no one checked on us throughout the meal, likely because of the rushed service and us saying that we asked the food to be held off until we were done with apps.\nThird, when we asked for two extra pieces of bread to take home, staff instead removed our four pieces and charged us for two new orders—essentially charging us for our own bread.\nLastly, a 20% gratuity was auto added despite our party being only four, when the menu clearly states it applies to five or more. When I asked the waitress this, she claimed the menu \"was printed in error,\" though we’ve visited multiple times before without issue and never saw a menu change.\nThese minor issues on rushing food, failing to check in, charging for our own bread, and falsely adding the gratuity then to lie to the customers about it is straight up dishonest.\nYour food is excellent, but the service there is something that needs to be changed since that will cause customers to not return"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUE1VbHlkalZRYTBnNE1XZFlTR3BrVmt4S1RWRRAB",
            "text": "Beautiful restaurant, amazing food! I definitely recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UFVHdFdXSGw0UkV4SFkxWmpPVmxsVUd0ZlNYYxAB",
            "text": "Delicious food with humble prices and great customer service. Halloumi cheese with shawerma and hummus is my recommendation. Enjoy 😉"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSE9IVkRjMmxhWm1sMldtZEdZVkp5TVZoV1YxRRAB",
            "text": "What a wonderful food! This is one of the few restaurants that offers authentic traditional Palestinian dishes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzdFNuRlNXbGRLZEVoZk5HZEtiemRMVjFKM1ZGRRAB",
            "text": "Great restaurant. The food was amazing. Traditional Palestinian cuisine. The service was great too. Will definitely come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210c2JVWlhibXhDZFRjeFFqSXlZMnhuTXpSeWFGRRAB",
            "text": "Great place for authentic, high quality food. The mansaf is my go to. Very well priced considering the quality."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvdE1qQjNOREJJWmt4WGJWSmtUbkJyWmpSQloyYxAB",
            "text": "I been away from Staten Island for about 10 years this place made me want to come back I love it delicious food and great service. Pullina was our server she was great and very patient ❤️❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbFJXRmliVFJFV21aNk9GVkljVTFyWlZKRmFtYxAB",
            "text": "Amazing food and amazing customer service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVU1rbDBVMng1Tm1GS2EzWkhibnB1VEd4eVYyYxAB",
            "text": "I actually visited all the locations last month and the service was not friendly"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wamR6VTFZVGM0ZEhOMU4yaEtWR2hVVjFVelpIYxAB",
            "text": "I love the Middle Eastern Food at your Brooklyn location, but I was really disappointed with the new Staten Island one. The shawarma sandwich was nothing like Brooklyn’s—different bread that was soggy and didn’t even hold together. It wasn’t wrapped properly, everything fell out, and I had to eat it with a fork. The meat was tough, and the flavor just wasn’t the same. The sides were okay, but again, not what I’ve come to expect. Sadly, we won’t be returning to this location."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVlkyVkxiVzV5YzBJNE1VOUlRMHBwYWxwalNWRRAB",
            "text": "Great place with delicious food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaZmRqQjZkWE5mUTJaMFZFSjNUVFZwU0ZOWVNuYxAB",
            "text": "🌈Best Food in Staten Island , hands down ✨️ never had Palestinian cuisine before,  now I'm a believer !! The great portions, price,  and magical atmosphere is simply amazing !! Will be a regular when looking for great Middle Eastern food.\nAlso, the staff was so coo, patient, l and considerate.. unlike some establishments within the area where you feel a pompous, arrogance and unease when trying to decide your order.\nMade us feel like Family 💓🙌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMVNVVjJaVTlpVFRFemRGWjNWVGxVTkZSdlkzYxAB",
            "text": "Loved their seating, and the food is amazing fresh and flavorful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TFZsbEpRblpHVnpWUFlUSkZTVmQzV2pOdFNsRRAB",
            "text": "It’s smelled so bad. My family could barely stand it. My niece got sick."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRlpEWjJWa2RoVldkemVHdDBOMkp4Y2xkRWVXYxAB",
            "text": "Delicious, homemade feeling, food in a friendly, bustling place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjemRqWXllSFpCVjBKblltMDJkRmRsYlZoelRGRRAB",
            "text": "The stuffed cabbage. Heaven"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TVVFWlFOWHBET1hCSFkwUkhjV2hHVGpWc2RtYxAB",
            "text": "Simply the best Palestinian food in NYC. We very much enjoyed our lunch here. The food is delicious and the staff friendly and charming. Did I mention that the food was amazing?..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NWVFbHBhRXhyYTE5MFNGVnJPRnBXUVRWdlpGRRAB",
            "text": "Came here on a whim for lunch with my lifelong friend. We shared the hot appetizer combo which was plenty to share. Food was delicious. We had the Limonana and the Arnold Palmer for drinks and they were refreshing and delicious. The atmosphere was welcoming. Everyone was great. We will definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUWMxSk1kSFp3VFhFd2QyMVBTVkpHWTJkd01YYxAB",
            "text": "The mezze fillistini is very godo."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMFdWWmhhV2MwZWw5V2VVdEtPV3BLTjI5cWVsRRAB",
            "text": "Very good restaurant. I like Shawarma and Kofta."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cWFWQmhjRTVxTjNGWVQyZEhUV280UTJoc2IzYxAB",
            "text": "Authentic Jordanian or Palestinian taste loved food ,ambience"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaMVpXOWlVVUk0Y1c4eGRtSlplalJZY25GYU0xRRAB",
            "text": "HAVE PARKING LOT\nGOOD FOOD\nGOOD VIBES"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WVZFZHpNMDEzUjNOUVlWbHJia0YwVlZkRGRVRRAB",
            "text": "What a great place! The food has so much flavor, the atmosphere is inviting, and the service is on point. I highly recommend this restaurant for all Mediterranean-Middle Eastern cravings in Staten Island. And the knafeh is A+. Shout out to Manager Aminah for being so nice and accommodating!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MTh6YlNnEAE",
            "text": "The food is excellent, service is outrageous. They one of the nicest people...\nHighly recommend this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KeVFVZEhVbGR6YkhSQlRrOU1iVmhDWTFjMWJGRRAB",
            "text": "Delicious food. Loved the cultural environment and hospitality. 10/10\nWould come again\nOur server Paulina was very attentive and gave great service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cVVTMXFlRFkzYjFrMVRGbHpSMlpIY21ZMFVWRRAB",
            "text": "Great people & great food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aE4yaDZaRXRTTkRKalgzWldTWGxNVkZGWWRGRRAB",
            "text": "The manager came out and personally handled  my group, she was amazing, we can in during the last hour and they weren’t pushy for us to leave, the service was still amazing and we were taken care of amazingly. Definitely coming back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZlY4T09mMXQ3SVB3EAE",
            "text": "Staff was amazing and attentive. Food was flavorful and beautifully presented. Great portions. The hummus was truly the best i’ve had anywhere. Also I could drink that olive oil, so good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeHFPZXBnRRAB",
            "text": "The atmosphere is lovely, loved the decoration! It was our first time here and the our sever Paulina walked us through the popular dishes and gave us some great recommendations!\n\nWe got falafel and cigar sticks with cheese as an appetizer and the lamb dish as the main. I’m sad I didn’t take pictures of the food but it was just too good to stop and take the picture😂\n\nWill definitely be back !\n\nThen the food started coming out and"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bWUySGhRRRAB",
            "text": "Had a wonderful experience, and now my go-to restaurant! It was pretty empty when we arrived at 12 pm but nonetheless, the staff were super friendly and kind.\n\nThe menu includes a wide selection of Middle Eastern dishes, and by far our favorite dishes were the Roasted Pepper Hummus and the Pistachio Pizza. The food didn't take too long to come out, and it all tasted super fresh and delicious. They also had a good variety of vegetarian and vegan options. The atmosphere of the restaurant is great and love the decor."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2el9PM05BEAE",
            "text": "I recently dined at Ayat for the 3rd time, and had a very good experience . The atmosphere was cozy, welcoming, and beautiful. The food was very good and very fresh & clean. The staff were friendly and attentive, making sure we had everything we needed. Especially Saadet, the manager. She is very sweet, and has a comfortable and good vibe, she is always smiling and makes sure you are enjoying your meal. I highly recommend Ayat if you love a relaxing place with a kind and welcoming staff!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvX2RtZTdBRRAB",
            "text": "The staff were so patient with us having never tried Palestinian food before. They answered all of our questions and the food was absolutely delicious! Will come back for sure!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LUoyYlRREAE",
            "text": "Loved the food and service here.  We had the baba ghanoush and tried the muhmmarah app for the first time.  Both were excellent with their fluffy homemade bread.  We ordered the chicken maqluba, the mixed grill platter and two pizzas.  The falafel pizza was delicious.   Don't leave without ordering the tahini ice cream and the baklava with Arabian coffee.  Service was very warm and attentive."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2b2VPcWtBRRAB",
            "text": "A must visit for spectacular food, especially if you’ve never had Palestinian food. Everything was filled with multiple flavors that balanced each other perfectly. The staff were also incredibly kind and attentive. I would highly recommend this restaurant to anyone looking to expand their palette."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMS1HaDZnRRAB",
            "text": "The food and service is incredible. The staff is super friendly. The food didn’t take too long and tasted fresh. I LOVE the rice… it has a smokiness to it that is so inviting.\n\nI tried the Lemonade - very refreshing.\n\nThe bathrooms were a work of art on its own.\n\nI appreciate the menus. They’re as educational as they are visually appealing.\n\nAlso.. 2 entrees, a drink- 54 dollars. Not bad!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJbmU5ZktrMmNQRW5nRRAB",
            "text": "Good very overly dry and greasy.  It was a bit salty, had to drink a lot of water afterward.  Service was great and friendly.  The seating was comfortable and spacious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoaS1hWDZnRRAB",
            "text": "In today’s day and age, it’s really hard to find a restaurant with good quality food, reasonable prices, a nice ambience, and good service. Ayat exceeds in all of these aspects.\n\nFood:\nI’m gonna start off by saying that you better be hungry when you come here because the food portions are super generous. The food here is delicious. They have so many traditional dishes along with many creative dishes as well and I absolutely love the fact that they have a wood fire oven, which means the pizza here is incredible and a must try! I do also want to emphasize that everything taste super fresh here.\n\nAmbiance: the artwork in here is beautiful and everything is super clean and organized and very aesthetically pleasing. They can accommodate large groups because they have tons of seating available.\n\nService: The service here it is quick and efficient and they do such a wonderful job and making sure customers are happy and taken care of."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbmNnTnk5aDlDTDdnRRAB",
            "text": "Feast of flavours! Warm atmosphere, beautiful touching wall art! ♥️ Hibiscus margarita mocktail was so refreshing and yumm. Hummus is insanely good, so rich and neverending! Watermelon feta salad perfection, so fresh and ripe. By the time we got to maklouba we were so full! Chicken was very delicious and tender."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeGVPM0RREAE",
            "text": "100% recommend trying the cold appetizer (Mezze Filistini) with pita bread. It’s so flavorful and worth your money. The Araby Beef Shawarma was good but they cook with Lamb Fat so it really tastes like lamb. The employee was nice enough to switch it to chicken instead. Great service! Will be returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNac3NYS09nEAE",
            "text": "Ayat is such an amazing addition to Staten Island! I've now had the pleasure of visiting multiple times (in addition to ordering take out) and every time it's been a knock out of the park!\nThe food has been consistently flavorful, fresh, and delicious. I literally dream about their hummus and grape leaves.\nService is great - they are attentive and they don't rush you out, no matter how busy it gets. The drinks are fun and tasty.\nPlus the ambiance and decor of the restaurant makes it feel like you're not in Staten Island.\nI did not know what to expect as I'm no expert in Palestinian food, but I'm so glad I tried it, and now I cannot get enough!\nI will definitely be returning again (and again...)!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeTVEZGFREAE",
            "text": "Excellent restaurant. The service, food options, and drinks were all great. They also had a good variety of vegetarian and vegan options."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaXVhNnlRRRAB",
            "text": "Their Pita bread is so warm and delicious. Love the hummus dip and dessert with cheese:kanafa.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eF83Q05BEAE",
            "text": "My family and I were warmly welcomed by staff. We were amazed by the atmosphere and attention to detail. From the ceilings to the walls, hints of Palestine are sprinkled all over.\nFood was prepared in a timely fashion. Food was fresh and delicious!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2N2FPZjdnRRAB",
            "text": "AYAT is our absolute favorite spot in Staten Island! We have tried multiple places and always land back here … we love the atmosphere and the service is unmatched! Quality, top-notch service every single time.  They continually upgrade their decor and the feel of the entire setting is wonderful. The food … INCREDIBLE!! You MUST experience this place!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScnNpWVJBEAE",
            "text": "One of the best restaurants on the island!! Food is always AMAZING. I'm a vegetarian but my family is not and this place caters to both . We all  LOVE it!!\nWe even took an appetizer platter home for the weekend !!! (PS This will be my go to when I need ro bring something to a party !)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dzRyRDl3RRAB",
            "text": "Best food in Staten Island! Highly recommend to anyone whether or not you've tried Middle Eastern food. The service is exceptional. I come here all of the time and it has become my go-to!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobVpIXzZRRRAB",
            "text": "My best friend took me to Ayat last week and I’ve been talking about ever since. First off, both the exterior and interior of that restaurant is ABSOLUTELY BREATHTAKING. I’ve been to many restaurants and Ayat is definitely on top of the list. Both our appetizers and main dishes were so delicious and so beautifully made! I seriously cannot wait to take my whole family there and have them try Palestinian food, it’s absolutely my favorite and this is coming from a Turkish :)"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMnVtRExREAE",
            "text": "Took my fiance here for Father's day and we had an excellent experience. From the food to the service, I loved everything. Beautifully decorated. Great atmosphere. A must try if you love shawarma! 🤤"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNTR5X3lBRRAB",
            "text": "I’ve been to the bay ridge location and was super excited when I saw they were opening here. This one is a proper sit down restaurant, and it’s absolutely beautiful inside. Everyone was incredibly friendly and the menu is absolutely huge. I…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNzZDdEl3EAE",
            "text": "Wow! This Ayat location is phenomenal. It is a bit more expensive and less portion than the Bay Ridge (no baba and hummus w platters), however its worth it because of service. Bay Ridge service is ultimate trash! They lose so much business for being nasty servers. This location service immaculate. Will be coming here from now on"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbG9yc2FnEAE",
            "text": "It took me a while to come to this place . I have been through the Brooklyn one & it was a nice experience! The food & the service wasn’t good at all, it’s little expensive too! But I don’t mind paying extra if the food is good & service is great tho ..! But here it was total disappointment..!\n\nSo I went there on a weekday evening, when I reach there it was almost empty! I waited 10 min before a server came to me. 2/3 servers walk by me , doing other stuff . They did see me & didn’t even smile or say hi or welcome! I was very surprised! So I sat down by the door because less hot there! I sat there 5 more minutes then a lady came by , asked for my order. She was nice, not that knowledgeable about their food . So I had to take a chance what to order. I also told her I am waiting for a friend, in the meantime I wanna order a drink! She recommended one & I ordered that one.\n\nThe drink came, looked good & taste good too. Then my friend came & we ordered food . It took them half an hour just for one order. We didn’t ordered much because we had other plans , so we just ordered the chicken kabab. Also they didn’t give us any water, we had to keep asking & reminding them! By the time our food came the restaurant starting to get little busy !\n\nThe amount of food was good for 2 people if you are not a huge eater! Tasted good. Then we ordered Arabian coffee, our first time . And we didn’t like it lol! I guess we are not used to Arabian coffee & the taste of it.\n\nThe entire time we were there from start to finish the server only came to us 3 time . Getting the order, bringing back the food , then giving us the bill. Never came to check up how is everything! I have seen them going around other tables multiple times & asked them ! Don’t know if it’s because we ordered less food & we were only 2 people! But I was started to get annoyed about it. I was gonna try some other food & dessert but after the service I just left !\n\nWill I come back again traveling from my side of the island ! Spending money on Uber just to get here again , don’t think so. Such a disappointment!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdnZtbUh3EAE",
            "text": "Great service, great food, great ambiance. My favorites were the apps! The mezze platter; the grape leaves, the cauliflower: delicious! Mains are great too. Very fresh food and good portions! Fantastic raspberry mojito too."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bDhybXdRRRAB",
            "text": "I always have a really great experience when I come here. One of the best places in the area for vegans, with delicious options including a vegan platter and several appetizers. Our server, Saadet, was also so amazing, patient, and kind! We will definitely dine in again and hope to have her as our server!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1Z1lqLXl3RRAB",
            "text": "What really sets a place apart isn’t just great food—it’s how they handle things when something goes wrong. On a recent Mother’s Day (5/11/25), a group of eight of us experienced a delay in getting our food because our order was never placed. Frustrating? Yes. But the owner personally stepped in and made it right. That level of accountability and care left a stronger impression than a forgettable, average visit ever could.\n\nThe food was absolutely delicious, with excellent vegan options that everyone in our group enjoyed. Thanks to the owner’s top-notch customer service, I’ll definitely be back. Mistakes happen—but how they’re handled makes all the difference."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMHBlQWZ3EAE",
            "text": "From the very first second of my encounter with this restaurant over the phone to my last encounter, the staff were nothing but a pleasure to interact with. When I placed my takeout order, the lady that answered was super friendly and a delight to converse with. When I arrived and stated I was here for pickup, she immediately remembered me and retrieved my order. All staff were smiles and friendly making me feel very welcomed. The restaurant is very spacious with high ceilings, nice open kitchen with a view of their oven, and clean decor. When I left with my order, a second bag of food was left behind and the lady actually ran after me with the bag and found me in my car about to drive away.\n\nWhen I got home to try the food. Delicious. I love the hummus and baba ghanoush that came with my falafel platter. One of the best baba ghanoush I’ve had in my life. It was my first time trying maklouba and I have to say, it’s a very yummy dish and the chicken is not dry at all. It was also my first time trying kousa mahshi and I loved it. Then again I love  squashes of all varieties and preparations so I may be a bit biased.\n\nOverall, a great place with great food and the most welcoming staff. I plan to frequent this place a lot and try every item on their menu at least once. 🥰\n\nBtw, did I mention the food is very much worth the prices? My whole order was only $60 and was able to feed 3 adults with plenty leftover to take to work for lunch the next day."
        }
    ],
    "reviews_count": 68
}