{
    "name": "The Restaurant",
    "place_id": "ChIJ28bt80NowokRVoTSMDES8lI",
    "grid": "QN14",
    "address": "86-05 Rockaway Beach Blvd, Rockaway Park, NY 11694, USA",
    "rating": 4.3,
    "user_ratings_total": 429,
    "phone_number": "(718) 634-5809",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMFpWWTFiWHBJUjNoalZYcEtVM2hCVUMwNE1sRRAB",
            "text": "Very good"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeFJITnlabVUyVjNsV1lYSXhURUZGTUY5MkxVRRAB",
            "text": "The service is exceptional!!!"
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TVF6VXhOWE5yTkVoTk1FZEhaRFZVVlRORlVWRRAB",
            "text": "Super service, personnel très aimable et plats très (très) costauds, super resto si vous allez à la plage juste à côté."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5c09EbDRZVmxSYjFseFUzWnNkbXhZY25sa1RVRRAB",
            "text": "Everyone hear 🙉 s friendly and the food is really top tier. Definitely mom and pop diner vibes!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeFVFOVBZamR1VWsweFdXNW9hamsyZG5Oc2NrRRAB",
            "text": "Not worth what they charging..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWb1pGUXdYMGhEVWpWbmNYZzRUWFZxVm10V1pGRRAB",
            "text": "Fantastic little place if you're ever in Rockaway. Very friendly staff and great if you want somewhere affordable and not touristy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kak9VeDJUVUYzUzBzeGJFZFlNbEpEUmxVd04xRRAB",
            "text": "Been coming here for years…Food & service is always top tier… thank you! :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKelRGQm5NMUp1VWtaSmRFcDNia3hxZG5oNFJtYxAB",
            "text": "Old diner vibe in a stip mall. Clean. Food was good. Service was efficient. Price was fair."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RGIwbDNOWEZVYTBOaVMycHBkRVV5UTNOd00yYxAB",
            "text": "Old fashion diner, specific atmosphere great location next to open Ocean beach"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUGVWOXhlRGxITUZBMll5MURkMk5UVWt4MlNtYxAB",
            "text": "They have the absolute best and I mean best pancakes i have ever had. They are better then the ones I have had from Ihop that's saying something the bacon is really good too thank you so much.  My commitment to the chef"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMVZXWnNlbXRxY2xWcmNEbFRkMGszWVRWaVEwRRAB",
            "text": "Nice looking place , pleasant staff reasonable price not cheap but not expensive either ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oa1owSmpWa2hPVVVOWFFVOUZVR1pCV1dkc01tYxAB",
            "text": "This little restaurant in a strip mall is dated (i.e. hasn’t been renovated in a long time), but it had a nostalgic feel to it.  The staff was friendly, the food was good, and the service was quick.  I did feel like a stranger. It was obvious everyone there knew everyone else.  I got a pastrami omelet with home fries and toast.  Very good!  My only criticism is that I wasn’t offered a more coffee."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNkplSUJnEAE",
            "text": "I ORDERED LUNCH TODAY AND PAID FOR COLESLAW AND PICKLES TO GO ALONG WITH MY TURKEY BURGER AND FRIES. WELL THEY FORGOT THE COLESLAW AND PICKLES MIND YOU I PAID $18 DOLLARS AND TIPPED THE DRIVER BIG TIME. WELL I CALLED TO INFORM AND CHIC TOLD ME WE HAVE ONLY ONE DRIVER AND HE CAN'T COME BACK JUST TO GIVE YOU COLESLAW AND PICKLES WE'LL GIVE YOU EXTRA NEXT TIME AND HUNG UP. THERE WILL BE NO NEXT TIME THE FRIES WERE SOGGY AND BURGER NOT SO TASTY. GARBAGE!!! YOU WANT GOOD FOOD GO RALPH'S, SHERWOOD DINER OR THE CORNER COFFEE SHOP IN ROCKAWAY"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dktmZ1NBEAE",
            "text": "What a diner should be"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbzc2U2p3RRAB",
            "text": "Food is ok service is great as well as the people working"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cC02T3d3RRAB",
            "text": "A Rockaway staple! Lumberjack warms my heart whenever I have it. Happy to have this location running in Rockaway longer than I can remember. Hope this business keeps thriving."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQMk5LeGFBEAE",
            "text": "Rip off charges 2 dollars or more extra or more for using your card"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQa3NTenRRRRAB",
            "text": "The food is so fresh.\nAtmosphere was bubbly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNWNTazh3RRAB",
            "text": "Skip this place worse waitress ever.Ive  been eating at this place for years, and I  try to  avoid the older waitress she should stay home with her rude attitude never again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlelBlQXF3RRAB",
            "text": "This place is a neighborhood staple that has been around a while.  Popular for breakfast and lunch.  Staff is very friendly and knows the customers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIb1lDcGJ3EAE",
            "text": "I accidentally went there to have breakfast. I was very pleasantly surprised, great service, very quiet and calm. I really liked the food, very tasty and homely"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVM3JiZGV3EAE",
            "text": "Great food & service 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3ckk3UHZRRRAB",
            "text": "This is your average diner I mean don't expect to be blown away by the food but it's convenient for a nice sit-down breakfast or lunch if you're in the area and you're craving diner food. The wait staff is good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyOHRDS2tBRRAB",
            "text": "What a treat! This diner is exceptional! From two ladies greeting us when we walked in, to the line cooks who created a perfect breakfast to ice cold juices and hot coffee… we have found a new favorite restaurant.\n\nColleen - outstanding server. Very quick with a joke (This comment begs for Billy Joel to sing Piano Man. Guess he’s met Colleen! ), has entertaining stories and a sassy wit. We love her, the diner, the menu, the food!\n\nTruly a diamond in the middle of a strip mall. Stop by! You’ll be glad you did!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeTdHWFlREAE",
            "text": "I ordered breakfast/brunch over Uber eats I was happy with the meal until I got to dessert. The red velvet cake I received was old and had mold growing on it. I'm totally disappointed!!! No I do not recommend you get food from here. If they can hold and serve moldy cake then imagine how dirty the rest of the kitchen must be. Def a food safety issue is a huge problem in this restaurant. Attached is an image of the mold found on cake."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcUtydmdnRRAB",
            "text": "Hi order"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dXFUeTFBRRAB",
            "text": "The breakfast and lunch here is amazing along with fantastic service. I definitely recommend giving them a try."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRM2REZ3pBRRAB",
            "text": "Nice Place to Grab a little something to eat. Been there plenty of times."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkM05PLVJ3EAE",
            "text": "Great vibe in this place. Super friendly and fun staff, standard diner fare done right and fair prices. Hope this place sticks around for a long time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkeU1uenVnRRAB",
            "text": "The food here is really good!  Cooked just the way I like it. My eggs were still a little runny when they got to me. The potatoes are fresh. They look plain but they are definitely good! French toast was also on point"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0LV9qWHFBRRAB",
            "text": "Beautiful place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbmZ1XzdBRRAB",
            "text": "The best breakfast I ever had! And so the coffee too! You definitely need to get there once in your life. And if you’re lucky enough,you will be served by the nicest person"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbTlMZ3NRRRAB",
            "text": "The food is great and the service was wonderful I had to give a 20$ tip the inside of the store was old timey and it just felt great overall 5 stars 🌟"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMnBlRWF3EAE",
            "text": "Ordered pancakes from here and they never put syrup in the bag. They were incredibly rude when I asked them where the syrup was claiming that they had already put it in the bag. They clearly didn’t. I cannot recommend this place to anyone."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcDhHc3hnRRAB",
            "text": "Nice little family run restaurant, very friendly staff, nice food. Two thumbs up"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCOE1UVzZnRRAB",
            "text": "I don't know 30 years I've been going there never been disappointed The owner Joey is phenomenal this is a place that I recommend personally"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNFOE52cVd3EAE",
            "text": "best breakfast i’ve had since i moved here from the south!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MTgtZGhnRRAB",
            "text": "It was alright. The food was good, affordable and the staff was nice. The coffee was great, didn't have that stale \"been on the burner too long\" taste. You don't get rushed to eat and get out. It's more of a 3.5."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSZ0tDUXFBRRAB",
            "text": "This place is a neat, clean little cafe/restaurant. The staff is always friendly and greet you with a smile! By far, the best thing about this place, is the food! Consistently fantastic, everything I've eaten here has been delicious. Cannot recommend this place enough!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROV9hc0N3EAE",
            "text": "Excellent spot for breakfast. Good food at good prices. The service is great, very friendly and helpful. The waitress joked around with me in a nice, fun way. The coffee was great also. The food is prepared fresh after you order and the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCd192WWJnEAE",
            "text": "I Haven't ordered much from here, but I was in the mood for a turkey cheeseburger deluxe. This place delivered, my turkey burger with all the fixing was great, and I loved every bite. I'm definitely ordering again from here."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNU1TWVRBEAE",
            "text": "The food here is sooo good! The server during the breakfast/lunch hours is funny and makes you feel at home. She is on top of making sure you have what you need, and never seems to have a bad or off day. The cook is just fantastic, always…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMnM3QkRnEAE",
            "text": "I'm headed there for breakfast now. First place to pop in my mind.  Its a very cool and calm spot.  Feels like home which for me, is a huge thing.  I love the speedy service and the food satisfaction.  I'm always impressed.  Keep up the great work.  I love you guys are about business & food.  I'll continue to support"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleU9IRmFnEAE",
            "text": "I went in there for the first time today and omg let me tell you the food was soooooo freaking good and I’m the pickiest person alive. My son foolishly thought he could eat two waffles and he tried he said they were so good he forced hisself to eat it. This is my new spot. ❤️❤️❤️❤️"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvdUlqMlpREAE",
            "text": "Horrible experience. There seems to be only one active waiter who was I guess understandable annoyed. She ignored me the whole time. Still gave a tip because I kinda felt bad for her. The food was also horrible. The chocolate chip pancakes…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNveGNPWVJBEAE",
            "text": "Always a great experience. Feel right at home. Quick friendly service... good food, good prices... all around a nice spot. Breakfast all day 😍 thank you!…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aUluSTRnRRAB",
            "text": "I thought this was a good diner with good people ,called up for a delivery order. A breakfast that usually cost 12.50 went up to 15 ok I got u. the breakfast took an hour the location is10 to maybe 15 away under heavy traffic,they have…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNcF9HRUdBEAE",
            "text": "Great little breakfast spot nestled between the NYCHA buildings and million dollar townhouse. As far as the food goes this place is on point with quality offerings, bacon was crisp, eggs were perfectly warm and runny. Foofe was standard run…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMXVDSEF3EAE",
            "text": "Placed 3 orders within 3 days and had issues with all of them. The first time was the fault of myself, the restaurant and Uber Eats. I placed an order about an hour before the restaurant was set to close, which is 3pm on Sunday, thinking they closed at 4 because that’s what the listed hours stated on Google. To add insult to injury, I was assigned a driver who was inactive for half an hour and when I was finally able to get a hold of a live UE representative, it was too late. The second time was an order via UE again, I ordered two burger meals with one cherry lemonade and what I received was anything BUT that. When I got settled after receiving the order, I realized the restaurant gave the driver completely different food and a drink as if they weren’t paying attention to what they were handing off. What I received was dehydrated looking sausage links, home fries, an omelette with no seasoning or cheese, white toast and a cup of apple juice. Thankfully, UE was able to issue me a full refund. Now, the third time was an order placed via DoorDash. Once again, I asked for two burgers meals with a cherry lemonade to make up for the damage done the past two days. I received the burger meals finally, but I didn’t receive my bacon add on that I paid an additional $2 per meal for and once again DID NOT receive my cherry lemonade. I got an iced coffee with milk and sugar instead and my first reaction was “how can you send me coffee without knowing my dietary restrictions?”. Never will I order from this restaurant again because of their blatant carelessness, it was convenient because I’m only a mile away, but I’d rather have a bit of a wait if it means that I’ll be receiving EXACTLY what I asked for. Did I mention that the prices are outrageous for mediocre food? My burger and fries looked like they were dumped in a bucket of grease, the burger itself was rather small, and they’re stingy with the amount of fries they give."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrNzg3QXNnRRAB",
            "text": "This Restaurant is a staple in the community.  As a little girl my mother would take me to this diner style resteraunt.  Nothing heads changed much. The food is still good and the staff is still great.  I don't go often but it's nice to see familiar faces.\n\nTry the reuben! I also heard the philly cheese it's delicious too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNExHTmZREAE",
            "text": "I love the home fries!! This is the best of the greasy spoon Greek restaurants that are left. I highly recommend the food is fresh and delicious! Everytime I'm in the area I go right there!!"
        }
    ],
    "reviews_count": 51
}