{
    "name": "Rockaway Tiki Bar",
    "place_id": "ChIJwa5dbmBowokRvCuGq0QpYG0",
    "grid": "QN14",
    "address": "67-20 Rockaway Beach Blvd, Arverne, NY 11692, USA",
    "rating": 4.6,
    "user_ratings_total": 248,
    "phone_number": "(347) 619-9369",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sb2EwOW5ZVzVxTXpoTmRtRlhkMlpEUlVndFNHYxAB",
            "text": "Wonderful tiki bar! A small town family atmosphere. Better sushi than Seattle! And the friendliest people. Highly recommend"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdmVscHZNVTlTY1ZsWGNFUTJZWFJqYVVkdFJuYxAB",
            "text": "Shannon was an outstanding bartender. Despite the high volume of customers, she managed to provide attentive, efficient, and high-quality service to everyone. Her proactive approach ensured that no one was left waiting and that every guest received exceptional attention. I would highly recommend visiting this establishment as long as Shannon is part of the team."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNE4wdFNXVGxXUkhoeU5FaFRPVmR6V0ZZNVVuYxAB",
            "text": "I'm a true patron."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQ1RWbDZSRXBETldjelkzb3RlSGx2Y2pWUmFrRRAB",
            "text": "Nice hideaway in the Rockaways to wolf down a drink or couple beers, five minutes walk to da board walk,"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNFRIZzRhVnB1VURSNFREZFVUVlpXZFhsWmIwRRAB",
            "text": "Fun spot with great vibes"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGeVZ6QlBORlJUYjFaamRXOTNibVJYVUZOWE9XYxAB",
            "text": "Very good drinks the best drink is the coconut frozen drink there famous for it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM1ZWWjRRMUZTWldSU1QyTmlhMnhFTFc1WGNtYxAB",
            "text": "Service was slow bartender barely acknowledged the two other patrons including myself. He finally said something but said he was backed up. Drink had barely any liquor in it. I give it one more shot but it was a no go for me this night. Atmosphere and vibe was good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKcE1GUXhUbUp2ZVdoSFMxOURWemRhWjBaVmFuYxAB",
            "text": "Really fresh poke with a lot of sides and vegetables! Price is a lil high but for a beach in NYC, also very fair. The location and seating is great and also there’s usually a DJ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R1pGSjRVbE5STmpsVlVVUnlhRU5XYWkxUVoyYxAB",
            "text": "Fun casual tiki bar vibe. Food was very mediocre"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oemVEUXhWV2hhUjB4UlYxZzNZMVF3U1hNemNsRRAB",
            "text": "Slightly off the beaten path from the beach, back close to the train. Good way to start or end your beach day excursion."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWk1ISkROMWRKZVhwU1Z6Wm5SRnBtWjJaQmNHYxAB",
            "text": "While biking along the beach with my son, we got hungry and were heading toward Subway — he wasn’t sure we could find anything tastier or healthier nearby. That’s when we spotted this cozy little sushi café-bar. We decided to take a chance — and wow, what a discovery!\n\nWe sat outside to keep an eye on our bikes and picked a few items at random: gyoza, a poke bowl, a roll, and French fries. And honestly, everything exceeded our expectations — fresh, flavorful, and super satisfying.\n\nLet me take a moment to rave about the fries — they were pure perfection: crispy on the outside, soft and tender on the inside. I don’t think I’ll be able to enjoy fries anywhere else after this. I swear, they’ve either got a secret seasoning… or a bit of kitchen magic going on.\n\nThe poke bowl was beautifully balanced and fresh. Instead of the usual beans, it had green peas — I usually prefer beans, but I suspect they were out and made a thoughtful substitution. It still worked!\n\nA special shoutout to the staff: even though we didn’t order drinks, they brought us cold water with ice on a hot day — a simple gesture that made a big difference.\n\nI’m definitely coming back with my whole family. If you’re in the area — don’t pass this place by. It’s a hidden gem that knows how to make you feel welcome and well-fed."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNVlXdzJXbXB6WjBWeGFWWlJNRmR0ZERGMVNGRRAB",
            "text": "Food and drinks were totally fine, atmosphere solid but service was super slow. We eventually left because no one ever came back to our table to ask if we wanted anything else. We walked up to the bar for the check."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaFpGcHdNRkpVVldaaU4ySnBkamR1YlVoTlYzYxAB",
            "text": "Staff were so nice and super super sweet!!! Food was great and drinks were amazing!  We left so happy and will definitely be coming back :-)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNFpUZHdSMGxwVVZwbWQzWmFXVmN6VEVOWE1YYxAB",
            "text": "Definitely will be back. The tequila is a great choice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRdFFqZFRjemx6YUdGaFQxQk1PVWMxWWtreE4wRRAB",
            "text": "I love the food and drinks here. I sorely miss the wings and tacos but whatever.\nBig ups to Miles for keeping his cool during a severe slam. His kindness and elegance are truly appreciated."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Q1ZGbFNkMlZHYTJOd1ZHUkNPVFF5WWpNdFdtYxAB",
            "text": "Felt absolutely scammed after ordering the Tuna Tower. $25 dollars for an actual tower of rice. Do better"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVFYxVlZSRzVJYjIxWVpUUkJhVEprZG5OVFozYxAB",
            "text": "Terrible service. We ordered drinks and waited 20 minutes to order food before looking for servers that were literally nowhere to be found. Consulted four other tables who said they were waiting 45 minutes to order.\n\nI ordered an arnold palmer and they gave me a lemonade seltzer which they proceeded to charge the arnold palmer price for.\n\nNeedless to say, we left. The team failed this business today!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPTHN4S2lnbnRtTlBREAE",
            "text": "Great and friendly bar, friendly staff and very interesting interior"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJU1N4SmVxaEx2Q2d3RRAB",
            "text": "This place is an absolute gem and I almost don't want to give it away but I'm not a gatekeeper 🌉 My friend left her beach chair here (that was my first visit) and so I went back the next day to get it. And I stayed, because the food was so delicious and well-priced and the staff so welcoming and attentive the day before - and wouldn't you know it, I ordered different food and had different servers and it was all still glorious\nAnd again, priced super well, which means you can leave a really great tip because the staff is awesome and STILL not break the bank.\nGreat to share with friends, great to eat alone (recommend doing so at the bar), and the vegetarian options looked so good I have to try them next time (but when I ask for a menu choice opinion and I get as enthusiastic of a response about an item, I take it - so yeah for sure get the pork belly bao)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbV8zOS15MDZLdUZREAE",
            "text": "A small, no-frills Tiki bar with great vibes! Tasty food, solid drinks, and a super relaxed atmosphere. Perfect spot to warm up and refuel after a cold plunge with the New York Dippers Club. Friendly service and a fun, laid-back vibe – we’ll definitely be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaWZmaFVREAE",
            "text": "Ginger agave chicken sliders with slaw were out of this world 😋"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbS1YMEF3EAE",
            "text": "Cute little bar tucked away on the beach. So good we come out here from Brooklyn in the dead of winter. Great poké."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBZ2VuZi1nRRAB",
            "text": "Very tasty and cozy. Highly recommended. Edamame Dumplings is a MUST TO TRY!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cGIyWHl3RRAB",
            "text": "Tony rocks me. Love his music"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQdnNfV3JnRRAB",
            "text": "Has potential but my tuna bowl was almost inedible salty not sure if I just got unlucky today I’ll order one more time and give a 2nd chance"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMTlHQUtBEAE",
            "text": "People are terrific, food is delicious, and the drinks are fun! The place to go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaE1fb2pnRRAB",
            "text": "LOVED EVERYTHING!!!!! VIBES FOOD AND DRINKS AND STAFF AND MANAGER SOOOOO DOPE!!!! CAN'T WAIT TO GO BACK 🤗"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbDZYbkpREAE",
            "text": "Great drinks. Cute little bar. Good food. Friendly service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NmZEZllREAE",
            "text": "The music, locations, and ambiance is legit.   Tony gave us a wonderfully kind welcome.  The waitress, Meg, was sweet & knowledgeable of gluten free options. Actually, she WAS the GF menu since there were none to offer.  I'd suggest a dedicated fryer to expand limited gluten free options (I enjoyed the jackfruit/guac taco).  Would visit again if they do."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aUtxNlpnEAE",
            "text": "Great place to wind down after a day at Rockaway beach."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NFkyY3FnRRAB",
            "text": "Muy buen servicio"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cXNhZm1BRRAB",
            "text": "I had the sliders and hot dog OMG sooo good must try .. nice experience. And don’t forget to try the tiki lager. Thanks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3c1ByeFJREAE",
            "text": "Great atmosphere, friendly staff. The food is great, a nice selection of bites and a solid poke bowl."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3c09xM0x3EAE",
            "text": "This is a great little place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOV9LVVlnEAE",
            "text": "The drinks were great, the food was decent, and you can tell they get a regular crowd, but beware of the shifty service. We sat at the bar and the bill was too high for what we ordered. We were tipsy and definitely overpaid. Double check your receipt."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMGQyOWFnEAE",
            "text": "This place is really cute, however,  I think they worry more about regulars than a new customer walking in. They take their time coming to you with very few people at the bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiM3JXaU5REAE",
            "text": "Annoying, total dud… but a painchiller worth ODing on"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ2NTUTRRRRAB",
            "text": "Perfect Tiki Bar. Delicious classic Mai Tai and these little chicken bites that hit the protein spot. We really appreciate the solid service and quality music(with appropriate volume). Highly recommend for small bites and tasty drinks before or after the beach. Just note, if you sit outside in the enclosed patio there are some fruit flies that may want a sip of your delicious drink too, but that should be expected!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbU91SDdBRRAB",
            "text": "Here's the story with this business, my family one day decided to come in and try out their food because it looked interesting. As we stepped inside, the staff started to give us weird look vibes. Okay, maybe I assume it was just me being paranoid, but I wasn't. The owner or manager told us that\" maybe our kids wouldn't like the food they served,\" so I responded with well how would you know what my kids eat? I caught on to what they were trying to say. They didn't want us in their stablishment, a truly disappointing outcome to a family day being turndown because of our looks or whatever reason it was. God bless your business."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyck9hM0F3EAE",
            "text": "Always a great time, great food and music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNELUtiNmtnRRAB",
            "text": "Nice cozy quiet little spot tucked away. You could almost miss this gem... The food took a little long to come out due to a printer malfunction but the staff made up for it with an apology and guacomole and chips on the house. The food was so delicious. I would change absolutely nothing about it. Fresh and tasty... I'd go back anytime I'm in the area."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMWJlVEJnEAE",
            "text": "My love and I had our lunch date at the Tiki Bar. Atmosphere was was cozy. We ordered chicken sliders with the perfect heat and sweetness! We ordered a Zombie for a refreshment. The fries were fresh with a nice crisp! We will be back 😋…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMXBLYV9BRRAB",
            "text": "Decent vegan options here!\nWe visited and got two kinds of Bao buns - a mushroom one & the marinated tofu one (the mushroom was better than the tofu)\nWe also got the tofu poke bowl which was delicious! Lots of toppings and lots of flavor.\n\nNone of the sliders could be made vegan bc of the Hawaiian rolls and the dumplings also couldn’t be made vegan, but there were some other vegan appetizers - the corn nuggets for sure.\n\nService was great - the waitress was vegetarian and allergic to eggs (if I remember correctly) so she was knowledgeable and very helpful!\n\nOverall, I wish they would put in a little more effort to make things more vegan adaptable."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhaHJMT2xBRRAB",
            "text": "I honestly had doubts about this spot but since the Rockaway’s short on options, decided to give it chance and let me tell you, definitely wasn’t disappointed.\n\nThe roasted chicken poke bowl had a lot of flavor and was very light, filling, and healthy in its own way. The pork dumpling were pretty good too.\n\nOrder was quick too, no more than 12 mins to receive the food. Took it togo and I wished I stayed to try the drinks because of all of them looked pretty amazing.\n\nI’ll definitely be coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoblB5VnhBRRAB",
            "text": "Found this little gem on a recent visit to Rockaway Beach. It was rather cold out and I ducked inside to warm up and grab a bite. Dry January didn’t limit me - bartender whipped up a very delicious, soothing Tiki Toddy to take the chill off sans alcohol. Chose the onigiri for a quick bite and it was amazing. Great service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2eElhczdnRRAB",
            "text": "Fun and tasty spot, much better than it has to be! In fact, the fries with togarashi seasoning were excellent, arriving very hot and very crisp! The dumplings were also tender and delicious, and naturally the drinks were well made and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyM29QbldREAE",
            "text": "Great Place! Nice atmosphere!\nDelicious food! Be back for sure!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMF9yZnVnRRAB",
            "text": "Great place for a late lunch and afterwork libations. Try the poké bowl with their colorful and fruity Poseidon Punch. The ambiance and service are absolutely outstanding!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbU1xOG13RRAB",
            "text": "Loco Moco and Poke Bowl.\nWe've been going here since our son was 1 , he's 4 now.The Moco is new  and on certain dates they have live music . It's a cool vibe , the outside indoor area is new to us this year . Definitely will come back later this year."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2c1lQaUVREAE",
            "text": "Delicious food and good people. Highly recommend for nice lunch with friends. Qr scans with table numbers are used for ordering. Drinks are ordered at the bar. Poke bowls are the favorite. But the fried tofu buns were amazing as well. Two thumbs up for sure."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdE0yZHRnRRAB",
            "text": "Very tasty drinks and food. Tiki fried and kimchi hotdog are highly recommended!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxNTd6U2dnRRAB",
            "text": "I was so sad when the Thai restaurant closed! I enjoyed a poke bowl and lettuce wraps. The staff (Susan, Pineapple) were attentive and friendly. Nice drink menu and good Rockaway vibes. Great addition to the neighborhood."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMW9lQ3VBRRAB",
            "text": "This place is unbelievable! Great atmosphere, awesome food (big portions, tasty and well priced) and frozen drinks. Everybody was kind and helpful. Will come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaXZmVFNBEAE",
            "text": "We really enjoyed the place. The drinks were lovely and it was a surprising little place - we went when it was pouring with rain so it didn’t feel very Hawaii but when the weather is nice I’m sure it does!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2czUzbWZ3EAE",
            "text": "Great place to unwind after a long day at the beach surfing.   The staff is friendly, the food pretty good, and the decor very stylish. 🤙…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlZ0lER3dBRRAB",
            "text": "I love this place will definitely be where I eat when I go to rockaway, the service is so good our server was very attentive and kind, and the food and drinks are so so so good and the fresh tuna is really fresh!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLME5QYkpBEAE",
            "text": "Great little spot with inviting and cosy atmosphere and decor. Nice cocktail menu and light food fair.\n🌺🍹…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bXRIRzdRRRAB",
            "text": "The salmon in the salmon poke bowl was overwhelmingly salty, which was a pity because as the main star of the dish it took away from the great salad and decent sauce."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxNEozOHdBRRAB",
            "text": "Such a great experience. The food is sooo good and the atmosphere is great and very relaxing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyM2Z1MTFnRRAB",
            "text": "Great service. Drinks weak but good. Good decent but way overpriced for such small portions."
        }
    ],
    "reviews_count": 60
}