{
    "name": "Oasis",
    "place_id": "ChIJg0wl7expwokRFkfksbzlMSQ",
    "grid": "QN14",
    "address": "92-08 Rockaway Beach Blvd, Far Rockaway, NY 11693, USA",
    "rating": 4.7,
    "user_ratings_total": 280,
    "phone_number": "(718) 318-3888",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sYWFtRXlNSGMyWm1jMlJYQnlWamgyYUhsaVZXYxAB",
            "text": "Great people, great food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNFgxWllVRGxHUzFCaWVUQjBOMEp2ZFdaWk9VRRAB",
            "text": "Love Oasis ramen, a great little spot to dine in - especially during cooler season temps. The staff is kind and the vibe is cozy and chill. Have also had take out and it’s equally delicious - not an easy task with Ramen. Give it a go if you haven’t!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sS1kyRnBRbmxVWDBGRFVWTTJOR2x1VFMxaGJsRRAB",
            "text": "Came in with my friend after a beach day and we both really enjoyed our ramen!! I had the tonkatsu, my friend had the shoyu. Generous toppings and noodles, flavorful broth, and delicious spicy oil. We left full and satisfied :) Our server was friendly and attentive and the meal for two was very reasonably priced. I will definitely return next time I am in the area!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKU2JGcFNiV1JvZW1RNWQybDBRamRZWTNKcWJIYxAB",
            "text": "The food here is always top tier, consistent and always delicious and never have I ever had anything bad from here. Anyone complaining about wait times and being told they can't seat you. Yes, in house dining isn't the only thing they are trying to keep up with. From door dash to grub hub and seamless. They always make sure quality is there and do not want to put out bad food. Come back another day and give them a try. I guarantee you, you'll be hooked."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeU5IazBjbnBHVTNOaVFVOTBYMnhuZG5oclYyYxAB",
            "text": "Delicious food, Excellent service, reasonable prices.  Overall,  highly recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVmNrWTFkbTVLV1VVek5GSm1hMk42VFZCMVlVRRAB",
            "text": "The food is so delicious and fresh. Excellent service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScE5WWnpabEpLTlZCM05tcElabk5uYlMwd1dXYxAB",
            "text": "I dont find myself ever going back to the are of location but if your there its worth it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RlUyaDRSMnBDWHpkck0xaFJNVGxhVHpCTU1XYxAB",
            "text": "Delicious food awkward empties and the staff was very picky as to wear we sat?? Like no one is here. Besides that everything was alright."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQ2FUbFFPRlJpVm1wRFNUSnZWRzlqVDBoRlprRRAB",
            "text": "The best ramen in Rockaway as I encountered right now"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVFkzbEZOSE5aU1hSd1UzZHhhVTlGU21kNmJrRRAB",
            "text": "I was very excited to go and eat here with my friends, we arrived at the ripe time of 7pm but was denied service due to the kitchen being “too busy.” they had a table of 2 already leaving, as well as open tables that we could’ve sat at. i asked for a wait time and was told that he didn’t have one. The employee I was told no to didn’t care to work with us, nor give us an alternative option. If you’re thinking of giving them business, don’t."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSU5qbGtXa1p6TkdOU00zVk9SMk13WTNOUFIwRRAB",
            "text": "For some reason, on a Saturday at 7pm of all days, us along with other parties got turned away because they were \"too busy\". They had 3 out of 4 tables full and 2 of those tables were getting ready to leave. We asked how long the wait would be and were told again they were too busy and they don't have a wait time estimate whatsoever. If you want your business to not make money, just put a sign up saying yall are closed"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQ05WUnZialZaUW5sYWQxSnFjVmxTYUhwM01VRRAB",
            "text": "Got the Takatsu ramen here after a long day at the beach! The ramen was delicious. The pork belly was so tender, the broth was rich and the udon noodles were the perfect balance between chewy and soft. The service was lovely with the waiter taking our orders and cashing people out for online orders."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0d2IwNTFja0owZVdOdVdYRkVObkIxZUZseFRFRRAB",
            "text": "I've gone here a couple times with my family and the service has always been good here. The popcorn shrimp over rice and pork belly buns are my favorite things to order. My only issue with the pork belly buns is that the pork is a quite tough, but other than that, it's a well made dish. Nothing on the menu feels over priced and you get a good amount of food for what you pay for. The environment is very calming and the owners are really nice, and it feels like you enter a different world with how quiet and calm it is. I'm a huge fan of this place and would recommend it to anyone who likes asian cuisine."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4M1JVVXdVUzE2WVRKamJHZFJUV1kzTmxKMWFFRRAB",
            "text": "I ordered their ramen on a rainy day and it didn't disappoint me. Nice work"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTmIxZHhSV2wwWmxsa05rTkVWRUptU25SV1VXYxAB",
            "text": "Great job with the food service and so fresh it just makes your taste buds happy!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWVoyRkNNazR6U25kc05EaEVRMHBEYm1FMVpuYxAB",
            "text": "The noodles were so good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNUDkzWjJpcDVxd0tnEAE",
            "text": "Staff on duty allowed a homeless man walk to each and every table, demanded attention from and every customer, and ask for change. Meal was interrupted. My first time here. Water taste like tap water and very lil tissue in bathroom"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcEx6ZjB3RRAB",
            "text": "The tonkatsu broth is solid, a nice creamy color and tasty. However the gyu don (beef bowl) was SOO dry for the beef. I couldn’t believe how dry it was. It’s like they didn’t stir fry it with sauce at all. The rice and fried egg were yummy though - I had it hours later and the egg was still runny inside"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNXFDb09nEAE",
            "text": "I’m obsessed with this place, it’s my favorite spot to go to whenever I’m craving ramen. I’m literally always in here 10/10 WOULD RECOMMEND!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdmJhaUpnEAE",
            "text": "The food here was mid. The broth for any of the ramens taste like water with food coloring. I had the tonkotsu my family had the miso and my kids had the veggie shuyo. My noodles were mushy. My family thought the food here was ok. The chashu pork in my ramen was nicely flavored. Will not be coming back nor recommending."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdE9mSnNRRRAB",
            "text": "Been coming here since it first opened as a kid still coming here now. I’m 20 the food is incredible and owners and staff are the friendliest."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bnJ2RmxRRRAB",
            "text": "Best ramen I’ve ever had. The meat in the tonkotsu is always perfect. Fried ice cream is also great. Great service too."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOVo3ZUl3EAE",
            "text": "Beautiful small place with upscale taste. Short menu but brought to perfection. Good to have it in wild rockaway"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbTRDQVN3EAE",
            "text": "Great place to grab a quick bite of ramen! We got Shoyu and Tonkatsu ramen— they were both exceptional! Very casual and laid back, perfect place to just enjoy the food on a quiet day."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOXE3NnV3RRAB",
            "text": "A classic ever since its presence blessed the Rockaway peninsula. The Tonkotsu ramen, Chicken Karaage, calamari sticks and pork belly buns all stimulate endless euphoric emotions in my brain and body. I typically stick to those four options but would love to try new things next time. Thank you for your quality business."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NUpEVVVnEAE",
            "text": "My go to spot for delicious ramen. Im allergic to ginger and thwy are always mindful of that. I like extra bokchoy and I always request no fungi. It's always arrives steaming hot and fresh. If you haven't been here or done take out... you need to!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Nk1tREJREAE",
            "text": "We loved this place. Everytime we visit Rockway beach, we will have lunch here for the Tonkatsu ramen. It is a bit salty and thick for us, so we will usually ask for half salty. Lovely place, lovely window bar seats."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYd2VPZDRRRRAB",
            "text": "This is one of my favorite restaurants to go to. The service is always excellent. The food is incredible, and the atmosphere is extremely cozy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbm9QX2l3RRAB",
            "text": "This place is a gem, The Tonkotsu Ramen with Pork belly holds its own against the fancy overpriced places in Manhattan. I have had it many times and the pork is simply delicious, and the soup is rich and has a complex flavor. All for under $ 15- The interior is nice but nothing fancy. Excellent quick service too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdHZLWHRnRRAB",
            "text": "Great soup and Appetizers. Service is excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMktEcVRBEAE",
            "text": "Interesting food. Japanese cuisine. The minyu is very small, snacks and a very tasty soup."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuenBLSmpRRRAB",
            "text": "Great food with a chill, laid-back ambiance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMm9ET1lBEAE",
            "text": "The place you come to eat when you’re in Rockaway!  The veggie chicken ramen was absolutely delicious and satisfying."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOV9IUHdRRRAB",
            "text": "The best ramen in Queens. I've been here at least 30 times 😋. Owners are always nice and friendly. The bad thing is that it is so far. I usually drive 25 minutes and pay toll to get here. That much i like it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MVpmLWdBRRAB",
            "text": "Good food, good prices, good service!\nRecommend the vegetarian chicken ramen :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3M18tdWlBRRAB",
            "text": "We recently dined at oasis ramen house and overall had a good experience. The food was delicious and well-prepared( miso ramen 😍with all that pork was perfect and the eggs, I can't even tell you how good that was)\n\nEvery dish we tried was satisfying and clearly made with love, not fancy but tasty.\n\nHowever, one aspect that puzzled us was the choice of serving the food in plastic containers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cnNMZTVBRRAB",
            "text": "The food was amazing and the workers were really nice I really recommend this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydnZ6ZV9RRRAB",
            "text": "Their pork belly buns are to die for, so amazing, full of rich flavor. Will definitely go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyanFLdXZRRRAB",
            "text": "Got the pork Gyoza, Pork Belly Buns, Tonkotsu Ramen and Monster Ramen.. every dish lived up to the taste I’ve known of ramen. The monster ramen was a standout. Server was friendly and service was prompt."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMb2N5a21nRRAB",
            "text": "This is the best quality food you will find for the price in the area. My giant bowl of ramen was $14. There’s only a husband and wife working so be prepared to wait a little bit for the food but it’s totally worth it. Absolutely delicious. Also they have GF options for noodles which is awesome"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdExMX0pBEAE",
            "text": "A lot of these reviews must be fake because I ordered three things and not one of them were of good quality. So I decided to try something new and ordered shrimp dumplings, fried icecream, and a soup…. Look at the raw egg in my food and how it’s brown like it’s been sitting out rotting away… the shrimp dumplings are made with FAKE imitation shrimp!! The lowest quality “shrimp” they could get their hands on… & the fried icecream should not be served to anyone. It’s disgusting! It tastes exactly how it looks… nasty! It was also fried in OLD grease… you can smell the old oil coming off of it. I’m a big foodie and I hardly ever complain but they should not have a restaurant."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcTVhT1hnEAE",
            "text": "Cute and cozy little Raman house that i order delivery from often.  Love the rustic decor of the place and the cool surfing photos.  The service in or out is always fast and reliable.  Love the Monster Ramen its just about perfect.  When i dine in I always get a nice hot sake too.....The place is Soooo Good\nEspecially on a cold or rainy night."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsZ3FUTGN3EAE",
            "text": "Always fresh and delicious.  You must try the lollipop shrimp appetizer.  The gyoza is extra good as well.  The monster ramen is a blend of tender beef and pork blended with the most delicious spices.   The cold kale noodles are delicious as well.  Def get the sake."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0d2MtTzdnRRAB",
            "text": "Deciding to move to this neighborhood and checking out all the restaurants around. This place surprisingly was good. We ordered miso ramen and shoyu ramen. Both were really good. In a lot of restaurants broth is always too salty, but this broth was perfect. And one more thing that liked the spicy oil sauce. It was soooo good, that I could not spot adding it to my ramen. The sauce had sesame seeds and the seeds gave it a very special buttery flavor and it was tooo spicy. Many I should buy for home)))"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRaV91T1NREAE",
            "text": "This place is lovely! The ramen is so good and at such a great price(Around $32 for two bowls and two desserts)! Compared to places in Manhattan and such, a great deal! The staff was kind, patient, and professional! The dessert (Mochi and…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhcUxqcE5nEAE",
            "text": "The food and service was excellent! The Ramen was super tasty and was a great blend of flavors. The place was not overly crowded and the food came out in a reasonable amount of time and was piping hot. I will definitely eat here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaZ2J6NTZnRRAB",
            "text": "AMAZING, authentic tonkotsu ramen. You can tell they put care into the food they make, and the result is the best ramen bowl I've ever had. The restaurant is also impeccably clean. I would make the 1 1/2 hr journey back to Rockaway just to eat here again!!😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtaGVMTmh3RRAB",
            "text": "I had the classic tonkotsu ramen and the broth was good. However, the temp could’ve been higher as my dish was just warm and the bowl could use more broth. You get a lot of noodles but they tasted a bit over cooked and was too soft. The cha…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwb08yXzFnRRAB",
            "text": "Ordered from here 4 times and I never have a single complaint. I’m glad this spot opened up in the Rockaway’s. Def will be visiting for the 5th time soon."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZMGRDQXB3RRAB",
            "text": "First time I've been there, and definitely will not be my last. I'm not a specialist on Ramen but this was excellent. The entire experience and the food was top notch. The hospitality shown by the servers there was great. I went there early…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleHBmRkZREAE",
            "text": "Our favorite place in town for dinner.  The Ramen is amazing, as are the gyoza, and the pork buns are fantastic. Such a great place to dine.  And do yourself a favor  - save room for the fried ice cream."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneWRQRDJBRRAB",
            "text": "Really great food! And the staff are also very great. The only thing I would suggest is fixing their sound system."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1c2NyZ2l3RRAB",
            "text": "This place was pretty dope. It's like a humble beach town ramen shack. Good price, cheaper than midtown prices. And tastes good.\nThe appeitizers (popcorn shrimp and fried chicken) were surprisingly good. They could have put slightly less sauce on it though. Chashu was MUCH better than the much for expensive midtown Manhattan ramen shops. Egg was good too"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadnBMYmNnEAE",
            "text": "came here cause of the reviews and glad we did, karaage and pork buns were delicious, ramen was pretty good and hit the spot with plentiful toppings. street parking can be tough but that's Rockaway in general"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3a3ItT0FREAE",
            "text": "This soup was freshly served and hot, chef was friendly. Seating is intimate. Nice spot for a first date or anniversary dinner or work meeting. You can be seated right by the kitchen and see your food being made."
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVZzVQZEJ3EAE",
            "text": "Que buen ramen. El lugar es unico. Son muy atentos en el servicio y nos recomendaron lo que comimos. Todas las recomendaciones incluyendo el sake estan deliciosas. El caldo del ramen y los fideos excelentes. El cerdo con un sabor espectacular. Recomendado"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNXR5RWFBEAE",
            "text": "Finally a ramen place in Rockaway! Thank the gods.  The ramen is great, exactly what you need during these cold winter months.  Classic tonkatsu is always a go-to, but the pork buns are also amazing.  The setting is nice and subtle, quiet and they have great service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyX19HUC1nRRAB",
            "text": "This place is a great ramen spot! 🍜 Oasis gas a wonderful selection of delicious 🤤 ramen bowls! Service is quick and staff 👨‍🍳 is super friendly and professional!I wish I came here earlier!"
        }
    ],
    "reviews_count": 58
}