{
    "name": "Kimo's",
    "place_id": "ChIJAQCVGUdowokRpauTlXu2HP4",
    "grid": "QN14",
    "address": "92-16 Rockaway Beach Blvd, Queens, NY 11693, USA",
    "rating": 4.8,
    "user_ratings_total": 1152,
    "phone_number": "(347) 926-4384",
    "reviews": [
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOd05VNXlUV3BxWmpaeFIxWXRiRmcyVlVwVGEyYxAB",
            "text": "Really cute place!"
        },
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWlgxVmxabk5pT1RSNFZVbFVXR3gwY3pBelYyYxAB",
            "text": "Great service and owner! It was a pleasure!"
        },
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obmJWVTJXazlrVUV0NE1uSlRURTFYTVZGMFprRRAB",
            "text": "Amazing experience!!! Family owned business and all homemade! Will be back :)"
        },
        {
            "date": "18시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUFZGZDZUM0ZxTlRWeWFFbEVVSGg0Y1dJMVQwRRAB",
            "text": "Decent experience overall, food portion was on the smaller end of things. Service could be a little bit kinder. Not bad."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjemJ6bGZWM3BzTFVOdlRVOWljRzV1VUVWTWJuYxAB",
            "text": "Place rules."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTE5tOHhZMVZ2VFZkbWFITllRMEp4WW1wS1YyYxAB",
            "text": "Wow!!! This is the best salad I’ve ever had! The mixed greens were fresh!! Crispy! Variety of mixed greens kale spinach- what a great idea. I ordered a side of lamb and beef meatballs- full of flavor and paired perfectly. Also came here for the bowls and tried all the other options of meats, chicken, pita, sides available- always 100% food and service!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCb1VsaHpjbWN4VVVwV1RqWklabXRsVDFSNE0wRRAB",
            "text": "Wonderful food !! We had the bowls and they were absolutely delicious. We also got the baklava but what really stole the show is their homemade Dubai chocolate bars which the owner makes himself and it was delicious 😋"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKcVZVMVpUMDR4VUZSdFRGcG1abWxpVEZKNFRFRRAB",
            "text": "Kimo’s is such a great spot by Rockaway Beach. The food is always fresh and delicious, and the service is amazing  everyone’s super friendly and welcoming! They always give  great filling portions as well! The owner is really cool! Great vibes and atmosphere, definitely one of my favorite spots !! They have an amazing place to sit and eat outside in the back, definitely recommend if you're in this area!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNVZEWnNSemhOTUUxRFJYUnFjR2c1TkRGd1prRRAB",
            "text": "Love this place. Every time."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTmR6UkJia1pLWkZoSlJGbHZZbE5MZDBwTE5XYxAB",
            "text": "Not fresh and didn’t taste good. Good a bowl with steak that didn’t taste fresh and good, and huge tomatoes that haven’t been diced properly. Forced myself to finish it because didn’t want to waste meal that is not cheap. I had ordered cucumbers in the bowl and they didn’t include it. A was a very plain bowl with rice meat and tomatoes and paid $52 (with two coffees and desert). Not sure how this place has 4.8 reviews, so deceitful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RdFIyOUNhVzlMY21KdE5tNDNkV0ZrVmtJME9VRRAB",
            "text": "Amazing food and nice seating area! Probably the best fries I’ve ever had! Also the workers were very kind and helpful"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUGRXOUhaME5yV2tob2NERmZRblppVHpoc1pVRRAB",
            "text": "Stuffed Falafel?! STUFFED FALAFEL!!!! This was magnificent. MAG NIF I CENT. Loved the seasoning on the potato wedges too. Top notch. Will definitely be back. Mediterranean spots always hold it down for us vegans but this was a refreshing twist."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNFpFTmZXVTFLWWtkdFozQXRNbkpTU3pkRmNVRRAB",
            "text": "When we first walked in, I was intrigued by the art, and transported by the music, back to Egypt. As we were scoping out the innovative menu, an Elder gentleman walked in, who the cashier (who I later discovered was the name sake and owner of the restaurant) called him by name- He   clearly was a regular. It was at that time I knew we were in the right place!!! The servitude was distributed with such patience and warmth. The food was served fresh to order, in premium accuracy and ultimate deliciousness! My partner had the authentic stuffed falafel with eggplant and spinach.\nI had the Sambusa with Lamb and they were fresh rolled in house, filled to capacity with juicy tenderness, and seasoned to perfection! I had to try dessert! I opted for carrot cake and it was NOT a disappointment! We WILL DEFINITELY be back!!! It was so delicious that it disappeared before I thought to take a photo! 🤌🏾😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201T1JUUnlUVGd4ZVRSSFRUUXlRekp5WVhORFkwRRAB",
            "text": "Please come here for the best food youll ever experience. The owner is super friendly and the staff is great. Everything on the menu is too good 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcWVXMTNYek42WVZWTFlURmtRbGMxYWtOMU1YYxAB",
            "text": "They harvest their own cucumbers and tomato its awesomee"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poV1RrRjRUMjgyUTBSSmRXRXdURXRmTlRsb1NYYxAB",
            "text": "Chill spot, good food, everything is expensive these days, but I’m glad I came here! It was a great break from the beach 🙂"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseVlURlRka0ZKTUdWTk1qUTBWRFEyU25adlYxRRAB",
            "text": "The food was fresh and delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRVdUUk5NVGRDV2pKQ1RrcG1OMGRQVVcxRE9IYxAB",
            "text": "Kimo’s has been a lovely experience — Yazmin was incredibly helpful with describing all of the offerings to a First Time Customer, and the food was absolutely delightful.\n\nThe outdoor seating area brought the charm of my time spent in Greece amidst the hustle and bustle of NYC. Looking forward to my next trip to Kimo’s for lunch!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRlVVZDJlSGR6TWsxd2RXRmlTWHBxZDFGNVkwRRAB",
            "text": "I was really looking forward to eating here, but I left disappointed. The food here was absolutely terrible. The meat was so tough it was inedible, and everything tasted old, like it had been sitting around from the day before. Nothing was fresh or enjoyable. Definitely not worth the money or the trip."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VeGJtSnljM3AwV21vMFptVnpTSFJ5ZGxJelNHYxAB",
            "text": "Outstanding.  Food is great and service is great.  Be sure to eat outside at one of their patio tables."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONlRFRnVSMTlLWlVjd1YydDRWSFF4TkVWT01YYxAB",
            "text": "Very fresh Egyptian food! And very friendly staff!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Rlgyd3dUR0pPWWw5aFdXbGtUR1JYTVhSVE9YYxAB",
            "text": "The food is good and service is good in the restaurant but delivery always takes forever."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kYWVtUjBWVWsxYWpWNU1rUkJUMnhJZUVreVIzYxAB",
            "text": "Me my mom dad and little brother came here for lunch amazing place owner is super cool food was great came out fast genuinely tastes like real Greek food the area to sit in the back was super chill amazing place great vibes all around and even better food. Highly recommend the Hibiscus Tea"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUVVIbzJjSGRWZGpaR2VYUnpNMTlDUmxSNFRYYxAB",
            "text": "My brother and I visited this place, loved da food staff very welcoming."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMlFraFNNbEV0TjJ0RmEyVXRPVFUwU1dack5XYxAB",
            "text": "The staff is friendly; makes everyone feel like part of the family. Portion sizes are large and food is fresh. We stop by at least once a week."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMFdXNWxXR1ZHVmtaQmMxcENSbGRwVWtsMWQzYxAB",
            "text": "Soooooo good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSaFVXTlFlamQzZGxkcU1YaHdiVkpRUW5waVgyYxAB",
            "text": "perfect spot for a low-key but filling meal at the end of a beach day! the backyard made me feel like I was really in Greece"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeWMwWTFUbU5JVUV3eFJHOU1YMmhCUnkwMFYwRRAB",
            "text": "A family  business proud of their culture. A very special place that will transport to another world. The decor, the music, the menu it is great. The customer care is something that I will carry with me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSVMyVjNNMGRtV0VsMlFUTkVRVmRRUzJOamVWRRAB",
            "text": "Kimos is outstanding ! Ordered the steak schwarma sandwich on whole wheat pita with sweet potato fries! So glad I took the trip out here !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadWFuTk5ZbU5YWjBaSGRVaDFaM1l6V1RVMGVuYxAB",
            "text": "The food was amazing - fresh, flavorful, and authentic Greek taste! Kimo gave excellent service, was friendly, and made me feel very welcome.\nHighly recommend this place and will definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTVpXRlNTWFZaY0VFNVZVWjJkMnRuUVZWNFZFRRAB",
            "text": "Hidden gem with great food, great prices, and fantastic service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRE5VZ3dVRkJmWjFkaU1USm1VRUl6WlVSUUxVRRAB",
            "text": "Delicious food. Great Mezze platter! Baklava delish! Amazing staff!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWmNsVTBURFpWVDA1NU1FOWxWeTA0WW1KZlQxRRAB",
            "text": "Such a great vibe, such friendly employees. The food is phenomenal. Theres so much to experience here it was tough to choose a place to start!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdGVESmpRbkZRY1d4dlQzUjNUMUpMZFRFeVNXYxAB",
            "text": "Excellent food, lovely spot.  Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toT1FsSjZhamd3YzI1MllscHBkM0ZCUm0xNlJuYxAB",
            "text": "Amazing lamb pita! So large I took half home!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMGFQTEVREAE",
            "text": "The foooood is soooo good I come here almost every day delicious and comfortable dine sitting area where you can sit and eat I love every bit of this place and the ppl who work here are very nice and welcoming 🤍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNFMweE1jR2xGVTJKc1ZHeEdTVkZ0V2xoM2MyYxAB",
            "text": "Worst food in nyc because of the presentation, quality of the food and the portion. The $18 bowl looks sloppy-they just throw rice and some meat over it with the hummus on top of the meat, and call it a meal. The quality is inferior-the meat tastes old and dry, the rice is undercooked, the eggplant is super salty, the hummus is watery and just thrown on top of the meat. The portion for $18 is so small. I don’t know why it’s priced like that. The Moroccan mint lemonade was half ice, half some water with sugar. There was no flavor other than the sugar. What was worse was that they poured it from a cooler like those you take to the beach. Overall, terrible experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WFEwazRlV0ZrVXpCelVUUkpZamxRVkZwaFZWRRAB",
            "text": "The falafels are sooo good.  I loved my bowl and Kemo himself is absolutely charming.  Will definitely be back—probably several times per week!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMFNFeDZNRmxYYkdnM0xYcEhWRFExU0ZBMlRsRRAB",
            "text": "Lamb didn’t have much flavor. Cheese dessert had no cheese. Wait staff was too busy to help me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGclNHNWplRUpWVkdReWJFSlNka2xGTm1kSWJFRRAB",
            "text": "Really good spot in Rockaway for great food and great service ^_^ would come again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReVZWVkRXbWwxUTIxNVVrbHVkbTB6UVVKeFRIYxAB",
            "text": "The food came cold, the fries were not fully cooked, there was hardly any chicken ony gyro. I'm so disappointed in this meal and the waste of $. I called and spoke to manager I was kind, he was polite, however I realize I got horrible, cold food because they were having a busy day and they were \"behind \" because of being so busy. I won't even write about the dessert. The Lemonades were even warm... I wasn't offered a refund, i got an apology, but it was my first and last time ordering from this restaurant with such wonderful reviews.The only good thing I can say is that vegetables were fresh."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TGEzWTVPRlpCWjBKSU0ySlZTemxsTm5CUE9GRRAB",
            "text": "The workers here were so nice! The cashier she was so sweet and the guys that were cooking my plate were nice! It made the food taste even better. The food itself was really good especially after coming from the beach, I came hungry and it made me satisfied! Will be coming back 😊 def stop by and grab yourself a healthy meal!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN0x2SWp3RRAB",
            "text": "Mike and Jasmine were so lovely, and the food did not disappoint. The stuffed falafel  was on another level. So fresh. Perfect for a vegan like me. Lots of options. The backyard is also so beautiful! Love the paintings."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5c2VIUzd3RRAB",
            "text": "This place is perfect for a quick bite or even to sit down for a bit with some friends! The atmosphere is amazing! They even have a cute space in the back which feels like you’ve been transported to someplace else but Rockaway. They even have vegan options! Their service is awesome and quick! They’re very accommodating! We had ordered The Thick Chick and Hawawshi stuffed with spinach. They were both very delicious! For drinks, we tried their Moroccan Mint Lemonade and Peach Ginger Lemonade. Can’t say which one was better but they were both very refreshing!! This place is definitely worth visiting!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcE9iUWxnRRAB",
            "text": "The best mediterranean street food in Queens. It is worth the trip to Rockaway. I had my family travelled all the way from Jersey to try this amazing hidden gem. I recommend the fat boy Pita. Can’t go wrong with any meat choice and sauce, they’re all delicious. We were greeted by the owner and one of his sons, they were both extremely kind and gave top costumer service. I highly recommend this place to everyone."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbXFfTVh3EAE",
            "text": "I’ve here twice this summer and each time the food and service was amazing! The sign outside initially brought me in. I tried the thic chick and it was SO delicious! The fried chicken was crispy and their special sauce had the right amount of kick to it. They were even accommodating to my non-spicy request. The banana pepper was delectable to have on the side. My first time there, I tried the design your own pita it was also delish. They also have cute outdoor seating and bring your meal to you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNlJFZENaMkppWVc1Qk4zRnlla2swYUc5T1ZWRRAB",
            "text": "The eatery is beautiful and conveniently located near the beach. I was really excited for Mediterranean style food, however I was really disappointed with my meal and had to force myself to finish it especially since my beef shawarma bowl with fries was $30. The beef was very dry and chewy (despite my ordering earlier in the morning) and I was unable to finish it. The hummus was also dry….I literally had to force myself to not waste my food/money to finish it…Grateful for the convenience but disappointed by the quality esp for the price"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ajkyejdRRRAB",
            "text": "Amazing place, it smells so good when you enter! The food is really good, Egyptian falafels are great! Love the backyard with the sand area and lounge chairs. We were happy to be able to bring our bikes inside. Really recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycUpPbmlRRRAB",
            "text": "We came on a Wednesday afternoon right before 4th July. We found it a few streets back from the beach and came in because of the reviews. The back yard is shaded and comfortable with music and greenery. The lemonades are refreshing and flavourful. We had the Thick Chick sandwich which was delicious, messy in a good way! We ordered a portion of sweet potato fries between two and they were a surprise - each of the fries is huge, very thick and we couldn't finish them. The staff are polite, and just present enough to be helpful :) on our way out we got chatting and they even kindly gave us some free dessert!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGcFpUcUx3EAE",
            "text": "I had the Pita, my wife had the bowl. The food was absolutely amazing. Fresh, healthy and incredibly delicious. Perfect portion. The desert was so good I had to hug the chef. Literally! The atmosphere was lovely. The service was terrific. My wife and I are already eager to return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUWEyMXVNa3d0TWtwU2NYVmZXVzF3WTFwWVozYxAB",
            "text": "Had the most delicious lunch here. My husband is obsessed with Mediterranean food and he said this was the best falafel ever!\n\nKimo’s is a family run business and could not have been kinder. Mike the owner welcomed us into the family with open arms! We will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6XzdyNjZ3RRAB",
            "text": "I recently got takeout here , and tried the lamb gyro bowl with spring mix, onions, jalapeños, banana peppers, spicy sauce, and white sauce. The meal was incredibly fresh and flavorful. The tender lamb and crisp greens balanced perfectly with the spicy kick from the peppers and sauce, while the white sauce added a cooling touch. Every bite was a delightful mix of textures and spices. If you’re in Far Rockaway, I highly recommend trying the lamb gyro bowl at Kimo’s. You won’t be disappointed!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eGFTcnVBRRAB",
            "text": "We actually love the food here. Very small, only 4 chairs but  was delicious and fulfilling"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCemVtNDVlREo2V1doZmVFeHdjVWMwUTFGM1dVRRAB",
            "text": "Big Vibes with the patio. Fried chicken sandwich was pretty good, the Mediterranean slaw in the sandwich was refreshing. Iced Peach ginger was a banger, the ginger flavor really shined through but wasn't overpowering."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdjZyYmFnEAE",
            "text": "I love kimos! I came here two days in a row and both times it blew me away with how fresh and delicious it was! The service was amazing and the girl at the front register is so sweet. The restaurant is also so clean! The portions are also a great size and their backyard is perfect! I cant say enough good things about this place :)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdklpNG1nRRAB",
            "text": "Love this place! The owner, Mike, and his family are wonderful people and a staple in the Rockaway neighborhood. The Gyros are delicious and made with real meat, not processed stuff like other places. The bowls are a good alternative to the gyro as well. They offer a fantastic lamb shank, a Greek Moussaka and many other tasty dishes. Also, love their choice of hibiscus teas and lemonade.  They have an amazing garden in the back to enjoy after a long daynat the beach."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocHBiTzNBRRAB",
            "text": "Service was amazing the lady gave recommendations and explained ingredients. The food came to us in a timely matter.the falafel was fresh made and you can taste it with the amazing flavor and spices, with just the right amount of crunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqM3NMUVBnEAE",
            "text": "Their falafel mahshea might be my new favorite falafel in Queens. Stuffed with feta cheese and green olives. Served fresh and hot, perfectly crispy on the outside and fluffy on the inside. They have another version stuffed with eggplant and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaOG9iSzdBRRAB",
            "text": "Beautiful place steps away from the beach with a lovely outside seating area that is more like an oasis. The owner, Mike is a very nice man that stops to talk and ensures you enjoy your food and overall experience. Kimo’s has been a staple in the Rockaway community for quite sometime and keep improving. They have a nice selection of desserts including a moist baklava. Their thick chick is also very delicious and filling"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOVpXS3l3RRAB",
            "text": "Lamb gyro was absolutely delicious.   Tasty spices.  Very good portion.  The French fries were super yummy and cooked to a crisp.  The yard is nice and spacious to eat out on a beautiful summer day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIak5ES09nEAE",
            "text": "I usually don’t write reviews like this but please save your money - the food here is really, truly flat out bad. We struggled to finish our sandwiches which had little meat, some sauce that was so bad we had to scoop it out, and the fries were dried and reheated. Add to this the absolutely rude service here - we asked for extra ketchup and were told no, we asked for an extra hot sauce and were told an extra charge and were happy to pay but the guy didn’t even let us take the food until we paid the $.75 (on a food order of nearly $50), and were overall treated with rudeness. It’s a shame because we live close to here and would’ve loved to come back - but never again. Save your money - there are better restaurants, with better service, and with better regard for their customers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad28zMGJnEAE",
            "text": "stopped by with my friend after the beach and they did not disappoint! The service was really nice, portions were great we couldn’t even finish and the food was just delicious! They even had gluten free options for my friend. The place has a nice little backyard. Will definitely be our spot when we are in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscnNtcmF3EAE",
            "text": "I’m not sure how I feel writing this review. I used to champion this place and recommend it to everyone as a top 3 rockaway gem. The first time I tried it was amazing. Yet every other time I come back or order out the quality decreases. I was okay over paying for Mediterranean food due to their lack of competition and their super quality but now - to pay these prices and receive bone dry meat and stale pastries that would make any chef have a stroke. It’s sad. I am actually devastated at how inedible it’s become. I can’t even leave a 1 star review because I know how much potential this place has but today… I was very disappointed. Please look at the images of the food - I like to have the food speak for itself my words are just a bridge to get you there. I have put images of the bowl steak and chicken (dry as a bone) and the baklava and kunafa. Please if you’ve never had real baklava or kunafa google what they look like. I’ve eaten Turkish and Greek styles but whatever they served I wouldn’t give to my worst enemy.\n\nSo please Kimo’s I love this place and want it to do better. So do better.\n\nOn one positive note the falafel is still very good. And I did call and complain about the pastries so they redelivered a new batch. Which was very nice but the items were still not as expected. Basically not very good pastries. Very sad."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FdGVWOHpSMkZ0T1d4TlUzUlRUblZHVmpkd1UyYxAB",
            "text": "Probably the best gyro I’ve ever had. While we were there some women were screaming and throwing things at the workers so it was dinner and a show. Workers handled it professionally, knew I had to leave a review. Amazing food, amazing service, a real New York joint."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLeWJzOUc4NmVYNVZREAE",
            "text": "It took me awhile to give them a try, and man was I missing out. Such a great addition to a neighborhood that has so few options off-season. Their Egyptian-style falafel is one of, if not the best that I’ve had in the city. Everything else,…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyOHFTT0dBEAE",
            "text": "We came to Kimo’s last Saturday and we absolutely loved this place! They are dog friendly and allowed our fur baby to sit with us outside in their back patio, which by the way is absolutely stunning from the artwork to the impressive garden/vines used to create a very special atmosphere. You can tell they take a lot of pride and care of their business! We each got the Meze Plate and ate the plate CLEAN! The ingredients were so fresh and the flavors were all there! We will definitely be coming back the next time we visit Rockaway! Also, the owner and the staff were all so friendly. Definitely recommend this place!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDNGM3emVBEAE",
            "text": "There’s a lovely little outdoor space where we could sit down to enjoy our meals which was great. We had to wait for quite long for our meals to arrive, and it was a bit weird that other people who had arrived after us got their meal before…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oa1UybFRXV1p0WkdGR2MyOXJTMHRCV2s5RVVuYxAB",
            "text": "Just fabulous! Got a bowl with meatballs, hummus, baba ghanoush, tahini, rice & pickles. The meatballs were huge and the bowl had an excellent balance of flavors. Staff were super kind as well!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bVJ6bGxZMTlNZDFWd1RXNXpVbkYxUlVsQ1RHYxAB",
            "text": "Always great food when healthier takeout options at the beach are sometimes hard to come by.\n\nTheir Egyptian style “falafel” absolutely rips. Made fresh and on the spot. Chicken over rice style white sauce wishes it could compete with their creamy garlic sauce (toum)."
        }
    ],
    "reviews_count": 69
}