{
    "name": "Rockaway Fish House",
    "place_id": "ChIJ-xt7NyFnwokRTCXPYFxxJz0",
    "grid": "QN14",
    "address": "141-22 Rockaway Blvd, Jamaica, NY 11436, USA",
    "rating": 4.2,
    "user_ratings_total": 2218,
    "phone_number": "(718) 529-3576",
    "reviews": [
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaE5tRlRXbUZwVW5SVlYwdG5iMDlGVVVVNWRYYxAB",
            "text": "Sooooo good ❤️"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMFprSnViVWxvVURkVWRsTjBTbGhZYnkxQmFsRRAB",
            "text": "Well, its changed over the years since the last time I've been there. They can really use some work on a appearance. Presentation is everything, that includes the appearance of the restaurant and the display area for food.\nOutside of that the customer service was very good.\nThis time I only end up ordering side dishes. Mac and cheese, macaroni salad, sweet potato and rice and peas. Outside of those, the Mac and cheese was tasty. The sweet potato was right on point.\nThe macaroni salad was not good at all, and the rice and peas I could do without because it wasn't bad nor good it just tasted old.\nHowever is a convenient spot and the menu does have more on it so it's a hit and miss. It all depends on what you are ordering"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUk1rMUtjWE14VkRWSUxVVXdOek5LVGpGTFYzYxAB",
            "text": "Prices for a dinner are too high. 6 years ago a turkey wing dinner with more food was $11. Now it is $26. That is a 136% increase. Make that make sense. Not coming back because of that. Their competition is more reasonably priced."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKcWMyUkZjMkZvTjFwNWRYRmFTWFJmZVhkV2FtYxAB",
            "text": "The food fell off. The fish is tasteless now... no more returning.. Fish dinner $29.00."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONlRGcHlaRkE1ZVU1a1UwNDVhRWxyU3pSMlkxRRAB",
            "text": "I've been coming here for the past 15 years and I've never been disappointed 😊 compliments to the chef and the servers as well 💯"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMWNYZGpiMVJpYmtaVGEzbGhPVmg2Wkd3MU1XYxAB",
            "text": "Known about this place for some time but tonight was my first time eating from here!! Upon driving up I thought it was closed from me waiting at the light, it’s kind of stand-offish at night. I remember passing by few months back and seeing a different decor than what I seen tonight, something is different (paintings on walls removed, idk something) but to the food, I only got FRIED FISH (without bread) because that’s what I was craving, fish was seasoned, hot, portioned nice and served the way I like long whiting fish not the small fillet kind. The reason for the 4 stars is because the food was super oily which scares me but definitely didn’t bother or upset my stomach after consuming!! 👍🏽 I’m a big seafood eater and the whiting fish is one of the TOP fast-food I’ve had, kind of better than City Island  actually 🤤 there’s also parking available!! Definitely would stop by again when craving some fried fish!! 😋😋🔥🔥🔥"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3LU1yNnJBRRAB",
            "text": "The food was good, but the customer service was so horrible that their customer relations deserve a -10 stars!! The tall African American lady was so rude😔😐😖😥 like she needs to really get training on how to be cordial to people who are buying their food.. She screamed at me for telling her what I wanted to eat SMH. We must provide better customer service to the public."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLTFo1cGJranRtMmFREAE",
            "text": "This place has gone seriously downhill.  The food was old and tasted awful like it had been sitting out for days.  There's no flavor, no love, no nothing in their so-called \"soul food.\"  And to top it all off, I think they tried to pass off beef neck bones as short beef ribs.  Totally unacceptable! The service is disgraceful. No southern charm here. This place is old been here for a while and you would think some renovations had been done they closed down for a couple of months and then came back worse than when they closed. I think the Fish House Ran its race and now they need to close. They are now quantity over quality.  They lost their touch. Bye, fish house. Food sitting out all day until it's dried out. The health department needs to take a look at this place... Hot food should not be kept out of the refrigerator for more than 2 hours. If the temperature is 90°F or higher, the time limit is reduced to 1 hour. This is because bacteria can multiply rapidly in the \"danger zone\" between 40°F and 140°F. They used to have a quick turnover and line out the door, but not anymore. I only get the fried fish from here. The Fish is cooked to order. My family ordered that other stuff."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLdzRlWFFBEAE",
            "text": "About 2 years ago I went there and left empty handed.  Once I finally got the attention of one of the workers, I asked for an oxtail meal and the response I got was nothing short of a cuss out. The attitude was as if I asked did they have McDonald's food to serve."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZdmU3VFJ3EAE",
            "text": "Soul food! Get that Hot Fish sandwich!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNmJHNUNZa1k1Y1dGTE5rbHBVVTR0V1ZsaU1uYxAB",
            "text": "terrible  mac & cheese was disappointing yams was not good and too pricey"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNVJEVTBhMVF0ZWxKR0xWZElOVUU1TkdZNWFtYxAB",
            "text": "I love this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FM1IxUnJaVVJ3UzFVeGRGQlNVV1pSWTJ4d1YwRRAB",
            "text": "Delicious and plentiful!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taalRVcHdMVzluWjJnelRFZElUbmh1ZEdGU1FtYxAB",
            "text": "I was staying at a hotel near JFK and went for a walk to find something more interesting than hotel food: this place blew me away. The ribs were so flavourful and tender, the mac n cheese is probably the best I’ve ever had, with a huge portion and reasonable prices. Thank you guys for looking after a confused looking English person"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMlZYRjBWVWxKVG01clQxOWtWMTl5WjBwQ2EzYxAB",
            "text": "So Disappointed. Food was BLAND! I got turkey wings that were DRY, unseasoned Collard greens and bland yams. Along with BBQ unseasoned Ribs & Collards with the BLAND yams. Lesson learned, increased in price and no improvement in quality of the food. Wanted to patronize they were accommodating but food was not worth $30 a plate! Piled on the food but unfortunately it wasn’t worth it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSVMwRXRTRGxuVlhkR2JscDRPSFJWUlhGRVduYxAB",
            "text": "I have been going to this establishment for over 30 years. I bought 3 dinners which was almost $80 and the food tasted old and stale. I realize the price of everything has gone up, but $22 for a small piece of chicken and unseasoned rice and she didn't even separate the potatoe salad in a separate container like they use to. Totally unacceptable. I will never patronize this establishment ever again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVVIwVk1Sa3hKTWxkWmFrTmhla3RmUVhSbmVWRRAB",
            "text": "Thats fish was slamming! :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMldWSmthalUzVURkSVNIZ3paMWh2UzJKNlpVRRAB",
            "text": "Growing up we knew this restaurant as RCL . I would drive from Brooklyn to get these big plates to share with 4 of us . There food is affordable for what you get and taste like home cooking . At time the lines can get long but it moves . Long time Patron they don’t miss ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbFkwVTBXamhPY0cxaVZrdFFXREp1VEVSUlJFRRAB",
            "text": "Six meals were 169 dollars. Three large banana pudding was 54 dollars. Would not have minded if the food was good. The food was like it was suiting on the trays forever. Chopped barbecue was dry and no matter how much sauce was put on it. It was terrible. Pudding was great but at 18 dollars a serving. Ridicules. I have been going to this place for years. Never again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUFJXUnBNMGRaU1d3d1FsOUJWa3RqUkhRMlJVRRAB",
            "text": "I paid about 28.00 for jerk ribs sweet potatoes and mac and cheese. I had enough food for 2.5 meals . They are very heavy handed😋😋😋😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnelIwODJiak0yWTBOeGJURkdNSEZhTWtGeldIYxAB",
            "text": "I ate there weekly for 14 years before I moved to the South ...\n\nI have not found no southern restaurant that taste as good as there food, or can compare \" This is it, Cook Out, etc... Ole lady Gang came close and Pattis before it shut down..\n\nI wrote all this because my hubby just asked me what I want to eat and I said RCLs... 😋 😅"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaU5XMWxVMVpYUmtONmIxRkJMVGR3ZUZsaVpWRRAB",
            "text": "The food was NOT great, I am shocked how the mac and cheese tasted, the chicken dry well over cooked, collard green not seasoned 🤦🏼. I wouldn't order again. Maybe they change the cooks every day, I don't know, but I ordered my food on a Saturday. Just very disappointed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UFVtMU1lbFpUVWtSNVZFNU9aRWg1V2pNMVNIYxAB",
            "text": "I should of left when I seen it was completely empty.   I was not impressed with how the food\nlooked.  I remembered how good it was and pushed myself.  I ordered and was about to add dessert when the piece she handed me had mold on it.  OMG!  I paid for the food but refused to eat it.  Im sorry that was my absolute last visit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SQ1JGRm9aSG8yUWxkRVJVZHhWelYyTWpGc1ZFRRAB",
            "text": "My daughter introduced me to this place and theyre stuck with me when Im in town."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4aHV2ZHRnRRAB",
            "text": "All the food used to be amazing, but lately I only enjoy the fish and the chitterlings.  The potato salad looks like mashed potatoes.  The string beans had too much pepper and the meats looked like they have been sitting out all day. The yams looked dry and bruised."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNU3c2Yi00Ml92cHl3RRAB",
            "text": "Overpriced!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOTEN5WnJCemNyOG9RRRAB",
            "text": "Amazing"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMk56ZGJ3EAE",
            "text": "The Ribs were drrry!! Couldn't chew it because it was nice and hard. So, 3 stars for that. Also, they dont answer the phones. Who wants to travel all the way there, only to find out their out of something. UPDATE I'm adding to this review unfortunately and taking away a star from the review. Sad but true story, this place has been around for years. I've spent lots of money here. Management changed, and they closed down for a minute if my memory served me well. So, let's get this out the way. I paid to have 2 pork chop sandwiches delivered today. When the bag with the food came and I opened it. The bag was super wet inside. All the paper that the sandwiches were wrapped in wet. Can you imagine I bought this for someone. I had to find another bag and save ever dry pieces of parchment paper that was left. Now that's the packaging. The sandwiches themselves were a horror show. Multiple pieces of dry, hard, and burnt looking pork chops with a ton of fried flour all over it. Chocking Hazzard is what it was. Now that was today. I meant to update this review a week ago. When I bought some turkey wings. Over the years, the Mac and cheese I watch have decreased in quality. Don't know if it's inflation or what?but you use to get Mac and cheese, with the cheese all in-between in abundance. Now, it is a bunch of yellow colored pasta and a sheet of hard dry again cheddar cheese on top.  looking like it's straight out of a box. I think Costco's might be better 🤔 seriously. Dry seems to be the theme here. Never the less people still are coming in. Loyal customers like myself are holding on to the days of old.  But, I say we, the people of the community(even though I drive from afar), deserve better. I do have fam that live in the area, and they have also expressed that this once hot spot has fallen off hard. Today, I have to whole hardly agree. If there were more options around, I'm not sure this busy place would be doing so well. I'm not settling for the mediocrity. This is my hard earned money. Do better, please."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKelRtZGljMm9yUzNnRRAB",
            "text": "The food is trash!!! the macaroni was way overcooked the pulled pork made me spit it back out...... they give you large portions, but it ends up being so sloppy. I took 2 bites and to the trash it went. They don't even have fried chicken."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNMmEwclhtN2RIYld3EAE",
            "text": "I've going there for years. They are the only place that prepares JERK RIBS. They are unbelievably delicious  no makes them. Excellent!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLNk0wdEQ1MDUzTm13RRAB",
            "text": "Well one thing I can say the banana pudding is delicious 😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQckUyYlhSaXV2d3JBRRAB",
            "text": "The four pieces of tasteless fish and two pieces of bread for $17 was where I draw the line. It used to be a good establishment but the food is getting worse and the prices are going up."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLekgzX2V3Zy1LeDRnRRAB",
            "text": "I stepped in to purchase a meal, and there were signs posted throughout of a price increase, and that customers should read the menu.  All of the meals were $26.  Unfortunately, I walked out.  I need to cook more often."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPS0lnYUM4b2FILW5BRRAB",
            "text": "The service was extremely disappointing. Despite the place being completely empty, with no other customers around, I wasn’t greeted at all. There were three staff members present, and not one acknowledged me when I walked in. I had to ask…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdnAwS3pNMUxhOFFBEAE",
            "text": "I've been coming here for decades love the place love the food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKLVR6WWUtdWRHTjFRRRAB",
            "text": "It's order and go. Not a sit down and eat establishment.  The workers were very attentive and friendly. The food was fresh and tasty as usual. I had the jerk pork ribs, collards, and potato salad . A side order of chopped BBQ as well. Everything was delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPenRzcnJ4cjhfWlJREAE",
            "text": "1st visited yesterday, disappointed, food display uninviting, no seasong most dishes, only savior for my family was the yams. I won't be back, one and done, and was not worth the price."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcjdpVUlBEAE",
            "text": "I ordered on Uber eats and there was some kind of paper wrapper that was fried inside of my fish. Very unsanitary. Do not recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJalpDLWRREAE",
            "text": "Not a bad place, price increase sucks been there for years. They always give you a portion that you can save for days so no complaints,  They get another species of whiting I wish they wouldn't change I like the small thin variety."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMy1DR3JRRRAB",
            "text": "2nd time trying to get food here that I walked out.  If that doesn’t tell you how disgusting the customer service is I don’t know what to tell you. The attitude of these women behind the counter should be studied seriously. Just beyond NASTY and miserable and they talk to you like you are a problem and actually don’t want you there. The manager or owner who was at the front tried to talk to me about my issue and offered me the meal and I declined. I have spent over 1500 in catered food with them for past events back in 2020-2022 and the service has declined and the food. They will never see my money nor any of my family or friends money ever again. I am a hard working single parent with my own businesses and tried supporting a black owned business- and who EVER they have hired behind that counter (and in that kitchen) is going to destroy it. May god bless the people behind the establishment trying to do right by this business but THIS place is HORRIBLE save it immediately before it sinks. NOT the place I remember or anyone else."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbi1yQmp3RRAB",
            "text": "Best place to get Soul-Food. The wait may be long but the service is awesome. I been going to Rockaway fish house for years. My grandmother worked there with her good friend and owner Mr. Charlie, when Carmichael dinner closed down. If you want some good down SOUL-FOOD YOU have to give Rockaway fish house try"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcWZLb0F3EAE",
            "text": "The food is horrible. It taste like they’re cooking for 90 year old patients. It’s very bland. The macaroni and cheese is dry and the cheese they use taste like the cheese from the cheese and bun on Easter. Very great customer service from the three young men that was there stay away from the candy yams not sweet at all I’m not going back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNGJhOEJBEAE",
            "text": "I ordered Uber. The food was raw nasty. It taste like morning breath, and I’m gonna redo it the way I like it. The ribs was dry and raw like they boil the ribs and then put in the oven to cook. If I wasn’t at work, I would take it back horrible"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aHBmTjJnRRAB",
            "text": "Food touched my soul! You walk in and want everything lined up. Amazing food with a generous portion. They give quite alot of food which I LOVE"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMi1DTzF3RRAB",
            "text": "Great spot for some Soul food. The serving sizes are huge. Dinner plates come with 2 sides & a main dish.  They have a variety of meats to choose from, bbq chicken; jerk chicken, ribs, etc. I ordered Whiteys plate which comes with 4 pcs of…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxcllPM3JnRRAB",
            "text": "Objectively, it was mediocre at best. From a friend's description expected to be more impressed, but it was more ordinary if anything. Traveled a distance & found my local food establishments much closer to home having better tasting food comparatively speaking, i.e. Collard greens,  Mac & cheese, Whiting fish, Spare ribs, esp. the Jerk chicken (we had quite a sampling)... After leftovers will see if my initial impression changes. Perhaps they had an off night, or it was my selections--maybe it was my taste buds...so in fairness I MAY give them another chance by returning to sample other menu items before final decision. Having said that, the establishment was clean, friendly staff, organized & managed the line efficiently. Standby..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXaHBTXzdRRRAB",
            "text": "The food was plentiful and delicious! Mac and cheese melted in my mouth and the whitings were seasoned and fried to perfection! My rice and peas didn't rate high. They were edible but were a little undercooked - slightly hard to the bite in…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURheXZ2aGxnRRAB",
            "text": "If you want good soul food (especially smothered foods), this is the place to go. Finally was able to drive here myself today. Food is always hot, they have a huge selection of dishes and sides to try, and the portions are amazing. Parking…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3akpyRjNRRRAB",
            "text": "The food there is  absolutely fresh and delicious with free taste samples.  The young lady server  was so sweet.\nI have been there twice and was not disappointed.\nThe food is not salty which is a plus.\nThis is great short walking distance from my Church.  I will be back God willing.\nI pray that God Almighty continue to bless the management, cooks, servers and the  Jamaica New York community greatly.  🙏 ❤️"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzanFHR0VREAE",
            "text": "I wanted some good food near the hotel I was staying at. This place was recommended.  I went here and the food was GREAT!!!!! The portions are HUGH so bring your appetite. I'll definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMM1puZDF3RRAB",
            "text": "Grew up in Queens. Live in PA now. Anytime we have the opportunity, we go. Was a little worried with some of the recent reviews, but it’s exactly how we remembered. Delicious! And lots of food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aU1TRGtnRRAB",
            "text": "$28 for turkey, yams, and mac? Not worth it.\nThis place is severely overpriced. Vibes offers the same meal for $15, and the quality is just as good—if not better. The food here isn’t bad, but it definitely doesn’t justify the price. This used to be a neighborhood staple, but something’s changed over the years. Honestly, we should just stay away in the hopes they sell it to someone else—preferably the owner of Vibes. At least then we’d have another quality soul food spot in the area.\n\nCheck the other review🗑️🗑️🗑️\n\nI’m so dissapointed they used to be such a great restaurant. What a way to kill a brand.\n\nI don’t even like leaving review but dang it was horrible."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dlBTQzRBRRAB",
            "text": "The food was absolutely disgusting!! The greens seemed to be out of a can and super bitter, the macaroni noodles were SUPER soft, and the chicken had no flavor!!! Horrible"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnaGFMYnBBRRAB",
            "text": "This is where I go for comfort food or a special gift for the holidays.  I always get peach cobbler, but not this time.  Everything edible on my table was from Rockaway Fish House, but the turkey wings.  Everything was delicious,  as usual."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwMk9hekx3EAE",
            "text": "Its was a large selection, large portions and the food was not bad just definitely ehm seasoned and cooked to their way and if you into that than it's the place for you, for me like the mac n cheese wasn't cheesy just overbaked noodles with…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbUlDRGx3RRAB",
            "text": "This place has really declined in service and attitudes. I went in the other day and noticed they have increased the prices on food and decreased in humanity. The 2 women that were there were too busy joking around with each other and showing us customers so much attitude, especially the shorter light skin woman, she was HORRIBLE! She acted like we were interrupting her play time. Before this incident we were in there about 3 weeks ago and ordered the same things we ordered a few days ago. We had the taller woman and she gave us decent amounts of food. This time with the shorter woman, she gave 4 ribs and had an attitude when asked not to give us the 2 burnt ribs that she was about to give us. I know for a fact we should've received more ribs because usually when we go we receive about 6/7 ribs. We didn't want to ask her to give more even though the prices went up and she was giving us less food, we let that go. But then I ordered the turkey wings dinner and she got even more disrespectful with the amount. She even got an attitude because I asked for extra bbq sauce on my turkey wings. She wouldn't even give a full spoon full of the sauce, she kept trying to be funny by giving little droplets, so I kept telling her to please give me more sauce. This is MY money that I am spending in this place, stop playing games with people! My bill came to almost $70, at least put some respect on the service! I miss the times when Ms. Mary was there, that's how long I've been going there, she was such a delight. My Aunt and Uncle used to have this place cater our family gatherings up until they passed away so I know how this establishment USED to be. Bad enough they took away their oxtails but to add $10 more to each meal and take away portions, friendliness and the fact that WE as customers are spending our hard earned money in your establishment only to face bad attitudes, does not sit right with me. I would've preferred to not give any stars but I had to leave this review, enough is enough, just about everyone is suffering and WE the customers keep YOU in business, please remember that...."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNnU3MFpREAE",
            "text": "Love this place been going here for years have never been let down, can't wait till next week.  keep up the great work."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d09HRmJnEAE",
            "text": "Who are these people giving this place 4 stars because the food is HORRIBLE. It never looks fresh, it looks like it comes straight out the can. The only thing that I liked was the fried fish and that’s it."
        }
    ],
    "reviews_count": 58
}