{
    "name": "Sayra's Wine Bar",
    "place_id": "ChIJ-VKS3UZowokRPlge9pedirs",
    "grid": "QN14",
    "address": "91-11 Rockaway Beach Blvd, Far Rockaway, NY 11693, USA",
    "rating": 4.4,
    "user_ratings_total": 237,
    "phone_number": "(347) 619-8009",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbE5FaFhjSGcxU3pacE1EZFdPRlpmVmxZdFdrRRAB",
            "text": "Dhwani was the sweetest bartender and definitely deserves a raise! It was my first time at Sayras and she treated us to fresh home made cookies that were wonderfully made. I can’t wait to try the food items but the wine was great as well as the service and experience! 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdlYyVTVZelJ1YTI1aFJFSndNM05TT1ZCVGVrRRAB",
            "text": "Amazing. I didn't think to write about it on google, but my friend and I were totally blown away by the place and people 12 years ago in its beginnings. My friend loves wine and loved the ones in Sayra's Wine Bar. But that's not all: it was at the wake of her 40th Birthday. She went to washroom, and when she came out, everybody, starting from staff and ending with all clients, sang \"Happy Birthday\" to her.\nDuring the couple of hours we spent there, we heard about how it was built from hurricane wood, and were watching pictures of owners and their family and friends surfing nearby in costumes for Halloween."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VdFpuQlZUMmxzYTNWSWQxZ3dZamwwY1dFMWVWRRAB",
            "text": "Found this cute spot on Google search for wine places in my vicinity. This place has cozy and chill vibes! Great ambiance!\nThe bar/restaurant located in a corky and eclectic neighborhood walking distance to Rockaway Beach.\nThe place has indoor and outdoor dining.\nThe music was at a good volume where you can sit and have great conversation.\nThe waitress was professional,  friendly and attentive.\nLove the setup of this place it has an authentic charm about it.\nThey serve tapas to enjoy with your libations.\nThere is an array of wine to choose from.\nWe decided to do the wine sampler\nFood:\nHumus with pita, meatballs, soft pretzels,\nTurkey sliders and grilled cheese sandwich\nDessert: lemon pound cake\nGreat place for a date, friends and family.\nParking is scarce because it's a busy location with restaurants and the Rockaway Beach is walking distance."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aS09FdE1NQzAzTFVobFJYcFJlaTFrYUU5NVQzYxAB",
            "text": "Disgusting bartender\n.my mother was attacked drugged m brutally beaten I would stay away"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obGJWVkxWWFZpTVUxTGRGSkJaVU55ZUdWc2QzYxAB",
            "text": "What a hidden gem in one of my favorite nyc neighborhoods. The patio reminds me of home 🇩🇴, wonderful service and an amazing mango sangria."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OeldXNXdRMjFoTlZkRFJrSkZlV2hEWXpaR2NYYxAB",
            "text": "Great pours and nice backyard"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MGRrUmZTVnA1YTBoZlFrcHBUazVmTUZSU1RVRRAB",
            "text": "They charged us automatic gratuity for 2 people. Didn’t realize that was a thing for a small group. Cheese board was mediocre at best not worth the money and service was no where near the level of gratuity they took."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4d2RWaE1hMVZxTW5CWVQwNWZVV1ozUkc4NGEzYxAB",
            "text": "It's the bomb dot com\nIt's black woman owned and it's peaceful in there\nCute intimate and low-key\nGo check it out yourself"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWFFVaE9NMDVTWm1OMkxXUlpZVFozUWtWSVZWRRAB",
            "text": "My favorite Rockaway hideaway"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dFNETTVjMk42TkhGWGFrSmxiRmxSU1ZKcGNXYxAB",
            "text": "Love this spot. Weekday happy hour means $10 glasses of wine before 8pm and the bartender was so friendly. It seems like a real neighborhood hangout, and their backyard is large and beautiful! I’ll definitely be back after a beach day."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcGNMMmJnEAE",
            "text": "Stopped in tonight for a grilled cheese and glass of wine in the backyard. Great vibes and service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2ODd1WjBnRRAB",
            "text": "Ok"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdU5QQ3R3RRAB",
            "text": "Excelente lugar, ame el patio que tiene para poder disfrutar con amigos o tu pareja, escuchar música en vivo, la cómoda es deliciosa, los vinos tienen variedad. También la atención al público es muy muy buena. Recomiendo este lugar totalmente.  Tiene también un área que es cerrada para la temporada de frío."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2Nk1lSTR3RRAB",
            "text": "First of all I feel like I didn't know my community. Sayra's has been a staple in the community for over 10 years. This wonderful tapas bar is heavenly! There's shaded outdoor seating too.\nWe ordered quite an array of food off the menu and everything was delicious!\n\nDon't take my word for it, try it yourself.\nTell them Lala sent you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybU9EUEdnEAE",
            "text": "We live in the neighborhood and love bringing people here. The garden is a cool oasis on a beach day. The food is delicious - tapas style, perfect for ordering a bunch to share. The staff is friendly and never rush you. A real hidden gem in Rockaway!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OXMtOFZnEAE",
            "text": "Love this spot. Small, neighborhood place. Simultaneously quiet and rowdy. Generally great music, sometimes a live jazz band. Inclusive, diverse clientele and staff. Tasty bites, good drinks. What's not to like?!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNWUycmdRRRAB",
            "text": "Very disappointing experience starting whit the plastic glasses for tap water smelling like beer , soda , something else.\n“Wine bar” whit a very limited choice of wine served in a cheap small glass\nVery small portion for an overpriced “ cheese platter charcuterie ‘ 35$ for 4 olive 4 small piece of cheese 4 small slice of salami a1 slice of prosciutto small bad of salad everything fitted on a 8x10 wooden board , and best of all 3 small piece of bread for 4 people.\nWe are not recommending this place sorry"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN2VLd3lRRRAB",
            "text": "Great food and wine!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNWZDUjVRRRAB",
            "text": "This place is a VIBE!\n\nI came here for a friend’s bday and we had the best time ever! The wine was flowing, delicious meals were served, and great conversations were had.\n\nI can’t wait to come back when it gets warmer so I can dine in their beautiful backyard space."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPczZyMjlRRRAB",
            "text": "Great place but they need to do something to control the mosquito population outside! They're worse than the raccoons lurking behind the fence. I got bit so much in one night there, that I had to leave and it looked like I had chicken pox when I got home that evening."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNTZlX2JnEAE",
            "text": "I can’t believe I’ve never reviewed this place. We’ve been coming here for years and recommend it to friends. Today (8/11/23), however, I came in for the bottle of wine and cheese deal and then cheese plate was shrunken to a tiny platter…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdFo3UVhnEAE",
            "text": "I had a great time sitting outside with wonderful live music. Felt like a nice getaway, almost like I escaped the city and was on a vacation. A more diverse menu would make the place perfect. Or perhaps if they allowed to link with another restaurant nearby to bring in other food also."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwX0xpYWRREAE",
            "text": "Loved the atmosphere until they presented the check at the end. They added an “accidental” charge, not only that, but when we addressed the server about it, they seemed non-chalant as opposed to apologetic. Food is very tasty, pulled pork sliders are extremely delicious and the wine selection is interesting. They added an auto gratuity to only 2 people which comes across as they are hoping for extra tips if you’re not paying close attention. Also there was a “merchant charge” which I’ve never heard of."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdEpQSWhnRRAB",
            "text": "the owners sisters child called my friend asian slurs. the owner was informed of this and im unsure if anything ended up coming of it. this is a pretty mild experience at sayras honestly. not worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMWZPcU93EAE",
            "text": "Really enjoyed the ambience and food together with very friendly service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKN3R1ZGp3RRAB",
            "text": "Such a wonderful environment and Apple our hosts was PHENOMENAL, she was very attentive and played some bombass music. This place was a whole vibe. Will definitely be going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbE5ySThBRRAB",
            "text": "Great band the night we were there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaU1xU2hnRRAB",
            "text": "Great service and friendly atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZ19LVkh3EAE",
            "text": "This  place is great  love it💞…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMmZxT3BRRRAB",
            "text": "Great place"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaGEtek1REAE",
            "text": "Someone in a previous review stated the service is slow here even though it’s not busy and they were absolutely correct.\n\nIm writing this review on my second visit, I’m literally sitting here as I write this review and can assure you that both my first and second time here have been muddled by slow service.\n\nBut I’ll do you one better. Today, the person who greeted me and took my order last time was the same person today. And this person came out about 10 or 15 min after I sat in the back to say they forgot about me.\n\nI don’t know about you, but I’m not coming to a wine bar to be forgotten about on a Friday night, or any other night for that matter. Now my first visit I was very generous with the tip, tonight who knows… I might just forget to tip as I think about the sour house wine I was served tonight as a slap in the face to the long wait and being forgotten about.\n\nAhhhhhh… but a las as the person just came back outside and our eyes locked as they took my follow up order, I just bumped this up to 4 stars out of trying to be nice. But don’t test me… I’ll drop you guys down to a 3 star real quick.\n\nAnd here come your three stars.. remember, I’m writing this as I sit at the restaurant…\n\nHappy hour listed on the menu but when I get my check the price reflects full price. If I had been here to get saucy I guarantee you I wouldn’t have notice cause I trust a business will honor their advertised policy without me having to call them out on it.\n\nI was really giving this establishment the benefit of the doubt… lucky I don’t call the Department of Consumer Affairs in over this, so I’m hoping management reads this review and others and steps it up.\n\nThis is a great place and potential cash cow given the development of the area, but with service like this you’re just missing out on free word of mouth advertising and 5 star reviews.\n\nP.s.\nI was still generous today, hopefully that buys some training."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPcnZ6Y2NREAE",
            "text": "This place was unique in that the ambience was similar to a small Manhattan wine bar or someplace in Williamsburg (they have a beautiful back patio.) That being said, the food left a lot to be desired. They have an extremely limited menu…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNTRxbjlnRRAB",
            "text": "Live music and friendly staff."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaEpYUWpnRRAB",
            "text": "Great wine and music!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyenFqV0l3EAE",
            "text": "I love this spot! Low key, chill, romantic, and relaxing music. We come here often after a friend recommended it, and it’s truly amazing. The wine is good and the tapas of bread 🥖 and sides is delicious. I love them for being consistent and having excellent service.\n\nThey also have a selection of canned beer at great prices and a happy hour if that’s your thing.\n\nIt’s an intimate space and that’s what makes it special every time.\n\nHighlights are the baguette with balsamic and olive oil, and the sangria was excellent!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyN08zb3ZRRRAB",
            "text": "Its happiness 🤣…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHd0l2a2JnEAE",
            "text": "I love this place in the summer so much, it’s the perfect place to grab a bite with a friend drink some wine and talk. Bring a group of friends even. The food is delicious, The drink selections are great. The inside is also amazing so…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bnRmemxRRRAB",
            "text": "This place was very cozy and different. The hostess was very nice and the service was very good. Honestly the selection of food wasn't that large, but everything we ordered was exceptionally good! Unfortunately they were out of the Turkey…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdHRDUzZBRRAB",
            "text": "This cozy little establishment has a cool rustic decor with a greatbwine and beer selection.  Love the Allagash White on tap and also love their sangria....🍷\n\nThe light fare menu is tasty.  I usually get the turkey burgers, meatballs, or the fantastic cheese plate.  The back yard garden area is very tranquil and relaxing.  It is a quiet little didden gem in the Rockaway community.  Nice for a relaxing evening and the owner is fantastic and proud member of the community....❤"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBN0szVDR3RRAB",
            "text": "We were walking by and were drawn in by the friendly and welcoming atmosphere of this beautifully decorated wine bar. Great happy hour specials."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLM3JQcTdBRRAB",
            "text": "This place is gold! Service, quality of drinks and food.... Spectacular! I had the turkey burger. I'm going to apologize here right now to every person that will serve me a turkey burger.... You won't impress me... It's over. This what a 11…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxekxPME13EAE",
            "text": "Exceptional place. The backyard is a little oasis. This is a hidden gem in Rockaway that transcends the pretentious vibe of a lot of local places. It's peaceful and welcoming and I've enjoyed the food as well as the drinks. My only…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLanBfWHR3RRAB",
            "text": "I enjoyed this little place so much—nice rustic design. My b/f and I had a great date night. Food was delicious and the hostess, (Kadisha), was very pleasant to speak to. My only suggestion is that management/owner should probably consider…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbGZXOThnRRAB",
            "text": "love this place. nice people, great backyard seating, awesome vibe. limited food menu but we had the pretzel, brussel sprouts, and pulled pork sandwiches and it was all delicious. really good sangria and obviously wine!. they also have beer options which is great!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhaU1PTnhRRRAB",
            "text": "I really wanted to give a -5 because of the trauma I endured but I want to emphasize I had great service from one of the ladies working here. I went to this establishment on Wednesday and I was pleased with the outdoor aesthetic. But everything went left when I heard and saw something rustling  in the bushes. Within 30 minutes I saw TWO RATS one small and a huge MTA STATION RAT. I gave them some grace and said you know they can’t control pests outdoors so me and my girls went to the indoor seating. We ordered the cheese plate,  pulled pork sandwiches and drinks. All the food was divine then an hour or so after I was shocked to see a centipede crawling on the table. I jumped and screamed in fear and the other server asked what it was. I said it was a centipede to which she replied, “Really?” What kind of response is that? Clearly she lacks good customer service. Our set server was lovely and apologized for the discomfort. Her service was EXCELLENT but it didn’t make up for the uninvited guests."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4bHM3dGdnRRAB",
            "text": "I usually don’t leave reviews unless I feel very strongly about the service or quality of the food . The service is extremely slow and the food options are very overpriced for the portion size. I payed $11 for 2 small meatballs.... again 2…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJNHYtLVRBEAE",
            "text": "Very beautiful place with an outdoor extension I  back, that's perfect during the summer. Downside- there's no real kitchen so ordering somewhat overpriced food that's simply being put into a microwave and panini maker doesn't make me…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMXFhc1VREAE",
            "text": "Amazing little place. Great atmosphere, great beer, great food, friendly staff. Very relaxing, laid back & quite charming. A pleasant surprise, one of my favorite finds near the Big Apple. No disappointments here. Very impressed. Great job guys, keep up the amazing work !!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZbzdURHB3RRAB",
            "text": "Very nice intimate atmosphere. Looking forward to Summer to dine in the backyard. The brie and fig grill cheese is yummy. Some small seafood dishes would be a perfect addition to the menu."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhak9xTzZ3RRAB",
            "text": "I've been frequenting Sayra's ever since they opened some 8 or 9 years ago, and their service, food, and drink still do not disappoint. Love this spot. Nothing better than a cold beer on a hot day in the beer garden."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcW9qS29RRRAB",
            "text": "Randomly decided to go to Rockaway Beach with my girl. We happened upon this place. It is great. The food, the ambiance, the outdoor seating, the staff, the crowd, etc. She loved it, and so did I. ...Sit out back. So chill."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNlBtYVFBEAE",
            "text": "The wine was amazing. Unfortunately, it took me about 20 minutes to get it, each time we ordered. The food took about an hour for a few (very simple) sandwiches. All in all, good food/drink. Terribly understaffed to the point where I'd rather get food from a street vendor"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxeHBQRjF3RRAB",
            "text": "great atmosphere to relax in a sunny day. recommend"
        }
    ],
    "reviews_count": 53
}