{
    "name": "Pico",
    "place_id": "ChIJ_5ljaIdCwokRn7JPvoY98Kk",
    "grid": "QN14",
    "address": "4-19 Beach 129th St, Belle Harbor, NY 11694, USA",
    "rating": 4.5,
    "user_ratings_total": 700,
    "phone_number": "(718) 945-3474",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRdGEwNWhTRGhKWDIxaU5tSnpaa3M1Y1RSS1JVRRAB",
            "text": "Pico has been a local staple for years. Excellent drinks, excellent food, great service. One of my favorite restaurants in Rockaway."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURneW8tWTRnRRAB",
            "text": "Good Mexican restaurant,  but didn't feel the food and service were as good as in the past. Can't put my finger on why,  just my thoughts...."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMGFXTTNTVzVZYld0a1RFRkpRMDA1WTNWTmRGRRAB",
            "text": "The servers and service is very very attentive and all the workers are very kind and make you feel welcome, but the food was very mediocre and frankly bland. The guac was a bit bitter and the chips weren’t complementary. I suspect the culprit is the menu/ingredients and not the employees."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTlEzUlhUbHBaTWs1SFdXTkdiR0ZqUkdGNk9VRRAB",
            "text": "This place never disappoints, food is amazing ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pob1ZsOXJjekp6YTFRNGJWQjFWMGhIZG5GcGFIYxAB",
            "text": "I love this place. There nachos are the best I've ever had. With great food and even better prices I come here as much as I can and never leave dissatisfied."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNWFsaHdkazUyYmxaQldFMDNUVmxGTld4a1puYxAB",
            "text": "Very delicious enjoyed the pastrami taco and raspberry lemon drop 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCa1ZqZHNUVFZFV0c5NFpXcHlOWGhuY0V4cU0zYxAB",
            "text": "Number 1 place to go for delicious food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcWFEZFZMVWRLWkZSMlRGWlhiRkJ6Um5ZeVgwRRAB",
            "text": "Nice relaxed spot. Good fusion of Mexican and BBQ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWE1DMU5PSEpIYjJsVVdURlFRbVJTYnpCRE4wRRAB",
            "text": "The service is always great. Everyone is welcoming and attentive. Reasonable and great selection.\n\nThe chicken tamale special last night was so delicious. The best I have ever had. The yucca bites were perfect. The shrimp tacos were excellent. We had lemon martinis and those were pretty perfect, too!\nThe Napa salad is awesome.\nJust a great experience all around.\n⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aE0zSXpTMU15Y0RKVloxcG9kMEp0ZDNoVk5HYxAB",
            "text": "Great service, great margaritas, and great tacos!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPTFEtT1N1bktfcEN3EAE",
            "text": "Great place for Cinco de Mayo"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPeE83MlNnEAE",
            "text": "Food was fresh and hot. Nice presentations on all food, tasty.\nGood job!\nChicken/Chorizo bowl very tasty!\nNachos/brisket very good!\nEnjoyable!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcnJLYmR3EAE",
            "text": "We found this great place on uber and at first portions were generous and food delicious. In the past couple of weeks the food comes with barely anything in the container and I am paying 28 dollars for a bowl. It’s become worse and worse and the food keeps declining"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdFlUc0FREAE",
            "text": "Terrific lunch special tacos, yummy yuca sticks app and Fro MO Margarita really hits the spot.  Clear and kind service....never feel rushed like some other places"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOHNDekd3EAE",
            "text": "Fish tacos were delicious"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcU8ta0tREAE",
            "text": "Nice updated interior. Same great food and friendly staff. Can't go wrong enjoying Pico!!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxd1B6eGh3RRAB",
            "text": "We love dining at Pico. The food is awesome and the atmosphere is fantastic. I also , can't say enough about the staff. Waiters, Waitresses,  Hostess, Bartenders! Everyone is friendly and just soo easy going..You know they really want to make you feel at home! Run ! Don't walk to Pico! You won't regret it 😊🙂❤"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNk9Ud09BEAE",
            "text": "La atención fue rápida"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeHYtdTNBRRAB",
            "text": "I was craving Mexican food the other day and Pico is very satisfying. My aunt and I went there tonight and we ordered a variety of things to share. The guacamole and elote street corn are wonderful appetizers. The tacos are also great for an entree option. My aunt ordered the enchiladas for her dinner tonight and she was really pleased. The flourless chocolate cake was a great treat and a great way to finish off our meal. We have been eating at this restaurant many times and we continue coming back because the atmosphere and food are always great."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzai1pR29nRRAB",
            "text": "Stopped by this spot  after a 2hr massage.  Chill vibes on a Saturday night. The sangria was amazing!. The impossible burger was scrumptious. The DJ played some great songs. Music was at a level where you can have an actual conversation. Dave the server was friendly and attentive. Small and cozy environment. I would definitely return."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQb3RLWk9REAE",
            "text": "Had the nachos with chicken very fair then tacos  where cold  the service noone cared lastly the corona beer wasn't even  cold I told the girl never even  offered to get another beer or a new order of Tacos that would be at least warm"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdTdpZ0F3EAE",
            "text": "yummy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuXzlLaFdREAE",
            "text": "When I die, bury me here. Everything here is TO DIE FOR. I will do nasty things for those chicken wings."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubmVxV0RnEAE",
            "text": "This place is the best the food tastes excellent and I would want to eat here every day"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuc3JmV3h3RRAB",
            "text": "Great DJ and total chill Vibe"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubEsyVHNBRRAB",
            "text": "All was very good, although on the night I went, the music was just a bit too loud."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhZ0tYazJnRRAB",
            "text": "Great food. Though they can't correctly package a takeout/delivery for the life of them. 50/50 chance they will forget a crucial piece of your dinner. Literally 50/50 chance. We can't possibly be the only ones who keep getting screwed this bad while giving generous gratuities left and right to the staff. I sincerely feel continuously jipped out of a service that I'm am certainly paying for. I know darn well restaurants always prefer to be spoken to about a problem before leaving a terrible review, AND WE HAVE COUNTLESS TIMES.  This issue has been consistently this bad for at least a whole year straight. It didnt used to be like this. we've been ordering from pico for years and my previous review for them was 5 stars. there's literally 0 accountability here for continually inconveniencing good customers. 3 stars because they do always attempt to make reparation if you communicate with the manager."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIejVqNHlRRRAB",
            "text": "Nice place with excellent food. If i were to find any fault with this place it would be that there was not a good beer selection."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cmRpek13EAE",
            "text": "Great dinner down in the Rockaways! Local and a very nice walk. I think Pico really takes Mexican food in a really cool direction, really adding an American barbeque smokiness and spice flair that you don't often seen in most tex mex. The food did not jive with some of the palates at the table but we really all liked the drinks and the atmosphere. Very kind and helpful service. Give it a try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidDlMNUlnEAE",
            "text": "Great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidHVLRkxREAE",
            "text": "Love pico! Just one minor tweak they should consider in the rice and beans is cumin instead of curry more authentic to Mexican cuisine, all love ❤️💚"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobU5TWGxBRRAB",
            "text": "First time to the area and this restaurant; drove 45min and tbh it was worth it. That’s aside from the wait time because we had not done a reservation. The spot was packed but vibrant with music and people having a good time. The service was delightful and very good. The food was delicious, we like to order different things to share to get a good taste of things. I’d recommend this place to anyone!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVdzg3YkhBEAE",
            "text": "Five star experience. The food was delicious, I mean seriously yummy. I scarfed down the rice, black beans and slaw before remembering to take a photo. The service was quick and the staff was very friendly. My son is already asking when we can return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUX19heVBnEAE",
            "text": "Came for brunch and loved everything we got. The LA burrito was delicious and we also tried the chorizo egg and cheese. we loved the sides that the mains came with. Service was great and we enjoyed the street view."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrdk8zd3RBRRAB",
            "text": "Exquisite Sunday brunch dining experience.  The food is fresh and seasoned just right.  I didn't have to add any condiments to my steak which is an A++ in my book. Wait staff was very accommodating and understanding to our needs."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhNmRhMTlnRRAB",
            "text": "Love this place! It's Mexican with a little bbq flare.  All of the dishes are so tasty.  Start off with the jumbo lumb crab guacamole and chips, its incredible.  If seafood is not your thing then the simple elote grilled mexican street corn, its off the hook.  Any of the taco entrees are great, i love the pastrami or smoked brisket. It tacos are not what you are looking for the steak bowl is amazing.  Oh and make sure to save room for dessert because the tres leches is second to none."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGOV9EMnhnRRAB",
            "text": "I tried the nachos and I cleaned the plate up. The nacho was great and so was the price. The Resturant was a nice hangout spot to chill with friends. I definitely would recommend this restaurant to friends and family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkb3VhVHh3RRAB",
            "text": "My fav Mexican restaurant close to home. Everything is made to perfection. Tacos, quesadillas, guacamole and Margarita’s. Mmmmm!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNEpfOHhnRRAB",
            "text": "Delicious food and drinks at fair prices. I’d recommend the elote and the smoked brisket! Also love the massive selection of hot sauces they have next to the (extremely roomy) booths."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENGF1bmhRRRAB",
            "text": "The atmosphere is cozy, we order a burrito and tacos come with beans and rice and everything was really good; the service is not the best but we have a good time"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZcjhyanl3RRAB",
            "text": "Had a great brunch with the family and everyone enjoyed their meal. nice ambiance and staff was very friendly. Definitely will be back!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDMWJXX29nRRAB",
            "text": "Wow, the calamari with the avacado aioli was amazing. Dinner orders of Chicken Enchiladas and chicken Quesadilla(from the starter menu) also very good. We used a gift card we'd received. Hint hint 😉 great gift!…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMGFIenBBRRAB",
            "text": "Great food, strong drinks, and we had the sweetest waitress in the world (Savannah hope I spelt it right) 100% recommend :)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNHZyQ1dREAE",
            "text": "Great sangria. Great chips and guac. Gave nice amounts of food. We were all RAVING about our main courses which were outstanding. I got the salad with the bbq pulled chicken- the dressing was phenomenal. My friends all absolutely loved their burritos too! So delicious and will definitely be back! Thank you Pico!\n\nIf you enjoyed this review, check us out on Instagram @andiamoadventure"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLOGFiSVZREAE",
            "text": "Came here for dinner as we wanted to eat local and had been once before during the summer. Ordered the burger with habanero cheese, bacon, and fries. Wifey got the burrito with pulled pork. Both were great. Burger was tasty and juicy. And…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZzZpeFdREAE",
            "text": "Had the lunch special. 2 tacos w black beens and rice. Bloody Mary was awesome."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2djllV0JBEAE",
            "text": "Food was yummy service was great it wasn’t expensive at all :) enjoy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyeE83bEdnEAE",
            "text": "Went to dinner tonight with my daughter and I have to say it was great all around. Food was excellent! I can’t say enough good things about our waitress Savonnah ! She was  absolutely Amazing!! Thank You Savonnah!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeC0zTzNRRRAB",
            "text": "Amazing food! Tacos are authentic, fresh & the meat in the chicken enchiladas is truly incredible."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURneUk2Q1dBEAE",
            "text": "Dont come here looking for authentic Mexican food. 70% of everything me and my friends ordered was over seasoned. It was my 1st time there. Maybe it was a bad night, not sure but the waitress said that's how it comes when I tried to return…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaGF1Yk1nEAE",
            "text": "What a great restaurant. I had the steak burrito bowl. It was very good. They had a great beer selection and drinks. The service was great. I would definitely recommend this restaurant."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZMTdXNDR3RRAB",
            "text": "First time visiting first time visiting there and did not expect the food to be that good but I was wrong. It was excellent. I used to say what is Rockaway know about Mexican food. I guess I know what they're doing."
        },
        {
            "date": "수정일: 9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneExiUjJnRRAB",
            "text": "Loved the food.  We ended up ordering a bunch of food including a pair of duck tacos, a grilled rib eye burrito and the pico burger.  They were all great.  They had the best guacomole I've ever had. I enjoyed everything, but the burrito would keep me coming back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxOGVDcmpRRRAB",
            "text": "10/ 10🌮\nA real taco style that makes sense. MEANING they don't skip out on the quac or Pico. Well unfortunately for Pico the staff was overwhelming nice and fortunate…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdWREbWJnEAE",
            "text": "Great place to eat and drink. Service is very friendly. Highly recommended place in the Rockaway’s"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6bXFHbV9nRRAB",
            "text": "I visited Pico recently for dinner and had a bad experience, mostly because the hostess and the waiter were indifferent to my presence and that of my companion in the restaurant.  They actually came across as quite rude.  I arrived at Pico at 4:30 p.m. on a Friday with a friend for dinner and drinks.  Though this tiny restaurant was empty except for 1 couple at the bar, I stood in the doorway and the hostess (standing just a foot away) ignored me as she arranged menus at a small table.  I literally said hello to her 2 times, but it was as if she was deaf.  Eventually, after several awkward moments, I asked if we could sit in one of the empty booths, and she responded \"I don't know.\"  Another hostess arrived on scene, and said we could have a booth for 2 hours because \"it was Friday night\" and \"they had reservations.\"  Again, the place was empty.  This was only the beginning.  Then we had the waiter, whose name was Sean.  While he was effective at taking the order, and our food arrived promptly, he not once checked on the table to ask how things were going.  I had to waive him down twice to get a second drink, which arrived after I was mostly done with my meal.  When it came time for the bill, he basically threw it on the table without a word and turned to a different table to take their order.  Not a word spoken.  It was extremely rude.  The restaurant was not even close to being full at this time, about 5-6 tables were occupied.  I still tipped 20%, even though given this service, it should have been 10%.  On the way out, the same hostess that ignored me and my friend on our entrance ignored us on the way out.  She stood at the door and stared at us as we left.  No \"thanks for coming\" or \"have a good evening.\"  Mind you, this is a tiny restaurant, not some large establishment where the hostess is a behind a counter.  My friend even said \"thank you\" to her, but not a word back.  Extremely rude.  My recommendation to the establishment is to train your employees on basic etiquette and creating a welcoming environment for patrons, otherwise those patrons will start thinking about going elsewhere.  My recommendation for anyone considering Pico is to think about whether you want to give your money to a place that shows zero appreciation for you, lacks basic skills in hospitality, and actually seems to think that they are doing you are favor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxa05fLWNnEAE",
            "text": "What an absolutely terrific restaurant!  Wish I could rate them even higher than 5 stars.  I took my family there last Sunday and everything was perfect.  Food was excellent, staff was welcoming and efficient.  Prices were fair considering the expense of operating a restaurant these days.  I also appreciate their support of the victims of the dreadful terrorist attack against Israel which occurred on October 7th.  I will be back many times in the future."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRd09PbTdnRRAB",
            "text": "If you have a taste for Mexican food it is a great place to go however parking is very difficult in the area and you also might need to make reservations because  it can get very crowded, but the service is good and the food is very good and the drinks on the money."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MmVhcE5nEAE",
            "text": "Not sure how to write this review... Pico is a \"Mexican\" restaurant but the food does not really taste Mexican. Know what I mean? Don`t get me wrong, its good but not exactly what I`m used to Mexican food tasting like.\n\nThe chips and salsa could use some improvement though. There are some interesting entrees as well which are flavorful and are filling.\n\nThe atmosphere is usually lively and welcoming. The back sitting area is definitely better for dates (quieter and more intimate), while the front is better if you`re going with some friends.\n\nService is good as well, staff is attentive and seating wait times vary depending on when you go. Again, I don`t have any gripes with Pico, but the flavors are unique."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNk0zNUxBEAE",
            "text": "Food both in house and delivery is always amazing. They also have the nicest staff. We love this place!! And vegetarian friendly ! Their queso is the best I have ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcXBxQW53RRAB",
            "text": "This place is okay. Nothing to write home about. Decent apps - the guac is good; generally the food is white-people's take on Mexican food. I think that's what they're going for!\nThe attached photo hangs on their wall and I think it says a lot."
        }
    ],
    "reviews_count": 61
}