{
    "name": "Pilot House Bar & Grill",
    "place_id": "ChIJd21zlSlpwokRqwDufnF0JEo",
    "grid": "QN14",
    "address": "1-90 Beach 69th St, Far Rockaway, NY 11692, USA",
    "rating": 4.4,
    "user_ratings_total": 123,
    "phone_number": "(347) 727-7033",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjelVIUlVORlJCTFhFeVl6Tm5OREpFUjB0WFNVRRAB",
            "text": "Loved the service, glasses were always full"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUExXVTRVMkUwWWpsek1FVmFNbEZ4VjNKWU5YYxAB",
            "text": "So glad Pilot House is on the map, a classic, laid-back sports bar the neighborhood needed. With great food (killer wings!), real community vibes, and a warm, welcoming staff. Special shoutout to Ciara who’s always so friendly, funny and went out of her way to get our last-minute food order in before the buzzer when we were starving. A go-to for watching a game or anytime for good food and  a great time"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RGNUSmZlVk5xVHpocGVVNWhPRVV3WXpKMVJHYxAB",
            "text": "Beware of the food safety there!!\nI’ve been to pilot house 3x. The first time about 4/5 months ago and my margarita didn’t taste right. I was confused because it’s a signature drink ‘pilot house margarita’.  And I’m asking a bartender to make a margarita so no big deal right? My husband thought I was being picky but he tasted it and said something is missing. They asked what was wrong with it and I just said it doesn’t taste like a margarita. They ended up giving me the same drink but added more tequila. Whatever I took it. The fries came and they are just regular fried fries that need salt but there wasn’t any salt on the table.  The music was sooo loud.  Like it started getting annoying every time my husband asked, what?, when I spoke. Then I’m thinking why am I paying over $100 to leave being annoyed over the loud music.  We decided it wasn’t the best but would try it again. 2nd time was a paint night event.  Not bad. But I just had wine. 3rd time. Will never go back.  The food tasted good but nothing like when I get food from other local restaurants.  The next day the stomach pains began.  The other 2 people with me had the same thing.  We ate rice balls, fries, wings, and mushroom truffle flatbread. I looked up their health grade violations and they do have food temperature conditions on 2 previous inspections.\nThe first time I do have a memory of waiting a long time for my last drink.  I had to remind the waitress a few times and now I see a review about the bartender not wanting to make drinks for seated customers because she wouldn’t get tips.  But these stomach pains we are having are no joke.  Be careful of this place. I don’t know if they save their food until they can’t anymore or if they leave it out too long, but we were there late afternoon so even if it was sitting out all day it shouldn’t cause stomach issues. They will probably be sued one day if they keep it up.  Mine isn’t the first review complaining about stomach pains the next day."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabFV6VTJUbGsxWWs5bVUwZGtZbWRYUVVKMWVXYxAB",
            "text": "The manager Shane was super helpful and kind. He made us feel welcome right from the start. The bartenders were so cool and the second I needed their help they were there ready to go. The prices are very good, especially for the area. My new spot for Sunday night football. Food is good too. Get the wings and giant pretzel."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSFJXZEZlbkZqZVUxTU5sVkRSVVUyVjFsaUxXYxAB",
            "text": "Too loud  !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWYU4xQllaVWg2UnpJM1IydDZVblJOWXpWSlNWRRAB",
            "text": "Had lunch here and will definitely come back soon! The kale Caesar wrap was great and I loved the opportunity to sit outside. My daughter loved the flatbread pizza from the kids menu! Fun twists on American staples that’s well executed, quick and delicious. I’m not much of a sports fan and was glad the sports aspect was not overwhelming. There was good music on and lots of fresh air on the patio!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTWJtUjZNMDlxTm1SRll6SlJXbEJpVmpGV1EwRRAB",
            "text": "Comfortable!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdGNWaHFjVmhRWkhZNVZUbDNTMWRhY3pOelpYYxAB",
            "text": "Great sports bar and great food. Love the kale Caesar options."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WE5HSkRYMHBXTmxGQk1Wa3dRMDh3YkhWbmNWRRAB",
            "text": "Cheesesteak was great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVM01sbHhOMEZxU1VkRk5HTnRNbEUyTWs5SmNuYxAB",
            "text": "Loved this place. Walked in and noticed it was a Liverpool bar ...the greatest team in the world!!! ...definitely coming back!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVM2JYSnRMVVZqVFd4dVNEZHdaakZLWWswMlpWRRAB",
            "text": "Actually great place, food and service. Also, I great place to watch the any sports game and fights. Definitely going back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxa1FuZHVhV3RtVTJWVWFHSm1OMmR5UTNGTVEyYxAB",
            "text": "Came here for the 1st time yesterday..Great atmosphere & decent food but the bartender once her bar got full did not wanna make drinks 4 the seated customers anymore…Only cared about her bar & HER TIPS..Very unprofessional. Waited like 40 min for my final drink which is y our tip decreased from what we originally was gonna tip our waitress though she wasn’t bad at all....Unfortunately u only get 1 time 2 make a 1st impression & knowing she is a regular bartender, i won’t be coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeU5HUlpZMmd4TWtsblVtODVRV2h2YVZacmNXYxAB",
            "text": "Nice Sport's bar!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxek1rUkpWVXRYVWpaU1VrSmtRV1kyVDBWVmJrRRAB",
            "text": "Pilot House is a gem! The food was fresh and flavorful, the service was excellent, and the views made the whole experience even better. Highly recommend for a great meal and atmosphere!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbGJuSlVaRXBmYVdWMVJucDVjRFZKTVZaaFZGRRAB",
            "text": "Delicious food and nice vibe"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM1JuRnpObGxQUkZsUVRFUk5jMDFVYWxwVVpVRRAB",
            "text": "Food is consistently really good. Highly recommend the steak, burgers, chicken sandwich or flatbreads. Friendly staff. Great addition to the neighborhood."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SU2RYWlpiVkpDWm1OSVVFaGtMVUpHV2poSVNVRRAB",
            "text": "I’ve been here quite a few times and the food is consistently great. My go to’s are the mac and cheese, steak and mashed potatoes, Buffalo chicken flatbread and chicken sandwich. Don’t forget the lava cake dessert - all amazing bites."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RVMyWktNRTFyT1RWM1VuRkJhRmhCVjJGU01sRRAB",
            "text": "It's a pretty place. The service was very good. Food was very nice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneVpqRnhkMkkyYzBVeGNWUk5NR2t4Ukd4TVEyYxAB",
            "text": "OMG, we were so impressed! Loved the place, vibe, service and the most important food! It disappeared before we thought about photos!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMmJuUnlWVTlvZG1OUVVrNUpjVnBwTWxWelNXYxAB",
            "text": "Awful. Customer service the worst"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTlh6ZFdORE4zZFdoaWVuSXlRemhMTm1FMExYYxAB",
            "text": "Drinks are not great"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CT2NGOXVjR2t4VURneWNuRmlaMU5IVEdSWExYYxAB",
            "text": "AMAZING environment, food and service! Will definitely go back, had an amazing time…FYI the steak entree was DELICIOUS 😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTk5qZEpkMGt0VVdsbWNtMU5ZMGczYTJndFYwRRAB",
            "text": "Went with friends to celebrate a birthday and the servers were very hospitable and quick on turnaround. The food was good especially for the price we paid and I would definitely go back again. We got stuff clams, a flatbread, salad and some other odds and ends and were very pleased with the experience. Also, they have outdoor seating for you to bring your fur babies along which is always nice to be able to do as a pet owner."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdU5VTkZjalpvY2xSb05GbExYMU42ZUhVeVRVRRAB",
            "text": "Five stars all the way... had lunch there for the second time and the food was amazing..... good job guys."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT2VqaDFRM00wTTNGWGIwZFlVbmRuUm1aMk5YYxAB",
            "text": "Awesome food awesome service, place is pretty good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVGJGTnRTbk5OYkc0eWJFcGZVV0ZVWTNCQ1QwRRAB",
            "text": "Don’t sleep on their garlic buffalo chicken wings. They’re fire. Add on some sweet potato fries and a Bloody on the rooftop deck…what more could you want 🙏"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMlVubFZWWFEwY21aS1prNWZiemsyVDFZMWExRRAB",
            "text": "Our server was good but the. Entree of mashed potatoes for the chicken entree had to be sent back twice because it was cold.  The lava cake was served with melted ice cream.  First and last time here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeU9WVkRUWEZRY2tSaFRpMUVhM2d4U3pGd1lYYxAB",
            "text": "Had such a great time at this spot. I suspect this is a killer place rain or shine but it was rainy and we had a blast. Solid.... I'd drive out of Manhattan to hang with this crew. Great food and good people."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOX3k5Nm1kNzlYRTVRRRAB",
            "text": "I had a ladies night and we was supposed to be outside it rained and Amy and her staff was truly accommodating and amazing…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcjdwNXFfdzd5OThnRRAB",
            "text": "My husband, brothers & I have been coming here since they opened last year. Food is always good & atmospshere always upbeat. Staff always kind. We'll be back🤗"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPRDhvWW5obnU3YjRRRRAB",
            "text": "Oh my god, all I have to say you have to try the quesadilla with chicken.... the service was amazing... i had the opportunity to meet one of the owners i believe his name was eddie. What an amazing guy.\nHe was a teddy bear.Thank you"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOdUh2SW1ucEt6eHBnRRAB",
            "text": "It's a pub with big screens and lots of atmosphere for big game events. The stop steak was well made."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLemlrZE92OEp5dWFnEAE",
            "text": "Mussles are delicious and oysters were super fresh.  Had a blast. Family friendly. Would recommend to family and friends."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcUgtTExVZzltYnpRRRAB",
            "text": "I truly cannot exhaust the amount of impeccable things I have to say about Pilot House. The food is surreal. Their beers are natural and crisp. Their cocktails are unworldly. Just go here!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvZ29YZ09nEAE",
            "text": "The service was great; however, I didn't enjoy the food both times I've been there."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MmVPSkl3EAE",
            "text": "This place is nice to go and unwind. Food is delicious, service is good , my only complaint is the owners are not friendly and should try\nTo mingle with their customers make them feel more welcomed . (Fake it if you have to )\nTry the chicken pot pie too"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbHFpOURBEAE",
            "text": "The Food, drinks and services is great. Gotta try the food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNk9ISkFnEAE",
            "text": "Atmosphere, food and service amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueGRtNUx3EAE",
            "text": "I’ve visited Pilot House Bar & Grill three times. My first experience was a solid 5 stars—everything from the cheesesteak to the service was on point! But by my second and third visits, I noticed a drop in presentation; the cheesesteak didn’t look as great, and you can tell from my photos. That said, the taste was still fantastic, and their seasoned fries are a real treat. The staff is attentive and always on top of refills, which I appreciated. While the appearance could improve, I’ll definitely be back for another round!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cF9uOVFBEAE",
            "text": "Friendly service and delicious food make me appreciate it being the closest restaurant to our apartment location. Although I’ve outgrown the Sports Bar scene, I see many more visits and pick-ups ahead as we further explore their menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybHItdUZnEAE",
            "text": "LOVE this new addition to the neighborhood! Lots of great drinks, outdoor space (downstairs patio is dog friendly 🐕) and delicious food w/ veggie options. Buffalo cauliflower is GREAT! Get the Surfside Sipper - the staff is so lovely and kind. Everyone’s genuinely happy and it shows - perfect vibes for before or after a beach day! Can’t wait to come back 😎"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cVp2WFZREAE",
            "text": "Perfect addition to the area. Love coming here to chill for either a solo lunch or dinner with friends. Everything is just right, the food, decor, atmosphere, staff, comfort…I’m literally grateful for this spot! It’s certainly my go to when I’m in the area. I can’t recommend just one plate, so far everything I’ve tased I liked. I hate eating at the bar and even that I enjoyed here!!!! Highly recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM2RtNF9RRRAB",
            "text": "I had a great meal with excellent service, they were reasonably busy but still kept up the pace. The food was fresh and tasty! Loved the portion sizes too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyb01lS0JnEAE",
            "text": "It's a good spot to hang out, walking distance for us. Food was good we had wings abd truffle flatbread which was very tasty. Drinks were good as well. Will give it another shot this Sunday for Copa America Final game. Also palms are a plus LOL"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3Nkt5VzhnRRAB",
            "text": "I have to say, I’m not a Sports Bar enthusiast. Though I am a fan of the décor at PH, they had a vison and followed through and did not half step, and with a gem of a rooftop (kudos). PH is Kid-Friendly with an arcade that also brings out the kid in everyone.\nIn terms of food, I like simplicity, PH with their not so simple but not the overtop nonsense one finds on other \"menus\" have really nailed this dish, the Mac & Cheese.\nI’m a Mac & Cheese snob and I really love Chef Ivan’s twist on this classic. Their Shrimp Quesadilla, again simple but perfectly seasoned, plated and “side” dressed to complete what I personally feel is their best appetizer (kudos X2).\nNow for the killer… PH recently added 2 new entrees to their menu, Chicken and Steak entrees; I went for the Steak, and they nailed it! I have spoke this Steak Meal up to just about everyone I know; it’s that damn good.  Oh, it comes with mashed potatoes; it was heaven on a plate. Chef Ivan temp on the steak was consistent from the front to end.\nShout outs to Eddie, Kira (Bartenders) and Juile, much love guys.."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLWRYWDFRRRAB",
            "text": "I want to begin by saying my man and I LOVE this place. Perfect to watch the game. Perfect for after work unwind. Perfect to bring friends/family. Perfect after the beach. Literally our go to spot. But what brought me to this review was their Brussel sprout flatbread!!! Its my new addiction. I order it to the house and add my own truffle oil (tip)! Please never take it off the menu! I also love the Nachos, The steak, The chicken, The wings.. prettiest much everything. It gets the Job done. Service is typically on point I've had maybe two nights were Service was a bit off. Everyone got their food individually and I didn't get my food till last. Blah blah blah not enough to stop me from loving this spot. Keep up the great work guys!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmZ1p1aVFBEAE",
            "text": "I absolutely hate being this person, because I work at a restaurant myself.\n\nThere is no structure.\n\nMy margarita wasn’t the greatest, and my boyfriend’s Guinness pour had too much foam. I recommend pouring from the side, that way you can see the consistency and balance between the foam and the beer itself.\n\nThe server situation was a mess, but I don’t blame the staff. In my restaurant, we ask servers to have standby days to prepare if were hit with a lot of customer flow.\n\nMy burger was messed up twice, and my soup was good; but when I got home, it didn’t seem so nice. I got completely nauseous and basically threw up my entire dinner.\n\nAnd I didn’t even take a bite of my burger:\n\nIt’s the next day , and I’m currently on bed rest because I can’t move and anytime I do I get nauseous.\n\nSomething needs to change."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3a0tMQVVBEAE",
            "text": "We ate here last night and it was delicious. A sports bar atmosphere but not overwhelming. They have a free 1980s selection standing arcade games that are fun for kids and grownups. The appetizers are delicious especially the buffalo cauliflower.  Friendly and helpful service. An outdoor second floor open space adds to the charm. Great addition to the Rockaway food scene!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMLWJqdmRREAE",
            "text": "This place is just what the Rockaways needed.  It's a nice spot to grab a drink, bite to eat and watch a game.....🏈 ⚾️ 🏀 ⚽️  Good menu, spacious roof top with lots of outdoor seating, making it the perfect place to stop in after a day at the beach.....😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyemVIODB3RRAB",
            "text": "Customer service started as soon as we walked up.  We were met by the cutest hostess.  Her parents, Jamie and Amy, right there. It was literally the cutest. Our server was Ryan. He was amazing. Was knowledgeable about the menu and made sure all my picky needs were met. The bacon truffle mac and cheese was CHEFS  KISS!!!! The drinks were delicious. Price point.... this is definitely a very affordable place. You can tell summer and sports events this place will be PACKED. I was very pleased. Will definitely be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ2FqZWpnRRAB",
            "text": "Unfortunately we had a very poor experience at this restaurant. We arrived around 5pm on a Tuesday- there were 2 couples on the rooftop plus my 3 person party. There was one server/bartender- which lead us to seat ourselves and eventually served water 15 minutes after we were seated. Establishment is understaffed. The sever/bartender was trying his best. There was no dinner rush so we couldn’t understand why the severs on first floor weren’t helping much. We did flag a different server (and tried to flag down the manger with a crochet top) to ask to lower the blaring country music- we were unsuccessful as we were ignored. We decided to inform the server/bartender after 25 minutes of our time in the restaurant to cancel our food/beer order, due to being uncomfortable. Note: the manger watched us leave and followed us to another place of business across the street to harass and inform us that they do not cancel food orders and attempted to scold us for leaving a place that we were severely uncomfortable with. I was really unsure why she even followed us as we didn’t receive any food/drink and we canceled our order about 5 minutes after placing.\nThis place has some work to do if they plan to succeed here in Far Rockaway. Good luck."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuOC0tMC1BRRAB",
            "text": "This place is in a great location.  It's really nice indoors. It's technically one floor w a roof deck.  Beer selection decent but need to up their game. We got the buffalo cauliflower and nachos. Nachos were mushy not hot. Buffalo cauliflower good flavor but not crispy or heat hot. Not much flavor on either item.  Place wasn't packed and ran out of pint glasses, had to use plastic.  Come on for those prices. Strong potential for this place but ok right now.  It is extremely loud on game day.  Couldn't hear the person next to me.  We asked for the Libery game on one of the tvs since some of the games were duplicated. It couldn't be switched.  Staff was friendly, and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaTVDbm1RRRAB",
            "text": "Had high hopes for this place but the food was not great. We had Philly cheesesteak, house burger, buffalo cauliflower. The cauliflower was the best. Drinks (got house margarita and a beer) were decent. Good place to watch sports, plenty of outdoor and indoor sitting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d0xHMDJnRRAB",
            "text": "I absolutely loved their food. John specifically was the best manager. They are so dog friendly and we sat out on the patio. My dog got sick and threw up and John was so nice about it, he came over and cleaned it up. BEST wings ever."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaE91aVVREAE",
            "text": "Is this mold in my kale salad? Kale was so bad i tried to take the yellow/black rotten pieces out but then i found mold?"
        }
    ],
    "reviews_count": 55
}