{
    "name": "HH Heat Wave",
    "place_id": "ChIJUylAnnJpwokRXNRa3rjxSwM",
    "grid": "QN14",
    "address": "88-12 Rockaway Beach Blvd, Queens, NY 11693, USA",
    "rating": 4.5,
    "user_ratings_total": 51,
    "phone_number": "(718) 318-3817",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdGVVdGpXVFoxV1ZOR2NESnpVSHBsYW5sSExWRRAB",
            "text": "Delicious well-seasoned food.  We had the shrimp boil with potatoes, corn, and broccoli, an order of cranberry rice, and an order of jerk wings.  Every dish was great.  Service is nice.  The food is made to order so it’s not fast but it’s worth it.  There are two outdoor tables so seating is a little bit difficult to come by."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaFRsaEVibWRUWWpRelkxQkhOV1JMTnpselFYYxAB",
            "text": "Went here a few times trying to support my black business owners day time the pricing is on point after hours the one lady that works there over charges you si she could make her tip ordered a 5 piece with fries was charged 15 at first then when I got my food was told by a different lady that it was 20 dollars i don't get why your\nown people would screw you over that's my last time going there don't waste your time its the workers that's messing this business up horrible work buy ma you need it more then me so enjoy the extra 5 dollars"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RdFJscGhXamgyTVdaWWRtUnZkVGRyTm0weVMzYxAB",
            "text": "I always have the best time when I come here. The food is amazing. The service is on point. Never a complaint. The owner is such a sweetie! I ordered the honey glazed salmon bites and shrimp with crab Mac and cheese. SPECTACULAR!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMFQyVnhaV1pVV0ZwSE0zUXdNMjlIVFUxVVpWRRAB",
            "text": "Drove from the city just to visit this Black owned establishment and we were not disappointed… Ordered fried shrimp, catfish, whiting, Mac and cheese, fries and wings. While waiting there was music and everyone was welcoming and friendly. Went over to the beach and enjoyed every bite. Everything was seasoned well just was missing some hot sauce!!! Definitely will be back!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eVpXeHZZekZuYTJvMllURlhjVkZ3TlU5M1NsRRAB",
            "text": "Nah, this spots got it. Good vibes and freshly made food that makes you want to comeback."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205QlVqbDRSRVJMUkhnMVVtMVZUMmRZY0dzNU9YYxAB",
            "text": "My wife and I were coming out of a restaurant down the block from HH, and there was a huge crowd in front of HH, music blasting, cars triple parked. My wife said \"I think we went to the wrong place.\"\nTwo weeks later we were in the neighborhood and stopped by to pick up some takeout from HH. They have lots of flavors of wings, and some smoked chicken and fish. The wings are expensive, $20 for 10 wings, but it comes with fries. I ordered 2 orders and got parm/garlic and jerk. I wish I could have gotten 12 wings for $20 without fries. But, the fries were great and seasoned well!\nI was expecting just some fried wings covered in a bottled sauce. No way! These things were smoked or roasted (not sure) and perfectly cooked. We didn't even eat them until we got home to Howard Beach, and they were great. They were fully cooked, crispy and the seasoning didn't overpower the good quality wing. The wings were large but not obese.\nService was great too, very inviting people with some characters hanging around improving the atmosphere.\nGreat job HH, I will be back to try the smoked chicken."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVFVHcHNjMFV3ZUZwT01HZFZRMlJSTFc1dFQxRRAB",
            "text": "Fantastic! Jerk salmon bites, jerk wings, and fried shrimp with Cajun fries are a must!!\nGreat service, food made with love!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVFVtSlpiV3hEV0hWTkxXRkJVelZtTWpoU2RGRRAB",
            "text": "The food here is amazing. Great seasoning and  perfectly cooked. The vibe here with the music is really nice.. 70's disco, 90's hip hop and r'n'b. The local crowd is super chill and hospitable. All the cool black ladies from the area hang out here. Just good times, good food and good people. Oh, and the price is right! You won't be disappointed.\nI highly recommend the lemon pepper chicken wings and the fried fish. 👍👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTE5GUllkRkpFVGtGTWJYaHBiRzlaUlU1U1RVRRAB",
            "text": "Top notch seafood. We loved the wings and everything was great!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobGVuSmhTamxhZDFoMU5tVnphMDVhV0VFM1FVRRAB",
            "text": "So if you know me, you know I'm a little funny about my food. I had a couple of trepidations about this spot. Lo and behold, these are some damn good eats! The catfish was way better than I expected. And the price wasn't even stressful. If I have a half of complaint, I like my fries a little crispier. But even that's not a deal breaker. If they're open, do yourself in favor and make it over there."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMVpITmZYemhQWWw5VGNWcFVVekZLT0RKSGVrRRAB",
            "text": "Haven't had good food in a while and this place ticked off all my boxes! Wait time was a bit longer than usual but it seemed like an off day and it was worth it regardless! I recommend the whiting fish and shrimp! Shrimp over rice was also good but not enough shrimp for me lol"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMbUo0cDZpeDhUVW5RRRAB",
            "text": "Such good food, fish and shrimp are my go to. The owner is very kind and made our food quick and fresh. The atmosphere around the restaurant was very good and not too loud."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbDlMekNBEAE",
            "text": "Establishment is closed but on website say it’s open took one hour ride for nothing I should’ve called before I went not to waste my time"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbE0tVlhREAE",
            "text": "The best fried whiting!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucjdiczZRRRAB",
            "text": "The best fish Sandwiches"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucU1IeTJBRRAB",
            "text": "Unfortunately every time I have come to this establishment it has been closed despite the website saying that it's open. After a few months of calling,  I finally got a number that works. Spoke with management and they said that the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbE5TY3hnRRAB",
            "text": "I recommend this restaurant to everyone, I ate the best shrimps in my life there, the manager himself was the nicest man on the planet, I recommend everyone to try the food from this place because it will be delicious every time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIXzRmVzlRRRAB",
            "text": "This place looks so good. I can’t wait to go back home so I could just drive down there and get me something to eat so many things to order. I think I’m gonna get this chicken salad. It looks so great and appealing. You know how it is we have to support black businesses and small businesses and I think this is a perfect place right by the airport."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bzVmYU1nEAE",
            "text": "No menu from what I could see but a woman out front shouted I should order the fish and shrimp. A man walking by sold two full totes of filet mignons for $7 a piece to all who were present"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaXNtMFFnEAE",
            "text": "The food here is great. Crab legs and Mac n cheese are amazing. As is the Rasta pasta. Limited seating so often we pickup and take home."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabDZxMjR3RRAB",
            "text": "Great food, good advice on what sauce to get, great music"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNk15cEdnEAE",
            "text": "The food was excellent. The fried whiting sandwich had so much flavor, and the portion size was awesome. I had enough  for two sandwiches... I also tried the jerk wings when I tell you the best I ever had is an understatement!!!\nAnd the Cajun fries...mmmmm mmmmm good!!\nWhen you do stop by and do go cause the service and food is exceptional and the owner Sal is kind friendly and knows how to throw down in the kitchen💕💕💕"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwX3FIbVJnEAE",
            "text": "Little Cliff puts his stamp of approval on the fish and fries 🤓👍🏾!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdVpUaEx3EAE",
            "text": "Excellent choices on the menu, Various choice of seasoning and sauces. Delicious just scrupulously Delicious 😋."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKN2VxU1ZBEAE",
            "text": "Nice place great food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeUlfbnFnRRAB",
            "text": "The Vibe is so chill, good music, great food! The owner is very personable. He made sure everything was on point!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1N2V5bTRnRRAB",
            "text": "Ordered salmon mac and cheese and 10 wings after a long day at the beach. Wings and salmon were made with our choice of seasoning/sauces, all the food was seasoned to perfection. The food can take some time to prepare but they played great music. Will make it a point to come back whenever I’m in the rockaways"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cnFUUjRnRRAB",
            "text": "This place is amazing. Both of our kids said it was their new favorite place and maybe the best food they have ever had. And my wife is a really good cook. Everything we had was great- the curry rice with cranberries, the fish sandwich, the wings, and the crab boil! I wish he would open one in our neighborhood."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPc1lMT3lRRRAB",
            "text": "DELICIOUS FOOD ... GREAT FLAVORS - AWESOME MUSIC & GOOD TIMES ... IT'S WORTH THE WAIT ... TELL A FRIEND 2 TELL A FRIEND ... THANK YOU ..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcUtIcDlRRRAB",
            "text": "Not fresh was leftovers not good at all never again & l had to wait 10mins sad... how was this fresh looks old smh so crab & mac dry no good😤"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHd0plYVlnEAE",
            "text": "Everything is made as you order fresh .. You might have to wait for your order but it's worth it... The best spot in far rockaway.."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dmZQcjl3RRAB",
            "text": "This restaurant is outstanding.  Hands down the best seafood I’ve had.  I ordered the crab claws tonight via doordash and everything was so flavorful and fresh. My new go to seafood place. Also, the staff/owner is super kind and professional. All around 5 stars, thank you HH Heat Wave!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2N3JuQkVnEAE",
            "text": "Has to be the best seasoned Mac n cheese I ever had. Good food, the owner/chef was super sweet. Do recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2N3BuTDZ3RRAB",
            "text": "I can't deny this was some of the most flavorful, well seasoned, delicious rice and shrimp I've ever had.  The crab Mac and cheese was also amazing.  I don't live close but I'd definitely head down to the Rockaways just to grab food here again and head to the beach."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxLV9fVzFBRRAB",
            "text": "The seafood here is so fresh and delicious! It's a must try if you're in the area."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxdk1TTERBEAE",
            "text": "Easily some of the best seafood I've ever had in my life. The flavors were out of this world, and the ingredients seemed very fresh. If you've never been, do yourself a favor and check this place out, because you simply do not know what…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLZ182RkhnEAE",
            "text": "Best wings in Rockaway."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLcE1XMTVRRRAB",
            "text": "Delicious seafood crab boil with fried shrimp 😋. I would order ahead to avoid wait time.....I guess I'm a little greedy 😊…"
        }
    ],
    "reviews_count": 38
}