{
    "name": "Tap That",
    "place_id": "ChIJM_Ox7klpwokRE7hyE7Sbo6w",
    "grid": "QN14",
    "address": "111-04 Rockaway Beach Blvd, Rockaway Park, NY 11694, USA",
    "rating": 4.7,
    "user_ratings_total": 189,
    "phone_number": "(929) 254-2222",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeVlVaFdZMmxTTFROVE5qWnZXSFZhVjBkWmNsRRAB",
            "text": "Worst food I ever had. Clam pizza? More like burnt cardboard with frozen seafood. The burger was the most mid burger I’ve ever had. Save ur money."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UlNsQnJZM0U0U0hOUVZrOXNURTF3Vld0RmNXYxAB",
            "text": "Love this place! The pizza is amazing, everyone so friendly and great choice of ales!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMmNqUnlXRVJQVEhOeldYTjVVM2xqTFdKMWRVRRAB",
            "text": "Excellent place to grab a bite and drinks. Great atmosphere and chill attentive staff. Plenty of room outside, inside and in the back patio in case you’re not up for great live music in the front patio. Dog-friendly!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORVYxZFNTemQzYW1scGJYSkpOalJDWXpoNVpHYxAB",
            "text": "Favorite NYC day trip! Take the ferry from Wall Street to Rockaway. Tap That is fabulous! Good food, great beer, outdoor and indoor seating, friendly staff including the owner John. Drink, eat, walk to the beach: a great day!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eVpFRmFZVVYyY2pnM1kzQjJSbFZRUmxGT1RsRRAB",
            "text": "Great service, great beer, and great food!\nHidden gem and I will be going back. The corn was unreal must try. Next time I go back I'm going try the hand cut fries, the maple ones are a bit sweet for my taste. I would like to see them  add red hot mozzarella sticks to the menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxZllVNDNWbXhYUjA5VVJVUmljMmxwYmpsUllrRRAB",
            "text": "This place is so cool.  Amazing our door space with games to play for all ages.  Food is very good - even the pizza was so tasty and fresh.  The drink tap concept is very unique and fun.  You pay by the ounce and can try different things on tap from beer to wine to sangria.  We had a big group and they were very accommodating.\n\nA must visit if you are in the Rockaway area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WalR6VmpSRVJaVjBRMFZGSlBTVXR4V2pFdFUyYxAB",
            "text": "We just happened to have found this place. We each ordered a burger and split them. Very good! Prices are high but you are at the beach. Both were equally tasty and would totally recommend the Ahi one and the steak burger! We happen to be here when there is some live music too. Fun place for food and some beer!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wd01HWjRSRmxsTUhkNmRXUldWbU5CVVVsVGEwRRAB",
            "text": "I went there on a Monday night.. service was attentive. the host was engaging and advised me on the process of the Tap.that concept.  I had so much fun just tasty the selection of beers and wines.  The  the food was really good.. onion ring batter seasoned and crisp.  I.have saved the best for last ,  those \"Hog wings\"   were everything.\nI.can just see myself going  to  Tap. THAT for an order and a side of beer. Definitely check them out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKT2RFNUdTV0YzVmpGQ2EwNTRVMWhFVkZkM2EyYxAB",
            "text": "Perfect place to hang, with  outside seating in both the front and back(there is a fire pit in the back) and tables inside.There are at least 20 beers on tap and a few wine selectopns. The  steak and fries-46$- are unmatched in queens and their take on elite, mex street corn, is thrilling.  Portions are generous and the owner is all heart."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRldtWkdUM1ZuUW1aSlZVeFpYMUkzZEMweVpFRRAB",
            "text": "A Flavorful Surprise with Outstanding Service\n\nDelicious food, great atmosphere, and top-tier hospitality. Highly recommend stopping by if you’re in the area!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeFowaHdNbTVaTVZwaU1qVXdNMnBNVFdKUWIyYxAB",
            "text": "I was very impressed with this place! Very friendly staff, delicious food, great beer!!! Plus there was live music, just mind blowing! I will definitely visit this place!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbmJWTnRORVpXTjJaemFGcGpibE5TUmsxcVZXYxAB",
            "text": "Love this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNREQtcTZ6cXV5Q1BREAE",
            "text": "A True Gem! Tap That Delivers on All Fronts! 🌟🌟🌟🌟🌟\nTap That Beer Garden and Restaurant truly knocked it out of the park! From the moment we walked in, we were impressed. The atmosphere is fantastic – lively but not overwhelmingly loud, with a great buzz that makes you feel right at home. The beer garden aspect is brilliant, offering a relaxed and spacious setting, perfect for enjoying a sunny afternoon or a cool evening.\n\nNow, let's talk about the beer selection. Wow! They live up to their name with an incredible, diverse array of taps. Whether you're a craft beer aficionado or just looking for a refreshing lager, you're guaranteed to find something amazing. The staff was incredibly knowledgeable and helped us navigate the extensive list, offering great recommendations tailored to our tastes.\n\nAnd the food! This isn't just your typical pub fare. The menu is creative and delicious, with a fantastic variety of options. Everything we ordered was fresh, well-prepared, and bursting with flavor. The portion sizes were generous, and the quality was top-notch.\n\nBeyond the fantastic food and drink, the service truly sets Tap That apart. Every single staff member we encountered was friendly, attentive, and genuinely seemed to enjoy their job. They were efficient without making us feel rushed, and their positive energy contributed significantly to our enjoyable experience.\n\nTap That Beer Garden and Restaurant is more than just a place to grab a drink; it's a vibrant, welcoming spot that offers excellent food, an unbeatable beer selection, and outstanding service. We left feeling completely satisfied and already planning our next visit. Highly, highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX2FhS1RnEAE",
            "text": "Went for a celebration party and tried almost everything. The food was great. The highlight of the night was the special pizza. It was to die for, full of flavor and crispy, definitely a one of a kind!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbXF6OUZREAE",
            "text": "I wish it was closer to me , I loved it Soo much . The pizza was amazing and the whole concept was great ..\nI cannot wait to go back during the summer"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcjhtZ1B3EAE",
            "text": "Loved it! The grilled ahi burger was delicious as was the pear cider. The service is great and got to interact with one of the owners who was great. Will definitely come back to this local joint and check out the live music next time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNUxIS293RRAB",
            "text": "I haven't seen anything like this for a long time. This is one of the best places where the customers pour the beer themselves. It's very convenient. And their beer is one of the best"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNkpUYjBRRRAB",
            "text": "Tap That. They have a great variety of beers and wines, but Wow, what a great steak they have. Its a 28-Day Aged N.Y. Strip with Herb Butter. Been looking for a place with dry aged steak in or near Rockaway. Well, this is the place. Their menu prices are very fair. I have been here before, but for the beer and bands. Others have given very good reviews for Tap That and I agree. I am looking foward to try their other dishes. Its a family friendly place, like many others in Rockaway. Stop in and say hello to John, the owner and chef."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cDdicjJRRRAB",
            "text": "I enjoyed this location until I was informed credit card tips are pocketed by establishment’s ownership and not pooled evenly across the staff. Truly an unjust business practice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbGJmRzFnRRAB",
            "text": "Food and drinks are delicious but definitely the most expensive on the peninsula."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOXRDNmlnRRAB",
            "text": "Couldn’t wait to try this place even though I don’t drink beer (thankfully, they had margaritas on tap too). Great food, friendly staff and they had the game on."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucXNyVlF3EAE",
            "text": "I really enjoyed playing Radio Bingo and the wide tap selection! My veggie burger was delicious. I recommend their Franks Red Hot Onion Rings."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucXBMcHVBRRAB",
            "text": "Tasty food, AMAZING service, and a wonderful back patio"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua0xQNXdBRRAB",
            "text": "Delicious Cold Beers, Food from a high level Chef, and a fun time. Everything you want in a NYC establishment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNub1Bpc2RBEAE",
            "text": "Nice seating in the back. Food is ok"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcGJpem1BRRAB",
            "text": "On the recommendation of a friend , my wife and I finally came for dinner.\nWe were greeted by John the owner, he explained how the 30 taps worked and the different choices.He gave us great food recommendations.We had the hog wings with bbq sauce as an appetizer which was amazing.I had the PBLT (pork belly blt)with red hot onion rings which was delicious. My wife had the burger special and enjoyed it. John made us feel at home, we found a new place to have dinner and made a new friend!! Definitely recommend you try it soon!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIb3JyZ1R3EAE",
            "text": "Can't wait to come back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNId3NQN3V3RRAB",
            "text": "Option to self pour is awesome. Sweet potato fries were delicious and perfectly crispy. Nice sunny day with lots of outdoor seating"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3emNEZHF3RRAB",
            "text": "Absolutely delicious every single visit. Great (evolving menu), attentive service and top quality ingredients at fair prices. Love the backyard too! Will definitely be back again and again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bWVMZkNnEAE",
            "text": "I found a great beer, the food was really good and I liked the atmosphere and outdoor areas. Checking out, paying, they had two tip jars. One for the hostess and one for bussers. Hostess didn't do anything except take our money when you have to pay. Bussers did everything, but you felt bad if you tipped the bussers and not the hostess because she's right there. I didn't like that because you felt guilty. I think it should be combined. Other than the tip guilt, it was great. I'll come back again when I'm in Rockaway."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bHZDZF9RRRAB",
            "text": "The food quality is poor and overpriced. For pizza and two fish and chips - 95$.\nBeer choice is wonderful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieWRfZHFBRRAB",
            "text": "I can’t remember the last time I did a happy dance while I ate.  The pull pork samich was amazing!! And pouring my own beer made me feel like a kid in a candy store!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibnNmMExREAE",
            "text": "I guess some people might like it if you don’t mind paying for overpriced beer you have to pour yourself and a bland uninviting atmosphere. Live music might be a plus."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNienBhV3N3RRAB",
            "text": "Very nice experience.  Taste any beer and not need a whole glass. Great concept"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycnR1YVVBEAE",
            "text": "Good beer, good food, good vibes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaXA2YmFBEAE",
            "text": "Nice place with excellent food.  Plenty of drinks on tap but a bit pricey.  The space was open and inviting.  Unfortunately i had to catch the ferry before the music started.  Cool tap handles."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMEktQ3pBRRAB",
            "text": "Good food. Price a lil up there for bar food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeTRqZkN3EAE",
            "text": "Extremely clean location with a self service beer station. Card system allows you to choose which beer you want and pay by the ounce. Plenty of outdoor seating to enjoy a beverage with some family/friends on a nice day. I found the beers to…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLTdUNTBRRRAB",
            "text": "One of the best places on rockaway area. Modern, with an incredible atmosphere and service.  There are plenty of seating in and out and in the backyard. Parking is on the street, so plan accordingly. You will need to create an account and use a card to tap yourself from the wall bar, the scan the QR code on the table for a separate tap. Food is fast and really good. Will def recommend this place."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsOC1lUURBEAE",
            "text": "Great selection of beers and non-beers, such as sangria, margaritas, ciders, and wine. The ambiance of both the indoor and outdoor spaces were cute too! We especially loved hanging out around the outdoor fire pits in winter, they definitely keep you warm!\n\nWe didn't have a chance to try the food, but from what we saw it looked delicious and we are excited to go back for a meal too!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6dWVuZ1lBEAE",
            "text": "Very cool concept. You pour your own drinks, and pay by the ozs' poured.  A \"tap access card\" keeps track of what and  how much you poured.   I didn't eat, but the kitchen was a buzz and the dishes coming out looked (and smelled) great.\nI was impressed at the variety of beers and ales on tap, as well the proper style of drinkware appropriate to your choice of pour.   If you have no idea what to do, no worries, the friendly staff will show you how it all works.\nLooking forward to going back and trying something to eat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6amVQd3VRRRAB",
            "text": "I leave lots of food reviews, however this place most likely is the best place I've been to! No,let me keep it real 💯, it is the best place I've been to. The food is to die for, the atmosphere was like hanging out in your own backyard, the owner and his staff are outstanding, I can't remember the last time a owner came out to greet his guests, my wife and her friend spend almost 4 hours there Sunday afternoon playing games. Highly recommend this amazing spot,can't wait to go back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1ckoza2FnEAE",
            "text": "We stayed in the area last week and found this jem! Great little/big spot that has indoor and outdoor seating! Live band, great beer, great service! I came back today while waiting for the ferry and being new to the long hair thing, asked the hostess for a hair tie! She had an extra one! Erin, you're the best!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLXZ6bnhBRRAB",
            "text": "Had a lovely afternoon listening to live music and having lunch. The bbq Sandwich was so delicious! Plus crunchy tots with avocado mayo!! Then ending with massive ice cream sandwiches! Definitely coming back soon!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdG9pSkNBEAE",
            "text": "Tap That is a Modern, Innovative, and Enlightening Beer Tasting/Bar experience! No longer do you have to wait for a bartender to pour you a beer that you dared to try and had to spill out either in the bathroom or your bad date’s lap. It’s…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbFBIN3ZnRRAB",
            "text": "This is definitely worth the experience! Super fun spot to go on the weekend. Go early, as it gets pretty crowded in a small space. The interior had a great atmosphere! Some of the drinks on tap were good and others were not great. A little pricy but worth it occasionally."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6XzlQUDZnRRAB",
            "text": "You don't know, I look for restaurants and bars all the time all week, the attention to detail in this place is impressive obviously it is very cheap for what they offer I have been to many expensive places that only offer status and not quality in their service/product . In the photo you can see how the waiter even has products to protect you from mosquitoes in the summer in the backyard. Someone out there in these opinions says that he is very expensive my friend, buy a sixpack at an Indian deli so you can afford it. Greetings to the staff, I already bought them a t-shirt haha"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlOEszak1nEAE",
            "text": "Great place to chill and have fun!\nUp to 30 different kinds of beer 😍 and great food, especially the tuna sandwich! Highly recommend!…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NS1pR0JREAE",
            "text": "Maravilloso!\nSoy veggie, ellos tienen una opción veggie de hamburguesa llenándora y sabrosa. Me encantó este local!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MWJqZVRREAE",
            "text": "Excellent new pour-your-own pint joint right off the beach. Plenty of indoor and outdoor space for doing your post beach relaxation. The format also allows you to try out and have fun with drinks you might not want to pay a full pint for.\n\nLove the decor."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOG9hZEJREAE",
            "text": "Awesome place! Great Experience! You chose what kind of beer you want to drink and how much! 1oz., 2oz., You pay for what you pour! Definitely worth it!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREM091QWFnEAE",
            "text": "Very welcoming, great variety of drinks, accommodating, friendly, clean!!! A must stop if you are in the area!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbXMtQmZnEAE",
            "text": "Amazing bar amazing experience. Hands down the best beer selection in Rockaway. John and his team does a great job. Highly recommend if you’re staying at Rockaway Hotel!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycnJYVnVnRRAB",
            "text": "Love the place. Great atmosphere,  excellent  service, food looked delicious but I didn't order food. Only thing I did not like was how the bathroom was. I was there for 2 hours drinking and enjoying Might Quinn  Band but could continue to use that bathroom. Had to leave. Hopefully next time there is a person to be on top of cleaning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqck1UX1hREAE",
            "text": "Unfortunately I was only able to go once. The chicken sandwich was the best I've ever had.  We were immediately greeted at the door and seated.  After that the server checked on us regularly.  I definitely recommend this experience, it's new and unmatched!!   If your glass is empty then that's your fault!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcjRieVlnEAE",
            "text": "Tap That is an awesome spot. The BBQesque food is delicious, prices are fair, and portions are large. I would highly recommend their BBQ pork shoulder sandwich and buffalo tater-tots. I'm a huge fan of their no touch ordering system. It is super easy to order food and pay from your phone. They have a large beer selection of self service taps. They even had self service margaritas on tap. If you can't find something you like to drink there, you're the problem. I highly recommend checking this place out after a day at the beach or if you just want good food and beer. I went back recently and it was still just as good."
        }
    ],
    "reviews_count": 56
}