{
    "name": "Uma's",
    "place_id": "ChIJqStTHEdowokRMz_JLWKEx74",
    "grid": "QN14",
    "address": "92-07 Rockaway Beach Blvd, Rockaway Beach, NY 11693, USA",
    "rating": 4.5,
    "user_ratings_total": 435,
    "phone_number": "(718) 318-9100",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRlpWcHNlRVZ1VG1OaFNHWklOMDEzT0ZoU2VHYxAB",
            "text": "We've been huge fans of uma's for a few years now. Everything is so fresh and delicious. The kimchi salad the red coconut lentil soup, and a hearty mash are vegan and so tasty. Great staff and people vibes."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTlEwUmxNelZWYlRsR2R6Tm5PSGhaYWpaUVdWRRAB",
            "text": "We were hungry and found ourselves in front of Uma's restaurant.  Everything I tried was delicious. Uma's house salad, a leek filled something, salmon skewer, and roast potatoes.  All super delicious. Our friends have 2 small children that ate everything on their plates. Shocking as they only want McDonald's!  Their parents both had lamb, and mashed potatoes. Their plates were licked clean. I can't wait to go back."
        },
        {
            "date": "3주 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkU1ltSktSVnBsZVROWFkwVktiakEyZFRaSlkzYxAB",
            "text": "Пельмени здесь были очень вкусные!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUlJHbEpSREZSTVZRMWFUZDZjRFkyZW05dVlWRRAB",
            "text": "Very cozy place! Feels like home! Food is outstanding! Bravo!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTU4wUTFkRzE0U205U1dGZGFNVVI0YVhsUk1tYxAB",
            "text": "Rockaway Beach Gem"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSlpWSXlNakpuYW5wMloxOUtObWhQY0UxVU5IYxAB",
            "text": "★★☆☆☆ “Authentic… in some unintended ways”\n\nStopped by this Uzbek restaurant hoping for a warm Central Asian welcome and a comforting plate of plov. What I got instead felt more like a self-service experiment.\n\nService? Practically a myth. The waitress didn’t bother with a menu introduction — just put it on the table and disappeared like a desert mirage. Specials? Who knows, maybe they’re special enough to remain a secret, she did not bother to explain what they are.\n\nOrdered the pilaf, expecting that classic slow-cooked harmony of rice and meat. Instead, it arrived as a pile of rice with a few random chunks of lamb tossed on top like an afterthought. Definitely not cooked together — unless “together” now means “sharing the same plate.”\n\nAs for the lamb skewer — $18 for five small pieces. At that price, I almost expected a souvenir or at least a side of enthusiasm.\n\nOn the bright side, the food looked roughly Uzbek, and I didn’t leave hungry. But overall, the place could use a little more heart — and maybe a reminder that hospitality is supposed to be part of that cuisine."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeGN6VlVURFpZYzNndGIzaFBjRTlIV1VsclprRRAB",
            "text": "Amazing place to take hot plov after a freezing surfing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213eU9WUlFkRVZmVjFSQ01WTmhXa1o2T1ZoMlVrRRAB",
            "text": "I've dined here many times over the years and have always had an excellent experience. Their menu is quite interesting and diverse, and the food really hits the spot, especially after a cold, windy day at the beach. The atmosphere and vibes are always very cozy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNVRsazRURFJFTlZkcFdqTnVkREpmTlVaM1QzYxAB",
            "text": "Our meal after the beach at Uma’s stopped me dead in my tracks. I couldn’t believe such a delicious meal was tucked all the way in Rockaway. Hands down one of the best meals I have had in a long time. We ordered practically all of the popular items: Plov, Manti, Borscht, Samsa, Korean carrot salad, and the lamb kebab. We shared everything family style and nothing missed. The balance of crunch with savory dishes drowned in sauce was perfect. The servers were very friendly and attentive the whole time and it was all reasonably priced for how much food we got. Highly recommend to anyone heading out to the beach and I’d even argue it warrants a trip out of the city in and of itself."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRd2JHdERVbE5oWTJwemJsUlZPVXhzVlRGSWJIYxAB",
            "text": "Delicious homemade food. Portions are fair, I was full through half of a plate but had to finish it was soo good. Also cozy atmosphere, nice staff and music. Loved it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSVIxTnNiemhrUmtac0xVMHhiVTlETXpSWVltYxAB",
            "text": "I found this place on Instagram and l have always wanted to try this place so I decided to come here on Labor Day. Upon arrival, I was told they ran out of plov which was insane to hear 1:30 in the afternoon. I left very disappointed but I will come back to try the food. I wish the server did more to keep me there. I will call ahead in the future to make sure they have plov and I would advise anyone coming to Uma's to call as well if they want the plov"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMk5sRlZaRmwwYzBabWNITlhRMDVIWTJkV2NVRRAB",
            "text": "Veggie soup with noodles was great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bVVscDFSVEprZWtkNGJucFdlVk5QZG1kcU9XYxAB",
            "text": "Orders delivery and received cold food and no utensils (despite asking for them).  The bag was soaked inside as well. Total disappointment."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMWN5MDFRVE5aUjI5NWVqVk5Sbk0zWkdsUFgxRRAB",
            "text": "Very delicious food, incredible prices. Almost a fine dining experience but not including the crazy prices. Kimchi salad is a must try, if you’re in the neighborhood this is your place to eat!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSU1WaDNXbEl0WDBoTVdsRlJVMWxwVkZkWFRuYxAB",
            "text": "A very cute and hip uzbekistan restaurant that offers decently sized dishes. I love the moch Kichiri because it was packed with veggies and left me very full. The wait for your food to arrive can be very long and many of their dishes run out at night. Despite that, the waitstaff was very helpful and accommodating."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KU01tUnBNM0IxWm1ZNExXdzNTRlpHYkVkM1IyYxAB",
            "text": "Had never been there before. Wasn’t sure of the menu. Ended up being very good.  Even for picky eaters like my wife. Would go again, no question."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTlJtRlpSbEUxZVVoNFMwb3hWVzFGV1dZeGJXYxAB",
            "text": "I ordered plov and it was a complete disappointment. The rice was undercooked, the carrots overly salty, and the meat completely bland with no spices at all. I told the waitress, and all I got was a quick \"sorry.\" They didn't offer to fix it, replace it, or do anything to make it right. I paid, watched them throw the food in the garbage, and left hungry. No respect for customers or quality"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSVQzcEJhMU5IV2xsS2IwMVpYMFEzV0V4YVUwRRAB",
            "text": "Super chill place with excellent food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcmRsaDJiVFZET1dSRVJtZHBiV3cyWDA5VldIYxAB",
            "text": "The Indian Masala chicken is microwaves,came cold to the table! My daughter found a short hair in her chicken kabobs!!!\nFlies are over your food!!!"
        },
        {
            "date": "3달 전",
            "language": "ms",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNU9UazFPVEEyVm5aMk0yOTVNbmQxU1Uxc2FuYxAB",
            "text": "Wowwwwww"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVFQzVlBOR3M0VEZOSFUwRmhNRXRXZGs0NVgxRRAB",
            "text": "Jeyrelis was the best server! So sweet and funny"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cFZWTnVXVmM1YjA5clEyVjBSRzFLVG1vM2RWRRAB",
            "text": "Really amazing place.  It's a shame it's so far out for me, because otherwise, it'd be a real frequent.\n\nThe place itself is nicely furnished, and has a decent amount of seating.  It does get crowded, but only because the food is so good.  The bathroom is nice and clean, and the service was nice.  No complaints.\n\nThe food was amazing.  The Korean carrot salad was stunning, and the samsa was a crowd favorite in my group.  I got a lagman soup which was thoroughly enjoyable, and my group partners got manti and pelmeni, which were really great.  The price was reasonable for the amount, and it's more filling than it seems.\n\nTruly an amazing place, and will come back whenever I'm done beaching around."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcVMyb3hXVm81TWtkTGNrUmFibFJtVWpSR1lsRRAB",
            "text": "Had a great dinner with friends and our kids at Uma’s - we loved the food and atmosphere. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRldGZFNTMVZFWW14RFdYcFRhemxqWHkxNmFHYxAB",
            "text": "Great to find this Uzbekistán restaurant in Rockaway.\nWe got some plates to share so we could all try different things,\n\nI absolutely recommend the dumpligs as well as the kebab Fillet mignon and  the lamb one. Both delicious.\nThe ice cream is interesting too.\n\nIf you’re gonna take the buckwheat make sure you pair to something creamy, or it’s very dry.\nAlso the turkey rice was not bad but I felt it was a bit dry.\n\nValue was great, I feel the price was really reasonable, and the atmosphere is nice.\n\nI’ll be back to try more plates!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUGNrVkJUSFJGVDJkNWVteE1YM1JTTlVKSlJVRRAB",
            "text": "Carrot salad and lagman noodle soup was good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BelYxVjVUMFp6ZUhsNFFVSnlUa3BxUW5nMldsRRAB",
            "text": "the plav and manti dumplings were delicious, we got both dishes and split between three people"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneFFuWlBMVTVXUjFCTVRsTXdhMUpGVEdWQldHYxAB",
            "text": "Really nice spot doing authentic Uzbek dishes. Delicious food, laidback vibe, the perfect way to indulge after a nice beach session. The vegetarian dumplings were the standout dish for me. The noodles were also delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTGNuZFlTVVpqYWprM2FrWmplbkJyZEhKcU4zYxAB",
            "text": "The Uma’s salad is the best thing anyone anywhere could ever choose for their body"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRWVGZFZXa2RJWlhGM1NFcGxOVE50WW1wNFRHYxAB",
            "text": "Delicious food, lovely atmosphere, delicious lager on draft!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZkt4N3ZxM3RleGxnRRAB",
            "text": "What a cozy and welcoming place! Huge thanks to the café staff. It’s amazing to sit by the ocean and enjoy such tasty Central Asian food — a real treat!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOTDY1b1Q4OE95cERREAE",
            "text": "Don’t sleep on this place. Best homemade food. The soup and the squash dumplings were to die for. I’m still thinking about them! Can’t wait to go back!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOWDE3NGVZNC1mczRnRRAB",
            "text": "Food was delish! We got the uma salad, lentil soup and beef and lamb manti. It was so homey and satisfying. Will definitely come back next time I’m in the rockaways."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOTENfY0xZNkxfQ0ZBEAE",
            "text": "food is delish. traditional uzbeki food with a twist! johnathon is also such a great server, friendly and speedy. would recommend this rockaway gem 😎😎😎"
        },
        {
            "date": "5달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRHItSy1CZzViMGtnRRAB",
            "text": "Всегда вкусно"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMzRmNFd3EAE",
            "text": "This restaurant is delicious. I came here with all my family all five of us and we had such an amazing time. They have a live singer. He was amazing. I had a great time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MUl1b0JBEAE",
            "text": "Lagman was bomb. Like a cross btwn ramen and borscht"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReElhQ0NBEAE",
            "text": "The meatballs and the dumplings were delicious. Good craft beer on draft"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBazliM21RRRAB",
            "text": "The food is warm & delicious, feels as if you were eating homemade food from your grandma. Be sure to save room for the Halva Ice Cream and pair it with their real 100% Puerto Rican specialty coffee which you can only find in this location. Owner is great and present at the store."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bU5LaC1BRRAB",
            "text": "Any negative review is wild this food is 11/10 good. Definitely a very homemade/eating at someone’s home vibe which is the best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdWF6TFJREAE",
            "text": "Food arrived cold, waitress was not in a good mood. Not going back here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcXVQajVBRRAB",
            "text": "We had the pelmeni and the menti with squash. Simply amazing, very delicious and flavorful. The broth in the pelmeni was pretty rich and complemented the yogurt and dumplings so well. I was skeptical about dumplings but I was so pleasantly surprised!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNmJHWWJBEAE",
            "text": "Enjoyed our time here! The restaurant is very cute and reasonably priced. We got the Silk Road salad, hummus with scallion pancakes and some tea which was perfect for not being too hungry. Our server was also very nice 😄…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1X3Q2SWF3EAE",
            "text": "My friend and I were looking at places to eat after a long day at the beach and we found this Uzbek/Kazakh fusion restaurant on Rockaway Beach. The decor was vintage, the lighting was dim, and the service was nice.\n\nWe’ve never had this cuisine before and it was truly a great first introduction. We ordered the red lentil soup, pelmeni, and manti with butternut squash. These dishes were quite hearty and flavorful, despite being so vegetable forward. Uma’s described the pelmeni and manti as large dumplings, and they certainly delivered on that aspect. I really like the touch of detail with the caramelized onions and fresh dill, brightening the dishes.\n\nMy absolute favorite was the soup. If I could have a gallon of the coconut/red lentil soup from Uma’s I would certainly drink it all up. It was so earthy, yet creamy and had the right amount of salt for my taste.\n\nThe ice cream was also quite yummy, it was refreshing and the toasted sesame crumbs enhanced the rustic nature of the dessert.\n\nIf I come back to Jacob Riis or Rockaway Beach again, I would certainly come back to dine at Uma’s. I definitely recommend bringing friends here to share various dishes with, as it was a bit pricey. Overall, this was a great dining experience and I’m glad we got to find this gem in the neighborhood!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNFLVBDazJRRRAB",
            "text": "I have been 4 x in the last two weeks. Delicious filling food. Be patient as food is prepared as ordered. Worth waiting for. Favorite cocunut lentil soup."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINHNyMEhREAE",
            "text": "Super dégustation, on a gouté le manti (à la fois la viande et le végétarien). Savoureux, en été, s'asseoir dehors est agréable. Pas loin de la plage. Cela fait dix ans que le NYT n'a pas écrit de critique favorable (toujours visible sur les murs), et tout reste vrai..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cllUaHN3RRAB",
            "text": "THE BEST LAGMAN I HAVE EVER BEEN TASTED! Pumpkin (squash) manti are also very delicious!\nThe atmosphere is welcoming, the staff are considerate and friendly.\nUma is a wonderful chef and so is the lagman chef 🧑‍🍳\nThe best of luck to Uma’s 🇺🇿🇰🇷🇺🇦🇷🇺🇰🇿"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdk1LbGV3EAE",
            "text": "Had the labne salad and plov. Really good with fresh ingredients. Helpful waitstaff - even though very busy. Had rioja and it was great accompaniment to the food. Really had a nice time at Uma’s and will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxenJERjl3RRAB",
            "text": "Holy cow. Traditional Uzbekistani food that is perfectly made and a great value. Have looked forward to this for a long time and they didn't disappoint."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURROHV5YzF3RRAB",
            "text": "A big \"Let's go to the Rockaways\" reason. Butternut squash dumplings are to die for. Many of the daily dishes just absolutely wonderful. Portions are large and great for sharing so just have it! Get a bunch of dishes and share! And then there's the beer: Ukrainian, Russian and European! You will not be disappointed."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbXZPdEtREAE",
            "text": "Very cool that they had Ukrainian beer on tap.  Comfortable, airy interior. Attentive service.  The dishes tasted authentic.  I'm a meet eater, so I had a plov and lamb kebabs.  Both dishes were fresh and tasted great. The plov had crispy rice with cooked carrots, generous chunks of melt in your mouth lamb and spices."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4bHI3NnZRRRAB",
            "text": "The best restaurant in the rockaways right now imo. Super friendly staff, delicious food, seating, takeout and close to the beach.\nMany restaurant food differ in quality from indoor to takeout. Not here.\nI only went once or so before the pandemic, but the quality since the pandemic with takeout has been superb. Uma’s has been by far the takeout of highest quality and taste in our rockaways neighborhood.\nThanks so much to their team for providing their services during these months.\nHighly recommended!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRd082ek93EAE",
            "text": "The food is good especially the Samsa\n. For lamb kebab and chicken kebab, it is above the average to be honest. The lamb kebab is 11 dollar per skewer and chicken is 7. The samsa is strongly recommended."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhN05EVkd3EAE",
            "text": "Always enjoy the food here.  The Kabobs and Uma's salad are fabulous.  Also love the plov, palmeni, borscht soup and manti."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1enJmbDZ3RRAB",
            "text": "Unfortunately, the chicken in my Tikka Masala was refrigerator cold, which really turned me off. I told my server, who was super sweet, and he took my plate. He returned with the same plate, just microwaved. I didn’t mind at the time, but it did gross me out a little. The sauce was a different consistency after being heated up. The food was okay, and it was super expensive. I won’t be returning."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURFbXJMaU93EAE",
            "text": "Was so happy to see so many yummy bits for really reasonable prices. My tummy was grateful for all the tea and how filling but light the meal was. I hope to be back soon"
        }
    ],
    "reviews_count": 55
}