{
    "name": "Boardwalk Pizzeria",
    "place_id": "ChIJ25M_emBowokR4_o2VyDYHiw",
    "grid": "QN14",
    "address": "68-20 Rockaway Beach Blvd, Arverne, NY 11692, USA",
    "rating": 4.1,
    "user_ratings_total": 1068,
    "phone_number": "(347) 619-8002",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUU5uTnFTbFJrVURkbFMyZEdaVXQ1WjJkdVZVRRAB",
            "text": "This place is definitely overpriced.\nNow imagine paying an outrageous price of 7 dollars for one slice ONE SLICE no bev no garlic knots nothing. Then have the audacity to charge another $0.35 for using a card and I can promise you I can’t even find prices like that in Manhattan for a slice. Everyone working behind the counter always seems to be in miserable mood honestly the Energy they give off in this place make you not even want pizza anymore. also males bathroom is always out of order and if you wanna wash your hands prepare for freezing cold water 👎🏽"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaVRVaE1kMGR2WDJscU5rSTNjR2x2TUdwU09HYxAB",
            "text": "We’re big pizza lovers and have tried pizza all over New York, so we really wanted to give this place a fair chance. We stopped by a couple of times, but honestly, it left a pretty mixed impression. The staff was… hard to describe — not rude, but not very friendly either. The biggest disappointment was that when we came in to eat, I needed to use the restroom, and they told me it wasn’t working. That was really uncomfortable, especially since we had already ordered our food. A restaurant at this level should really make that a priority. I understand it’s a busy beach area, but still — that’s something they need to figure out. The pizza itself was just average, nothing special, so we don’t plan to come back."
        },
        {
            "date": "3주 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUU1sWkxURU5xYlc1blp6YzNVVkpKWTJodVFsRRAB",
            "text": "Очень вкусно 😋👍"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNExxQUVnEAE",
            "text": "I’ve been here a few times over the years, but just came here to say there’s a cashier in unfamiliar with, maybe she’s new or maybe not, but the only way I can describe is she wears glasses. I only went to pick up my uber eats order, but she was so sweet and welcoming. She was already helping someone out while I was there, but she I offered me another bag as well as utensils in the nicest way and reminded the other customer she was still with her and not to worry when she was taking a while to decide. As a service worker, I think it’s nice to shout out other great service givers!\n\nEditing: Been coming here since they opened, just came back after a while. $7.34 for a subpar buffalo slice is egregious. Won’t return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaFRURlJWV042TkdwNlZVb3ROMjVsUVdwVWJXYxAB",
            "text": "Pizza is good, the Italian old man with the accent needs to have a little more manners when serving customers. In the customer service business you have to be nice to people when you serve them and not throw food at them when it’s ready. As we were leaving my  family and I he yelled at my son to pass him the bottled seasonings that were on the table. I’m sorry my kid doesn’t work there he could have asked nicely or actually got them himself you work there!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSWJUbFNZa0pHTm5WcU1qRmpRMVZTY25VMWFHYxAB",
            "text": "For years, I have ordered 1 or 2 times a week from Boardwalk.  The food I order is not anything extraordinary but I know what they make that I like and have been ordering those items for years.\n\nThis evening, I made a mistake on an online order and called the store to make the correction.  The customer service was abysmal. After I realized the person on the phone was rude and condescending, I asked to speak with the manager (just in case this was a language issue.)  The man identified himself as \"The business owner.\" My ordering error was easily resolved but his conduct was very off-putting.\n\nWhile waiting for my delicious grandma pie and chicken roll, I did a quick google search of reviews and found many people have been treated poorly by this man.\n\nI spend thousands of dollars here each year on their delicious grandma pies, fried calamari, and chicken rolls.\n\nSadly, this will be my last order from Boardwalk.\n\n(Also, their delivery drivers have always been awesome!)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bk1tcHVSV056YlVSTlVIcEtkM3B4WlVkcE5tYxAB",
            "text": "I sat with my Godson(8yrs) while he ate 2 slices of pizza. Not crowded & it was clean"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGd1pqWnhhRlozWWxaWmFVeENOSE5YVldsS1IwRRAB",
            "text": "Pizza so delicious that although I am well-known for and love my homemade pizza, I haven’t made any in the 10 months since we moved to the area. The service is friendly and efficient, and they make to order if they’ve run out of one’s preference. We are yet to try their expansive non-pizza menu … it’s literally unpassable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMWNHcHdNVEZrZVhSV1kwVmxUVUpOTm1WUmVuYxAB",
            "text": "The guy behind the counter has no patience!\nThe Yung lady behind the counter was friendly and trying her best but the owner/manager was just yelling at her for no reason."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KT1luQlZRMGxSU1ZWSU5qZ3dOM2x0ZW5nNFozYxAB",
            "text": "Nice pizza but little bit more expensive than regular places."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUlFrdzVRWGc1WTJWVFVGTkxRM1ZSVlVZdFpVRRAB",
            "text": "The pizza here was wayyyy better than I expected. Sizes were a bit smaller than the typical NY slice but it was so good. The taste and the crust were pretty much perfect. I think we'll order a whole pie next time and just absolutely crush it. However, the order of french fries we got was absolute trash. It was soggy and soft and not one single piece had any crisp to it whatsoever. Half the fries barely even had any color to it. It was like they just microwaved a bunch of frozen fries. Tasted like a bunch of boiled potato strips. This was without a doubt the worst fries I have ever had in my entire life. My kids were looking forward to some tasty fries on the beach but instead they had to be subjected to this nonsense."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oR1dVSnNkSFF4VW1OeFdtcHZiM3BEZVROSFdGRRAB",
            "text": "The pizza is good but the I feel like all the workers are nice but one. Feels like pure hate and no respect it bothers me because I try be  as respectful as I can. It’s not fair that I feel like I’m doing something wrong when I just want to eat and wanted some decent service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jd05tMHRNRmw0YnkxdE9UaFBSRTAzVUdKT1FYYxAB",
            "text": "The cheese pizza was good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdGMyNWZTV2hEUkVSRVUyVmtOalI2YVVSalkzYxAB",
            "text": "Disappointed in this service. You show up at 11am only for pizzas not to be ready until 11:45am (only needed a few slices). Rude and upset staff - ugh just not the best way to start a fun day on the beach. They are also spraying the tables while we are waiting and sitting down. Please be genuine to your paying customers who help keep your business alive."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV1JHcEZZa3hKUlZVd1RraHlSRlpRUVc5RlNHYxAB",
            "text": "The pizza has no taste. A lot more to say, but this is sufficient."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPMzgtYkRXaGRIdFpREAE",
            "text": "Ordered plain slices. Well prepared and so tasty, I didn't get a chance to take a picture, lol."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPV0NqSWVYbk4zUVd3EAE",
            "text": "I travel 1 hour from Long Island to come here for the Chicken Marsala Hero. The marsala sauce is thicker than usua, silky and luxurious. If I lived closer I would be here 5 days a week. Fantastic!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNTHFsNmFEdTRYUnd3RRAB",
            "text": "What happened to your pizza? It used to be so good. Sauce is terrible on the margaritas slice. The cheese on the white slice looks weird. Very disappointed. The only thing good about this place is the young man who served the pizza."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQNnUxSzZna2U3ZGJ3EAE",
            "text": "Costly,but what can you expect from farrockaway. The product was great!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcFpLZ3Z3RRAB",
            "text": "First of all the service was tiring and old. The pizza was old, dry, and very crusty. I can't recommend this place unless you are starving."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdkp6NmpnRRAB",
            "text": "One good thing I will say about this place is that the guy behind the counter was at least unnecessarily disconcerting with everyone and not just me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNksyR013EAE",
            "text": "My experience was seriously disappointing - I wouldn't even give them one star. I asked a coworker to order for me, and I got the Alfredo with fried shrimp. Unfortunately, the food tasted off, and the 'shrimp' didn't quite taste like shrimp. When we called to complain, the manager was rude and argumentative, and it seemed like they weren't interested in resolving the issue. Needless to say, I wouldn't recommend this place to anyone."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b01xWE93EAE",
            "text": "I’ve been coming to this establishment since it came to the Rockaways and was a “big hit”. I usually never leave reviews but more so recently I’m so disappointed with the quality of the pizza and especially the price!  I ordered a pie for pickup, 1/2 with pepperoni and when I arrived to pick up my order, half the slices were so burned and the crust looked old and unappealing! I complained to the person who handled my order and his disposition was very nasty! He made excuses for the pizza being burned and before I could finish explaining myself he kept cutting me off. I requested to speak to the manager which he told me “I’m the owner”. Meanwhile, he’s not the person I’m usually used to dealing with who I know to be the owner. Anyhow, he then calms down after telling me I’ll need to wait 30 more minutes for a fresh pie when I told him I only wanted for him to replace the burned pepperoni slices because my child will refuse to eat it!! However, the pizza was so nasty!!! The crust was thin, and it had a burned flavor on the entire pie even those slices that didn’t appear burned with really hard dough!!! I will not be supporting this pizza restaurant anymore!  This is the second time I ordered a pie and it did not meet my expectations! Plus, thr prices are too high for such mediocre food. Very unfortunate and waste of money!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ2V2VzBRRRAB",
            "text": "Pizza crazy good sooo saucy"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaDh5VGN3EAE",
            "text": "Excellent Pizza and Pasta!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdGR6cVdBEAE",
            "text": "This had to be the worst pizza I ever had in my life. I can't verify if anything else is good, but if they can't make a regular slice taste right, I don't want to try anything else tbh."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBamN2NkhBEAE",
            "text": "Great food, great service, great everything!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBd05mNW1nRRAB",
            "text": "The meatball hero is good, but everything on the menu is overpriced in general. In Manhattan, on MacDougal St, I know a place that's been in business approx. 50 years that offers excellent pizza for $3.00 per slice.  Boardwalk's slice is nowhere near as good, and more expensive. You can find various brands of frozen pizza at Stop & Shop instead.  Its $4.99-$5.99 on sale, and far tastier than Boardwalk pizza."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNExMMHZ3RRAB",
            "text": "Approximately a year and half ago the quality and taste of the food fell off dramatically and it is heartbreaking because this was definitely a weekly go to. Especially in an area where there aren't alot of options."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbGRQaFd3EAE",
            "text": "This used to be such a great pizzeria, but recently the quality of food definitely declined and the level of unfriendliness increased. I am guessing the business isn’t going well and the owner spills his frustration on the customers. I really hope that the owner improves the situation, as it would be a pity to lose another local business."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOTlEQVF3EAE",
            "text": "Boardwalk has become one of the worst pizzas, and the customer service for online orders is terrible."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbzhXR29BRRAB",
            "text": "Walked in to get slices on a lunch break. Place was practically dead, no more than 2 people being served. As i walk in i’m looking at the slices waiting to be asked what would I like since both people behind the counter are talking to the 2 customers there. While they’re speaking to the customers, I’m constantly getting looked at and ignored. Like do you want to make a sale or not??? Pizza isn’t even that good to be acting like that. Unfortunately, when you’re in far rock where there isn’t much to eat that is actually good or worth the price, you gotta settle for less. By the time I got my food, my break was nearly over and I had to rush to eat. The pizza ain’t anything special. The service is just slow as hell and it seems like they really don’t want to be working sometimes. Find employees who actually do if that’s the case.No reason to be waiting 10 minutes for a slice or two all the time when the pizza is literally just reheated."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaHNhcmNREAE",
            "text": "Went there for lunch 1 REGULAR slice and a REGULAR bottle water almost $8..NEVER AGAIN"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2ODlEVV93RRAB",
            "text": "Absolutely horrible service for at the counter. Food is really good but shouldn’t be a hassle."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cHQ3ZGl3RRAB",
            "text": "To expensive. This is not midtown but Rockaway Beach, Queens. Charging upwards to $5 for a slice is absurd even taking into account inflation. Even their other plates are $5 or more than competitors. Someone bring these ppl back down to reality!\n\nI blame the gentrifiers and yuppies who have since moved in who enable this highway robbery. We've always had great pizza out her at other places and not as much!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQak5QZ2FnEAE",
            "text": "Waited almost two hours for delivery of one pie .\nFood came cold ."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMi1qcEx3EAE",
            "text": "The pizzas here are great.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOS15Q2hnRRAB",
            "text": "Unfriendly.  Manager make up pricing as he go along."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvb2VLeVpREAE",
            "text": "All I can say is Ummmm, Ummmm, everything is so good ."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaElpUUVnEAE",
            "text": "muy buena pizza"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcV82SEtREAE",
            "text": "Their food is amazingly delicious!  😋  highly recommend their cheese pizza, pepperoni pizza, calamari, and linguine di mare in marinara sauce- we prefer the spaghetti pasta over the linguini. Delivery is typically about an hour, still arrives hot and food is absolutely worth the wait. 😉"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMVp2ZVJnEAE",
            "text": "Great place for pizza-lovers! Big choice, reasonable price, big sizes, freshly-baked, pizza pies are also available.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaDRiMFZ3EAE",
            "text": "Average, OVERPRICED pizza, super STINGY and UNFRIENDLY manager. We bought a whole pie, added 2 extra and he gave us 4 napkins. He even has napkins hidden by the cash register and administers them like prescription medicine. Don't even get me started with the red pepper: one small container for the whole restaurant to share. Even giving us paper cups after purchasing sodas seemed painful for him. He gave us 2 cups for 4 people, saying \"these are my last 2!\" Unbelievable.\nThe pizza is SOOO overpriced for his very THIN SLICES. We purchased a large pie with extra 2 slices added for $50. We didn't have a choice as the kids were hungry. NOT GOING BACK."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNULU1lN3NnRRAB",
            "text": "I usually get something when I’m around here and it’s always been gd but today I walked in and the older gentleman that was there seemed annoyed when I ask him a question, He got mad like he didn’t wanna be there. If you don’t like your job there’s always someone else that’s willing to do your job. Second he proceeded to ring me up and when I told him I was gonna grab a drink he told me that when I was done, ready to check out to come back which was seconds and he decided to ring up someone like it was busy … only two ppl me being one of them.. When I got my pizza it was Luke warm and completely dry like it’s been there since the morning and super greasy and my drink was warm like it didn’t just come out the fridge… for what I paid not worth it and the worst service I ever had …. NEVER AGAIN!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeWNPbkZREAE",
            "text": "Got takeout pizza slice was fresh &tasty, lovely lil joint to have a sit-down as they’ve got outdoor seating✨"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbzRpMVZBEAE",
            "text": "I have to admit this pizza is the BOMB! The sauce definitely has an amazing flavor. Well toasted as I asked for.. 10/10.\nfound my cheat diet 🤪"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjaVlxLURREAE",
            "text": "Pizza was pretty decent I had the chicken bacon ranch slice which was good could have used more ranch tho and the sicilian was pretty decent prices aren't too bad definitely will be back to try more slices"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3X3JUbFVBEAE",
            "text": "I order all the time for my kids. I ordered extra cheese they sent me a burnt pizza. All three pies cost me a hundred and twenty dollars I will drive up to 112 from now on. Owner came on the phone said he do not care. This was my favorite spot guess they not the family business I use to love."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSX2RLa3p3RRAB",
            "text": "Placed an order and asked for an item that they make which was a chicken roll and i wanted to add spinach. The manager advised it isn't something they usually do but be would be able to do it after i advised it is a $50 order. What they did was used a roll that was sitting on the shelf all day and cut it open to add spinach. No cheese on top of it nothing. I called and he bluntly lied and said thats what he told me he was going to do. Which was a lie, i would've said no and to cancel the entire order. He then stated be would never make it ever again and basically was telling me he didn't care what i wanted which i wanted what i paid for. I asked for a refund for the roll he told me no. They will never get another dime from me. Save your money and go to Elegante on 92nd. Better food and better service. If i wanted to drive i would've had it instead of here but decided to give them a chance. Never again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bGJxOTRRRRAB",
            "text": "This is a great place to bring family/friends. It's a short walk from the train station and the restaurant/bathroom was clean with it taking a short while to get our food. Although the food is a bit expensive, the pizza was delicious and so were the jumbo wings. Staff was polite and I definitely would go again. 10/10"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwaU9TNmpRRRAB",
            "text": "Everything I tried has always been delicious. I love their specialty pizzas, but my favorite is the vodka slice. The sauce tastes like I am having a dish of pasta with vodka sauce; extremely flavorful. Of all the vodka slices I have had this is top two for sure !!! Can’t wait to go back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNla3J6NUh3EAE",
            "text": "The best cheesy garlic breadsticks ever!  The staff is also super kind.\n\nTheir grandma's slice has a delicious vodka sauce (the orange slice in the photo), and their crust for the sicilian slices is perfect (the other square slice in the photo).\n\nWe always make sure to stop here before we leave Rockaway so we can bring pizza/breadsticks home with us!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjcDVhRkJnEAE",
            "text": "Honestly some of the worst pizza I have ever had and I ate it fresh + hot...\nThe staff is nice but the food is so bad. The sauce was bland, the grease was out of control, and the crust was dry and not chewy at all. It’s very clear that…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdDgzNF9RRRAB",
            "text": "I ordered a cheese pizza from UberEats. I took 1 hour to arrive 10 miles away. Cost was over $30. It arrived cold and squished. Taste matched the appearance. Please don’t order from this place on UberEats."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbE56cndBRRAB",
            "text": "The best pizza in New York and I live in Staten Island but come all the way over here for the pizza! It’s just that darn good! And here’s the bonus, they make their own ice cream!! I absolutely love this place and no matter how far I am I will CLIMB MOUNTAINS TO get to this food! Don’t take my lil review seriously…… okay I dare you to go try the pizza and ice cream and tell me I’m wrong!! It’s so good! U will keep going back! Just like me, no matter how far I’m coming to eat here!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMzZ5QVF3EAE",
            "text": "This place has a great variety of Pizza and there food menu is pretty solid as well. The food at this place is awesome and delicious andbthe staff if great."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdjRmQkFREAE",
            "text": "I consider them to be the best in the Rockaway. That Penne Ala Vodka Slice is my goto slice."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnLXYtTkxBEAE",
            "text": "Friendly staff, delicious pizza! They have more than just pizza. I'm interested to try their rice ball next time."
        }
    ],
    "reviews_count": 58
}