{
    "name": "Happy Jack's Burger Bar",
    "place_id": "ChIJQ_IIXThpwokRp-ups9bXKiM",
    "grid": "QN14",
    "address": "108-13 Rockaway Beach Dr, Rockaway Park, NY 11694, USA",
    "rating": 4.6,
    "user_ratings_total": 253,
    "phone_number": "(347) 897-6821",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNVdVdEZSamhCTkRNM2NuQllNRXBZVGtKQ1dVRRAB",
            "text": "Great burgers. 🙌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkV1pIVmtZbUpOUVcxck5HUmlPV2MwVTNrMFJsRRAB",
            "text": "Long overdue! Happy Jacks is one of my favorite date night spots and honestly the best food in Rockaway. The martinis are always perfect and the French dip and fries hit every single time. I tell everyone coming to Rockaway that they have to try it. Whether you’re eating there or getting delivery, it’s always top notch. The specials are amazing, the staff is the nicest, and I’ve never had a bad meal here. If I could give them 500 stars, I would. Honestly, it’s one of those places you can never get sick of."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJNFZUSkNVRmxQYjNwMWMzQjFlRFJTZG01T2RVRRAB",
            "text": "Delicious hamburger with juicy meat. They have the Italian beer Peroni, light and refreshing. All at reasonable prices."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMFJsVm5PVGhNZFZKb05taEtNMlp1WDBaWFJsRRAB",
            "text": "Cute and cozy. Service was fast, friendly, and the food was excellent. The menu contains substantial variety for its size."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrM1UyZEthRlYzY0hSNllYWTNPREZPTldoeGRYYxAB",
            "text": "Atmosphere is warm and welcoming.  Staff are lovely and the food is the best I've tasted in a long while."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRllsbG5NR2huVFdjMGQyWnRSMmczU2tORFZtYxAB",
            "text": "Great food and service"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeVYxZFFlSGRxUzNBMFprUTVOa2xHUzJGV1dFRRAB",
            "text": "Вернемся обязательно 🤗"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMU5uYzBPRWhXVTBoUk1rNVhaMjlEYnpoVFVtYxAB",
            "text": "I really love this place this my second time going here and overall me And my bestfriend have a good time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd1EwRnBSak5sWkc1Q04wcE9SbDlqT1V0MVNGRRAB",
            "text": "Great neighborhood chill spot. Good people, good food, good atmosphere,and a great location. A chill beach ⛱️ town neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTWFXUlNlbGN0VVZkd2MzZDVjRVZPVEhWTVowRRAB",
            "text": "We ordered a take out burger, the portions are big, however the food is mid, is not as flavorful as it looks like.\nService was good and the ambiance is nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMlNYTk9jRk5SU1hOSVZGWnZTelo1WlVWT1EyYxAB",
            "text": "Nice bar with very good drinks. Food was ok though I wouldn't come back for the grub. Ordered the loaded nachos but it was too greasy and flavors were off. The wings and burgers were decent"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TE1YSnBTRTExV0dGWWNWSkpTekJ4ZERGRk1HYxAB",
            "text": "Oh my The burgers, fries delicious  onion rings good but a Lil over cooked had sangria it was OK beer nice an cold 🥶 the greeting was welcoming"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcmVwZG1QLU1xeURnEAE",
            "text": "Stopped in for a quick bite to eat.  Sat immediately. Everyone was super friendly and helpful.  Ordered a regular cheese burger w/ FF.  Food and drinks were both great. I would visit again and recommend to anyone else who might be in the area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLLTJoUG1HdDlLeEl3EAE",
            "text": "OMG the best burger ever like EVERRRRRR!! Smoking Jack burger. Pepper jack cheese, crispy thinly fried onion, jalapeño jam!! I can't wait to go back!! The staff is super attentive and sweet and the atmosphere reminded me of my island home land!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZXAzSXpoNmI2LTB3RRAB",
            "text": "It’s just the great neighbourhood place friendly faces and people caruso’s brother is something I’ve never had before so delicious enjoy happy Jack LOL"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOLW4wdGVYX0xhSnFnRRAB",
            "text": "My mom and I had been looking for a spot to grab a quick bite before a show at the Rockaway Hotel, this place was packed and looked inviting so we decided to try it. Walked in and took seats at the bar. Tasty fresh-ground burgers, crispy fries, hearty pours on the drinks, friendly staff, and the service was faster than I expected with how busy it was! We got the smokin’ jack and the irish poutine burgers and definitely enjoyed our picks."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQeXZocWpGNmRLVVBREAE",
            "text": "Yuck. Literally whole day ruined by eating here. Don’t call yourselves a burger bar if you can’t even serve a semi decent burger. Boyfriend had a double burger that came with two tiny thin McDonald’s patties. I had a make your own burger with a huge piece of rubber in the middle that i was supposed to be edible. I was so hungry too… I scarfed down the fries and literally gave my well over done hockey puck to my dog. The server even asked me what temperature I wanted!! Hilarious. I guess Medium at Happy Jacks means no salt and leave it on the grill for an hour. Good luck to these guys!! And to all those who dare stomach the food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VObWI5T2VVd3BLV3VBRRAB",
            "text": "Newly opened.   Clean friendly sandwich shop."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeDU2d3BnRRAB",
            "text": "The homemade Dublinegg rolls were amazing. And the wings, we got a combination of medium sauce and hot honey. Glaze, were amazing. 😋 Can't wait to go back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ajl2R0lREAE",
            "text": "Delicious burgers and awesome drinks! Might go again tomorrow it was that good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bC1uN2RREAE",
            "text": "Love this place !!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUN3ak5SWBAB",
            "text": "The smokin Jack burger was okay not bad. Being from Chicago I’d give it a 6. Atmosphere was good and service was good as well. I would come back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdlBpdmJBEAE",
            "text": "Happy to have found this location this year! Quality eats & drinks. Had a fair sized group gathering here and we all loved the experience. Thank you guys!"
        },
        {
            "date": "11달 전",
            "language": "de",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeTRtUkh3EAE",
            "text": "Sehr laut, aber das Essen ist gut"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzb3NMcWhRRRAB",
            "text": "Went there for the turkey sliders and man were the good . 3 for 16.77$ and they come with natural made potatoes chips.\n\nThey also sell alcoholic drinks ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbGJ1NmZREAE",
            "text": "The hot honey BBQ wings are amazing, love the nachos and great burgers. Fries are crispy, drinks are cheap and delivery is fast and free. My favorite restaurant in Rockaway!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3alBMb1R3EAE",
            "text": "I tried to order online !nd it kept telling me that I am out of range for delivery.  I had deliveries from them many times.  When I tried to call and fix the problem I just got an answering machine over and over.  It's bad enough they are closed more then open and now I can't even get a burger when they are opened.  IT'S TOO BAD THEY ARE THE BEST BURGER AROUND BUT THEY HAVE NOW LOST MY BUSSINESS."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3d1B1alNnEAE",
            "text": "Great spot for lunch, great big wings, side of fries is generous and taste like McDonald's fries."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bDd5RHNBRRAB",
            "text": "Great all around"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cUppUDNnRRAB",
            "text": "Best burger I’ve ever had in my life. I come here every summer not even for the beach or the pool in the hotel it’s for this burger!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieDhUT2VnEAE",
            "text": "My husband and I came here on a whim and it did not disappoint! The wings are to die for, the burger is probably the best I’ve had in a very long time. Let’s not forget the PICKLES ( best you’ve ever tasted) The atmosphere is small but so inviting and cozy and the service was impeccable! I highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaF9fdWlRRRAB",
            "text": "Top Notch Burgers, Pickles and staff is super friendly.  You can tell the owner is passionate about his business! 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicHNDTHdBRRAB",
            "text": "Sliders were bomb. I love that they have pineapple juice. 😅🤷🏻‍♂️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyek55Q2p3RRAB",
            "text": "Excellent burgers if you can find parking. The buns need to be stronger to cope with how juicy the burgers are. Beer battered onion rings are always worth the effort."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybHJuVWN3EAE",
            "text": "Cocktails (Mai Tai and Marguerita),\nbacon cheeseburger, and fries were all very good and a good value for Rockaway Park.  Ella gave us excellent service. She was friendly and consistently preempted our needs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqXzZDLWpnRRAB",
            "text": "Great place for great food. And one of my friends said that it's nice to be out of park slope. And I agreed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdThDUzlnRRAB",
            "text": "Best burger’s in town🍔"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycHBDWjVBRRAB",
            "text": "Vegetarians, Vegans, Spanish and black friends please stay away from this place, you are clearly not welcomed here!!!\nI arrived with my brother on Easter Sunday, the place was empty. We are black Spanish., There were three white males including the owner hanging out in the restaurant. We ordered drinks and were eying the menu for appetizers. I took notice there were no vegan options, so I asked the bartered and the owner what they suggested for me since I’m vegan. The owner, who was accompanied by a female friend, abruptly replied; “This is a burger place we don’t have a vegan option here”. He seemed upset I even asked about any alternatives to meat. They started to laugh and make jokes among themselves. They were clearly bothered by my question to the point that made me think the question wasn’t what bothered them in the first place but perhaps the color of my skin."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5M3BEbW1nRRAB",
            "text": "First time there even tho I've been living in Far Rockaway for almost 20 years!\nI ordered the sliders & wings. My food was delicious and tasted just as good the next day( leftovers). Alyssa was our server, and she was a sweetheart! Courteous and professional. I didn't take pictures of my food but I will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5clBHNDJ3RRAB",
            "text": "Pickle lovers, order extra! Yes the burger presentation is great as others have mentioned but for pickle lovers, you WILL appreciate their homemade, spicy pickles."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyM3V2OFF3EAE",
            "text": "We ate the hamburgers, great flavor, they are really big! It was a good experience.\nGreat service, very gentle.\nThe place is cool and quiet. 💯"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxZ3Nidzl3RRAB",
            "text": "The burgers are quite an experience. There so  juicy with quality meat. The fixings are fresh.  (Lettuce, tomato onion).  The bacon was so thick. It could be served as an appetizer by itself!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNXQ3SWFnEAE",
            "text": "Prices are amazing here, food is exactly what you would expect. Not the GREATEST most earth shattering culinary experience but the atmosphere and staff were all nice. Great place for a drink and hang out."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhZy1tNzFBRRAB",
            "text": "This is such a great little hidden place.  The atmosphere is super cozy and intimate little  burger spot.   The food is pretty delicious.  I LOVE the chicken sliders they really hit the spot.  The Happy Jack burger is also great too.  They also have a bar with a good selection and are located only one block from the beach and ferry."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aTdLdWhBRRAB",
            "text": "Love this place.  Great drinks.  Great service.  The food is always served hot and tasty.   They have specials all the time that are just so delicious."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3LUlYM1RBEAE",
            "text": "Great chill bar, the wings and are great, and the tacos are yummy even if they're not very authentic"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcDdmaEZ3EAE",
            "text": "I revisted after several years and was pleased. The food was very good and priced fair  The servers were excellent.\nThe pizza was really good! The Burger was excellent as well.  Fish Taco was good and I thankful for not frying the fish.\nThe coffee was freshly roasted. This place is a gem."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaC1QYVh3EAE",
            "text": "Great burgers. My dad is usually the one who makes them but credit to the entire staff because they all work hard and are really friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcjd5Sk93EAE",
            "text": "We flooded this bar during a rain storm today. some of the patrons sitting the bar were grumpy towards us. However- The staff and service were incredible.\nThank you for taking us in and serving us delicious drinks and possibly the best nachos we’ve ever had."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5NjhmRnRBRRAB",
            "text": "What an amazing place in Rockaway Beach! I am so happy this is a little local spot that my wife I will now become regulars! We went for the first time today(2/13/21) and the wait staff was amazing my guy knew exactly when to come up to me…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZcGZDMWd3RRAB",
            "text": "Love it very clean very nice lady that took my order love the food kids menu if ya have kids price is ok by food is super good we be back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNaHZIS1dnEAE",
            "text": "Wow! We had such a great time here. The atmosphere was fun, the food was wonderful, the service was perfect, everyone was as nice as possible. We are already talking about when to go back for more. Burgers are the main thing, but there is…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1eC1uajB3RRAB",
            "text": "Nice little Summer place in Rockaway.    I was there yesterday with my girlfriend and the pizza was very good.   Drinks were good too.    I would have had another drink but I ran out of cash. Unfortunately  my bank was not near by.   Staff was very nice too.    I will be back for sure."
        }
    ],
    "reviews_count": 53
}