{
    "name": "Rockaway Beach Surf Club",
    "place_id": "ChIJe-Hu20NowokRWysJh3VyO60",
    "grid": "QN14",
    "address": "3-02 Beach 87th St, Far Rockaway, NY 11693, USA",
    "rating": 4.6,
    "user_ratings_total": 432,
    "phone_number": null,
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUWNrRm9kR2RrVUcxRmN6bElPSG96Wkc1TFVrRRAB",
            "text": "I'm really hopeful that everything will become totally healthy and vegan soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTWFVWlNZbHAyZFMxVFRXMW5Va05OUTJONFVHYxAB",
            "text": "Rockaway Beach Surf Club is a fun spot that is definitely worth checking out. It is a slight hike from the beach, but once you get there it is a great setup, especially if you are with a large group. The vibe leans young and laid-back, and it is conveniently close to the train, which makes it easy to get to even if you are coming in just for the day.\n\nThe food hits the spot after a beach afternoon. The corn was really good, and so were the chips and guac. The taco selection is more limited, so it might not be ideal for picky eaters, but overall it is solid for casual eats. Between the energy, the crowd, and the space, it is the kind of place that makes the beach day feel complete."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMlp6VlVVbVphYzBGU1VUSnRkbkJPVWt0UE1YYxAB",
            "text": "Good tacos chill vibe in the daytime during they week they let me bring my bike in. What can be better"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeldtSmtTbk41ZDE5UlJuZHhORGxrVW5oa00wRRAB",
            "text": "Amazing tofu tacos! Loved the pineapple tea also"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4aFkxa3pUSEV4U2tKSGRrbDVRM2N3YVc1MWMzYxAB",
            "text": "Es un bar de playa, me fusta porque las personas que van a ese lugar son educates, divertidas y respetuosas"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaGVrZHFiMWxzTjBkWWJESXRVVEZ4UkZVeVptYxAB",
            "text": "It's a great experience, sometimes there's even live music. Safe and fun in the sun☀️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMWQzRklWM3BRTWpJM01XSldXRUp6TTA5UlJXYxAB",
            "text": "I had date night with my husband\nYesterday Evening, it’s was a cool vibe we enjoyed the outdoor patio dining area, everyone was enjoying the great weather and it was great to see my old friends again and also to enjoy the fresh fish tacos with the homemade guacamole yummy.\nThey also had a indoor and outdoor flea market going on it was\nA great vibe and the vendors were so nice and friendly they offered vegan pastries and treats they were absolutely delicious.\nThank you Rockaway Beach Surf Club For All The Great Experiences In This Hidden Gem centered on Beach 87st.\nBtw. Please Please bring back .50\nWing’s again they were a great addition to your menu!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOaXhodFcxby1yV2x3RRAB",
            "text": "Excellent service. The bartender was really friendly, I like the Mezcal options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNud3NLVDJnRRAB",
            "text": "The ambiance is cool, the tacos were alright, but the menu is limited (no chicken? shrimp?). And the guacamole was so bland."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbE5MTHd3RRAB",
            "text": "Oh my god, the best tacos you can get in Barack away.. Great atmosphere.. Music.. Cocktails... Just a great place to go.."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cWVPYXlBRRAB",
            "text": "Yummy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdFBLeFZBEAE",
            "text": "This spot is the perfect stop after a day at the beach, or an afternoon lunch. Tacos, live music, great spot."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eF9HWjJ3RRAB",
            "text": "Très sympa fish tacos excellent et jus de fruit !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MjRUVnpnRRAB",
            "text": "I have been coming this place every summer. I was there for a quick lunch today and ordered chips & guacamole with watermelon juice. The chips were like they soak them into a salt pool and serve it after. I couldn’t have the avocado’s taste even( they only meshed the avocado and served with slices of reddish). I paid $25 for all. No more words."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dzdmVWJREAE",
            "text": "Great spot with a taco cart in the back and plenty of seating. Pro tip: order online on your way there to save time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURia2Rua09BEAE",
            "text": "A classic spot that can’t go wrong. Battered fish taco was nice and filling and you get a good amount of chips / guac. People working on the food service side were super friendly and nice, but the bartender couldn’t be bothered and seemed to be having an off day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNieVpxdER3EAE",
            "text": "Great tacos, good vibes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycWVpM29nRRAB",
            "text": "Surf-theme dive bar in close proximity to the only surfable beach in NYC"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6dmZUSVNBEAE",
            "text": "Vibes 10/10, food 12/10, staff was also great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeTVDaC1RRRAB",
            "text": "With surf vibes throughout every, this spot also has some great tacos. Awesome spot to stop after a day of surfing, or just enjoying the beach for some food and a drink."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtaG8zTUNREAE",
            "text": "Wish they would be open Year round!\nENJOY THE HATS!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NnRUdVdBEAE",
            "text": "Legit surf punk bar. Great outdoor space!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPZzk2em5nRRAB",
            "text": "Order placed and enjoyed the clank of the subway as I enjoyed the sunshine.  Shortly my order was done, name called and away I went with a pair of sublime fish tacos with guac!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMjVibTFBRRAB",
            "text": "The spot for after the beach or a little mid day break!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaktYQVdREAE",
            "text": "It's a fun place. We enjoy it. I had been there before with my son Jason Rupp. On Labor Day, I went with three other women to enjoy a reception for the art of the Women Surf Film Festival. Great atmosphere and food. I had a vegan taco plate I shared with friend Raquel. Also, I shared a perfect Pina colada with friend Suki Rae. I also liked my cold and refreshing watermelon 🍉 drink. We four danced (including friend Laurie) to the music of the DJ. Friendly place. Laurie and Raquel ordered and loved their Mexican-style corn 🌽 on the cob. Suki liked the fish taco with all the trimmings. You eat picnic-style. While it is not on the beach,  this spot is worth visiting. Colorful art. All ages would enjoy it here."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwM0pPa2N3EAE",
            "text": "피쉬타코도 맛있고, 맥주도 맛있고"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdk52TzNnRRAB",
            "text": "I’ve never dealt with staff this rude in my entire life."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaktYZFZREAE",
            "text": "Hood vibes and the margaritas are amazing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMThyOXRRRRAB",
            "text": "fantastic spot to eat after the beach. The fish tacos and the elote were spectacular- very filling. The elote had the perfect crunch and was full of flavor. The fish taco transported me to another plane- a transformative experience. Most importantly, Catherine, the hostess, was very kind and joyful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNjlETFV3EAE",
            "text": "Not enough chairs, good tacos."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcHJUWVNnEAE",
            "text": "Feels like Bondi ... which is a really weird feeling"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNDZDNDZBRRAB",
            "text": "The tacos were really good just a little confusing of a system to where if you ordered the plate of 3 tacos you had to pick it up in a separate area right next to the DJ so while you were waiting for your tacos you had to stand next to the speaker. The backyard area was so much fun and open seating which can make it hard for groups. Their pina colada was the perfect after beach drink"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdjV6RTRnRRAB",
            "text": "Fantastic place. The fish tacos are incredible and the Elote was so tasty.\n\nBar is cash for some reason even though the kitchen is all ordered online.\n\nPlenty of tables but they do get cramped fast.\n\nFood and drinks are great though so it’s worth it for the outdoor space."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M051aVZREAE",
            "text": "One of my favorite spots and a must go at the beach! Hard to choose between the fish tacos or the black bean cheese and sweet plantain, both SO good. And the guacamole is fresh and delicious. Add a guava margarita and your good to go."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMVpIUTlRRRAB",
            "text": "Great little hidden germ… Tacos are amazing ( fish and chorizo my favorite) guacamole fresh and chips made in house…\n\nOnly Cash at the Bar! You order over Instagram which I found kinda interesting…\n\nEverything was clean and enough space to let your childs run around. Prices are more than fair… we would come back and recommend this place to everyone. Thanks for the great Hospitality and lunch"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cE5qZGl3RRAB",
            "text": "Had the fish tacos, elote, and pineapple mint drink, everything was fine/good.\n\nYou can order online when you arrive. Taco order was ready when they texted the…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBak9TWkRnEAE",
            "text": "I had a great time at this place on a Friday afternoon! Definitely a hidden gem. Tacoway Beach tacos are right next door/attached! The chorizo tacos were great! They have two drafts: Hanalei Island IPA ($7-awesome) and Mahou ($6-Madrid…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPc3RIWFNnEAE",
            "text": "This place had such great authentic tacos its ridiculous! Super service too, the guy at the door welcoming and explaining everything was great!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbmZQa2JREAE",
            "text": "Wonderful food, great service. I am from Texas and the hot sauce is over the top hot, so be careful you may have a fire you cannot put out! I bought the IPA in a can from the bar. Full bar service, not crowded on a Tuesday after Labor Day. The TVs have surfing."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlZ01xNjBRRRAB",
            "text": "...Surfing beach en Queens..fuimos por ferry hay 2 tipos de pasaje en la tarifa...no es caro...llegando es muy fácil el acceso al mar ...es muyyy extensa de arena blanca y abundante...cielo azul y muchas nubes blancas...y quién no quiere estar al lado del mar?♡•••muy bonita•••"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRZ0ltRV9BRRAB",
            "text": "The food is worth the long line. Trust me. The food served is not authentic Mexican food by any means, but they serve some bomb ass Tofu and fish tacos. I was there this afternoon and there wasn't a line. But when I went two weeks ago on a…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdzdTN2ZBEAE",
            "text": "Really good fish tacos. Feels like you’re in California, and then you get transported back to NY with the subway overhead. Super chill place and a great stop on a beach day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybzVQNHh3RRAB",
            "text": "Went to a small wedding party here, the folks were awesome with a total Surf/ Skate vibe. The black bean/ plantain taco was out of this universe!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4a1BiN2x3RRAB",
            "text": "Best fish tacos and margaritas around. Seating is limited so get there early, if you can."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNrcmIzamZREAE",
            "text": "Hidden gem! Chill place to have a great fresh healthy snack and a drink. Great tacos , elote loco (grilled corn w/ crema) fresh chips plantains and guacamole.  Cash only but on premises atm."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRODk2SGtnRRAB",
            "text": "Everything was so fresh. Taco's were awesome. I only wish they were open a little later in the evening."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMXF5UDJ3RRAB",
            "text": "This place is fun with a laid back atmosphere. No summer would be complete without a trip to the Rockaway Beach Surf Club."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NmR1UGJnEAE",
            "text": "Busy line to get your order food weekend. But food is good. Price is right."
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3ME9Pd0ZnEAE",
            "text": "This was a great little place. The people were very nice there. The food was amazing. Me and my brother got the fish Taco with guacamole, and it just was wonderful. Can't say a lot about the decor, but it looked nice outside. :)"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURROTY2dHB3RRAB",
            "text": "I genuinely love this place. The beer is good and priced right, the atmosphere is fun, the people are happy and friendly. I love the fish tacos and the guacamole and the salsa .... Just all around perfect. After dark there are some fun surf…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1a3JLMnB3RRAB",
            "text": "Really cool beach vibes, and the fish tacos are some of the best I’ve had. Gets a little busy though could use some more seating inside in my opinion, but great if you can grab a seat!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBX0wtZWhnRRAB",
            "text": "Really cool spot with great food but the last two times I've been there it was so crowded you could barely move and had to wait 30 minutes to order. Go at off times. Amazing fish tacos and margaritas."
        }
    ],
    "reviews_count": 52
}