{
    "name": "Harbor Light Pub",
    "place_id": "ChIJI1Vnin1CwokRjfjKIC3stV4",
    "grid": "QN14",
    "address": "129-18 Newport Ave, Rockaway Park, NY 11694, USA",
    "rating": 4.7,
    "user_ratings_total": 299,
    "phone_number": "(718) 474-2202",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMlZrcERZVzF3VjJnNFNrSm5ORGxhWW5JMFpuYxAB",
            "text": "Really dug this place. Didn't eat, but stayed for quite a few beers. Vibes were good, regular customers were chill, and Mike was a top notch bartender."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sc0xVMUNhRkF5ZEhSTFJUZFdOMWxCY21WalRsRRAB",
            "text": "Perfect gem in this neighborhood. I visited for the first time last night and I thoroughly enjoyed my experience.\nI sat at the bar and Matt made a perfect martini, (slightly dirty).\nI ordered the wedge salad and French onion soup. Both delicious. I took home the meatloaf on special with mashed potatoes and broccoli. It was delicious and enough for a few meals.\nThe portions are very good and you can’t beat the prices.\nDefinitely recommend and I will return when I’m in the neighborhood."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twR1NWTkdkamRoVjNGbE5VVk5NVEl4VWtKSVJXYxAB",
            "text": "Was over from Dublin, Ireland, and stopped in for a few drinks and food.\nGreat spot"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbDhtWVdnEAE",
            "text": "We had baked clam delicious (minced) salmon with vegetables chicken parmesan 😁 great service highly recommend 😁"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJeUx0ZUNjdzk3aEFnEAE",
            "text": "The Staff is really nice & very friendly they are on the top of their game. Food is even better I have always had Great meals I can’t say enough their cooks are fantastic. The Prices are very fair . I really enjoy coming to the Harbor Light & will be back many more times."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMGNPa2ZnEAE",
            "text": "Great place for a family meal."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdk5LSTd3RRAB",
            "text": "Very nice place.I would highly recommend it"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOHBiNTBnRRAB",
            "text": "Delicious"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmd3JIdnF3RRAB",
            "text": "Great service. Fish was perfect. Fries were crunchy  and not overly spiced. Perfect dining experience"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmemF2Ri1nRRAB",
            "text": "Service ,atmosphere  was great!! As well as the food.. nice hometown pub"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMmZDR053EAE",
            "text": "this place was always a neighborhood staple with good food at very reasonable prices and since its after Sandy redesign its even a more enjoyable place to eat. its inerior design is now reminiscent of the Snug Harbor restaurant that was demolished to make way for the b108 hotel. i love the steak tidbits, sheperds pie, and chicken parm, but all their dishes are really good and the service is also great."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dk5UeW1RRRAB",
            "text": "Great local food and service at a a reasonable price. Consistently good."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzOXVhdW1BRRAB",
            "text": "Beautiful restaurant, very attentive service and great food"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHai1paWp3RRAB",
            "text": "Harbor Light has been a neighborhood staple for decades.  The menu selection is simple and satisfying.  The food is always good and comforting.  The place is new and beautiful after being reconstructed after Hurricane Sandy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNV9icUZBEAE",
            "text": "Great food and fast and friendly service. Our server Annie made us feel like we were family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ0otbjlBRRAB",
            "text": "We had a very nice lunch. The staff was  very sweet."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyazhiR1NREAE",
            "text": "Great staff food was excellent Recommend the swordfish,shepherd pie and excellent scallops  baked clams were good but to big."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aXY3YU13EAE",
            "text": "Great...!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MTRhNkRREAE",
            "text": "This was my first time here and hopefully not my last. The food was EXCELLENT!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMTkyVGFBEAE",
            "text": "Excellent - food, company & atmosphere"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREamFUaEl3EAE",
            "text": "My favorite go to place.  Food is always good, American-style menu.  Great hearty burgers with many varieties. Drinks are reasonably priced and staff is very friendly, efficient and accommodating.  Look for dinner specials each night of the week.  Brunch is quite popular, omelettes are the size of the plate.  Best brunch around, outdoor seating a vailable as well.  Enjoy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbWJydndRRRAB",
            "text": "Good vibe, nice place. Good comfort food. If you are at the bar it is cash only."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdHVtRDBBRRAB",
            "text": "My first time back in Rockaway since Sandy so it was nice to see the wonderful rebuild they have done with the Harbor light. The food is a 3 for me, wholesome but a little on the bland side. Customer service however is a 5."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdk1MbmhBRRAB",
            "text": "Harbor light was good.Everytime  I go the is very nice and yes the food is great 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcEltSDB3RRAB",
            "text": "We go often.   Excellent"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzbGRhOXV3RRAB",
            "text": "Great service. Beautiful bar. Can't wait for the summer."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdU5TSmFREAE",
            "text": "Great place to be ! Family,friends !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5aGVmdzVRRRAB",
            "text": "Great Fish and Chips on Friday night during lent. The staff is always friendly and efficient!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0X2ZHNjBRRRAB",
            "text": "Amazing and friendly service and food.  We felt like family by the time we left."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0eTdHSkZREAE",
            "text": "Ham and cheese sandwich was great. Service was friendly and patient. Not rushing us. Great place to get together with friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROeHFyekhBEAE",
            "text": "Emmakay was one of the best waitress’s, can’t wait to go back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdl9DTDZBRRAB",
            "text": "**Indoor dining during COVID pandemic\n\nLayout/atmosphere:\n*Steep steps to the entrance door; patio tables: U-shaped bar; dining room with tables\n\nService\n*Good\n\nFood/drink\n*Broccoli cheddar bites - good\n*Buffalo wings (medium) - good\n*Garlic bread - Good; toasted\n*1/2 LB Cheese Burger (Swiss) with french fries - good\n*Chicken francese with rice - good\n*Turkey dinner (stuffing, potato/mashed & vegetable/creamed spinach) - Good; large portion; flavorful gravy"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTaUlXc0tnEAE",
            "text": "We stopped for lunch on this rainy dsy seeking comfort food.... and we found it at harbor light oub in the Rockaways. Friendly staff. Temp checks, sign-ins, hand sanitizer ready, and social distancing observed. Our waitress was very…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwLWZ6aVJ3EAE",
            "text": "Everything we tried was great. We got a few appetizers and split the steak tidbits and honestly the steak tidbits made the whole meal. I recommend the garlic bread, the wedge salad was good, the French onion soup for sure. The soup was the perfect serving size and was delicious. The onions were soft and flavorful and the cheese was generous. The steak tidbits were the bets part of the meal. The steak was cooked perfectly with buttery garlic bread and another healthy cheese coating. I highly recommend a good meal with a great environment for both dining and then at the bar. They have barn doors to separate the two areas which was nice for noise reduction from the bar. It was very cozy in the dining area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4enYtQTdnRRAB",
            "text": "A small oasis in an area of mediocre food. Good bar food with a staff that pays attention.  Decent menu and moderate prices. Very small parking lot. Street parking but watch the weekend rules during the summer. Will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1bm9EelZ3EAE",
            "text": "Completely uncooked in army uniform sweet potato hunks not fries\nBarry bland Philly cheesesteak blend chicken\nBut the worst part it completely will uncooked sweet potatoes\nAlso chick not probably trimmed chicken fatty piece has lot of fat not cooked properly"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNHY3a29RRRAB",
            "text": "Good and fast service. Food was delicious. Place looks great and clean."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1a1ByWXhnRRAB",
            "text": "Another great meal here! We enjoyed the fall specials and my son loved their chicken in a basket. He ordered a second for home. The service was top notch. They make you feel as though you are family. We will definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaVpxWHNBRRAB",
            "text": "I had a wonderful experience dining here last weekend! It was my first time visiting the Harbor Light Pub, but the group I was with shared so many wonderful stories of their occasions spent here over the years. The place was bustling with…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDMUlIakRREAE",
            "text": "Harbor Light was extremely pleasant and enjoyable! I had a very nice dinner with my siblings and boyfriend for outdoor seating and it was great! The drinks were very tasty, not too major, and the food was very delicious! I recommend the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1eUpISUdBEAE",
            "text": "If I could give this place more than 5 stars I would. I don’t live in the neighborhood but would still make this my neighborhood bar. Jim was very welcoming and made me feel at home. The ambiance is great and the people genuine. Food loks great if you are looking for dinner there is plenty of space for the family. A must if you are in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbWJmYkdREAE",
            "text": "Visiting town years after moving away.  What a storied gem - so happy to see it thriving after all the restaurant and neighborhood has been through!\nNeat to see the menu hasnt changed - it brought me back in time!\nHope they get they neighborhood support the need and deserve.  This place is a wonderful classic!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaUp1M0pBEAE",
            "text": "I’d always heard great things about this place and it didn’t disappoint one bit. Everyone working there was so friendly and attentive starting with the valet, then the hostess and our server - such nice people. The food was delicious for…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNHUyUnB3RRAB",
            "text": "Sunday afternoon close to 2 PM. First visit. I called ahead to ask if reservations were needed and was offered a table for 2. Nice start. We arrived, indicated we’d just called. Welcome was warm and we were seated immediately. Long wait to place our order - “sorry short a waiter”. Really??  Then close a section!  Support people were very stressed and bumbling. Finally placed our order. Long wait again. Both plates arrived as ordered - sadly, the eggs Florentine - stone cold. Sent back - betting the bus person walked in the kitchen put the plate under a warming light, counted to 10 and brought it back - still not hot. Finally the wait person indicated the order would be redone. It was. The plate was finally hot and the food at least warm with the 3rd try.  Not the outing we anticipated and we now know that there is no need to go back or to recommend to friends.  So disappointed!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMExhNFRBEAE",
            "text": "No frills, just good food and very affordable. the staff were friendly, the beer was ice cold! call ahead and reserve a table, (recommended). food didn't take long to prepare. Hidden gem, lived in rockaway for over 30 years and visited for the first time this past weekend. Going for brunch this soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdnNqQWpnRRAB",
            "text": "Amazing food.  Haven't been here in a very long time a d it's only gotten better!  Had the Chicken Cordon Bleu and it was incredible.\n\nI suggest calling ahead if you plan to come on the dinner rush.\n\nGreat place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoM3VXQnRBRRAB",
            "text": "My family spent a day out in the Rockaways for our kids soccer games and we had some time between games so we decided to get a bite to eat at the Harbor Light.  I must say the food was awesome.  For starters, my wife and I had the Caesar Salad which was really good.  The salad was very fresh, tasty and had the perfect amount of dressing on it. I also ordered the French Onion Soup which was outstanding. I thought about ordering another portion but held only because I knew my main course was on the way.  For my main course I ordered the Blue Ribbon steak.  I asked for medium and it was cooked to perfection.  The meat was a very good cut and the portion was generous.  For her main course, my wife ordered the Shrimp Scampi.  She was very happy with it.  I of course tried some and yes,  it was really good.  My daughters each ordered a hamburger with fries and pizza.  They loved the food and ate it all.   We skipped the desert only because my younger daughter had a soccer game an hour later and she had already eaten a lot.  The service  was also excellent.  Our waiter was very friendly and attentive to all our needs. If you're ever in the Belle Harbor area or Rockaway in general, and looking for a place to eat,  I highly recommend this place.  Our lunch at the Harbor Light was, by far, the highlight of the day as both my daughters respective soccer teams got walloped by some tough Rockaway teams that Sunday. We drove back home to northern Queens very content because we at least had a great meal that day !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGdmZQU2x3RRAB",
            "text": "It's a pub. But I have to say, the have a real home style feel and taste their cooking.  They did an Octoberfest menu during pre Halloween week with viener schnitzel and goulash and other dishes which were delicious, reasonably priced and generous portions.  Their standard fare in burgers, steaks seafood and bar apps is also really good.  You won't be disappointed."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNcVlpTWFREAE",
            "text": "Everything was great.There we're 15 people eating together and I only heard people complain about the turnips and mashed potatoes\ndidn't taste the same . They added something to them.\nOur waitress was Awesome, she was right on top of the\ndrink orders and anything. Else we needed.\nI would return tomorrow if I could. No dissatisfied customers. Love the Harbor Light. Welcome Home!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNNmJTdzRRRRAB",
            "text": "So impressed at the new Harbor Light! Especially to decor, using all recycled lumber on the Bar, floor, walls ceiling. Food and service was wonderful! We had a turkey dinner and other great favorites were still on the menu! What an asset to Rockaway! All the Best!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNi1YS1V3EAE",
            "text": "A great place to grab some food and drink and just chill and relax. The wings are among the best I have ever had. The Guinness is great for washing them down. The dinner meals are always perfect. Highly recommend, take the whole family here.."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNMlpUYWxBRRAB",
            "text": "This was beautifully redone after the ravages of hurricane Sandy.  It is clear that they paid attention to details.  It is fully handicapped accessible thanks to a brand new lift in the front.  The staff was friendly and merry (I was there the week before Christmas) and it was decorated nicely.  I had a delicious scallop dish with vegetables on the side.\n\nThe establishment only takes cash, but there is an ATM in the bar for those who need it.  There is a parking lot in the back which is a nice bonus.  If you haven't been in since the renovation,  you should stop in and check it out! You won't be sorry."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwa1BPVUtnEAE",
            "text": "Best Food, Best Drinks, Best People!!!\nSo delighted the doors are soft open today.\nLove this place.\nLoved working there in the 90's.\nMiss being there today but I will see it soon.\nALL THE BEST - THINKING OF YOU ALL!\nI hope the wait for a table is an hour every night for the next year.\nSharon O'Donnell"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4aXN5NmZnEAE",
            "text": "Agust 1 2021 sat over 20 minutes no service at all no excuse at all they pass me by few times never never never again will be here again allways a costumer before the they burnout"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldWRMSU9BEAE",
            "text": "Great atmosphere, casual wear is fine.  Generous portions.  Very fair pricing given the inflation of the last year. I'd return without a question.  Nice bar also,  with TV for the games."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNlpiaEh3EAE",
            "text": "Awesome neighborhood pub where a stranger will buy you a beer along with the best stuffed shrimp with crab meat Ive had in years. Brings me back to my childhood living on Long Island eating the freshest seafood with my dad. Now I do it with my son in Rockaway Beach."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxLS1Pa2ZREAE",
            "text": "So glad Harbor Light is open again. A staple restaurant in the neighborhood. Locally known great for family gatherings, brunch, Sunday football etc. Food is really good and reasonably priced. A party of 10 ran about $40 a head including a…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzd3FTdDJBRRAB",
            "text": "First time back after re opening.\nStopped in late on a Friday night with a few neighbors and so glad we did !\nFood was GREAT .....young Ryan( our server)  was an absolute pleasure, the menu was bot too big which is nice , the prices were reasinable. and the new decor is beautuful !!\nFelt like the old neighborhood gathering place it used to be."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdnFPT0lnEAE",
            "text": "Fantastic food and staff! Just look how happy my daughters are!!"
        }
    ],
    "reviews_count": 59
}