{
    "name": "Beach Dunes Eats & Arts",
    "place_id": "ChIJ93xgL_RpwokRdGkpmFFWYzk",
    "grid": "QN14",
    "address": "45-19 Rockaway Beach Blvd, Far Rockaway, NY 11691, USA",
    "rating": 4.4,
    "user_ratings_total": 79,
    "phone_number": "(929) 484-2233",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeVEzRTRPSEU0U0hKQldtUmxhRXQ0U1ZsblFtYxAB",
            "text": "Food was great and filling. Will definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbmRYTnZlQzFLV0VjeWFYcERaMU5pYzBKS1kxRRAB",
            "text": "Great for someone who doesn’t really like cold things"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rM2IyNDNXVXRtY1RWT2RHbHBZWFJyZFhCRFltYxAB",
            "text": "Great food and friendly service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORlZHdFVZWFEwVkZScVIwRnpNMVI2ZW1nemJIYxAB",
            "text": "Very good food and ambulance. I love that it is associated with Campaign Against Hunger organization."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cd2NqWlBOV0pqZVdaUFZqZzVibmxXY1V3eE5XYxAB",
            "text": "This place is a joke , they’re  always out of stock , closes before their posted business hours & stops making food when ever they feel like it …on top the of that staff is unwelcoming and rude"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJakx5eVN3EAE",
            "text": "The Breakfast was good , Amazing I read the reviews and it was way better than anticipated I don’t usually write reviews .I even called them to let them know. The French toast in particular is hands-down the best French toast I have ever had and I am a foodie. I like to think of myself as a food connoisseur. I usually share my leftovers with my kids or my dad cause I don’t eat all my food, but I saved half of my food for later lol"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURua3BQSERBEAE",
            "text": "Mushroom Avocado toast was really good!  Yum. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbHZiWVN3EAE",
            "text": "After watching a Birthday Sunrise 🌅 We dropped in for Breakfast and it was delicious 🤤\nThe French Toast and Homefries, etc. The service was great. I really enjoyed the meal and atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dDdDSmhnRRAB",
            "text": "This restaurant has tasty food in good portions at good prices. I liked their salmon, mac and cheese, and sweet potato fries, as well as their sorrel ginger juice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeWRyZHFnRRAB",
            "text": "So confused by the good reviews. Walked in at 3pm on a Friday and it was empty, they \"didn't have\" 3 of the 4 menu items we asked for and it took 15 minutes to get reheated mac n cheese.\n\nIt's cute, but the \"farmers market\" is just bottles of grocery store condiments and some pieces of art. I literally don't understand what this place is supposed to be 😂\n\nMaybe it's a breakfast spot?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNnZuTDd3RRAB",
            "text": "The food was delicious I attend my little cousins graduation and the food is amazing. There’s not to may restaurant la in this area I am glad they are here I will order judo chick with mac and cheese with veggies again . Thank you for the experience !! Also the have a culinary program for 18 to 24-year-olds to get certified in food family. It is a very nice local store/ restaurant./ program . This. Is place is amazing for the community!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNm9tc2d3RRAB",
            "text": "Staff was very polite and helpful regarding the food. Since I have food allergies, my questions were answered about the fish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqelBHZ1B3EAE",
            "text": "I'm truly disappointed in their catering service, I've been inquiring for months for a catering menu and pricing. I was told pricing wasn't available because they were in the process of a pricing change. I waited and called back a few times. I even came by with one of my members to order a regular takeout and food wasn't available that day either.\nI also inquired about the menu once again, and the pricing still was available. I left my name and # and never got a call back.\nTherefore our order was placed at SUNNY'S in Far Rockaway, and also at 101 Deli Rockaway Beach. What makes it so bad I spoke so highly of the Dune's, and the two day event was right there on 34th St on April 5th and 6th.\nI really like their food, but things has changed considerably."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENGVuaDZRRRAB",
            "text": "Uno dei posti più carini e di qualità che abbiamo trovato in New York, perfetto dopo una camminata in spiaggia! Ottimo cibo cotto al momento, ottimo personale gentilissimo! Consigliatissimo!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5anAzUkhBEAE",
            "text": "The food here not only made my family and I  sick, but also had horrible service. We were served without utensils or napkins. We even  had to return lots of our food because it was inedible. I highly recommend NOT to come."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5b3Rfek9BEAE",
            "text": "Caribbean."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dHFuZFRBEAE",
            "text": "It’s so great to have a breakfast/lunch spot like this in Edgemere. The menu is like a fusion of American & Caribbean cuisines, which reflects the neighborhood nicely. There’s vegetarian options too. And the team does a great job at supporting the community.\n\nI do think the prices are high, considering the neighborhood and sometimes the wait can be a bit long."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsenNYOWlRRRAB",
            "text": "I stop in for a Jamaican breakfast and it was delicious.  The presentation made it appealing and I enjoyed it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNjk3X25nRRAB",
            "text": "I am pleasantly surprised by the quality of the food and the packaging. This has undoubtedly been the best breakfast I have ever ordered from any place in Far Rockaway. While my breakfast may be considered simple (eggs, toast, homefries, and turkey bacon), it's evident that the chef or establishment prioritizes the customer experience. The food was not only delicious but also meticulously packaged – it was evident that they didn't cut corners on the packaging quality. Each item was carefully placed in its container, which I truly appreciate. Looking at their menu, it's clear that they offer a wide range of options. I'm definitely excited to explore more dishes from their menu in the future!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaFBIa3Z3RRAB",
            "text": "Food was really good...service wasn't great"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaU9tRXRBRRAB",
            "text": "I came here with my friend because of the good reviews and how many stars the restaurant has. However, my experience was unpleasant. I entered the restaurant and the first red flag was how long I had to wait to place my order. There was no one at the counter. Once I ordered my food it took approximately 40 minutes to get my food. The food was good. The restaurant looks nice inside. However, the customer service sucks. The set up of the restaurant also sucks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaUluTTB3RRAB",
            "text": "Customer service and professionalism is greatly lacking here. Took us 45 minutes to actually get our food. Breakfast food should not take that long. And that is after several inquiries. The staff saw nothing wrong this and never apologized. They walk away from you when you’re talking to them. Maybe not intentionally rude but definitely lacking customer service skills. They collected payment before we actually ate so we had no choice but to wait. When the food arrived it was good but certainly not worth all the drama. It’s a shame because the place gave me good vibes when I arrived."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bi1mQjBnRRAB",
            "text": "Best place to stop by for breakfast before hitting the beach. Seriously the best sausage, egg and cheese sando I’ve had. Will be back!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoeGVLUWtnRRAB",
            "text": "Tell your so called HEAD CHEF: Learn etiquette and how to speak to your customers. These days restaurants, staff and owners alike think they can speak to paying customers how EVER they feel. You made an error with my delivery via Uber Eats.  The ONLY option was to fix this minor issue, be apologetic and I would have walked over literally 2 blocks away.  Instead, typical black caribbean people with no manners and chose to be ignorant and proceed to an argument. Then tried to gaslight on his end, when I was silent on my end of the phone. He wanted whoever was on his end in the restaurant to think I was cussing him out over the phone because they couldn't hear me. I am wise to that game. In the end the food was disgusting in any case. PLUS I ORDERED EGGS OVER MEDIUM, WE RECEIVED SCRAMBLE EGGS WITH CHEESE,  WHO TOLD YOU WE WANTED CHEESE. READ YOUR UBER RECEIPTS. SO, if the HEAD CHEF can't read or have integrity, that's an issue. My husband gave the salmon to our dog, she just walked away. He threw all the food out. We are not eating from a place like this."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoaHUzUm5nRRAB",
            "text": "Beautiful! Best cup of coffee I ever had. I don't know what they did, but it was great. Nice community meeting up spot."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNmVhek9BEAE",
            "text": "I've only tried a sausage, egg, and cheese sandwich, and a coffee, but felt compelled to leave a review.\n\nIf you are thinking of trying this place, please do. The peninsula - no, the world - needs more places like this.\n\nAn earlier review mentioned a scant amount of bacon on their sandwich. I did not have a similar experience. In fact, my sandwich had two sausage patties.\n\nThe coffee was delicious too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoaU82M0p3EAE",
            "text": "My wife picked up some breakfast from this place today and i'm at a loss for words.  Absolutely delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCMDVlZDZnRRAB",
            "text": "This is a great place to get a bite to eat before you head to Rockaway beach. We love the fact that the ingredients are from urban farms from local farms and products from local businesses. We ordered their Brisket Burger. The bun was soft, the burger was juicy and the lettuce and tomato tasted super fresh! We were so happy that we even ordered a chicken wrap to go and ate it at the beach."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtaGY2LTV3RRAB",
            "text": "Great service and the chefs are amazing… can’t wait for them to have more food and drink options."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQteUk2SGpBRRAB",
            "text": "I love the food I just come downstairs  for my breakfast  THE best decision  far Rockaway  has ever made"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNTVPd2pBRRAB",
            "text": "Enjoy the Food , Beautifully  Decorated"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOS1XeXFnRRAB",
            "text": "Love this place, the food is amazing and excellent customer service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlOV9IUWJ3EAE",
            "text": "The food is fresh and tastes excellent! Love the farmers market decor❤️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcC1lRnRnRRAB",
            "text": "The food was excellent😋 along with the amazing staff.  Kudos to Chef Charlene.  You ROCK🤩"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcDc3NHR3RRAB",
            "text": "Wonderful atmosphere great food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNU9YT1F3EAE",
            "text": "The energy is great from the moment that you walk through the door and  the restaurant has nice esthetic. I ordered the Grilled salmon with Jerk sauce and they did not disappoint, they weren’t skimpy with the salmon or plate size💯 The Mac and cheese has cheddar and crunch."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXXzhIcmZnEAE",
            "text": "I’m excited to have a new location to order from in the Rockaway’s.\n\nI only have one concern and that is the very minimal bacon in both sandwiches I ordered. Literally can see in the photos a thin line/spots of bacon. I won’t let that be a deterrent because I’m willing to order again and see if the same result. Can never slack on that bacon.\n\nMy Fiancee had the platter and she loved the French Toast, she said it had so much flavor without syrup needed. I’m glad she enjoyed her meal thats for sure. Could’ve snag a photo since she dug in so quickly, I will next time.\n\nI’ll be ordering again soon in the near future. Again glad to have a new location to order from in the Rockaway’s!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdmY2Vml3RRAB",
            "text": "I'm always excited to have new food options open on this side of town. Since they've opened, I've visited several times, and I've consistently been greeted by warm and welcoming staff and have enjoyed my meal every visit. It's great to have…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtM2EtTTJRRRAB",
            "text": "I found this place serendipitously and I can happily say that I am ready to become a regular! Not only is the food absolutely define the staff there is friendly and excited to be there. There energy is infectious!\n\nI strongly recommend stopping in for a quick bite to eat or a coffee."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHcC1yS3pBRRAB",
            "text": "Great space great food and with amazing staff who love being there."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1aVluOXlRRRAB",
            "text": "We decided to take a working lunch here and were so impressed by the quality of the food. We'll definitely be back. The jerk wings and fries were my favorite."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MmV5Wk93EAE",
            "text": "The salad with spicy sticky wings were delicious. I really enjoyed it. First time there and I wasn't upset. Going back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOS1qWlR3EAE",
            "text": "Every neighborhood needs a spot like this! You all set the tone of warm, welcoming & serving delicious healthy eats! This is my summer spot by the beach"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtaHJQV2V3EAE",
            "text": "I loved the food and the Sorrel drink! A much-needed awesome place in the neighborhood! Keep it up, guys!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cXNXWnNBRRAB",
            "text": "Food was amazing,  I love this place. One of my new favorites."
        }
    ],
    "reviews_count": 45
}