{
    "name": "The Rooftop at The Rockaway Hotel",
    "place_id": "ChIJDZG9uwVpwokRaU32c9b0YHQ",
    "grid": "QN14",
    "address": "108-10 Rockaway Beach Dr, Queens, NY 11694, USA",
    "rating": 4.7,
    "user_ratings_total": 228,
    "phone_number": "(718) 489-8914",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVFRETkVOVGxKUlRSWlZFWlhhekZXUzNkbVFuYxAB",
            "text": "Always a favorite! Friendly bartenders, quality food and drinks, and views of both the beach and bay (try to catch the sunset!). Lovely for a date night. Highly recommend!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTFpraDRjSEJZTlhoMk1ITjNhalU0WTFwSE5IYxAB",
            "text": "great drinks"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdmRGaGZPVVkxTVU1RU4yWkxSMGRNU0hONlRsRRAB",
            "text": "Drinks, food and service are amazing! Also can’t beat the views! Will definitely be back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTFdtOWxkR2xRUVV4U2RsOVZaRzluYzA5VlRVRRAB",
            "text": "Best staff I’ve ever seen"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMFRuaGlOa2RUWkY5dmVHTXdZbmRxVTNFdFNsRRAB",
            "text": "Couldn’t recommend this place more! Such a fun vibe and unbeatable sunset views. Cocktails are 10/10 and the food is so fresh and delicious. Manager Tara was beyond hospitable and helped make this experience wonderful. Can’t wait to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRVZ6RTNhVFZ3WW5ZNVJXTTVNMXB1YlY4M1NtYxAB",
            "text": "Everything was awesome the drinks and food were really tasty and delicious. The bartender Taz made great suggestions and was really friendly !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJd2NsaHVlVmRmVkd4RWJrODVaak52TUVrd1dtYxAB",
            "text": "love it so much the staff is so professional and amazing 10/10 on everything! could not recommend more, food was so greatttt"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRmNVSXRYekJGVDB4RlEwNWZOMWhCVUMwMWVrRRAB",
            "text": "we had the most amazing sunset after enjoying the super warm heated pool and sauna downstairs. The roof top is definitely the best place to watch the end of the day with views of both the Atlantic on one side and skyline of Manhattan and BK over the bay on the other.  The custom cocktails we asked for were spot on and all the food was delicious.  Especially the oysters, which we had to order another round of"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sR1YwcEdiVEUxUzBGWmRUWkVlWFJYV2xWeVZIYxAB",
            "text": "Love this place! Food is amazing, staff is great and the views are to die for"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMldVNXhVWEJ5UVRFM1JYSjJUbDluVW05S1NYYxAB",
            "text": "Spectacular views, incredible service, Fantastically Friendly. A Must Do !!!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeVF6WTJkbUZFTXpoblJuTndSVEJyTjJsbFoyYxAB",
            "text": "Excelente"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscVlYb3dUR1F5Y1RGdVMyRllTbWh3TldOQ1luYxAB",
            "text": "Excellent service and great atmosphere 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CR05tTk1TSE53VldKMGNYWmpTbFJZVkY5TWNIYxAB",
            "text": "I want to thank the Rockaway Hotel for a spectacular event held this past weekend. I want to specifically shout out to Christina R for her expertise and diligence with the party planning. The food was exceptional and our guests are still letting us know how good the food was. We were on the rooftop and the beach and bay view are the best around. Can't wait to have another event here. Thanks to all who helped to make this event memorable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NFpVRm1VbnBJWkc1bFIySlFOamxMUldzek1XYxAB",
            "text": "Alexa was very personable, fun, and friendly. Had an excellent experience and she was super professional. It was a great atmosphere and vibe here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWVpXb3pOa1kwU3pST1VGQkNibXN3YzBoYVdYYxAB",
            "text": "Alexa is the best server ever.  She very professional and also friendly at the same time. Will definitely be coming back because of her great service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSR1RtTlBUR1ZCV25wRE1GUmpPSFZ5UzE5d01VRRAB",
            "text": "Best Rooftop Ever. Vibes IMMACULATE"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNFUwUnNMWEpMZDFodFFqWkxXRzF2TVhsUVIwRRAB",
            "text": "This place has amazing food and great energy"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVmFWUjFkME5YVkdRemRUVTNjREZHYlVaWmJXYxAB",
            "text": "such an awesome environment :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRU1FZGtUazlXTUhsUlFrRnhlVTQ0ZDBGaVZuYxAB",
            "text": "Great cocktails !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRVVXWnpUMnN5TURadFN5MHdWSHBrTFdOeVluYxAB",
            "text": "Tara has been amazing! The food is incredible"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aZlRGQmtXVWxIZWxRNWRURjFiVVpMVW1wa1NYYxAB",
            "text": "The Rockaway Hotel is absolutely incredible. Rob, the Director of F&B, is an amazing human being and made sure we felt completely taken care of. The entire property is stunning - from the pool and rooftop to the thoughtfully designed rooms and welcoming lobby. The staff is incredibly friendly, the food is fantastic (no surprise given In Good Company Hospitality is behind it), and the live music by the pool was the perfect touch. My wife and I had an amazing weekend and we’ll definitely be back. Perfect for a weekend getaway. Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKV2JrcENWR2xHUkZKdFRtSXRRa1ptY21GeGMwRRAB",
            "text": "An excellent place to watch the sunset and enjoy some cocktails."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNFMxODBPSHAzTVdKVFptbEZiM2xrZHpJd1MxRRAB",
            "text": "Love this spot! Makes me wish it was summer all year long. I hope they keep it open over fall/ winter"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMlVucEhjVnB5YW5CUFRGcEdXSEpFV1RGYVNVRRAB",
            "text": "Great food and drinks, incredible sunset!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMU9WbzBUR001WlUxbFpGbEdOV2wwZGxSRWIxRRAB",
            "text": "View was Great, as well as the service and food.  The sunset was beautiful and enjoyed watching it set with a glass of wine… Cheers!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scFJuUnRiVUkyVWsxeFprcEpiMjVTWkdzd00wRRAB",
            "text": "Perfect place for drinks, food, and views! Steps away from the Rockaway beach and ferry. We went here before our concert at the hotel but the menu was delicious! Shared the crispy rice, boas and guac. Would come again if in Rockaway."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRVVHaGFXSFZVUXpocWVtMVJjVk0xWVhab1FYYxAB",
            "text": "Very delicious bites while enjoying some booze  while  looking at the most beautiful skyline of NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200dFFUZFlVREp0VG05MlpGQnVUa2xSTTNOMWRVRRAB",
            "text": "The food was fresh\nThe music and vibe rocked\nThe service was friendly and swift\nLove this place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaZlJWaHlaVVpHUTNoUU9VUlBXbmR2TTNCU1ZGRRAB",
            "text": "Incredible venue and amazing service. Absolutely loved it here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bFJEQlFjblkyYVZOTFRqSXpTbVZGVVdzNE5HYxAB",
            "text": "Great seafood / Asian fusion dining with views of the bay and NYC. Perfect beach, rooftop vibes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRWExaEZhbWh3VW5OVGFrNTJNSFJxYUU5SVJYYxAB",
            "text": "Sunset on the rooftop is always amazing.  It was so nice to enjoy an evening out of cocktails and light bites while enjoying the sunset.  The tuna crisp is always my favorite!  Tyler always brings a smile with his attentive service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcmMycEhVa1UzVjJ4MU9YbzNZekZqU1hSME9HYxAB",
            "text": "Amazing!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUlduTmpZMVZKV1drd0xVZzNaMDlTYjBWVE1XYxAB",
            "text": "Wonderful rooftop dinner. We had 7:45pm reservations so we could enjoy the sunset. It was an amazing experience and view. The food was delicious. Overall great food, service and amazing views of manhattan, the beach."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNlZteFBRMlZQY2s1MU5HZEdRWG8wVjA4elpYYxAB",
            "text": "What a great night my wife Jean and I had at the Rooftop. Incredible views, fabulous food and the service was truly impeccable. If you are looking for a great experience the Rooftop is certainly the place to go. The manager Tara was right on top of everything to ensure our night was a pleasant experience. Thank you Tara and we will be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TlkwTmtSbE40UW14RlRXWnNSM0UyUmxSM1VuYxAB",
            "text": "Both the food and drinks were amazing. Cool environment and great music. Tara and Kieran made sure we had an incredible experience and it truly was. Definitely coming back when we are in this area!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oa1p6WktZbmMxVEd4a1ozZG5WVTFLZW5kWGJYYxAB",
            "text": "Food and service were excellent as well as the drinks!! Highly recommend!! Tara and Kieran are the best!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMFZYZFViVWRoVDJWb1RVZHhkVVJhU21sWlkzYxAB",
            "text": "Could use some more options"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTWVHVkJTWHBOZGtORFlYZGlSREExV0dOaVVYYxAB",
            "text": "Fun rooftop patio experience in the Rockaways. Great day escape from Manhattan !!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWFFVWk5SME5VVGtSRlUzQTFjbEp5UTFKVE0yYxAB",
            "text": "This place is great! Everything was incredible. The atmosphere, the vibe, the decor, the food, the views, the drinks! Our waiter, Tyler, was very patient with us because we were a large and rowdy group. And the manager, Tara, was very attentive and amazing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRWNFWlVZbmx5TW5OalFUZHVTVTVZY3pGdVkzYxAB",
            "text": "We had an amazing evening at The Rockaway Hotel rooftop! We arrived just before sunset on Sunday and the views were absolutely stunning—you can see the skyline across the water, which made the whole atmosphere feel really special.\n\nWe ordered oysters, caviar, tuna crispy rice and white fish crudo—all incredibly fresh and beautifully presented. Every bite was delicious. The drinks were also on point—crafted well and balanced, perfect for a summer evening.\n\nThe vibes were unbeatable. There was a live DJ playing a great set, and the energy on the rooftop was high—people were up and dancing, but it still felt relaxed and classy.\n\nService was top notch. Our waiter was super attentive and friendly, and Tara, the manager, personally stopped by to check in, which was a really nice touch.\n\nDefinitely recommend for a sunset dinner or night out with friends. Can’t wait to go back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWU1FVkdhMUV4TVdsb1FrdHhkbGhwU0VaaU9WRRAB",
            "text": "The Rockaway Hotel is an absolute hidden gem that won't stay hidden for long. Every single staff member we met was incredibly friendly and truly excellent at their job. We felt completely transported to a luxury resort and spa vacation – seriously! The rooftop food and drinks were fantastic, and the venue stage where we saw The Milk Carton Kids was the perfect blend of intimate and super cool. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vM09XcHFkRWt5WVVWQkxXRldjMDFXYmxoS04yYxAB",
            "text": "We were there during the big storm last night and the servers were so attentive and made sure we were comfortable and enjoying ourselves. The food was excellent as were the drinks. Look forward to going back. Upside to storm is we got a great sunset and view."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSb1h6ZHRjV2MzZVhZeVVGaEtTMjQxYlZKdVNIYxAB",
            "text": "Came up here to escape the rain for a bit, ended up having a wonderful dinner with a lovely view. Our server, Andrew, what a guy! He recommended their signature “Sharkbite” cocktail and the tuna crispy rice but also don’t sleep on their Heatwave or lobster crispy rice. WOW! Will be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWVFVZzVTa2xLWVVoa2EzZFVRbnAzVXpsYVUxRRAB",
            "text": "The fact that this rooftop exists next to the beach 45 from nyc makes me the happiest. My summer weekend go to! The vibe, the food on the roof, the drinks and the staff all makes this place super special!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcWJIUmhXWGhZZW0xYWFETnZTa0ZhYzJaMVdFRRAB",
            "text": "This is a must try place in the heart of Rockaway . Friendly greeting at the entrance followed with Caitie’s phenomenal service. My girl friend and I shared Crispy Rice Tier,hard to tell which one of those dishes was the best, they were all mouth watering. Special thanks to Rockaway Hotel The Rooftop’s family, Chef and the Manager for their attentive job.  Extremely recommended"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGYVNYcEhWV1V4V0c4d1gyZzJVMU5EVlhsWVZXYxAB",
            "text": "Loved it all!!!!\nBeautiful views,  amazing service, fresh food and a fun atmosphere!!\nHad a blast at Middle Aged Dad Jam Band!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bFExWmZMVVUxVTJoeE0xaDZNVVZSUmtwdlgxRRAB",
            "text": "My team and I produced a small rooftop event with the help of The Roof At The Rockaway staff, and it was AMAZING.\n\n🍣🍹Starting with the food/drink: The food is a fusion of mostly small handheld bites with an Asian influence. The food was fresh and delicious- definitely get the crunchy tuna if you’re a fish fan! The drinks were killer, really enjoyed their selection. No beer on tap but they had perfect seaside options and really tasty cocktails. I particularly enjoyed the “Shark Bite” - A spicy tequila cocktail with tajin. 🦈✨\n\n👥👥 Now for the real heart of this spot, the Staff: The Director, Tara, could not be more lovely and efficient. She made sure that we had the most ideal set up, and worked with us on everything we needed, including a city view and turning down music in our segmented location to support our particular needs. Carla front of house supported with all of my questions, orders and helped me to field all incoming guests, treating them with so much kindness. She helped immensely as we rolled through the night. There were two servers that helped also helped us order and get food out while still managing the rest of the restaurant- not a single mistake or issue the whole night!! They were fantastic (I am sorry I forget their names!!). WOW, what an awesome serving staff. Last but certainly NOT least, Jenna and Manny at the bar absolutely CRUSHED it. We had a lot of people, and organizing an event with a drink limit is never any easy task 😂😅 When we ran into a snag on our end, they jumped in and helped, kept us well informed and made sure all our needs were not just met, but exceeded. And the drinks remained quality the entire time.\n\nMost local, close knit vibes are reserved for the curbs bellied up to their respective establishments. It’s not often in Manhattan or any adjacent rooftop bar with a high end atmosphere, that you get an emotionally local experience. Although I reside in Astoria, I felt like a neighbor and a friend at The Roof At The Rockaway. I will undoubtedly be back with friends/family or for a weekend getaway. Either way, this spot will be a guaranteed incredible time and a must-visit.\n\nThanks again to The Roof team!!! Excellent work; I’m excited to see you again soon!! 🌊🏄‍♀️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kb1dGVkVlakUxVUZSd2NVTlJNR2g0WmxjM2NGRRAB",
            "text": "if i could give more than a five star review, i would. the view from the rooftop is one of the best in rockaway. the food was incredible and perfect for sharing, drinks were delicious, service was off the charts; staff was attentive, kind, and made the overall dining experience more enjoyable with their caring nature and attention to every detail. can’t wait to go back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMlRUZG5WbFV6T0ZNdFZXMDVSa2xvWDFGbmVYYxAB",
            "text": "We had Manny as our bartender and he was fabulous! My fiance and I got the spicy tuna roll and a few cocktails - everything was amazing. Such a good vibe and atmosphere on the rooftop!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcE0xbDNiMGsyWjA1WFJXOHljQzFMTTFkeFFrRRAB",
            "text": "So I’m chilling here on the rooftop with Tara one of the best managers a Restaurant could offer. She’s explaining all the great things about the hotel. Life is good. I’m sharing a great time. I couldn’t ask for a better time than being in the Rockaway hotel Rockaway Beach Queens, New York."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMmVrMVhRM0pQTXpsQ05WRTRSa1ZEUlZsS1RIYxAB",
            "text": "Always have fun here with my friends!! And just a minute walk from the ferry which is perfect"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xST1Vrb3djalJVWmxOMVdtMUtUazVwYld0c1FWRRAB",
            "text": "The service was amazing. Everybody was so nice and both the food and drinks came really fast! great view the rooftop is the best spot! loved coming here at sunset ! make sure not to miss the elevator !!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1eVlQblJBEAE",
            "text": "I came here for day drinking. On the outdoor roof top. The atmosphere is great. The staff was very friendly and professional. The cocktails and food were very good! Not to mention the veil is spectacular!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214blNFMWpXRXRmZVZKVFJXZ3hWRkE1ZGpKVFNtYxAB",
            "text": "A perfect setting for a summer evening. The food and service were both excellent. The hotel is gorgeous and the rooftop restaurant was amazing. You should definitely visit!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1b1JEQmxkRXBvTUVjd09XNVNPVzlKZGpjdE1GRRAB",
            "text": "Katie was lovely and very helpful. Apparently I had accidentally indicated I wanted to sit inside which I didn’t and the hostess kindly seated us outside. First time at The Rockaway Hotel and wont be my last!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsemFHdG9iWE5hU0dwTFFWaE1ZUzFUWld0UE9VRRAB",
            "text": "A friend suggested we meet here for drinks—and we ended up staying for 5 hours! That should tell you something. The service is truly top tier. When we arrived, the place was mellow with just a few people, but as the night picked up and the crowd rolled in and the staff didn’t miss a beat.\n\nOur server, Katie, was phenomenal—warm, attentive, and made excellent recommendations. She read the room (and us!) perfectly. Knew when to chat and when to give us space. That’s the mark of a pro.\n\nPatrick, the manager, was incredibly accommodating. When a dish didn’t quite hit, he spotted it immediately, took it off the bill without hesitation, and had a replacement brought up from the restaurant downstairs. That’s top-tier hospitality.\n\nEven the hostess greeted us like we were old friends, and the busboy was friendly as well. Lately hospitality workers try and make you feel like it’s a privilege to be there. The Rooftop\nreminded me of New York in the early 2000s Everyone was happy to be there and everyone understood the vibes!\n\nLater in the evening, a DJ came on and started\nwith old school R&B then picked up the pace and kept the energy high. Looking around, everyone was dancing, laughing, vibing. It felt good.\n\nThe rooftop view is lovely with a nice ocean breeze. The drinks were well-balanced and flavorful. We tried the furikake dip with house chips, miso avocado, tuna crispy rice, bao buns, and wings—everything was fresh, full of flavor, and perfectly cooked. I even brought home a Margie’s Burger for my daughter and she devoured it.\n\nSpecial shoutout to Glen—he set the gold standard in hospitality. Truly.\n\nThere are thousands of places to go in NYC, and I try new ones often. But great energy and service like this? That’s what makes me a regular.\n\nGo. It’s worth the trip!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdzcteU9nEAE",
            "text": "The Hotel Rooftop is fabulous and great touch to the new Rockaway Hotel.  You can pick you choice of ocean views or views of Jamaica Bay with amazing sunsets.  The drink menu has a nice selection and the light eats and raw bar are great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScFZtbDZSWHBFTVV3dGRFTldTMjFqTmprMlJrRRAB",
            "text": "Great food, service, and views! Joel took amazing care of us at the bar today and was so kind! It made our experience that much better."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwZmR5MU5XbmxGTW1Kd1RVeHBNRXcxWTJsWVZHYxAB",
            "text": "The manager Tara and waiter Tyler were fantastic with the service. We could not have been happier with the amazing bites, drinks, and gorgeous view!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJdGRrbHNZMHBQWkhwcGJVUjBkemwwVTJWbE1uYxAB",
            "text": "5 stars!!   Food was great. And we were very well taken care of by Tyler and Tara!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1eHJEUnBnRRAB",
            "text": "The bartenders were attentive and polite, nice crowd here. Not too crowded for a weekend. I got crispy rice topped with poke and let me tell you I could eat about 50 of them. The drinks were delicious too, my favorite place to dine by the rockaway beach thus far."
        }
    ],
    "reviews_count": 61
}