{
    "name": "Batesy’s BBQ and Bar",
    "place_id": "ChIJD3uLBJlpwokRBycOKSmlSIk",
    "grid": "QN14",
    "address": "68-20F Rockaway Beach Blvd, Arverne, NY 11692, USA",
    "rating": 4.5,
    "user_ratings_total": 337,
    "phone_number": "(929) 343-5593",
    "reviews": [
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3M1YyZGFWMGxwYjJOWlIwVmlhVXh0YmxJM0xWRRAB",
            "text": "We were recommended this place by a friend. We came at non-peak time, so can't speak for atmosphere and service when it's busy but we loved it here.  Service excellent.  Corn bread AMAZING. We ordered a cocktail not on the menu and they were happy to help. We ended up ordering food to go,  even though we had just popped in for a drink and a snack."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMGIwSm5VekJFTjJ0SWQySnJTa1ZzZUhZM1JXYxAB",
            "text": "Fantastic. I felt like I was at an actual bbq with family 🍗🍟"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaGJHSjBhSEl5UlhKdVZrNVVRVFJLY20xSk9WRRAB",
            "text": "Great small businesses in Far Roc"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bVFURTVXSFpFY1RObVpVWlRNa2czT0V4VE9IYxAB",
            "text": "love this place! the food is so good and the service is great as well!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMGRHeHlNMWgxYTNrM1dGZ3dVSHBhU0ZKR2ExRRAB",
            "text": "Went on a Saturday aftenoon, nice atmosphere. Staff was lovely and attentive  ordered ribs,  wings  and crab cakes.  Crab cakes were little wonderful. Seasoned bites,  wings were tender my friends order the parmasean flavor.. not my liking  but the wings were tender and the ribs were my  favorite.  I.like spicy so i.put more pepper sauce on mine.   The cocktails are great as well.  Howver they charged me for the cherries  because they prepare their own cherries.  I  will certainly  go back but no cherries plz."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MGRIRldlVTlOTm5rek1sVkpSRUZFYUY4elNIYxAB",
            "text": "For the first time today, I ordered a delicious sliced smoked brisket sandwich with coleslaw and pickles along with sautéed greens.  The brisket was tender and delicious and the greens were scrumptious.  I will absolutely order from Batesy's again.  It was a perfect meal for a Sunday afternoon after church.Yummmmmmm!!\nIn addition,  the delivery was timely and the delivery person was pleasant.  Thank you Batesy's!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0V1dqRkNjbWN3VWpKRlpVZFdWeTFpV1ROdlFVRRAB",
            "text": "The service was amazing and they were very accommodating with our son. Everything came out quick and fresh. It was our first time but we will for sure be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVGJrSXdUWEJvTm5CR1IwaE5WRGhxVTI5VWVsRRAB",
            "text": "Batesy’s BBQ and bar just earned themselves two life long customers. My boyfriend and I decided to come eat here after spending sometime on the boardwalk and we really enjoyed our meal and drinks. We had the brisket cheese fries, Grilled shrimp skewer and half a rack of St. Louis style ribs. Everything was amazing and so flavorful. Even the drinks were on point we had the pico margarita and jack black (I definitely recommend trying it) The owner Chris and waiter Sebastian were also very nice, warm and welcoming ❤️ we really appreciated their hospitality and we will definitely be coming back with our family and friends."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRVlUaFhSR3AwY1hKUWRFTmlNRkZ5WlVWZmJFRRAB",
            "text": "Tasty drinks!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taS1lWZE9aakpzTVhCVldscG5RVGxhY2w5WFpsRRAB",
            "text": "Its getting harder to find quality casual restaurants but Batesy's is a real gem.  Great food, healthy options, fast no-nonsense service.  I look forward to coming back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bFJXSllVVWxaVDBsSlpIQXpNa1JtVTJ3elVXYxAB",
            "text": "This review is long overdue! Friendly service and food so delicious, whether dine-in or delivery orders. We love the pork ribs, pulled pork, chicken wings and brisket with potato salad or fries, but are often done eating before we think of taking pictures. Will rectify that soon. Their hilarious sidewalk boards literally coax you in as you will see."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMlNqQTJVa2xqV0dOSU5HVktZV3N4V1V4aFFWRRAB",
            "text": "Great restaurant by the beach.  This is in those developments by the subway.  They have a big menu including some tasty looking bbq.  I really really wanted to try it but I was really in the mood for a hamburger.  Service was friendly and quick.  The ambiance is friendly and beachy"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUFVsOU5VV1pWTm1SRVNVUk9YeTFoTFVaS1NtYxAB",
            "text": "Best bbq i have ever had. It’s out of this world"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSWEwNXFOWEp6TFhoalNFSmZUWE5sYTFoeU1rRRAB",
            "text": "Batesy’s is a place I always return to every summer for their frozen Hennessy coladas! They are blended to creamy perfection every time, and the bold flavors of pineapple and coconut are supreme. The great thing about this place is that you can take them to go, so we always bring them to the water for a refreshing beverage while basking in the sun!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRU5scHhOamRaYnkxMk9HMWhVM1Z2Yld0Q2RVRRAB",
            "text": "Awesome vibe"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZM05UUmtURXd0UkdOQmRrVlllbFZyT0U0dFRuYxAB",
            "text": "Unsure why half a rack of ribs is only 5 ribs but they’re damn good regardless lol delivery people are nice, maybe stay away from the Mac lol frequent rebuy on the ribs fr"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBNWR6QXhXVmxSU0hWa09HdExhSGQ0VjJGNFdYYxAB",
            "text": "I have ordered multiple times from this restaurant through Urber Eats. The food is delicious. I have had the smoked brisket sandwich, smoked brisket meat, Mac and cheese, French fries and. Key Lime pie."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMmVHbFJREAE",
            "text": "My Wife and I went to Batesy's.  We had been away because of poor service. I have to say, the poor service issue was corrected.\n\nWe had a great time! We will be back.\n\nOh, the Key Lime Pie... to die for!! You must order it!!\n\nBatesy's team. Thank you"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNDQyTndRRRAB",
            "text": "Great good and drinks!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfazlYVnFRRRAB",
            "text": "The pastrami was to die for"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeHZUQ3NnRRAB",
            "text": "Small cozy diner sometimes there's music on the weekend excellent time visit you'll enjoy it"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaUlMYVR3EAE",
            "text": "Great place for family and friends"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaHVHZW9RRRAB",
            "text": "This is my third time ordering Batesy’s Bbq and the first two times I ordered food, it was delicious. Today I ordered the same meat, smoked brisket and I was more than disappointed. The sliced brisket I ordered was sitting in a container with more oil and fat than actual meat. I also ordered the Coleslaw and it was over dressed with mayonnaise, more than I had last month. I don’t think I will be returning, I am turnef off. I’m not sure if maybe because I ordered to go is the reason I was given all of the fat of the brisket, but I am unhappy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQOEtESEtnEAE",
            "text": "We love everything about this establishment! The food is excellent, the drinks are awesome, the atmosphere is magical, the owners and staff are very sweet and attentive. We’re proud to say that we are frequent buyers!\npssst… Friday nights with, “DJ Seany” is a vibe…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbnFMNTd3RRAB",
            "text": "I enjoy this location. The staff is amazing and very friendly. The Staff Sabastian, Chris, Liz, Mercedes, Matt and Tim are great. Wonderful personalities. Friday night Hip-Hop & R&B night has become my favorite decompression from a long work week. The DJ knows his music well. The atmosphere is a real vibe. I am a pescatarian, so I am limited in my food selection. The Impossible Burger and Tuscan Kale salad are my go-to items. The Crab Cakes for brunch is not a bad choice as well. It's nice to have a local spot to relax, eat and have a drink. Would recommend a visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYc3FmVUJREAE",
            "text": "I really enjoyed the meal here, Their menu looks great and I hope to try other items in the future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMnRhWHJBRRAB",
            "text": "I’ve been here twice and both times I had a great time. I ordered the Henny colada both times and their wings with the Bourban sauce amazing!!!! One of my top recommended sit down and eat/ drink dine in bar/ restaurants."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdHVQSUlnEAE",
            "text": "My son lives near here and wanted to eat there. The food was gross. The brisket didn’t taste like anything. The burger was so greasy it stained my shirt. Also didn’t taste like anything. My grandson  who ordered fries and chicken didn’t eat. So I tasted his fries worse fries ever. Not a kid friendly menu. I’m done I got that out of my system. Oh one more thing everything is sold a la cart so I paid a ridiculous price for garbage food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIaXJTbnBRRRAB",
            "text": "I go here often. Food is always good, drinks are delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3OFpxZDBBRRAB",
            "text": "Excellent happy hour and even more excellent henny cooladas. Food is great too ;)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNmJXSE53EAE",
            "text": "Best bbq in the rockaways.  Definitely a weekly spot for us!  The staff is always friendly, and CHRIS always makes sure your order is perfect, accurate, delivered with a smile……\n\nI eat here once or twice a week and recently had my first issue (they forgot an item).  Chris made sure that it was hand delivered to me that same day shortly after I called.\n\nReally a stand up establishment that wants you to enjoy what you’re eating\n\nShrimp sandwich is TO DIE FOR\nBANG BANG CHIX SANDWICH is AMAZING\nWell done fries are always seasoned and crisp to perfection\nChicken tenders are SO good and filling\nTuscan kale salad is always fresh, crisp and flavorful with Parmesan cheese !\nCatfish delicious\nThe mini crab cakes (they’re a special) are made with real crab meat and packed full of.  Tons of flavor in all their food !\n\nThank you Batesys for never disappointing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOG9TUUJ3EAE",
            "text": "Staff is so friendly and food was amazing. Definitely coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOHRqVS13RRAB",
            "text": "Ordered a catfish sandwich, and fries.  Never again, the fish was greasy, hard, there was no fish, just a greasy hard outer shell, with no recognizable fish insides.  The fries were soggy, some even stuck together , and under cooked.  I just threw the whole meal away.  I wouldn’t feed it to a dog!\nTotally disgusting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNk9UQklnEAE",
            "text": "This restaurant and bar has a very modern layout. Lots of draft beers available. I loved how the BBQ meats were available in 5 oz sizes, instead of just the usual 1/4 lb, 1/2 lb, etc. This let me try different meats while just visiting solo. They also have a vast selection of sides. I had the excellent slaw and mac and cheese. Right off B67 St subway station too. I''m going to be visiting on more of my Rockaway trips!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOUxPbDNnRRAB",
            "text": "Love it here!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyeWY3N0lREAE",
            "text": "Classic BBQ in Rockaway. This got me through a 4th of July fix for sure. It wasn’t anything like life changing incredible, but it wasn’t like “I wouldn’t go here again.”\n\nIt’s perfect for: I’ve been at the beach all day and I’m craving some American BBQ.\n\nRibs were good, nice sauce and they slid off the bone. The wings are good as well, not that spicy. The cornbread was delicious, coleslaw was normal, sautéed greens were kale / broccolini w garlic, and corn was corn.\n\nOur host was very nice and helped us pick a cocktail when we were indecisive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyZzZhQmN3EAE",
            "text": "Food was delicious!!!! And the service was awesome:)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOWVERW9nRRAB",
            "text": "One of my favorite spots. Great drinks and their crab cakes are too die for!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyb1l2dDZRRRAB",
            "text": "Great food, great service! I love Batesy’s! Only wish I’d found it sooner. Great brisket, excellent chicken sandwich, excellent fries, solid cocktails. Can’t wait to go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMalB5VXd3RRAB",
            "text": "Excellent ! Never disappoints !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaDhHR0V3EAE",
            "text": "The staff was really accommodating and friendly! We were greeted right away and received our drinks and food pretty fast.\nThe food is very cheap compared to other places in the city. I got the brisket sandwich with a side of Mac and cheese.\nThe brisket could’ve been seasoned more. It didn’t really do it for me.\nWould love to come back and try other items on the menu. Mac and cheese was really good though!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4XzcyY1VBEAE",
            "text": "2.5 🌟 if I could but being the meal was more on the 3 side I rounded up.\n$45+tx+delivery = $56 order\nThis is suppose to be a BBQ place.\n\nPortion and flavor was definitely NOT worth the price. The sauce ALONE made the meal. Meal was to be smoked but only taste/smell that in the sauce, not meat, even though faint as though liquid smoke was the only thing used. Food texture was soft, edible, but there were no flavor. Seems the same cut that was used for the ribs was used for the pulled pork which everyone knows it shouldn't be. The corn was sprinkled with paprika and butter and was FRESH to the taste and \"oily\", where's the flavor? The cornbread was full of corn and butter (very buttery) with no flavors beyond that. The fries were soggy and not at all crunchy or tasted fresh. Meal came room temp, the most, it's summer right now and delivery person delivered item on time with no delay."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeTl1eEdnEAE",
            "text": "Love this place.  The bang bang chicken sandwich is incredible.  The corn bread is some of the best around and I love the deviled eggs too.   Also a great cocktail menu.  Give the Southerner a try!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNllYakxBEAE",
            "text": "Batesy’s BBQ and Bar was the perfect stop for lunch after a three mile stroll on the boardwalk.  These first timers were exploring and decided on Batesy’s.  What a good choice.  Gerard greeted us immediately and was very hospitable.  He and Chris provided us with exceptional service.  We ordered the Batesy’s Beach Box which was enough food for three people and of great value.  The corn on the cob could’ve cooked a little longer but OMG the cornbread, the brisket, chicken and the St. Louis ribs were delicious!  The cornbread was served with a side of butter that when drizzled atop the cornbread it made for a mouthwatering experience.  My companion shared that the Henny Colada was superb🤩. While the patio would have been perfect, we decided to dine inside with the diverse restaurant goers.  Batesy’s has a wonderful staff, good food and a great location!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNzVxSXF3RRAB",
            "text": "Cool bar, small but cozy. Tried the brisket sandwich or should I say extra fatty trim sandwich. Nope! Didn’t request untrimmed brisket, so maybe specify that or you’ll get a 6 oz brisket fat sandwich. I had to trim it myself. Heart attacks are not my thing. The fries are $3.50 extra to add on after 3 pm during the week. You get a lot in a small paper bag for to go orders. Otherwise it’s $2 during lunch to add to a sandwich. Standalone is $5 in store. The fries I got tasted like they were fried fresh any other day but the day I bought them. It seemed like they were refried to rekindle the heat on them. Never tasted anything like it. Horrible. So, first impression is not very positive. This cannot be the best they have to offer."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1M3RyMWdRRRAB",
            "text": "Fantastic, hit the spot! Ordered the Beach Box to the Beach. Friendly staff called to check on my order then came back with utensils when they realized we were on the beach. Some of the best BBW North of Texas. 4 of us shared the box with…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2N2I2UVVREAE",
            "text": "Absolutely love this place!! If you want a nice quality restaurant, don't hesitate to come here. Their food and drinks are so well made and tasty, it makes you want to come back again and again. Their henny coladas are incredible, as well…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbF96LVF3EAE",
            "text": "I came here a few times, and all I can say is that the food was delicious!! You need to order their wings!! I literally go on ubereats on a lazy Saturday night and order my wings because they're great size, and the seasoning is on point!! If you like a sweet drink, definitely get the Jolly Ranch!! The waiter that took care of us twice was very kind and sweet. I'm sorry I forgot your name, but I definitely remember how you look. It is a small restaurant, but during the spring, summer, and fall, they have tables outside. I highly recommend this restaurant!! That's a video of my daughter enjoying those jumbo wings...!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNMmMzLWdRRRAB",
            "text": "I ordered the chicken Sandwich and my girl got a burger. To me personally the CS was good, just needed a bit more flavor but my girl enjoyed her burger."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwdVpXMjNRRRAB",
            "text": "Amazing food and amazing service. If I could give more starts I would. Its a unique self-service full service restaurant and the place is beautiful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsZ2FHb0xBEAE",
            "text": "Layout/atmosphere\n*Christmas lights, beads in the window; bar area with three TVs; five tables; tables on sidewalk\n\nService\n*Friendly\n\nFood/drink\n*Sliced Brisket Sandwich (cole slaw, house cured pickles & house made honey bourbon BBQ sauce on Martin's potato roll) - Good; sweetness from the sauce\n*Mac & Cheese (cavatappi pasta with house made three cheese sauce) - good; bread crumbs on top, not greasy"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMweEt5TUp3EAE",
            "text": "If Pico RBNY and my dreams had a baby, this would be it. BBQ is spot on, ribs out of this world. Great service, bar selection and relaxed atmosphere. There's a bunch of great food in Arverne, but there is something special about the vibe and kictchen at Batsey's."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHN28tZWhRRRAB",
            "text": "The chicken sandwich was delicious. Right by the beach area. The people that work there is also nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaejZpaHRBRRAB",
            "text": "We ordered a couple of drinks and their beach box.  We had a couple drinks while waiting.  The staff is great and friendly.  The meat was spectacular.  The side dishes were the only disappointment.   Next time, we will try different sides.  Since we are just moving to the area.  It is nice to see all the improvements since I was a kid there."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdXVibHh3RRAB",
            "text": "Enjoyed the brisket sandwich and baked beans. Lunch specials include discount sides."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwNl9qaXRBRRAB",
            "text": "Great service. The Pulled Pork it was really good. The Spicy Honey Backed Black Beans  are amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadThLa1JREAE",
            "text": "What a great place!\n\nThe food was incredible. We had Batesy's Beach Box which includes BBQ Chicken,, Brisket, Ribs, & Pulled Pork with three sides (the Beans are exceptional!).\n\nThe crew was polite & professional.\n\nThe decor is fun, modern, new.\n\nI can't wait for the next time!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkN01mYTlRRRAB",
            "text": "Batesy’s is our #1 pick in town! We get takeout, delivery, and we dine in - the food quality is consistently excellent. We have so many favorites depending on what mood we’re in but my favorite is the burger. The burger is the best on the peninsula (big statement- I know but I stand by it) & always cooked to the right temp! I also love the pulled pork and the bang bang chicken sandwich. This top notch BBQ spot has even managed to nail the kale salad! The atmosphere, staff, and service is great. They always go above and beyond with their specialty cocktails (which we also get delivered on a regular basis). Can’t say enough great things. Batesy’s is a must!"
        }
    ],
    "reviews_count": 58
}