{
    "name": "La Cevicheria",
    "place_id": "ChIJ-4HHGThowokRCycpayEHDjg",
    "grid": "QN14",
    "address": "97-01 Shore Front Pkwy, Rockaway Park, NY 11694, USA",
    "rating": 4.5,
    "user_ratings_total": 160,
    "phone_number": "(917) 670-2848",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVlJuQkhkMkpuV2tOV2FVVTBla05FWWs0MmMwRRAB",
            "text": "Incredible place and staff. Dino goes above and beyond while serving one of the best ceviches in town."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeFJ6UnVTRkZrWVZkRU5sSTJkSEpaY0hZMk1FRRAB",
            "text": "Very good ceviche. So good to be able to eat this at the beach!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTVZUTlFWMTlLWmpsUFh6QnFla1J1WkhOVmVuYxAB",
            "text": "So good and fresh !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201YVZuQTJZak42ZDJwRWFEWmpkRGR6ZVVFMVRVRRAB",
            "text": "the Tiraditto Nikkei was INCREDIBLE!!! Dino and Javier are so sweet and the taste of this dish was so bright and tangy I was so impressed. If you’re a rockaway beach, it’s a must."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNFUwTjRTa1ZDTFd4MGJsQkpMWHBqWXpab2VYYxAB",
            "text": "Amazing fresh and delicious. Super yummy and the staff was so friendly. You can tell they put love into their food. The ceviche was one of the best I’ve had in the USA. Really want to try more things. Will be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBdFJ5MURXREY2TldNd2FtUmtVMFF0WkVnMGJWRRAB",
            "text": "The cechivhe was amazing! The price point is high for the portion size but given the location and the fresh ingredients, it can be sort of justified, maybe. Their staff was amazing and did give us some extra toppings since we were starving and cold! All in all, worth a try but I do wish it was 20% cheaper 😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRk1sYzBlV3BUYzA1SmIzRktUMjF1WVhGU2FsRRAB",
            "text": "Dino made it such a special ordering experience. Never would’ve ordered this kind of food. We were absolutely shocked and wish that we lived close by so we could have it every week!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWlZtRXRNV3g1WTFwclYzZHpTQzFyVDJ0a2NYYxAB",
            "text": "Ta buenazo mmm"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeWVubGFVMVJ6Wm1GSWIxTTJlbFZKZUhveGRIYxAB",
            "text": "One of the best ceviches I've ever had. Perfect bite at the beach."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVek9IQlFVMnBRWlVoemVYTnhWa2RyT1dJd2FtYxAB",
            "text": "$22 for a ceviche is steep but it’s beach prices. Very fresh and super bright and acidic. Sweet potato is a nice touch. Reasonably filling."
        },
        {
            "date": "2달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkb1oyMVZkMlpPYkZCMVdUaFNOSFZPZUdneWJYYxAB",
            "text": "Sempre maravilhoso tudo lá...e o atendimento do Dino é mais que especial...vou sempre e recomendo o tiradito"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcU9UbDNVMHhGVDNoYWVUVlljRzFDZUZkRGNWRRAB",
            "text": "Oh my goodness, the food was AMAZING! The seafood was so fresh, and the mix of spices and flavors was superb. The gentleman behind the counter was extremely helpful and patient in answering all our question. There is no indoor seating, but tables outside face the boardwalk and the ocean... Not bad!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJd09EQnpOVFp0ZG5OU1dURk9VMGx5YjJ0T0xVRRAB",
            "text": "the ceviche and frozen lemonade we’re delicious, Dino was so sweet. i stop here everytime i come to the beach !!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVmEybFFhM0puZUdFd1dEQlRka2xyYVhCeFdIYxAB",
            "text": "Auténtica comida peruana"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NVltVkljVTFIT1dGeVdVVjBVRTluWjNKRmNVRRAB",
            "text": "DELICIOSO CEVICHE Y EXCELENTE SERVICIO CON LUIS Y DINO!!!! Los mejores"
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Fd09Hc3hNR05aWlZnMGJsaFNVbkJoTWxReWJIYxAB",
            "text": "L’offre de restauration est simple mais goûteuse ce qui permet de passer un très bon moment au bord de la plage."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMWJWRlpiVU5sVmxCMWFEZDVNMEZPUXpCQ2FHYxAB",
            "text": "Always a must-visit location for my friends and I whenever we visit Rockaway Beach!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eFZtWjJZMDh4V1hab1dVSmZNRXhVYmxWWmNtYxAB",
            "text": "El muchacho me acaba de echar un kilo de sal en el ceviche. Lo pedi para llevar esta recontra salado."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMFoxcEdaVXAyUW5GT2FHdEljazV0VjBkSlgyYxAB",
            "text": "Amazing food and customer service 💯  priceless to have ceviche and tiradito  in front of the beach ⛱️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOZlpsRk1VbkJ6YTBGNWFFRlZWblkyWTE4eVQxRRAB",
            "text": "It was delicious! And on the board walk.. we walked to the beach. And enjoyed this so much"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcWEzQkJXSFk0VkhSbWVXNW9UV3gxVUZKNFFtYxAB",
            "text": "So incredibly awesome to find a cevicheria at the beach in queens! Oh and it was so good on top of it, what a enjoyable time to have well made ceviche by the beach while visiting nyc"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vME1XNTJTVXB2ZG5VM1IybDRlbGh1TWt4RWQyYxAB",
            "text": "We had such an amazing experience at this restaurant. It was highly recommended by our friends and everything from the food to service was amazing. We were greeted by Vera who was so kind and led us to an outdoor table while we waited for a table to open up inside. Once seated, our server Ana was amazing providing us with recommendations and being very attentive. The food was incredible highly suggest !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTE9FNTRaV2t3Y21JNVJHeDZjSHBzYVMxTlYxRRAB",
            "text": "Delicious food kind staff!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkYWVHZEZSRUl4ZG1ZdGNERlFjVEUxTkd0UU9GRRAB",
            "text": "this is a must stop for me every time i come to rockaway beach. it definitely feels a little steep in terms of price for ceviche but it taste so fresh and refreshing. there is nothing else i would want to eat on a hot day at the beach."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKYWFGOTNiM2MxTm1NMU0wTnpORmRIVWpoMFFYYxAB",
            "text": "La mejor cevicheria de NYC sin duda!Aprovechen el verano para visitar este lugar en la playa de Rockaway; increíble lo fresco que es el marisco 👌🏻"
        },
        {
            "date": "5달 전",
            "language": "pl",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNN3A2WU9qMGZxanZ3RRAB",
            "text": "Świetny beach-bar!\nKanapki 🥪 z homarem🦞 - przepyszne😋\nSałatka🥗 z krewetkami🦐 - dobra😎\nObsługa bardzo miła;)\nPodczas jedzenia był koncert na żywo!\nPolecam!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJdmRpLUQ1azluUTF3RRAB",
            "text": "Actualicen su horario de atención, ayer fuimos 6h30 pm y estaba todo cerrado. En Google dice 8h00 pm"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIanVuWnBBRRAB",
            "text": "The ceviche’s delicious!! Authentic Peruvian Ceviche! 🇵🇪💙"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dzlQTERBEAE",
            "text": "This spot at Rockaway Beach is a gem, especially if you're looking to explore something new. My go-to dishes are the Tiradito Nikkei and the 97th Special—both are bursting with unique flavors and perfectly balanced.\n\nOne tip: GO EARLY! Seriously, the line can get wild, and you don’t want to miss out on these incredible dishes. Whether you're new to Peruvian cuisine or a seasoned fan, this place is a must-try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MWJidnNRRRAB",
            "text": "Surprisingly good offerings at this food bazaar at the Beach 97 boardwalk in Rockaway Beach! At first, we thought $19 was high for a dish on the boardwalk and we worried about buying fish that isn't really cooked there. Turns out that the ceviche was a decent portion and tasted very fresh! Given the lines, it seems they get a lot of turnover - so it looked and tasted fresh. They ran out of forks so we had to find them from other vendors there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3LWViYmNREAE",
            "text": "Ceviche. Was good 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3M3ZLb0dBEAE",
            "text": "Was in Lima a few weeks prior, so being curios I decided to try this place.....what a complete nightmare.  This food taste nothing like real ceviche. Theu hardly use any lime juice and the fish is undercooked....extremely dangerous! Restaurants in Lima, Peru are cleaner than this place and have better ingredients. DO NOT try the causa unless you want to spend the whole day in the bathroom.  The papa a la huancaina was more like melted glue with yellow pain, DISGUSTING!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicl8tU05REAE",
            "text": "Came here on a busy weekday. I ordered a fish ceviche and the lime juice was barely there that my fish was not done and ready to eat. The ceviche juice was terrible, i would be embarrased to be a Peruvian offering ceviche at the beach for this dissappointment. Overpried too +$20 for a tiny bowl. They also dont offer chicha morada.  As a Peruvian i wont recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiN3V5SW9RRRAB",
            "text": "classic spot shows love to nyc parks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidDZtVDlnRRAB",
            "text": "Good food, fresh and well seasoned"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaDhPWG9RRRAB",
            "text": "This was a real find! The food in this whole food court is very beachy, and very good. Our son had dumplings amd fries from Little Island, but we both ate from the Cevicheria. It was fresh, really delicious, and a great big portion. Hubby had the mixture, with calamari, shrimp and white fish, I had the Classico, with just white fish. Both came with sweet potato, corn, crispy corn, red onion, and the most delicious marinade. It was SO good. This place is the reason we will return to Rockaway Beach!\nAbout $20 a head.\nGot beer and a frozen Pina colada from the bar, and our son had a huge freshly made lemonade from the guy in the middle, $7.\nTables outside, but under some shade, to eat at. Really lovely atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNlB6NElREAE",
            "text": "There is nothing like eating fresh fish for lunch while at the beach. Take that to the next level, and now it's time to have fresh ceviche at the beach as if you were visiting Lima, Peru. The two founders, Leyla and Ximena Yrala, are from Lima and came to Rockaway only to find there was no ceviche at the beach, and thanks to them and the Rockaway Bazaar, there is now.\n\nThere are many styles, including a vegan option, which we did not order but sounds impressive. We ordered the classic and shared it at one of the picnic tables out front, and Rockaway never felt more Peruvian than that day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NDgyWmJnEAE",
            "text": "Delicious and great service!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6cHI2ejhRRRAB",
            "text": "Rico ceviche. Buena causa. La mejor opción en la playita."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUanVfS213RRAB",
            "text": "Every summer I live in Brooklyn, I can’t wait to come to Rockaway for the ceviche. Best ceviche ever!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cEl1NnVnRRAB",
            "text": "Outstanding ceviche, causa, and chicken and salmon salad. All really fresh, authentic, and with good ingredients. One of the best ceviches I’ve had in a while. Definitely would recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhM3NDcVlREAE",
            "text": "Beachfront ceviche all prep on site . Excellent quality and mix. Friendly Staff. Not far from Ferry stop. Beer and wine in same complex. Chicken salad also was good. Will be back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NlpHMm5nRRAB",
            "text": "Incredible ceviche, just like you’d find in Peru. All the ingredients were fresh and super flavorful, perfect meal for the beach"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bjRQZ2NnEAE",
            "text": "Healthy fast food! It’s great option to have it on the beach, instead of fries and chips\nAbsolutely amazing service, happy smiling people"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNEtyWHB3RRAB",
            "text": "Soy peruana y puedo recomendar su ceviche (toques de kion y ajo). Además pedimos causa y palta relleno, súper recomendado!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2b2VERGZREAE",
            "text": "I was surprised at how good the ceviche was! We got the mix seafood ceviche which had a assortment of seafood and a chunk of sweet potato, crispy fried Peruvian corn and chunks of soft hominy as well as red onions in a wonderful marinade. It was so much fun to eat especially outside by the beach. It's the perfect atmosphere for this dish.\n\nI have to go back and try more of the varieties."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeUw2X2l3RRAB",
            "text": "Well it's pretty much a cevicheria with a couple of non ceviche plates. Once got there was not aware it was a market stand all good no issues with that. I felt like the service could've been better nicer, but it is a food stand and you get that type of service. I ordered a Ceviche Mixto which was on point I do like you can put as much aji as you want. My son classic ceviche and my wife Causa she enjoyed it and so did my son. No complaints on the quality of the food. My missing star the forks and spoons, they were wood. The straw paper trying to drink a frozen drink impossible. I would return with the idea of getting something else in the other food stands."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMG82NFZREAE",
            "text": "I wanna start off by saying I’m Peruvian so I’m already very picky about ceviche. Great ceviche you will definitely love it! BUT you HAVE to try the Chicken Salad sandwich, I grew up eating that at the beach and this one took me back! Will be getting more when at the beach! 🙌✨✨✨…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMDR2OVh3EAE",
            "text": "In peru ceviche is traditionally eaten in shacks by the beach.  These guys are able to capture both atmosphere and the taste.  My only regret is they are not allowed to buy fish directly from guys fishing on beach.\nHighly recommend ceviche and a beer for lunch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbTZTX2p3RRAB",
            "text": "When I come to the 97st Street Beach at Far Rockaway, I come for La Cevicheria and also enjoy the beach while I am at it. La Cevicheria first and foremost, beach second. The service and the food are superb. I usually get the 'Palta Rellena' (stuffed avocado) and the 'Ceviche Mixto'. Their fresh made frozen lemonade is the perfect refreshing treat on any day. Oh, and their 'alfajores' cookies - as my 10 year old described them 'taste like they are from heaven'."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxejZTYTJBRRAB",
            "text": "This is last-meal quality food - I am completely obsessed with the 97th Street Special. It is worth every penny, incredibly fresh and never disappoints. I would eat this, here, everyday if I could. Such nice staff and everything is made and…"
        }
    ],
    "reviews_count": 51
}