{
    "name": "The Wharf",
    "place_id": "ChIJGfuOwytowokR3Nm3TBkmmfQ",
    "grid": "QN14",
    "address": "4-16 Beach 116th St, Rockaway Park, NY 11694, USA",
    "rating": 4.1,
    "user_ratings_total": 1074,
    "phone_number": "(718) 474-8807",
    "reviews": [
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xST2VYVlRRbEZPYlVacGRreFJabmQwY1Y5V1UyYxAB",
            "text": "I love The Wharf! They've made terrific improvements in food, drink, sports TV, etc. You can't beat the scenery and sunsets! You can see the Manhattan Skyline too! ❤️\nThe food and drinks are really good!\nThey take cash only.\nEnjoy!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMWNFNWhTWGRpV2tJM2FIaFhVbGd0UjBGb1pYYxAB",
            "text": "The vibe and energy is just right"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeTVyOXpRRRAB",
            "text": "Update October 2025:\nBeautiful October day here for lunch with a buddy.\nTemperature is fabulous. Sitting outside on the deck in the shade.\nWatching boats go by.\nThe fairy.\nNational Park service board.\nOther miscellaneous folks doing Marine kind of stuff.\nTemperature is great.\nThe wharf is still hidden.\nServer: Kayleigh (Note the variant spelling)\nShe's incredibly busy taking care of customers, but at the same time incredibly efficient.\nLeft a nice tip.\nStill one of the most beautiful places to sit and have a meal or drinks.\nPhotos posted of my quesadilla.\nThank you, Kayleigh!\nOlder reviewer:\nThe wharf is hidden.\nYou walk or drive through a gas station parking lot.\nThere are fenced off areas and there's a building.\nThe outside wall that you see of the building has no windows, it's just a building.\nYou walk in on the right side of the building here. You can walk out in the back and there's a deck and there are people and everybody's having a good good time.\nIt is truly a real surprise to someone who hasn't been there.\nMy wife chatted me cuz I've been there before with some friends and said \"Why didn't you tell me about this place?\"\nThe menu is limited and comfort food filled as well as some seafood dishes.\nMy wife had a lobster roll. I had muscles. As well as some beer.\nThey do not take credit cards but they have ATMs so as long as you have money in your bank account you can pull some money out to pay for your bill.\nI posted some photos of views, distant views of Manhattan. It's really spectacular.\nYou can walk there if you come in via bus or Subway. It's the last stop in Rockaway Beach at 116th Street. It's also the last stop on the q53 bus, also known as the q53 SBS or something like that.\nI haven't been there for dinner so I can't talk about dinner but lunch is absolutely wonderful.\nThey do not do reservations."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSU2VXdG9jRVZ6T1RaSU1WZHphMHBrZVVsc00yYxAB",
            "text": "Great food, brunch ied amazing here l. Free coffee and tea"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sZlpVcFdaMDkxUW1wM2VIaFhXV3g1VFc1emQzYxAB",
            "text": "A very good restaurant. My only beef is they need a bigger sign."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXODdLSU1nEAE",
            "text": "Average bar food with great views. I get the same thing every time: chicken Quesadilla for starters and a Turkey Club. Burgers are decent. Fried chicken sandwiches are disappointing so I stopped ordering them. Popcorn shrimp is nice when its on the menu. Service is always courteous and quick."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMVZUUnFlbWhTU2xaRk5WOVlkVTgxTUdZMWVHYxAB",
            "text": "Good pub atmosphere, food is good, occasionally has live music. Lots of locals. Might have the best sunset view in NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WlptODJTVXBUVmpaT2NVNXJNRE4wT1RCNWFGRRAB",
            "text": "We sat on the outside deck. Good views of the city & water front. Not fare from JFK."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUFUwSnlkRUZYV21GSlVXOUZNRW81ZUhORGVXYxAB",
            "text": "Great food you sit outside on the water great view"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZelEyYzRaMGRHZEhZeGNWVnZUVGRoTVV0M1lXYxAB",
            "text": "No per friendly"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMldYbFZhVnBRVERWdFRpMDRkazV2VUhKSExVRRAB",
            "text": "A rockaway staple. Great views to the city. You can dock up  with a boat. I had a delicious wrap here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdFR6SnhNMGN4TW5oNU4wWlFTRXRIZUhGNFVHYxAB",
            "text": "Grilled hanger steak was great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcmFrSjRTMU4yUTBjMFpsVkNVbHBQWVZaR09VRRAB",
            "text": "The staff was slow and very lazy.  The food was grossly overpriced with very small portions.  The waitress was unattentive and lazy.   Not a good place .  The drinks were watered down."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdGFuWm5lV2hoVjJONVUwWm5hVFZoYXpOUFZsRRAB",
            "text": "Frozen seafood just beware, really disappointing. The best thing was the pizza which they forgot to put on the menu but since we were outside we saw the pizza oven and inquired! Order beer not drinks! View is nice, and they let you sit outside on the patio with your dog."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZME9XRmlRVFpSWWsxc1MyRmphbGRNTkRKaWIwRRAB",
            "text": "The oysters were radioactive, the calamari was rubber, the crab\"meat\" was gray, the wait staff consisted of 16 yo mute boys that do not seem to know the terms, “excuse me” or “are you finished?” The only star is for the bartender who made a decent spicy marg. Avoid at all costs"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRdFFUUlRlRGRrYlU1TE9UQktTMHBQZUUxR1VWRRAB",
            "text": "The Waiters very respectful,  and foods is delicious..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMGVsZE9lWE5TUVZWV1RIbHFXR2t5YkhscldWRRAB",
            "text": "We ate a disappointing late lunch here as the food was really poor quality all around. We sent one item back and the other three items (the chicken sandwich, spinach salad with shrimp and fish tacos) were subpar. Service was below average. The water front setting was nice. Cash only. I would not recommend this place if you appreciate good food… seemed like school cafeteria quality or a bad airport restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dE0wVjBiWEk1ZHpWQlVYQndkVXhGZW1oVlVrRRAB",
            "text": "Go literally anywhere else, they will waste your time. Wanted food coming from birthday beach trip with a group of four. Was told 40 minute wait around 6:30 (there were open tables everywhere), so we sat down at the bar and ordered multiple drinks, while we watched other people be seated. got a text at 7 that our table was ready, but the hostess told us that was a glitch and that it wasn't ready. ordered more drinks, no sign of table being ready by 7:30, hostess told us to come back in 20. Regulars are getting seated, other people are getting told there's now an hour and a half wait time. the sun is almost down, everyone is still starving. We start standing around the hostess table waiting, hostess just walks away and doesn't come back. it's 8:10 and dark out, everything around rockaway closes at 8-9, so we left and got seated immediately at a real restaurant that served something other then a reheated frozen Ruben and were MUCH happier! Noticed on our way out the hostess conveniently returned to her station as we walked away :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poc1kyTjBhM3B5UWtsRlVtRnlkMFpDYUZKd05tYxAB",
            "text": "Great food,awesome city view and sunset"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSmVXbEdkM05JYVdzelFWUnhZamt5TVdwWk5WRRAB",
            "text": "Beautiful view, and the food was fantastic. It's a little hidden, but that kind of adds to its charm. Cash only, so that's a bit inconvenient, but well worth it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSFptSXlha2xLY1ZORmJEVlpNaTFqUkdSYVQzYxAB",
            "text": "The food was decent enough, the view was great but the wait was quite large. Admittedly we were a party of 8 but even considering that we waited nearly an hour for a seat. The service was great albeit a little slow, but the kitchen was backed up with orders. I ordered the fish tacos which were delightful, however the fries were unevenly cooked and unsalted. There are as well a plethora of lantern flies around our seat even considering the fact that we were sat outside."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NFZUQjNWRzFPWlRZeFlVbElPR3RvVjJGSE5XYxAB",
            "text": "WORST EXPERIENCE EVER! I am beyond disappointed and frankly shocked by the treatment my service dog and I received at this restaurant. From the moment we arrived, not one but FIVE different staff members repeatedly told me my service dog was “not allowed.” Despite showing her clearly marked harness and explaining multiple times that she is a LEGAL service dog protected by law, they continued to refuse and treat us as if we were unwelcome.\n\nInstead of offering any apology or understanding, they forced me to sit in the blazing sun—86°F—telling me that because of my service dog, I had to stay in that exact spot, isolated and excluded from other guests. This is not just poor service; it’s blatant discrimination.\n\nWhen I requested to speak to the manager, I was ignored until I insisted repeatedly. Only then did they reluctantly serve me, and only because I was starving and had no other option. I should never have had to fight just to be treated like a normal customer.\n\nThis humiliating experience made me feel worse than ever. I live with anxiety and depression, and their behavior deeply affected my well-being. No one, especially someone with a service dog protected by law, should be treated this way.\n\nI hope this review serves as a warning and encourages the management to seriously train their staff on ADA compliance and basic human decency."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGS2NVWmpiSFl0YVU1clVDMWpaVUpRTmtGaGVsRRAB",
            "text": "We moored the boat to the restaurant and ordered some beer. When we seated (5 people) the waiter (Winnie?) closed the sun umbrella on our table and explained that we did not order any food. And if we don’t like the “rules” - we should leave. This then turned into a heated debate and the evening was ruined for us. This was absolutely uncalled for and I still don’t see how ordering a beer is not a reason to be seated at the restaurant. The beer was good, the service was awful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQ1VYSnViWEpmT1Y5dU5uSkxTMFl4WDFJM1duYxAB",
            "text": "Stay away! The time to sit and get served took forever. Then when the food finally came my two year old’s daughter fruit cup came with mold. I was horrified as she already had eaten several pieces. There was no apology for the incident. I will never come here again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbVRIZHlZMVJ1Tm5aRlVuaHpaREpzTjA0M2NYYxAB",
            "text": "Excellent food and service. View is remarkable.  Can't wait to get back there again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dVJUZ3dlamxGYkZWUGRtaEdlRzQzTm1SVWRGRRAB",
            "text": "Nice view"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oYVRISk1SMlJ2YVRodk1WODNUbXhpT1RKS2VVRRAB",
            "text": "Beautiful sunsets at this lovely restaurant! Food was great as well as service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bFpTMHRaVU5CYURSb1VGaHhNVEU1YmpWd2VXYxAB",
            "text": "Beautiful atmosphere. The day was lovely and the air was cool and breezy. Lobster rolls were $34 versus $26 as advertised on their menu. The price for the food did not match the portion sizes. For a cash only place, and with two separate tables, requesting separate bills, the waiters claimed the bill needed to be combined rather than billed separately or individually. Because both tables consisted of a total of 11 persons, receipt had to be itemized in order to appropriate charges to calculate tip and pay accordingly. Taxes were already calculated per each item item. The atmosphere makes up for the deficit but that’s just not good enough. This was my first and last experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVFZDMXRjblJTVjIxcE56VklkR3hqWnpaeWRIYxAB",
            "text": "Very nice laid back establishment for dinner, drinks or both"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzd2IwRXdhakJNVGtWaU5YSllVbWhITWxwcE5HYxAB",
            "text": "Delicious food with beautiful ocean view , love it. P.s. cash only (atm inside)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMk9IcE5ORkZyTFZGR1lqVTNja2hRV1VOSldYYxAB",
            "text": "We love coming to the wharf after a day at the beach. The food is all good and hard to decide which to order. They have our favorite beer Kona blue wave. Service is impeccable and you can’t beat the beautiful view of the bay. You will need to bring cash as they don’t accept credit or debit cards."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keFNtaGpXRTV1T1ZJemVtSjJjMUZDWDFGalMxRRAB",
            "text": "Loved"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTFp6aGlkWGxGY3psSmRtZGpaVXBJTTNKTk9XYxAB",
            "text": "service was miserable. hostess was extremely\nuninviting and our waitress never checked in on us, plus we waited 15+ minutes to get the bill.\nfood was mediocre, only positive to this place is the somewhat atmosphere. and what kind of place is still cash only??"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUVJWVk9aVFYzTW1sdWVUUXhTbGxwZDI0NVZXYxAB",
            "text": "I was looking forward to this because of it’s location looking out into the bay and city skyline, But food is missing flavor."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaGRIaDZjemhVYjJGSWRITXRPVWxWYkRaMk4xRRAB",
            "text": "Great spot for summer!! Took my friend here for dinner, my friend had the chicken sandwhich. She liked it but the fries not so much and i got salmon, it's good 10/10. We got here just in time for the sunsets too 😍 you should too. They have a bar where you can wait to be seated. Good drinks 👍 the margarita 🍹👍. It is behind the gas station !!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbmJrbE5NMkZOUVhWbFRWVnFSblY2VFRKSFdYYxAB",
            "text": "Delicious food and gorgeous views"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSmJuWmtUMlJoU2pWaGVqUklSakZQVW10VmNGRRAB",
            "text": "Doesn’t accept modern payment methods"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRllUTkJTMlphTlY5dWVXVk9PREpSU1dWaFlWRRAB",
            "text": "Beautiful atmosphere, great view of the city , staff is friendly and goes above and beyond. Food is average, nothing to go wow about, but at the end of the day, with some good company , amazing view , sprinkle a couple of cocktails and few good laugh you have the recipe for a good time"
        },
        {
            "date": "3달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205M1VrZ3pRVmwxYkZobmNHbFlWbFp2YjIxYVJWRRAB",
            "text": "We houden van deze plek aan het water. Het eten was erg goed en lekker, de bediening was uiterst vriendelijk en attent. We zouden hier zeker nog eens terugkomen , als we weer eens een reis naar NY zouden maken! We hebben een heerlijk voorgerecht gegeten (shrimps), de mosselen en zalm als 'summerspecials' plus de nodige drankjes. Alles op het buitenterras met zich op de New York skyline. Aanrader!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wT1VuQTFTMEkwWjJVM2RVVnpjMVppWWpONE4zYxAB",
            "text": "I finally got my mussels that I've been longing for a couple of days. They were absolutely delicious, the sauce they were cooked to perfection. I was so surprised that I forgot to take a picture. They're really worth getting. The garlic bread that my friend's daughter suggested was perfect 👌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsM1ExOUJUVXBWYmtGdWJUSTBaREZEVGw5Q09XYxAB",
            "text": "Delicious, affordable, nice views, good vibes. The only thing I didn't like was the fries."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaE4yMzl3RRAB",
            "text": "I really love this waterfront restaurant. The beautiful summer flavors are just amazing.\nI usually order the grilled avocados and lobster roll, but this time we added the white wine mussels to the mix. The bread that came with it was fantastic, especially with that light touch of garlic. We were really impressed.\nAlso, the French onion soup was a little on the watery side."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybGQ2OWFnEAE",
            "text": "I recently dined at The Wharf, and I must say the views are absolutely gorgeous! It's a perfect spot if you want to enjoy a meal with a stunning backdrop.\nAs for the food, it was quite good. We ordered the lobster roll, margarita pizza, shrimp roll, Caesar salad, butter pasta, quesadilla, and calamari. Each dish was well-prepared and satisfying. The food came out quickly, which was great since we were pretty hungry after a 30-minute wait to get seated.\nOne downside, however, was that we weren't informed that the restaurant is cash-only until it was time to pay. This was a bit of a shock, and while there are ATMs available, it was super inconvenient. I guess most locals are aware, but as visitors, it was an unexpected hurdle.\nOverall, despite the cash-only policy, the combination of good food and breathtaking views makes The Wharf a place worth visiting."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScl9TbTRRRRAB",
            "text": "This is such a pity, honestly. Such a great spot and beautiful view, and the server was very understanding and super friendly, hence the 2 points. But the food was absolutely terrible and insanely overpriced. I live in the city and the prices here are absolutely uncalled for, especially because the quality is more than poor. I got the Caesar salad, which cost $11 (!) and it was literally just loveless pieces of lettuce sprinkled with a bland sauce and bland, unseasoned croutons. For $11! No shaved Parmesan, nothing. It was really, really not good at all! And the burger felt like we were eating at McDonald’s. For this price, and for the fact that we’re in Rockaway, not Manhattan, you’d truly expect something else here. So utterly disappointing, I won’t dine here again. I hope the management reads this and makes some serious changes in the kitchen. The server was more than wonderful, so absolutely not her fault in any way, she made the experience better! This goes all the way to the top, to management. Very, very disappointing and unsatisfying!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdk9hNDVnRRAB",
            "text": "Kelsey was a great server. Food was pretty good. View was magnificent. Some complaints/suggestions. Don’t put MP on lobster roll; tell the person who ordered it what the price is. Very deceptive. Cash only. Annoying. Don’t like using ATM’s in bars. Also tax included in price so one ends up tipping on the tax. Not cool. But oh that view!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waldsbFRkR2xoWVhoeVNGaHhZWFJGYW1kNFkwRRAB",
            "text": "Great place with live band and nice sunset view"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMjQyVC1BRRAB",
            "text": "Had a great time! Food, quality and waitress was wonderful! Only issue was the parking lot. Pretty small for such a successful business. You may have better luck parking elsewhere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiaVlUQ0J3EAE",
            "text": "We don’t come here to dine, just for their brick oven pizza which is quite good, and the pizza chef is very talented.  However the area where he is placed is a lost revenue opportunity. 1 or 2 dedicated servers and community tables that are actually taken care of, would make it much more fun.  Pizza itself was delicious but the tables are not wiped down and don’t get me started on the food stains all over the floors.  Please get out a power washer and clean this area up.  Throw out leftover decor from past parties and put a little effort into that space."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MzdfMDFRRRAB",
            "text": "This place is all about the views. The servers are absolutely top notch- nice and attentive. I left today feeling neutral about this place. I used to love it. I ordered the fried calamari, and the batter was definitely under-seasoned. It was pretty tasteless, but the fry was on point. They have an extremely limited drinks menu, and again, they were out of stock on certain ingredients/ foods. I've gone here over the years, and it has steadily become a blue-collar-bro bar. Would absolutely recommend for the waterfront views. Best times to go would be daytime because at night, the basic kyles and beckys get pretty rowdy and bring your seasonings. I think I'll return again for just a beer and to watch the pretty views."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaGFqZDRNSHB6VXpnME1UWnZPV2xuYlVrMk5XYxAB",
            "text": "this place has good service nice atmosphere nice views of the waterfront but the food needs a little bit more flavor and little bit of more salt and spices. The menu also needs new items and a mix of Italian Latin and and American dishes other than that is nice spot"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTFVqQXlMVzVvYjBrMVoyMVFTMFo1TWpGblNuYxAB",
            "text": "As mid as mid can get for a seafood restaurant. Clearly living off the views of the water, the Wharf leaves you wanting for more. My partner and I arrived to hear there was a 45 minute wait to sit outdoors, yet, the entire time we ate here (indoors) tables were open and people were being seated. I am not saying they were being shady, just that it doesn’t seem as organized as it could be. You’re really here for the outdoor seating, so being indoors really kills the vibe of this place.\nAs for the food, well, the oysters, they are forgettable, their “smoky cocktail sauce” is more BBQ and the presentation is sloppy, ice (on the actual oyster instead of underneath)and lettuce everywhere and wilted lettuce at that.\nWe ordered some mojitos (from the menu) only to find out they don’t actually serve that. We took the margaritas and honestly, you’re better off with a beer, not sure the bartenders really know what they are doing. If you enjoy a Gatorade and lemonade, their margarita is for you.\nI orders the fish tacos and my partner ordered the shrimp basket (we both decided to keep it safe after the drinks and app).\nNot sure I’d call what I got a “taco,” it was a fish wrap with a pickle on the side…doesn’t scream south of the border at all. It also didn’t have any pico or sauce to accompany the taco. The shrimp seemed frozen before service and the fries are dry and over cooked. For $20 ($10/“taco”) it’s safe to say to avoid this place unless you’re drunk.\nIt tells you something when the food we had for lunch from the local deli outshined this place….by a nautical mile 😉"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBa29uWjNnRRAB",
            "text": "I found out about this place from a friend who raved about it and I just had to check it out myself.  This restaurant is literally at the edge of Jamaica Bay and is built on an actual wharf with both indoor and outdoor seating options.   One can either drive here or come by boat and literally dock their boat right off the restaurant.  The 180-degree views are amazing.  You can see most of Manhattan from 20 miles away and most of Jamaica Bay.  I've heard that one must come during sunset for an unobstructed view of the setting Sun.  The menu has something for everyone including a large assortment of seafood, salads, chili, and burgers that come in both veggie and beef versions.  I ordered a reuben sandwich.  It was okay.  My wife ordered a caesar salad and a shrimp roll.  The caesar salad was okay but the shrimp roll was good.  My son's chili was sub-par and his house-cut fries were overcooked and not crispy.  I'd give the food three stars and the view five stars for an overall rating of four stars.  This seems like a perfect place to have some drinks with friends when noone really cares too much about food quality.  I'm open-minded to return here again for a meal during sunset and take a chance with something else from their menu."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxa2V2TEFnEAE",
            "text": "Ideal summer casual dining spot with the most amazing sunset views of lower Manhattan. Family friendly, usual bar type menu - burgers, salads, wings, calamari. Good vibes, great staff. Well worth a visit!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdHV5SzZRRRAB",
            "text": "Great find! Out of the mainstream seafood/grill eatery with amazing views of the bay and Manhattan. Best time is 6 pm thru gorgeous sunset. The food is fresh and nicely presented. Full bar, which is what you want for a romantic cocktail while watching the sun go down over the Manhattan skyline. The staff is friendly and courteous. The MTA ferry is nearby so if the weather's nice you get a lovely boat ride and a lovely dinner. Something special to do in nyc! Note: no reservations, cash only."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOE5xbUFnEAE",
            "text": "A hidden gem on the Rockaways, the outdoor sitting is beautiful over looking NYC on the bay, the service is great, the food is tasty, from lobster rolls to tacos, and great drinks!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMVZsUnJZbHBRVWtwME0zcGZMVkpCTkhOVmJIYxAB",
            "text": "Kelsey is amazing!\n\nIf you’re veggie, ask them to replace the egg with homefries in their breakfast burritos!\n\nGreat experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2OU1iQ0NREAE",
            "text": "Hidden local jem! Hush!))) Very good sunset spot, the food is nothing special but it's good, just too fried for me but I loved mussels, calamari too) I mean, it's not your top restaurant but I absolutely love it for the location and simplicity! Just the service could be a bit spotty but we were like it's ok, they were busy)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbzczbzdBRRAB",
            "text": "It's all about the setting here.  The food is passably good, but the view is wonderful.  Nestled behind a service station on the bayside of Rockaway Beach and not far from the ferry, is this charming, rambling shack with plentiful outdoor seating.  To me, it's all about the sunsets.  There are not many places close to Manhattan where one can feel such beautiful sunsets."
        }
    ],
    "reviews_count": 58
}