{
    "name": "Rocco’s Of Roc Beach Coal Oven Pizza",
    "place_id": "ChIJCxUlA6JpwokR_RCAEDUydo8",
    "grid": "QN14",
    "address": "115-10 Rockaway Beach Blvd, Rockaway Park, NY 11694, USA",
    "rating": 4.5,
    "user_ratings_total": 621,
    "phone_number": "(718) 799-5050",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWb05HeHNWVFJPU0RST1UxUmpaVU5FZG5KcFkzYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nHuge shout-out to Vinny and the team! They went above and beyond with our delivery — everything arrived hot, fresh, and absolutely delicious. The pizza was perfect, and the service was just as impressive. Vinny made sure everything went smoothly and really showed what great customer care looks like. Thanks again for the top-notch service and amazing food! 🍕🔥"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poemJ6TkdkR3MzYzJoQmJrTklXalZLZUVKTFVWRRAB",
            "text": "Truly exceptional food and service. A very loving family feeling♡ Best classic Italian in NYC. And thats including Patsy's and Balmonte's!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNlUwaDRaRFoyWjJsS05Hb3RTbTFoUWtOQ1JFRRAB",
            "text": "Incredible pizza, get the pepperoni with the sesame seed crust"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xac1dtOTVTREk0VDJ0SmIySktTbEJYVG1oZmJWRRAB",
            "text": "The penne with vodka sauce wasn't the best I’ve had also the prices don’t match the quantity… don’t think I’ll go out my way to go here tho. I didn’t get that feel from the food. But if you’re in the neighborhood it’s okay. Fried food shouldn’t be placed in a plastic container with no ventilation"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TE0wSndWVFpaVGs5blpYRjFkME5XVDJwaE9WRRAB",
            "text": "I’ve been to Rocco’s multiple times and the food and service have always been consistently amazing! I recently went to celebrate an occasion with my family, and everything was absolutely chef’s kiss. Our server Loren was Incredibly attentive, hilarious, and made the whole experience feel fun and comfortable. If you find yourself at Rocco’s, the spicy rigatoni with the thin and crispy chicken cutlet is my go-to and I 100% recommend it. Can’t wait to come back again!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21walYyZExRMkZIT1RkSE0zaGFWa0psZFVVM1ZuYxAB",
            "text": "By far and away the best Italian Food on the peninsula!! Their attention to detail and hospitality are second to none. An absolute must do, dining experience!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMWVsWlNZVXhFWlZWaFNXYzJXa3cwVjNWVWFWRRAB",
            "text": "What are delicious and fast👍 Thank you"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4aWJYQjJkRXR0U0RJMU1UWkRaMk50VVRSSWJXYxAB",
            "text": "First time there. Staff were very friendly. I was impressed that most items are made in house, including pasta and desserts. Everything we had was delicious. Beware of Caesar salad though,,,, the dressing is definitely not the right recipe."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRU1sOWZOblEzV2pkQk9VZFNSRlF3TjBOc1IyYxAB",
            "text": "Just celebrated my daughter’s confirmation at the new party room in Rocco’s. Everything was perfect! From Joanne decorating the room for us to the pastry chef creating a fabulous cake for my daughter. The food was delicious and the service was amazing! Thank you to everyone at Rocco’s for making my daughter’s party very special!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSlNuWTNaR3hrTm5GclNETm9SR2hSYzFodU1FRRAB",
            "text": "Perfect neighborhood restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQlRqZFFjM0JWZVdKMFNuSTBSVFExVG5SaFdWRRAB",
            "text": "Food was delicious. Upside down square is better than Spumoni gardens. Best pizza in the rockaways."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaU5taHBVSFpqZDNCT1RXVklTMTkwTlU5WVFsRRAB",
            "text": "Food & Service are second to none!! Best Italian food in Queens!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cVoycDFUelZsT0VkUldqTjJNbFV0VTFCVk5YYxAB",
            "text": "Bruno the Chef\nJoann owner\nLauren the waitress\nAmazing from the time you we hit the Door\nyou won't find a better place.\nThe people and the Food"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdDhER3lnRRAB",
            "text": "This is the spot if you want authentic Italian food in Queens, NY.  Everything is made from scratch with love.  The host Joanne is great. Vinny the chef is amazing, he really knows his craft.  Its nice to see a chef walk to the tables and introduce himself and gets to know his costumers.  Liz the waitress attends to all of your needs and makes you feel at home.  The restaurant workers work like a team .  I drive from CT to pick up family in Brooklyn to eat here. I am  amazed every time I eat here. Try the specials on the menu you won't be disappointed. The atmosphere is always excellent.  Best spot for Italian food in Queens, NYC. Everytime i go its like being home. Vinny makes you feel like family.  Try the spicy rigatoni  and the porchetta."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWk1uZHdhVjlaTm5aVGFIQk1TM0V5TFZaak1WRRAB",
            "text": "Food was fresh and delicious.  Veal was so tender. Eduardo was attentive and helpful presenting the specials.Everyone was friendly. We will definitely come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGS01sWkdZVzlIWVhORWVVeEZiMkpyTTFKYVdHYxAB",
            "text": "We had a pizza party for our Medical interns and did not disappoint! Excellent all around!!!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSYVZVeG1ObloxVmpKQ1ZuZG9ZV0p0YTJ0YU1WRRAB",
            "text": "Rocco’s has the best pizza in the area.  Fast delivery too.  All very good!  Thanks.\nJust received another home delivery order.  Rocco’s never disappoints!  Food arrived on time, driver was courteous.  And all items were delicious!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbGNuVllRV0pQY2pWcE4yMXhabFpWU0RGdlIyYxAB",
            "text": "Great burger! The caramelized onions mixes with the melted cheese added such a nice flavour! Fries were average. A solid 6/10 meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRGRUaEtWMnQyT0VoYWJqVlJORFpIUVRaQlpFRRAB",
            "text": "Absolutely loved this gem in the Rockaways! Every dish was a delight—Caesar, meatballs, marg pizza, and spicy rigatoni 10/10! Our server Lauren was so sweet! Will def be back next I visit!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUGN6Sk9kemxmYlU1M2REbDFlR28yYld0WWFsRRAB",
            "text": "Omgggggg THIS PLACE IS A GEM OF GEMS!!! Joanne welcomed us in on an early Tuesday night so warmly. Lauren who served us was a delight. We had the caesar salad, the meatballs, the margherita pizza and the spicy rigatoni—EVERYTHING WAS EXCEPTIONAL!!!! Cannot recommend Rocco’s enough. Sensational :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0YWRGQmFRaTFyTkZGQ1VtaFlaMHhyVFV0M01IYxAB",
            "text": "Great place , excellent food. Old school Italian. Thanks Joanne for recommending the meatballs!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWVJVNXhWR2R4ZEV4MWVHaHZZVFJpTFc5a1YwRRAB",
            "text": "This was the strangest and most unfriendly dining experience I have ever had. I came to the beach on a Saturday with a friend. After the beach we were, naturally, hungry. We took the bus to this neighborhood and thought this restaurant looked good. We did not have a reservation and having a wait time is understandable. But from the moment we walked in, it was clear that we were not welcome. They could not give us a wait time. All of the staff were extremely unfriendly and acted like they wanted us to leave. We sat at the bar to wait for a table. No one even asked to serve us drinks. We were ignored except for interrogations about why we were there. They asked us to leave the bar if we weren’t going to buy a drink but we had never even been asked if we wanted a drink. Nor were we given a welcome, any indication of how long the wait would be, anything. They just wanted us out. So we left. I don’t know if it’s because we were visibly queer, a little messy from the beach, strangers in that area, or what, but none of that excuses the rudeness with which we were treated. I’ve never been treated that way ever in a restaurant. I’ve never been greeted with such disdain and unfriendliness, and this is coming from someone who lives in Manhattan. It’s understandable to need to wait for a table, but we were treated as if we were highly unwelcome guests. Next time I go to the beach, I will not be going anywhere near this restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xad2VUTlZiVE5HV1VGSGRqbGhkVlJ0YjFkUFMyYxAB",
            "text": "We ended up in Rockaway Beach, NY on a spontaneous family trip (from Windsor Ontario 🇨🇦), eager to soak in anything New York — and wow, did we stumble upon a gem!\nIf you’re in the area, do not miss this place. From the moment we walked in, the vibe was pure warmth. The staff treated us like long-lost cousins — friendly, funny, and full of personality (accents and all!). It honestly felt like we’d walked into a scene from a great New York movie.\nThe tablet menu with food photos was a fun touch — who doesn’t love seeing what they’re about to eat? We asked Michael to surprise us and choose our dinner, and he nailed it. Every bite was delicious. Oh, and the dirty martini? Absolutely the best — trust me, get one.\nWe had such a great time, we went back the next night. Big thanks to Marco for the amazing service round two. Also very kid-friendly and close to our hotel, which made everything super easy.\nIf you’re craving that true New York Italian restaurant experience, this spot is a must. Don’t miss out!⛱️🇮🇹"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aWNibkJnEAE",
            "text": "Straight out of the kitchen from southern Italy.\nRocco brought the love to America.\nJoanne, the owner will come to your table with an iPad and digitally show in full detail all the beautiful displayed dishes she has to offer. In the back of the restaurant, there’s an option where the roof can retract and you could have dinner under the sun or the stars depending on what time of the day you go.Next door they have a hidden classy dining,Party room behind the gelato display. They have a full bar with special drinks and the music made it feel like you were in a party of your own.\nThey offer delivery service as well.\nPedro was our waiter,he was awesome. The place was very busy and yet he had the time to come over to the table quite often to make sure everything was good with us."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUVMyZFhjamx0VkcxdVdWaFRTbEJJY2toZlRsRRAB",
            "text": "The service and food was incredible! I am definitely coming back here again! I went with my family and ordered drinks and multiple appetizers and entrees and everything was delicious. We ordered the dirty martini, IPA, and the thin crust pizzas. The food introduced by the hostess on the ipad all looked delicious as well! I will definitely be coming back here very soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sclJXbEJabTFPY0hKVGNuVnNXWE5uUzFOSWVIYxAB",
            "text": "It was my first time here and the service was amazing and the food was phenomenal. I ordered a couple of pizzas, salads, and cocktails and my experience was amazing. The customer service is on point. I highly recommend this establishment if you are by the area. I will definitely even order  out to take it out to the beach. Thank you so much for your service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4T1ZXUnllVEZKWm5oSU5qbFNMVEZ0V0ZoRFpXYxAB",
            "text": "Fantastic service and food in Rockaway. Salad, pizza, gelato… all top notch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOT2VYQmFkemgzTmtweFkxUnliMWQxYlRoM01rRRAB",
            "text": "Food was delicious and staff were fabulous.  Service was attentive and top notch. Food had plenty of flavor and perfect plating. We came all the way from Suffolk County to celebrate our anniversary and they did not disappoint.  We will be back for the Lemoncello Spritz, Spicey Chicken cutlet w/rigatoni and my favorite, Tiramisu. 💋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabmRYb3lNRU5rUTB0b01YaEtlbTAzY0hCVWMzYxAB",
            "text": "Vincent the owner was a pleasure to speak with and an absolute gentleman. He was very kind to us and it was nice seeing how passionate he is for his family run business. I will definitely be returning here!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NVdVMHRPR3RrUTBKS1QyTkpXSGxuWldJdE5XYxAB",
            "text": "Phenomenal everything."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRemRVWXRUMEpQVkZWbVNtYzBTVzV0ZG1VMFZHYxAB",
            "text": "Some of the best food we’ve ever had tbh! You can tell they use quality ingredients. The pizza sauce is to die for. Highly recommend this place. The service was also amazing. Our sever was Lauren and she was super nice! Our hostess was also fantastic. Def don’t miss out and go here!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCT1IyVjRSSFpKVlRSS1lVSm9URmRxY1RSWlMxRRAB",
            "text": "Hands down the BEST pizza I’ve ever experienced. The service from Lauren was phenomenal as well. Cocktails, gelato…. ALL SUPERB!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdVJ6ZGtVRUp4YjNKelVGbE5URUYyYUZaV2JIYxAB",
            "text": "Great pizza; loud vibes."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbDRuVlVBEAE",
            "text": "Great food awesome drinks friendly staff. The trifecta winssss!!! A must go to when in Rockaway"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMWMzSjBTMkp6TjJvdFgxRmZjVzlNTm1oTE1YYxAB",
            "text": "The food was ok. I've had better. The music was way too loud and you had to yell to have a conversation! It felt more like I was back in a club in the 90's rather than a restaurant. The waitress was bright and bubbly (a bit too much sniff sniff perhaps?) The pizza had a nice thin crust and was cooked well. I didn't care for the sauce as it was a bit bland. The spaghetti was served al dented which is as it should be but the shrimp Parm tastes a bit salty. Perhaps it was a fluke and I'll try it again as people in the area say it's a good place to dine. Maybe it's because I'm from Brooklyn and we have so many good Italian restaurants I'm hard to please? I'll try again and see what happens."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMVYwWmFhV2hMY0RVMWExbGFYMXBJZG1GVVJrRRAB",
            "text": "The frozen limoncello was good, the food was...fine a little oversalted"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeFRUZDFTM2hLWmtGaVZsTTBMVlJVWWxaU1NFRRAB",
            "text": "Fresh lasagna! It’s worth the wait."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RVQyaHRjRzFtWDFCQmFtZHJkRXhXVEdOTlJYYxAB",
            "text": "Great food, Very Friendly service. So many choices"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdk1WcFRPRUl6UVRkaFVuZHFaa3RHV1RWSFltYxAB",
            "text": "It’s good, but it’s not worth $5 for a regular slice, nor the “best slice in queens” designation."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVlNVdzFXRzk1ZUdOQldtcEVTRzB3UjNsVE9VRRAB",
            "text": "By far my favorite spot in Rockaway. Amazing food, SUPER nice people, great service. I absolutely love dining at Rocco’s.\nToday I tried their delivery service and ai just finished writing this review: The driver was so good! Super efficient,  very polite, great communication. He delivered my pizza all the way to my  apartment’s door (on the 4th floor) without me even asking. That has never happened before with any of the deliveries that I had ordered around here. Thank you so much. You guys rock!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUlJETlNWa2RHZEdJNVFrSjVUVUl4ZFhOUk4yYxAB",
            "text": "Did a beach day at Rockaway on the 4th and finally got the chance to check out Rocco’s of Roc Beach—a spot that’s been on my list for a while. The servers were great, super friendly and full of solid recommendations. I started with a frozen limoncello, which was perfect after a hot day in the sun—cold, refreshing, and not too sweet. My server recommended the meatballs, and they were outstanding -  tender, flavorful, and totally hit the spot. Since it was my first visit, I had to try one of their pizzas. I went classic with the margherita, and it was excellent. Crispy crust, a nice balance of sweet tomato sauce and fresh mozzarella, and just the right amount of fresh basil. Perfect dinner after the beach. I’ll definitely be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ1otNDN3RRAB",
            "text": "Rocco’s is an absolute gem! From the moment we walked in, we were greeted with warm, friendly service and a laid-back yet upscale beach vibe. The food was nothing short of amazing—fresh, flavorful, and beautifully presented. Whether you’re there for a romantic dinner or a lively night out with friends, the ambiance strikes the perfect balance. The cocktails were spot-on, and the staff went above and beyond to make the night special. Highly recommend Rocco’s—this place is a must-visit on Rockaway Beach!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOT1I0cVczNnVlRzJBRRAB",
            "text": "Rocco's of roc beach  brick over pizza was amazing. I ordered a large plain and peperoni . Nice combination of flavors and thin crushed.  I would recommend anyone that's around this place to try."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLdUd0cXVpenFlSVlREAE",
            "text": "I finally got around to trying this place and it was just okay. It’s a pretty cool vibe but there were a few things that turned me off. We sat in the back area which was fine but when it came to ordering food it felt like a long process. They go through 20 specials on a iPad showing pictures of the dishes, completely unnecessary in my opinion. We ordered meatballs and muscles in the red sauce for appetizers. The meatballs were good, but I wasn’t a fan of the muscles. They were the larger muscles and they were served on a plate so there was barely any sauce. I ordered the veal chop Parm and wanted to substitute the type of sauce and was told I wasn’t allowed…..The veal wasn’t good at all. It was really thin (good thing) but super dry and the meat was gray. Everyone else ordered the bucatini in the cheese wheel over a cutlet. We assumed the dish was going to be made table side (no biggie) , but wasn’t and the pasta was very gummie. Lastly, we didn’t get a bill and paid at the table with a credit card machine and  was asked if we wanted a receipt emailed. I just paid to keep it moving but who doesn’t want to check the bill to see if we were charged correctly."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzb2JfSGpRRRAB",
            "text": "Rocco’s has a Chefs Table and it’s quite an experience with talented Italian Chef Bruno. He crafts and perfects each meal meticulously as he explains each ingredient and the importance of its freshness.\nEach course is perfectly paired with a glass of wine and the portions are perfect!\nTheir 3 ingredients bread is literally fantastic!!!!\n\nService is amazing! Food is delicious!\nAtmosphere warm and friendly! Highly recommended and for $75, we left so full and satisfied!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NWFPcFBBEAE",
            "text": "Just attended the Chefs Table hosted by Chef Bruno which included several of Chef Bruno’s specialties, that were paired with delicious wines.\nThe entire experience was amazing!  My favorite was his risotto with Gorgonzola and asparagus tips!  Simply divine!!! Chef Bruno carefully explained the ingredients used in tonight’s tasting and where they were sourced as well as his specific techniques for creating his unique dishes.\nIt was an amazingly delicious event."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbktDTlZ3EAE",
            "text": "My wife and I took an impromptu trip to Rockaway for the first time, via the ferry from  Pier 11. We popped into Rocco’s at about 4:30 for a drink and quick bite before we got on the ferry home. We sat the bar and the hostess/co-owner greeted us warmly and went through menu highlights on an iPad. It was very helpful to see the pictures of everything. We ordered the meatballs and a small Margherita pizza. Both were amazing. The pizza is some of the best I’ve had in NYC. Thin crisp crust and amazing thick sauce with a sweetness to it. The other co-owner came over to chat with us and explained the cheese is homemade and the sauce uses authentic certified San Marzano tomatoes. My wife had a margarita cocktail and I had the frozen drink with vodka and limoncello it. Very tasty. We decided to miss our scheduled ferry to take a later one so we could stay longer. We were fortunate to be there at a time between lunch and dinner rush so it was really nice to be able to chat with the owners and the bartender and learn more about the place. We’ll be back, solely for the ferry ride and the food and service at Rocco’s."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeGVQWW93RRAB",
            "text": "There's definitely an up sell of everything from the moment you step foot in this establishment. Takes about 15 mins for them to tell you about the specials with ipad and photo presentation. The price for the Chicken Parm with Rigatoni was $42!!!!!!!! The portion was just normal size. If you've been to Vincent's you know the doggy bag you're bringing home. This is nothing of the sort. The pizza was the only thing we didn't hate. Nothing special about this place and will definitely not be returning. The pasta was made in house but it was hard and rubbery squeezed out of a pasta machine. Didn't even finish the pasta bc it was just not good. The Linguine was like eating zip ties."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeDVDQ2hRRRAB",
            "text": "A true local gem in Rockaway Beach that really impressed me!  Vinny who is one of the owners actually served us for our meal!  Everything we ordered was so delicious as all items are made to order!  We will keep tis one on our radar whenever we visit our family in Brooklyn!!!\n\nThe only thing you should know is on certain days they have a DJ playing old school dance music (Disco) which I love, but was quite loud.  You might want to call and ask their schedule if you want to have a quiet meal that I promise will not disappoint!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3N3NQOWlnRRAB",
            "text": "Biggest. Upsell. Ever. Hostess took 15 minutes explaining the specials with pictures on an IPad and told us it wasn’t on the menu.  Turns out it was an average pasta for 42 dollars!! Took forever to get water and also didn’t tell us about the credit card surcharge. Also, no air conditioning and no lock on the women’s bathroom. Super loud, had to scream to talk to my partner. On the good side, pizza was in fact one of the best in queens (got the margarita one) and had a pretty good frozen limoncello. But stay away from the pasta and tell the hostess to leave you alone!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbHY3VGZ3EAE",
            "text": "Saturday night reservation for two. My best friend and I. We decided to indulge and get about 5 courses.\n\nLet me tell you, everything that came out to us was presented beautifully, and tasted even better. We had the buffalo calamari, the grilled octopus, mozzarella carrozza, veal chop bruschetta, ricotta gnocchi with chicken cutlet and spicy rigatoni chicken parm. Every single bite was delicious and I couldn’t wait for the next course. Normally I’m not a big eater because I’m an ozempic girly. But OMG. I’ll die on the hill saying this is the best restaurant on this peninsula.\n\nAnd our waitress Bella. So attentive and nice. Always checking in and making sure we were ready for the next course. She was so wonderful.\n\n10/10 recommend.\nAnd don’t stop at take out you need the ambiance this place exudes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3LWRMZWpnRRAB",
            "text": "The best service! The food is absolutely phenomenal but the staff and atmosphere is what tops it off. Went out with friends and had an amazing dinner. Fun music and energy for a Friday night, good drinks, and delicious food! One of the few places in rockaway to get a killer Moscow mule too."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poU1gxaEVWbVY1VjB0UmNWTlJia2RRTjFKeU4zYxAB",
            "text": "My experience was amazing! I went with my family and the owner was super nice to my kids. Everything tasted amazing down to the ice cream. We had the special spicy rigatoni with chicken Parmesan 👌. My kids had a personal size pizza and they devoured it. For dessert my kids had chocolate and vanilla ice cream. The chocolate had chunks of chocolate bar in it. I had pistachio ice cream. OMG 🤩🙌 super fresh and full of flavor with pistachio chunks. I will come back and try their other dishes. Top on my list for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINklhcnVBRRAB",
            "text": "I love love love this restaurant. Third time going in three months. Their spicy rigatoni with chicken parmigiana is outstanding. And I usually do not repeat restaurants just because I like to try new places. But this restaurant has a hold on me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5aHZqdnhnRRAB",
            "text": "As a Queens local, I think the thing that impressed me the most was the variety of fresh ingredients at a reasonable cost. Their cocktails are amazing. We ordered a tuna tartar special, salad, gorgonzola gnocchi, and their famous pressed veal parmagiana. 2 drinks for each of us and a slice of their pistachio tiramisu. We were so impressed by the staff, asking our names, our allergies, etc. Our waitress Isabella was so warm and helpful with any questions we had. We truly truly were so impressed. We can't wait to return. This place is a must try."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSc291dTdRRRAB",
            "text": "This was one of the best dine out experiences I've ever had. From the hostess to the waitress, the service was incredible. The food was delicious, and the atmosphere was so welcoming. We will definitely be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4el9pRUdBEAE",
            "text": "Gorgeous restaurant located a block or so away from the beach. Great place for a bite after a day out. The staff is so inviting, they really want you to feel welcome. They really come across as a tight knit group. As for the food, pizza is gorgeous, penne vodka and chicken marsala were spot on as well. Same for the hazelnut ice cream. Definitely worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cnVLdEh3EAE",
            "text": "The food was amazing.  The drinks are strong and so tasty. Loved the service. Feels like everyone it there to help you with whatever you need. The restaurant it self was a little small but they do have a small bar area and outside seating in the back. The location is not so great it's on a side street and it's a busy spot so might not recommend for a late night but the beach is only a block away so that's a plus."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MGJfTFVREAE",
            "text": "As a place that got their pizza voted as the best in Queens, I was quite disappointed when I tried it. The ingredients of their pizza is high quality and the chicken we got on half of our pizza was cooked perfectly but their crust was just okay and even though I came to pick up my order just 5 minutes after they said it was done, my pizzas were almost cold which detracted from the overall enjoyment of the meal. The service was okay, there were five people working and only one customer when I arrived and one girl refilled the customer’s drink while the rest of the staff watched instead of addressing my order and their lack of efficiency was disappointing. The pizzeria itself was clean and had nice, authentic pizzeria vibes but there are definitely better pizzas out there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSazhIOVN3EAE",
            "text": "We were greeted the second we walked in. Our waitress Elizabeth was very sweet and funny. I ordered the mini ravioli (a special) and it was the perfect amount and the sauce was amazing. My friend ordered the carbonara and loved it. We nibbled on the crunchy bread and oil, which was so good. Had a nice glass of rose and my friend had a delish pineapple/rum drink. The place was very busy (expected for a Friday night). My only complaint is that it seemed like our order got lost because others after us, got their food first. Everyone that worked there was kind and courteous. It was my first time to the area and restaurant, definitely would go back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sYVdXODNaRlZITUdSbVkxUmpTMUkyZFZveU9YYxAB",
            "text": "Great pizza pie to take away. Thin and crunchy crust, delicious pepperoni, and regular cheese. It just needs a little bit of salt on the sauce or cheese."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poM04weFFTbWN0VFhWbGNFNXFSa2hvVlRWeFpWRRAB",
            "text": "The atmosphere at this location is cute. The customer service sucks. I ordered an hour before I picked up my online order. Got to the restaurant my order wasn’t ready. I waited an additional half hour when I mentioned earlier that I ordered our food before coming to the location, the owners were very unresponsive and not attentive. It was a very unfriendly welcoming upon entering. The lamb chops were great. The spaghetti and meatballs were horrible. The meat wasn’t done only to have me in the restroom all night. I wouldn’t recommend this place due to the lack of service there and response to the customers with the unwelcoming service from the owners that I heard say to another customer that came in to pick up an order you can wait or cancel the order and get a refund in a very nasty tone and manner. I rate this place 3 on a scale of 1 thru 20 👎🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3Z3JEVHd3RRAB",
            "text": "I threw a surprise anniversary party for my parents in one of Rocco’s private spaces this weekend, and everything was perfect. Food and drinks were amazing, the staff (as always) was incredibly kind and accommodating, and Joanne and Vinny were super helpful from start to finish. This was my first time planning something like this but they made it easy!\n\nThe true star of the show was the INCREDIBLE cake made by Chef Bruno. I wish I could have recorded the gasps that came from my guests when they brought out the cake haha.\n\nI 100% recommend throwing your next family event/private party at Rocco’s!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsN29qOVF3EAE",
            "text": "Rocco's of Roc Beach is a culinary paradise! The attentive service makes you feel welcomed. The owner lives upstairs and everything on the menu is made in house! The pizza explodes with flavor. We got the White Truffle pizza and I was amazed.\nI got the Steak special. It was cooked perfectly and had a great seared crust. It was tender beyond belief. The ambiance adds to the experience, making this a must-visit destination for foodies.\nThey do the pasta in the cheese wheel which looks amazing. Next time I visit I will be ordering that!!\nLooking forward to my next visit here. Enjoy!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwX3FQR2J3EAE",
            "text": "The service was phenomenal!!! I love that they gave us a pre appetizer. The salsa eggplant was great with bread. The pizza was amazing fresh out of the brick oven. The drinks was a 10/10 lemon chelo."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldWNXOW93RRAB",
            "text": "Delicious Italian food! Very friendly staff. Good vibe overall. I definitely recommend getting a brick oven pie. We opted for wine, but they have a monthly martini list, and special cocktails that sounded delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSZzV1Y1Z3EAE",
            "text": "(We ) and large group of women went for their Sunday brunch ( theirs a waiting list) hence the 4 stars they get 5⭐️ for entertainment the pizza was delicious 5⭐️ for that to, the Brunch was good the board of eggs Benedict waffles pancakes was good the omelette runny , the pasta came out was bland drinks were Ala Carte and not cheap!\nWe had lots of fun dancing, I’d go again to dine in"
        }
    ],
    "reviews_count": 67
}