{
    "name": "SIMILAN ON THE BAY",
    "place_id": "ChIJjQW1GQBpwokRAut3VQszkT0",
    "grid": "QN14",
    "address": "3-75 Beach 92nd St, Far Rockaway, NY 11693, USA",
    "rating": 4.9,
    "user_ratings_total": 611,
    "phone_number": "(718) 887-0240",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UGFXdGtXSFZOVGpkMVEyNDVZa05mZUZWS1VWRRAB",
            "text": "Excellent service\nSpecial thanks to our server Gig for making us feel welcomed ☺️"
        },
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWVNYZHBSRlpFYkhkU1FVVnVWbTlOYlMxbFZuYxAB",
            "text": "Everything was excellent from service to decor, food and cocktails were outstanding! Definitely recommend, can’t wait to be back!"
        },
        {
            "date": "수정일: 8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oamNGSnJZMFZQV0c1WGExWllZbmxZZUVReVRFRRAB",
            "text": "We had a really nice night at Similian!\nThe food is delicious — we had the masaman curry, papaya salad, curry puffs, and basil fried rice. No notes! Very fresh, and great flavor.  The drinks are delicious too.\nThe staff are so friendly and helpful and the renovation really brightens up the space.\nVery happy to have this place in Rockaway!"
        },
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKM1ZWVnNiVk5WWTB3d2VWQjBlVmRZWHpjeFYwRRAB",
            "text": "Beautiful, great attention t detail. Amazing food"
        },
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUE1HbzRYM2hhVGtWdGNsWm1lR0YwU0doT1IxRRAB",
            "text": "Great, new place, great waitress great staff. The place is gonna be a hit."
        },
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUGRFa3lZakZIY2xsSlIyWlFhRkZhTjNWbGJYYxAB",
            "text": "Our server Gigi  was amazing. Friendly attentive and kind.  With a great smile.  Service with a smile goes a long way!"
        },
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWVVVMVZSalpWUlV4QlpWZGlSR1UzT0dWS2NtYxAB",
            "text": "Gigi was a pleasure to have. Atmosphere was super calm and quiet. Food was fresh and delicious! I ordered the crying tiger and sorbet for dessert! I’d definitely recommend."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oa2FFdHBZVXBETlZSeFZGWmhOVEJLUlRVMmNVRRAB",
            "text": "Greatly enjoyed the experience. Love the fact I have a great Thai food option in the neighborhood!!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsblZ6aG5UbkZCWTJGUVdsbHhXR1ZrV0ZOeFkyYxAB",
            "text": "Very good service and beautiful food.  I wish them luck in Rockaway!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psYWNFeEJWREo0ZUZneUxWQmphMVJmUWpsWGFsRRAB",
            "text": "Wonderful food and service.   Beautiful rich and well- blended flavors."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pac1kxUTJUMDl3VDFsQ1kwWlFaalZTVjJnd1oyYxAB",
            "text": "Gig was wonderful waitress. She explained all menu options, and provided amazing service. Everything was fresh and delicious. Excellent meal!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSFFXUXhVRVpqU2pjM1FtWkNNMGxFTm5wVmNuYxAB",
            "text": "Great Experience!  Maemay was so welcoming, sharing the favorites from the menu, checking in to make sure we were doing well and making sure the food was good.  First time and the food was so good from the appetizers, entree and desert.  I know we found a new home :)"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdGNFZE1ZbkZDWkdOZk1USXhZV2hqVEVkbVFuYxAB",
            "text": "Great food and service"
        },
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabk1XMVNTV1ZoWVZVNFMxaFBZVGRaYzJjeE0xRRAB",
            "text": "So happy it's in the neighborhood! Great food, incredible drinks, and a fun vibe."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3dFlWWlNUVmR3ZHpWblZEbDNibXgwUm5WS0xXYxAB",
            "text": "Wowww!!! Just wowww!!! Amazing from the walk in, the aroma is just welcoming. The dining ambiance is so fitting to the scenery🫶🏼.. What an experience to have.. and the fooddddd 10/10!! Seriously one of the best Thai food restaurants I’ve had tried, before them it was only one now… they might’ve taken the #1 spot the service is unmatched they’re very attentive and friendly sweet people can’t stop being in ahh 😯 💛. Something that stuck out to me is they have an open fish bar and you don’t smell it but I love it there and this is my second day in a week coming here says a lot coming from me 🫶🏼🫶🏼🫶🏼… wish you guys much success"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MFVUSXhlVTR6UWpVMFVXTmtja0ZrUlZKWVlXYxAB",
            "text": "My lady and I travel everywhere and try food. This is one of the best Thai restaurants in NYC. People trust me I’m a hard critic."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFd1FuZHZibmw2YkhBM2QyNXdTVEZ0WlVsMGIzYxAB",
            "text": "Great food, and great service. Krista was great, made sure we had a great time. Will be back again"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOb1RFUnJNa0YwVEhOeFVtaEtNRzUwTlZJdFVtYxAB",
            "text": "Attentive service and excellent and interest menu. Everything we got was delicious."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWVpUUTRNSFo2VWxaWmVuTk5iMjUzYWtFeE1VRRAB",
            "text": "The server Christa was wonderful!  She was professional, friendly and answered all of our questions thoroughly!  I highly recommend Similan on the Bay for delicious food and excellent service!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnemMyZEdiWGx3TFZaSWJXNHpSREZaU0VSUFYxRRAB",
            "text": "Gig was a wonderful server and the food was beyond delicious. Upgrades to the dining room are beautiful and we will definitely be back soon!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTFdqZFZhR2x0WlVobmFtUlBlSHBKVmtsWE9WRRAB",
            "text": "Puifai was amazing and had great menu recommendations! Steamed branzino was excellent and so was the crab curry."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201ZllrZHZUSFZXYTBVeU1USnRjSEpVY1RoNVNHYxAB",
            "text": "Service was excellent. Food absolutely delicious. A beautiful atmosphere"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNlFXRnBZM0pyWjFSeU1VRnRPR2xoV0RGdU1GRRAB",
            "text": "Krista was amazing!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NME1sSnJiekZpWDJNdGNWSkVibE5pY1VoWVMwRRAB",
            "text": "I can see why this place has 4.9 in ratings! It's only been open for a couple of months I was told, and I was very impressed.\n\nFirst off, my server, Christa, was so attentive and recommended the best, most authentic Thai dishes, which were the mangosteen salad and the Goong Karee (curry prawns). The flavors were incredible and so tasty!\n\nFor dessert, I mentioned in passing it was my birthday and they came out singing and a candle with the banana coconut cake I ordered, which was delicious as well!\n\nThe atmosphere is great as well. Stylish and warm and spacious. This would be a great spot for a date, but also a big group celebration. At the moment, they've got halloween decorations up to add to the festive vibe.\n\nThe only thing that makes me sad is that I live far! I will definitely find time to come back here though - there are more items on the menu that I'm dying to try!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205b1h6bDZOSGRpWVRRMWVHSlhiemhUTlhSUlUxRRAB",
            "text": "Fast and efficient service, good food"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUFYyTXRhekpxUTJoSVNXNUdPRGhsTFhaVlVWRRAB",
            "text": "Food was excellent. Service  very prompt. People friendly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tab1MwVnRNRWRWYTFvNGRIaFdkMU42YjFCM1RtYxAB",
            "text": "Krista our server was great"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wc2RWUlFVSFpwWjJ4V1UyWTFlV05tU2tZeVpHYxAB",
            "text": "Such great atmosphere and customer service.  Crystal & Tain was amazing. Highly recommended."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SVdtczFlWGxyZVY5elQyZExOMmhEVHpKWmJWRRAB",
            "text": "Very beautiful restraunt off the water, if you’re feeling like Thai food defiantly check it out."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVmN5MWpjRXh5VVVOTU9GazVNRkpUWWs5QmFuYxAB",
            "text": "Tamar was great!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aVgySjBibkpGWnpkSGNFTTRPVGxFV1U1NlVsRRAB",
            "text": "Made me a vegan peanut sauce with veggies and tofu, yum!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUE9GRnNWemswVDFFelNVazBPVXB6YW5seU1HYxAB",
            "text": "So happy they reopened a Thai restaurant again at Rockaway Beach!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUVYyTXhWVmRJT1c1bFdFb3RlbkJ3U21zdFRuYxAB",
            "text": "Such a wonderful experience. I freaking loved it"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTmFVWnVNSHBCY0hsSlJHMTVjVXBhYWpsSlptYxAB",
            "text": "Food and drinks were amazing. The short rib special was so satisfying and tasty. The calamari and papaya salad are delicious starters."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVk5uRkRRbDlXVkhkd2VHZExZbXRWU1doSlQzYxAB",
            "text": "Great service from the staff! Great atmosphere and presentation"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbFJtTnpjRnBLVUVSRlZGRnBOSHBOVkZWaVMxRRAB",
            "text": "The crab fried rice was delicious,  the service was excellent! Will return soon."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WV2FraE9NRVZQUzFVNVNIaFhWVGxsTUV0RU5GRRAB",
            "text": "Great food and atmosphere! But expensive for the amount you get"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRWFVY3lNV28zUmt0eVgwUkZaMTlXY2xWbExXYxAB",
            "text": "Ticha was an amazing server, gave us the best recommendations, made it feel like it’s a very welcoming place. Make her the manager Ticha for the win. Food and drinks were perfect"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKT1VVbGhUalJ2UjAxVlptRnVMVzlVU0hKclZYYxAB",
            "text": "So glad I found this place. I’m vegetarian so it’s hard to find good options in the area, the mock duck was amazing. And the experience would not be the experience without our server Ticha. She truly is so kind, likable, and had the best recommendations. GIVE MY GIRL A RAISE!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ab1pEQTJNbWxvTm1SUGFFSnNia2g2VDJjNU5VRRAB",
            "text": "Really good food and atmosphere. Got the mangosteen salad and duck curry, both were delicious, highly recommended!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RFp6RmZaRzk2UlhGdVVrdGxabnBwV2pkWFUwRRAB",
            "text": "I had an amazing experience at Similan on the Bay. The restaurant is beautifully designed with a warm, modern atmosphere, chic teal booths, stylish bar seating, and cozy outdoor tables overlooking the water. The views are absolutely spectacular, especially at sunset.\n\nThe staff was exceptional. Mia and the rest of the team were so attentive and welcoming. Service was prompt, and friendly.\n\nThe food was delicious. Combined with the ambiance and service, it was a very pleasant experience. Definitely recommend stopping by."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUlExWjBYMk5sUWtaNlV6SnFjWEJhZDB4bVFrRRAB",
            "text": "Everything about the new Thai restaurant Screams Delightful! From the moment you walk in, you are welcome by a wonderful host who sit you out on the beautiful back deck over looking the bay.. Everything in the restaurant was Recently redone: It’s definitely an elevated experience! The food has to be some of the best Thai food I have ever had! Ten out of ten for everything! We got a couple of our regular dishes and some great suggestions from our Waitress Puefei. She was very knowledgeable with the menu. She took her time to explain things. With her suggestions, we were able to try a few new dishes that we were very pleased with! I also like to add the atmosphere was very calm and relaxing. The music was nice and it wasn’t too loud. We were able to talk and enjoy our dinner. This place is a great vibe. We will definitely be back what a great and so much needed addition to the neighborhood!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTGJESnVVVTAxWWxOSU9UbEpjRkZNUjBaWFZFRRAB",
            "text": "Food was amazing. First tome here yo celebrate a birthday. I had a Michelin star dish. Delicious!! Will definitely cone again. Wait staff was great & the owners came ny with shots for the birthday girl! Classy!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSFVXdG9OV1ZUWmpKWVYyUnFaekYzVFVoWlpFRRAB",
            "text": "First time dining here, and I was completely blown away. As an island girl who grew up dining near the ocean in the Caribbean, this place instantly took me back. The atmosphere was spectacular—stunning views, beautiful décor, and the perfect setting.\n\nThe food was incredible! I had the curry coconut scallops, which were absolutely delicious. Our group of 20+ was well taken care of—the staff was attentive, friendly, and efficient. Orders came out quickly and exactly as requested.\n\nThe restaurant was clean, the music set the right mood without being overwhelming, and everyone in our group had a wonderful time.\n\nThank you for your warm hospitality. We will definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4c1VVSjNlV1pIVW10V1lYbDBWMU5XT0MxeFpsRRAB",
            "text": "Amazing! I came here to celebrate my birthday and I had an awesome time there. The food was really good the drinks were really good as well. Our server was really sweet. Recommend getting a patio seat before summer ends."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRFlYQldNM0V4TVhWc1ZIaDBkM2RWT0ZsYU4zYxAB",
            "text": "We had lunch here on a weekend. Authentic tasteful Thai food with good presentation, even my kids enjoyed so much. The decor is nice , on the modern side. The bay view is superb, on a beautiful day, it's perfect place to sit down and sip a drink. We will definitely come back in the future."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toM1RYTnZlbmt0U1RGTmIyVnlYME5zWTJOU1dXYxAB",
            "text": "For a starter we got Mangosteen salad. It’s so refreshing. Our main course we ordered Pla Lui Saun and Crab omelette. Everything’s delicious. Staffs were friendly and attentive. The atmosphere is relaxed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cGNEbDFWMk15VlhacWMwZ3lkVTlZTnpkVmVIYxAB",
            "text": "The food is absolutely delicious, the decor is amazing, the restaurant has a great atmosphere, and the staff is excellent. I highly recommend everyone to give it a try."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ZlNpMDFiMlJyUjFoRlRVdzFWRmRNT1VoUVFtYxAB",
            "text": "Gorgeous views and wonderful decor. Food was amazing. Service was top notch."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eWVGVlJZWGM1UzBSYVIybFBjMWRMUXpsdU4zYxAB",
            "text": "Food was on point. The furniture was modern and high quality. The restaurant is right on the water. Ticha was our server and she came with incredible energy. It was pricey but not too crazy and definitely worth the price. I plan on coming here more often."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NNFJsSlpXR3RPWm5OT2IxZHZPWEpwVXpobFFuYxAB",
            "text": "I had a fantastic dining experience at Similan on the Bay in Rockaway Beach. This spot offers a wide variety of Thai seafood dishes that truly impressed me. The standout for me was the whole fried fish Pla Lui Suan—perfectly crispy on the outside and full of flavor inside. The Mangosteen Salad was another must-try, refreshing and unique.\n\nI also tried several other dishes, including the Crab Fried Rice, Crying Tiger beef, Tom Yum Hotpot, and Grilled Squid—and none of them disappointed. Everything was well-seasoned, fresh, and beautifully presented.\n\nAnother plus is their full bar, so you can enjoy cocktails or mocktails while taking in the gorgeous bay view. The atmosphere is one of the best parts—being able to see the water and the bridge makes the meal feel extra special, and at night the view becomes absolutely stunning.\n\nHighly recommend this place if you’re looking for authentic Thai flavors with a scenic, relaxing setting."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwd1drSlJVMFZzTTNnd1draDRNRGxSYzJ4Nk5uYxAB",
            "text": "Great spot! The food was delicious and the vibe was relaxed. Mia was awesome, friendly and attentive. I’ll definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeFFUUkNaRWhLUlRscmJrVmZUSGRGZEZBeE1FRRAB",
            "text": "Overall great first experience, the portions are large enough to share and everything was expertly cooked. The host and waitress did a fantastic job making us feel welcomed. Great atmosphere on the water. High end but approachable, exactly the kind of thing Rockaway needed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dlpuQTViekZvV0hKamQwNWxaRlo2UkZkd1MyYxAB",
            "text": "Everything it's was so amazing Thai food. Service   food   restaurant here is the best. Perfect! Perfect! Perfect!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jdFExVTNTVEpxTFZKSlJYRjFha0pVVFVkd1prRRAB",
            "text": "“The food here is delicious, the service is excellent, the view is beautiful, and I would love to come back again.”"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kc2JIWk9iRXRMUW5oak5IRnBaVkZ6UkROUVRWRRAB",
            "text": "Great ambiance on the water. Food and drinks were exquisite!! It had Manhattan restaurant vibes in Rockaway. Service was also excellent! Can’t wait to try the rest of their menu!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd1VuUnlTVkl6UVVOVWJsSXplbmcwY2pSQmJFRRAB",
            "text": "Very nice and welcoming, servers were very attentive, drinks were great. Food was good and service was expedited. General Manager was very attentive as well and made it a priority to introduce himself. Will definitely come back soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWmNqTmZTM0pxUnpGZlJVaERWVVZRYlhKNFZsRRAB",
            "text": "I love this new spot !\nBeautiful decor and ambiance\nThe food was delicious and the staff was very friendly .\nNo I was no paid to write this\nAs a local in Rockaway I sincerely want good business here to thrive ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUGFUaENiM1ZhVW1OME0yb3dXRkJ4TUhkSWRGRRAB",
            "text": "I had an amazing experience at SIMILAN! The service was excellent, and the fish was so fresh and delicious. I celebrated my birthday here and the cheesecake was absolutely on point—such a perfect touch. The ambiance is great, with the option of outdoor seating that makes it even more enjoyable. Highly recommend for anyone looking for quality food and a welcoming atmosphere!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeWF6bFhNM2MxVFRNMFJETjBMV2RuTkUwdGVrRRAB",
            "text": "Great new Thai  place on the water in Rockaway!  Modern decor and great friendly quick service. I will definitely go back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQ1lrdFdkV001ZEhOWVUzQXdWMG8yTTNCaVNtYxAB",
            "text": "The vibes here is amazing, perfect place to eat dinner and watch sunset. The food here is delicious, highly recommended :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oZk5YaE9aMW8yVldGNlozSlhhbFphYm5kcmRXYxAB",
            "text": "Amazing experience! The food, drinks, and service were all awesome, and the space is beautiful. Instantly became one of my favorite spots. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTFpWVnZPWFJJWmxrelJHSldPVW80VTNoVmNHYxAB",
            "text": "Fantastic from start to finish! Thank you for an amazing night. All dishes so flavorful. Bee Bee our server gave amazing suggestions and was an absolute pleasure!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRFNESkxVR1JVUVc5NmNGUldhV1ZEU0RkQmRXYxAB",
            "text": "Excellent food and beautiful atmosphere\n\nWe just came here for our second time.  The food is spectacular.    There is nothing else like it in the Rockaways."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jM1NqWkRSR3RyWVZwc2RtSmpOa1U0VW1oMVEzYxAB",
            "text": "What a wonderful spot for a date night! The food was delicious, the view and atmosphere were incredible and there was even some live music. We had the Thai dumplings, Crying Tiger and Pla Lui Suan. Would absolutely recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VVVWRXhVbGs0Y2xSSGJraFJiRXBXTW1SQlgzYxAB",
            "text": "Thicha & Miya\nThe staff provided excellent service, and the food was delicious—just like eating in Thailand. Anyone who wants to try authentic Thai food must come here. Most importantly, the view is beautiful, and the atmosphere is wonderful. ☺️❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTE5ubzJhbXBtWjBSa1ZXWm5PRVptYlRGVGFVRRAB",
            "text": "Came here for my birthday dinner after seeing a random post on Facebook. Did not disappoint! Food was amazing, so many unique flavors and the service was phenomenal. Our server suggested many dishes, all of which were fantastic. Ambience is very calm and elegant. Will definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWmJHbE9RMFZsWDBOYWRtTmtUbVpJWkZwSGRYYxAB",
            "text": "I had a wonderful time! The food was very good, and the service was excellent. The waitresses were friendly, attentive, and gave great recommendations. I will definitely be coming back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMlJHOU1Oa05vTkhoZlZFeDRXa0kwV1VGd2FHYxAB",
            "text": "I recently visited this new Thai spot and was blown away by the entire experience. From the moment I walked in, the atmosphere was warm and inviting, with a fresh and modern touch that still felt cozy. The staff was incredibly friendly, attentive, and genuinely excited to share their recommendations, which made the whole dining experience even better.\n\nThe food was absolutely exceptional—every dish was packed with bold, authentic flavors and beautifully presented. The Pad Thai was perfectly balanced, the curries were rich and fragrant, and even the appetizers had that “wow” factor that made me want to try the whole menu. You can tell the chefs put a lot of care and passion into every plate."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pack1qQkxiall4ZG0xUWNqWXdkMkY1ZVRWVGRIYxAB",
            "text": "First and foremost, Mia was a fantastic server, she said she was new but was a pro! We loved the good, definitely try the duck curry, and the picturesque setting was excellent! Everyone was so kind and welcoming, I’ll definitely be back again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OT2EydHRNbXAyZEVkWFJEQlJhMmg1YTA4MWJFRRAB",
            "text": "The ambiance by the water is beautiful and scenic. The food is very good, and I especially enjoyed the Thai iced tea. Our waitress, Charlie, was professional and offered great suggestions. I will definitely be coming back and will highly recommend this place. Thank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WeWNra3djbTVJWVZGeGVVUXhXRlJGTWt4RFJsRRAB",
            "text": "Only a month and a week old, my husband and I  decided to have lunch at Similan on the bay.\n\nWhat a beautiful restaurant. Everyone was so pleasant and happy to see us.\n\nWe had the lunch special which included an appetizer, soup/salad and an entree.\n\nMy husband ordered the fried dumplings, coconut based chicken soup (I’m sorry I forgot the name) and the Crying tiger entree.\n\nI ordered the scallion pancakes, salad and the crab refried rice.\n\nEverything was absolutely delicious. Hot and fresh and came to our table quickly. My husband ordered a strawberry lemonade. He enjoyed the lemonade so much he ordered a second one.\n\nWe sat out on the patio which was such a pleasant experience. What a beautiful day.\n\nWe are definitely coming back for sure. What a lovely afternoon"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WldsTnpkSGRHYmw5R04zZHFNbFJSYkhoemIzYxAB",
            "text": "We loved Similan Thai Restaurant! From the beautiful decor to the excellent recommendations from our waitress, everything was spot on. The drinks were refreshing and the food was absolutely exquisite — full of authentic flavors and beautifully presented. It was a perfect dining experience from start to finish. We’ll definitely be coming back soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMlMycHhWSGRPZDA1ZlkwSlZiMDluYVZSblMwRRAB",
            "text": "Amazing food especially the appetizers. Highly recommend!! puifai is a great server, she treated us very respectfully and showed so much kindness. What a fantastic place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRE1VRnJZMmswU1RCM2FrdHdSMUZIVW5abGIwRRAB",
            "text": "Friendly staff and very attentive (part owner) William.&Puifai (waitress) The food is delicious!! The chives pancakes are a must! Thai  dumplings and the crab meat, meal with noodles, melts in your mouth! What a nice change of pace for us!! We Will absolutely be back. The back deck (covered from the elements) oN the water,will be open all winter and decorated for Holidays! It’s so difficult to get outdoor seating on the water,so this will be beautiful for the Fall and winter!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kS2RsOUJWREpUV1hKblMzTmpMVkk0WldNMmEyYxAB",
            "text": "We’re big fans and regulars of sister restaurant Glin Thai in Fort Greene so had to check out Similan on the Bay and we were not disappointed! Gorgeous location, and delicious food! We sat on the covered patio and even had skyline views. Great atmosphere and beautiful finishings."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeldERlZibmQwUjFKVVZHUnJXVjlwU1RsRGEyYxAB",
            "text": "Delicious food and amazing service! It was my first time trying Thai food and I will definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0dGJVSm9hMHBXTFZOUGFuQnBZWGRYWlhZNE1HYxAB",
            "text": "Food was great. Drinks are awesome. Sunset is amazing. Service is perfect. Check it out."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMk9XNHROVWRDVm1adVJrMHdiRE4wUjFwTmJuYxAB",
            "text": "Great & friendly service plus stunning sunset while we enjoyed our meals all that was super happy time. The food so amazing all those go along with incredibly cocktail 🍸🍹."
        }
    ],
    "reviews_count": 79
}