{
    "name": "La Playa",
    "place_id": "ChIJzZKTVEFowokRkvKuo6_SRtk",
    "grid": "QN14",
    "address": "87-16 Rockaway Beach Blvd, Far Rockaway, NY 11693, USA",
    "rating": 4.1,
    "user_ratings_total": 188,
    "phone_number": "(718) 318-8435",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWlNrOW1VblZtU3pOR2VXSXRUSGxIT1dVMVRVRRAB",
            "text": "Food is always fresh, great quality and quantity. Environment is fair , employees are friendly. I always get the baked chicken , yellow rice and beans or boneless fried chicken"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toT1UyRkZhREpXWTNCbVptOTFXalZhZEZNNGRIYxAB",
            "text": "You can taste the dirtiness from the pots in the food- it’s like a life and dead situation when I’m out of options . Their food make me nauseous and sick every time. They re used old food and create new dishes to sell 👎👎👎👎 This place is trash and the food is always dry.…"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sME1XeFJXSFJpTVhOR1Z6aDFjR1psWWtsQk5sRRAB",
            "text": "Buena la camina, y las personas muy amables. Es la segunda vez que paso por este lugar por motivos de mi trabajo, me paro y compro. Regresaria de nuevo."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMckZob3VGc1piUmd3RRAB",
            "text": "beef stew rice and beans"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPWDNpOGE3aTVMUzhBRRAB",
            "text": "Good food at low prices."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NHBDWkxREAE",
            "text": "This place used to be excellent, now that is under new management is horrible, you order one thing and they give you something else, without even telling you that they don’t have what you order, if you order a whole chicken you don’t get the entire chicken but 5 legs and two thighs. That’s not a whole chicken, and if you call to let them know about your order, they always tell you to remind them next time but they do t do shit about it, and now I know why they have lost their customers, horrible service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBemVYZnR3RRAB",
            "text": "The good was great, I had chicken stews with rice and gravy on it. It was delicious."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQMy1HRW5nRRAB",
            "text": "Great spot, solid basic food, no frills, fast service. One of the few places you can eat decently without getting a ton of plastic (they serve food on plates with metal utensils). And they don't raise their prices every few months like Claudette's, Super Burrito, the bagel place on 96th, everywhere on the boardwalk, etc."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaHJIa25nRRAB",
            "text": "Perfect Dominican restaurant in expensive and good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuM0s2SUlnEAE",
            "text": "I eat here most of my time especially when getting out of school they’re empanadas aren’t dry most times u just need a fresh batch but other then that there great straight Down from the rice and beans and the chicken stew and lemonade"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybXFYWlNBEAE",
            "text": "Food was trash..no seasoning on the salmon, empandas was trash.. cheap cheese"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOGVQS1ZnEAE",
            "text": "Hit or miss but moistly a hit, still the cheapest place to eat in Rockaway, the worst thing on the menu is their mac n cheese. but why would you buy it from a Latino restaurant anyways. wish they have green bananas daily to go with the pernil. the Pernil is the best thing on their menu. i cant give them less than a 4 because i know what keeps me going."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MHVXdkVnEAE",
            "text": "Best Food i liked !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUOWNudDdRRRAB",
            "text": "This is literally my favorite restaurant ever. The staff is friendly and service is fast. Then to top it off the food is amazing. Very flavorful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbWNDeTd3RRAB",
            "text": "Ribs and sweet potatoes\nRibs hard and salty as if the were left over from yesterday\nSweet potatoes needed some sugar and cinnamon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdUw3azR3RRAB",
            "text": "I enjoy the food at La Playa. I have been here many time and each time the food has been delicious. I have tried the pernil, porkchop, baked chicken, stew chicken, chicken soup, and have not been disappointed. The place is clean, the people are courteous and the price is great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eUxyV0JBEAE",
            "text": "18 dollars for two small plates. Not something made to order something they already had made. Basic chicken plate and a plate with stewed salt fish. 9$ for small plate where any other restaurant would have charged 6$. Not too mention there is honestly no effort put into this food. The cooks are not cooking with love."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeGNYS2Z3EAE",
            "text": "Excellent everything food, service, food. TV to loud."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdS1DUjFnRRAB",
            "text": "i don’t recommend this place, food tastes like has been sitting for 2-3 days"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1eHFha053EAE",
            "text": "Beautiful people"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1a01mTTBBRRAB",
            "text": "Hi. If you in the area stop by and try for your self.  The Shrimp, Chicken cheese Empanadas are Not only good but the Price is right as well.  You won't be disappointed. 🤤"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMkw2V1FBEAE",
            "text": "great lunch spot"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMkppclV3EAE",
            "text": "Muy buena comidas, y una joven me atendió muy bien, dijo que se llama Andrea muy bien servicio lo recomiendo el Restaurant"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZ0pPd2dnRRAB",
            "text": "Chicharron and cheese empanada were really phenomenal. Quick service and good prices too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNWViV2VBEAE",
            "text": "Had a great sandwich here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMk92UThRRRAB",
            "text": "Ok so . I been coming here for yearssssss .... I used to dine in alot . But as of lately I've gotten take out orders mainly .. I find hair in my food I call I get no accommodations. . I find plastic in my food I call I get no accommodations. The customer service is poor They are very rude and have lil to no concern about customers complaints . Today will be my last time ever eating from this place . A $20 oxtail plate I found hair in and to not be accommodated is crazyyyyyy"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdHNqREJBEAE",
            "text": "Good Prices\nGreat variety of Dominican food\nExcellent service\nBathroom available and clean\nVery tasty"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLTlUUUh3EAE",
            "text": "Recently visited and I have to say the empanadas are delicious as well as the soup. Everything was well seasoned and delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcGRXZTNRRRAB",
            "text": "The rice is very hard and the food is very dry. Rude staff!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1ZzlLWW5RRRAB",
            "text": "Food that doesn’t break your wallet is difficult to find near the beach but this place omg. A medium serving of food with a drink and empanada was 12 dollars. Just 12. I got a large with a drink and I think that 15 but I wasn’t close to…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPb1lUd0NnEAE",
            "text": "Food is good but sometimes too dry from being on display for a while."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybmM2TnpRRRAB",
            "text": "Delicious Spanish food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXeTZLLWVBEAE",
            "text": "The shrimp empanada was good but their Cuban sandwich was disappointing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNGJQWlZnEAE",
            "text": "This is my spot love yall lol"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHN2ZhVnB3RRAB",
            "text": "La calidad de su comida estas bajando mucho y Bien rapido"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJeGNUM1VREAE",
            "text": "BOMBB!! If you don’t know what MOFONGO is order it here!!! The best staff. The best smiles. And the BEST food!!!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROTY2dExREAE",
            "text": "Good food, friendly service, good prices! I like the chicken, rice, beans, and plantains quite a bit. However, the stew is also very good. I have not tried the ribs, but they look yummy. Ox tail not my thing, but they have it regularly as…"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRLUpHMVRBEAE",
            "text": "They're far from rude. Ignore the idiots review, they probably didn't know how to speak spanish. Their food is delicious. Kind of a language barrier if you're gonna order/eat there, but it's alright. Very polite people. Been ordering for a few years now. Best Spanish spot in the rock with great prices."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NnViNFF3EAE",
            "text": "I don't believe the owner is concerned with the perception of the restaurant. The women working the front of the restaurant must be related to the owner because everything from her personality to her attire is wrong.  The food is delicious,…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvMHM3Ri1nRRAB",
            "text": "I say this place is ok because they have actually improved on the quality of the food. However, the customer service needs to be improved. The women behind the counter look as if they don't want to be there. In order to run a business…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLMDlQWEdREAE",
            "text": "Swung by for lunch as wifey wanted lunch from here. Ordered a plate with chicken and a plate with pernil. Both were pretty good.  Don’t get the white rice. Get the yellow rice.  Also the macaroni salad has tuna in it but I like it as it’s not drenched in Mayo.  Overall big portions for the price you pay."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdEluZi1BRRAB",
            "text": "this was one the worst experiences I had, firsr we get there and didnt know if this was the place they had no banner with the name outside nothing that said La playa, but the . From the looks of it, seemed like a burned building. We still went in to try it.\nThis restaurant was filthy, the serving lady wasn't pleasant, it took like 20 minutes to get our food and there were just a couple of people in front of us. the food looked ok, and was very steamy. I order yuca with baked chicken, the chicken was ok but that yuca was like a gummy, gewy an no flavor, the other order was beef tail dear God  it was bad all I tasted was raw fat and it had that old taste like is been reheated several times. I don't think I will ever come back here to eat, they need to fix and clean this place, it is just horrible no what a restaurant should look like."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRM2FtTUtnEAE",
            "text": "I am Panamanian, have lived nearby for 10 years and have given them multiple opportunities, shame on me. The food is always lacking flavor, always extremely dry meats, beans are watery, and taste less. I have no idea why they are still…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVdWFEbGl3RRAB",
            "text": "big portions, cheap and delicious authentic spanish food!! Got the empanadas, chicken and beef and they were sOOOO GOOD, as well as a small plate with yellow rice, black beans, 2 legs of chicken, and maduros. I recommend"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjMUwyLUtnEAE",
            "text": "The price went up again from $11 to $12 now $13 for the meat entrees they couldnt honor the menu price that is posted right in front due to covid 19 the woman said the meat is expensive so they raised the prices .... understandable but i…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2bnRydGpRRRAB",
            "text": "Have been going to this place for the past few years and love it. Very tasty food and reasonable prices. Can especially recommend the garlic shrimp."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNmVYQ3pRRRAB",
            "text": "I love their food! It's always ready , and served quickly. The only Hong I would say is that the staff could be friendlier. A smile goes a long way! But the food is amazing"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbjhtUUVREAE",
            "text": "Place is outdated poor lighting need painting looks very depressing.food could be better. Carrots are hard price is to high ko Mk for the quantity they give. I would grade this place as C.This place needs to be reinspected."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3eXMyRGZBEAE",
            "text": "These people are lucky the neighborhood is not predominantly Hispanic. Otherwise, they'd be out of business. I have lived here 7 years and every time I convince myself to give them another chance, I am disappointed. Please do yourselves a…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5N09fT2hRRRAB",
            "text": "They don’t add any thing when u order take out. They don’t listen when u order and messes up your order. Don’t get me wrong food there is to die for. Yet I don’t understand when I come in person it’s not the same treatment"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURFNnNmbDZBRRAB",
            "text": "Great food, Great price!\n\nawesome place to eat or order from,especially when living in Rockaway your…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzbjZtTjh3RRAB",
            "text": "Good food. Good prices. Large portions. $20 will feed the whole family (of 4) if you're ever in a rush! It sucks that its cash only though."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvby1iMGtBRRAB",
            "text": "So far so good.,the food is inexpensive and the front staff 2 females are very nice.treat you good with much respect.and are professionnel. And the foid is prettygood.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNenFPSjlRRRAB",
            "text": "The Spanish food here is awesome. The prices are great and they give you a lot of food. The staff is very friendly. 100% I recommend it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dGY3cVFREAE",
            "text": "The food is good here but the ALL the workers look and act miserable!!!!!!!! It's a place I do not enjoy going to but I go only when I want a decent place to eat."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdnJfQ0lBEAE",
            "text": "Always treat me like family. I don't understand the comments here. It may be because you don't understand spanish body language. But food is fantastic, and prices are amazing as well."
        }
    ],
    "reviews_count": 56
}