{
    "name": "Deluca's Italian Restaurant",
    "place_id": "ChIJVVVq2KHKw4kRtDExWgrsuO8",
    "grid": "SI3",
    "address": "7324 Amboy Rd, Staten Island, NY 10307, USA",
    "rating": 4.5,
    "user_ratings_total": 713,
    "phone_number": "(718) 227-7200",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodFpYaENVekowWkZOZlUzbFlSMGRFTnpCVldGRRAB",
            "text": "From the moment I entered Deluca's Italian Restaurant, I sensed I was about to enjoy an exceptional meal. The ambiance immediately sets the perfect tone for a memorable experience. The highlight of my visit was definitely the Calamari Oreganato - a first for me and a revelation that changed how I perceive Calamari. Now, their preparation is the only way I recommend enjoying this dish. The Fried Calamari was perfect, with a crispy texture and well-balanced seasoning that truly enhances the appetizer. The Meatballs evoke a nostalgic, authentic Italian flavor, made with evident passion and skill. However, the real star was the Salmon, cooked flawlessly with a delicate blend of flavors that left me savoring every bite. The service at Deluca's matched the quality of the food — attentive, friendly, and highly knowledgeable. Every staff recommendation was spot-on, greatly improving the overall experience. In summary, Deluca's Italian Restaurant is a true gem in Staten Island. Its superb cuisine and excellent service make it a must-visit for anyone seeking authentic Italian dining. I give it five stars without reservation."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSFZrUTRaM1IwYXpONlZsTmtiMlZrUlhGbE5HYxAB",
            "text": "A friend & myself flew in from Charlotte NC for lunch. We came to try the lobster pesca tore. Rita was our waiter and she was pleasant & she took very good care of us. The atmosphere was excellent. We enjoyed the decor and the music. The food was truly amazing. It was worth the trip!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRldUaGtRV1pvY1ZwamR6WlZOWFJUU0RKck5HYxAB",
            "text": "Javier is bae affff LGBTQ friendly affff slay the house down boots diva down gagged love him love the food. If you love Rita’s you’ll love diva server Rita love everything love it here love yall"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWmVsTnlXSFpGU1ZCd1JsaEJSazlKVVdsbVlsRRAB",
            "text": "Love this joint. Old school all the way"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SFVVMWZPRWsyUVdaeGFUQmZVVlpVZWpGS1oxRRAB",
            "text": "I was at the DeLuca twice it was great The food is fabulous The service is great you got to try it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMGFYWXlXVmxhT1VWdmEySmtNbEpmVUdsd1RsRRAB",
            "text": "The BEST Lobster Pescatore I've ever had."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WFozZHpia2h5YkdkUWFqRjBiVUUzTmpOSVJHYxAB",
            "text": "We celebrated  with  family and friends after our Dad's burial.  The food was delicious and service excellent!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WlJGRktPSEZSTjNKTWFuVnJRM1l3UzFSV05GRRAB",
            "text": "Great food great service in an unpretentious restaurant"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeU9VRnNkVjh4Ym5KQ1FuVldZV2szWmxKT04yYxAB",
            "text": "The cookies are good but nothing special. This place is open late at night and feels like a nice hangout place. The area also has the vibe of a small coastal town far away from NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjdGJrazVabGRQTWtOMlJURkhNSGMzTUVkQ1YyYxAB",
            "text": "Came in for my father’s birthday and asked about their seafood plate that was advertised on social media. This plate contains a 2 lb lobster among other seafood. I would highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNVZUSnFSbTFhZGxOTGREbHFNek5HZUc4MWRXYxAB",
            "text": "Greatest staff ever,food is amazing, but I  have to be honest it did hurt the wallet"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQ1pUbHFiRWRYZUV0WmVtdFBkMWs1TkhKU2JtYxAB",
            "text": "Paid 45 bucks for the most narrow peice of salmon with few peices of grilled zucchini.  The dish was suppose to have collosial crab meat n they most of forgot cause there was zero.      However food was good but I left feeling robbed"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKV1QyWXdhM2MzVkVReWEzQldiMDlFTlZOa01rRRAB",
            "text": "Went with a large group. Parking was slightly difficult,  but they had a valet. Front room had a bar, but we sat in a room in the back. Service was excellent. We had multiple waiters who were very attentive.\nStarted with the Calamari Agradolce and Orange Fennel salad, which were both very nice. I chose the Orecchiette Barese as my 1st course. I enjoyed it because I like roasted garlic a lot. I only ate half and could not eat a 2nd course. It is very expensive but seems authentic Italian. I would come here again on a special occasion."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0emNtVmZSRzg1VlRkQmNHVnJNSE5yTFMxdVFsRRAB",
            "text": "Went here for Father's Day and LOVED IT! Drinks were great, the service exceptional and the food... Oh man the food was delicious. The meatballs were so good we ordered 3 orders, our kids couldn't stop eating. We also ordered the Spicy vodka pasta, the seafood pasta, chicken Parm and lobster pasta everything was tasty and portions were big. The Crème brûlée has my heart, best one I have eaten. Definitely going back!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMLVlsTHptNjRhbm9nRRAB",
            "text": "Gracie-! fantástico! super atención !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMU09nTmZhbXYtZ3l3RRAB",
            "text": "My plate was Mediocre. Nothing special. I saw the owner as we walked in no greeting or acknowledgment as we walked in.  My wife's and son's dish tasted amazing. However for the price point for my son's chicken was to thin and more cheese and not enough pasta.  Our appetizer the Fried Calamari was to little. Mediocre service so I left a mediocre tip.  My wife's dish had great flavor.  It was ok. Service was ok."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMnMzREdBEAE",
            "text": "The food was phenomenal, and the service was great! Highly recommend for lunch or dinner."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOUlMNFdnEAE",
            "text": "Delicious food and amazing cocktails. Lots of options for vegetarians! The servers and bartenders are terrific. I accidentally left my purse behind, and they kept it to the side for me with no issue. Thank you!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eDRmaDRnRRAB",
            "text": "First time ordering from this fine restaurant. Was just  takeout pasta. So good. Well prepared. Great taste and presentation. And that says alot for takeout. Looking forward to dinners there soon. Thank you"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dzRTbVhBEAE",
            "text": "EASILY the best Italian restaurant on the island. Every single plate from appetizer to entree is amazing. The lobster pescatore, the chicken parm with vodka sauce, the spicy rigatoni and the porterhouse steak special are all a MUST. The service/waiters are also amazing!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRd3N5NFRREAE",
            "text": "Service and food is very good pork chop was delicious"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneE8zeU1BEAE",
            "text": "Great Food and Service , beautiful old school atmosphere with a live band."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfejZYdUp3EAE",
            "text": "The food was great"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbzgza3JRRRAB",
            "text": "The food here was fantastic! I parked in the Dunkin Donuts parking lot. Everyone here was super nice and the place was clean. The food was so good I’m going to have to come back one day. Definitely recommend getting a reservation."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbzlIc1BnEAE",
            "text": "10 out of 10 highly recommend. Food was delicious and the service was wonderful!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmM1lUVjBBRRAB",
            "text": "Got Xmas eve take out of baked clams. Well worth the cost as they were tasty and robustly prepared . Everyone said they were great . Timely ready and service with a great smile."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aXF2UlFBEAE",
            "text": "By far the best meatballs I have ever had! Others in the party spoke highly of the sweet and spicy calamari."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeXFuTFdREAE",
            "text": "The lobster Pescatore and the Chilean Sea bass were Fantastic! I drove from northern NJ so it was definitely a longer drive plus tolls. Otherwise, I would easily eat here once a month."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzck1xU0NnEAE",
            "text": "Nice restaurant, lovely atmosphere, we brought a few employees here to show our appreciation for their hard work and they were blown away !"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeU1pUnF3RRAB",
            "text": "Yesterday I went to a party that was catered by Delucas. The food was amazing. Everyone was commenting on how delicious their spicy vodka sauce was and the best they ever tasted. This was by far the best catered food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdjhQSDl3RRAB",
            "text": "I came here to celebrate my birthday and I absolutely love this restaurant. Everything is all homemade and is very delicious.\n\nMy family and I started out with having calmaria,  homemade meatballs, and rice ball.  All very delicious and homemade.  I wish they made the meatballs an entreee it was very, very delicious.\n\nThen for the entrees I asked if they can make me chicken Francesca I got it with vegetables and potatoes it was very delicious.  I would highly recommend getting this dish even though it is not listed on their menu.  My husband and my father got their steak wow it was very delicious and it was actually medium well.  Next time I may get that dish.  My mother got a pasta dish with vegetables.  Everything was overall very delicious and a lot of left overs.\n\nFor dessert they came out and sang happy birthday to me and I decided to also get the Gelato it must had been the best Gelato ever.\n\nI highly recommend coming here and supporting small businesses."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNDc3Ump3RRAB",
            "text": "Food, Service and atmosphere is amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOWJYVjlnRRAB",
            "text": "It's just delicious and amazing! Wonderful, cozy place to visit if you're looking for savory dishes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcVpLcUdREAE",
            "text": "Beautiful place, great food and service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNVo3QV9nRRAB",
            "text": "It is very good but get ready to pay for your meal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaC1ESG5RRRAB",
            "text": "Deluca’s definitely a go to restaurant when you’re in Staten Island. The food is absolutely delicious, the staff and owners are extremely friendly. You feel like you’re part of the Deluca family. Another plus is they offer valet parking so you don’t have to worry about finding a spot to part your car.\n\nLastly and an additional plus, they offer a beautiful spacious two room addition to the restaurant for parties. It’s separate from the restaurant so it gives you and your party privacy from the rest of the diners."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuZzZTR05BEAE",
            "text": "Food was great service was good and drinks where on point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuN1ptQmhnRRAB",
            "text": "Meatballs, NY strip, and chicken parmigiana, were excellent!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNk1ETG9BRRAB",
            "text": "From the moment I stepped into Deluca's Italian Restaurant, I knew I was in for a treat. The ambiance sets the perfect tone for a memorable dining experience. The highlight of my meal was undoubtedly the Calamari Oreganato - a first for me and an absolute revelation. The way they've prepared this dish makes me a firm believer that this is the only way to truly enjoy Calamari.The Fried Calamari was another standout, offering a delightful crunch and perfect seasoning that danced on my taste buds. The Meatballs were a nostalgic nod to classic Italian cuisine, cooked with an evident passion for traditional flavors. But the showstopper for me was the Salmon. It was cooked flawlessly, achieving a delicate balance of flavors that left me savoring every bite.The service at Deluca's was as impeccable as the food. Attentive, friendly, and knowledgeable staff contributed significantly to the overall experience. Every recommendation from the server was spot on, enhancing the meal beautifully.In conclusion, Deluca's Italian Restaurant is a gem in Staten Island. With its exquisite cuisine and top-notch service, it's a must-visit for anyone looking for an authentic Italian dining experience. Five stars all the way!\""
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NmJfajVnRRAB",
            "text": "100% worth the drive from Toronto.\n\nI had been eager to dine at Delucas since I started following them on Instagram, and it did not disappoint! Their Lobster Pescatorie is an absolute must-try—flavorful, fresh, and worth every bite.\n\nRob, the owner, is amazing. He treats you like royalty from the moment you walk in, making the dining experience even more special.\n\nIf you're in NYC or NJ, this is a restaurant you absolutely must visit. It’s an unforgettable experience that lives up to the hype!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4a2ZXSFRnEAE",
            "text": "Amazing Anniversary dinner! Started with the best ever dirty martini. We had the fish salad and grilled calamari appetizers. For dinner, my husband had the scallops with crab meat risotto, and I had the eggplant special with homemade rigatoni and burrata. For dessert, we shared the Italian cheesecake. Everything was delicious. Our waiter, Javier, provided exceptional service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eDZXMFp3EAE",
            "text": "I only came here because I saw a video on IG, and it looked amazing enough to make the trip to the end of SI. Starting with the staff who took my reservation and was tremendously helpful with questions on the menu items and securing a time before the evening rush, that's a great beginning to a new restaurant for me. When we arrived, we were graciously led to the table and immediately met our server, if I remember correctly his name was Juan. He went on to take our drink orders and tell us about their specials. Opting for the mussels, along with the complementary bread and their dipping sauce was a great way to start the meal. Mussels were delicious and the sauce was very deliciously seasoned. My girlfriend has the linguine and I went for the special lobster pescatore, the main reason I wanted to try this restaurant. The pescatore was in the fra diavolo sauce, which again was very well done and just the right amount of spice. Everything was cooked perfectly, except I feel like the lobster itself was slightly overdone. Everything came out in great timing, with one dish following the next. Her pasta and my feast of seafood were both very well cooked and treated our tummies very well. I would definitely recommend the pescatore as a shared dish, because I ended up taking half of it to go. Ending the night with the tiramisu and a pistachio martini, both a first, was a nice sweet treat for us. I'd gladly come again, as the entire experience was wonderful."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBOTZ5VTVRRRAB",
            "text": "Upscale restaurant that has amazing service and outstanding food. The interior could pass as a bit romantic or could be for family functions. Prices are on the higher end, but you’ll get what you pay for. Delucas will even cater to special…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1eDl6OFF3EAE",
            "text": "THE best meal ever!  Everything was made perfectly.  I tried two new food items that were outrageously delicious.   Everyone's meals were spectacular!  The service was A-1 also.  Love this place!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbXBDUDRnRRAB",
            "text": "My surprise birthday party took place at this restaurant, felt very blessed and grateful that I did.  The staff was friendly but the atmosphere was what topped it off. We are outside eating in the tent It was beautifully decorated, for a…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MHYyVVJBEAE",
            "text": "Definitely on the pricey side, but you get what you pay for. The food definitely lived up to the price tag. I was absolutely recommend Deluca's for date night and special occasion. Had the rice balls and the zucchini flowers, amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMmNLR3RRRRAB",
            "text": "Had a great meal there with a friend of mine who is serving our nation in the armed forces. The food was excellent. The service was superb and friendly. I look forward to returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtb1plRHVnRRAB",
            "text": "Fantastic cocktails - ice cold and mixed to perfection.\nIt was a quiet night and our service was wonderful with outstanding food. The price is steep so be prepared and fees are added if using a credit card.  There was parking in the back and they also provide valet.  Huge sign at the entry might be a bit off putting, if you have a different mindset.\nAbsolutely delicious meal from start to finish."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeHN6VzVBRRAB",
            "text": "Came here for dinner with a party of four. They first tried to seat us in the rear tent but were able to accommodate moving us to the main dining area after a short wait. You are able to get drinks at the bar while you wait. The service was good with attentive waitstaff. Food was delightful. We all had fun."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbTdMdVJREAE",
            "text": "*Super long review but so worth it*\nLet’s start off with the warm smiles we were greeted with when we walked into the establishment. There’s nothing like feeling welcome when you walk into a restaurant for the first time. Now onto the incredible food-\nI started my meal with a Peach martini which was *chefs kiss* and the perfect start. Giovani was an incredible and attentive server who explained the daily specials in great detail and made sure we had the best service. The owner (whose name I forgot to get) was ALSO walking the floor and tending to each guest as if he knew them personally. A visible and friendly owner is an EXCELLENT sign of what’s to come!\nPictured below in order: (1-10/10 being highest)\n*special* The sweet & spicy calamari with raisin & pine nuts. 10/10 (delicious)\n*special* Tuna Tartare with avocado and cucumber salad, chips. 900000000/10 (omfg it was bomb)\n*special* Stuffed Peppers with mozzarella, prosciutto & breadcrumbs 10/10 (spicy! Not for the weak lol)\nEntree: Truffle Rigatoni with crumbled sausage 90000/10 (incredibleee)\n\nOverall - you get the gist. I loved it - the atmosphere, the food (& the best part is there was a huge birthday party when we were there and they were having the best time ever.) The vibes were  ✨immaculate✨\nThanks for an incredible dinner! I’ll be back a thousand times over!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbnFqVFh3EAE",
            "text": "A party of 3 on a Saturday night no reservation needed. Decided to dine outdoor. They had a huge tent setup in the back which was great. No one’s wearing any masks though. As in people that work there and customers. We were the only party there had our masks on until we were ready for the food.\n\nAs for the food - mediocre at best.\n\nFirst, the shrimp pasta($38), the sauce was too sour and we didn’t know if they added too much lemon but sourness is the only thing we can taste out of the dish. The shrimp had good texture but lack seasoning. It’s almost like you’re eating boiled shrimp with some crumbs on it. The pasta was al dente but then again you would expect that out of any decent Italian restaurant so nothing to write home about.\n\nOn to the most expensive dish of the evening, the seafood ravioli($68). Good portion, lobster was huge! Again not much taste it’s almost like they combined two separate dishes, ravioli and a bunch of boiled seafood. Because that how I felt when I tried it. It’s like if you eat it with your eyes closed you’d think they are two completely separate dish. In some way the ravioli was better than the seafood. When you combine all of that experience with the price tag, is it worth it? not for us. Anyone can boil a bunch of seafood and then toss them in ravioli for less than that.\n\nI had the truffle rigatoni($33). Honestly the best out of the main course. Again you can probably buy some truffle sauce, chop up some mushrooms and Italian sausages and that’ll taste as good and cost you less than half of what we paid for.\n\nThe appetizers aren’t even worth mentioning, we had fried calamari and zucchini flowers with ricotta and mozzarella. The calamari were lightly fried so it’s still kinda soft unless you find smaller pieces in which they were a bit more crunchy. The cheese in the flowers was runny so you end up with a mouth full of runny cheese in your mouth. I don’t what for you but that was not good for us.\n\nLastly the service was good but then again as Deluca’s advertise themselves or at least tried to look like a fine dinning restaurant, that’s the least you can expect.\n\nThe total for the night came out to be $183 before tips(we tipped 18%). Oh if you pay with credit they charge you a fee which essentially is a way to entice you to pay cash which is rather odd for a so called fine Italian restaurant.\n\nI don’t usually dine on Staten Island though i live here. I find better quality of food in general for much much less in the city. If I want to pay that kind of money for Italian food, I’d go to mid town.\n\nYea it’s long, this review so the TLDR: the ice water was fantastic!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteFAtYW1RRRAB",
            "text": "Deluca's is an upscale Italian restaurant, living up to a well-rated reputation. I would definitely return to this place for a fine Italian meal. The presentations of food and drinks are stunning, with the taste matching the visuals...a…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bW9YOWF3EAE",
            "text": "Absolutely delicious from appetizers to dessert! The atmosphere alone is 5 star and completely left feeling like family! We enjoyed the service as well every one was wonderful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENktuSVpnEAE",
            "text": "We recently had a dinner party of six during a business trip. Much to our surprise they were able to fit us in last minute when we called  ahead. The presentation and taste of the food was excellent! We all enjoyed the Polpo Porcini (sautéed spanish octopus with porcini mushrooms, roasted potatoes, cherry tomatoes and balsamic glaze) and the Eggplant stack. The Branzino Livornese (Mediterranean sea bass in a light tomato sauce with olives, capers, and onions) was phenomenal! The portions really are so large that they can be shared!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwM2FIUTF3RRAB",
            "text": "Excellente! Staff, food, atmosphere was all very enjoyable. They tolerated my 3 year old quite well and went above and beyond to meet all of our needs. Zero complaints. Don't sleep on the creamy mushroom chopped sausage pasta was delicious 😋…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMlphS3N3RRAB",
            "text": "The place is very nicely decorated and clean. They have outdoor seating in the front as well as a patio and indoor seating. There is currently construction so at times the patio is closed. Today there was a party and therefore the patio was inaccessible.\n\nThe food was made with fresh ingredients. At my request, the pasta was served al dente. It was a good experience, but average nonetheless. The problem is there are so many Italian options in Staten Island that, to be more than average you have to really stand out.\nI would eat here again."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdGNlSWR3EAE",
            "text": "Me encantó este restaurantes por eso le doy 5 estrellas. La comida fue realmente lo mejor del lugar, seguido por la atención de su personal, el cual siempre fue amable y servicial. Cuentan con vallet parking, por lo tanto, el estacionamiento no fue un problema. La limpieza del lugar también fue muy buena, sólo un poco de desorden en le baño de damas."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzOHBTM09nEAE",
            "text": "Loved it, great food!... The drinks were great. I had a Lychee Martinee , its a must try!.The food was amazing. Staff were great ...they even had a really good dj playing . Its a little pricey...but so worth it!! You could ask if your dish is enough for two....mine was !"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4azhPcTRnRRAB",
            "text": "Excellent food!! SUPER excellent service, my new favorite Italian restaurant. Meatballs are to die for!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bXYzRnBBRRAB",
            "text": "Staten Island is known for the wide array of Italian restaurants, but this is one of those must eat at Italian restaurants on the island. The food and service is always great, Rob (the owner) always walks around and greets everyone which is…"
        }
    ],
    "reviews_count": 60
}