{
    "name": "Zara Arthur",
    "place_id": "ChIJTfnAAgBLwokRetLO1bIBRBg",
    "grid": "SI3",
    "address": "854 Arthur Kill Rd, Staten Island, NY 10312, USA",
    "rating": 4.5,
    "user_ratings_total": 113,
    "phone_number": "(929) 635-1500",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Nd2RYQlBNWFpsTTNrNFJEbGxSMDVWVlRkSFZWRRAB",
            "text": "First time at this location; great service from entering the place up to exiting. Servers were very friendly. Wait time for food is very good. Had the complimentary bread, then came the soup which my wife shared with me. Then came the mains about 5 minutes after we finished the soup."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tselYzRXhibDgxWldGTFR6Sm5TRjlQYm1ZNVYxRRAB",
            "text": "Delicious food. Fresh made balloon bread and olive starter was an unexpected treat. Very attentive service. Reasonably priced."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbWVsZGliMFowWWtGeWQxcHRRWFJoZFRWTGExRRAB",
            "text": "Food was so amazing that I forgot to take a picture of it. My mouth can’t forget the flavor and taste of this food ever! I will be back next week with my whole family. I got lahmacun which was the best I’ve had in the country, no exaggeration. The pita bred is beautiful as well. The pride of culture is in the food! I finished the food and was able to get a picture of the Kazandibi dessert which looked beautiful. Highly recommend you come here for a delicious meal! You will never forget it!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaWRsVkJUR1ZXYTE5SE9FcHNiVlF5UjFSWGVGRRAB",
            "text": "Thank you adil for service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psQ2MyaG5VWEZCY1Voa2NXbE1NazVrV2pacUxYYxAB",
            "text": "Mixed grill and cold appetizers"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WZmNHcDJkbTlQYlhOc1ZqTkRSbEpQWWtSaVYwRRAB",
            "text": "Service, quality of food and ambiance were very good! We will be back!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQlZXeERSRjlxWWxsQlVqQnNTMFZJUjFadFVsRRAB",
            "text": "I had a wonderful experience at Zara Arthur on Staten Island! The food was delicious and beautifully presented, but what really made was special was our waiter, Adil. He was incredibly attentive, friendly, and professional throughout the evening. He made great recommendations, checked in at just the right times, and made sure everything was perfect. You can tell he genuinely cares about giving guests a great dining experience. Highly recommend asking for Adil when you visit  he truly elevates the service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1T1VqQTJPRzlxVlhsUVV6QlJWQzFLVEU5dVpHYxAB",
            "text": "My food was not cooked they need to check when they cook foods I don’t want to eat a live animal this is nasty"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dGJGTnhSMjl6YmpadWIwNWZURk0xYzFsR1kwRRAB",
            "text": "It’s a great place. The food is delicious the manager he is amazing. I will definitely go back there again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeVRuVXhhM0UxTTNBMmFrTk5VV3BtYTFkaWQzYxAB",
            "text": "Had a fantastic experience at ZARA Mediterranean Restaurant! The staff was fast, friendly, and worked together like a well-oiled machine, making the whole visit smooth and enjoyable. The food was absolutely delicious, full of flavor and cooked to perfection. And the coffee? So strong and rich, it was the perfect finishing touch. Can’t wait to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdlltZzJRVXhRVGpJelNqaFlVRll0VjNoQlZtYxAB",
            "text": "We tried a lot of Turkish places on the Island, this is one is the best so far. Adil was amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTFVsVXpZblJDVjBvM2JtMW1SVnB3ZG1oTU5IYxAB",
            "text": "Terrible customer service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWU1rbFpZa0ozTFV4WGFYUlBXalJTV0RsRFRtYxAB",
            "text": "Service wasn’t great, as someone who wasn’t middle eastern I could see the service was better for other tables than ours. Food was decent but service  wasn’t good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTlJETk1ZVnBzTkhaaVlsVTJNeTFoVUVkSFFsRRAB",
            "text": "Adil was amazing! He greeted us warmly, gave great menu recommendations, and made sure everything was perfect. His service was attentive, professional, and friendly he truly elevated our experience at Zara Arthur. Highly recommend asking for Adil!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSWNHNVdZV3h2Ukd4Q1UybGFNbFZTY0hNNVkxRRAB",
            "text": "Can’t beat this place my go to for Lamb sish , love their rice and salads as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGS1JHY3lhWE53U0hwU1QyUnVTV3BSVEVwZkxXYxAB",
            "text": "Went to Zara's with a party of 8 on a Saturday. Place was packed! Fresh bread brought to the table. Fast and friendly service. Had the cold appetizer platter of hummus and other dips and then the Mixed Grill. Tons of delicious food. Meat was flavorfull and moist. Topped it off with some Turkish coffee and Baklava."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjM1RGQnpkbUpDWkdsemRXUlBlSGt0ZWpsNVlWRRAB",
            "text": "Wonderful Turkish food, prices are fair, and their customer service is good. I highly recommend this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUGRrRm1XbnB4ZVRSWmJsSnlTM1V5Ykc1Qk1sRRAB",
            "text": "Ordered a few dishes for pick-up tonight and encountered an issue with one of them. I called the restaurant, and they took care of it, delivered a replacement dish along with some extra items. Mistakes can happen, but it’s how they’re handled that really counts. Excellent customer service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1a1MwSkhOMVk0WHpWTk0xcFBMVzEzYkhSU2RIYxAB",
            "text": "Great service and delicious food and desert, very nice staff"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bFgyMXphMGxNYWxOYU9WcHJaa00xV2s5Uk9IYxAB",
            "text": "Great food. Diner atmosphere"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNFoycDVSa05HVEVsWVFrZENVRkZGVGxkb1RsRRAB",
            "text": "Everything is excellent, but the lamb kabob is really something special.  Oh, and the service is really good too."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205d01IRkJZV1J6U0VOTWNtNXdlSGRtTkc4eFQyYxAB",
            "text": "Open, casual atmosphere, friendly and welcoming staff offering great service, and fresh, delicious food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsM1F6Wm5URlE0YjNsd2FIbDJZM2hrTFVWWGNYYxAB",
            "text": "My wife and I love there food, very good and authentic. Delish"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NFp6VnZOMUpUYUVKdWMwRlVXRk4wZWw5RFFXYxAB",
            "text": "Always loved the food of Zara , on Hylan blvd , so was excited to see opening on Arthur kill road , first time when I ordered delivery it took almost 2 hrs to get a food , anyways second time I did pick up , and rice was overcooked , absolutely no taste , better next time I would drive to another location further from me"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdldUWm1aM2hwZDFWcWNYUlpja2t3ZEVFMGQxRRAB",
            "text": "Good food, nice staff. Cold appetizers👍👍👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aFp6a3hOR3cyUVZCRU5YQXhUVkkxVXpWQmMxRRAB",
            "text": "Very great food! Definitely authentic!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNVGZoN2prbllLU05REAE",
            "text": "Don’t waist your time and money"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MVNpMXlSSFZDZHpVM2FVdzRiVk15VEhsVlUxRRAB",
            "text": "First time eating there. I always wondered why I always see people in there. Food was DELICIOUS and nice staff."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNTGVpTTZGdTdTNXJBRRAB",
            "text": "Interest, very good food, he does not look for Turkish food, Mr. Yunus, the store manager, is very interested and professional in his job, I recommend it to everyone."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPcVRsYXpveGVQelZ3EAE",
            "text": "Its an other Zara restaurant in the island. The food is much better and tastier then Hyland blvd location. Bread is very good, gyro and chicken shish was amazing. Staff is atentive and nice. Good turkish place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOQ0k2S25rNXRqSlZnEAE",
            "text": "Staff beyond professional"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMVDh6ZWFhZ09YeXhnRRAB",
            "text": "Food was great, however the Ac is so up on that you turn into an icicle, be prepared to bring a coat, jacket hoodie, i didn’t get to enjoy my food bc my body started to shake from the cold air."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRlJrOWhSbTVsY2xBeE0zaEVPV3M0U0VWWlpsRRAB",
            "text": "Exceptional food. The salads were fresh! Meat Kabobs were tender and absolutely divine!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZUhxLWZ2bVlTQ1Z3EAE",
            "text": "Always so pleasant and delicious!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJLXI4YWV4Z28teml3RRAB",
            "text": "When I and my husband came to dine in at 9:40pm on Thursday we were told that “kitchen is already closed”.\n\nThen the front desk staff, when I asked again the hours of operation, said: “kitchen closes at 10pm today”. So is it closed at 9:40pm or 10:00pm?\nInconsistent hours of operation, nowhere it is mentioned that Zara on Arthur closes its kitchen at 9:40pm or even 10:00pm…\n\nWe were a party of just 2 people….\nNot friendly front desk staff.\n\nTherefore, all is 1 star.\n\nOther Zara’s had no such issue.\nMaybe that’s why this Zara has no people coming in…\n\n————\nOkay, so another try given to this location - another upsetting experience.\n\nSo I wait 35 minutes for my online order, and this time - Zara decides to take my money for the mixed appetizer plate, but never included it in my take out. Lovely. Wow. See photos for reference.\nIf you take out from this location - check the bags before you leave, not when arriving home. Starting now, I’ll be checking my bags before paying, otherwise Zara will mess you up and say it should have been like that. Wow, just wow.\nI am upset to see this type of downgrading at Zara’s location."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNlpHU0FREAE",
            "text": "Excellent food, service, and atmosphere!\n\nWe visited Zara Arthur for a family dinner on Sunday, Feb 16, just next day after the official opening. What a new gem we got in the area! Everything was excellent: nice decor and atmosphere; delicious food and desserts; quick, friendly and attentive service! Restaurant manager Yunus stopped by us to check how we liked the food and the service. We felt like dear guests and enjoyed our visit.\n\nWe highly recommend Zara Arthur for a delicious Turkish cuisine and great atmosphere!\n\nFood ordered\nAppetizers\nBalloon Bread with olives - freshly baked, with sesame seeds on top, it was a great start to the meal and a must have complement for the appetizers.\n\nMix Appetizers - 6 cold appetizers to choose. We got: Hummus, Babaganoush, Eggplant Salad, Sauced Eggplant, Aci Ezme, Muhammara. This is certainly a highlight of the menu! Delicious and lets you sample 6 appetizers! All were great and we especially liked Aci Ezme and Muhammara which were something new from the usual Mediterranean fare.\n\nFried Liver Cubes - The liver pieces were soft and tender, perfectly spiced, and overall delicious!\nCheese Rolls - great, with melted feta inside.\nLentil Soup - excellent, as it should be.\n\nEntrees\nWe got 4 different kebabs and all were really excellent and tender.\nLamb Shish Kebab - perfect and flavorful.\nAdana Shish Kebab - delicious and flavorful.\nChicken Shish Kebab (small) - our 10y old daughter liked it so much that we didn’t even get to try it.\nBeef Shish Kebab - medium rare, soft, melting in the mouth. However, flavor was a bit lacking on this one. Some marinade or spices would make it better.\n\nDesserts\nBaklava - very fresh!\nKazandibi (milk pudding) - good\nKeskul (almond pudding) - good\nTea - this was one of the best teas I ever had in a restaurant! Not a bagged tea, but freshly brewed, strong and aromatic!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKanRpWl9ZajllLWRBEAE",
            "text": "I ordered for pick up and let me say I was shocked, the burger was terrible did not taste fresh and didn’t have cheese mayo, anything! No flavor, it  tastes FROZEN! Ugh even the cheese rolls were soggy and not even filled! It tastes like a fast food place!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeU1qRzN3RRAB",
            "text": "The best service, food, and atmosphere.\nStaff are very friendly. I will definitely go back a lot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2VQT2dRRRAB",
            "text": "Not nearly as good as the Dongan Hills location.   Ordered in, over $60.00 of food and not a single piece of bread.  Some of the food had different ingredients from one time to the next.  We asked for the fish to be fileted.  I understand that you might miss one or two bones, but the fish was loaded with bones.  The delivery girl is very sweet and pleasant. I have to think long and hard to decide if there will be a next time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLN2prb0c4a29ESk9BEAE",
            "text": "The food is great! The French fries that came with the wrap are one of the best fries I’ve tried… and their hot bread is delicious! Everything is good! The ambience and the waiters also super attentive to the customers. I recommend this place!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOX2o5YlR0NjgzMUVREAE",
            "text": "This is was my first time trying zara on Arthur,we usually go to Zara on forest Ave .so this place newly opened the food so horrible we ordered on Tuesday night a delivery of different variety of meat.. we got a food  poisoning me my little kid  I assume from the lamb round kofta ,its ground meat it was a lot of seasoning so you can’t notice anything off  !!!\nGuys stay away from any ground meat !!!\nI checked other reviews and we not the only ones  complained about a food poisoning from this place ……!!! They not honest and there meat quality is horrible even though it’s not cheap.."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJLU0tYTJBRRAB",
            "text": "I wish I could give it 10 stars. Very delightful atmosphere. Modern interior, great food, great presentation, excellent service. A++"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaV9XZXV3RRAB",
            "text": "We stopped in for a light lunch and were warmly received.  The food was hot, fresh and well prepared.  The service was top notch and the atmosphere was very pleasant.  Everything we had was delicious and we will return for dinner very soon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX0lMZTBRRRAB",
            "text": "Fresh food, amazing service (Emir is a great waiter) and a wonderful ambiance.\nI like the cheese cigars, and hummus, shepard salad, the falafel balls, the meat platters and the kunefe for dessert.  The desserts are yummy!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMHJ1UWlBRRAB",
            "text": "This restaurant is newly open 2/15. We came the 2nd day. I came with my daughter, husband and my sister. I have tried Mediterranean food many times at different restaurants in Brooklyn. This place, the food were EXCELLENT! Fortunately, my daughter lives near by. More reasons for me to cross the bridge to visit her and come here for lunch/dinner. This was my sister first time trying these food. She was amazed how good these were. Definitely we will be back. Keep up the good work. Never change a thing. Highly recommend this restaurant."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbzYzcUd3EAE",
            "text": "I rarely write reviews but I just left Zara Arthur and NEED to share how amazing it was. The ambiance was beautiful! I love the open concept and you can really see the attention to detail that was used here. The art and decor is lovely, chairs are comfortable, booths are upholstered with intricate rugs (very cool). I can go on… Next the service was outstanding, the team cared about our experience and made sure I enjoyed it every step of the way. It was the perfect balance of being attentive but also allowing us space to enjoy the meal. Lastly the food was delicious! It was fresh, tasty, and\nnicely presented. It came out quick and was so fulfilling. Flavors were great and it is clear that whole ingredients are used here. We enjoyed the sample platter of spreads with balon bread and olives, Shepards salad with lamb and feta, grape leaves, and to top off a wonderful meal kazandibi with Turkish tea. I am so glad this opened in my neighborhood and I will for sure be back.. often! Looking forward to trying their breakfast!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNHJTeTN3RRAB",
            "text": "I went to this location with my boyfriend because we were so excited they finally open close by my house. However, I had such a bad experience because next morning we had food poisoning. You guys gotta be careful about the food you are bringing to our tables.\n\nWe ordered something simple, beef shish kebab and lamb. Terrible experience"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbzlfclJnEAE",
            "text": "Great food, very fast ticket times. The parking immediately next to the restaurant can fill up quickly but there is a higher lot just a few steps away. The place was slammed when we had dinner there, but the food came out in a very timely fashion. The prices are also very reasonable. The best Zara on the Island imho."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJT2Q0cE8tb09DS3VRRRAB",
            "text": "The service and food are excellent. Love the fresh baked bread. The Turkish tea is strong just the way I like it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNneHNCeBAB",
            "text": "I’m so happy they finally opened! The food is absolutely amazing—fresh, flavorful, and worth every bite. The staff is incredibly kind and helpful, making the whole experience even better. A must-try spot."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnanJhQmt3RRAB",
            "text": "Having traveled all over the United States and eaten at many restaurants, I can confidently say that Zara is one of the best I have ever eaten at.The atmosphere is amazing, you feel like you're in a family restaurant.Very friendly and professional service.The people who work there are amazing.The food is of a high standard, it is delicious and it is cooked with love!Last but not least,what is very important to me! is we should also mention the extreme cleanliness of this restaurant.So I highly recommend everyone to visit this restaurant.and I wish you all a good appetite and I hope you are enjoying it as much as I am❤️Thank you to all the people who work there for the wonderful experience and finally for the good food and service🥰"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdlBxU2JBEAE",
            "text": "As with the other Zara locations, the food, the service and vale were all excellent. Everyone in our group loved their dishes. The owner stopped by and asked about our experience. Truly excellent customer experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdk82d21BRRAB",
            "text": "What is the point of calling and making a reservation one week ahead to only end up waiting 40 more minutes and get forgotten about? I have been a loyal customer of the Zara chains for years, and am so disappointed with this terrible service. Thankfully this situation ended up with us finding RIVA on Amboy Rd and Armstrong Ave- a wonderful hidden gem."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eExXSjJ3RRAB",
            "text": "Food is delicious as always. Zara never disappoints 😋 I highly recommend their breakfast items. Food is fresh and staff is attentive. You won’t regret it 🫶🏻🫶🏻"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcjhlUTNRRRAB",
            "text": "Ziverbey and Teresa beat customer service.  Food testy and clean . Place clean well prepared.  Welcome with smile and love and respect.  My favorite Zara place"
        }
    ],
    "reviews_count": 55
}