{
    "name": "Paradise Island",
    "place_id": "ChIJIYJSgOfLw4kR6M63qFfPOho",
    "grid": "SI3",
    "address": "225 Ellis St, Staten Island, NY 10307, USA",
    "rating": 4,
    "user_ratings_total": 232,
    "phone_number": "(845) 827-3460",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeWRrOVJaR0pKVGw5V1FUQTNRWGxMWTBjM2RGRRAB",
            "text": "Came here last night for a night out with the girls. I must say this is one of the best places on Staten Island. I had such a great time.. I had dinner and then we went out outside. They have an enclosed patio that was wonderful and decorated beautiful.. If you’re looking to go out in Staten Island, definitely check out this place. You won’t be disappointed.."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preU1VWXphMVIxU21OWFVEaHdkMlpOYld4Q1kwRRAB",
            "text": "Was there for a party. There was an issue with our seating. Stevie the manager or possible owner was rude and dismissive.  Not a way to run a business. I will definitely not be back. And will spread the word among my friend groups."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pad2QxRnVRM2s0TUdwdWEyeDFOVVoxWVVGVFJtYxAB",
            "text": "Got there around 6pm to dine in, Jules who was at the door said there’s a show starting at 8pm it will be $20 per person if we stay for the show so I told her we are not going to be there for the show so she went to speak to someone else and came back saying it’s ok they will not charge us for the show since we are going to leave before that. So we sat down, order our appetizer and meal. They served us around 6:40 pm At 6:50 pm Jules came to the table to inform us that the show will be starting at 7:00 pm and would have to charge us $20 each.\nI spoke to her and said this was not what you said to us in the beginning she said she made a mistake Paradise Island, your employee making a mistake. It’s not our fault we had to take our food to go or it could be that this is how you guys get customers you lied to them just to hold them in there and once we order we have to pay this is a scam!!! Lying to customers it’s the worst thing you could ever do. You would never get business from us again that’s for sure and I would never recommend anyone to your restaurant. Yes, you are not going to lose business just because of me however paradise Island, because of your False information to get people to stay in your restaurant Will make you lose customers.\nI’m not your regular customer. It’s my first time here. It was my Fiancé Birthday and we were going to have a nice dinner Until you ruin it with your false information."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vM2QydHhNekpOZUZNMk1tMWlVRkZFZFd3MlNVRRAB",
            "text": "Come here for weekly poker and ordering jack and coke as a regular only to find out they don’t have jack and giving me and charging me for Evan Williams which one is a bourbon and 2 nothing compared to jack Daniel’s and telling me not their problem being it up with management …: really!!?? 🤦🏻‍♂️…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMGNuSXRhbXd6WWxCM1RGVjROV05LY0RCcFkwRRAB",
            "text": "The restaurant was tidy overall."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ObVlXNWpaR2xzY1hBNE1YVTJkREptVDB0dmVHYxAB",
            "text": "Very pleasant atmosphere, I couldn't take my eyes off the chandlers, Very unique and beautiful, while the wood ceiling gives it a very cozy feeling. Centerpieces also unique in my opinion.  Service was impeccable. I couldn't ask for more. Truly. I was on a budget and the hamburger was tasty, perfectly cooked and huge. Yes, I will return. Thank you Vinny, you have a great great place. What a memorable day it was."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodlYxcG5iMXBJYlhCbmFWTTNRVk5GVVdZMmJrRRAB",
            "text": "We were charged on a Saturday night(last night) $30pp at the entrance to dine at 7:30pm... to eat dinner!\nOur friends joined us around 9pm were charged $10. Never again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SlpFdHJTemsyUzA0eFVWcDRhazl2U1VSdk5IYxAB",
            "text": "We went to have a nice meal on wed, which they had the deal pay for one meal and get the second one free,including same for the cocktails. The pasta I ordered with meat source was good including the other entree. The food was tasty and the service was good. They gave us the olive oil with the special they make to our table. After our dinner we walk to the other side for some music and dj playingg some killer beats and fun time. The bar on the other side cash only. So keep some money in your pocket."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sd2NEWlRVMGh5T0UxQ1JGSmtka3RJYTFwaWRrRRAB",
            "text": "Paradise Island is a restaurant on one side and a large tent covered padio with a \"Tiki Bar\" along the waterway between Arthur Kill on Staten Island and Perth Amboy/Harbor Town, New Jersey.\nMuch like Marina Café, the other Tiki Bar on the opposite side of Staten Island, management thinks it's not a Tiki Bar, but Studio 54, 2025. Rather than playing music one would expect & hope to hear during the day at an establishment promoted as a Tiki Bar, Jimmy Buffet, Reggae, etc., they play the music that one presumes is played on the dance floor at 9PM on a Friday for the 20 something crowd. Of course, being situated along a marina with very expensive boats of various sizes, the mean age of the lunch clientele is 50+, although, on this day, there were younger people there, too.\nI joked that all they need is a disco ball. Just before we left, a DJ showed up and, sure enough, turned on the disco lights. It was 3:30 on a sunny afternoon.\nThe drinks and meatballs & ricotta app we had were great and a very reasonable price.\nOur bartender was very nice & accommodating, as well.\nWe'd have stayed longer, but...."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NFMzWkhXSFZCY3pCVVVqZ3hiRUpGTVdSZmNGRRAB",
            "text": "If your in your late 40s on steroids looking to relive your glory days this is the place to go .. yooooo paisannnn"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GeVUxTjVZa0kwYVdGcGVFSTVaVTFuVVdkd1duYxAB",
            "text": "Great service atmosphere is very good food was OK the bad part is they ran out of all the popular BEERS BUT a friendly happy place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNVdrOVlTRFpmTjNObmIyTlRZV2Q2YlU5eFYwRRAB",
            "text": "They have a great out doors to hang and listen to music. I celebrated my husband birthday two years ago. Food and services was on point."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGM2MySjNhV3QyVDNwTlkxVkZZakZzTUdob1psRRAB",
            "text": "Food was good , Tiffany the waitress was also great , Wednesday is buy one get one free!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNFFubDVUaTFxT1RZeE1XbEhla0p1ZWs5bFNHYxAB",
            "text": "Haven't been here in awhile, the inside section. Had lunch today and it was so Great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MllrdHVORzVVTUVaWVJFZE5lV3MzU0VGVlMyYxAB",
            "text": "Cover charge to eat at the restaurant.i don’t recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0d1RVbHRTVXR2Y2xoWWJWbFFieTEyTjE5TVVFRRAB",
            "text": "There is a Cover charge to eat here. I never heard of such thing. This make no sense. $10 per person to eat at a restaurant. Ridiculous. No thank you! My family walk out. We Took our business to marina cafe."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweGVFdEtWVkZYTmxveE5HWmhSa1pMYlZOblVGRRAB",
            "text": "This place has the most unprofessional and cowardly security I’ve ever seen. A fight broke out at the bar, and instead of de‑escalating the situation, security chose to gang up on a person who was simply defending his friend. Their behavior…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sweFdsQjJVRWt5YVhrd1FrUklkbmRvUTNrMGNrRRAB",
            "text": "Great Service!!!!\nThe food was very delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWmFqZGpWSFpKVkZCaU0yZEJkblpvVTBOV1QxRRAB",
            "text": "During the summer on weekends the music is so good. Love the vibe and outdoor set up. It's a mixed crowd of all ages which I like. You can dance or just chill out and have a drink and sit at a table."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdFQzUnZVRVJ5VFZoTlFtcFdNVEZoVTB0dFRsRRAB",
            "text": "My sister showed up with a friend and the bouncer said they were at capacity. As they are leaving they watch him let in 15+ people. They approached him and he tells them they are “not old enough” but didn’t even check an ID?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrd2JGcHJPR3BITUdOTlFYaGpRV3hLY2tkNU1VRRAB",
            "text": "All I have to say is I had dinner here tonight. And it was awful.\n\nFood was bland\n\nService was subpar and unfriendly.\n(they think it’s Staten Island charm but when you’re incompetent, it really isn’t charming at all)\n\nWhen you valet park, you’re handing the keys to your car to literal children. I saw two people have their cars lost by this incompetent staff. And they literally made a blind man (with a cane and all) walk 50 yards to his Uber because they wouldn’t allow the Uber on the premises. They wouldn’t even help him to the Uber..\n\nAnd the creepy manager with a beard gave my teen daughters and their friends the creeps."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVVZVNWhXVk5SWVhoWVozQlNSV3gyVW01WVFsRRAB",
            "text": "Great bar, love the attentiveness of the bartender Gia. Never let a drink stay empty. Definitely come here for the experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdlpraFFjbkpQWDA5WFpIcEhNVUY0ZDNGRWVrRRAB",
            "text": "Not coming back ever!\nAs you walk in you immediately are hit with a waft of moldy broom smell that never goes away. Three tvs streaming Fox news and a huge Trump for President flag above the bar are highly unprofessional for a restaurant in my opinion.\nMenu and posts to wash your hands in the bathrooms have grammatical mistakes in them.\nIt took a table of 10 people 3.5 hours to have apps, entrees and desserts. Staff randomly disappears all together and then reappears 20 minutes later leaving everybody waiting with dirty plates and no water. Bussing staff only carries 2 plates at a time with 10 minute break in between so the table is always crowded.\nThe food was good, cocktails strong, prices are average for the area but overall experience was so unpleasant that I'd rather find some other place to go to."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSWVtcHROVmx0Um5wWWNGcFhTV3BGTkcxbk1YYxAB",
            "text": "If you've never been here then you've never had the best seafood, or food yet and you need to get down here and enjoy the views and food and drinks and desert.\nWith great attentive staff and flavorful chefs this restaurant has set the bar extremely high for their competition."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcHRHN2Z3EAE",
            "text": "Went to this place again tonight to give it another try and it’s become worst than the last time I was there. The service was terrible!!! Ordered a bottle of wine and it took 20 minutes before it was served. When it was served, it wasn’t opened and the waitress left and was nowhere to be found. Food took forever to come out when ordered, and was mediocre at best. Music was so loud we couldn’t have a conversation. Dessert was skimpy and took forever to come out. The last straw, was when I went to the bathroom and an employee came out of the stall and ran out without washing hands, absolutely disgusting. Will never be back!!!!\n\nLast review: The food was decent, portions on appetizers were a little skimpy. Atmosphere is nice overlooking the water and marina.  The parking lot is not great, all gravel and not good for heels, and I’m not a fan of valet. The service wasn’t the best. Waiter couldn’t be found."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSV1Z6TlRURGxKYm14NVkwNUJVRmhITTNwbGMyYxAB",
            "text": "They host our cornhole league & it’s a Very fun place for outdoor activities, never been on the inside."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OT1IwMTNZMDFCZURCWVdUaExibGhSY2tndFpGRRAB",
            "text": "I'm giving 4 stars because I haven't tried the food yet.\n\nI went for a themed-night event that was off the charts!  I was pleasantly surprised to  see the very large outdoor space that can accommodate several hundred people.  There were plenty of tables, chairs, staff, and even some cabanas available.  (I believe the cabanas require reservation and an additional fee)\n\nThere are a few additional events that I will be attending here, so I'll be trying the food really soon and will update my review to include my food review.  Sharing some pics and video from my visit...\n📸: ©️ Andre Cirilo"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWk1YQmFjMWQzVFdSUFZ6WnBiRmxIVTFBelUzYxAB",
            "text": "This is a must go back amazing food and our waiter basel is the best. If you want good service ask for basel."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJcUkxYjNUMmNXNGdnRRAB",
            "text": "Great place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOdlo2ckwyc3BuNGt3RRAB",
            "text": "Got denied access to the tiki bar because they don’t accept out of state IDs but indoor my ID was valid and was able to get drinks. As a bar/restaurant you need to be able to recognize and accept ALL state IDs otherwise you won’t last. What…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTVdVaFFjakk0YnpWTVowWXRTekZFT0hkdE1GRRAB",
            "text": "Nice place... But for the love of God ,hire a normal DJ. Last nite DJ was wasted played terribly he emptied out the whole crowd . Also carbonara is not to be made with cream and onions , absolutely gross 🤢. However their baked clams were absolutely delicious!…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcmNDMWFVREZFYkVnd01uWk9iM3BMTFdkaWQzYxAB",
            "text": "Stopped by here with the Jetski and parked on the dock, the food was delicious and service was amazing. 5/5"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdFBENFpBEAE",
            "text": "THE ORIGINAL SATURDAY NIGHT DANCE PARTY 💥"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VONzJoYmEyeU9QXzd3RRAB",
            "text": "The staff was so welcoming and amazing! Food was delicious and everything was absolutely incredible I loved it here, 10/10 overall recommend."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdXAxS3ItbElXeFNnEAE",
            "text": "Es un lugar maravilloso, cerca del mar con una vista hermosa afuera y acogedor adentro, la comida es muy buena y el costo mucho mejor ajajaj me encantó lo recomiendo 100% nos atendieron muy bien ❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VON2UzSmZla3ZpRGpBRRAB",
            "text": "Really great first time definitely be back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQ2RpNVQ2Z055TlhBEAE",
            "text": "Had a good experience my 1st time I’d definitely go back and suggest to friends…Ask for Tiffany ‼️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbFQxTlZUMGRRTUhnd1prdGpWVTlmV1daUVpsRRAB",
            "text": "Loved the place food ,drinks and service was excellent.lisa the manager and her staff very accommodating  definitely would book again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VON1g4TkQybVl1RVlREAE",
            "text": "Went on a Saturday night. Never got in so I can't review food or service. RED Flags apon arriving there. If you have to be Patted down for weapons before going into a restaurant/Bar in Tottenville- RED Flag. If they don't let off duty Cops in, Another RED Flag. Be Careful"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNVEt5c2I3cmJqNnJnRRAB",
            "text": "Food was great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYLUpLa0x3EAE",
            "text": "Wife,and i stopped here tonight, Wednesday. First time here. Very nice place. Tropical look to it ,you feel like you are on a carribean Island with their decor. They have outdoor and indoor seating. Looks like a fun place for the summer. Music and dancing on Friday and Saturday. Wednesday is Kerokee night.\nGetting to the Dinner very large Menu. Very good prices. Large variety,  a lot of seafood.\nWe had clams on the half shell,  Tuna Tartar, and garlic shrimp as appetizers. For dinner, my wife had the Surf and Turf. I had the zuppa de Mare. (Mussel,shrimp,squid) over linguine in a light red sauce. All the food was fresh. I just wish there was more seasoning on the Dinners. For dessert, we had cannoli's and Tres Lecha cake and Cappachino.\nI will definitely go back. I would love to try it in the summer. Good variety of wine and drinks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwb3IyRFBREAE",
            "text": "Went to visit a friend in S.I. and we came here for some drinks.  I loved that it's by the water.  They had music and a space for dancing, which is cool.  It had a laid back vibe.  The Fried Calamari and Coconut Shrimp were very good.  The menu has a lot to choose from.   The service is good.  The beers were a good price and the Jameson was an average price.  I would go back again if in Staten Island."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNTZPb1VREAE",
            "text": "Went to Paradise Island for lunch with my friends to celebrate Christmas and 2 birthdays.  The food was excellent. The server Arthur was very knowledgeable, attentive and made my group of friends have a fantastic time. Santa Clause showed up. We took lots of pictures and  had a blast. Waitress was also very nice and attentive. The owner was really nice to us. Merry Christmas"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNmFYUkRBEAE",
            "text": "Good food, Good service and Good Ambience.\n\nIt will be little humid outside in summer, but you need to sit outside to enjoy the views.\nTheir sea food starters are really awesome.\n\nMust Try- Garlic Shrimp"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcXR2UFJ3EAE",
            "text": "A great marina with bar food, plenty of parking and a great atmosphere. Staff is a little hard to get ahold of and food was average. Definitely a cool spot to hang out at night. Do not recomend the lobster bisque but the hot lobster roll was awesome!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdVllTGpnRRAB",
            "text": "We have a great time every time we come, good food and DJ we love to dance ❤️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NU15c3l3RRAB",
            "text": "We met friends there from NJ for an after winter lunch vacation planing get together. The restaurant was picked because it was halfway between our houses. Our waiter and staff were outstanding and extremely accommodating. The food was very appealing visually and looked as delicious as it was when we ate it. It's definitely a place we will visit again when the outside tables can be used."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbHV2aHZnRRAB",
            "text": "Tonight we celebrated my husbands birthday here with a table of 10. The staff was extremely accommodating and all the food was delicious. Especially the seafood dinners. Our waiter, Arthur was excellent. He made sure everything was to our liking. We will definitely be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1azRXTEt3EAE",
            "text": "Kudos!  To Management/Owners for hiring and retaining the utmost Professional Security Team.  Each Security Officer TRULY cares, acknowledges you.  i.e. Do you need anything?  Feeling well? and the alike.  I have been to Paradise on a few occasions and NEVER has any of the Wait Staff, Security wavered.  Thank you for all each of you do.  BTW All played dishes well received - Nice job to chef & kitchen team."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNFpLbnlRRRAB",
            "text": "This restaurant is by far my favorite. The staff are very welcoming and friendly. Service is on point and the atmosphere is beautiful. They make great parties, The entertainment is amazing.They never disappoint. I highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbmVlUkZ3EAE",
            "text": "Was there for an engagement party, room was too small for the amount of guests. The salad and pasta were served, but the main course was buffet style, there wasn't enough room to walk passed the line to get back to your seat. They served chicken franchaise, chicken tenders, fries, sausage and peppers, and chicken parmesan. THEY RAN OUT OF FOOD!!!!!! They ran out of clean dishes, the water glasses on the table had lipstick on all of them when we arrived. We had to ask many times for grated cheese for the pasta. When dessert was ready, also buffet style, they didn't even serve coffee. You had to get it yourself. The only thing I can say positive about the evening was that the view is beautiful and the drinks from the bar were good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkaC1IX3dBRRAB",
            "text": "This time I didn't get to eat there but the service was great and the ambiance was beautiful. This is a nice family run business they make you feel very comfortable.\nI was there for a hustle dance which was amazing!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM2MzV0RREAE",
            "text": "A great party place the food is delicious and the people are friendly, courteous, and nice. I highly Recommend it the outside is open now for the summer and  It’s beautiful they have a great parties outside in the summer. Highly recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCeS03bGpBRRAB",
            "text": "Did a show here the venue was really good they have multiple areas to hold different events with a sound proof boarder that keeps the events separate. You can see in the video what I mean.  Overall a really fun atmosphere and if you like water you can look out and watch the sunset."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdzRLUXJBRRAB",
            "text": "This place was fantastic!!! The DJ was great, the people & wait staff were friendly and the food was great! The beautiful sunset was a bonus! I’ll definitely be coming back!"
        }
    ],
    "reviews_count": 55
}