{
    "name": "Nonna's Pizza Tottenville",
    "place_id": "ChIJvQMpTiq1w4kRgMLYuOMzoPA",
    "grid": "SI3",
    "address": "311 Page Ave, Staten Island, NY 10307, USA",
    "rating": 4.2,
    "user_ratings_total": 72,
    "phone_number": "(718) 709-0307",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCR2MwdFpSbUZKTFZsd01EWmxabGhyUTBOSmIzYxAB",
            "text": "Get the chicken parm with vodka sauce!! Thank me later!! The food is amazing here. Every single time!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxalpEbHFiR2RUUlcwd1dVY3lOa1ZMWVRRNVJsRRAB",
            "text": "Really good Pizza. Was there the other day? Nice thin crust, good sauce, good cheese, check it out. It's worth it."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOZlowRjZkMEZXVlVSTmRqbFNPVWgzUVZOT1oyYxAB",
            "text": "Not sure what people are complaining about , but this is the best tasting pizza on the island."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdlFsUlFkMnhvWVdaVFVucHRWVW93TTI1cFRsRRAB",
            "text": "Friendly nice and good   And  excellent staff and taste .\nAccept no other\nI’m from Myrtle Beach sc"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNelgyNHdZM0l6ZEhBemJHVTRXSEJPWDBaR1dsRRAB",
            "text": "The pizza is extremely overpriced, came cold delivered, and 100% not worth it at all. You can get better at kekes or town deli. Save yourself the trip. The Sicilian pie was filled with too much air as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcFNHbDRjRGRXV1VSSE1FWkVVR1p6WnpCSVpuYxAB",
            "text": "4.5 but I’m rounding up to 5 stars.  If you like thin and crispy pizza you will love Nonna’s Pizza.  Every slice had a perfect crisp without being overcooked.  I had the margarita and the vegetable slice both were delicious!  The margarita…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWc09XNVNka1pGZVV0M1NHazVRV2wxVDNBM1ZYYxAB",
            "text": "I just went for the 1st time today and the pizza was sooo good! We have meatballs and chicken vodka slice. Delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdFVGaE5jbFl5UkRONlZUSnRYMkp6VXpaSE5HYxAB",
            "text": "Friendly excellent selection on specialty slices\nAmazing service A1"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTWEycFlWbUZTTkdSTlpVVjBPV1J2VnkxWlMxRRAB",
            "text": "PIZZA ON THE ISLAND HANDS DOWN EVERY SLICE has INSANE FLAVOR!\nSTATEN🇮🇹DOUGHBOYS .\nFIND OUT FOR YOUR SELF\n🔥…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSYU5YQlpVMmhyTnpJNVJuVnplRmhwYm5GVFgxRRAB",
            "text": "28$ for a grandma pie a little steep ,\nI've had better ,this place is only take out ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWlpsY3RUUzFFWDJwdGEzaFNSWGx3V1dzMVJWRRAB",
            "text": "First time at this location order a cup of regular slices they were dynamite. Nice flavor to the sauce, Nice crispy andd chewy crust the way it's supposed to be! Funny thing is I was going to listen to the other reviews that are listed but after reading them they're all reviews about items that are not regular pizza. Places worth to stop"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSloyc3RYMTlVYzJGV0xXTjJhaTF2U0ZoSmVGRRAB",
            "text": "Gluten free pie was out of this world I even ordered a 2nd one before I left and the owner is a very respectful guy told me to take a big bottle of coke on the house as u walked out the door I recommend nonnas pizza to everyone !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaVoyeE9abDlUZEdwbU1sVkJjVnBpYXpodU9FRRAB",
            "text": "Been in Tottenville for 7 years come from the North Shore this is by far the best pizza on this side"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVVVtRnJORFZVTkRGSGJtZFZOR3BtZUZGdGFGRRAB",
            "text": "The gluten free pizza is terrible..dough horrible and not even a piece of basil for taste..its barely edible and wasnt cheap for 8 slices. Came in a tin pan which probably pre-made. If you're gluten free Panini Grill or Tutto Apposto…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZS01TEs2ck1TOHB3RRAB",
            "text": "nonna’s pizza tottenville"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLeU0xSm54MllTT3hnRRAB",
            "text": "$4.50 for a pepperoni slice that was thinner than my fingernail, no sauce, and about 5 measly pepperonis. Not coming back here again thanks."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMnZYMjhRRRAB",
            "text": "Best pizza in the world they know what they’re doing food , service, and atmosphere 10/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMHZlZnBRRRAB",
            "text": "Best pizza on Staten Island and it's not even close."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbjZYNzZnRRAB",
            "text": "Delicious pizza ! Friendly staff"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnekpPOGNREAE",
            "text": "Yu are nuts 4 dollars slice of pizza"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdDZPVmVnEAE",
            "text": "Great pizza shop, staff are always very welcoming too"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmZ3VQU3lRRRAB",
            "text": "How about putting prices on your menu. The only pizzeria with no prices on the menu. I mean you could just charge what you want to who you want"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNXZ2T2ZBEAE",
            "text": "Only the best !!!! Thank you for some good ass pizza :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzXzkzXy1BRRAB",
            "text": "I dont understand the hate ? This pizza is the best in tottenville, I have a feeling it's fake reviews."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURYcG9KVhAB",
            "text": "Some of the best pizza on Staten Island."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuM2FxTlNREAE",
            "text": "Not sure what all the bad reviews are about its really impossible to please people these days. The food is amazing, the prices are exactly what they should be considering its location. Definitely not cheap to run a business in the heart of tottenville. I thought the prices were great i spent $34 on a large pasta fagioli, chicken franchese hero, large rice ball, and 2 upside down slices. The staff is all friendly, the food came out at perfect temperature and fast. I have no idea how anyone can say anything bad about this place. I can’t wait to go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueXRXRXhBRRAB",
            "text": "For a $44 delivery order, I expected better. I ordered an upside-down round pie and received an upside square. The crust was completely charred and the pizza was soggy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuODQtb0d3EAE",
            "text": "Best pizza hands down"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMk9paFZREAE",
            "text": "Great pizza my new Favorite"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdjllZWpBRRAB",
            "text": "Best pizza on the island hands down, and the kid behind the counter is always so cordial."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bnRuQm9nRRAB",
            "text": "Food is very good. A bit pricey is the only negative."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMTVmSFlnEAE",
            "text": "The young guy at the front has bad attitude, he is not friendly does not how to deal with customers, needs training"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydmJheTN3RRAB",
            "text": "Me and my wife went for a late night bite, and as me and her are ordering. The workers are looking at her body up and down. And they was trying to touch my 2 year old daughter too, and they was talking to her very weirdly and calling her these weird names. I just was very uncomfortable with this service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyLWJYWkN3EAE",
            "text": "Always the best tasting pizza!!! Best service, usually go to the one in great kills but tried this location out today. Super cute atmosphere, outdoor seating & still the same amazing flavor. ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyb0l2ZjRnRRAB",
            "text": "Ordered a large family calzone and chicken roll after seeing the calzone on instagram. The calzone was less than half the size compared to the video they showed. I called to see what happened and the person who answered the phone spent minutes bad mouthing me to the manager while I waited, able to hear everything. The manager claimed I only ordered a half, despite my receipt clearly showing I ordered and paid for a family size calzone. Despite this, the calzone was unacceptable even if I wanted a half as it was barely half an inch thick. My chicken roll was the size of half a roll from other places and came bone dry. It was disgusting and tasted like it was sitting on the counter for weeks before being barely warmed in the oven. Overall, very disappointed. I grew up going to Nonna's in greatkills I don't know why people rave about this location and I definitely wont be back to either locations ever again. In the future at least have the decency to mute yourself before badmouthing customers while they are still on the phone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbXI3ZDB3RRAB",
            "text": "Excellent tasting pizza,thin,crispy,sauce seasoned just right,good quality mozzarella,just a bit stingy with the cheese,almost 1/3 of the pie had no cheese on it,i hope the owner reads this and makes improvements because this place has the potential to be the best pizza on Staten Island."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMelBpeXJnRRAB",
            "text": "So I came here after hearing awesome things about this place. This is what I found out. You spend $44 on a chicken roll chicken wing with fries and mac and cheese bites. That in just a few words are completely mid the chicken roll. No sauce inside of it whatsoever and the chicken was drier than the Sahara desert. I brought it back after two bites had my son with me. This place is a complete embarrassment to Italian food and Staten Island should be shut down immediately. No refund offered whatsoever. Customer service is horrible. I feel bad for the employees that work there because it must have been 120° inside of the place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMa3Z2bmhBRRAB",
            "text": "One of the best slices on Staten Island, thin crispy light I probably can eat a whole pie to myself lol….. family owned and operated another great small business for our neighborhood"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcVpYa25RRRAB",
            "text": "Excellent pizza the best"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cGZiTEVREAE",
            "text": "Food was absolutely amazing! The crust, sauce and cheese was perfect and the service was amazing! I give it a 10/10! Best on Staten Island."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkanRhMUdnEAE",
            "text": "Good thin crust pizza. Sauce has a Parmigian flavor. Definitely within the top ten on the island. 7.9"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N09xWHFBRRAB",
            "text": "Ordered a large cauliflower pizza it was $18 and it was the size of a personal pan pizza . Like how is that a large . ?!?! It tasted good but still very disappointed in the size . This was supposed to feed 3 people . Thankfully we did order more food . And it was good ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNkxtNnNBRRAB",
            "text": "First time trying Nonna’s pizza I must say I was impressed the pizza was cooked to perfection. Going to be my new go to pizza spot!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaDREcG9RRRAB",
            "text": "After numerous recommendations, we decided to order and we were not disappointed. It's truly a wonderful taste when you take that first bite, and al the flavors of the sauce, cheese, and seasoning go rushing towards your taste buds. Second thing, the sound pizza makes. That crunchy sound you hear when biting into that delicious seasoned crust."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dzRTY25nRRAB",
            "text": "I placed my order at 5:43 PM for a Sicilian pie and one order of garlic knots. The pizza didn’t come until 8:00 PM ! A simple pie order nothing crazy took over 2 hours !! Terrible service and when i called the place to try and get a refund or maybe get an apology , they gave a nasty attitude on the phone and said “ well it’s lent Friday what do you expect “ and every time i called to check up on the delivery they will just say on the way but 40 minutes extra would go by and not come. My house is 5 minutes away from the pizzaria . Originally when i placed my order at 5:43 she said it will take a hour which is fine i expected 645-700 and still never came until 8….. should get a refund or at least give me a order in the future for free or something. Willl never order delivery from them again . The pizza was also really mid and cold. NEVER AGAIN !"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkaDdIdFBBEAE",
            "text": "Had to change my review! You lost 2 stars sorry! I'm very annoyed and out of 80.00 at this point!\n\nFirst time 5 stars! I ordered a Nonna pie but think i received a grandpa pie—- didn't know it - Super Impressed. Sauce was delicious and mozzarella was fresh. Good ingredients - reminded me of an L&B slice meets grandma ha! Nonna’s get it?… I loved it. Delivery was on time too. Will be back!\n\nNow went downhill ordered a white clam pie never had one but heard great things. I get this breadcrumbed heavy pie soggy oily messy did I say breadcrumbs? Lots of them! I shrugged it off and thought hmmm maybe this is a clam pie norm (but then realized I received wrong pie) -there are two on menu online - one specifically is called a “bread crumbed pie”  I let it go. Lesson learned.\n\nYesterday my husband orders a grandpa pie I get the nonna pie after he explicitly said thick crust 3x on phone. We get it-  Wasn't the fresh mozzarella, way too much sauce thin crust again wrong pizza. Did we eat it yes we are savages when hungry.\n\nOk I had enough. Once is fine twice is too much after now spending 80 on what you never ordered. I didn't call them and complain so let's note that. (maybe they would have made good of it so keep that in mind).\n\nBut overall food is good if you get the order you do want. I will not be ordering anymore. I get too annoyed accuracy goes a long way with food. (esp. at that price point)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dXBYMkRBEAE",
            "text": "My God, this good ... one of the top pizza places on the island 8.8..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eWJtYVZ3EAE",
            "text": "Pizza was delivered- not hot. Had to turn on the oven. Was very good! Not really complaining about that- but they’re giving out menus with absolutely no prices in them. Just saying…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUb1BQdHVnRRAB",
            "text": "Their pizza and garlic knots are fantastic! I loved the vodka slice, best vodka slice I’ve ever had! Only upset is that I didn’t order more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cUtLd1VREAE",
            "text": "My family and I love this place, we had it 3 days in a row last week! Food is amazing and a great staff. One of the guys even helped bringing the pies to the car.  Thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdV9iMWVBEAE",
            "text": "Place was packed. Gave us wrong order. Was not about to go back. Does a calzone suppose to have mozz cheese too? Pie was way overcooked too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkLXNQUk1BEAE",
            "text": "Great food, minus 1 star for prices get charged a different amount each time. Today $17 for a regular slice and a chicken roll"
        }
    ],
    "reviews_count": 52
}