{
    "name": "Angelina's Restaurant",
    "place_id": "ChIJd-F5EJ3Kw4kR1TKzg-9DQdk",
    "grid": "SI3",
    "address": "399 Ellis St, Staten Island, NY 10307, USA",
    "rating": 4.4,
    "user_ratings_total": 972,
    "phone_number": "(718) 227-2900",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3dGRGcFdRMlk1TjFCNlQzbEpObGQ2UzBWRWRIYxAB",
            "text": "Wonderful! I saw a review talking about the service being awful and the food being bad… I have no idea what they are talking about. This place is great and I’ll be back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKS01XTkNibTVSVG10SFZuQlpNbGM1VW14UlZIYxAB",
            "text": "Been to lots of weddings but nothing tops Angelinas for Views- Service- Food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Fd2IzaHFPSE5pTVVwRFMyRndVbTQxYzBGQ2VWRRAB",
            "text": "Amazing restaurant — delicious food, cozy atmosphere, and truly caring service. Highly recommend!\nSpecial thanks to\nIda\n— she was incredibly kind, attentive, and professional. People like her make this place feel not just like a restaurant, but like real hospitality"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRelFuRktSa1Y0YTNoa0xVSk9SR2xtZEVwV1pWRRAB",
            "text": "We love it. And Indian Acres customers get a discount. Always here. And their soups! We cant get them back at home. Too good."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTWQxbHNkR3BOY3pKYWIyb3dlRWRsVGtSR1NVRRAB",
            "text": "Always an EXPERIENCE"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeE1qWnliV2Q0WTE4NGN6VkZMVVl0UkU5bFNsRRAB",
            "text": "Great hospitality"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paU1dWUlpaM1ZHVHpCU01VUjVTMnhxVUdsSFVuYxAB",
            "text": "I thought I would splurge a little.  We had a nice meal and the service was very good.  Highly recommended!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWk1teFZZMkp3Vm5kTkxUQXRhelV4VDFCRU0xRRAB",
            "text": "~Angelina~ !\nGreetings from Space 🚀🇺🇸\nWelcome aboard. Safety First Lady!\n🛟"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSU2FsUmZVSEJIY0ZGSVVHSnRRakJEY0Voc1JHYxAB",
            "text": "The food and menu are exceptional as are the wait staff and Angelina herself. A few of us gathered for a grammar school reunion (62 years after graduation) and we all loved it. I found everyone kind and considerate and very accommodating. Sitting at the bar, something I don’t care to do, waiting for my friends the Maitre D approached me and asked if I’d be more comfortable sitting at a high top table. I definitely was! We chatted until a friend came in. When our fellow classmates arrived we were led to a table and our server , Ita I believe she said her name was, was very accommodating and helpful. The food was fantastic, definitely not your run of the mill Italian food. It is an inspired menu. I had a saffron risotto with squid ink breadcrumbs and langoustines. It’s was perfectly cooked and unbelievable. During our dinner Angelina came over to our table introducing herself and asking our names than shaking our hands.\nI highly recommend this restaurant and look forward to eating there again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTmVEbDViSE5pYjB4YWRHZGtOMmxVU0VWVk1VRRAB",
            "text": "Food is overpriced. Otherwise nice place great staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMmJESnBiazlxWlU1NU9IUnVOMjFYWWtWd1UzYxAB",
            "text": "I had an amazing experience dining here with my girlfriend last night. I really appreciate the hospitality and service from Joel. Thank you very much to the bartenders for the flowers. See you soon, Niko."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WZmRtNUxZVFU0Yld4RE9Ha3daMVozY2poS1JVRRAB",
            "text": "Very elegant and the staff is phenomenal. Great vibe and customer service. Must experience it for yourself."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNFlqbGFNalF0ZDJWbWJWZEZiSEpzZGpsclJHYxAB",
            "text": "Overall, amazing experience !\nFrom ambiance  to —entertainment , service and food -"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWGRrSkpRVlJ5ZVVGa2VrOUZhRUZsVkdRM2FHYxAB",
            "text": "A truly unique place to celebrate—whether it’s a big gathering or an intimate dinner. The atmosphere is cozy and inviting, with live music adding a special touch. Service is friendly and attentive, the seafood is fresh, and the wine selection is excellent. Refreshing, perfectly chilled drinks make every visit a pleasure. Always an amazing experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRVZWUmFkalZ5VmtsUFZHOXlNVmhoV1ZOSFFsRRAB",
            "text": "Salad -mixed greans,too much dressing and onions\nBread- was on table too long before event and waa then stale\nDinner- ok\nDessert- 00am"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNVUxZERlbk51VnpNMVEyMVJiVVZEUVVwTWFtYxAB",
            "text": "The restaurant has changed its menu, which is reduced, and there is not a good variety of dishes. The taste of their dishes has also changed it is not  as good as it used to be. The service is not as good as it used to be.  The waitress is rushing you, and the busboy takes the dishes before you are done eating without asking. Very rude. To order the main course, we had to call the waitress to the table because he didn't approach us after we finished the appetizer. We were disappointed and went there to celebrate a birthday."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSk1GbG9TekZSY0hWUGVtOURSakZSYVUxcWNVRRAB",
            "text": "Wonderful , like always"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLV3BxdHVlcjlLYmRREAE",
            "text": "I read the open table reviews and thought would be a great place for a cozy evening to bring in my wife’s birthday. The ambience and service was great. However was really disappointed with the food. The appetizers were ok we shared a grilled octopus. I ordered a pork chop which came undercooked and I had to return it. My wife ordered a pasta which was ok. The staff did come and apologize for the chops but kind of spoiled the whole dining experience that you would expect."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJLXUxNkhfczZTYXJRRRAB",
            "text": "I wish I could give this zero stars, but I can’t. I came here for my birthday, and it’s nothing but rude, snobby, wealthy people who think they can disrespect people and treat them in any way. The service was horrendous. They weren’t helpful or respectful. I even heard them yelling at each other in the back, which isn’t very professional. The food portion are very small and nasty, not worth it at all. I will never come back to this location again and I don’t recommend coming here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNVG9vSXFJMF9TWlBBEAE",
            "text": "Our experience at Angelina’s Restaurant was absolutely amazing. The food was delicious, and the service made us feel like part of Angelina’s (the owner) own family. She went out of her way to make my daughter feel special on her Confirmation day, which meant so much to us. I was able to relax and enjoy the evening without a single worry—everything was thoughtfully taken care of. There is no other restaurant that will take the time to ensure every detail is perfect and to your liking. I’m truly grateful to the caring staff who prioritized our needs and made sure we had a memorable night. We love Angelina’s!\nFrank and Jill Kelly"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUEJvYnJ4MC16UFpBEAE",
            "text": "In long time i didn't have this relaxing dinner with my family on one of the busiest days for restaurants. Ambience in this place in unmatched!!! Food is good , service as well. Definitely will be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOU0drclhTbTdEMzFRRRAB",
            "text": "Great first time here"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcTUtbGlBRRAB",
            "text": "Went for brunch. Entertainment was great and customer service was good except food was ok (small portions of food, one example: one family plate for 6ppl included only 4 pieces of french toasts) ☹️ 159$ brunch per person - food portions can be better."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnNEYzlRRRAB",
            "text": "We had the most amazing time tonight!! They are so accommodating & the food was amazing!!"
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLW9PUTFRRRAB",
            "text": "Uno dei pochi ristoranti con ancora un impronta importante italiana sia nei piatti proposti che e soprattutto nell'accoglienza. È una tappa obbligatoria per il turista in cerca di italianità."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOC1QV2pRRRAB",
            "text": "Beautiful place inside and outside\nPerfect for a wedding venue or something smaller like a baby shower"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJcFlqVUVREAE",
            "text": "Great food Great service and great decor just a beautiful restaurant"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvX0xmamZBEAE",
            "text": "Incredible service!  Food was very fresh and the cocktail you should try is The Purple Rain."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MU1fVm9nRRAB",
            "text": "Food and service are excellent!!! Can't say enough about the level of attention given by the staff!!! The presentation and flavor of the food are excellent! Props to the bartender working today  (03/23/25, reservations for 3.30)... drinks were delicious!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ak56Z3VBRRAB",
            "text": "Their brunch was extremely underwhelming and disappointing. $160 per person and we were STARVING when we left, we went out to eat somewhere else afterwards. Completely unacceptable. Family style menu but they don’t give nearly enough food for everyone to have a decent portion/plate. For that price point everyone should have gotten a plate instead of 4 pasta noodles and an egg. Other than that it was open bar, which I still don’t feel like it was worth the money. The only positive thing I will say is that the DJ was good. Probably won’t come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcE92WWNBEAE",
            "text": "Lovely place. Great service. Everyone enjoyed it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnb3B5UlpnEAE",
            "text": "Amazing food literally everything tasted really good! Service is wonderful very attentive and the hostesses when you first walk in are super friendly ! Definitely coming back very soon"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRd2NuWS1nRRAB",
            "text": "Fantastic top shelf restaurant! I've never even had a bad bite at Angelina's. The food is amazing as is the service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlX2VtMFhnEAE",
            "text": "There are three places to eat here.There is an initial entrance a backyard ,and a banquet  hall. This is my first experience with fine dining and might I say the food is exquisite. Everything is methodically placed including the garnishes. I got the clam linguine and was not disappointed! It was buttery and a faint taste of lemon definitely was refreshing. The drinks are also beautiful and strong. Right off the water this place is absolutely ethereal at sunset.The music was chill but modern.The decor was absolutely beautiful 🥰 I would dare even say I would get married here ! So many opportunities for photos!They also play Boccee every Wednesday! So if you're looking for authentic Italian cuisine and culture this is the place to be"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2cUo2RnZRRRAB",
            "text": "A step back in time. It was a wonderful sunset dinner on the terrace. There was a talented live singer on Saturday. I don't know if they do this every night but it just added beautifully to the ambiance. The food and service was also exceptional. I can't wait to return!\n\nApril 2023: went back for dinner and it was still good! This time we sat inside and it was just as good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpeGF2R1hnEAE",
            "text": "Had my wedding here 5 years ago, so that in itself should tell you a lot about this restaurant!\nCame back this weekend for Winter Wonderland brunch with my friend and we had a…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqLWNqaHh3RRAB",
            "text": "Choosing Angelina’s Ristorante as our wedding venue was the best decision we made! From the moment we stepped in, we were treated like royalty. The food was absolutely delicious, and the service was exceptional. The ambiance was perfect for our special day, and the Bocce tent where we held our event was beautifully decorated, making our wedding day even more magical. We couldn't have asked for a better venue! Highly recommended for anyone looking for an unforgettable wedding experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNWV2Um1BRRAB",
            "text": "Great food, amazing service, love this neighborhood restaurant. Will consider this for party events too! Definitely be back!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScHJfOWVBEAE",
            "text": "Love the lobster boat we ordered. Great for 4 to 6 people. Very fresh. The atmosphere is excellent. The outdoor has a nice view and several cute photoprops. Parking is fairly easy. Ample spots on the street."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaW9fblVBEAE",
            "text": "25th Wedding Anniversary.  Outdoor cocktail hour.  Indoor dinner.  Great atmosphere.   Weather was perfect.  Valet parking."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPeFkzbEx3EAE",
            "text": "THE BEST! listen top 5 places in all NYC. No matter what, you’re going to be treated like royalty here. There is no question when it comes to service and quality of ingredients they are the best. No matter the occasion they will make you feel the restaurant is yours. The grounds are tremendous for all your events. I can’t speak more highly of this establishment"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c3EzaThnRRAB",
            "text": "We made a 7:15 reservation and sat down at about 7:35 (although there were plenty of open tables when we got there). I prefer to sit in the back room but there was a private party so we were sat in a room partially outside. At the bar I ordered a peach mule (I forget the name) and it was great. We ordered appetizers. The fried calamari were huge and a little hard to eat because they were so big but was good nevertheless.  We also order crabmeat cocktail which wasn't on the menu but they accommodated us. The crabmeat was covered in lemon which was over powering. I ordered the filet & it was cooked perfectly (med-rare). One of the best cooked steaks.  I didn't want the potato side it came with so they were very accommodating and replaced it with mashed potatoes. I ordered the zuppa de Pesce. I was surprised it didn't come with macaroni so I ordered it with linguine. It was fantastic! There definitely could have been more macaroni, however. It barely had any. It was full of fish though & absolutely worth the price ($60). We were too full for dessert although I regretted that on the way home. The service was very good. There was also live music which is a nice touch. All in all, 8.5/10 and I definitely will be returning."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdXJ2ODlBRRAB",
            "text": "I was born, grew up and attended grammar school at St. Thomas Aquinas in South Brooklyn - now part of Park Slope as of the 1970’s.\nI moved to Los Angeles in 1980 for work, but I always come back to NY regularly to visit family and friends for all kinds of occasions.\n\nOne such time was in the summer of 2022 when my sister and I took six friends and their wives to dinner at Angelina’s Ristorante. I had never been there before, but all of my family and friends highly recommended Angelina’s and I am so glad that they did. We had a wonderful evening. The food was excellent and the service was exceptional.\n\nSo, when I decided to put a reunion together for my St. Thomas Aquinas classmates on September 14, 2024, I suggested that we have it at Angelina’s.\n\nSome of my classmates live in Staten Island and were very happy that we choose Angelina’s.  The rest of us came in from Colorado, Chicago, Pennsylvania, New Jersey, Long Island, Westchester County, Brooklyn and Los Angeles.\n\nAll and all there were twenty of us.  We had a wonderful evening and we all agreed that we will be doing it again next year at Angelina’s\n\nThis is a very special thank you to everyone who made our evening a Night to Remember.\n\nThank you Angelina, Brandi, Josephine, Felix, Ida, Damiano, Jairo and Richy.\n\nLooking forward to seeing all of you next year.\n\nSincerely,\nJohn Rizzo & The STA Class of 1963"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzaE5hbFVBEAE",
            "text": "We visited on Saturday 11/2 for lunch. The restaurant is located on the water but has zero water views, which was a great disappointment. The food was also below average, with tiny portions but high prices. On top of that, two staff members and a manager were re-arranging tables and chairs causing a huge commotion disturbing our meal. Very rude indeed. I believe that ownership has focused on the function hall angle of the business, and the restaurant is an extension of the kitchen. Not at all a good investment of our time and money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ05fLTF3RRAB",
            "text": "As a wedding officiant, I've had the privilege of witnessing love stories unfold in many beautiful settings, but recently I had the distinct pleasure of officiating at this truly enchanting venue. Angelina's Restaurant offered a perfect blend of elegance and had a breathtaking outdoor space right on the water!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMU9UWThBRRAB",
            "text": "As I write this review, I grapple with a dilemma: to gatekeep or not to gatekeep? It feels almost mischievous to share the coordinates to such a treasure trove of culinary delights. But fear not, I’m no culinary miser. This gem deserves to be on the map—not hidden away!\n\nDining at Angelina’s Ristorante is like stumbling upon a secret culinary society where the food is so divine, you almost want to swear an oath of secrecy. Tucked away with a serene view of the water, Angelina’s isn’t just a restaurant; it’s a culinary speakeasy where the history is as rich as the tiramisu and the service sparkles more than the glassware.\n\nAs we entered, the atmosphere was buzzing with the kind of warm familiarity you’d expect at a family reunion— that is if your family consisted of gourmet chefs and the world’s most charming hosts. The menu was a parade of dishes so brilliantly executed, each bite felt like discovering a hidden treasure that, frankly, I wanted to bury again just for me.\n\nThe real treasure, though, was Angelina herself, playing the part of both captain and storyteller of this fine dining ship. Sharing a drink and stories with her, I was half-tempted to check if my reservation had mistakenly been swapped with some other VIP’s. The staff treated us not just as guests but as old friends, in an ‘everyone-knows-your-name’ kind of way that could make even the Cheers bar seem standoffish. Angelina’s is the place where ‘everyone knows your name, and a smile greets you at every turn.’\n\nFrom its sophisticated decor to the tranquil views that complement each meal, Angelina’s offers a luxurious escape from the mundane. It’s the kind of place where you come for the food but stay for the laughter, the stories, and the sheer joy of feeling like you’re part of something so exclusive—yet wholly welcoming.\n\nIn conclusion, if you’re seeking a dining experience that combines the allure of a hidden gem with the vibrancy of a family feast, sail no further than Angelina’s. Just don’t tell them I sent you—they might start expecting you to bring the wine!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubGN6NVJ3EAE",
            "text": "Great establishment and great ambiance.\nVisited there for a company party.\nThe food was great,the employees were welcoming and respectful.\nWill definitely recommend to friends and family."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcUppdmR3EAE",
            "text": "I just ordered Fried Calamari and Angelina's salad for pick up, and I am disappointed.\nFried calamari, even though it costs $28, was chewy and rubbery, portions super small for the price. I ate probably 4-5 pieces and didn't finish it. Angelina's salad was fresh and ok, but again, the portion was super small for $18.\nI am disappointed with me paying $50 and not enjoying it.\nRestaurant has nice location."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOVBURTBRRRAB",
            "text": "Best Italian place to drive from New Jersey. A real Italian place where even the kid who parks your car is Italian. If u are tired of eating Italian from Mexican chefs, come here. Fresh Pasta is amazing. Leave the gun, take the canolis"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDemJPRWpBRRAB",
            "text": "We came here after work on a Saturday. Food is of high quality and the menu has some unique choices in addition to traditional Italian dishes. The crowd is very well dressed, I would even say we were underdressed, something to note if it’s…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzc3NmcnFRRRAB",
            "text": "We went to dine in to Angelina's with my husband. We got oysters, main dishes, and a bottle of wine. The bread that they gave us at the beginning was a little stale other than that the main dishes were delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGcWRlVF9BRRAB",
            "text": "Great food, service was amazing, owner made her rounds and very friendly. Celebrated a birthday and staff went the extra mile. Thank you !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxdnVHUmFnEAE",
            "text": "Such an amazing place. Everything is always perfect! The owner, Angelina, is always there with a big beautiful smile. The service is superior and the food?! Fuhgeddaboudi !!! Treat yourself and enjoy the experience now."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3anNXSnd3RRAB",
            "text": "Probably one of the best Italian restaurants in staten island. Really cool beach location that is perfect for summer. The table side service was very well done and the atmosphere was romantic but casual. It's on the pricey side but totally worth it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhalBMcHFnRRAB",
            "text": "Probably the nicest restaurant on Staten Island. Great Italian food. Great service. Great atmosphere.\n\nThe meal started with some cocktails at the bar. Moved to the outdoor dining area, they have a beautiful view of the bay.\n\nFor the appetizer raw oysters, raw clams, fried zucchini flowers; dinner was the squid ink pasta with frutta di mare (my GF), and the pasta with broccoli rabe pesto, paired with a big red wine; dessert was torta ciocolatta, tiramisu, and espressos."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleXBEdFV3EAE",
            "text": "It is an amazing place for any occasion. The concept of the place, the food, view, and the venue alone would have been enough for a 5 star rating on their own. Adding the fantastic team to that made it an amazing experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6anNMTlhREAE",
            "text": "This place lives up to the hype. Excellent food, excellent drinks, and the service is top notch."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURza2Q2V1FnEAE",
            "text": "Was treated like a queen when I arrived. From the minute I walked in and was received by the beautiful and super friendly hostess to the amazing waiters who were so attentive. It was a true dining pleasure to eat at Angelina's. Our meal was pure perfection. The chef outdid himself with our meal. Bravo Angelinas!!!! Birthday celebration was phenomenal!"
        }
    ],
    "reviews_count": 58
}