{
    "name": "Fina's Farmhouse",
    "place_id": "ChIJg0dolBu1w4kRjofT2os5QFI",
    "grid": "SI3",
    "address": "20 Ellis St, Staten Island, NY 10307, USA",
    "rating": 4.1,
    "user_ratings_total": 197,
    "phone_number": "(718) 554-4039",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sak1XZEJSMVp5TWtaMFowbFVWMkpyWHpSRU4yYxAB",
            "text": "Coffee is always delicious! Our barista was very sweet"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4ZlJIcFFRMGh6Ym5KblZsTXRhRzAyZUVwNFJtYxAB",
            "text": "Called asked if there is a table for 5 for available. Showed up 8 mins later told it was over an hour wait - albeit after having to valet"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaE1VaHJNVjlLTmkxcFQydFJWR2RxVm1KdU1FRRAB",
            "text": "The BEST Breakfast  and Coffee I had definitely recommend eating here ."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVlVDMUtNMkZsVFhGaFdFVjNjMEpxYlRZemNrRRAB",
            "text": "I went on a Sunday after church with my family, waited 35 minutes for a table is reasonable due to being a full house. But I would not deal with a 45 minute wait for my child to get her wings while our food got cold, we wasn’t going to eat with out my child as we waited for her meal to come out because (Alexa) our waitress forgot to place her order. I had to get her attention to realize my daughter didn’t get her meal she asked what would it be a better solution she wasn’t apologetic. She  would say sorry and then give me attitude about it! How is that being sorry? She didn’t bother asking if we needed anything if there was anything else she could do for her “mistakes”. She didn’t bother bring us waters or utensils.\nThank you to Jamie the only one who wouldn’t argue with me while each other hosts and waiters gave me attitude instead of being understandable .\n\nTo make it clear we spending more than 17.99 and plus on food! But Jamie was nice enough to take off the wings and drinks. After all we paid and we left with out eating our food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeVZGaHdWMWhZVmt0b0xVNXFiVVp0TmxKNldWRRAB",
            "text": "Let me start off with I’ve been dying to go to Fina’s.  Everytime I go to La Bella I ask my husband can we go today? We could never go because we are always in a rush. So today I went with a friend.  We were seated less than 10 minutes, which was great. The coffee girl bought our coffees we ordered. We ordered our brealfast quickly because we were so hungry. We waited an hour And 15 minutes for two omelettes. I know that they were busy and that’s OK but I saw other people who came after us getting their food.  I stopped one of the waitresses and I said excuse me, can you please see what the holdup for our  food? She goes well you need to have a little patience because we’re really busy.  I said no I understand that but  I see that but other people that came later got their food and we didn’t. She went over to check and the waitress that served us forgot to put in our ticket so they had to put in the ticket again.  A young lady came over to us and said I’m really sorry I apologize but don’t worry we’ll make good. Which they didn't even offer coffee on the house or something. I got the bill it came out to $54. I left 20% tip because I know people work hard but really the waitress should’ve gotten a 10% tip. She was NOT QUALIFIED to waitress. She needs extra training . My family runs a business so I am very experienced. We had  to ask for silverware. We had to ask for sugar you bring coffee to the table no sugar no silverware no napkins we had to ask for everything.  You bring food to a table with no silverware. I would think the first thing you do is when you sit, they should be silverware or bring it with your food and coffee. I was very disappointed. The only thing I could say is that the food is really good, but I would never go back. We had 2 lattes and 2 omelettes (one Irish and 1 meat lovers)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214ak1FRlllSE5yZEVzNGFrWmZlV0pvWmw5c09FRRAB",
            "text": "Great food and delicious coffee/tea drinks."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUWNIRlZXbWx2ZVZSbFNsRlNaMnBOZVc5M1QwRRAB",
            "text": "Food took over a hour to come and the service was horrible. Nobody came to our table to ask how the food was or if we need anything."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkR2Qwb3lTVVJ5WmxKSlJWUnBURkJtUm5kSk1HYxAB",
            "text": "Took a while for the food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVdGJreERhMDFxTW1SUU0yWjVhSHBXTkhCWGJuYxAB",
            "text": "Great little punch spot nestled in tottenville super popular during the weekends, waited a bit for a table and got really fresh food and delectable pancakes with the mini chocolate chips and everything was very classic and superb. great place to catch up with some friends as well and super energetic and upbeat staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WFNXbEtPWEZWVWpNNU5sZDZjbkZZZVVkcVUwRRAB",
            "text": "First time here, I always pass this restaurant for work so I decided to give it a try. Food was fresh and delicious and the service was great I will be back with my daughter"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV2VEZFphRzh4TXpWV2Fta3lhM05OT0hKZlJuYxAB",
            "text": "We had breakfast. Food was very tasty, good variaty. The noise level was too much for the place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNFZtOW5XVEZNZEhwUlJYRnBhWGhzWW5oVVExRRAB",
            "text": "Service was horrible due to having teenagers run it.i got my coffee after food was served had to ask for napkins ketchup salt and pepper numerous times before getting it. For the price service should have been lot better"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cFMyZHJZVkpyWjBGdWFIUjBPREZNVnpONFZHYxAB",
            "text": "Got there and it took forever to be seated. Took a long time to order and get our food and drinks. Didn’t bring out any waters. Had to ask 4 times for napkins. Got the barnyard Benedict, for $18 the meal should come with home fries. Instead it came with a plain bed of arugula. The food was good but not for the price and what it came with."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUExWSkdWVGd5VlhSWVRsWmlPRko0TkVFMFlYYxAB",
            "text": "Very reasonable portion of food at an average price. It's not a tradition diner, which fits today's world."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGd01XaHBVVFpuVWxSdllWVmpaMlUyZFY5bVUyYxAB",
            "text": "Went for lunch with my family . Service was quick and server was very helpful and answered all our questions and was helpful and patient.  Food was delicious.  Great portion size. Really delicious.  Will definitely go back and highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNE1rUmlUbEpXZFdFeGVFVXdhMFZ0VG5sdVRWRRAB",
            "text": "When this place first opened I loved it and would go very often. As time went on and they gained popularity it went downhill. Servers are nasty, food is mediocre. Last time I went we had a bad experience. Went back today, bc everyone deserves a second chance, and it was just awful. Sat there for over 20 mins. Went up to both the waitress and front desk asking if someone could take our order and both said “we will be right there” and never came. After sitting for 20 mins you would think you would at least be given water?  Nothing. They\nNeed to do better. Yes, it’s a cute place, but their needs to be more than that."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MlpXbGhOV05tYUd3d2RXd3dTVjlXT0d4cGFsRRAB",
            "text": "This place does get busy and gets packed pretty quickly on the weekends. It’s for that reason I went early. The service was really good for how busy they were. The food came out hot and was pretty good. I liked the vibes they gave off. I would avoid coming here late for brunch on a Sunday. Get here early."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBamNUT29nRRAB",
            "text": "A must!\n\nMet Fina’s newest Barista and she can create any kind of coffee, to your taste.  Served me w/a warm smile.\n\nLunch was delish continuously.\nFresh muffins and kind staff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSlgwbExUbDgzVlhwWlNTMWZkRFZTVkZoWlNsRRAB",
            "text": "Love the farm to table sourcing. Our food was very, very yummy. Hot chicken Benny flavors went together beautifully. Just the right amount of heat. It was difficult to create a bite that encompassed the bacon egg chicken arugula and bread all in one bite though. The chipotle hollandaise sauce was so bright and flavorful. The arugula was too much. One of my two eggs was over cooked and not runny. The chicken and biscuits tasted delightful but not enough gravy. Definitely needed more gravy. If ordered again I would get it without the egg and bacon. The pretzel was soft and fluffy. Nice amount of salt. The dipping cheese was underwhelming flavor and not as hot as I would have preferred.  We enjoyed both the brown and honey mustard much better. The restaurant was crowded, we were there during the Sunday lunch rush I'm sure. We also found it to be overly loud. We sat at a high top table and did not enjoy it at all. The chairs were narrow and uncomfortable. I found myself slipping forward. Service was prompt, kind and attentive - no compliants."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbFRsb3dhRmgxUjJWcmJ6VkVMVmhYYzNkVmJIYxAB",
            "text": "Really love this place for breakfast and lunch. me and my husband come often and they have many delicious options. Hard to choose.  I usually get an iced coffee with my breakfast or an iced tea with my lunch.Perfect spot for dates or meeting up with  friends and family.  The place is really big always busy but never had to wait. It’s exactly what we needed in Staten Island 🙌🏼"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRlVERkNUSFpETFdweU9HaGtSSE5YTkZSQkxXYxAB",
            "text": "Great Food, great people, great vibes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toamVUTkhiVmRRVkZkWGEzaHFVM0JpU0hoM0xXYxAB",
            "text": "Food was amazing, workers were on top of the food and making sure we had everything we needed, great brunch spot wish they were opened later but still an amazing spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBM2FVSkxhakZWYjJWR1QwUk5UV3RhWDBKUk9FRRAB",
            "text": "Great experience here today ! Place was packed which is to be expected it is graduation season - waited a normal amount of time , the hostess up front Emily was great ! Our waitress was super sweet food came out very quickly and was super fresh you can tell they use quality ingredients will definitely be back !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMcW12X2VIMVlPSFV3EAE",
            "text": "The food is always delicious and staff couldn’t be nicer! Will definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VelFrWk5iVGxVU0RWVFExYzJPRlJ0TW5ScGFVRRAB",
            "text": "Literally always have a great time at Fina’s. Wonderful food, service, and atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMGNsbDVSR1ExUkhGMFpVeGpNV0U0TkdwMFJXYxAB",
            "text": "The food was amazing and the staff were accommodating and provided excellent service. Highly recommended and appreciate this family run business."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbFkwVlBTV0pUYVdWcVVsRlZTRlZFTWxwcFpIYxAB",
            "text": "Great food and service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKQzhqNF9Da3E3MGt3RRAB",
            "text": "Was forced to wait over 1 hour for my food just for the incompetent girls who work at this mediocre establishment to tell me they messed up my order. After another 20 minutes of them “fixing” my order, they came back with yet another mistake. Try and hire some competent workers who know how to treat customers with respect and integrity. Won’t be giving them my business again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeFkwOUlVbFZUWnpOVFNHWnZTbmRqV1Zrd1VIYxAB",
            "text": "Food was cold, staff wasn't welcoming. Not worth the hype."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONmNqQm5XbU5uV0Y5RGF6Rk1TMkp1ZVdkZlJIYxAB",
            "text": "Delicious, they do great breakfast, highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNV21xZmE0NG9HQXRBRRAB",
            "text": "Staff is so nasty. Told us the wait was 25 minutes and gave us a table an hour later after we asked a few times. Waitress was so rude when we asked about our water after waiting for it for 20 more minutes and then slammed our silverware down & ignored us saying thank you. Rolled eyes, nasty faces. Truly disappointing:("
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJVEVzTG4zc3IydlZnEAE",
            "text": "Would give it a zero if I could. Absolutely terrible!!The wait was over 40 minutes when we were told 25 the hostess is rude and does absolutely nothing. The staff all sits together and chats up a storm while ignoring the customers and having a huge wait outside but don’t seem to care at all. I will never go back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNckNoTnowNWZMSGV3EAE",
            "text": "Such a cute spot. Food always tastes fresh and not rushed. The prices are good based on the quality of food you’re getting."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcFAyT19nRRAB",
            "text": "I’ve been meaning to write this review:) I asked for suggestions on the Staten Island Food Group page on Facebook, to take my daughter somewhere for her birthday breakfast late March. So many people suggested Fina’s. We took a try and we were NOT disappointed! The food was fresh and delicious, our waitress Emily was super pleasant and helpful, the atmosphere was perfect! We had a wonderful experience and we will be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvX3UtMmx3RRAB",
            "text": "Fina's Farmhouse shines with its Cobb Salad—crisp romaine, avocado, bacon, and tangy blue cheese dressing make it a fresh, satisfying lunch choice. For breakfast, the Steak Benny (tender steak topped with a runny poached egg and hollandaise) is rich and savory, while the Breakfast Board (eggs, meats, pancakes, and biscuits) offers a shareable feast with homestyle charm.\n\nThe cozy farmhouse vibe and attentive service elevate every meal. A must-visit for those craving quality ingredients and generous portions in Staten Island!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOU1IRTFRRRAB",
            "text": "This restaurant is yes, obviously beautiful! The food is fresh and well prepared. I came here with my two kids, and they ate all their food. My daughter had a croissant with turkey, bacon and cheese and eggs with home fries. My son had two hashbrowns and turkey bacon. I had the same thing as my daughter our bill was $60 or less, and the food was really Good. I do have one observation and In this restaurant, I was the only person of color Which would have been uncomfortable, but it wasn’t the atmosphere was still really good and the server was really nice and the people in the restaurant were just chilling eating having a good time. Highly recommend it people of color. I think you’re welcome here so you should try it out."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMjUyd1BnEAE",
            "text": "Excellent selections on menu"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdHFMejVRRRAB",
            "text": "Super friendly staff, along with great breakfast/lunch menu,  the chicken Benedict was super good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNU5hdmtnRRAB",
            "text": "My mom and I had breakfast for my birthday and we loved Fina’s all around the board. Our waitress Emily was attentive, engaging, and informative. The food is delicious, We will be back very soon!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OHNEUU1REAE",
            "text": "The food was good, but i would just classify it as fine.   I expected more from the cinnamon roll pancakes, but they were dry.   The cheesy grits were watery... not the kind you would expect."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeEo3aXRnRRAB",
            "text": "I recently visited Fina’s Farmhouse in Staten Island for breakfast with my family and had a delightful experience.\n\nFood:\n•\tStuffed French Toast: This dish was exceptional—savory and flavorful, making for a satisfying start to the day.\n•\tTraditional Belgian Waffle: While the waffle was well-prepared, it was standard and didn’t stand out compared to the other dishes.\n•\tEggs Benedict with Hash Browns and Bacon: This was a highlight. The eggs were perfectly poached, and the accompanying hash browns and bacon were cooked to perfection, enhancing the overall enjoyment of the meal.\n\nBeverages:\n•\tThe coffee was outstanding, complementing the breakfast dishes wonderfully.\n\nAmbiance and Service:\n•\tThe restaurant offers a cozy and welcoming atmosphere, ideal for a family breakfast.\n•\tThe staff was friendly and attentive, contributing positively to our dining experience.\n\nOverall, Fina’s Farmhouse provided a memorable breakfast experience with standout dishes like the Stuffed French Toast and Eggs Benedict. I highly recommend it for anyone seeking a quality breakfast spot in Staten Island."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQczlXNE1REAE",
            "text": "Walking into this Restaurant i had a feeling of delight. It was decorated for Christmas and I Loved it. Finally Farmhouse was Really clean, a good Farm feel and you could see the kitchen. My visit was a cold Wednesday morning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMmRLY1d3EAE",
            "text": "This place had a great lively vibe upon entering.  From the exterior and throughout the interior, there was a homey farmhouse theme that was very welcoming with a small-town feeling to it.  Even though this is a modern structure, the facade is painted in farmhouse red with details to make it appear like a farmhouse.  The wall decor was full of rustic wood punctuated by red highlights, including a red hen icon.  There were many farmhouse decorations that led to the overall farmhouse motif.  These included toy metal trucks, birdhouses, and rocking chairs.  The food was great and based on organic farm-to-table menu items.  The coffee was high-quality and the coffee menu had several coffee options.  There was ample seating inside, including several outdoor tables for two.  Expect the menu to be higher-priced than usual due to the higher price of organic ingredients.  Overall, I had a great experience and hope to return."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLV9qZTFnRRAB",
            "text": "Overall I really enjoyed the breakfast we had here. The eggs Benedict we got was really tasty and the hash browns were delicious.  Breakfast is slightly on the pricier side plus they don't give a side like home fries  or even regular potatoes with the dish. So you have to buy that separately. The hash browns, while being delicious were $6 for two small portions.\n\nWe will be back because the food is great but I will always be disappointed that I need to spend more than average to get what every other place gives out with a dish for breakfast."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdXJyNHdBRRAB",
            "text": "ETA: Second time back at Fina’s. This time, there are a few criticisms:\n\nThe music is WAY too loud and the dining area is way too hot. This combo made our stay unpleasant, especially as the loud music caused the other patrons to be excessively loud and screechy.\n\nFood was good, though the biscuits were too small, dry and hard. On the positive side, the pancakes were incredible.\n\nOriginal:\n\nWe had a wonderful breakfast at Fina’s Farmhouse. Pistachio iced oat latte was definitely the best I’ve ever had. Staff are kind, service is quick, prices are excellent and the food is delicious. The only complaint, and it’s very minor, is that the chairs aren’t very comfy. Other than that, this is a 10/10 gem.\n\nFina’s is top notch in all areas, and we can’t wait to come back again soon to try more of their delicious menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMGREVmZ3EAE",
            "text": "So this was our first experience here. My son and I went around one o'clock so it was busy but we didn't have to wait. The staff was very friendly, even the bus boy who sat us. My son ordered Cinnabon pancakes, and I ordered the Spring salad and added chicken. He also had hot chocolate with cinnamon brown sugar added to it. The food was delicious. Although the salad with the added chicken was about $24 which is a little expensive for a lunch but on the flip side, the salad was very big. Pancakes were 16.99 but again they were the biggest pancakes I've ever seen. Service was quick, we did not have to wait long for our food and it was all delicious. Just note it is a little pricey for breakfast or lunch, but we did get large portions that we were able to take some home and have for lunch the next day.  There was a very large variety of different foods offered, so We will definitely go back to try new things off of the menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeXVtTHBBRRAB",
            "text": "First time trying this place, I really enjoyed the breakfast, a lil pricey but for the location, it's to be expected. Parking is a hit or miss. I recommend trying the cheesy grits, the oatmeal & the bacon (thick cut-get it crispy), eggs (perfectly made), hashbrowns & biscuits, all delicious & under $38, I'd definitely come here again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXNGFTd1BREAE",
            "text": "Really happy to have nice spots like this locally. Coffee is excellent and I really enjoyed my Iced Dirty Chai. It's so cute and cozy inside. Food was very good and came out super fast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX3YyUi1nRRAB",
            "text": "Nice breakfast place with some unique, seasonal inspired choices for coffee and food.\n\nStaff was very helpful and attentive.\n\nThe decor is charming and the place is very clean and well presented. Easy street parking available."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdjdYOWhBRRAB",
            "text": "This is my new breakfast spot! Love the atmosphere, staff was friendly and attentive and the food was delicious. I highly recommend stopping in, you won’t regret it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMzh6QUV3EAE",
            "text": "Very cozy spot for a cup of coffee or any other beverage. Plus some variety of pastries or sour snacks. Kitchen is about to start working after 4th of July, and will offer much more. Great place overall"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoekllVzh3RRAB",
            "text": "Food was delicious! I love how thick the grits were. And the sausage was fried in oil so it came out very crispy. Our lattes were good too!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbV9IQktBEAE",
            "text": "Ordered Fina’s for our restaurants Christmas breakfast! Everybody loved everything!!! Fantastic.. will definitely be ordering from them again!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHX3RhckpBEAE",
            "text": "The customer service was very good. The coffee was decent and I really enjoyed the breakfast sandwich (bagel with egg and turkey bacon).  The place is quite spacious inside and they'll soon have a kitchen with bigger menu.\n\nMinor nit is that the place could have a little more farmhouse vibe inside (it wasn't bad!) And the chairs were simple cafeteria-like style. Again this was very minor.\n\nOverall a great find for Staten Island."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcU9ERzFRRRAB",
            "text": "The cold brew was delicious and so was my avocado on a croissant. The staff was so sweet! Can’t wait to go back."
        }
    ],
    "reviews_count": 55
}