{
    "name": "The Creperie Corner",
    "place_id": "ChIJ7beiVJrLw4kRxYWEh0cgxmk",
    "grid": "SI3",
    "address": "7427 Amboy Rd, Staten Island, NY 10307, USA",
    "rating": 4.8,
    "user_ratings_total": 56,
    "phone_number": "(917) 994-2592",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGelQwMWpRVVpXZVd4TVNYQlFWRmQ2VkU5dlEzYxAB",
            "text": "There is amazing service and the food is very delicious 10/10 recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTmMwRnZTVXhXU1RaVGRYVk1iVFIyY21jdFRVRRAB",
            "text": "Love this place we walk here from school it’s good n affordable"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdWRrMUdibk5JV2twelJHRndTR0Z2WkZSRVkxRRAB",
            "text": "Best crêpes ever they’re cheap and they give so much. They’re so good definitely recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NE5UQTBXako0VldoU2JURlFkVWhmTlUxNFZVRRAB",
            "text": "Awesome crepes definitely want to try them all"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twV1lsSkpSVkpNTjFneU1uTlBRbEpqWVZFMWFWRRAB",
            "text": "Decent crepes, nice interior\n\nI love good crepes and stopped by Creperie Corner in September 2025 to try one. The place is nicely decorated and feels welcoming. I ordered the Berry Crazy sweet crepe, which arrived with excellent presentation and tasted pretty good. A couple of things could be improved, though. The crepe itself was soft and flavorful, clearly made from quality dough. It, however, needed a bit more time on the griddle to develop a better browning. The filling was tasty but so generous that it overwhelmed the crepe's own taste. To my surprise, I wished for less filling:) It was one of those cases when more doesn’t mean better:)\n\nThe place is worth visiting if you like crepes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSFYwVlRUR0pET1ZSQ2JVSkpVM2RoTVdsaU5HYxAB",
            "text": "The owner Charlie was personal, kind, and made customers feel welcome. He recommended options for me to choose from off the menu based on his favorites as well. He asked me while making mine if I wanted to add any fruits. Overall, for the price and experience, I would definitely come back here regularly. This was great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SE1UUldlWFJETm0xVVNUTklkM2hoTldOSFRVRRAB",
            "text": "Loved it! We had a waffle and it was delicious, it was perfect. Not dry, just right!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeFZIRk9lV3BZVTFJNWFVRjFTM3BOTUU1S2VrRRAB",
            "text": "This place is amazing. We stopped in for breakfast and got the Biscoff waffles with white chocolate-- so incredible. The waffle was so fluffy and crisp (which I find rare when it comes to these types of waffles, they're usually soggy). It…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kd2EyTnhaMFpSUkV0alJIUjFZWEpzZDJWeUxVRRAB",
            "text": "They have the best crepes and coffee. I came in late night right before close and got a Dubai chocolate crepe very specific and was no issue and done with such customer care. This is my new local spot . Recommend to everyone looking for something new and sweet."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSlpXVmlSakV5U25SR1R6VmFXa0ZxTkU4dFZGRRAB",
            "text": "Quaint little place in the heart of Tottenville. Food is great and tasty. Staff is friendly and follows directions well. We asked for no tomatoes on our order and come to our surprise, instructions were followed. Just ask for condiments on the side. We will be ordering from here again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRFh6ZFNkZ3FTYnVnRRAB",
            "text": "the crepes and drinks are absolutely delicious. 1000/10 recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQS0p1N2JTLXVmVDdBRRAB",
            "text": "The Crêperie corner has the best breakfast on the island and the Dubai strawberries are amazing The people in there are great and the service is amazing Best sweet shop in towne"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNTzdzYkxTc3RxMUd3EAE",
            "text": "Didn’t even realize this place was here until I saw it driving down amboy. I wish I knew sooner, I came w family and friends a couple weeks ago and everything was delicious. Highly recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMemh6dWVRdklTU2h3RRAB",
            "text": "Ok, while I haven't had any crepes, YET, these guys are expanding their menu and the sandwiches are phenomenal!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLSDhoTXlvck5tMzd3RRAB",
            "text": "Strawberry and lotus cookie dessert cup are amazing"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveGNhdUl3EAE",
            "text": "Delicious crisp outside and soft inside waffle and great cheesecake"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvb2ZpdGtRRRAB",
            "text": "Great food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvclluOGZ3EAE",
            "text": "We love the Grind so we decided to try the Creperie. Husband and son chose waffles. Cinnabun waffle and apple and caramel waffle, both were yummy! I had the healthy avocado toast, Sunnyside up eggs and feta.... What a new twist! The girls…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdFpucjJRRRAB",
            "text": "Love this place, always hits. 10/10 every time !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbGIzaTF3RRAB",
            "text": "Wow, that's really delicious and clean. i have to admit and prices are very fair."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LWZlVk9nEAE",
            "text": "The man working there was so nice! The strawberries & Dubai chocolate was incredible!! There strawberry gelato and crepe my friend got was so so tasty I can’t wait to go back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNDlyQ2FREAE",
            "text": "Great crepes nice neighborhood place and open late can't beat it"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnelpYR3VBRRAB",
            "text": "Favorite place for breakfast I will definitely start trying more items I'm hooked on there egg platters"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbVlfTTF3RRAB",
            "text": "got a blt it was really good, 10/10 will come back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneTV2aE9nEAE",
            "text": "I went with my friends and the drinks tasted AMAZING 10/10 would go again 100%"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbk1EOVBBEAE",
            "text": "Excellent experience. Food was delicious and staff was amazing. Highly recommend!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMFpDcWNREAE",
            "text": "Service was excellent and staff was very kind and thoughtful. Food was great (I highly recommend the BEC or SEC). I also like their innovative desserts like the Dubai Chocolate Donut and the BEC on various donuts. Really happy to have a place like this near me."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfazZ2UDdnRRAB",
            "text": "This place has amazing food!!. The chefs never disappoint."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdU4ybEd3EAE",
            "text": "Great addition to the area definitely check out the waffles and Crepes they serve here. Coffee was excellent as well , will be here again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaG9xTkVnEAE",
            "text": "Loved the food best chopped cheese on the island and friendly staff will be going back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMzVPd1V3EAE",
            "text": "The food was phenomenal, I can’t believe they made a bacon egg and cheese with fruity pebbles. The service was top notch and speedy, I was taken care of and provided with an amazing atmosphere. The staff was so nice and pleasant. I highly recommend this place to anyone around the area who loves that brunch type environment!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOTlDQzBnRRAB",
            "text": "Very great experience I had with Creperie Corner. I was greeted with a friendly welcome by the owner I think his name is Charlie. The chef Emily made my crape amazing ! The food was great and I would highly recommend for people to come here !!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMjhMQXVRRRAB",
            "text": "Honestly management just needs to read this. I came into your business at about 2:15pm on New Year's Day. There was a young girl working who clearly has never been taught any sort of food/health safety.  I walk in, she’s finishing ringing someone up wearing a pair of gloves. I immediately noticed this, considering I’ve worked in the food industry for years. She addresses my husband and I telling us to let her know when we’re ready. As we’re standing there debating I can’t help but notice the girl hadn’t changed her gloves. She just handled money now she is continuing making someone’s food. As she’s mid making the food she takes her phone out sends a quick text, then takes out a pen and pad to take my order. I am baffled that she is still wearing the same gloves while doing all this and still making food!!! I’m trying to ignore it because I know I’m very much a germaphobe, but the last thing she did I couldn’t ignore. She walked around the counter to clear a table off, grabbing dirty cups, plates, and napkins STILL WITH THE GLOVES ON!!!!! Then goes back around to continue to make food. I had to ask her to please cancel my order and when she asked, “are you sure” I said, “you’re wearing the same gloves that you just cleaned up garbage with to make food I am very sure.”  Her response was, “ok.” I hope all the other people in there walked out after me, because this is how sickness and disease is spread. I also hope the owner can properly train their staff on food safety, especially considering, the customers can see the food being made."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2enNyV2RBEAE",
            "text": "Most flavorful food I’ve ever had !! 10/10 recommend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OHVQZnlBRRAB",
            "text": "Amazing food! Been there twice already and definitely will continue to return :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdC1lM25RRRAB",
            "text": "Super cute and absolutely delicious. Staff is so sweet and friendly felt very welcomed"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzLVl6VUx3EAE",
            "text": "Such a cute addition to tottenville! I got the smores crepe & it was delicious. I’ll definitely be back to try the savory crepes!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzak11ZFhREAE",
            "text": "Wonderful experience. My sweet tooth needed a spot like this in the neighborhood!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaUxXRjJRRRAB",
            "text": "After my son’s first bite, he said “Dad you should go on google and give this place 5 stars!”  Everything was great!  Very welcoming.  We love local businesses like this.  Lots of luck!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzZ01LRjdnRRAB",
            "text": "Amazing for something sweet that hits the spot everytime !! Also they have great breakfast choices  for on the go or sitting down for a quick bite to eat. Amazing staff 👍🏻👍🏻"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMmRhZVRREAE",
            "text": "So happy this place opened in Tottenville! Everything was a 10/10. It’s my new go-to place to curb my sweet tooth cravings."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMC15MUhREAE",
            "text": "I recently visited this  shop and was thoroughly impressed! The atmosphere was cozy and welcoming, making it the perfect spot for a casual meal or a sweet treat. The menu had a fantastic variety of both sweet and savory crepes, catering to all tastes. I opted for a classic Nutella and strawberry crepe, and it was absolutely delicious—perfectly cooked with just the right amount of filling. The staff were friendly and attentive, ensuring a pleasant dining experience from start to finish. I highly recommend this crêpe shop to anyone looking for a delightful and satisfying meal!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeDVmTnh3RRAB",
            "text": "Ordered with my husband for a late night snack! It arrived in 20 mins from Uber Eats & was absolutely perfect!!! Our new spot. Fresh and delicious."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzb19HbEp3EAE",
            "text": "“I stopped by this crepe shop and had the most amazing strawberry Nutella crepe! The crepe was perfectly light and fluffy, with just the right amount of sweetness. The strawberries were fresh, and the Nutella was perfectly melted—such a delicious combination. The staff was friendly and welcoming, and the cozy atmosphere made it the perfect spot to enjoy a treat. I’ll definitely be back to try more flavors. Highly recommend this place for anyone craving a sweet, delicious crepe!”"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzelpfNHFRRRAB",
            "text": "The atmosphere is amazing, product & prices even better and the service is the cherry on top. They treat you like an extremely valued customer from day 1!"
        }
    ],
    "reviews_count": 45
}