{
    "name": "Killmeyer's",
    "place_id": "ChIJVVVZIDy1w4kR7hYgSuVrFwc",
    "grid": "SI3",
    "address": "4254 Arthur Kill Rd, Staten Island, NY 10309, USA",
    "rating": 4.4,
    "user_ratings_total": 907,
    "phone_number": "(718) 984-1202",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25waFF6QlJTV1l3Wm1kellrZFJSVFZVYkdSTVUzYxAB",
            "text": "Their steady business comes mostly from repeat customers and referrals. The meal was perfect! The neighborhood's culinary standard-bearer. Employees make customers feel special with personal greetings. This restaurant satisfies my taste and I share that."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTGNXWlJkRFp5V2xKU1puWnpTMVpYYlc4NGFWRRAB",
            "text": "Food was great and plentiful, service was terrible"
        },
        {
            "date": "2주 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdWVHRlBja3hQUjNoVWVtcFBVRTE0Y205cmNFRRAB",
            "text": "БЫЛИ ЗДЕСЬ ВПЕРВЫЕ,  ОЧЕНЬ  ПОНРАВИЛОСЬ. ЖИВАЯ МУЗЫКА,  ДРУЖЕЛЮБНАЯ АТМОСФЕРА,  ВКУСНАЯ ЕДА.  ПРИЕДЕМ ЕЩЕ СЮДА."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWak4wcFVVVVY1TTFCclZGZERXVU5CTldGNVFsRRAB",
            "text": "Loved this bar , it transported me back in time ❤️🙏👍👍👍👍"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WM1MyZFdXa1pVT0dSWldWbFVPVFZYZURseVQyYxAB",
            "text": "Amazing German restaurant"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObFkxRkVObk5uYlZWaGRsaElOMVpPTVhkMk9FRRAB",
            "text": "Great spot, unique among NYC biergartens for its wide selection of German beers, authentic food and gorgeous interior."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNFNUTlROblJxWmw5eGIzRXlNMkZ2UzNwUVNrRRAB",
            "text": "Was there first time today, was in mood for some German beer and food. I was pleasantly surprised with the feel of the place, appears quite authentic with its decor. I got one light german draft beer that was a bit weak, and then got Octoberfest Spaten which was much better, so that's good. For food we got Killmeyers namesake dish which appeared to be beef pot roast with potato dumplings and red cabbage in some glaze. The beef was excellent, falling apart so easy and good quality. Unfortunately the glaze was sweet and just didn't go with the dish, so was the red cabbage, just too sweet. My wife got the goulash which was much more tasty than the sweet glaze so I'd recommend opting for that option. Overall I was pretty happy and would definitely go back for some sausages and more beer to try. Hoping next time it would be more 5 star experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aE1XRnFSRW80V0c5S1ZtdEJSMmh0Y0dSNUxWRRAB",
            "text": "For me the best part was just being in there. The decorations, music, all was great. Food was amazing. Very traditional home style cooking. I loved it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVdE9GOWlWM2hSZG1KaGNYQktOVk5XYlZaTWEwRRAB",
            "text": "Good food great place reminds me of the old country"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RmN5MVRURzR6TUZSR1pDMUJPRzk2YURkcVpWRRAB",
            "text": "We had an amazing experience at Killmeyers!! The food came out perfectly made and the service was very friendly and welcoming. This is an amazing restaurant to experience German food and I will definitely be spreading the word about this restaurant. Overall amazing experience amazing food and service and I will definitely be coming back!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRExYZDJiRTR6UVRFMVYwUkdkV2g0TTBGcE5uYxAB",
            "text": "Celebrated a bday. Comedy show is very vulgar and not funny. Spent way more money than we planned. Meatball was burnt and dry. Will not be going back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWFpXOVBPVEozY1hCNmQySm1OMHhQY0Vwb0xWRRAB",
            "text": "Great outdoor seating area so you can bring your dog"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTk5VeGllR1ZyZFZoc2FrMVVkMDVXVW5oa2MxRRAB",
            "text": "The food is beyond compare and the German Weise beer is fresh and free flowing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMloxQlJlbFYyYTFaSk5VTnpiRlE1TWs0MGIyYxAB",
            "text": "Fabulous service. A meat and potatoes getaway... with beer!"
        },
        {
            "date": "2달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GYWVXRmpNR0ZPWWtsV2FWZFBOelprTkVWUVNFRRAB",
            "text": "Lugar maravilhoso, me senti verdadeiramente na Alemanha, cerveja muito boa e comida maravilhosa!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdWQxbGxUMlp0YkZoeE9YcFFTMkZCYmtSSUxVRRAB",
            "text": "Food - Excellent, Service - Excellent, Atmosphere - Very Excellent. The bar itself is the oldest in Staten Island - 1890, the interior is amazing, like a time capsule. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSlYxZHhWa0pZTWpWTFluUk5hVWRrYmxoaU0yYxAB",
            "text": "Beautiful night out with friends service and food outside was a great night out"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRlVXcFBjM2xJU1ZsWFVFYzRVSFY2WkMxMlNtYxAB",
            "text": "I had the pastrami sandwich and it was absolutely delicious! Robbie, my son, had a cheeseburger and he loved it. The staff was very friendly and welcoming. The atmosphere was relaxed and comfortable. I appreciate that they are wheelchair accessible and the parking is free, though the lot is on the smaller side. Overall, a wonderful experience for both adults and kids."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4T2FuQnRUSFpRVUhsRWVtTjZjVXBFVW5aUWFWRRAB",
            "text": "Under new management..can honestly say this has been the best dinner I have had since I started coming here. Great food..great service.. recommending this place to everyone!!!! I am already telling friends about it. Will be back again next week for another incredible meal!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNU9HcFNNazg0UVVSTlRrRmlUelZHYVVoblgxRRAB",
            "text": "Wasn't crazy for my Chicken Schnitzel.  Chicken was tough"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBdFQyczRZM0kwT0VOMGN6RnBVRzVQUldVeVFWRRAB",
            "text": "This was the most delicious beer I’ve ever tried! Grapefruit is my top favorite!\nThe staff were very friendly. There was live music on Sunday, which added a pleasant atmosphere.\nMy fav spot 🤩\nHighly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wck1EVlBYMGxsWmpFM1NFUm1aRlEzYkROV1JVRRAB",
            "text": "Beautiful historic restaurant with an awesome outdoor space and great live music. Really nice atmosphere and servers. Delicious jaegerschnitzel."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVM2JrOUdNR3AwTVUxbVpraG5ZelphYWtkeGIwRRAB",
            "text": "I had a pleasant dinner here with my father and relatives. We ordered multiple items, and I had a chance to taste the Forest Wives Mushrooms, Bistro Salad, Oven Braised Beef Brisket, and Crème Brûlée. I also had a pear cider and coffee. The food was delicious, and the atmosphere was lovely, with jazz music playing and the old-fashioned Bavarian ambiance. The service was also excellent, though they took a bit longer than expected to bring us dessert. The location is convenient, with plenty of parking across the street."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNVFUZEVlbEpLVVZSUWVFTnlSRlU1ZWxKcGNrRRAB",
            "text": "Great food, Great beer,  wonderful atmosphere.  The Biergarten was awesome with live music. A+++"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTk0xVlZWbUZQYjBST1IwUnBjbEJqWWxnM2QzYxAB",
            "text": "Everything is so great! We’re definitely coming back 🥰"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SlVtNDRSVGxOZVZNNGVEUm1OblpEVVdGR1pFRRAB",
            "text": "Great german food unmatched selection of beers great music and atmosphere and for the quality of the food surprisingly reasonable prices"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdjluWW5wcDdHZmVBEAE",
            "text": "Authentic German cousins, everything is delicious.Good service. Amanda is the best!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKZUsxSnI0MzdqWjFBRRAB",
            "text": "When I ordered outside one you can't read menu we ordered few things they didn't have the black coffee machine wasn't working they only had brown they had no cream or half and half I got my food Cold did people with me on there side was very busy there so maybe it was just to busy for them I don't know but first experience wasn't the best but I will go back cause maybe it was just an off night on positive place is really cute very nostalgic looking adorable and outside was so pretty"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJLVctS0hkb0w3ZXJ3RRAB",
            "text": "Really good authentic German food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQel9sdWVZem9PNGlnRRAB",
            "text": "Best Beer in town and best food from presentation to taste, 100% recommend it."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5eThLaERnEAE",
            "text": "A great German Restaurant\nThe Pork knuckles are highly recommended"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJLXNtb1dNc01HMVVnEAE",
            "text": "Their beers, their food, the service are excellent. I love their burgers."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZM3REWU9REAE",
            "text": "Great place for a beer outside, hidden gem in the area. We loved the giant pork shank and the sauerkraut with bacon was the best I’ve ever had. Backyard Biergarten was great for bringing two young children"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXBqT3NBRRAB",
            "text": "Great selection of beers. Food is fantastic. Outdoor seating with bar. Great for spring/summer afternoon day drinking. Live music and comedy."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMEtLcWt3RRAB",
            "text": "My saurbraten was tough.they have a sign up asking you to tip in cash,then add 20 percent to your bill anyway.complained about it and asked for the manager.was told there was no manager.so basically robbed of $35.definately would not recomend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncmN1aWJREAE",
            "text": "Absolutely incredible spot. The old German decor & style had me reading the back of the menu about its entire history. Food was impeccable & portions are huge - especially that goulash soup. Service was friendly & efficient. I would absolutely travel from the North Shore just to have dinner here for the atmosphere & food. 10/10 highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0NnZ5VWFBEAE",
            "text": "Haven't been here for a long time and I was surprised to find that the food and service was very good as I remember it. Beautiful old world decor made it very cozy. The pretzel appetizer was huge and very tasty. Venison and cherry sausage were delicious. Our entrees were Beef goulash, beef brisket, roast beef sandwich and pastrami sandwich. Each of us was very impressed with the dishes and commented on how good they tasted. Definitely will be back for dinner soon!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcnEzSVd3EAE",
            "text": "Lunch at Killmeyer’s Old Bavaria Inn, the oldest bar in Staten Island with the largest Hummel in the world!\n\nFor appetizers, we had fried mushrooms and potato pancakes.\n\nFor main courses, we had the Rouladen (sliced rolls of beef stuffed with smoked bacon, onions, mustard, and gherkins with red cabbage & potato dumplings), the Rahmschnitzel (pork cutlets with a creamy mushroom sauce, German home fries & vegetables), and Dusseldorf Chicken (in a wine sauce with shallots, mushrooms and Dijon with vegetables & whipped potatoes).\n\nFor dessert, German chocolate cake.\n\nThe food was good, the restaurant is charming, and the service was excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdHQybzFRRRAB",
            "text": "Delicious. Highly recommend the jumbo pretzel with beer cheese and the chicken schnitzel. The restaurant was absolutely empty. One other table for two was filled. Shocking for a Friday evening. People began showing up around 9pm. The live music was enjoyable. Our server was more than happy to allow any substitutions for sides included with our entrees."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxME5DSWNnEAE",
            "text": "Recently visited Killmeyer's Old Bavaria Inn in Staten Island and tried their burger - absolutely delightful! The burger was juicy and cooked to perfection, with just the right balance of flavors. The bun was fresh, and the toppings were generous, adding to the overall deliciousness. The atmosphere of the place added to the experience, making it a memorable meal. Highly recommend for anyone looking for a great burger in Staten Island. Definitely going back for more!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCcjZfSUF3EAE",
            "text": "This is the place to go for great German food! It’s interesting decorating inside and out too. The service was okay. If you’re looking for beer, then this is also a great place to get one. We tried a sausage platter and it was tasty! For the next time I will try pretzel and potato pancakes, someone said we must try this) On Friday night there was a live music performance. It was very pleasant to listen to popular hits and it added a good impression on the atmosphere in this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbmVUY1BREAE",
            "text": "Great beer list. Fun decor.\n\nSchnitzel was as expected. Burger was very good. Goat cheese salad was not worth plating.\n\nPotato pancakes were puzzling mashed potato patties, had good flavor but the texture was not true reibekuchen/kartoffelpuffer you used to get here, or more generally, in Germany.\n\nOur waitress was attentive and friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1Nzl2V3BnRRAB",
            "text": "Having moved out of the area, we haven't been to Killmeyer's in over 25 years!! It was always a favorite when we lived in Staten Island.\n\nThe food is still delicious, the ambiance was wonderful and our server was both friendly and efficient.\n\nI had a German import to drink, but I don't remember which one I had. I wish I did get the name because it was the excellent.\n\nThere were four people in our party so we ordered three appetizers. The pretzel, potato pancakes and Spaetzle. All were equally delicious.\n\nTwo chose the Beef Brisketas the main course, one had a burger and I ordered Killmeyer's Wurst platter. I chose the bratwurst, blutwurst and weisswurst. Couldn't pick a favorite if I tried! All three were outstanding.\n\n25 years is a long time but it was worth the wait."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLeGQtTmNBEAE",
            "text": "Omg i love the food. Im no food critic but if you love food this place is a must. Im going to return so i can try everything on the menu. Fast and courteous service, delicious food and large selection of beer, what more can you ask for. Ohhh yeah and good desserts."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNU9fX3RnRRAB",
            "text": "Live music, excellent authentic German food with large portions. Can't go wrong here!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDbDVENDlRRRAB",
            "text": "A beautiful Fall day. My bucket list is to find a good authentic German restaurant in our area. I have 3 in mind. So we tried Killmeyer's in Staten Island. They are located on Arthur Kill Road. So don't expect a lovely location. Now for authentic German  cuisine. We ordered potato pancakes as an appetizer and Jagerschnitzel with hunter sauce and spaetzle. Since it is Octoberfest we ordered 2 pints of imported German beer. The pancakes were not finely grated more like hash browns. They were plump not flat with a overly fried taste. The Jagerschnitzel was pounded too thin and again over fried.  The hunter sauce was just bland. A real disappointment. Now the Beer was delicious. Another hit was the history of the building and original interior design. It was built in the late 1800's. This is worth the trip. The original Steinway piano, the original  bar with ornate wooden carvings, wild animals stuffed, and older authentic decor. It's worth the trip just for that."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnazdUUUZREAE",
            "text": "Very good. Excellent bartenders, cool vibe, touch tunes, great patio out back.  Loved the potato pancakes and the meat dishes. Since they were out of Maker's Mark the bartender suggested another option for my Manhattan it was very good"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3cV8tZl9nRRAB",
            "text": "Popped in for a mid week dinner and a beer with a buddy.  No waiting, seated right away.  Beer is always on point here. Food was good, could've been a little warmer, but still tasty.  Glad I skipped an app, because I could barely finish my entre."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJdjV1Y1N3EAE",
            "text": "If you like old style bar you can't miss this place, it was the first bar at staten island and running by a family for decades. I went by bus from the ferry station, it was a quite  long journey, but anyway I had enough time for it. The staffs are great and there's a great beer variety."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NExfVHVnRRAB",
            "text": "Very pleasant place. Lots of German tap beer. Food is decent and the service is superb. Can’t wait the summer time to visit their beer garden to relax with a jag of cold one. If you ever been to Germany and know something about German beer and food this is the place to taste it again on American soil."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMHA3ZUtREAE",
            "text": "Decent place, went there on a date night with my wife. Tried to call make a reservation online through Google and they said they weren’t able to get in contact with the Restaurant. Then we get there and it took about ten minutes for us to be seated. The staff was friendly just wasn’t very urgent about taking care of their customers. When we finally sat down the table was still wet from cleaning it, a slight residue is normal but this was much more than that. Our appetizers arrived and we didn’t have any utensils. Shortly afterwards the young lady came back with them. The beer selection is pretty good I enjoyed that and the steak Heidelberg was just above decent. My wife loved the Sausage and potato pancakes. This could have been a four star review, but another thing that annoyed me is that they charge an additional fee for using credit card. The ATM charges a $3.50 fee, and you can only take out $120 Maximum. My Bill was $116, so I had to take out more money and spend $3.50 to tip the waitress."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcnZ6a29BRRAB",
            "text": "Great selection of German food. Nice old style decor. Band on fridays. Holiday drinks."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlc1pYd1RBEAE",
            "text": "Really great goulash and potato pancakes! Awesome selection of beer. Food in general is very good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eXJYMlBREAE",
            "text": "Killmeyer's is an excellent place with a lively atmosphere and is well adorned with German decor every which way you go. They even have live music if you come at the right time.\n\nTheir pretzels are fresh and taste great with condiments. The chicken tenders are pretty good and the fries are nothing to write home about but I'd be lying if I said I should judge the place on this. The pickles and onions are good too. While I may be a teetotaler, I can tell they must have some strong beers as my friend Sean was hopelessly drunk from just one beer there. Granted, he is considered a lightweight.\n\nCompared to say Pizzeria's, German restaurants are a rarity on Staten Island but with what limited experience I have with German restaurants, I would say Killmeyer's is a great German eatery.\n\nHere's a picture of my friend Sean in the process of falling off of his chair from how drunk he got from one of the dark beers there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxb2VqcWh3RRAB",
            "text": "Putting the “Kill” in Killmeyer…ate there today and the food was cold and prepared in a flimflam manner (do these look like they should cost $36 and $27… Schnitzel platter totally thrown together with meager drippings of sauce on top, and my cold Sauerbraten was obviously microwaved to luke warm when I complained) . The girl waiting on us was also the hostess so barely saw her. Took like 2.5 hrs to have a meal because everything took a lifetime to get. We complained and the server told us that they are not only under new management but that the cook quit today. So yep, will never come back. An end of an era. RIP Killmeyers….we will try to remember you the way you were before this tragedy befell you"
        }
    ],
    "reviews_count": 55
}