{
    "name": "Ho' Brah",
    "place_id": "ChIJd2O20Za1w4kR1n-5W0WKoZE",
    "grid": "SI3",
    "address": "4895 Arthur Kill Rd, Staten Island, NY 10309, USA",
    "rating": 4.5,
    "user_ratings_total": 343,
    "phone_number": "(929) 529-8500",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodlNVSnJkMmsyUzBSNGF6VnBSWFkwZG1FMWRuYxAB",
            "text": "Brisket taco was delicious. I would definitely order again. I tasted them at Linden NJ Latin fest. Only reason its not a 5 is because there was no fish tacos lol. I will definitely take a trip to try them soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MFpFVnhZMjlGYUVkT2QzRmFjQzFXZURZd2FFRRAB",
            "text": "We got the nachos to start with pulled chicken which were pretty good but needed some more chips for all the toppings. Then i got the bobo burrito which i always love! And the plantain chips it comes with are great! We also got a bowl which was good but the brussel sprouts in it are amazing and the best part"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSR1lVOWFOekY1WmpZeVdHbDFkVGQ0YW5sc1VHYxAB",
            "text": "Our waitress Jenn was\nsuper friendly. Good service. Clean restaurant. Food was great. What else could you ask for."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weWFreDNOMHhtYkdJM2JXeE5hbGt5UzBNMlVVRRAB",
            "text": "My first time at this location! Always delicious food and great atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sb2RHRlpWbWN3VjNKbU5HeEdMVFZ3Y1c5SVdHYxAB",
            "text": "Amazing Anthony was very good !!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCa1UzaFNTRWhTWW0xS1lsaDFlV0ZyTjNadVZWRRAB",
            "text": "Very good service and food is great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUE1sOWtPRTEwVUZKTlEybG1Rbmd6T0VwR1RHYxAB",
            "text": "Loved the guacamole and chips! The Jay Bay salad was fresh and delicious. Welcoming atmosphere, friendly staff, and fast service. Great spot for a meal with friends or family."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdVFWWmtVa1ZyVTFScWRERmhRMDF3TmtOWmJtYxAB",
            "text": "The server Anthony was great. Food is always perfect."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rd2NrMW5lRXBHVmtsVExXTkpRMlpoY1UxbE5YYxAB",
            "text": "The moment I sat down I had great service. The workers were all very nice. The food and drinks came out very quick!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zell6UnlVV0pvY1hWMlpUSktjbmRxZVVZNVNtYxAB",
            "text": "Bridgette is awesome-so are the tacos and drinks!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOclMycEpRVkZWZUZSMlFYcDJhRWRETFhKZldVRRAB",
            "text": "The food is absolutely delicious.   The staff so friendly.  Just a great place to eat at"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNmNUZFJhMDl0TTBWcVpWaHZjVWxDWjBSTVRsRRAB",
            "text": "Food is absolutely amazing. The Mexican Street corn is a must try. Server was awesome, and made us feel welcome."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSck9EaGFZVjh4UkVKQ1FsSnZVRW8xV1hvM2VYYxAB",
            "text": "awesome place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oU2FrMUxZVlJxTWxrM1ZuUlNiMmQxYW5GdFpVRRAB",
            "text": "Love this place it is so good!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNVZVOHpPVGhUUzFwQk1raGpjeTFmVjNZMk4xRRAB",
            "text": "love this place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKU1QwRkJUR0paTFVaalZXdHRhRFJJUWxWUVQwRRAB",
            "text": "$40 for 2 burritos that were gross, awful"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKT1FuNFN2NnYtNV9RRRAB",
            "text": "Our entire meal including drinks, appetizers and entrees.....service.....everything was very good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOQ1YxSVRtclpIR1dREAE",
            "text": "Always a good time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNVG5vWkxheUx5VkhnEAE",
            "text": "the atmosphere is nice and the service is good. the food is good. good portion."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLVGR1YWVXdG9XVGh3RRAB",
            "text": "come and experience Mexican food, That’s unbelievable aloha"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbmh0ZUNKbnM2ZXhRRRAB",
            "text": "great place!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOS05vX1dDNVBfYnN3RRAB",
            "text": "Phenomenal eats"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPN3IyNzJEOV9fLTR3RRAB",
            "text": "Good Eats"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNbUg1Zi1wc1pyVDBRRRAB",
            "text": "Great staff. Great drinks. Great food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKNnJsckhTanAteDVnRRAB",
            "text": "This place is great. Amazing service stuff came out quick and the waiter was so nice !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQXzYzXzdFcF8tQXFRRRAB",
            "text": "Love this place. Shots!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJUzRzNkNua3JyTXhRRRAB",
            "text": "Great people"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbjhyTmJCeW9ldkhBEAE",
            "text": "Great time for Knicks vs Celtics"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbWlsTnF3czVUR1pnEAE",
            "text": "So delicious I love this place. Nick is the best waiter."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNemQ0LTZ5emE2OTJRRRAB",
            "text": "This place is great! Wonderful service and the waiter nick deserves a raise what a great guy!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYWZzNkc4blpfbHpnRRAB",
            "text": "great service !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYlA5S3k3eHRhVGVnEAE",
            "text": "so great nick was such a great waiter, wow amazing work!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLXzh5OTI2b01hVl93RRAB",
            "text": "Love this place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKam1pTzNBOWZXaUl3EAE",
            "text": "So good and drinks are awesome"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMTE43b25keklucmt3RRAB",
            "text": "Amazing service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJdkpfWXZyczV6NkZ3EAE",
            "text": "Such a great experience! Everyone was so welcoming, would come back again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMMzVwX1hIdEphQU53EAE",
            "text": "People were drunk and fighting in the front door for Cinco da mayo , so very poor trashy look"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeHYyZmtRRRAB",
            "text": "Food was excellent"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaHRPLWpBRRAB",
            "text": "Very long wait for my party, only to have ok average food. A little disappointed, especially with some of the  portion sizes for the $."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOUxqeHJnRRAB",
            "text": "Great service, delicious cucumber marg, they even made it skinny!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbHF6dkNnEAE",
            "text": "Great friendly staff.  Tacos were great and flavorful.  Close to the best I’ve ever had. Great spot for dinner.  Not too busy at all and service was fast and the atmosphere is unique.  I really liked the guacamole as it had the right amount of kick. Mac and cheese was wonderful.  Would recommend this place and we will be coming back soon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeTYzSTFBRRAB",
            "text": "WOW what a pleasant surprise this place was. Had a quick visit with daughter to celebrate her end of regents exam, and this place just fit perfectly for the occasion. Service was quick, the staff here is very friendly and the atmosphere is so unique. I didn't known which way to look, every wall was decorated so interestingly. The tacos we ordered were delish, I really loved the guacamole as it had the right amount of all the ingredients. I said to myself, finally someone got the recipe right with guacamole. They also serve beer on tap. There wasn't anything to complain about at all. Definitely recommend this place and we will be coming back many more times."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcG95eTVRRRAB",
            "text": "Gal Gaddot plays the role of Wonder woman... but the waitress of this place IS wonder woman.   This poor lady is doing EVERYTHING.   You all need to come here and see this"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicWJQbjBnRRAB",
            "text": "My friend and I came here for brunch and this place was so amazing! We really enjoyed the food and drinks. The music was great too! Lively atmosphere and friendly service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibE8zWnVBRRAB",
            "text": "Chips and  salsa were good, although the salsa was a little bit loose. But that may just be  a personal preference.\nTacos were good. Proteins  were  tender and flavorful but a bit pricy. Fortunately, we visited on \"taco Tuesday,\" so it was buy 2 get one free."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bmRuTGJBEAE",
            "text": "Jahawd at the bar was so attentive and friendly to us. The food was delicious and drinks were perfect! Definitely a great and chill place for taco tuesday, and you get your moneys worth!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCeHZhX09BEAE",
            "text": "Mediocre food with average service.\nWe visited Ho' Brah on Arthur Kill Rd, Staten Island location for early dinner in Dec 2022. Unfortunately, the food mostly disappointed :(\n\nWe started with Guac & Chips with salsa and Aloha Wings appetizers. Guacamole was pretty bland, lacking spiciness, lemon, or any flavor.\nAloha Wings turned out to be delicious and ended up to be the best dish we tried that night. They were done to perfection and had a very flavorful interesting sauce/glaze.\n\nWe then ordered several different tacos and one Steak Chimichurri.\n\nLong Beach All Star, Korean BBQ, and Bohemian tacos had very dry hardly-chewable meat, very little of no-meat ingredients, and almost no sauce which made them even more dry. Add to this a thick dry corn tortilla and you get a worst-tasting-taco :(\n\nOut of all ordered tacos only Cabo Fish and Classic Cali Fish tacos were decent. Not perfect, but ok. They also were quite dry due to scarce sauce and additions, but better than the other three. Not sure, why this was the case with all tacos. Was the chef feeling greedy that day? The fish was good though, so these fish tacos could be made delicious, but they were not.\n\nSteak Chimichurri (ordered medium rare) came looking great but turned out to be well-done. Later on the receipt I found it was written down as \"medium\". My son ate it but it was unimpressive, just ok to stuff the belly of a hungry teenager.\n\nThe beans served on the side were from a can. We all agreed on this based on their taste and this was not nice.\n\nThe service was average and unremarkable.\n\nUnfortunately, the place didn't meet expectations on food and we are not coming back. We cannot recommend this restaurant.\nI wonder if the food is better in other locations but I'm not too eager to try.\n\nCouple of suggestions to the owners:\na) For tacos provide a choice of \"Homemade Corn Tortilla\" and a regular thin soft flour taco/tortilla. I understand it's the matter of preference but it's so easy to give your customers a choice on this.\nb) Please don't serve canned beans or any other canned food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNWJLblN3EAE",
            "text": "Let's talk how this places service was the worse of the worse I have and my family have every experience. Not waiting for 25-45mins to have the just appetizers ordered. We were a party of 13 with a reservation and we we're on time at that, 3:30pm. We we told the delay in service at first was the change of shift. No waters provided for the table none ever introduced who would be talking care of out table. And we were only 1 or 4 tables at the time. The place was empty.\n\nWe went to celebrate a family birthday and went because we have been to the Ho Bruh in bay Ridge Brooklyn that the service is incredible, food is good and they are always busy. Ain't never had to wait so long.\n\nIt was over an hour later when they actually took out orders and brought crayons for the kids. Stop no water brought to the table. Napkins requested 3 times already. They took our entree orders twice because they only took have the tables orders. The delay in food arrival was insane. Side orders or tortillas brought twenty minutes after your entree arrived. Our party had to constantly request service from the bust boys who were far professional and delivered better quality service then the actual aside wait person. The icing on the cake for this experience was that around 6pm we were rudely asked to leave with 30mins. Mind you we were still ordering. Long story short they closed us out the last who was supposedly taking care of our table and I quote stated \"well I have to do what I have to do\" and tossed the clipboard with the over $500 tab onto the table & walked away. This is uncalled and highly unprofessional. That's now how your treat customers.\n\nFurthermore had we paid the bill and asked to speak to the manager we were redirect that she was at the bar, on a phone call, etc until she finally showed her face and with zero apologie returned $70 but was very annoyed about the matter. Honestly it seems as though because we seemed to be the only non-white table we were not being treated with the best customer service. In this day and age this is truly unacceptable. Ho Bruh on Arthur Kill Road in Staten Island do better.\n\nThe place is nice, the food was  subpar and the service was despreciable. Many of the staff need some serious professional development and need to improve on customer service skills.  Many the staff at Bay Ridge Brooklyn Ho Bruh can train this locations staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWMkxlbk5nEAE",
            "text": "Good was great.   Bartender at first was overwhelmed but he worked through it.  Awesome drinks.  Started with the first one and ended with a Pineapple Express!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUODl6WGxnRRAB",
            "text": "Absolutely great place great food great service and the band Hollow Molly fantastic  band! Jackie Anne and the 3 Mike's! I will come again all the way from the North Shore of Staten Italy! Thanks a mill Chris!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabS0zMUdnEAE",
            "text": "Very friendly staff- wish you were in NJ!! Best tacos Ive ever had. You’re my lunch spot whenever I have work in Staten Island. 😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicWNYTlB3EAE",
            "text": "This new location is spacious and a vibe! The food and drink are wonderful.  I came for the brunch and had a blast. The Disco Bingo Brunch was so fun."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmd2I3M0RBEAE",
            "text": "Amazing service. We had “Chris” as our bartender and he was very nice (and funny)  to the whole group. Made us feel at home. Great environment to chill and watch a football game. Will definitely come back soon!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeTRiMW5RRRAB",
            "text": "Pretty good food, great drinks.  The band (Radio Daze) makes a pretty good place, even better.  Fun night"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2LWN5UHd3RRAB",
            "text": "Grey was our server tonight and she was great. Full of happiness and very social got the food quick and it was scrumptious. She kept checking up on us and made sure everything was to our satisfaction. 1000% recommend asking for her when you come !!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaGVUX0NnEAE",
            "text": "Just finishing up our meal at this location and we have to say that the service and food were amazing. The server Joe and bartender Chris made it all worth it. They were attentive and accommodating. We sat at two separate tables with our teenage kids and everything was top notch. We own a business nearby and can’t wait to visit again!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dFBIRmJBEAE",
            "text": "This place slaps the taco meat is mighty and righteous. I had the birria and a fish taco and margarita in a powerful way. Come on over for an authentic experience with Ben the greatest surfer in the joint."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGc05YYkxREAE",
            "text": "Loved this place. Great Margarita, good service and the Birria tacos were amazing!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOWJTZ2FREAE",
            "text": "Hoobrah is a cozy spot with bold, flavorful dishes and a laid-back vibe that makes you want to stay awhile. The service is friendly, and every bite feels like it was made with care."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3LUpEVXV3RRAB",
            "text": "Always enjoy Ho'Brah and it was a festive atmosphere on 3/15 with a live classic rock band - Exit 12. The fish tacos are my go-to favorite.  The pork and brisket are also excellent.  The guac is my usual starter - it's good, but could be better.  Anyone who has celiac and needs gluten free, can easily and safely eat here.\n\nOverall, I highly recommend it for a casual dinner."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOWIyZFN3EAE",
            "text": "Delicious food, love the cry baby quesadilla and the welcoming staff. Chris is awesome! Always friendly and attentive. We especially enjoy Wednesday night karaoke with DJ Frankie, always a good time."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeGV1dG93RRAB",
            "text": "Had a great time!! Our server Joe was so nice and got us anything we needed.\nThe bartender Chris made amazing cocktails abd was so friendly. Would recommend to anyone."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeFlXYmV3EAE",
            "text": "If you’re looking for a great experience at Ho'Brah Bar, Bartender Chris is definitely someone to keep an eye out for. With a warm, friendly attitude and expert drink-making skills, Chris creates a welcoming atmosphere that makes you feel right at home. Whether you’re a regular or a first-timer, he’s attentive without being overbearing, and he knows how to craft both classic cocktails and unique specials. He’s also quick on his feet, ensuring you’re never waiting long for a drink, even during busy hours. Overall, Chris adds a personal touch that elevates the Ho'Brah experience. Highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmd1lISnR3RRAB",
            "text": "Chris the bartender is the best bartender on Staten Island. I had so much fun sitting at the bar watching football all day, I never wanted to leave. I will definitely be back as soon as possible."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbkp1ZUp3EAE",
            "text": "Horrible service & Food. You have to ask for any extras (sour cream, cheese etc...) Fajitas always comes with those sides. Plus you shouldn't have to ask the waiter 3 times for something.  A friend wanted to buy us drinks & the waiter took it upon himself to say NO, someone already bought them drinks without even asking us."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2enY2TmtBRRAB",
            "text": "Had the most best experience! The Ho’brah on Arthur Kill Road is amazing! Their food is spot on! The service always amazing! The atmosphere is always SPOT ON! I just want to especially HIGHLIGHT our server Jahawd. He was so attentive, he recommended the Locos frites, and all the tacos, the Diablo shrimp taco was so good! I love spice! And the drinks A1! Top notch!! He recommended the frozen marg, and said to pair it as a bulldog!!! Amazing! Will be back to see Jahawd for sure! And shout out to the General Manager Sharde for checking on us! Can’t wait to come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaemFQWGZBEAE",
            "text": "Great place!  The food was amazing, fresh, and presented nicely.  Also loved the margherita flight!  We will definitely be going back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMlpmeVVnEAE",
            "text": "We had a table of 10 people. They brought two people's plates out of the time. And then they'd wait about 5 minutes before they brought out the next one. So the first two people who got their plates were done and cleaned up when the last two people got their plates. That's not how you run a restaurant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmb2VLZ2pnRRAB",
            "text": "Came to Hobrah to watch some football on Sunday. The bartender Chris made it a super fun environment, while serving great drinks, and providing terrific service. Might’ve found my new Sunday tradition for next season!!!"
        }
    ],
    "reviews_count": 69
}