{
    "name": "Dani's Italian Bistro",
    "place_id": "ChIJGwx_fJ_Kw4kRny1yq4WnfRU",
    "grid": "SI3",
    "address": "7331 Amboy Rd, Staten Island, NY 10307, USA",
    "rating": 4.5,
    "user_ratings_total": 108,
    "phone_number": "(718) 554-4615",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ac2NVNHlSbmh2ZW1WU1pGQjZPR2xIWHpsT1gxRRAB",
            "text": "Never a disappointment!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWWFURTRSa0ptYW10cFNUaHVXak5tYW1sb1pFRRAB",
            "text": "If you want the BEST this is the it. Hands down THE BEST RESTAURANT ON STATEN ISLAND!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXAzeExBEAE",
            "text": "Food was delicious and service was great"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdmViNG5RRRAB",
            "text": "Danis is the best intimate dinner in Staten Isand. Never disappoints! Drinks, specials and even menu staples are always on point. Service is always just perfect for a cozy bistro. Get your reservations!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOUpxeWZ3EAE",
            "text": "I  recently dined at Dannie's Italian Bistro in Staten Island and had a wonderful experience! The food was delicious and authentic, with generous portions and flavorful dishes. The service was top-notch, with friendly and attentive waitstaff who made sure our needs were met.\n\nThe atmosphere was cozy and intimate, with only about 10 tables, making it a great spot for a date night or special occasion. The prices were a bit on the higher side, but the quality of the food and service made it well worth it.\n\nOverall, I would highly recommend Dannie's Italian Bistro to anyone looking for a great Italian meal in Staten Island. Be sure to make a reservation, as the small size of the restaurant means tables can fill up quickly!\n\nRating: 4.5/5 stars\n\nPrice Range: Average to High ($20-$40 entree range)\n\nRecommended for: Date Night, Special Occasions, Italian Food Lovers"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5enV6dm1nRRAB",
            "text": "Been coming here for years. Amazing spot, great food, wonderful atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdlpXdS1nRRAB",
            "text": "My friend and I both had veal dishes, and the meat, though tasty, was too tough.  They seem to be good cooks, but the meat is inferior."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0bkpHejVBRRAB",
            "text": "I expected better after reading the reviews, yes staff and atmosphere was nice, food, not so much , very disappointing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROc1BDaXZRRRAB",
            "text": "Great spot for a night out.  Love the quiet atmosphere and friendly staff"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N2I3LXZnRRAB",
            "text": "Truly down to earth staff,along with being  attentive to the customers request.\nPerfect romantic Atmosphere as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NTUzbVhREAE",
            "text": "Food and service always excellent"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobl9iS2ZnEAE",
            "text": "Always a special treat"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQteGNTeHRnRRAB",
            "text": "If your looking for a quiet place to enjoy quality food and good service, Dani's is the place to be. If your more than 2 people make a resv. because seating is limited."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMThhblJREAE",
            "text": "Amazing Italian food.  Amazing drinks.\nAmazing atmosphere.\nThis place is a hidden Gem. Cozy and perfect for date night. If I could give 10 stars I would."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNcjVYeTJ3RRAB",
            "text": "Love this place,quite,it is a great little intimate atmosphere and the food and service is unbelievable."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxaU0yUDJ3RRAB",
            "text": "Food very good but they did not put on air-condition  door open\nMosquitoes  had a feast  with me we asked ower plz put on air-condition  she said noo friends where hot . Never hoing back"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNdU1pT2VnEAE",
            "text": "Super cozy. Always a nice time. Delicious food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbnZHb0F3EAE",
            "text": "G00d experience"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5cF9HbmxRRRAB",
            "text": "Had an amazing experience here. Awesome food and a phenomenal staff!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpMGZ6bXh3RRAB",
            "text": "Went to Dani's for the first time I give it 5 stars. The food was and service were excellent. It was an adorable intimate restaurant."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDZ3FUdGtnRRAB",
            "text": "Neighborhood spot we absolutely adore. Kelly and Dani make you feel at home. You will not be disappointed! God bless America!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4bmRxSEZ3EAE",
            "text": "One of the best Italian Restaurants in staten island"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjcmZfaGFnEAE",
            "text": "One of our favorite Tottenville restaurants.  Food and service a 10."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNck11bTZRRRAB",
            "text": "Food and drinks are delicious!! Cozy atmosphere ❤ I have been back a few times and haven't been disappointed!! Food is absolutely delicious and as I have said before so cozy and I will add intimate!! The owner is a sweetheart and the staff is warm and welcoming! My new favorite spot close to home!! Hidden gem 👍👍…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNbDVPbFlREAE",
            "text": "All was great, food. Service. Very nice atmosphere. Great bar drinks. Small intermit place"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNNzdfTUVREAE",
            "text": "Went to dinner tonight with friends..Very pretty place and the food was delicious. Our server l think her name was Paige...so sweet .The espresso martini was OMG.👍Thanks to the chef and the owners..…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbXVpQUtREAE",
            "text": "Great food  great drinks nice owners"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwcExmc1FnEAE",
            "text": "Great food. Good price."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZLTdURUhREAE",
            "text": "Dani’s Italian Bistro a small family owned restaurant restaurant in Staten Island.  The best of restaurants is when the owner is the chef those are my favorite to dine at.  This restaurant also had a really nice intimate atmosphere, and it’s the perfect date spot or just a great place if your looking for a delicious authentic Italian meal.   I had the Mozzarella en Carrozza appetizer which was good, but I prefer mine with less breading.  The sauce it came with was excellent though, and I scooped whatever was left with my spoon!  I ordered one of the dinner specials of the night which was the striped bass over broccoli rabe risotto in a marinara sauce.  I was quite impressed with that dish!  They gave such a generous piece of striped bass here!   It was absolutely delicious!  The marinara sauce was to die for, and the fish was cooked to perfection!  I loved that it came over such a delicious broccoli rabe risotto as well!  You can tell the chef put a lot of love in that dish!  They had a great selection of house made desserts here, and I ended up choosing the apple crumb cheesecake.  It was so good!  When I received my bill I was surprised how low the prices were too which was another plus!  The generous piece of striped bass I was served was only $29!   Just to note I’ve been to the restaurant across the street before DeLuca’s, and Dani’s Italian Bistro blew them away with their food, reasonable pricing, service and atmosphere!  They also had a nice selection of filet mignons on their menu for only $31 as well.  Service was excellent, and the owners are warm and welcoming.  I highly recommend dining here!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRbHFPMjFnRRAB",
            "text": "Appreciate the small antipasto plate for each table. Ordered from the daily special- a nice portion of Halibut on artichoke risotto. Dish was tasty but visually bland (fish and rice same color) and i didnt see/taste artichoke but rice was still good.  Needed a green vegtable, two or three asparagus across the top or some broccoli or green zucchini slices on the side would have really helped balance the plate.  Veal Saltimbocca (hubby choice from menu) was just okay...plenty of fresh spinach but the prosciutto was too thick and difficult to cut through (not sure if it needed the hardboiled egg across the top..?).   For appetizer, Clams casino very tasty and yummy and would order again.  Place has loyal customers and a friendly/cozy vibe.  Will visit again for sure."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcGQ3X2xBRRAB",
            "text": "Went here with friends for dinner and had a great time. Food was delicious and the atmosphere was nice. I have to say that I was pleasantly surprised at the price. It was much less than I had expected ro pay we had appetizers and drinks. I definitely would recommend this restaurant and will definitely be coming back."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndkl6bGR3EAE",
            "text": "One of my favorite, local, family owned Italian restaurants in town, arguably some of the best Italian food you'll have. Intimate setting makes for excellent service with daily food and drink specials that are always great. Highly recommend for anyone, especially couples, families welcome as well."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVaHJ5TWdRRRAB",
            "text": "Great little place. Food was great but recommend making a reservation."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnODR6Wkl3EAE",
            "text": "Awesome prices, Huge Portions,Great Drinks. Truly one of the greats. If you have not eaten at Dani's Bistro, You are missing out on one of the Best Restaurants in NY."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncG9tSmtnRRAB",
            "text": "Awful. We had an  8 pm reservation. That doesn't seem to really to matter. The place is small. Granted. 30 seats, plus another 10 at the bar. Every table was taken, and every table either still had bread, and or Olives and Cheese. (That's the standard.) No greeting from anyone. The tables for 2 are on the wall, and the bar is adjacent. Essentially your having dinner and looking at asses at the bar within arms reach. A little too close for comfort. Finally I snag a waitress and announce that we are there for our 8pm reservation. The woman behind the bar (who doubles as the hostess) put up the peace sign indicating she'd be with me in 2 minutes. 10 minutes later, we order a drink. Gin and Tonic. Weak, and watery. The waitress told us that our table should be ready as \"soon as these folks get up.\" She goes on to tell us they have just been chit chatting for about 20 minutes despite the check being paid. Table management 101: Politely suggest that they take their conversation to the bar so they can accommodate their loose reservation policy and turn the table. That cash is in the register already..successful restaurants make money by having that table keep generating money. Didn't happen. The crowd thins out at the bar because at this point..People are walking out because nobody is paying attention to them. 2 couples left in a hiss. Nobody noticed except for us.  We settle in at the bar where I announced we'd be setting up shop. It's 8:40. We have to ask for everything. Bread, Butter, Plates, Silverware, Olives and Cheese, another drink. Hold the show..They're out of the gin we were drinking, which accounts for the lack of strength in the first round. OK, We order a bottle of Pinot Noir. $38 on the menu, $15.99  in any store. by any standard... A  Little excessive.  We ask the busboy if he could close the basement door to reveal the specials posted on a blackboard behind the bar. We were told \"We don't  have that..It's for show.\" Upon closer inspection the half scraped off Christmas Tree Shop $.99 price tag should've  been an indicator. Instead we were handed  a red sauce and olive oil stained sheet of paper with the specials. We got the Mozzarella Kisses (A ball of Polly-O Mozzarella Deep Fried) and a Bistro Salad. That was actually good. For our Main Course I order, at the waitress'  suggestion,  The Bistro Chicken.  It's a Chicken Cutlet  topped with Filet Mignon in a Brandy Cream Sauce.  Chicken was dry, Sauce was warm at best and the \"Filet\" was so overcooked, it would be tough to tell if it was a Filet at all. I'm doubtful. My wife got Chilean Sea Bass over (subbed) Roasted Red Pepper Risotto. The fish was cooked well, but the risotto was made with Long Grain rice instead of Arborio, and it was runny and luke warm. The bill..$153. $12 Watery Drinks left me wondering if I was on Amboy Rd or Little W. 12th in the Meatpacking district. The reason why I gave it even 1 Star is because Paige, the Waitress was good at her job. Listen..The place is packed, and this review isn't going to hurt them....rather than just give them an honest recap so hopefully they can tighten up the ship. Otherwise...It'll sink."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURneTZHbW93RRAB",
            "text": "Awesome. One of the few places I will consistently go out to eat to. Literally every item on the menu is phenomenal. The owners are great, too :)"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRajZ5eW1nRRAB",
            "text": "A little over priced. Plates are small. Food was tasty but salty. Service was good. People were very nice."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVckl6MmFBEAE",
            "text": "The service was excellent and the dinner was excellent every time we've gone to eat dinner at your restaurant Des food and service is just out of this world"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcVlpS2RBEAE",
            "text": "Intimate, romantic (quiet) atmosphere on a Saturday night.\nLimited tables.. highly recommend reservations"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvbWNlNU9BEAE",
            "text": "Fantastic food, always something different on the special menu. Love it here!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbGVlWjlnRRAB",
            "text": "What a great experience\nFood was fantastic and affordable\nStaff and atmosphere made this a great dining experience"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcWVyaVdBEAE",
            "text": "Nice and cozy, perfect for date night. Great food and atmosphere."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvX191cWZ3EAE",
            "text": "Absolutely wonderful, food and service. A hidden gem."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcGZldnRRRRAB",
            "text": "Food and service excellent\nCan't wait to  go back\nCharles .......Craig ave"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNlp2VmZ3EAE",
            "text": "My favorite Italian restaurant.  Wouldn't go anywhere else."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwMkpMVndnRRAB",
            "text": "Great place\nAwesome Food\nKelly & Danny do an Awesome Job"
        }
    ],
    "reviews_count": 46
}