{
    "name": "Lobster House Joe's",
    "place_id": "ChIJl3kLPUK1w4kR8B1dskvDkt4",
    "grid": "SI3",
    "address": "4707 Arthur Kill Rd, Staten Island, NY 10309, USA",
    "rating": 4.3,
    "user_ratings_total": 595,
    "phone_number": "(718) 227-0003",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaE1XVjRSelZ0YlZCYVFVMUpOalJGU1dSNlowRRAB",
            "text": "Two things to try are the Oysters Rockefeller & the Scallops Parmesan Hero with sweet, medium, or hot sauce. You'll fall in love 🐠"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUGJFOVhjMWcyUWtZNFIwNVROME5QUWtwc05IYxAB",
            "text": "Excellent seafood. Excellent service"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSWFYaHBOVmR5WmpJNGVuRXdZMU5mWDJSTmVIYxAB",
            "text": "I ate at the other location so I wanted to share my experience here. Given the horrible one I had at the Hylan location, I would definitely not waste my time at this location since they are owned by the same people.\nMy family and I have dined at the hylan location for so many years using an entertainment coupon that used to be in a book but now it’s digital. The manager stated they always deny people using it even though the owner agrees to be in the book. Clearly, the owner knew exactly about the coupon so it’s extremely unfair. The manager had such an attitude about it, stated she’s been working here 15 years and never saw it. I showed her that the hylan location is on it and she told me I looked it up through AI.. after calling the owner, he said it would only be honored as they are closing in two weeks. Waiter seemed like he was in space and only checked on us 1 time through the meal. The regular customers were treated so differently than us so this would definitely happen in this location as well. Asked for a check and waited 20 minutes for it .. couldn’t wait to get out!!! Would definitely avoid this location!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQ1dWcE9kVWw2UldoRVNWYzJkbFZGZEVKZk5uYxAB",
            "text": "Great food and service.\nIt reminded me my grandma's cooking."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzNWVIaFZkMHhsZWtGWVFucERUbGRhV1U0emJsRRAB",
            "text": "Awesome deals 👌 Awesome seafood and pasta 😋 ♥️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNFkwVldkMVZOTTNwMmRtVlZVSFkxYURod1VsRRAB",
            "text": "What a great spot.  The staff is awesome and the food was excellent.  Will definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xad1lXWkhZVUpuTTBOMWFIcDNiM2hNY0VVMVUwRRAB",
            "text": "Great place.  Good entertainment for the afternoon"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dlFrWXpTV1IzY2s1M1JtWXRlWG8yVVd0ak5GRRAB",
            "text": "Had great experience and the lobster was great"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWVoxRXhhVkZXWVdoVVdGQmhVMjlHVEdSYWNYYxAB",
            "text": "Vert friendly employees  Food came out fast and hot. The calamar was good. Ordered Fish and Chips.  Waffle fries were season  and tasty. The fish was breaded too much, giving the impression of a lot of fish pieces. The fish was cod but not the greatest, I dont recommend it at all. Alittle pricey."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaGFWRnNlV1pKTW10dFdsOXBibTlyZVZkeFQxRRAB",
            "text": "Very dissappointed that many seafood entrees come with absolutely no sides unlesz you pay extra, what a rip off!  & no rice or plain baked potatoes on site. & atmosphere  is sterile. Ill find a better place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGalRESnVjR1psWWpoSk9UUlJURWhCVWpaV01tYxAB",
            "text": "Fed a family of 5 for under a hundred $..."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeWE2bGx3RRAB",
            "text": "Did not meet my expectations."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOcXY0LUhDMmVtU1NREAE",
            "text": "Had a great time.  Lobster tails were true to size and cooked to perfection.  Definitely going back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYnpuS3FidnRfa2ZBEAE",
            "text": "Phenomenal lunch experience at Lobster House Joe's!\n\nHad an incredible lunch with my family. The service was truly exceptional--our server, Grace, was amazing! She was so warm , attentive, and made sure we had everything we needed throughout the meal.\n\nWe tried a little bit of everything--pasta, seafood, steak sandwich-and everything was absolutely delicious. The portions were generous, the flavors were spot on, and to top it off, the prices were very reasonable.\n\nGreat food, fantastic service, and a welcoming atmosphere. We'll definitely be back again soon!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZLXYzVnFBRRAB",
            "text": "⭐⭐⭐⭐⭐\nOur family loved dining at Joe's Lobster House in Tottenville! The nautical theme kept the kids entertained, and the staff were exceptionally welcoming. The seafood was fresh and flavorful—the fried platter (shrimp, clams, oysters) was a hit with everyone, and the garlic bread was irresistible. Generous portions arrived hot, and the team handled our busy table with patience. Perfect spot for a relaxed yet memorable family meal. We’ll definitely return!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNUx6S1lREAE",
            "text": "Service 10/10, drinks 10/10, actual lobster …. Eh.\nWould try it again but pretty pricey for dry lobster.\nYet again service and drinks were good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dkwzUjRRRRAB",
            "text": "Lobster meat was harder than it's shell"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURROWRTVTJBRRAB",
            "text": "I recommend this restaurant best seafood . Not that expensive."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzNnVUaTlBRRAB",
            "text": "\" Would you like some Seafood with your garlic?\"\nI've got nothing against garlic. However when it's piled on the little shrimp you get, so much so that the shrimp is undercooked in the area that is covered by the pile of garlic, I think it's a bit much. There's only one reason you would need a pile of garlic on your shrimp and your linguine and it has more to do with vampires than flavor. We are talking Piled diced garlic!\nThe appetizers were good. I wasn't too concerned that the shrimp in the appetizers were so tiny...after all  they were  just appetizers .  But when I got the same tiny shrimp  as my scampi  with my steak,  I was  quite disappointed.  The pitcher of Sangria was weak. Some of the dishes on other tables looked very impressive. I guess I just ordered the wrong thing.\nAlso, the service was quite good. The wait staff was friendly, knowledgeable and timely. Unfortunately for them, they had to explain that the menu needed to be updated when we asked about the availability of certain food items....some that were available but not on the menu and vice versa.\nAll in all, I will give this place another chance.\nWell, I gave it another chance...and another.  You can still smell the overwhelming garlic from the parking lot.  Adding tons of garlic (even when you specified light garlic) and red pepper to every dish is not cooking. It actually kills the flavor of the food if there's too much.   As far as I'm concerned any red pepper is too much so it should be on the menu so customers can make adjustments. The shrimp was overcooked and the linguine was a child's portion. I'm done giving this place chances."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubnRUalBnEAE",
            "text": "The staff was friendly food was great the south shore location was great"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBczctb2ZnEAE",
            "text": "Excellent had the fish and chips great service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeTU2QjN3RRAB",
            "text": "Great food, got the Cesar blackened chicken and was top notch. Atmosphere was great and they loved our children."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc2FEZGpnRRAB",
            "text": "Service was okay,nothing serious FOOD WAS NASTY,but the kicker was me & my man was told to take our conversation somewhere else becuz they had a large party coming 🙄 bill was 100+ w/tip,restaurant was empty & we was told to leave wow,anyways won’t EVER BE BACK!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbk1PYVNBEAE",
            "text": "Excellent food and servers are great (Frank)   1$ oysters on Thursdays"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdTVYaDF3RRAB",
            "text": "Food was juicy and buttery"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMGJLb1VBEAE",
            "text": "Feels like home every time we dine here.  Relaxed atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdmFEbXBRRRAB",
            "text": "Food was great service was great\nThey just need to do a deep cleaning of dining room walls and chairs I know people are sloppy but the food marks on walls from splatter and sticky chair backs are not good look\n\nOverall I would go back again again and again The food is great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudzlTLUt3EAE",
            "text": "Very Cozy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuX2R5ZlBnEAE",
            "text": "Friday family dinner night.  My son was in the mood for lobster tails.  Lobster house Joe’s was recommended.  He was not disappointed- lobster was done perfectly and was so fresh!  Fried calamari was delicious!  Red sangria was good too!  Will be going back!  Service was excellent!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuc05xSHFRRRAB",
            "text": "Go see joe"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIek95amNBEAE",
            "text": "Great seafood\nGreat prices\nAwsome atmosphere"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbV9tWUNnEAE",
            "text": "I've given this restaurant a second chance after a disappointing experience last year. Unfortunately, my recent visit was just as frustrating.\n\nI started with a large house salad, which was decent. However, the shrimp cocktail was a major disappointment. The menu listed it as a half-pound, but what I received was a mere six shrimp, which is likely less than three ounces. For a dish priced at around $35, this was simply unacceptable.\n\nThe service was friendly, but it couldn't make up for the subpar food and misleading menu. I left feeling both disappointed and hungry.\n\nBased on my two experiences, I can confidently say that I will not be returning to this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidDgzT1F3EAE",
            "text": "The food was terrible. Lobster roll came out with stale bread, lobster had no taste, and no dressing or anything on it. All the seafood shrimps, oysters, etc did not taste fresh and just had a very bland taste. The servers did provide quick and efficient service. Do not recommend coming here, save your money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiX0lLRXJBRRAB",
            "text": "Food was not that good they were all courteous and attendentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyZzZTZVhREAE",
            "text": "Always an immediate go to when craving good seafood on Staten Island at reasonable prices...!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJOS1fWDdnRRAB",
            "text": "Love Lobster House Joe's! My favorite is the lobster roll. Staff is friendly and professional. Highly recommend it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcUpTeEZREAE",
            "text": "Food is good . Service is absolutely terrible. The waitress needs retraining. Zero customer service very rude. I’ve never experienced service that bad . The waitress thinks that she’s talking to her kids at home not customers that paid over $300 for a bill."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqaGRPbld3EAE",
            "text": "Love"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdk1hcWJ3EAE",
            "text": "Yes I was there the Serect Chef was in the House. I went to this Lobster house to celebrate a friends birthday. The food was outstanding from soup to desert . Special sweet sour fusion that s right with calamari an zucchini WOW Great. We filled the table with lump crab shrimp calamari lobster sou"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcTctRWZnEAE",
            "text": "Drinks are good and the servers are very friendly the food is good and oyster’s Thursdays are awesome"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bzZEYk1BEAE",
            "text": "I know there is a second location on Hyland blv. However, I have only been to the one on Arthur Kill rd several times. Each time I am completely satisfied with the food and drinks. This most recent time the staff was a little younger and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOGFfbGRBEAE",
            "text": "First time at Lobster House Joe's. I have been wanting to come here for years, but the wife is picky about her wine. Finally she caved in. We had clams in the half shell , excellent, oysters Rockfella, excellent, Seafood salad good, but very small. My wife gad the Grilled Octupus, she loved it. I had Linguine with ,shrimp,scungilli,  calamari in and oil and garlic fabulous,  alittle pricey . Good capaccino and dessert Pistachio Turtufo. Very good. I am coming back this is seafood paradise!!! The service was over the top , perfect!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaXFUTEZBEAE",
            "text": "Family dinner last night at Lobster House Joe's south location.  The owner Joe is a great guy. If you're a regular, he will always send something over for the table. His daughter is the hostess/bartender most of the time, she's a sweetheart. The place is always clean and what you would except from a seafood spot. Paper table clothes and lobster decore... The staff is very attentive and you see the same workers for years, which to me is always a good sign. There are certain dishes that we always get but sometimes we venture off  to the weekly specials. Last night, everything was fresh and delish.  Like everywhere else, the prices have gone up slightly but it was nice to see the portions go up with the prices. We couldn't believe the sizes of some of the plates. I always get the baked clams, they are done just the way I like them. Al and Bob's shrimp is always a must and they have one of the best vodka sauces around. If you aren't familiar, they have two locations. One on Hyland Boulevard this location is at 4706 Arthur Kill road"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcjd2eVJ3EAE",
            "text": "2018.03 same as the one in hylan.  Franky soup is a bit salty....and this is a spicy (mild) soup in red..snow crab leg fresh. Joe special is not as good as hylan.... Waiter are all super polite and nice...even run over you outside the restaurant (we left our credit card )."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCeTZqamR3EAE",
            "text": "I don't mind paying for good food but it was $88  for 2 dinners and an app..I got shrimp and pasta and my son got fried flounder. Nothing was market price. We'll continue going here but it won't be a frequent spot on the list"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBckpxbDVnRRAB",
            "text": "The food here is very fresh and good. The staff is on point. I come here for lunch, can't beat the lunch specials very large portions and great prices. Now lunch spot love it. I will be back for dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNFBxTGhBRRAB",
            "text": "I’m really not too sure how this place would stay in business!! Due to the fact in their lobster roll price is $22.00 the lobster roll was skimpy it was 1 table spoon size on a hot dog roll. (See picture below) Also Ordered an uncooked crab cake that was served on Italian bread wasn’t a BUN & mind you the greasy shrimp!! I’ll be disputing the credit card charge too. This place is a RIP OFF.. ohh the tartar sauce reminded me of frozen Play-Doh!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5NE9PaGdBRRAB",
            "text": "The absolute worst seafood I’ve ever had! The homemade crabcakes had way too much filling & there was almost 0 crabmeat and they actually have the nerve to charge more for the “homemade”.... I’d hate to know what the\nCheaper version of the crabcake consist of.\nIn my opinion, it would actually be a “plus” if coronavirus shut this place down! Because charging People all this money for this quality of food is A absolute disgrace! Save your money and avoid this place! you’ve been warned!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhakpPT0VnEAE",
            "text": "Quick stop to pick lunch for the drive to the shore. Friendly service and good food. Look at the pretzel!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzZ09uZGh3RRAB",
            "text": "Great place to eat at! From when we first walked in til we left the service was outstanding and the food was good! Definitely will be returning here."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3bXFlU2ZBEAE",
            "text": "love this place. clean and great customer service. always get the joe special."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsb1BMa0J3EAE",
            "text": "Been going here for years , and the food use to be really good! Got the fried shrimp and calamari, the fish was fine. The sauce was horrible, tasted burnt bitter and no flavor at all. I asked for a cup of hot sauce and it tasted the same only the hot tasted like they took the Med and put Tabasco sauce in it!! I asked the waiter what’s going on , the sauce taste horrible .. He said other tables said the same and would find out. Told me he would speak to the manager tomorrow. Don’t mind paying if the food is good, very disappointed and not worth what I paid !!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLaU4tcVZ3EAE",
            "text": "Great food, great service. The lobster is definitely quality & fresh."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRM29LdkVnEAE",
            "text": "Always good fresh seafood!! lobster special  and fish and chips are always amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbl96VHh3RRAB",
            "text": "My 94 yr old mother took my husband and I to try the Arthur kill location to celebrate our 16 th wedding anniversary.  She and I picked a special, Chilean sea bass in lemon butter w green veggie.  We were in a festive mood and didn’t ask price.  The fish was over cooked, the sauce tasteless, her veggie was a slimy looking blob that she had to keep patting w napkin to get some oil off.  My broccoli was over sautéed, wrong heat so the garlic flavor didn’t transfer.  When got the check we were floored to find out that the special was $53 each.  My mother took it with spirit if a champ but we were all taken aback.  Why so much?  And the size was pretty minimal too.  Not that I would care cause tasteless.   This place is cozy and waiter was nice.  But such high price for something that I don’t even want to eat the doggy bag, not friendly.  The fried calimeri we had for app. Had a weird taste on some of the pieces it wasn’t hot, seemed undercooked.  My husbands  NE clam chowder had more potato than anything.  No clams in a clam chowder.  He did order steak and it’s not a steak house, but it was a sad little dried out sirloin. I felt bad for him.  Bottom line, where and who do these people think they are charging these prices, serving below standard food and acting like it’s all good.  It was supposed to be a joyful occasion and we did sit there for a long time w no rush to leave.  Plenty of open tables.  But my mother got food mugged.   Will NEVER go back. Will not recommend to anyone unless they want to sit at the bar. My husbands beer was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdDY3M3BRRRAB",
            "text": "Lobster roll.... Was horrible. It's $24.95 and you get very little lobster meat on a sad hot dog bun. Was very unhappy with the food. The water they brought had a fishy aftertaste and my waitress offered to bring me another glass of water that\" They, The employees drink\" that water was much better. Definitely will not be getting another lobster roll especially at that price unless they change how they make it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMzZqQ0dBEAE",
            "text": "We had a party of 7. I was early and waited at bar. Bartender was lovely to me. No wait when party arrived, our waitress was fantastic.  Efficient, fast, attentive, friendly- food was very good. Hostess checked know isn1/2 way through dinner. All around an excellent experience. Would definitely go back & recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcjd5bV9RRRAB",
            "text": "I got the most pathetic excuse for a lobster roll today I spent $34 to get bread that was so soggy it fell apart before I can lift it up and barely any lobster I called them on the phone and I got hung up on immediately after telling them about my bad experience I usually don’t like complaining but this was pathetic"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHamVUNmtBRRAB",
            "text": "My family and I had a great dinner here last night.  Nothing too fancy, but nice place.  The food was great and very reasonable.  Service was great too.\nWe got an avocado shrimp roll for appetizer that was awesome.  Mt entree was the garlic sauce pasta with shrimp, which was great too. Can't wait to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacU5qSm5nRRAB",
            "text": "Whether we eat in or takeout, Lobster House Joe’s on Arthur Kill Road is always top notch. Everything we order there is delicious, large portions at reasonable prices. The shrimp scampi over linguine is one of our favorite dishes. Made so well. To top it off, the staff is always friendly and accommodating. Keep up the good work! You’re doing it right!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhdjdhVENBEAE",
            "text": "Came here on Thursday night to try the oyster deals with my family. The food and the experience was fantastic. The clams, fried calamari pasta, shrimp parmesan, and the shrimp balls were absolutely delicious. I am definitely coming back.…"
        }
    ],
    "reviews_count": 61
}