{
    "name": "EatItalian NYC",
    "place_id": "ChIJARQkEkZLwokRMcNtYc0S9mo",
    "grid": "SI3",
    "address": "655 Rossville Ave, Staten Island, NY 10309, USA",
    "rating": 4.5,
    "user_ratings_total": 431,
    "phone_number": "(718) 966-4186",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRM1dHNXdWVXBDU1Rrd1FUQlBNMWhHYkhkUWNtYxAB",
            "text": "I’ve eaten here twice and the food was excellent both times."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNdjgtNjhBRRAB",
            "text": "Always a delightful experience, great staff, excellent food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMFZEZFRiME5ETWtsRVIyTXRSRWxDU25wUk5WRRAB",
            "text": "Eat Italian has great food. They have a good atmosphere, not great, but good. The service is impeccable, the only thing is that way way way overpriced on their food. They charge me 6 bucks for a peach soda and $5 for a seltzer, which is ridiculous for 2 people to have 2 entrees, almost a 100 bucks. Overall , great food , great atmosphere , but terrible pricing way way too high"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRlVUaEhNbHBpWkY5dU9UUTBMV05RWTFNemVYYxAB",
            "text": "Place does not care about their customers. Just money."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GdVVURlZTall4Vms5V2VESkRNVlpHWWpKQlpIYxAB",
            "text": "Very tasty food, nice atmosphere,  good service, excellent vibes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRlVuWkpaVFpNV0Uxb0xVMUtTbEJNZFVvM2RFRRAB",
            "text": "The food was absolutely delicious — fresh, flavorful, and clearly made with care. However, the service left a lot to be desired. One staff member in particular, a Spanish-speaking woman\n, was extremely rude and dismissive. It really took away from the overall experience. Great food, but the service needs serious improvement."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbWRVdGZabkpuZEZSSVpsQTNOMWhvVUhCblgxRRAB",
            "text": "The best authentic Italian food I’ve had on Staten Island. Our waitress was incredibly friendly, knowledgeable about the specials, and genuinely proud of her work. The food was amazing and arrived quickly. The peach sangria was a perfect summer drink."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMMlM1S2F0eGU3ZnpBRRAB",
            "text": "Good spot. Did a take out and it was fast. People are friendly and the food was tasty. Had a pizza, salad and rigatoni bolognese. Definitely will be back. Thank you"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbVo2UGUzcFBYWXF3RRAB",
            "text": "Just had a wonderful meal here! The Italian food was packed with great flavor. The mussels were cooked to perfection, and the fish dish was incredibly flaky, made even better by a delicious sauce. Desserts were good too, a nice way to finish the meal.\n\nJust a heads-up: the portions are absolutely massive! Come hungry or be prepared to share.\n\nA great bonus is their BYOB policy - you can bring your own booze for a $5 per person fee, which is a nice touch. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOeVVpT2JQM1pQdmNBEAE",
            "text": "Great staff and great food. Highly recommend."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMV96V0FnEAE",
            "text": "I came to eat here for my birthday and I was sick right after getting home. I had food poisoning or something of the sort. I called the next day to just let them know what I ate so they could be aware. I didn’t expect anything from them just to be courteous. The female person in charge who I spoke to was very rude and at first refused to even have me speak to the person in charge. I asked for a call back and after 2 attempts I got no return call. After that I stopped going there and advised people I know to do the same. I feel you should care as much about the customers as you do the money."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa3JTSUJnEAE",
            "text": "This really is a great restaurant. The food is delicious, the staff are awesome and the atmosphere is fun. I love coming here for dinner. Check it out. You won’t be disappointed."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbjRUWGhRRRAB",
            "text": "Excelente servicio, súper rico todo, 100% recomendados"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvajgzdEZnEAE",
            "text": "Food coma!👍"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaGQ3WWJBEAE",
            "text": "The food was fantastic!  Tables are on the small side and very close to each other."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuM1lpX0t3EAE",
            "text": "Panzerotti delicious this restaurant brings you back to puglia"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHcDZlVVFREAE",
            "text": "Whether take out or dine in, one of our favorite places."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdVBpRUtBEAE",
            "text": "Food was delicious and served exquisitely… Service was on par also. Would recommend highly."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRczRLSzRBRRAB",
            "text": "They seriously need to do something about their bread. It’s white bread with a crust. Serve semolina. The dining room is very tight, but warm and cheerful."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOTllWXdBRRAB",
            "text": "Best Donuts I've had in a long time 🍩 great bread !\n.What a bakery is supposed to be."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncC1mYTlBRRAB",
            "text": "Ordered a panini Rustico... for a place called EatITALIAN, you'd hope they made fresh chicken cutlets. Gross, chewy, rubbery, definitely not FRESH. First and last time"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZbXJiaVBnEAE",
            "text": "a great neighborhood restaurant.  excellent service and great food."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeGRiZGtBRRAB",
            "text": "Excellent food, service, and atmosphere."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdGVDMmhnRRAB",
            "text": "This is hands-down the best Italian restaurant in New York! The pork chop is insanely good—juicy, flavorful, perfect. And the risotto with fish? Absolutely flawless. I’m honestly at a loss for words. Just go try it—you won’t regret it!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfX3ZMbS1nRRAB",
            "text": "Food is always outstanding!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcG9mSExBEAE",
            "text": "Went with a family of 4 on new years eve just for dinner.  Excellent experience and easy to make same day reservation with an early phone call."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQc0ltODNBRRAB",
            "text": "This place is never a disappointment. The food and service are top notch. The portions are very generous as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudlo3MkJREAE",
            "text": "great food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuZ0pYdUxnEAE",
            "text": "Excellent service. The sangria was great and the food was delish. Eat plate enough for 3 days. The frozen espresso shot was a nice treat!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbmIyYmRBEAE",
            "text": "Most of the food is good. But if you want offensively thin, rough and dry veal, then this is the spot for you.\nThe breading is twice the thickness of the veal cutlet, which is just a bit thicker than deli meat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3LW9DQzh3RRAB",
            "text": "Food was great!! Enjoyed my visit and looking forward to going here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyM09LU3d3RRAB",
            "text": "Food is good , no doubt about it, I personally feel its over priced tho… 20$ for a panelle special is crazy… and past dishes nearing 30$ is also O.d considering pasta is literally 1$.a pound"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeVBmSTZRRRAB",
            "text": "Eat Italian is our GO TO! Excellent service, food and staff!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNjdDRWFnEAE",
            "text": "best place ever. the best chicken ceaser wrap of my life"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNUxha2pnRRAB",
            "text": "Food is excellent. Been here many times never disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6by1MZ1N3EAE",
            "text": "Large portions and very good tasting"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcmZTT1RBEAE",
            "text": "A little experience compared to Millie’s.\nAnd the food is just as good both places.\nI would definitely go more often if the prices were just are little more reasonable\nHappy hour would be nice. And special deals."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaFlTOVB3EAE",
            "text": "Have had take out here and stayed for dinner as well.  Both are very good experiences. Excellent chicken parm. Pizza is good, but likely even better if you don't get it to go. It's very thin and cools quick. Good crust. Believe this is a wood fired oven. I have given it a 7.6. Disrespectful Doug says 6.2."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbGJPbGRnEAE",
            "text": "Consistently great Italian food!\nI'm usually fortunate enough to have Luca as my server, he's from Sicily and is always professional, courteous and knowledgeable of all the specials and regular dishes. Highly recommend if you're looking for good Italian food on the South shore."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N1BEQ25BRRAB",
            "text": "Overall, eating at EatItalian was an enjoyable experience yet was not the best.\n\nFood: 4/5\nThe food honestly varies with your personal taste, but I felt that the dish I ordered, the Gnocchi, did not have enough pesto flavor and was more akin to a cream sauce. The pasta was decent, but not the greatest. However, I did sample some other food, such as the burger and a different pasta, and those were quite enjoyable. I think it’s up to personal taste, but I felt that the food was decent.\n\nAtmosphere: 5/5\nMy party was seated in the outdoor area, which provided quite a nice atmosphere. The breeze, coupled with the upbeat music and the gentle sunlight allowed for a very enjoyable dinner. I definitely recommend trying to sit in the outdoor section if possible.\n\nService: 4/5\nWaitstaff was attentive enough, but not the best. They were friendly and helpful, but we did have to ask a few times for things such as water and bread. Overall, the service was pretty good.\n\nOverall, a 4/5 because although the atmosphere was wonderful, the food in my opinion wasn’t the best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREM0t2X2l3RRAB",
            "text": "Amazing experience from the moment we walked in til we left. The service was on point and the food incredibly delicious and enormous portions. You will leave with a full belly and leftovers! Can not wait to come back and try something else."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1dlAtYkN3EAE",
            "text": "Staff is very very personable. Every time we go there,  the waiters remember who we are regardless of how long its been there since the last time we went. Food is always giant portions and everything is delicious.  Some dishes are not as flavorful as others but I really think it is too taste. Overall we love it here. Great food, and love the staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOS1mNFdREAE",
            "text": "Wow. What a hidden gem of a restaurant. Went last night with 3 of us. Sangria, Apps Dinner & dessert all amazing. Owner walks around to tables to ensure you’re well taken care of and food was good. All the food came fresh, hot and delicious. Clam special App was like no other. People working were all friendly. We had a Veal, chicken parm & short rib dinners that we all enjoyed. Dessert also delicious. We had Italian cheesecake, cannoli & lemon sorbet. Go here. It’s an A+. You will love it 👍"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBOV9TZDFRRRAB",
            "text": "A decent Italian restaurant in a fairly newly renovated plaza. It might be because they’re new, but their service could be better tenfold—servers/waiters are not attentive at all, no easy way to get someone’s attention if needed and no one…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacExTMHhRRRAB",
            "text": "Seriously and absolutely amazing from start to finish. From the moment they greet you till they say gdbye! The service was amazing the food was delicious....went over a week ago for the first time and had the pleasure of having the same waiter the second time and he remembered my fiancé's nut allergy. Such a great vibe and experience. Can't wait to return!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbWIzS0dBEAE",
            "text": "This place is always a great choice, the meals always come out hot and in a timly matter. The staff is also very friendly and accommodating. The food is delicious, I can personally say I've never had a bad meal here. Its perfect for a date night or dinner with friends."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcEpfamZBEAE",
            "text": "Food was delicious nice atmosphere excellent service. I had an excellent waitress named Chrissy very friendly and knowledgeable. The best ceasar salad with shrimp and fresh parmesan cheese. I recommend the Sunday sauce taste like mom made it, maybe better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcWY2Qy1nRRAB",
            "text": "Ordered takeout and lasagna was flat, literally maybe 2 layers of pasta, the short rib pappardelle had barely any meat on it and pasta looked stale like it had been reheated instead of made fresh. When I called about my online order, they…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaU96Y1F3EAE",
            "text": "My new favorite Italian restaurant!  Generous portions of great-tasting food.  I wasn't even aware of this place until somebody gave me a gift card.  Well worth going to!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbGN2cnN3RRAB",
            "text": "Loved the authentic Italian food. The proprietor Franco is a delightful and a great host. The pasta taste fresh and homemade. They have a good assortment of Italian dishes and wines. Enjoy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNHFMbmhRRRAB",
            "text": "The owner was very nice he was a winner on Chopped Chef Franco Franzese in 2019. Food was very good. Nice decorations too."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLMGNqYlFREAE",
            "text": "Absolutely delicious! I was passing through town and this place was recommended by people in the DSW I stopped at. So glad I stopped there! The service and the food were amazing!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyZ3VQaEFnEAE",
            "text": "Another amazing meal at Eat Italian NYC by Chef Gianfranco. This double cut pork chop was so tender and well cooked, no knife was needed. Do try this dish next time!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxeDc3RXRnRRAB",
            "text": "The food is excellent and not run of the mill Italian food. Excellent service and nice atmosphere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbDRXZ1p3EAE",
            "text": "Wow! I was bored and raised in Staten Island NY, moved to Las Vegas, NV 5 years ago. I came home to visit and looked up new spots to eat while I’m in town and this does NOT disappoint. Authentic Italian food and a cozy beautiful feels at home atmosphere. Everything is absolutely delicious and their homemade sangria is a MUST!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNTR6VkVnEAE",
            "text": "Good pizza and good pasta. Not to many tables inside so there is usually a wait. Overall good experience, will be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMDZPS0FnEAE",
            "text": "my boyfriend and I ordered food from this place on June 1st 2022 for dinner and normally I get the gnocchi but this time I decided to get the  pescatore pasta dish and when I opened one of the clams I came face to face with an insanely rotted piece of shell fish. Immediately threw it all away. Tried reaching out to the restaurant but never heard back from them. Just beware eating here…I’d stay away from any fish dish. Someone could get insanely sick…like deathly sick from bad fish like this. Thankfully I hadn’t eaten much before noticing the shellfish was completely bad. They should really do a better job at checking the fish before cooking it let alone serving it. Really disappointing experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdDlXaU9BEAE",
            "text": "First time there,  my GRILLED CHICKEN PANINI WAS ABSOLUTELY DELICIOUS!!!!  I ALSO HAD THE SHRIMP BISQUE SOUP WHICH WAS DELICIOUS ALSO!!! I HIGHLY RECOMMEND THIS PLACE!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MzQzaC1nRRAB",
            "text": "Everything we had was very fresh. Highly recommend the grilled calamari and octopus. Had a very nice of hint of char to it. The octopus was very tender."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbDVhQWVBEAE",
            "text": "The culinary offerings at this establishment are of a high standard. I recently had the pleasure of dining here with my family and was particularly impressed with the exceptional service provided by the staff. They demonstrated utmost courtesy and attentiveness, ensuring that we were well-informed about the daily specials. Our meal was meticulously prepared to our preferences. Based on this positive experience, I would highly recommend this establishment for future dining occasions."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcXBmN2tBRRAB",
            "text": "Great atmosphere, awesome staff ,everything tastes so good ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2bUtQa3B3RRAB",
            "text": "Excellent food, generous portions, wonderful all around, we also got take out....! No room for dessert,  that's a first....reasonable prices...!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1MnRIZmdBRRAB",
            "text": "Food was AMAZING. I'm from Florida and my family brings everyone here when we visit."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZdDk2clJ3EAE",
            "text": "Real italian Food!..the place is so cozy but casual is so accomodating!the staff or workers are so friendly and nice..Great fresh food!..i eat in different italian resto but but this on takes 5 star NY michelin for me..than you chef so Yummy yummy delish!!!👍😘🙏More power…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0OThuWnZBRRAB",
            "text": "We ordered three Wednesday's lobster special Dinners. Came with choices of soups or salad. Had a variety of side orders to choose from. All came with large proportions. Came with dessert and delicious hot coffee. Price was descent and services were courteous and friendly!!! Will surely return to try other dishes :)"
        }
    ],
    "reviews_count": 65
}