{
    "name": "Towne Deli & Pizzeria",
    "place_id": "ChIJ2V-xxJ3Kw4kRxRjvo74pg1Q",
    "grid": "SI3",
    "address": "5373 Arthur Kill Rd, Staten Island, NY 10307, USA",
    "rating": 4.4,
    "user_ratings_total": 728,
    "phone_number": "(718) 227-1985",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVmVqTlJVbk5aY2tWelNWcDVVa1pKV2xwb01XYxAB",
            "text": "Just ordered the Sunday sauce special.  Meatballs sausage and pasta.\nIt was delicious.  My entire family loved it.  Highly recommend all of their dinner specials.  Everything is fresh and delicious!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMmFqSmlNV2h1V214NlVUUXdiWE5KWDBrelFVRRAB",
            "text": "We usually order from here when visiting friends. It's very good food for a deli/pizza place. Best Chicken tenders in town. Ordered them with pesto mayonnaise and tatortots."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwek9VbFBOWFZVTkMxdExWZ3lSRlJsUmxWMFgyYxAB",
            "text": "Our family loves Towne Deli & Pizzeria. We often order amazing pizza from them, but last week we decided to go for heros and sandwiches instead. The meatball hero and the eggplant hero were fresh and flavorful! The to-go experience was fast, and the staff were friendly. If you are looking for authentic and mouth-watering options to feed big families, this is your place!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOc1RXWnlhMWhMTmtWUldYZDNYelJzWW5SRWMxRRAB",
            "text": "Food is good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdWFVeGFUVEp0U0ZocFZqa3llbkJ2Y2pGRFpuYxAB",
            "text": "I had the ribeye steak special at Town Deli on Alta Kill Road for Wednesday dinner, and it was really good! The steak was cooked perfectly and full of flavor. The mashed potatoes were creamy and delicious, and the broccoli was fresh and well-prepared. The staff was friendly and attentive, and the whole experience was excellent. I highly recommend stopping by for their weekly specials!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRVdsTXdjMmxOWVRKd1JuWk5TRTR0ZDJVelgzYxAB",
            "text": "My kids like their pizza"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdGVsWndiamhSTTA4NWNXazBUMDFrVEZOTk5YYxAB",
            "text": "Ordered a  lunch special, turkey hero, 1/4 lb. Cole slaw. absolutely the worst sandwich.\nCalled to let that i never had a sandwich from them that bad.\n15.00,\nWoman i spoke with  hung up on me????\nNever again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cb016ZEdXakZYUVMwNVNVRnBUM1pqYXpKSFdtYxAB",
            "text": "Only if they get ppl who understand English and if they hire more staff to go around with meat\nIt's super bad when u get the end of the scewer of meat with nothing on it , that's if they get to you without complaining to the manager.\nIf you are a party of 6 and more yes service is the best but less than 4 it's waste of money\nSorry but , not one not twice not 3 times it happened over and over and over"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWGNGWXRabXRyYVZKSGJVNUxSakpOTVdwaWNXYxAB",
            "text": "Service here is great! You really can’t beat the prices. I’ve been ordering from here for years. The mess on a roll is my favorite!! The French onion soup is great as well. The menu is huge and many options to choose from."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSWFGUlpaVkEwVjB4SllrTnhVVWxZUWtwUGNIYxAB",
            "text": "I love the towninis ordered for our son's birthday. The idea of having choices makes them more appealing. They were served hot with sides. I would order this again even if I don't have a big event."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1T2EwbEhlVWt5ZDJoZk9HTnNPV1JDVkhCWFduYxAB",
            "text": "Dont order from here unless you want to wait 3 hours for your food to get delivered"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwOHBMal9BRRAB",
            "text": "Good place to hire for your catering needs. Sandwiches are excellent and I'm a big fan of the rice balls and potato croquettes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOSHNwWnFFbmZMb2dRRRAB",
            "text": "Great all around the waiter was very nice and it’s in a good area. Pizza was great highly recommend it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKelEyWVB6dk9EQ1pnEAE",
            "text": "Food is fantastic. They should have a better trained person to handle catering orders. Placing 1000 dollars order and being placed on hold 4 times and eventually, getting hanged up on . Absolutely ridiculous"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdTQzUGZacWVlY2FREAE",
            "text": "The best pizza nyc has to offer! I’ve tried so many different pizza places but hands down this is the most delicious. Made to perfection. I’m from Brooklyn and when I’m in Staten Island I have dot come here. The slices are huge! The owner is is one of a kind, original nyer!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQN2l4Tl90NGFYVlJnEAE",
            "text": "Best deli in Staten Island PERIOD!!!… I have been using them for many years now for all my catering events."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcXdncS1aMDZya29RRRAB",
            "text": "Food is out of this world, Mike provided me with the legendary customer service, i felt like in a 5 star restaurant"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvak1icnB3RRAB",
            "text": "Delicious food and great dine in experience. 10/10 would recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNHYtaGNBEAE",
            "text": "Very large menu. Lots of choices . Food is good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3Zzh5ajVBRRAB",
            "text": "Long time fan - but today Victor went above and beyond to help me send a gift to a grieving friend. Couldn’t have been nicer!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxeUlPUnh3RRAB",
            "text": "One of our favorite places whether to dine in, take out, or order catering for a party."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaXMzWmZREAE",
            "text": "First visit! Menu is gigantic, service and food outstanding. What a really nice, clean bright place.. recently updated. I highly recommend a visit. Victor and Rosey are just too nice!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBamJuQWlRRRAB",
            "text": "What started as a random walk-in when we first moved to Tottenville to chat about our cars with the owners and chatting for an hour without even knowing each other turned into a neighborhood staple for us. An amazing family owned restaurant with the kindest owners and the best food!! My family and I always order from them, our favorite local spot and we are so thankful for their kindness that they not only show to us but for the kindness that Victor shows to my two pups who mean the world to me. Our pups will occasionally walk us to Towne Deli, knowing that Victor will come outside and greet them with a smile on his face and cheese in his hand, the warmth and kindness is unmatched and does not go unnoticed. We are so happy to support a family owned small business as everyone should and will continue to do so! Thank you to Victor and his family for your dedication to bringing great food & connection to our community :)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcFlTS2pnRRAB",
            "text": "Cozy place.  Food is great.  Even when your budget is tight.   We frequently order pizza for an entire Cub Scout Pack and buffet style dinner for annual events.  They really help us out when our needs require flexibility."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfLTV1RlpBEAE",
            "text": "We had a party at Kids N Shape, and had food catered from here. The portions were huge and all of our guests talked about how good the food was. I would highly recommend catering the chicken cutlet hero & Chicken Francese"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdk1MNUVBEAE",
            "text": "Mike is the best! The food and service are great!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbThEWE13EAE",
            "text": "Food is always excellent when we order for a party.  Top notch service all around.  Happy New Year to all staff and family!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2ODlmZkZBEAE",
            "text": "Amazing place to check out! The spicy vodka rigatoni was one of the best pasta dishes I’ve ever had. Awesome place to check out!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OWU3Z2pnRRAB",
            "text": "We placed a catering order for my brother's birthday. Part of our order was a half tray of Super Towne Seafood Platter, which cost over $100. The tray was ridiculous. Half of it was chopped celery and pitted olives. The seafood was cut so small that it was hardly visible among the celery. For that price, we received a very expensive celery salad. I called to speak to the manager; they took my name and number but never called back. Had they called me back, I would not have written this review. However, since they do not seem to care about the overpriced representation of their food or their customers, I felt it deserved a review. I will never order from them again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQX2VucHh3RRAB",
            "text": "Ordered a large catering order via online , over $1000 of food. Every single dish was made fresh and absolutely delicious! My team at work enjoyed the food so much! Thank you and can't wait to order my Christmas Eve spread ! Happy Thanksgiving! (Sorry didn't get any pics !)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeHBxUVJBEAE",
            "text": "me and my mom visit from new jersey occasionally. food is always fresh and delicious and the buffalo wings are amazing!! Mike s. is an amazing server. he's very kind and outgoing!! 10/10"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMWZXbUl3EAE",
            "text": "Everyone was really nice and the Paninis were EVERYTHING lol I had the Aunt Cathy's number 14 I believe and the other 3 had number 17 forgot the name. But yes very yummy and wonderful staff! It was also for my son's 20th birthday and they brought out cake and offered candles to go with so it was a nice thought! Haven't been there in years but it's still a good place to go to!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzc2ZqbGZnEAE",
            "text": "The food is good, but the staff cannot get orders correct and then they become rude when you point out their mistakes"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdDdXUmF3EAE",
            "text": "Garlic knot Chicken sandwich legit"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaGJ1ZHpBRRAB",
            "text": "Completely disrespectful, over heard the \"white males\" say racial slurs against other race colors\nVictor gave other customers and workers very bad and upsetting attitude with faces the environment is toxic, the dishes aren't cleaned properly , i found hair in my food , i also threw up pretty disgusting and \"Good\" reviews only show from people they know over all it's completely horrible and unprofessional and disgusting Needs new management older person with experience not racist disrespectful unprofessional work ethic from victor to the rest of the crew , If no one says nothing then nothing will progress"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdnF5cU5BEAE",
            "text": "This is the best restaurant on the island in my opinion, the food is incredible, the staff is friendly and the music is great 50's retro. I never leave disappointed."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVLTVxdzNBRRAB",
            "text": "Great variety of food. And service is excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaU9ubVRREAE",
            "text": "This restaurant is a pasta, pizza, and panini paradise! The food is absolutely delicious and cooked to perfection. Highly recommend the chicken cutlet (or sub fried eggplant) panini with vodka sauce. The sauce is incredible! It's rich,…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNlpmY3pBRRAB",
            "text": "Staple in staten island, always fresh always hot always on point. Just a good solid pizzeria. Best part the bang for the buck. Panini and wraps are bigger then your arm. They do half sizes. The pizza man has been slinging pies for over 30 years. And you can taste it. Highly recommend"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZOE9QVVFnEAE",
            "text": "I love the food, despite the bad reviews, you always find something great and delicious and just wait the right time to enjoy your favorite meal, remember a great dinner always takes time, don't expect that  it'll be ready in 5 minutes is not a fast food chain\n\nHi everyone I'm updating my review because I saw some bad comments on Facebook about some plate, so let me tell you that is a great dish, exquisite taste and is called open-faced chicken cordon blue and I really recommend it"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLaDU2MVZ3EAE",
            "text": "Margarita pie and pork osso buco were absolutely delicious. Probably the best margarita pie I've had in a while. The pork was huge and very tender. Order came with homemade potato chips which was a nice touch. Our waitress was also very experienced and easy to talk to"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNmR5YWdBRRAB",
            "text": "The food was good. The service was great. I will come back again & bring some friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcUstQXlRRRAB",
            "text": "Great Sunday night out! I usually cook at home however, definitely was worth it. The service was great, the food was delicious. The proportions were extremely generous. The prices were great!\nThe ambiance felt so homely.\nI can't wait to go back again!\nI recommend the Chicken Cutlet with Linguine and Stuffed Shells."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNId0xINDZ3RRAB",
            "text": "I moved back to SI and was excited to go here, but was disappointed greatly.  What happened to the amazing food you used to have???  I spent $30 on something I ended up throwing in the garbage because it was horrible.   Such a shame.  This used to be a great place.  You need to go back to your old ways.  The food was much better back then.  And when I went they had no working bathroom which I am pretty sure is a violation and they should have closed while they had that fixed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREN2RqUGR3EAE",
            "text": "Food is great when you eat there but lately everything delivered is literally burnt. This is a picture of a burnt calzone."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aF9maU1nEAE",
            "text": "We catered food for our Daughter's 1st birthday three years ago. It was excellent. We ordered from there again for another family event recently and I am happy to report the food was still amazing. You have to appreciate a business that…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodTl5Vm9RRRAB",
            "text": "I always use them to cater my parties and have never been disappointed. I usually get the 6 foot Italian hero. The trays of chicken fingers and fries are excellent. We tried the corn beef 3ft hero for St Patrick’s day and the whole thing was devoured. The food is always very good and they deliver."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdTZmLXBnRRAB",
            "text": "When I was a kid, I always wondered where the pizza the schools served in pizza parties came from since it was the best thing I ever tasted. For many years until I went to college, I would search for this pizza with my late father by going to every pizzeria that I knew about but to no avail, I never found it. By the time I went to college, I forgot about this dream and simply gave up, little did I know what the future had in store for me.\n\nI first found out about Towne Deli when my Uncle suggested I order heroes from there. Whether it be the Italian or the American heroes they were both sublime but my Uncle further suggested I try the pizza there. At a later point I did and found the plain pizza was delicious. It had that same sweet and savory taste I remembered from when I was in PS3 Elementary School. The possibility was in my mind now: That this was the pizza I was looking for all along back then. Eventually my suspicions were confirmed one day when I was at my job at Snug Harbor. There was an elementary school field trip taking place there and a lot of pizza was ordered. To my surprise, it was from Towne Deli which is on the opposite side of the island. Later on, when everyone was done with the pizza, I was offered some of the myriad of leftovers that remained. Once I had a few slices, I was taken back to the days my elementary school had those pizza parties. I knew at that point that Towne Deli was the pizzeria I was looking for all of those years ago.\n\nIronically, when I order from there nowadays, I order an Italian hero with bacon and pepperoni added on it. Ultimately, I would say the place's strengths are heroes and plain pizza."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxaVpLWlNREAE",
            "text": "Listen, idk if it’s because I’ve been living in a different state for a few years now, or if it was the food…. But I had their penne vodka today and their regular slice… 10/10!!!!!!!!! That was SO delicious. Man, jersey does NOT compare. Mm. That really hit the spot. I’ve been eating GROSS or SUBPAR Italian food in jersey for all this time… but eating this food made me actually miss stinky staten for a few minutes there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMDhDSGxnRRAB",
            "text": "Glorified Deli.  Ordered the turkey special that came with mash sweet potato.  It was inedible. The turkey was cheap thickly sliced deli meat gelatinous goop. The sweet potato mash was watery, inauthentic, and aerated. They did not even provide dinner rolls or utensils.  We will not be ordering from them anymore. The delivery also took over an hour and is roughly 10 minutes from my house.  Towne deli used to be good but it's not anymore."
        }
    ],
    "reviews_count": 50
}