{
    "name": "Zio Toto Restaurant and Bar",
    "place_id": "ChIJF_O7X1u1w4kRseVXFKDiyMM",
    "grid": "SI3",
    "address": "86 Page Ave, Staten Island, NY 10309, USA",
    "rating": 4.3,
    "user_ratings_total": 279,
    "phone_number": "(718) 317-0373",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUFpVWkliRmhmVGxkUlRYUjNaMHBpUm1NNVdWRRAB",
            "text": "A friend recommended this place, but unfortunately it is permanently closed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQRC1zTTJOLWVDUW9nRRAB",
            "text": "Great service and food all the time! Love coming here and always a fun time. I would definitely recommend this place it'll become your new favorite!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRc183MXlBRRAB",
            "text": "It was ok..nothing special"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndnBuOVJREAE",
            "text": "Delicious!!!!  Everything from appetizers to dessert."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNWViS1R3EAE",
            "text": "Good food and great place to have memorable dates. Just be careful if you bring a Latina, IYKYK."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOHVlX2R3EAE",
            "text": "Love the ambiance and food. Thank you for serving us good times and great food!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNE5TV0VnEAE",
            "text": "Great food and service with a beautiful atmosphere. Louie doubled as bartender & server which was awesome. The restaurant was very quiet on a Sunday, could be because it was right after the holidays but it should have been Packed regardless. We will definitely be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMzRUWGNBEAE",
            "text": "Very nice place to eat, not enough workers. By the time dinner came out, food was cold because the waiter was also attending the bar. But I'm sure the food tasted delicious if it was hot."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMGZXd0NnEAE",
            "text": "Good food, nice friendly service, easy parking"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2d2JiZnhnRRAB",
            "text": "Had company dinner there. 1st time here. Atmosphere nice, food not so much.  Apparently changed chefs.  Had veal w prosciutto & mozzarella. VERY VERY DRY!  Sweet & sour calamari was just ok.  Definitely not impressed... probably won't go back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cl9HMGNnEAE",
            "text": "Excellent food and service parking a tough"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cGFIU0xREAE",
            "text": "Lunch with friends and so disappointed in food & service. Waiter was impatient, inattentive and unkind. Pasta was not cooked, entrees were cold, and salmon was overcooked. We are easy going, and we had a nice time despite the poor service and inedible food. Ambiance is quite elegant, and we really thought it was going to be a great lunch. A huge let down. Sadly, we do not plan to come back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMGZQaTV3RRAB",
            "text": "Great place to eat very satisfied"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMXVmam1nRRAB",
            "text": "I went tonight with my family of five for the first time and we could not believe why we didn't come here before! We ordered four different appetizers and each plate was not only beautiful but sooo delicious! My bronzino was very juicy and it was a great portion. Many other restaurants have smaller portions than this. The waiters were very nice and repeatedly check on us to see if we needed anything. I will definitely be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dEpLS05REAE",
            "text": "I really don't like leaving bad reviews but I was disappointed at my experience at this restaurant today.\nI took my son for his bday dinner here since our first choice was closed.  He was disappointed in the appetizer he chose.  His filet mignon was a little on the reddish side and he was having a hard time cutting through it.  He didn't return it because he didn't want to bother.  I  had their home made gnocchi , although tasty there was more pesto sauce and not enough pasta.  Throughout the hour we were there the waitress never asked us if we wanted a second drink, she asked me when we were seated if I wanted still water or sparkling, I said still.  I paid no mind to the bottle of water we had on the table until I saw that I was charged $9.00 for the bottle of water.  I was so disappointed with my son's disappointment that I just wanted to leave and not bring it up to her.  I will definitely not be dining at this restaurant again, not worth the money.  BTW, the restaurant was empty, we were the only to ppl there."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNaVpEdVFBEAE",
            "text": "Great food great service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUazVtM2lRRRAB",
            "text": "We went for a family event. The staff was extremly friendly, they took care of every detail making sure the food AMD drink were up to everyone preferentes.\nThe antipasto, The steak The pasta and the desserts!! Full portions without compromising flavor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNnVPVXZBRRAB",
            "text": "Calamari was delicious. Services was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqME1YYjRnRRAB",
            "text": "My husband and I just hosted our wedding here and we would highly recommend Zio Toto’s to everyone. Anna was extremely helpful and always on call whenever it came to planing and all of the workers were super attentive to any of our needs as well. The food was phenomenal and our guests continually bring up how much they loved the food whenever our wedding gets brought up in conversation. You will not be disappointed in the food or the service when it comes to Zio’s, they take so much pride in their work."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREM3RMNXBnRRAB",
            "text": "Phenomenal experience! Great food and service! Super staff and extremely talented and professional manager named Louie who made sure that everything was spot on!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREOHJPdkJnEAE",
            "text": "The food was good service could have been better. The waiters could have been more personable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbjRybDh3RRAB",
            "text": "exceptional restaurant, high quality food, impeccable service, real Italian food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0a09udXBBRRAB",
            "text": "Excellent service, great cuisine, highly recommend !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxZ0o2Y2VnEAE",
            "text": "Lovely dinner! Food was outstanding!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNjRUeFFREAE",
            "text": "Too Noisy and loud, waiters rushing around busy with parties. 1 person at table got wrong entree and had to wait for it to be cooked, we had to start without him or eat cold food. They really didn't care. Very disappointed. It was my grandsons 16th birthday"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwanUzVTRBRRAB",
            "text": "Nice atmosphere to have large respectable parties. Food was pretty good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcTdHY0VBEAE",
            "text": "The owner Filippo is awesome! He makes you feel like you're part of his family! And the food! The authentic Sicilian dishes he makes, amazing! Reminds me when I was in Palermo, Sicily!\nStaff is super attentive! When my glass was low, someone was there to make sure I wouldn't get thirsty!\nAnd the place is just gorgeous!\nNot my first time there, and definitely not my last!\nIf you want great authentic Italian cuisine, Zio Toto is the place to go to in NY! Take it from me, I lived in Italy for 3 years!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLTRmVHhBRRAB",
            "text": "Yummy"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKM01mU19BRRAB",
            "text": "My wife and I like Italian food. But not the one they served."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKa05hSENBEAE",
            "text": "I have never left a bad review for a restaurant in my life, but I cannot stop thinking about my experience here. My date and I both have worked in the restaurant industry for 10+ years and are still processing how rude our waiter was. We've come here several times and always enjoyed the food and service. However last night was unreal. I immediately caught the energy that the waiter took one look at our table and was annoyed we got sat in his section. We look a little young, but are 26 and 30. Also we were dressed appropriately for the evening.\nHe ignored us several times, and seemed genuinely bothered - like having a table of two young(er) people in his section was a waste of his time. We ordered several appetizers, drinks, and both got pricey entrees and dessert and the entire night I felt like this man thought we weren't good enough to be eating in his section. I understand everyone has bad nights but I watched this man give excellent service to all his other tables. The whole thing was very strange, this man treated us like a nuisance the entire night.\nAll of our food and drinks were delicious with the expectation of my date's entree. He ordered a strip steak, and the cut of meat that was served to him was not a strip steak. It was extremely tough. We are not the type to complain or send back food or make a fuss, so he ate the sides and left the steak pretty much uneaten. The waiter didn't check on us at all until we were done eating, didn't care that my date was completely disappointed, didn't offer to put in another entree (which we would have happily paid for). My date very politely expressed he wasn't happy with the cut of meat when the waiter cleared our plates and this man scoffed at us like we were idiots. Again we've both had experience in managing restaurants and working in kitchens, so to be scoffed at was so off-putting. It was so condescending and strange. I've never had an experience like this at a restaurant, I do not know what we did wrong to upset this man. We've had other waiters here that were so sweet and friendly and personable so it's truly a shame this man was so rude, we probably will not be going back, considering how embarrassing it was to feel like the waiter felt like we didn't belong there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4czlYNU1REAE",
            "text": "😍Omg food was so good i bought my kids penne pasta they Drooled they adored it! 😌"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bFpxZzB3RRAB",
            "text": "We went there on Mother's Day. Considering we had a great table in the corner with a couch seating which was great for the kids to sit. Unfortunately I can't remember our server's name but he was very accommodating."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMG9LckJnEAE",
            "text": "A bit loud however that's the only negative. Food was delicious and company too. Each dish was unique and full of flavor."
        },
        {
            "date": "7년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNFlqSzR3RRAB",
            "text": "Fantastico ristorante. Cibo eccellente atmosfera romantica,incredibile ."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBZ3F6YkRBEAE",
            "text": "Lovely!, 3 stars for being a delicious restaurant, but having the world's most disgusting tea"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcjhDZFJBEAE",
            "text": "I had a great experience all around.\nThe atmosphere was fun. Very Staten Island :)\n\nThe food and service phenomenal.\n\nI ordered the chicken parmigiana. The sauce was flavorful, the chicken cooked and cut perfectly. I looked down and it was already gone, I ate so quickly.\n\nThe bread was good. Not bad. I've had better. Overall wonderful and I'd definitely go back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwcU1qU1VnEAE",
            "text": "My boyfriend and I randomly ended up here last night and we were very pleasantly surprised. The food was fresh, authentic, flavorful and delicious. The staff was genuinely attentive and kind. We had a great time. This will definitely be one of our go to spots."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZOXBuYkF3EAE",
            "text": "We had a 7PM reservation and were seated at 7:45. This should never happen. The food was just okay, nothing special. Luckily,  we had a great waiter who gave us excellent service. The noise level was deafening and gave us bith huge headaches."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZazR1LUNnEAE",
            "text": "The service was excellent. We enjoyed the fried calamari always made to precision The shrimp with arugula was delicious and of course you cannot go home unless you sample the Tiamisu. It's always great to see the maitre d Izzy who lights up…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzOFlDb2RnEAE",
            "text": "Food is amazing. I tried a variety of dishes and they were all cooked to perfection. The presentation was unique and sophisticated. The atmosphere was very nice and staff were very personable . I highly recommend this place for good Italian food. Doesn’t get better than this."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcHBES1dnEAE",
            "text": "Absolutely horrible. Actually the food ( well most of it) was nearly ineadable! We went and paid  $75 per person not including tax and tip and received the smallest portions. There's so much to say but I ordered rigatoni and can tell you if…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJemUyS1JnEAE",
            "text": "I went here for a Sunday family dinner , I was very impressed with the great food and attentive service. Caeser was our waiter and he went above and beyond to make our dinner special. All the food was great , tasty and well prepared and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNnFPRkZnEAE",
            "text": "Had the absolute WORST service experience with Zio Toto Staten Island! I have dined there before, and highly recommended them to friends many times, but after this- I WILL NEVER GO BACK AND I WILL MAKE SURE EVERYONE KNOWS WHAT TYPE OF SERVICE THEY PROVIDE!!!\nI used their website to order a giftcard online on Dec 11. When I did not receive it via email, I contacted the restaurant to let them know. They referred me to the manager, Anna. I spoke with her briefly, explained what had happened and that it is a Christmas gift, and that I hope to get it resolved quickly and would provide any info she needed. She rudely yelled at me that ‘now she will have to go back to all her PayPal transactions to see if she can find payment before she could send me anything.’ I offered the transaction number, and even emailed my PayPal receipt with a copy of all the info. She told me she didn’t want it. It was sent anyway. She took my name and number, and that was the last time we ever spoke (Dec 14). I sent several emails, even through PayPal, I left multiple phone messages, and even called the Brooklyn location looking for help, which I was told they could not provide. My card was charged immediately for the purchase. Yet here I am Dec 22, without a return phone call, email or giftcard, and out $100. It is the poorest customer service I have ever received, and I am so disappointed. Terrible that a place that could be one of the best in Staten Island doesn’t have a care for their loyal customers. I don’t care if you tried to feed it to me on a golden platter, I will never eat there or recommend it again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbHFPMlBnEAE",
            "text": "Food and Decor very good.  Bartender makes good martini albeit pricey (I feel $12 is the right price... $16 is nervy).  Portions were good, seafood tasted fresh. Pasta cooked right.  Lobster ravioli was very tasty.  The evening we went was not busy. Had ordered appetizer of fried shrimp/zucchini/calamari (frito misto), requested to take home most of the calamari. Expected them to include a small cup of fresh marinara sauce in take out box and even more disappointed that they did not include even our own leftover portion.  Some tables have poor lighting but otherwise cozy atmosphere. Parking anywhere on Page is a real joke."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNza04zVndnRRAB",
            "text": "Omg the food is Scrumptious. Staff is very attentive. Atmosphere is wonderful.  Prices are right for the caliber of food. Pork chops ARE AMAZING. Totally recommend for an awesome night out..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNzlQUmZ3EAE",
            "text": "Decided to try this place and took my family, a party of 7. The experience was not as expected. The staff was not very attentive and for a $500 bill I would think the host or manager would have came to our table at least once. My table did not get offered and daily specials as I observed other tables did. I observed the head waiter in black and manager  go up to multiple tables and make small talk as we did not get a single “how’s your meal”. The food presentation for a $55 steak and an $18 dessert was mediocre with minimal detail. We also had alcoholic beverages and we were not asked for a single refill. Me and my family go out quite frequently and this place was nothing to rave about. We don’t only go out for the food but for the atmosphere and experience this place lacked 2 out of 3."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocWJ6emtBRRAB",
            "text": "We went at 8 on a Saturday night and it was so strange that there was almost no one in there. If I hadn’t been there before I might have left. The food wasn’t bad and overall it was a decent experience but there has to be a reason why it’s empty on a sat night."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcU5fNzJBRRAB",
            "text": "I have had worst,  decor was very nice, menu was limited, service was lacking. Food not worth a second trip. Parking horrible, the place was empty but it's area of the lot was full, I had to park on the main street."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdWFfYzVnRRAB",
            "text": "Love it.  The absolute best. You can't go wrong. Meals always prepared fresh. Service is amazing. I introduced friends to the restaurant tonight and they can't wait to go back"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3bkxQT1R3EAE",
            "text": "Sat 4-24-15 Food and Server (Mike) EXCELLENT! 3 couples......shared all appetizers, Calamari, Portobello Mushroom,etc  all wonderful.\n\nSeafood pasta special with shrimp, fish was excellent. Nice selection of specials in addition to menu.. Wife had Salmon - best she ever. Chicken Parm also great.\n\nAll priced and portioned well.   Nice atmosphere and decor...Place got crowded- I suggest making a reservation"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLXJIQUxBEAE",
            "text": "Thank you! Zio toto did an amazing job for my husband’s 40th birthday.  Everyone loved the food and the service was excellent. Anna and staff made planning easy and they delivered a beautiful party. If you are ever looking for a place to host a party, choose zio toto."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4a19YTHB3RRAB",
            "text": "Ordered the linguine pescatore for curbside pickup and it was amazing!!! It exceeded my expectations! The seafood tasted so fresh and yummy. This was my first time and I’ll definitely be back!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNclp5N193RRAB",
            "text": "My favorite restaurant near my home.. service is always outstanding and the food is always good. A bit on the pricier side but well worth it."
        }
    ],
    "reviews_count": 53
}