{
    "name": "Filoncino Cafe - Tottenville",
    "place_id": "ChIJG-kPTgC1w4kRPkvtYop36II",
    "grid": "SI3",
    "address": "2935 Veterans Rd W, Staten Island, NY 10309, USA",
    "rating": 4.6,
    "user_ratings_total": 90,
    "phone_number": "(718) 395-1533",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RVowZERRV2g1UjJ0aE9XWTJkbEJuV2pKb0xVRRAB",
            "text": "Great all around place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KV1MyeHBZelZSWW1ORGRrdE1iV3RzUTI1elowRRAB",
            "text": "The food was excellent. Everything about it. And service was great. Ive had the philly cheesteak and today had the cheeseburger with fries. And the bread was amazing.  One of thebbest burgers I've had.  And not over salty.  Fries are great too.  I will definitely be coming back here.  And I highly recommend this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSGNISTRUazFqVVdwR2EyWmhiRUZzYmtzM1dsRRAB",
            "text": "Great fresh sandwiches,  bakery items and bread\nNever disappoints."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcWQwcGpNM2RmVjI1clowMTRkRzF5ZDI5SE5rRRAB",
            "text": "Sandwich selection is amazing work so many choices.  They have a few locations. Great place to enjoy a fresh sandwich and have dessert afterwards.  Service was quick."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeGFHRlpaR0ZVUWtGbmFUaGZTbWRPYlhack5uYxAB",
            "text": "Boses are really on top of it here.\nService, food is great. Parking is great and atmosphere is like being home with family"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjemRsWkxTVlUxUjB0TVJFdGZkR0V4V1RoUFdVRRAB",
            "text": "Been going to royal crown for years.\nThere sister restaurant Filoncino Cafe\nIs always good, place is always packed at lunch time.\nBUT this night,\nWrong appetizer. Bread for sandwich to well done. Cold cuts fantastic.\nSalad was good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUlpubENXVzlqTTAwd05tbFFRbWxoZWpWQlQxRRAB",
            "text": "Went during lunch time, although crowded the food and service were outstanding. They carry Saratoga Springs sparkling water makes me Very happy, I ordered the Cheese Steak delicious. Fries sold separate I had no room. Portions are terrific. New fav spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NVRURjBPVmxZVG5VMVZYZHlkRFo0VEVGWVpWRRAB",
            "text": "Staten Island puts an authentic Italian bakery in a strip mall across from BJ's... it is outstanding."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VORDI2cUx1ODc2UVZnEAE",
            "text": "I drove two hours to steam island to see flatliner at mother pugs. Even if I hadn’t drive. Two hours. Steam island I would still enjoy the sandwiches that I ate. The sandwiches were made out of bread. Cheese, and meat. The meat was different depending on the sandwich you ordered. I think my favorite part of the meal was the eating sandwich. There were lots of people enjoying sandwiches and they seemed happy. I would eat here again if I was hungry."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbGRtbmZ3EAE",
            "text": "My favorite place for sandwiches on the island - there may not be a better place in all of NYC.\n\nThe menu is massive and all of the ingredients are fresh. Every sandwich is customizable as well, so as a picky eater this is a great spot.\n\nI have been here well over 15 times, and have never had a bad experience. If you haven't been, definitely give it a try."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvenR6MVhREAE",
            "text": "An absolute gem in Tottenville! The Philly cheesesteak is perfection – tender steak, melty cheese, and served on their incredible brick-oven bread that’s crispy yet pillowy. The chicken cutlet vodka parm blew me away with its crispy texture and rich, creamy sauce. Portions are huge (great value!), and the staff made me feel like family. Don’t miss the fresh mozzarella – you can taste the quality. My new go-to spot for Italian comfort food!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbXRmZDVBRRAB",
            "text": "It's just doesn't get better than this. You can't find a better sandwich"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveTZud0ZBEAE",
            "text": "Amazing service and super kind staff! I ordered a sandwich (which was delicious), and they surprised me with free bagels ..such a sweet gesture. The place looks great, and everyone was so friendly, greeting me when I walked in and saying goodbye as I left. Great vibes all around. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNDlfSml3RRAB",
            "text": "Best place to eat and have a good time in Staten Island"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLTkzWEJ3EAE",
            "text": "Food is consistently great. Definitely recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRektUWGNBEAE",
            "text": "10/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNy11T0VBEAE",
            "text": "Excellent food is top notch needs improvement on service and the atmosphere is great lots of social activity."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBa192UWpRRRAB",
            "text": "Being open on Sundays has been super convenient! Food is always great!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOWJMVExnEAE",
            "text": "I loveeeeee this place!\nI would eat here every single day if I could!\nFiloncino salad is by far the best salad I’ve ever had\nStaff is super friendly and service is great\nI love coming on Sundays when I don’t feel like cooking\n10/10 recommend"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNWNfV1JnEAE",
            "text": "I used to go to 8-balls for Sunday dinner, but now that filoncino is open on Sundays it’s rocked the very foundation on which I base dinner on."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNWNxX013EAE",
            "text": "Such a relief them being open on Sunday nice to be able to stop in for a coffee and breakfast and pick up pastries for Sunday Dinner. Salute!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNWJTZEh3EAE",
            "text": "So glad when I discovered they were open on Sundays , unlike the original location. Made my weekends so much brighter , best coffee on the south shore"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNWZpUG93RRAB",
            "text": "Nothing better than the East New York with the best balsamic glaze. Happy to hear they are opening on Sundays now!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNVlEYThBRRAB",
            "text": "This place being open on Sundays has single handedly saved my marriage. We go there on Sundays to unwind and enjoy some of the best food in Tottenville. Couldn’t recommend more if I tried"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcGV2ajl3RRAB",
            "text": "My favorite place to get a sandwich on Sundays! I would recommend the cannolis!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcFpQZmR3EAE",
            "text": "Filoncino has the besttttt sandwiches! Definitely recommend the chicken with sweet vinegar peppers 😍\n\nAdded bonus that I’m now able to grab a coffee on sunday mornings! Neighborhood staple."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcGQyY3d3RRAB",
            "text": "Opening on Sunday has been a huge convenience, one of my only two days off I’m now able to enjoy. Thanks!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcGVIbGFBEAE",
            "text": "My family and I love it here!!! The food is so fresh and delicious every time. So happy they’re open on Sundays now for breakfast and brunch!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBenNPckhnEAE",
            "text": "The one on amboy is far more superior then this one. Our wrap was cold and tasted a bit off. Service was ok, the servers were nice enough. Definitely will stick to the one on amboy."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NU1UNTVnRRAB",
            "text": "Love the food, service, and people here!! Best place to get food absolutely delicious, best quality and super fresh. Truly nothing like it!!!! :)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NUlqNnV3RRAB",
            "text": "I look forward to my mornings just so I can get a sugared crossiant! Absolutely love the food here. Love that they open early!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cE92aWF3EAE",
            "text": "Outstanding! Catering was fantastic, second to none. So good I stopped in for lunch today and the food was so good. Great service, fresh delicious food in a friendly atmosphere."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cEl1bVh3EAE",
            "text": "We had breakfast catered from Filoncino’s, and it was absolutely amazing! The food was delicious, delivered right on time, and the presentation was beautiful. The entire office loved it! Highly recommend them for any catering needs – you won’t be disappointed.\n\nUpdate: Food was so good, we stopped in for lunch!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NjVXQjlnRRAB",
            "text": "The waiters so annoying. Within 10 minutes I was there is must have had all the waiters in the place coming and asking every 5 seconds how everything was? They could actually see each other leaving my table, and they would still come and ask the same question.  I wish I could have sad everything was terrible, just to see what they could do about it? I mean the food was good, the place was clean, and not very busy just right, but the waiters really upset me. Very annoying, typical gen Z."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeUt6YW5BRRAB",
            "text": "Edit: Thank you for responding to my review. I wish I was told that a vegan choice could be made by altering items off of the regular menu. Instead, I was offered the bill for our coffees.\n\nOriginal Review: This location is beautiful, with a gorgeous pastry/cookie case when you first walk in. Wait staff is very attentive and kind. I did, however, have an issue once it was time to order. I requested their vegan menu AND placed my order, only for her to come back and apologize because they no longer serve items off of their vegan menu. I’m highly disappointed because there are so few places on Staten Island where I can have a guaranteed “safe” meal. It’s a shame that they no longer accommodate the vegan diet. Hopefully the Amboy location keeps it."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dEwzM3h3RRAB",
            "text": "Updating my review to include photos of the breakfast menu.\n\nWelcome to the neighborhood! We grabbed lunch here and it was delicious. The seats are pretty close together but we got lucky and got a table in the corner so it wasn’t too uncomfortable. I personally don’t like to sit too close to others when I go out to eat. Everything was great, service, drinks and food. Glad they opened closer to home, this will become a go to place for us."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMzRhc1lREAE",
            "text": "Absolutely delicious bread!!  So clean!!!  And the pastries, cakes and goodies look great at the counter.  We had an outstanding breakfast after a nice walk.  Can’t wait to go back.  Today it was caponata frittata with amazing cappuccino.  Yummy"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNTRYb3Z3RRAB",
            "text": "Best food around… hands down. We eat there every day"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYejhtckJ3EAE",
            "text": "First time here - great food- great service .. great owners  .. heart of staten Island . Will be here again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMS1lbjB3RRAB",
            "text": "Filoncino has figured out how to elevate basic dishes into something special. Took my wife out for a late breakfast during the week. The breakfast sandwiches were exceptional. The coffee selection was also quite nice. My wife had an iced coffee and I went for Jamaican Blue Mountain, both were excellent. The bakery however is out of control. We split two donuts, one jelly one Bavarian cream. THESE WERE THE BEST DONUTS I HAVE EVER HAD. They were $4 each and totally worth it\n\nThe service was very nice. The wait staff were very friendly and attentive. It is on the pricey side, but you need to pay for quality. I highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOXZYd2hBRRAB",
            "text": "Great addition to the neighborhood! The differnt fresh baked breads are amazing! I enjoy the Broccolirabe Fritata with sliced avocado. The coffee is delicious to. The kids loved the desserts. Also the fresh ricotta tasting plate with fig jam dip and toast was a hit. The lunch and dinner menu has so many options I look forward to exploring the menu as I'm sure everything is delicious. Service was great to and plenty of tables. Keep in mind when its busy when you look in front door it's the people waiting for takeout and there is a good chance tables are available."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibi1mbFBBEAE",
            "text": "The food is solid— they clearly know what they’re doing in regard to making simple but tasty meals, with fresh bread and quality ingredients. The coffee was just OK, and, unfortunately, the service was very slow due to being short-staffed for the breakfast rush.\n\nWe returned a couple more times for takeaway and service was definitely quicker. Like the first visit, the food was really nice. Would just add more salt to the chocolate chip cookies to balance out the sweetness."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3enUyOUdBEAE",
            "text": "Busy place for dinner. Food is always great in the Royal Crown family. Mini rice balls are huge.\nAll servers were quite busy but a simple request such as water during the meal shouldn’t take 15 minutes. That it seems is the job of the drink runner. Server literally takes order, potentially checks in on you, then drops the check"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyazd6R2ZBEAE",
            "text": "I am delighted to have such a fine cafe as an addition to this shopping Plaza South Shore Commons.\n\nSister Location of Royal Crown Bakery which is a jewel as everyone knows- now close to Tottenville and 15-20 minutes from most anywhere.  Well worth the time to come experience all Filoncino has to offer.\n\nTheir menu is sought after all over Staten Island as much as their fresh baked Italian desserts and coffees.\n\nBurgers, Steaks, Sandwiches, Wraps, Salads- amazing made-to-order hand-crafted plates and platters.\n\nThe portions and  prices are amazing, plenty of seating in a relaxed casual atmosphere, attentive staff and barristas to serve patrons. So fresh it's going to be your Go-to cafe once you visit, again and again!\n\nOrder online in advance if you want your order ready and waiting. Order your birthday cakes for pickup the day before.\n\nYou won't be looking further than Filoncino for the freshest desserts and menu selections for the most perfect cafe experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycjg2WlhnEAE",
            "text": "Love this place! Have been going for years and I am so happy we have one in Tottenville now. We went for breakfast and it was delicious!!! The French Toast was sooooo good!!! The staff was excellent. We will be back often !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOHN5NXl3RRAB",
            "text": "Food is good especially the ham cheese croissant. Omg so good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNWZxUE9REAE",
            "text": "I have visited the Tottenville location  a couple of times now and each time the service and food has been better than the next. Their coffee is always consistent and their food is fantastic. The staff is super friendly and would highly recommend coming here for breakfast, lunch or dinner. (PS the chocolate bread is to die for!! )"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX1l5QWxRRRAB",
            "text": "Beautiful space, food and service! Most recently we ordered heros, Royal Crown Iced Tea and rainbow cookies. Everything was delicious. The iced tea has lemon sorbet in it (amazing) and the rainbow cookies had the most decadent chocolate on top. The staff is so friendly, from the counter staff, baristas to the servers. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNWN6MGxBRRAB",
            "text": "Filoncino in Tottenville has turned into my favorite place to go to on Staten Island. Staff is great, atmosphere is excellent and the food is even better. Must try the Iced honey oat latte! Definitely recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuemZ5Q0pREAE",
            "text": "Filoncino Cafe offers a delightful experience with its cozy atmosphere and friendly service. The coffee is perfectly brewed, and their pastry selection is a treat, especially the fresh croissants. The staff is knowledgeable and eager to…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3b0xIMzBRRRAB",
            "text": "Had a great dinner here with friends. The space was really cute with some fun, original Italian inspired artwork. Staff were very attentive and nice. Lots of delicious options on the menu, will definitely be back to try more!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cU5fM2t3RRAB",
            "text": "Filoncino is the place to go.  The owners are very accommodating, the food is excellent, the wait staff are pleasant and willing to readily assist, plus the place is impeccably clean and offer a variety of breakfast, lunch and dinner choices.   The desserts are scrumptious.\nA shout out to Enzo and his partners for their diligence and allowing their customers to enjoy the pleasant surroundings.\nI highly recommend this new Filoncino setting in Tottenville/Richmond Valley.\nA frequent customer treated like family,\nToni Lucente"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNWNycXR3RRAB",
            "text": "I try something new each time I go to Filoncino and they have not let me down yet. Definitely recommend any of the sandwiches on the menu… Top notch quality and great portion size. Staff is very friendly and the atmosphere is second to none. Don’t forget to ask about their specials!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIa016Z29RRRAB",
            "text": "I wanted to like this place so much but everything we got was subpar for a bakery. croissant- stale, cream puff with chocolate in a cup with mousse- stale and coffee that did not pack a punch or any level of complexity. Also got a shot of espresso which tasted burnt. Maybe they are still working out there process but definitely needs improvement. Everyone was pleasant and attentive which was nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibXRqTjZ3RRAB",
            "text": "I have always been a devoted customer from the bakery, was so excited finally we were going to be able to have it in my area! I passed by at 7.30pm and they were open, I was in a rush so couldn’t stop. At 7.45pm I called to check they have available the cheesecake I like on my way already going there and she says yes, then another person says they are close?! Like what?! I just passed by and you guys were open.\nAnd she just kept saying we are close, listening other people in the background.\nThis is the first time I experience this bad service I guess the new location will not be the same as the other ones."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydmRuOEZ3EAE",
            "text": "Totenville has a Gem. My breakfast was cooked to my liking and the service was excellent. I love the Italian music being played while I was drinking a cappuccino and Eating #8 Prince: Bacon Egg and cheese & Avocado. Going back soon. :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNWZHRjRRRRAB",
            "text": "Our salads and paninis were delicious and fresh.  Coffee and dessert were so yummy! The staff was attentive and friendly, definitely a 5 stars!  We will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuODV6aHdnRRAB",
            "text": "Really disappointed in this place and how they took away the vegan sandwich options and are phasing out the vegan options all together. They didn’t even give it a chance to thrive like that menu thrives at their Eltingville location. This location is subpar at best - the service is slow (both over the phone and in person) and the atmosphere is incredibly loud."
        }
    ],
    "reviews_count": 58
}