{
    "name": "Casa Nino's Pizza Bar",
    "place_id": "ChIJVdA4CF9LwokRoK_hQJyZgvw",
    "grid": "SI3",
    "address": "1281 Arthur Kill Rd, Staten Island, NY 10312, USA",
    "rating": 4.6,
    "user_ratings_total": 246,
    "phone_number": "(718) 948-0440",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONGMzbHJNSEZXTTBGbGRXTlJUazluTFVwMFZGRRAB",
            "text": "Great buffalo chicken pizza and vibes. Would let my child around them."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMFMxbzRWMDEwVlRWdmEweDJXRXN0ZWpKUVpIYxAB",
            "text": "Love Casaninos since 2017 when we moved into the area! Our specialty pizza is a thin crust vodka square with chicken and bacon and extra cheese. Let me tell you, they don’t disappoint! Delicious and hefty! Love all their food and always recommend to family and friends when they’re around."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnb1lLT3ZBRRAB",
            "text": "Never a bad dinner"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUlFVNDBhM0J6VWxoRlRERndabXBwV1RaZlUzYxAB",
            "text": "Used to be so good, lately it’s terrible 😞 dont know what happened. Won’t be coming in anymore."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMFdGaHBOemcwZVdOU2IxaDFOa05WTlZaUlQxRRAB",
            "text": "Delicious yummy food always"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnd2RYYU1nEAE",
            "text": "I’m always happy with Casa Nino’s food and service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNZldyTVR2d2RhQVRnEAE",
            "text": "Placed an order for chicken soup and received Progresso Noodle Soup. never again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdGJHOVF3EAE",
            "text": "The first time I was introduced to Casa Nino’s catering was during a girl’s night in. After falling in love with their chicken penne vodka, I became a regular and since began ordering 1/2 trays for pick up on days I come home late. I also enjoy their dine-in meals as well. Casa Nino’s serves delicious food and always makes you feel like family when you return. Their chicken francese is chef’s kiss, always a crowd pleaser. Hope you enjoy it as much as my family does."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLWFuVDRRRRAB",
            "text": "Who knew the best calzone I ever had would be right down the street from me? Can’t believe I didn’t order it sooner! Will be ordering from Casa Nino’s more often."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvZ1pXVkJBEAE",
            "text": "Delicious food and wonderful family specials. I love the vodka chicken half tray special 😋 It's our new \"go-to\" place. I also appreciate the text specials."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYX2VhQU1nEAE",
            "text": "Ordered the daily special.  A large pie and chicken parm on top of ziti. Everything was delicious. Enough for 6 to 8 people. Will be ordering again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMTluaFp3EAE",
            "text": "Delicious food, prompt and professional delivery"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaWRmZWpnRRAB",
            "text": "Food is always tasty and fresh. Very good value. Friendly staff and quick delivery. Great specials. Whether we dine in or get delivery,  it is always good food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcFpyMG5nRRAB",
            "text": "All of our experiences at Casa Nino’s Pizza Bar are always great,  from Pasta’s, Pizza and Rolls.  Their Chicken Parmigiana and Chicken Marsala Pies are to die for.  Also have used their catering which was excellent.  Sergio and Joe always take very good care of us.  We can  always count on them for good food and service.  A great place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcGFqSklBEAE",
            "text": "Always satisfied. Our go to place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa2ZmNVR3EAE",
            "text": "Everything that I get from pizza to the half trays are de'lish & great prices! 😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa2NxT0l3EAE",
            "text": "Delicious, large portions at affordable prices! Consistently Ordering the half tray specials!\nHighly recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa1ppZUt3EAE",
            "text": "The food is great! Service is great!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJX29TdjV3RRAB",
            "text": "Right DOWN THE BLOCK MIMMOs OPENED UP 7.99 LARGE PIES whole month of april taste way better then thid poace hands down dont know how this place is open its horrible and they rip you off bc they are doing so bad in business"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJelBtaVRnEAE",
            "text": "Got a chicken parm hero with vodka sauce, my favorite hero and one I've gotten here since middle school. Decided today to take a trip on nostalgia and get it today and damn I would NOT recommend it. I'd be an honest advocate back in the day but this go around was nothing short of a dissapointment. The sauce is great but the cutlets definitely are not the freshest to be accurate tastes like a reheated 2 day old refrigerated cutlet and im Italian and prefer my cutlets over all so safe to say thats what it is. Also the cheese was not fully melted maybe im wrong for expecting better on a sunday but for 17$ for one hero think its fair to dissapointed by a place that was a staple hero spot for me on the island.\n\nEnding point don't recommend the heros on sunday haha no hate just a disappointment loyal Italian take."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NHJTNHl3RRAB",
            "text": "I love this restaurant - and I would love to order more frequently through the Slice App, but for some reason the slice app doesn’t allow you to tip the delivery person. Ninos needs to contact Slice App and fix this. It is against my religion to not tip. You can never go wrong with Brooklyn Nets Hero - but swap grilled for chicken cutlet!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aG9ySHR3RRAB",
            "text": "Best pizza in New York. Good people working here too, very nice and easy to talk to"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdUs3cVFREAE",
            "text": "The food is great. It never disappoints. Highly recommend Casa Ninos"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnd01YU0lREAE",
            "text": "The staff is great."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaU8zRG5BRRAB",
            "text": "Food is always hot fresh and delicious!! They even offer you the specials of the day which is great. Whether it’s delivery or dine in you always have a wonderful experience"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINHUyTkVBEAE",
            "text": "Excellent place to bring a family"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbjlxNFB3EAE",
            "text": "Great staff, service and food!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnd2Fyb0xREAE",
            "text": "Good food\nI get sea food mix with white souse, the best."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OS1USWJnEAE",
            "text": "Always delicious and good service"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXBEbzh3RRAB",
            "text": "The bread for the hero sandwich was about 3 days old. What a waste of time and money. Beware of the food. All kids in the frontend. No body cares. It is only a matter of time before they close the store."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneXFibmNBEAE",
            "text": "Excellent service and delicious food."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNG83Mi13RRAB",
            "text": "The penne pasta with chicken is amazing . Every pizza is perfection and the delivery guys are fast"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndElueFZ3EAE",
            "text": "Great Pizza and very good service I’ve been a customer since pizza house was were Top Bagel’s is now long time"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLU5xX0l3EAE",
            "text": "My granddaughter & I had a lunch date.  We thoroughly enjoyed our meal, the service was on point & a very relaxed atmosphere."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbU9IY3ZBRRAB",
            "text": "Casa Nino’s has never let us down, from pies to trays."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBX19iVkl3EAE",
            "text": "I love this food 😋 almost is ordering every day"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dGNUZHFBRRAB",
            "text": "Food is Great"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeS11TUVnEAE",
            "text": "Sergio the owner is great\nFriendly and knows how to run a business. Great experience every time. Food is on point"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeTR1alhnEAE",
            "text": "I have ordered from Casa Nino's many times. The food is delicious, delivery quick and reasonable prices"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBamVhNGxBRRAB",
            "text": "The food is always perfect. Delicious, plentiful and always tastes great. We love the pizza, the pasta and chicken and other catered dishes. Best salads ever! The service from all the guys is always terrific. Sergio, Luca, Jonathan and all the guys do everything they can to make sure we have a consistently good experience. Highly recommend this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0d0tDd1B3EAE",
            "text": "Margarita Pizza was perfection.  Dough tasty and light. Philly  Cheesesteak  roll was the best I’ve ever had.  The house salad and wine added beautifully to this low key meal . First time here but had an idea that I was going to love it, being it’s the same owner as Panini grill. I will definitely be back to try many other dishes. Not to mention our waiter Michael was such a pleasure as well!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MnVQcEZREAE",
            "text": "Was there on May 14th for Mothers Day. We had the feast. Very good food and very good service. Worth going to and they treat you very nice. Great job. Thanku for having us there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMHFiendRRRAB",
            "text": "Pizza is pretty banging on this spot. Just killed a whole pie and chicken roll with my friend no problem. Good corner spot to come and check out whenever u wanna grab a slice or 2."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyaFpHeFl3EAE",
            "text": "Great local pizza. You can never go wrong ordering from them. Everything on the menu is always delicious, arrives quickly and at the right temperature. We have also been to the location a few times and it has been pleasant."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNnRhN2x3RRAB",
            "text": "Great food. Delicious pizza and the hot heros are amazing. Very beautiful place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydG9YajRBRRAB",
            "text": "Went there to get the offer but a slice and the second for free.   Most of the pizza looked as if it were sitting there for hours. I still gave them the benefit of the doubt since I came from the ferry side.   I asked for a pepperoni,  chicken and broccoli,  chicken with vodka and chicken BBQ.  I let them know I was sitting down which also means I'm dining in but I guess they assumed I was ordering out.  As I was waiting,  the young boy tells me my food is ready instead of bringing my pizza, I asked if I can have the pizza on a tray.   They placed them on a pizza tray,  guess things are done differently heading to the south side of the island.  They asked if I was going to have something to drink, I asked for a can of coke, the boy brought me the slices and the soda with no napkins,  straw ( which I asked for) and no utensils for the meat that may fall off the pizza since 2 were very loaded.  Twice I had gotten up from the table and the guy who took most of my order brought me utensils.   The BBQ is a bit saucy, sweet flavor which is the flavor of the sauce.  The chicken with broccoli was good.   The pepperoni I noticed wasn't t the ones with the cups on them as I had hoped for.   Their website and promo looked delicious but after tasting 2 , it wasn't all the hype.  I've asked for a small box to place the rested pizza away to take home.   It's hot I guess it's tough cooking in this heat,  place was clean but the service needs improvement since the young fellow lacked hospitality.  I've had better service and tastier pizza elsewhere.  I'm sure this spot will continue to have customers for other dishes or freshly made pizza.  I myself won't be returning to this establishment."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2c3RpNkdnEAE",
            "text": "Love the grilled chicken there and wraps. Sergio at the counter has been there for years and knows everyone by first name basis. Rest of the staff awesome as well. Food always comes quick and hot for deliveries.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOEtXM3RnRRAB",
            "text": "STAFF IS AMAZING!  I dropped $40 yesterday after having paid for my order.  The young men working behind the counter took the time to check the cameras to see that it was me.  They called my home and left a message to let me know.  I am impressed by their efforts and the time they took to do the right thing by me!\nTHANK YOU!!!  Always delicious food and great specials."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaW9fQTRRRRAB",
            "text": "I came to this place a few times. Never experienced this before. The guy who served us was extremely rude and unprofessional. We ordered potato croquettes with meat, he brought us with spinach and said they didn't have meat. Isn't appropriate to inform the customer in advance before changing their order, plus he messed up my friend's order by bringing her completely something different than what she asked. Just awful."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMGZmRG9RRRAB",
            "text": "Food was delicious! Portions were huge!\nRestaurant and bathrooms clean! Staff was friendly as well!\nWe had 2 white slices,  a Buffalo chicken slice, chicken parm hero, meatball hero & a NY Yankee Hero."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOWJQWllREAE",
            "text": "Sandwiches were amazing!! Service excellent. Pizza did arrive cold, but I knew they busy and it was superbowl Sunday. Overall a great experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyX3NpWDV3RRAB",
            "text": "The young staff members are the absolute sweetest people on Earth, they treat all customers with respect and kindness and make us customers feel at home. The food is always delicious no matter what you get, they never fail to put a smile on my face, keep the tummy full, and make my day. I’ve been a customer for YEARS and do not have a single complaint about the service, food, workers, etc."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudWYtRHJnRRAB",
            "text": "This place was great until they changed locations. Pizza was overcooked (delivery and dine-in). Even was delivered a Sicilian pie that was inedible (the whole pizza was brown and tough).  On another occasion we were delivered a pie that looked like two half pies that had been sitting around for hours, just thrown into a box."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqemV1cDFBRRAB",
            "text": "Casa Nino’s is a staple on the south shore if you haven’t tried it you’re missing out! Everything from the food to the service is top notch. The best penne vodka you will ever have! All of the staff have been there for years, are very friendly/ professional, and go out of their way to accommodate anything you need. 10/10 my favorite spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdlB6bzR3RRAB",
            "text": "Great food. Pleasant staff. Definitely will frequent this restaurant often and take advantage of their take out order service. Keep up the good work. Nice to know we have a clean, pleasant environment to visit and the food is excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREdS1LVGRnEAE",
            "text": "I don’t ever write reviews because I’m not that kind of person however, this place pissed me off well enough to write this.It’s a damn shame! Their pizza is decent (not out of this world), but their customer service is straight trash! I don’t understand why you’d drive customers away? I ordered 2 pies today costing almost $60 and I asked for sauce on the side that I’m sure I paid for. The order was taken at 12:06pm I got my order at 1:40pm. First thing is that it took forever to get it so it was cold, second thing is my sauces were missing. Now I am no “Karen” but you did nothing right. I called them to make things right they were rude and  said it would take an hour so instead they would credit my 2 dollars for sauces. My entire experience sucked you can go ahead and keep the 2 dollars. This is Staten Island there’s nothing more than pizzerias here. You lost me as a customer doubt you care anyways cause if you did you’d know how to talk to people but instead you think you’re better than the people you serve who are keeping you in business. But anyways keep it up and you’ll end up going out of business. I do not recommend this to anyone. Btw I’m not looking for a sympathy response nor will I call anyone to discuss it that’s your job as a business owner. Seems like this business lacks principles."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWb01PRktBEAE",
            "text": "We had a birthday dinner at Casa Ninos Pizza Bar. The food is always absolutely delicious and everyone left full and very happy. Great service and accommodating to our party of 10.\n\nMy family loves the pizza, entrees and heroes. Always great specials we bring home too. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURELU11ZFd3EAE",
            "text": "Food is always of highest quality. Sometimes service could improve a bit— like missing bread and butter for a delivery of dinner. Atmosphere is nice and clean but could be improved to a true restaurant setting. Overall a great Italian restaurant in the neighborhood.!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdWY2anVnRRAB",
            "text": "Casa Ninos Delicious $10 Lunch Special and Excellent Serving By Sergio. Would definitely recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKM0x5b1NnEAE",
            "text": "Casa Nino’s Pizza Bar is undeniably the best pizza experience for pizza enthusiasts seeking something new. A very good friend highly recommended Casa Nino’s to us. We found its ambiance, attentive & friendly service, plus delicious dishes setting a new standard for Staten Islanders. We enjoyed a simple traditional pizza, cooked perfectly, an order of Arancini (you get 3), their Seafood Combo, and their delicious Jumbo Shrimp Parmigiana!!! We selected the recommended wine and enjoyed it with our meal.\n\nEnjoyed dinner so much at the restaurant, I’ll be walking over (get some steps in) for lunch (salads, burgers, pastas, etc.), since I work from home.\n\nWe were so impressed, I placed a large catering order for my daughter’s graduation party."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdGZxT293RRAB",
            "text": "Wow I haven’t dined at any restaurant in Staten Island in the last decade that was as good as the meal I’ve received today. Juicy, tender, marvelous plates of food that left me wanting more. I mean it when I say this place is seriously one of the most underrated restaurants on Staten Island and more people should check out this place because I feel it should be recognized. Thank you to the staff, especially their manager Sergio providing me and my family with outstanding and warm hospitality."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dGN6YkJ3EAE",
            "text": "Family friendly Atmosphere, great food Family style great prices top notch manager, big Sergio is the best kind staff and great cooks who have longevity that’s the making of a class outfit. Love, casaNINOS"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadlBUMnR3RRAB",
            "text": "My wife and I love this place. Since they moved to the new location the food and service have improved immensely. Also, the option to dine in is pretty decent as their seating makes for a good date night location. They still have decent prices considering how good their food is. I would not be surprised if in the future they expand again into a traditional Italian restaurant."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OG9DNEZnEAE",
            "text": "Just had a graduation party here nice private room. Picked the feast menu. Everything was delicious Service great Staff was pleasant and went above and beyond. Sergio was very accommodating. Recommend it highly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYX2ZIak1BEAE",
            "text": "Love Casa Ninos. Food is delicious and reasonably priced. Atmosphere is great, service is friendly. Pick up is also excellent. Highly recommend it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMm92elBBEAE",
            "text": "Be careful when you go there and check your bill.  Happened to me twice and now I won't be going back.  Young kids at the front think people are stupid.  First time they tried to charge me when the order was already paid for and when I told…"
        }
    ],
    "reviews_count": 66
}