{
    "name": "Tutto Apposto Cucina Italiana",
    "place_id": "ChIJy-KpVN-1w4kRzagKeBn_31g",
    "grid": "SI3",
    "address": "31 Page Ave, Staten Island, NY 10309, USA",
    "rating": 4.7,
    "user_ratings_total": 223,
    "phone_number": "(718) 227-8582",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbExYVXhSRmhCU1V4UGFuZG1ibGRLVVdvMVZWRRAB",
            "text": "You have to get the brunch special! The server was so helpful in getting me to decide. Definitely glad I didn't just get a salad, though I'm sure that would be good too."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTVRXMWtZMUZuVVhKcFVVMTRNazFUVUU5b2NGRRAB",
            "text": "Ordered the rice-balls with vodka sauce for an app. The flavor was like your typical pizzeria rice-ball (good and you get 3) but they were served lukewarm warm, at best, with cold spots in the middle. Waited for a while for dinner to arrive but that was probably due to my husband ordering the pork chop. The pork chop was thick and tender, but it was supposed to be served with spicy cherry peppers.....not spicy and no cherry peppers to be found, just lots and lots of onions. This was also served luke-warm. I had the shrimp oreganata which was served with \"creamy\" polenta.....it was horrible, tasted like unflavored lumpy oatmeal, stay away......again, served tepid. I like my food served hot so this place was obviously an issue for me. We will not be returning, besides that, the service was good. As a side note, there were only 3 other tables being served at the time so it being crowded was not the issue."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVE9FcFNlbmwzVDBWcllXOXdkbEJEYWxaS2FXYxAB",
            "text": "Impecable!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSFEwNUNRMDk0U21kWGEycHpPVkpTUmpsQmVYYxAB",
            "text": "James and Ivan were above and beyond.  Amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21selYwaFFaV1l4UXpNeVVGcFNaREJyTTI5MGVFRRAB",
            "text": "Loved the food & our server Rachel was the best!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcFRGY3dkRGhhUTBGblRWbFRZbk5yVHpOM05tYxAB",
            "text": "I have to say really disappointed with this place , the service was great but the food was not what we expected at all. This restaurant is overrated if you looking for the real authentic italian food this is not the place we end up eating it because we were starving after a long day of work but definitely not worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWlZuZEdURmhuYUVOaVZVdDRkbmgxZW1NeWVrRRAB",
            "text": "We would like to thank Tutto Apposto as well as the staff & owners.\nOur establishment uses there curated cheese assortments as well as cured meats, fruit, peppers & many other items for our wine tasting events.\nThey even deliver to us, which is a very kind service being we are on opposite sides of the Island. They truly go out of the way to help & accommodate the community.\nThe food has always been nothing shy nor small of wonderful.\nThe staff are more than kind understanding & are a great help when it comes to making assortments of required items for special wines we choose to pair for that event.\n\nAgain, Thank you all & keep it up 👍🏼!\nSincerely, Liquor Garden"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wblVpMXdlblJUTWpBeWFHVjNaSEpNTmkxbVoyYxAB",
            "text": "After seeing all the Reels on the New Pizza Oven @ Tutto Aposto\nMe loving food especially Pizza\nNeeded to come up to My Old Home and went to there\nWe started with a Nonna to warm up the\nEngine\nOrdered the Lunch Special Sandwich\nHomemade bread Chicken Cutlets,Eggplant andMeatball\nParm\nCan't remember the name of Sandwich\nI call it Menaj ( it was enough for 2)\nMy Cousin order Grilled Chicken Salad\nLunch Portion\nI wonder with Dinner portion looks like\nLet me tell you from the Manager (Animal) from the Reels to the Server went out there way to make Comeback tell my friends and family about this Place\nBeing iin the food business or overv45 years\nReally Appreciate Great food And Over the top Great Service\nWell trained staff with Quality food\nAll shows there is Great Leadership that cares because all Associates are Happy\nThank you for the Great Dining experience\nI will be back with friends and family from Lavallette NJ"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUFlYVXRjbXBQY0ZSaWFURnphRzQ0UzBWQk0yYxAB",
            "text": "Went for the first time on Friday night, nothing but great things to say about this restaurant! I have two children with Celiac and was told they have a bunch of things on the menu that are gluten free. What a selection they had! The…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRmN6TnRla2MyYm1KSFRWUnpZbXAwZDAwMWNGRRAB",
            "text": "We just came from this location like an hour ago 9/5/2025, and we are still savoring the meal. First let me say the inside of this location transport you to a chic neighborhood in Italy, beautiful!\nNow for the real review! We ordered from the Lunch special menu which had plenty of selection for reasonable prices. I had the Chicken and Spinach with Penne, and my friend had Mezzi eggplant with angel hair pasta(it normally comes with spaghetti) both dishes were magnifico, fresh ingedients and nice portions. For dessert we shared the warm Chocolate cake with ice cream and a perfect cup of American coffee and Expresso. The service was top notch! I highly recommend you will not be disappointed. This will be our once a week dining location"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSVRHSlhZamxXYm5WTGVrWkNZekp1YkhGcVluYxAB",
            "text": "Attended a great party here. The food was great, service attentive and the atmosphere homey and welcoming."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213dFVERmpWVWxFVm5WS2N6WnBNamxmVFdGT1VIYxAB",
            "text": "First time at Tutto Apposto after having been to Panini Grill a few times, AND IT WAS AMAZING! Great restaurant space, very well decorated … and the food was awesome. I ordered the Pasta Al Forna Calabrese, and it was just like my mother’s recipe, AUTHENTIC CALABRESE! We highly recommend Tutto Apposto and Panini Grill and will be back soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poM05EWkZaa2xRTjFSaVgwNUpXRlpaVFcxdVdtYxAB",
            "text": "Ashley was incredible izzy the chef is amazing food was delicious service was even better"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVVExZEdXSGQxUTFRNFNHMUVTVmRMT1d0Sk9FRRAB",
            "text": "Ashley was an excellent waitress"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMFlXSnlaVk54YW1wdVJ6RmlXVkZQY2twWFRIYxAB",
            "text": "Ashley was wonderful!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gc1pISk5VRTFxV0VGTFMwMWpMUzFDZUdGT1ptYxAB",
            "text": "Everything at Tutto Appleton from our pleasant waitress Ashley our quick service, Delicious food and great atmosphere is exactly why we keep coming back over and over ! The Gluten Free food is so good you would never know it was Gluten Free!!! Thank you Tutto Apposto ! See you sooner than later !!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRmJEbEJZMnREZGxWcVgzZFJUa0pET1Uxa05HYxAB",
            "text": "Ashley was great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bFIydzBaa0pIWkdOTVREaGxhWG95VkRkVk1HYxAB",
            "text": "Great dinner with friends and a really great restaurant, gave Tutto Apposto a try and it was excellent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSVRISmhSSGhhZVdGZmJEbDZla3RPYkd4dExWRRAB",
            "text": "Amazing food and great environment!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbFFYVXlVVzFtVFRkUFQxbzFVekJpZERkNVEwRRAB",
            "text": "Peter you did an amazing job creating Tutto Apposto, 1st time there. Midway point for a family meeting place. My sister from Barneget NJ and Me from Merrick Long Island. From appetizers to desserts an amazing experience. Well done Peter 👏"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeVN6bDBVbk56Y1hCV1YxSldNVzlCWkVaS1gwRRAB",
            "text": "Great place! great food!! great service!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRk1tbEJRaTEyUTE5M1kwWmxUWE5vVm1KRlpYYxAB",
            "text": "I’ll keep it simple,my wife and I are celebrating our 33rd anniversary, this place is like you’re at home in Italy and grandma is doing the cooking.\nThe food is absolutely spectacular, if I could give it 10 stars I would. Our server (Ashley) was amazing treated us as if we knew her all her life,  she is a class act.\nTo Chef Peter you paisan are what Italy is all about. You’re A#1 all day long.\nTutto apposto, non ti preoccupare!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WU9UazFabFJZVmxSdU5sQmhWVVJPYVhWc1puYxAB",
            "text": "Delicious food! Rachel was the best server."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twV1NsSnJOamd0UkVjeFUzSm5Xalk0UmpVM1JtYxAB",
            "text": "Delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Q2JVcENUMFF6TWpocFNtRTVUMmxaZUZWM1ZXYxAB",
            "text": "Decided to drive in from Bay Ridge because we’ve heard people talking about it. Food and service was excellent. Portions were big. The drive from Brooklyn to SI were the usual traffic but it was worthwhile. In the area Don’t miss this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSb1dtaHRZMHB2UmpZMllYQk5WbE01T1VKWE0zYxAB",
            "text": "Excellent good, great atmosphere, outstanding service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xob1lVUlNNRzQ1ZEROVWRUTkxZM05hZVVwc2NWRRAB",
            "text": "The food here is amazing!! We decided last minute to drive from the Jersey Shore and it never disappoints!! Our server was Ashley and she excellent!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMlVsbHdNRVl6VVVadGRYZHFVeTFDTlhWWU9FRRAB",
            "text": "Food was delicious and service was excellent..Roberto was our server was very helpful with our meal and menu choices"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xseVltTk5XRGRtVWxCME5WaGZTbUl0TUZJMGVWRRAB",
            "text": "Nice restaurant, but I had to wait  a very  long  time to serve  my order .\nI was seated  at approximately  7 30 pm and didn't get my order  until  1020pm.\nMy wife lost her appetite and had her packed  to go.\n\nI most likely never  would  go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZeGRWOW5PVTFRYlVaQ2NETnJjVEZVT0ZsTWVIYxAB",
            "text": "What a great dinner! Everything was delicious &the service was on point. Will definitely be back!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWWJHNXRUblpmWldsdU1XdElUa040YmxscFowRRAB",
            "text": "Food and service  very good\nLarge portions.a bit too loud."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV2FEa3laVmRNV1c1aVltbzNlR1J5UkU5WWVtYxAB",
            "text": "I hardly review restaurants but this place was out of this world. The rice balls were amazing. The portions are so big and the prices are unbeatable. I can’t wait to go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWFRHUmxZVU15VVZacVJVNU9UMU4wWDFWQk5sRRAB",
            "text": "Everything was fresh and delicious! Awesome attentive staff. We will be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQmMwSnhiVXBRWkc4MmVVaE1aVFpuWjBGQk5VRRAB",
            "text": "Nice atmosphere, our server Ashley was great. Sandwiches were a nice size and delicious.  Pasta & fagiola was delicious but wish there was pancetta lol"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Od1ZGQk5UVTFTZERWVmIwODJRMlJ3TURWaFRVRRAB",
            "text": "My husband and I recently threw a 1st birthday oarty at Tutto Apposto Cucina Italiana and our experience was a 10/10!! Everything was amazing! The room was beautifully decorated, their service as impeccable, staff was incredibly attentive, helpful and kind, the food was absolutely delicious and abundant! My guests were raving about the place all night long! Thank you Tutto Apposto for making our first experience with you guys so wonderful! We look foward to returning and creating more memories in the future.\n— Bianca Simeone"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210R1N6a3pUamxPTmtSVE1YcHhjSGxsVGpOamFVRRAB",
            "text": "Booked a large party for after a funeral. The manager was extremely pleasant and very accommodating with a great selection for the menu. Every dish, when it came out, was more delicious than the next. The servers were professional and on point. The owner even offered his condolences. I recommend this place not only for the authentic food and service but it also doesn’t break the bank. Must try!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VWNsUm5WWHBaZVZKamMySlFaamx0VDFCb1MzYxAB",
            "text": "Excellent Italian restaurant!  Service as good as food!  I recommend everything on the menu, especially the incredible brussel sprouts roasted in a balsamic glaze/honey sauce!  To die for!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdlV6Rk9lREpsVlROSFYwUm5hM0JNVlVremFXYxAB",
            "text": "The atmosphere was beautiful and the service was great! Rachel was very knowledgeable and perfect in service.\nOur drinks were perfect.\nThe hot appetizer put many places to shame, it was that good.\nThe portions were generous.\nI had the linguine with white clam..\nIt was good but I never want to have ANY grit/sand in my clam sauce. 😬\nYes, I’ll give it another try.\nWe did enjoy ourselves."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTFowSTJWREl0UVhKMkxWRnJNVWg2Y0daWlUyYxAB",
            "text": "Great experience will be back!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMVpMY1p3EAE",
            "text": "The food was amazing & the staff was excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobGVqRlJSamxwVm00d09FUkpNRWN6WlhWeE5HYxAB",
            "text": "If you have read my reviews, you know how brutal I grade the customer service experience.  It is the single most important reason why I re-visit restaurants and then, of course, the food.\n\nI knew nothing about this place. A friend of mine, I guess, follows the owner on Instagram, and being Italian himself, he would often talk about visiting the restaurant.  When I told him I would take him, he lit up like a light bulb!\n\nThere is a small negative but, we’ll get to that later.\n\nThe restaurant itself is very nice.  It is not that big but, perfect for the location.  It was very nice, clean and definitely gave that Italian feel.  Very nice wall decor and the bar was equally nice with granite countertop.  Bathrooms were nice and the kitchen was as well because I did take a peek when I left the bathroom and it looked spotless back there.\n\nNext our server Samantha was an absolute ROCKSTAR! Lei era la migliore! Our food came in blazing hot and people on dialysis should think about switching to Tutto’s marinara sauce.  I mean, IT’S THAT AMAZING.  The staff were wonderful and the pizza guy, man, what a great soul he was.  Overall, if you haven’t stopped in here, you don’t know what you’re missing.\n\nI have every intention of driving back from Boston because it was that great of an experience.  Now for the small negative.\n\nParking. They do offer valet but parking seemed to be the only thing I wish was better, but, not enough to take away from the 5 star review.  I had to park across the street, which was a bit nerve wracking because cars are FLYING down the road and could be a bit dangerous.\n\nOverall, the customer service experience and food, was a SOLID 5 and can’t wait to go back.  (My buddy was bummed out he didn’t meet the Chef but, I’m a customer now, so, I’m sure he’ll see him soon)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfak1TNnJRRRAB",
            "text": "Had a lovely anniversary late lunch here on Saturday. Drinks were very good. Staff attentive. We got the calamari to share to start and it was a generous portion and great value. I had chicken and my husband had the pizza with nduja which is the first time I’ve seen it on the menu anywhere since moving here so I’ll definitely be trying that pizza when I return. The pizza is exactly the way we like it , blistered thin Neapolitan style. My chicken was excellent the vegetables and potatoes a nice addition. We got another round of drinks as they were so good -and the bill was tax and tip was $170. Lots of great things on the menu to try next time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMMkEycEdCOFliMWZBEAE",
            "text": "Food was off the charts and so was our waitress Jackie. I would recommend this place to everyone. Also, very large portions"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbWlpYkM5dHVEbVhnEAE",
            "text": "Purely magnificent,  live music and the food is to die for. Traveled from California to New York City, have family in Staten Island, and was asked to visit this place. The food did not disappoint. Will be my go-to when I bring my family next time.  😋 👌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLaVdwWVBNa2VuX3NRRRAB",
            "text": "Had a fantastic lunch yesterday at Tutto Apposto, got to speak with Peter, AND got a quick tour of the kitchen before my flight back home to Texas. Appreciate your time,  generosity and attention to detail, a true gentleman and restauranteur. 5 stars!  Thanks again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMEl6MTZRRRAB",
            "text": "Pleasantly surprised, dinner was absolutely delicious. I had chicken Parmesan with vodka sauce, which you might think is a basic meal, but you’d be surprised how many people mess it up! It was HUGE and Absolutely delicious! The atmosphere was great. Our waitress Samantha had a great personality and was on point with refills. I am deff going back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmanF1M1lBEAE",
            "text": "We went last night, and it was incredible! This place is run by the same man who opened Panini Grill, one of Staten Island’s best restaurants. The food here was absolutely to die for, and the drinks were amazing. I genuinely had a great time—the portions were generous, and everything tasted phenomenal!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMmQzVEh3EAE",
            "text": "Everything from service to food was amazing! Only bad thing we didn’t like the filling in the stuffed mushrooms. Everything else was delicious! Was worth the drive from PA and it’s the first exit off the bridge which is a plus!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKaVAtOENCNUxMSC1nRRAB",
            "text": "What a gem!\nI’m in town on business from Chicago, and from the moment I walked in, the hospitality made me feel like a local. I’d heard from a friend that Petter runs a first-class operation, turns out that was an understatement. The atmosphere, service, and overall vibe were top-notch. If you’re ever in New York, do yourself a favor and stop by. You’ll feel right at home!\n\nAuguri!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmX0p5Smd3RRAB",
            "text": "Dined at Tutto Apposto on Thursday night, and from the moment I walked in, I was greeted with warm smiles. The ambiance is absolutely stunning—inviting and perfect for any occasion. My family and I sat at a table this time, but next time, I’ll definitely bring friends to enjoy cocktails and food at the bar. It looks like such a fun vibe!\n\nWe started with the Margherita and Salsiccia pizzas. I don’t usually finish an entire pie on my own, but the Salsiccia was so good, I easily could have! It had just the right amount of kick. The bread was incredible, too! We also tried the calamari and rice balls, which were equally amazing.\n\nFor entrées, I had the zucchini pasta with ricotta—so delicious I’ll absolutely be ordering it again—and the vodka chicken cutlet panini.\nMy mom had the Linguine Vongole. She loved it! Everything we tried was fantastic!\n\nNicholas, our waiter, was exceptionally attentive throughout the meal, making sure we had everything we needed and adding to the overall great experience.\n\nThis place has all the makings of becoming my go-to spot. Good luck, Peter and Sal—you’ve created something special!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOeTdoN3pfZ3BfX0xREAE",
            "text": "My family and I have been to your fine dining restaurant several times. Each time the service has always been exceptional,  but last weekend a few of us went for lunch, and the service was BEYOND EXCEPTIONAL!! Our server Jackie made us feel like we were a guest at her dinner table!   She was warm helpful made suggestions felt like I knew her forever  she never missed a beat. It’s like she knew what we needed before we had to ask.  Of course we enjoyed the meal .. like always.. but we all raved about Jackie.  Looking forward to going back  hats off to Peter for hiring such a wonderful server.   The best!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbzhiVm13RRAB",
            "text": "Excellent atmosphere, pizza was made to perfection dinners were properly cooked and made to perfection, desserts were fresh and coffee was delicious valet parking is a plus and convenient, moderately priced highly recommend will be back again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNTFJudDZfek5xSDdBRRAB",
            "text": "The new place has a very nice set up and atmosphere. The only real downfall is the noise factor. It's understandable when there are several large parties being held. But when they are in the main dining area, the volume level was insane. We were four people and could barely hear one another speaking. Children were running around tables, and the excellent wait staff had to dodge them constantly. The party room is lovely, and I can understand wanting to accommodate larger parties in the main room, but sitting in the midst of it all was not very comfortable. Also, with a reservation,  we  needed to wait almost 20 minutes to be seated. I imagine over time, the restaurant will find its rhythm.  Food was not a disappointment.  It's very tasty and has good portions. 👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNYjkwdXU2eEo3bXBnRRAB",
            "text": "Jackie is fantastic, super friendly and very personable. Any questions we had she was incredibly helpful and so knowledgeable regarding the menu and even what wine to pair with our meal. Her professionalism, upbeat attitude and customer service even on a Friday night with a packed restaurant she still made us feel at home; truly indispensable. I wanted you all to know what a difference it made having Jackie as our waitress. Thank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJX0xoclR6bnNEOTdnRRAB",
            "text": "Such a great dinner with friends. Great menu with many options and really good drinks. Wait staff was friendly and really knew the menu. Portions were big and really tasty. Looking forward to going back again and trying new items. Also have a great bar area , where we sat before dinner and enjoyed a cocktail. Def recommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMFlLQjN3RRAB",
            "text": "Beautiful atmosphere! Food and service was great. The chicken parm was delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQajEzcUd4LU5hanFnRRAB",
            "text": "Loved the ambiance and decor!! Was recently there for a late lunch for my daughter's college graduation with the family\nThey were courteous, attentive and accommodating.  Not to mention the food which was absolutely delicious.. had some appetizers and pizza.. hardest decision was which pizza to get!!! Everything was just so good!! And the drinks... so good!!!! My favorite is the Sorrento!! Probably our go to place for sure!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc2FMOERREAE",
            "text": "The food was excellent. The prices were reasonable. The staff is amazing and entertaining, especially Jyoti! ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bFIzZFZRMjUyTkZkeGVYbzVlaTE0Wm5JNFFXYxAB",
            "text": "This is a must see! We came for a visit from Florida and this restaurant was the top of our list to see. It did NOT disappoint! Every dish that came out of the kitchen was delicious! Our local family and friends will be checking it out as well. They’ll def be getting a lot of new regular customers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSlpHUkNTazFFWDJOVVNXWlpUVU52TmxCQ2JsRRAB",
            "text": "Solid Italian food on the south shore of SI. My friend who grew up there kept telling me this place had to be good in such a prominent Italian area and he was definitely right. Chicken parm had great sauce and the cheese was perfectly melted on top. The tagliatelle dish with zucchini cream was amazing and the Funghi pizza was great with very flaky dough and not overcooked. Will return"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNkxfZTV3RRAB",
            "text": "Visited for the first time today. Food and service were great! Fried calamari was fresh, crispy and tasty. Grilled octopus was a little too chewy, but good char and flavor. We had one regular crust pizza and one gluten free pizza. They make their gluten free crust in house, and it was the best one I’ve had in a restaurant. Atmosphere: the music was too loud, but we loved the friendly staff and rustic decor with all the florals.  We will definitely return!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdWExODBOMEY1VjNGWFNHZHdMV0o0TjNGeVgyYxAB",
            "text": "Dinner was wonderful. Great food and drinks. AMAZING fungi pizza (must have), octopus was cooked perfectly and the shrimp over polenta delicious. Martinis were excellent. Very attentive staff. Can’t recommend this place enough!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbzRUUF9BRRAB",
            "text": "Great food, ambience, service was excellent. Staff very attentive. It was 1 week prior to my birthday. My husband and myself had dinner with family. Staff turned on music & came over to sing happy birthday with a firework on the cake. It was very nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYkxrX25UbnVXZGpnRRAB",
            "text": "Had a 15 person Family Style Dinner last Saturday night. Everything from the apps to the dessert was delicious! A lot of food! Great addition to the neighborhood! Great vibe- our new favorite restaurant!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNUp2dHdBRRAB",
            "text": "What a fabulous dinner from soup to nuts… great specialty cocktails, FRESH and delicious calamari and shrimp.  Baked clams were unreal!  My husband got the most tender double cut pork shops… the chocolate cake is a MUST!  Excellent service too…Definitely going back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQNk5ydkNMdHFqSENnEAE",
            "text": "Food was Delicious. They do not serve Italian Bread, nothing to dunk with. Service was horrible. We were 6 people, dinner took 31/2 hours. The waiter had a good personality but was nowhere to be found. I had to go to the hostess to get Cheese. Told the Manager when we were leaving, she said he would address it. Very disappointed."
        }
    ],
    "reviews_count": 66
}