{
    "name": "Campania Coal-Fired Pizza",
    "place_id": "ChIJxaOvrV61w4kRqFfaL_wcPyE",
    "grid": "SI3",
    "address": "240 Page Ave, Staten Island, NY 10307, USA",
    "rating": 4.4,
    "user_ratings_total": 499,
    "phone_number": "(347) 983-4998",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTVZsbHpVR2RsTjJOM1dHUnVjV0ZSVTJrNWRWRRAB",
            "text": "Delicious & Kindness"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVFFYQkZTa2xxVEZKTmRsUmxOVGhSTjFKSVkzYxAB",
            "text": "Great place to eat. Recomend"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paYVEyOXdUblpwYWtVMFZEUmllWFZ5UVhsdFVYYxAB",
            "text": "food is great- service is good too, even on a busy weekend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRVJrMU1Ta1ZaYW1scE5tbHdORWhHU0U5V1UyYxAB",
            "text": "I would have enjoyed my dinner if the owner/manager (whatever he is) wasn't chain smoking near our table.\nHe smoked 3 cigarettes in 8 minutes and then was blowing smoke in our direction.\nHe should have walked further away from the restaurant if he needed a smoke that bad.\n\nThat is frowned upon in the hospitality industry. Enployees should never smoke in front of the restaurant.\n\nAlso, the woman who seated us looked miserable. I don't blame her.\nOur waiter was nice."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NM1RtcDJlbGhKVDNaTU5qWmZUV05OVUhCTFVVRRAB",
            "text": "The service was terrible. The waiter never came to our table after we got our food. One of the dinners was wrong and we had to get it fixed. Our waiter was nowhere to be found. No one brought us condiments. No offer on drink refills. We had to keep grabbing other people like the manager at the hostess station to help us. We still left a 20% tip but I doubt we’ll ever go back. At their prices I was hoping for a better experience. The place was about 25% full I can only imagine how much worse the service is when it’s busy.\n\nUpdate: we went back last night and the server we had was let go. The manager remembered us and adjusted our bill. Anthony our server was polite and professional and we had an amazing dinner to celebrate our wedding anniversary. Thank you for making it right!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMVVUZG9ia2xsWkVKSWFIbEROblZRZUhKU2JWRRAB",
            "text": "The food was delicious and a bit pricey but good sized portions to match the price point. The interior opens onto patio so there’s not much climate control, making it very hot inside. Family friendly and very attentive service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMmJYTm9OMWRZVlVWRWJXMUpXaTF5WmxwWWQxRRAB",
            "text": "One of the best Italian places to eat in the area everything from grilled octopus down to the pizza was authentic and really great atmosphere would definitely recommend if in the area or even have to go out your way to get there"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VlEyRlBWV1JyVTNOUldXdHdSWGR6WjJKSFNIYxAB",
            "text": "Great food, great service, friendly Management 👍 👌 😀"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMU1saFZWVGt6V2pneVlrZFVhMGR6UVdkcmJHYxAB",
            "text": "Love this place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aS2JXMU9SMGt4WW1OalltOWxTSFUzVmxseWJHYxAB",
            "text": "Really good service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwck9GUkNiMmxXTTNoamJYQmhiMUpUZFZkTWFVRRAB",
            "text": "I asked for a steak sandwich, got a chicken sandwich. That’s the first time I saw that lol"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twYVVuVm5YMEpGU1Vob2RqRktNRlpoUmpNM05sRRAB",
            "text": "Great customer service pizza was delicious"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONlpIcGpSMjlVTVZFd2JFbzFaSEE1VkRnNVJIYxAB",
            "text": "The GALLAMAH was seriously to die for. As tender as I've ever had."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wd1RrNVJiVGxDUkhsMUxXVmpOVkp1YjFwTE1HYxAB",
            "text": "Great food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pab1JWTlNjM1JaVEVseVFUSlZWa0ZsTkhGS1ZFRRAB",
            "text": "Food was good but service was great. Wonderful atmosphere and impeccable decor. This experience has now made me curious about the Brooklyn Campania which I will be visiting soon. Hope its similar and the staff is as attentive."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMFEwMUZVRGRWVldsV2EzY3RaR3hsZERad1pIYxAB",
            "text": "Best campania location"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPLWhyci1iX2NuUE5nEAE",
            "text": "I had a good experience at Campania Coal-Fired Pizza. I tried the grilled calamari, which was a bit on the chewy side, but the fried artichoke hearts were very good and I would definitely recommend them. The food overall is pretty good, though not perfect. What really stands out is the service - the staff and bartenders are very friendly and attentive. The atmosphere is also nice. While there's room for improvement with some dishes, it's worth visiting for the quality service and decent food."
        },
        {
            "date": "5달 전",
            "language": "el",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKMzJ6T1BOZ0l6bVp3EAE",
            "text": "Ναι τρως πολύ καλό Ιταλικό φαγητό στο Staten Island. Αξίζει να το επισκεφθείτε"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLU1k0OHFtenFQT01nEAE",
            "text": "This is a great place for small or big party gathering. I feel like the portion is not very big. There are a few dishes that I really like. The pizza we ordered is amazing. It’s thin crust which is similar to Italian style. The steak is very good too. We had medium rare, and the texture of the meat wasn’t too hard to chew. It was soft and juicy. We had 9 people so at the end we ordered a lot of desserts. I personally really like the lava cake and the cheesecake tastes good as well! I would recommend you to stop by and try this restaurant if you are around Staten Island. The atmosphere is chill. It’s just a little hard for big party to chat when there are a lot of people because it is a little loud. Also, I personally think it’s a little too dark inside especially we sat down all the way inside."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNQ052djd2bTlfdTJRRRAB",
            "text": "Best crust ever!!! Just waht you need to soothe your sou after a sad farewell."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMlNqdl9Tdk43aUtREAE",
            "text": "Great Pizza!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbnRqc0QtMGZfVTdnRRAB",
            "text": "Food was excellent."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNnZpZTFRRRAB",
            "text": "Great pizza & salads!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJd3NEYzV3RRAB",
            "text": "Truffle fries, pizza and brandy veal pappardelle are great. The manager is always there making sure everything is going well"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ME1TSzN3RRAB",
            "text": "Great food, friendly staff. The manager (Adon) went above and beyond to accommodate us. He kept checking in on us to make sure we were ok. The atmosphere was low key,  high energy if that makes any sense. Just a really good night. Arancine, and baked clams to die for!. I will be back for sure. Worth the trip from NJ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3X01yeFZ3EAE",
            "text": "My wife and I went for the first time last week. Service was fast and efficient, food was amazing and actually had flavor, perfect shot of espresso to wrap things up. We were planning our next meal here before we even finished eating our entrees, honestly!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbXZmb2dBRRAB",
            "text": "Customer service is always the best at Campania! We drive up from Middletown NJ to come to Campania because the food is always fantastic but the service is top notch! The manager constantly comes to check on the table and remembers us by name. All of the wait staff is on top o their game. Food is just outstanding!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReE95dXdBRRAB",
            "text": "White pizza was really good..."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRd09DcTNnRRAB",
            "text": "Good food and great portions"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbHZUSGpBRRAB",
            "text": "Great food and service I definitely recommend this place to anyone. The pizza is great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOWRuTWtBRRAB",
            "text": "Campania coal-fired pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURULTV1Zm1nRRAB",
            "text": "Rooftop and outdoor seating available this pizza restaurant is a place one can go to celebrate any occasion.\n\nMenu is diverse and a great bar there isn’t much missing from this establishment.\n\nDecor is modern with a spin on class, no wonder I witness a lot of tables filled with people celebrating birthdays.\n\nIf you can’t pick one style of pizza go for making the pie 1/2 and 1/2. Not in the mood for pizza? There are dinner plate selections that I will try the next time I’m around.\n\nLeave room for dessert, lots of selections to chose from as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6aWJDZ0JREAE",
            "text": "Campania in Staten Island isn't your average pizzeria; it's a culinary haven. Their pizza is a masterpiece of flavor and texture, while their non-traditional offerings like hamburgers and steaks are equally impressive. The cozy atmosphere and attentive staff make dining here a delight. If you're in search of exceptional food and a welcoming ambiance, Campania is the place to be."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMHZEZzJ3RRAB",
            "text": "If it wasn’t for all the younger staff just all hanging out in the corner or one of the young servers was just walking around watching the game on tv and wouldn’t stop whistling then 5 stars. The food is great. Everything was prepared the way we like. Everything had flavor. The potions are great."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNE56dWtnRRAB",
            "text": "This a place is for comfort food! The food is always fantastic and services is always great! I’m a frequent customer anytime I’m around I definitely have to stop in with the family! Definitely a Must try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cUtYS3FnRRAB",
            "text": "This restaurant is amazing, we go all time with our family, the food is great, the service is excellent, the manager Tony is always wonderful, and very polite, considerate, friendly…we highly recommend this restaurant!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bTZHdDRRRRAB",
            "text": "Lunch at Campania Coal Fired Pizza. For appetizers we got the garlic knots, meatballs, mac & cheese, and the italian eggrolls which were on special. Next was the pizza. We got a half margherita half vodka pie and a Lombarda pizza. Everything was fantastic!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdXFxZHZRRRAB",
            "text": "Very nice service, great food!  Popular to locals!\n\nCouldn’t ask for more!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyM0p1VDJBRRAB",
            "text": "Food was amazing as always. Service was fantastic, especially considering how busy they were for mother's day. Campania is a wonderful place for any occasion."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKb2JLRElREAE",
            "text": "In a time where it is very hard to spend your hard earned dollars and want to get the most for your money, Campania is the place.  I have been going to all the Campania’s since they opened and they never disappoint. My daughter was turning 1 and we had to choose a venue for 42 adults and a few children.  Tony and the crew hit the ball out of the park. The choices on the party menu, the setup, the service and the meal was impeccable. Execution, execution & execution. Thank you guys! for an incredible afternoon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MGY2OV9RRRAB",
            "text": "5 stars for sure! Pizza is fantastic, thin, airy, crispy crust, delicious sauce, coal fired and you can tell! Many other menu items to choose from as well."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2OE1DMUJBEAE",
            "text": "Had our son's 18th birthday party 🎉  last night staff and especially the mgr plus the food made the evening more spectacular thanks again for everything you did for us"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYLU9EMXlBRRAB",
            "text": "We were a large group and despite the place being super busy, experienced excellent service and all food served hot and timely. It can be a little hard to have conversations when it's that busy but we still had a great time and the per person all-in price was great! Special shout out to Daniel our lead server who made constant efforts to ensure everything was great and glasses were full. We have been to their other locations but this one has plentiful self parking so may become our favorite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucU55cWd3RRAB",
            "text": "Our family gathered here after a funeral. The tables were set up for us, they had great timing between the courses as well as great food selections. The employees were considerate, efficient, and helpful. The food was amazing!!!!! I do recommend."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRZ3ZlbXFBRRAB",
            "text": "Large space for groups, tables for four or two, plenty of tv screens to watch Yankees baseball, and eating delicious pizza and salads! Amazing staff and clean place for everyone!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtejctNFBnEAE",
            "text": "It is a nice resturant. While you wait for the food they give you caponata (that It Is very good). We try the pot of mussels... We needed more bread to dip in the sauce.\nWe love the Carciofi Salad and if you need proteins I suggest to add grilled calamari.\nIf you are in the mood for Pizza, Torino is very good. My husband loves prosciutto crudo!! Provare per credere!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdU5hZ3F3RRAB",
            "text": "Excellent food and service. Very enjoyable untrusted atmosphere for fathers day dinner"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOUx2MXFnRRAB",
            "text": "2 of us were given meals in a timely manner. After waiting 45 minutes we asked where the other 2 dishes(salads) were. The server said that the salads were ready, but because they were having a \"mass cleanup.\"  No apologies no considerations, just the bill for the two meals given and an offer to give the partially made salads to go. After waiting 10 minutes I  overheard the server tell the manager that the salads were still not ready.  Since the rest of the party was already in the car, I told them to forget it and left"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeE9yM2FBEAE",
            "text": "Yes, everything was good, the service was good and the atmosphere was good. But having the manager run behind you to complain that the tip wasn't enough? That's madness. Pay your workers better, you stingy people. The restaurant is full and you can't manage to pay a normal salary to your staff? Shame on you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbWRxX1ZnEAE",
            "text": "Visiting friends we decided to hit this place for dinner with the kids today. Made a reservation, came  few mins early they seated us- a min later came back to ask if we can be reseated, apologized and At the end worked out ok. Food was delicious, service was on point. The manager (Tony) made the experience even better by removing sangria from the bill-unnecessary, but definitely appreciated. Def will be back, good atmosphere, delicious food…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwME5HR3BBRRAB",
            "text": "Nice place and comfort food. Not crowded at lunch time."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcktMZU93EAE",
            "text": "Went for dinner and the food was delicious!! The best gnocchi I’ve had since I went to Italy …   !!! Everything was delicious!\nit was outstanding !  I highly recommend!!\nOur beautiful waitress MELANIE and the servers were wonderful ,very accommodating and attentive!\nLulu is great and very hard working !"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dU5HZGFnEAE",
            "text": "Great atmosphere, great food. Quiet during lunch but can get a little loud later in the day.. Forget the pizza and try a deep fried calzone."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4ME1td1RBEAE",
            "text": "Great ambiance. Service was great even if the manager didn't think so. Had a group of 11 no one has any issues. Pizzas were great and unique. Great amount of choices on the menu. Will not be disappointed. Outdoor seating available but the garage door style windows makes the whole place feel outdoors."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQd1pPZjBnRRAB",
            "text": "My wife and I stopped by Campania Page today for a speedy dinner. We selected Shrimp Oregpanata, Chicken Francesa, and Spicy Shrimp Calabrese. For dessert, we chose Pistachio Tartufo and Coffee La Rocca. We enjoyed the atmosphere, service, and warm hospitality from the staff and manager."
        }
    ],
    "reviews_count": 55
}