{
    "name": "Z-Two Restaurant & Lounge",
    "place_id": "ChIJ7-_l40W1w4kR_YnkORi-bGk",
    "grid": "SI3",
    "address": "2925 Veterans Rd W, Staten Island, NY 10309, USA",
    "rating": 4.2,
    "user_ratings_total": 1580,
    "phone_number": "(718) 356-6800",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taa1JuUTNiSEYzYmxkamVYcHhiR3BsUmkxbFIzYxAB",
            "text": "Great diner food. Big portions, and fair prices. Stay away from the Reuben though. It was terrible."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNGRrVm5WMjVYUXpaV0xURTJORWRIZG1KV2MxRRAB",
            "text": "Food is excellent  ,service  too Just wish they would have the same menu and specials like Z one...Z one had the best specials...They  used to have specials for each day of the week.many dishes that weren't on their menus.Big variety of complete specials..It's a little boring to see the same dishes over and over..."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdWFrcGlWR3RRTmpKWGVEUkVSM05mYm5sMmVXYxAB",
            "text": "Ate there last night, was a terrible experience.  Food was just ok, waitress was terrible.  Instead of handing us back our change, the waitress held it in her hand and said to us “keep”.  Instead of just giving it back or offering to give it back and we would tell her to keep.  Plus, ended up getting sick from the food we ate.  Also, was very loud because there was a band playing in the party room.\nWon’t ever be returning."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZNkxuQnJRRRAB",
            "text": "Good food  good service\nHeard  from  a former worker that the kitchen is dirty. No longer  will go there..sorry.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKT1UxQlNiV1pCV2poblYyVnBUMUZIUkhSbE4zYxAB",
            "text": "Love their Food. I used to go to Z-One all the Time but they closed . Thank goodness they have a Z-Two"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadldVdEpabnAwTUV0cFJGOVVOWFUyUnpWTlVXYxAB",
            "text": "Everything was amazing! The service and the food top quality. Ali is a great host! I will be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUVZYcGpWRmd3V0RWRlVFYzBZazFtUmpGMU1sRRAB",
            "text": "Excellent food, service, and atmosphere!\n\nWe visited Z Two Restaurant & Lounge for a family lunch in June 2025. It was our first time there, though we live nearby. The interior is stylish and inviting, all the food we ordered was excellent, and the service was precise and attentive. It was somewhat pricey but that’s the tradeoff for higher quality.\nWe definitely recommend Z Two for great food served in a pleasant, well-designed atmosphere.\n\nFood ordered\nZ Two Appetizer Sampler\nChicken Wings with BBQ sauce - excellent\nCrock Chili Bowl - excellent chili!\nGreek Salad\nSteak Fajita - sizzling and flavorful!\nSeafood Combo Oreganato\nPistachio Crusted Salmon - salmon is nicely complemented by pistachio crumb crust!\nPan-Seared Ahi Tuna Steak - this one could be a bit more flavorful and less cooked.\nKids Penne Vodka"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UU5sUnJaWFZOV2t0T1kwODJZelZRTjFsSGJsRRAB",
            "text": "Very welcoming, our waiter was fantastic! We came with our two children and they were given little muffins and fruit before we ordered. AMAZING. Very comforting for two hungry toddlers. Anyone traveling/going out with kids can imagine what a huge help that was! The kids menu was great, everyone left full. They were even given balloons on the way out. I rarely leave reviews but this was really special. 5/5, thanks so much!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWblpqWmpNWFpzWDBaT2JHRmFkV3BKYkdkNFMzYxAB",
            "text": "As always awesome service makes this a great place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZdFFqVnpWVkZhTUVoaE5tbHFNSEp3Uldwb2JIYxAB",
            "text": "Love this place ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ac1ZtbEpSVFZ0VW1seWNqbFFOa3hpV1RaQ1MyYxAB",
            "text": "Had a Tiramisu Latte, which was delicious. I drank some so fast so the picture doesn't do it the justice it deserves... also had chicken tacos, also very good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eVlubFNNM2wyUWxSMlRFTkZURTFCUVRSdU5XYxAB",
            "text": "I never really write reviews, but I felt like I had to after our experience here. The food was very good and came out super quick. Our waitress Erin was excellent. The young lady Emma was so welcoming and went out of her way to give us information about their Tuesday and Friday kids night and movie night, which was super helpful since we were looking for something fun to do with our grandkids for the summer. Wonderful atmosphere, the bus boy’s were even asking us if we needed anything and the gentleman who brought out our food was very friendly. We had a great experience. We'll definitely be coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONVptcHhTbmxLVEVoQ1JucG9TVVpJTldnNFltYxAB",
            "text": "Heard great things about this place. Too bad I didn’t even sit and eat. Whoever is the older man seating tables needs to greet customers with a smile instead of an attitude. Asked for a table for 8 to celebrate my nephews graduation, and this man proceeded to have an attitude and roll his eyes. When my party made a comment about his attitude, he stated “his face is because there’s no air conditioning.” Not sure how this gives a right to take it out on customers. Never again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVE0zZGxOVkpPUW5jeVkybEJlRWxLUzFWeVdYYxAB",
            "text": "Terrible terrible service!  My family came to celebrate my nieces stepping up to kindergarten. The wait for the food was over an hour. The place was empty when we arrived .. but as it became crowed witness other huge tables full of guest getting their food before us. When I asked what is the problem I was told it’s busy and brushed off. Food came out freezing cold. Will never come back to Z two for anything. The nerve of me getting an attitude for questioning what’s going on is ridiculous, especially for the amount of patience my family showed today. To offer us a free desert is tasteless for the two hours we sat in there just to be serve cold food and attitude. Do not recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJcTRqT0t0cExXRmFBEAE",
            "text": "Waitress was great! No issues with that. We were a party of 7. Half the food came out either over cooked or undercooked. The bus boy that brought our food out had no\nIdea what he was giving us. Several different types of steaks were ordered all with different cooking temps and he just had no clue. Only after about 5 min of standing there with our hot food plates did we all get our correct plates. The $32 NY steak I ordered was just a ridiculously thick hunk of fat. There was just nothing that could be done with that steak. And at this point I’ve lost my appetite. I ask\nThe waitress to please just take it away. I’m not interested in a replacement. My daughter’s steak and eggs were just too well done. Her boyfriends steak was practically raw, asked for medium\nRare. Her father’s cheeseburger came out practically raw in the middle. But they decided to just eat what they could. Come time\nFor the bill and unfortunately my Inedible steak was not removed from the bill. I didn’t make a stink. Paid it in full, gave the waitress a very nice tip and left. I would never eat there again. For a $300 bill, half the food was cooked incorrectly. The piece of steak I was given clearly looked gross. Yet they served it to me anyway. No thank you!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Nd1lXdE5OMmd3ZUV0NlRrRTBla2Q1VW5nM2MzYxAB",
            "text": "I've gone multiple times and have been very satisfied with my meal. I love pancakes and they have very well done pancakes that make me happy I chose to go there. The environment doesn't have too much going on and the waiters or waitresses have been respectful and haven't felt too busy or gone too long. Food was hot everytime it came out. I can admit I've had only a bunch of breakfast items and they all were worth it. I would have to explore the lunch and dinner menu, but with their track record I can assume it will be up to my expectations and if it wasn't, the management would do the best to accommodate me. Check out Z two."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLWGYwYUxMemR6dDN3RRAB",
            "text": "Better than expected!  They stepped up the decor and service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQVFdxdXVkd3BMMURnEAE",
            "text": "Place is good food fresh play is clean waiters so friendly and believable plenty of parking space"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHOHU3MzRnRRAB",
            "text": "Always excellent"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPamZudXY1eWV5TXd3RRAB",
            "text": "We came here for a late date night. It was not part of our plans but turned out great! The service was excellent! Food excellent we had 2 for 20 burger and fries and a shot of vodka lol. Our server was great. Very attentive and went above and beyond to make sure we were happy. The atmosphere was chill and I was impressed with the cleanliness. Also worth noting they are one of the only restaurants serving food after 10pm on the south shore. Check them out! ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa28zdld3EAE",
            "text": "Relaxing atmosphere💋, great service❤️, delicious food and  good happy hour from 3pm-7pm!! 🍸🍹🍺"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOU9pZ2VnEAE",
            "text": "I love the folks here-  So much so that I often come with a small group.. Inviting friends is something of a regular thing with me..\n\nI grew up in diners.. this is the best dinner lounge/with more than just restaurant-diner food. It's a culinary delight!\n\nTheir Dinner specials change daily.. Steve and staff, Phil the nicest manager, everyone here is incredible.\n\nThe mushroom soup is a great starter.   Angie was our server tonight.. music is terrific always. Live music & dancing many summer weekends. Lively outdoor area as well with a bar area/lounge.\n\nThe restaurant is best known for their steaks and chops.  The mouth-watering aromas outside attest to this.   Cooked to perfection and absolutely fresh, & never frozen. My steaks always melt in my mouth.\n\nThe T-bone and shrimp special was my go-to as usual tonight..  The steak was huge just like the jumbo shrimp. You have never tasted anythingso delicious. Also- their eggplant parmigiana was so delicious and fresh served with a perfect situation and a beautifully light tomato sauce. And huge portions!\n\nDon't know how else to say 5 stars isn't nearly enough! Thank you for all the great meals Z- Two.  A great place to celebrate any occasion- Happy Mothers Day!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNzZEYzh3RRAB",
            "text": "Ordered a steak and eggs breakfast and a Turkey BLT costed me $100. They charged me 60$ for a steak, 2 eggs over easy and fries…. First and last time going , Out of line never going back. Last night my wife and I  went out to dinner and had a full course dinner for $120…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOXBmVGRBEAE",
            "text": "Z Two...what can I say.....The owner, his children, are great!!! ALL  of  the  staff are TERRIFIC!!!!\nThe food is great, the specials are terrific..the place is just so clean,  upbeat, cheerful and festive..It is a great place to eat!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNlBYSl9BRRAB",
            "text": "Nice atmosphere and environment"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNk1XQ2RnEAE",
            "text": "Very comfortable neighborhood diner. I highly recommend the calamari!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3Njh6WkdBEAE",
            "text": "Love the people who work there and the food. Also, they have character night every Tuesday which is great for the kiddies"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Z2Z2cHZnRRAB",
            "text": "Went there for a brunch"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3d3VLbG5BRRAB",
            "text": "Good food and reasonable prices"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM3NHUnh3RRAB",
            "text": "Good food, but a little overpriced."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM3VLUnRBRRAB",
            "text": "I Had my wife’s 50th birthday party last night. It was beautiful. From the service to the setup! The food was so delicious. Always a Wonderful atmosphere!! I highly recommend Z2 for your special event. Just mention Mikey Flowers recommended you. They will do the right thing!  I love the place. Ask for Steve,Ali or Khaled."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBN3F5a0RREAE",
            "text": "Amazing service. Nicole made our night"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNDRPV01REAE",
            "text": "Amazing place , delicious and service is incredible"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfal96RDZnRRAB",
            "text": "The Ceasar Salad with Grilled Chicken had a large portion of chicken, but it was a little dry."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbzhha0pREAE",
            "text": "Terrible experience, the waitress was nice but when i walked out the manager started screaming at me and cursing at me. I am a teenager and he is a grown man and also the manager of the place who was drunk cursing at little kids. His girlfriend tried to calm him down. Is this how a business should run? You know its funny because i swore the guy screamed at me first. I don't know if he was drunk or not, but don't say im spreading false information. I regret not recording it. You guys have a camera dont you, you guys have proof or what that guy was obnoxious and or drunk. I shouldve filed a complaint for verbal abuse. You guys need to do better seriously. Terrible business. Everyone there looked like loosers."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpeC1hTTFnRRAB",
            "text": "A good place to meet friends and enjoy some good meals.  They have tasty specials.\nUpdate: I had my birthday dinner on Saturday 2/19/22.  The staff at Z-Two and Pastels were great with the exception of the dark haired waitress we had for my dinner.  My guests were shocked at her lack of friendliness and attitude.  She seemed like she did not want to be bothered and rather be anywhere else but serving us.  As my mother would say, she had the personality of a dead cat.  I didn't even get a piece of my birthday cake my mom bought from the restaurant and she didn't offer to let me take it in the lounge with me. My fault for being tipsy. At this particular time the restaurant was not even busy and at some point she had somebody helping her which was way more friendlier than she was.  She needs some serious training or doesn't really need to be doing this type of job. Despite this, my guests still tipped her and I gave her extra because the party was large.\nOn another note I still love the restaurant and had a great time overall!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ3YzZXBRRRAB",
            "text": "Our waitress Nicole was very attentive and kind. The food is delicious and such BIG portions! There were people walking around making balloons for children and even Mickey Mouse (costume)! You can’t go wrong with anything on the menu. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NXJ1NFZnEAE",
            "text": "Gluten free pancakes, French toast and fudge cake! Only diner I found on the island that has those items fresh made GF👍👍nice staff as well, gave tips on nearby Italian markets and parks to visit. Thanks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkOWZHUTFRRRAB",
            "text": "Amazing neighborhood restaurant, we stopped by for dinner & we absolutely loved it!\nStaff were super amazing, very friendly & accommodating, they made sure we are well taken care of,\nGreat variety of menu options, the food was really delicious.\nTo our surprise dessert too was really mouth watering, we will definitely be coming back & so should u!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTNnBhOW1nRRAB",
            "text": "We went there after Caroling (around 9 at night) we reserved the place ahead and we are like around 30 people! They’re accommodating and even if it’s late, they catered to everyone well.\nTheir Hot Chocolate is delish!my husband ordered a breakfast meal (yes at 9pm) and yes they do serve it..\nThe Z Burger is huge! With a lot of side fries!\nIt was warm and the decorations and ambience is wonderful ❤️ definitely gonna come back!\nThe prices is not that bad as well!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5a2V1Yk53EAE",
            "text": "Amazing restaurant! Always giving back to the community and hosting great events for adults and kids! My kids love character nights. The food is always cooked to perfection. Khalid and Rachel are the best!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaTRMMGt3RRAB",
            "text": "I celebrated my daughter's sweet 16 birthday at their lounge with delicious food, fantastic music by their dj Anthony. All of us  had a blast. Thank you for the attention of the restaurant owner, the managers, especially Khale and all the staff, including Debbie, for making this party such as a great memory for my family, friends, and myself. All of you are a gem. It was my pleasure to do this celebration with a great team that made everything possible as my daughter dreamed. Thank you, Z-Two restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMjRqaWd3RRAB",
            "text": "My mom and I came back here because it was good the last time and 2nd time didn't disappoint.\n\nI got a cup of oatmeal which was great on a cold Autumn morning. Then I dove into the gluten free french toast which was really good.\n\nSide note -- fyi this place doesn't have pastries, i.e. danish, pecan rolls, etc."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcXBUVlB3EAE",
            "text": "Huge modern diner.  There was no wait for a table and our server was accommodating and attentive.  The food was fresh and delicious.  We had sandwiches, the coffee was fresh and plentiful.  There is plenty of parking."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dXVfVTZ3RRAB",
            "text": "Z2, as a diner that's relatively local for me, is a diner that I've had the pleasure of enjoying many experiences in.\n\nZ2 is in many ways like Z1: The fries are very good, the mozzarella sticks are scrumptious, the rigatoni pasta with marinara sauce is splendid, the chicken tenders are good albeit a bit too greasy for my taste half of the time. They even have nice bread too. The onions and pickles I get are plentiful too. One cool thing about Z2 is that when you have an order delivered from Z2, they often give you a courtesy dessert. I may not be a dessert person but I appreciate them profoundly nonetheless. The most interesting observation I made about Z2 is that they have the best garlic bread I ever tasted.\n\nIt's worth noting that the popular consensus is that Z1 is better than Z2. Based on what I ate, this is largely true but I never had the garlic bread at Z1 to really know if I can say this for every order I had. Nonetheless, this shouldn't discount the fact that Z2 is a great diner. Being a slight step down from my favorite diner on the island still means it's a great diner in my book just that if given the option, I would take Z1.\n\nSome miscellaneous things to consider about Z2 is that Z2 has better hours on average than most diners but that the disco may be on late at night. So it's a good last resort option but the disco may thwart any attempt at having a peaceful meal at that time. Of course, if you like it you could always come for that too. I remember oftentimes hearing the disco music at Z2 all the way from the Applebees around there.\n\nPiece of trivia, I went to Z2 in a Mario costume once with my friends and once with my uncle and cousin. Here's a picture of me and my friends with our costumes on for the movie.\n\nUltimately, Z2 is a great diner and one I would recommend to anyone in the area and a great choice if it's after 11PM and most of the diners on Staten Island are closed."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRbHFDVmh3RRAB",
            "text": "I came here to meet my sister for an early dinner. The environment and atmosphere was very inviting the wait staff excellent and friendly and the food was awesome. I had a spinach salad with skirt steak and since I am a bodybuilder I'm…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNalozVnZ3RRAB",
            "text": "Great food, great atmosphere, private party room is a plus. Baby shower was enjoyed by all. Would definitely book an event here again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhZ3RtOVpnEAE",
            "text": "By far this place served the worst calamari I’ve had. It was very fishy and that was the first time I’ve ever had calamari and smell a fish smell. And it was not served with any lemon or lime…and the tomato sauce that it was served with was a bit sour."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5NEtEMENBEAE",
            "text": "Food was amazing. Coffee was fresh and service was great. Sam the waitress was very helpful and friendly."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMExpZE13EAE",
            "text": "NICOLE was the BEST!!!! We typically have good service here but honestly there is something about Nicole that hits different. She was so attentive and she even joked with our toddler which no one ever really does. She's truly a ray of sunshine in this place and we hope to have her again when we visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNnRTY3NRRRAB",
            "text": "We ordered gluten free burger and we received this. If we would wanted a sandwich, we would have made it at home. We went once at the restaurant and the gluten free burger was a real one, tasted good and had a few sides. Not sure why the delivery service was so bad."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMThYT2hRRRAB",
            "text": "Love coming here for breakfast. They give you a sizable amount of food which is really good in most cases. The lunch and dinner menu really large so it will take time to decide what you want and not all of it is great. The atmosphere is really great and it's very family friendly even though they label themselves as a \"lounge\""
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZdmFXMmd3RRAB",
            "text": "I came last night to celebrate my 50th bday. Everything was perfect. Danielle the waitress was kind quick."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkcWJQUFVnEAE",
            "text": "What an exquisite dining facility. Me and my family of 7 came to dine last Saturday night, and the 2 girls in the front were wonderful! All of the managers were super helpful, and checked up on us, especially the young gentleman Phil. All of the girls up front were lovely and socialized with us while we paid. Our waitress, Erin, was lovely and made sure everything came out quickly. We even had some specials that were delicious. I could not imagine a better dining experience. We will definitely be back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVdE5uS0FREAE",
            "text": "We celebrated,with family and very close friends our sons college graduation on Saturday July 13th @ your outdoor party lounge. We would like to thank both Steve and Ned for how wonderful they treated both my wife,myself and all of our…"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbWJleUZREAE",
            "text": "Spacious, great selection fast service plenty of parking"
        }
    ],
    "reviews_count": 56
}