{
    "name": "Breaking Bread",
    "place_id": "ChIJbwds9ZZLwokRPR326llEtEA",
    "grid": "SI3",
    "address": "27 Seguine Ave, Staten Island, NY 10309, USA",
    "rating": 4.2,
    "user_ratings_total": 136,
    "phone_number": "(718) 356-8989",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNVIyODJZVWxtV0ZwTk9XNTFTMk5XYUZvMVFrRRAB",
            "text": "Just had dinner with another couple. Service was horrendous never brought out one dinner so we all waited for 30 min and still did not bring the food. The appetizer was hard and over cooked waiter never apologized nor did the manager. Extremely disappointed. Never again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGc1lUVlhRVVJVU2pGYVRFTTJNbVJqTFdsdFVHYxAB",
            "text": "Food was great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MWNUZE5TbkZPV1VoYVFtWTVjVWxtUVZBMWVYYxAB",
            "text": "ordered in and delivered in 30 minutes to Rossville - food was hot, delicious and well prepared.  2nd or 3rd time we had delivered food from them and each time was not disappointed. Top shelf."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jelkzSTBTWFpDT0dSWk9XUm9hR1J3Ylc1cWFrRRAB",
            "text": "Decent spot, great cutlet. Sauce was a lil pasty & the server wasn't as attentive to detail but I'd go again for a slice & take out"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcm1qSkxPd3BqY3BRRRAB",
            "text": "How does a restaurant have peas and macaroni on their menu and then serve the dish without peas stating they ran out of peas how does a restaurant run out of peas?"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKLUJwZGpkNG9fS1ZBEAE",
            "text": "Waiters? So angry! I have eaten here a bunch of times over the past few years. Refuse to dine in unless we sit at the bar. Food is great. Please get new waiters"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb3VySU93EAE",
            "text": "It’s so unfortunate bc the pizza is fantastic (nice job Giuseppe) but the owners have such a bad attitude, mainly the wife. So unwelcoming to say the least. You can be a regular and they do not say hello or goodbye, won’t even acknowledge you at the bar, very bad attitude. If someone is spending money repeatedly at your business the least you can do is show a little bit of class. That’s okay off my big family and I go to another pizza joint.. luckily on Staten Island there’s one on every corner."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdE5qazBnRRAB",
            "text": "Food is mediocre service is rude way over priced. If you want Italian food in the neighborhood Eat italian or Rocky's is great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbUttQTlBRRAB",
            "text": "Had their food catered to a team dinner with middle school children and adults.  The food was delicious! Ordering was a breeze.  Nicole helped me through the process etc. If I didn't want to be 500 lbs I would eat there every day. ❤️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbFpxc0tREAE",
            "text": "intimate place with amazing food, awesome staff & just overall great time"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcHJTcTR3RRAB",
            "text": "Great food.  Can't wait to go back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX2JyMmRBEAE",
            "text": "Everything about this restaurant is amazing!\nMy favorite appetizer is the francese Calamari"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbzhIV3BBRRAB",
            "text": "I was there in the afternoon nice place had a few drinks didn't get to try the food but there was tables in there for midday I enjoyed it"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneXR1cVhnEAE",
            "text": "First time ordering and will definitely be back! I'm regretful I didn't eat here sooner it's actually up there with top italian food in this area. Very flavorful and everything was cooked perfectly!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBa2VHTHB3RRAB",
            "text": "Absolutely love it here - amazing food, drinks and staff. We come here often and it never disappoints! Would highly recommend coming here - you won’t regret it!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfemJTb0lnEAE",
            "text": "Tried the margherita pie, regular pie with mushroom, and rice balls. Everything was outstanding! I’m Italian and live in Brooklyn but will be coming back here next time I’m in SI."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbG9TX3hRRRAB",
            "text": "pizza was raw"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNXVIVW5BRRAB",
            "text": "The food was so good, it tasted like my mom used to make when I was a child.  The owners are very welcoming, and kind.  The service  was amazing! I can't wait to go back again .  My favorite dish was the shrimp! ---OF"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMXFpT213RRAB",
            "text": "Her\n\nAmbiance:\nBreaking Bread exudes a warm and inviting atmosphere. The decor combines rustic charm with modern touches, making it perfect for both casual dining and special occasions. The soft lighting and cozy seating create a welcoming vibe.\n\nFood:\nThe menu at Breaking Bread is a celebration of fresh, locally sourced ingredients. Standout dishes include their  pasta and wood-fired pizza , which strike the perfect balance of flavor and texture. The seasonal specials showcase creativity, and the dessert selection—especially their signature tiramisu—is a must-try.\n\nService:\nThe staff is attentive and knowledgeable, offering excellent recommendations and ensuring a smooth dining experience. Whether it’s accommodating dietary preferences or providing wine pairings, the service is a highlight.\n\nValue:\nWhile slightly on the pricier side, the quality of the food and experience justifies the cost. Portion sizes are generous, and the attention to detail in every dish makes it worth the splurge.\n\nOverall:\nBreaking Bread delivers a memorable dining experience with its outstanding food, warm ambiance, and top-notch service. A perfect spot for date nights, family dinners, or celebrations."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OHJ6dXJBRRAB",
            "text": "Breaking Bread is a holy encounter with the divine spirit of Italian cuisine, where every bite feels like an act of grace. The pasta, tender and sublime, seems crafted by hands guided by something greater, while the bread—warm, fresh, and pure—is a symbol of life itself. Each dish is a revelation, from the sanctified olive oil to the celestial wine that flows like joy in a glass. More than a meal, it is a communion that nourishes the soul as much as the body. To dine here is to touch the eternal, a reminder of the sacred in the simple act of sharing food."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQN0lXeUVnEAE",
            "text": "Was ready to order $38 dish but people who answer phone hung up on me twice after I was put  on hold.\nThat's\nA very unprofessional way to answer.And the reason I know you're not telling.The truth is, you had my phone number.Why didn't you call me and ask me when I was picking it up"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeHJPQ3d3RRAB",
            "text": "Worst place ever I ate there got food poisoning spoke with the owner she was supposed to call me back never did and did nothing disgustingly dirty I even have a picture of a spoon they try to give me for the cheese and it was already filthy  stuck  cheese on spoon I cannot believe an owner of the place did nothing about it didn't even have the decency to call me back then when I was going to take the rest of my food out before I know that I was gonna get sick the way to came with one of those takeout plastic trays and he says this is all we have but it was used I can't even make this up it was filthy and empty when I went there should've been my first sign the waiters outfit or whatever he was wearing was disgustingly dirty have pictures of  that also"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaW9UckpBEAE",
            "text": "10/10 minkkkk🤌🏻🤌🏻🤌🏻🤌🏻 absolutely amazing"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbFlELVFREAE",
            "text": "Good news, bad news. The food was delicious and the serving sizes are great. Awful service though. Arguably the angriest waiter in the world. Knew it was a bad sign after 20 minutes when I had to ask one of the bus boys for bread but this waiter was as nasty and grumpy as the previous reviews said he was. Borderline threw the check on the table without so much as a thank you or have a good night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYczRfQlVBEAE",
            "text": "A friend took me here having heard good things about it. We both had food poisoning that night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYclBpV1VnEAE",
            "text": "Delicious 😋 food. Great service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURILXBURzJ3RRAB",
            "text": "I don't know what happened to this place. They must have changed chefs ?and maybe now waiters are cooking dinner .For the prices that they charge you  there should be  renowned  Chefs preparing my dinner. Plus the owner only has Non little speaking english waiters that are so busy the service  sucks The place is called breaking bread. And you have to ask for bread at your table. .Find another place people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbEszcWxBRRAB",
            "text": "Service was horrible! Ordered pizza as appetizer and they bought my food first and the pizza after one hour. Food not good and pizza was worse."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dWFxaE1REAE",
            "text": "Went recently for a Saturday evening dinner date with my husband.  The waiter was very abrupt and shut down my husband over a seating issue. After feeling uncomfortable and practically sitting on top of another family , i confronted our waiter and told him i really did not feel okay sitting there.  He said he would ask his manager if it was okay to move us.  He did, and naturally,  it was fine. He seemed really annoyed about it.  The entire time,  he kind of avoided us and didn't crack a smile once.  He seemed very miserable and angry. He really needs to lighten up because this will make others feel awkward..\n\nThe food wasn't terrible . It tasted good, but unfortunately, both my husband and I ended up feeling very sick afterward. The food was extremely oily. For the price? It's definitely not worth it.\n\nThe atmosphere isn't bad.  It's a very family-friendly restaurant but can get crowded very quickly."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaHIyM3pnRRAB",
            "text": "The traditional pie had a great crisp. Plenty of corn meal on the bottom and the crust. Possibly a little salty. I liked the grandma pie better. More flavor. Fried calamari was good. They make a good cappuccino as well. Make a reservation on the weekend. It's not a large restaurant. Plenty of parking."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNnVuSjdBRRAB",
            "text": "Great food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqaTRPUnpBRRAB",
            "text": "Artichokes are a MUST have !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbnU2TndBRRAB",
            "text": "Great exterior, awesome look inside, fairly busy lunch crowd, service needed to be more prompt at the time considering first seating for the rush. Pizza and salad took way too long, despite a well-done request."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcnVhWnRBRRAB",
            "text": "We highly recommend the chicken francaise, rice ball vodka special and buffalo calamari appetizer, and salmon orgenata. You won't be disappointed with the food; we've ordered from here many times."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeWRYNm53RRAB",
            "text": "Great food and space. But the service is slow and one of the guys (main server I think?) has a nasty long pinky nail and always seems pissed off. No idea what’s wrong. But very off putting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5aDlEdGN3EAE",
            "text": "Excellent food and service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkLTRmbU53EAE",
            "text": "Really good food , pizza is great , no complaints,  would highly recommend this place ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdi16NElBEAE",
            "text": "I just left there.  I had an excellent lunch and everything was great.  The place was very busy for a Monday afternoon and service was fine, but the waiter was very busy.  The food was great and very reasonably priced."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dnU3N2p3RRAB",
            "text": "Good food wonderful staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0cjhlWlZREAE",
            "text": "Best thing to happen to this neighborhood in the last 5 years 100%\n\nVeal parm hero is th best on the island"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCOWRtT3ZBRRAB",
            "text": "Me and my wife had a great experience! Place is brand new so it's very nice inside and the food was really delicious. I see a few negative reviews about the service and that happens with new restaurants. They have to find the right staff to run it effectively and I think they have now accomplished that. Great meal and I would recommend you give them another try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdDhtdnlBRRAB",
            "text": "So my girlfriend and I have a little tradition of indulging in Italian cuisine whenever we're here on Staten Island. We've heard countless rave reviews about this place, so I finally decided to surprise her with a dinner date here. And let me tell you, it was an experience beyond words!\n\nThe moment we stepped into this charming restaurant, we were greeted with warm smiles and a cozy, family-oriented ambiance. It instantly felt like home. The staff here truly knows how to make you feel welcome and appreciated. From the moment we were seated to the moment we left, their friendliness and respect were unparalleled.\n\nNow let's talk about the food. Oh boy, where do I even begin? The flavors, the aromas, the presentation – everything was top-notch. Each dish we ordered was a masterpiece in its own right. From the classic pasta dishes to the mouthwatering pizzas, every bite was a burst of culinary delight. And the portions? Let's just say you won't be leaving this place hungry. They definitely know how to satisfy those cravings!\n\nIf I could give this restaurant 100 stars, I absolutely would. The experience we had here was simply unforgettable. It's not just the food that makes this place special; it's the people, the atmosphere, and the genuine passion they have for what they do. As a business owner myself, I truly appreciate and admire their dedication to providing an exceptional dining experience.\n\nSo, my friends, if you're ever in the mood for some incredible Italian cuisine here on Staten Island, I highly recommend giving this restaurant a try. Trust me, you won't be disappointed. And as a fellow business owner, I believe in spreading the word about exceptional places like this. Let's support local businesses and share the love!\n\n#ItalianFoodLovers #HiddenGems #SupportLocalBusinesses"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcHZqRy1RRRAB",
            "text": "This was our first visit here. We tried to come on a weekend but you need a reservation because it is not a very large restaurant and is busy,  which is good!  We Sat at the bar to wait fir a table but after a few minutes we realized we were settled in the corner of the bar and the bartender was pleasant so we stayed. Bartender was pleasant and attentive. Also gave good options. We started with baked clams which were nice and hot and delicious.  We both ordered pasta and shrimp variation dinners. Dinners were tasty and came with lots of pasta. I had the fusilli with pesto and shrimp. It was good but the pesto good be a little more flavorful, my husband was very satisfied with his meal. For desert we had the exotic mambo ice cream with whit e chocolate. It was so delicious I forgot to take a picture, just one of the empty plate. The owner was very pleasant, we had some conversation with him while we ate desert. Overall, we really enjoyed it here. We will def be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dDg2RTVBRRAB",
            "text": "One of the best meals my fiancé and I have had in a long time. The pizza was incredible and so was the eggplant and pasta we ordered. Everything came out piping hot and fast - excellent and attentive wait staff. Friendly service behind the bar welcomed us inside too. Can’t say enough good things about our dinner .. we left and texted family that they have to go try the food themselves. Think my mother is going tomorrow lol. Will be back soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOVptQ0dREAE",
            "text": "Not a huge place, but not super small either. It has a modern look but still cozy enough. The staff was very pleasant and attentive. I had a special pappardelle pasta with pees and mushrooms. It was a bit light on flavor but I think it was on purpose, once I added a bit of salt and pepper plus fresh grated cheese they bring to the table the whole meal opened up, excellent. My wife had a chicken parm and that was very yummy as well. We were visiting from New Jersey but I'd definitely go there again next time we are in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKemZfMjBnRRAB",
            "text": "The atmosphere is that of a pizzeria, a little tight in the dining room and a bit loud when there's a full house. The doesn't take away from the attentive service and the amazing food. The stuffed zucchini flowers were very good.  My chicken francese over spinach was different but very tasty. My wife had the fusilli Bolenese with Buratta and raved about how good the sauce was with the bread. Definitely will be back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwZ2VfUG5RRRAB",
            "text": "Ordered takeout for the first time: one Brooklyn Sicilian and one white pie, with sausage. Spoke with the owner(?), who recommended adding some honey on the white pie, delicious. Will definitely be returning for our weekly pizza."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOWI2Qkd3EAE",
            "text": "Food was amazing. Excellent service. Portions were more than enough. Definitely on my top places to eat local in the neighborhood. Will return in the future. Want to try everything on the menu. : )"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbXFPTUt3EAE",
            "text": "Great atmosphere, family owned and most importantly great FOOD!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMXFPRXNBRRAB",
            "text": "Great food and great service ! I certainly recommend this place to anyone on the island."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bUpMMG1BRRAB",
            "text": "We have ordered from there it is now 3 times.\nEvery time we orders pies they were burnt on the bottom to be clear the crust was black.\nWe thought the first time it was no big deal, the next two times the same thing black on the bottom.\nWe also ordered 2 dozen baked clams they also were over cooked the bread crumbs were black and the clams were very salty.\nTheir prices are very high for this quality of food.\nThere are better restaurants to go to in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNm8yS0p3EAE",
            "text": "I would've been happier if we weren't sitting close to the door, under a cool air vent. I asked for a table away from the door. The owner said he had tables reserved. No one was seated at the reserved tables by the time we left. We had an $80+ meal.  We did not order pizza!  Seeing that we were uncomfortable, having to eat with our coats on, he should have asked if we wanted to move. Sorry, I hate to be negative, but this was not a good experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwN0ltRG1RRRAB",
            "text": "I order a Buffalo chicken wrap with 🍟 fries. There was mix up in my order.  I got a chicken wrap wit prosciutto!  I do not eat pork.   Fries looked freezer burned...\nNicole waiter was excellent!  Decor and cleanliness was incredible.\nI will visit again......."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bVBMUGpBRRAB",
            "text": "Fantastic Food! We loved it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0LVoyMmhnRRAB",
            "text": "The pizza is outrageous, possibly the best I’ve had in my life. These one star reviews are disheartening. I challenge the management to turn this around, the hardest part of opening a restaurant in the Italian restaurant capital of the world is getting the food right….you actually have that!!  Food is amazing, but it’s not enough because islanders are very sensitive, egotistical and self centered. People want the whole experience. They want to feel appreciated and respected. Angelina’s make everyone feel special when you walk in. It’s why they have a cult following. Can the management  and  staff  just pretend to like the customers for 60 minutes? Get it together  and you can take over the island. Go into Richmond republic, ask for Carmine tell him you’d like some pointers on hospitality management. I’ll be in with my wife soon. Let’s get this turned around and rule the world!! Ok more of an inspirational speech than a review but if it trickles down to the customer change will happen. Good luck!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNXJMdll3EAE",
            "text": "No photos not worth the space on my phone but had a terrible meal I think they only overload everything with salt no balance of flavors. To start off with appetizers wings just a typical pizzeria wings dry and overcooked both the buffalo and garlic parmesan then there so called homemade mozzarella sticks were oily and soggy breading and had no flavor. The baked clams were cherry stones overcooked burnt breadcrumbs and chewy sent those back typical for SI horrible seafood I didn’t taste them because I don’t eat seafood on SI. Then main course came out ordered off the specials but more like let’s try this because I don’t want to print new menus there special menu is as big as there normal menu. I ordered what was supposed to be to be a stuffed veal cutlet that was dry and thick enough to be a door stop. Supposed to be topped with marsala sauce but was sitting in a bowl of soupy broth with chucks of dry prosciutto and so much oil floating of the top it looked nasty sent that back and who ever the guys was that came over didn’t introduce him self just asked what the problem was and said well that’s the way I do my marsala.Not even remotely a marsala just call it dry veal in soupy liquid and oil on the dish. Then my wife ate one piece of her ham and provolone stuffed chicken that was dry and so salty she could not eat the rest but she felt bad sending it back so we paid for that but didn’t take it home.  Then my daughter ordered a chicken vodka parm hero which she ate half had no flavor and the chicken cutlet were stringy and tough and had some type of cheese melted on it but still kept it shape and became transparent and oily. Our first and last visit there only tried it because we were given a gift card which I feel bad they wasted there money at such a place. Overpriced even with a gift card. This is Staten Island I don’t know why we can’t have restaurants worth the time going to I drive to Manhattan and Brooklyn in order to get the food and service that you expect."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NXEyQ2ZREAE",
            "text": "I picked up a grilled chicken caesar wrap and french fries and honestly it was so good I can’t wait to try more things from this place!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNla3FUdExBEAE",
            "text": "The food is DELICIOUS! We decided to try this place over the summer since it is new and we were really happy we did. We ordered a regular pie for delivery the first time we called. It was so good! The dough had a deliciously unique flavor to it. We instantly loved it. We have ordered two more times since then - both times getting pizza and the chicken cacciatore dinner with pasta. Everything was great! There's never chicken cacciatore on other places' menus so that was great to see. I am allergic to grated cheese and I appreciate them not putting it on the pasta as requested, as in my experience, many other places sprinkle it on top! Thank you very much! If you haven't tried them yet, check out the menu and give them a call."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbG92c3JRRRAB",
            "text": "Terrible experience! Took my mom and her friend out for brunch . We got there at 11:55 am. Ordered a salad and 2 wraps . Almost 1:45 and no food came and waiter was very racist and very disrespectful. Called him over a few times and he completely ignored us . Staff is extremely rude . I would not recommend this place at all . Never again !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwM0xlQWxnRRAB",
            "text": "We got to this place at 10:50 but the place was closing. We had already been to about 5 other pizzerias and they were all closed. A man came out and said \"We're closed\". I cried out in my most dramatic style\n\"No! I'm hungry. Can I just get a slice?\"  \"Sorry\" the man said. \"I wish I had a slice to give you. I have some bread... Do you want some bread?\" I thought about this for a second knowing full well what my friend Carol had in her fridge. \"Yeah! I'll take bread\". This guy comes out with the biggest loaf of seeded bread I ever saw and it smelled damned good too! So we didn't get pizza from this place but we went home and made our own. Tasted just like a great Sicilian slice. Thanks for the bread sir! We'll be back to your restaurant to try some of your great looking dishes."
        }
    ],
    "reviews_count": 60
}