{
    "name": "Gigi's Cafe & Keke's Pizzeria",
    "place_id": "ChIJZTzEKJ_Kw4kRBEkeoKf0YZ0",
    "grid": "SI3",
    "address": "7423 Amboy Rd, Staten Island, NY 10307, USA",
    "rating": 4.6,
    "user_ratings_total": 93,
    "phone_number": "(718) 554-4134",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nM1NXTk5XSEZTZVZwa2RFaFdZa3BCVjNZeU1rRRAB",
            "text": "Best Pizza in Staten Island worth the drive beautiful neighbor hood great crust needs no condiments"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNWU3LTZnRRAB",
            "text": "Amazing pizza 🍕 great service\nAmazing price\nCame from South jersey to try the pizza\nDefinitely worth the trip.."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmM1BMTnNRRRAB",
            "text": "The pizza from here is great, always quick, and friendly service. The breakfast is also an amazing deal and great quality"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNE1LMnpRRRAB",
            "text": "I recently had the misfortune of ordering pizza from a local pizzeria that has left me—and my family—feeling utterly nauseous. This was not just any pizza; it was arguably the worst I’ve ever encountered in my life. The sauce tasted stale, and there were parts of the pizza that were missing cheese, as if they had simply forgotten to add it. To make matters worse, when I opened the box, it smelled more like a toxic cleaning product than the delicious aroma of fresh pizza. It felt like I was opening a box that had been fumigated rather than a beloved takeout meal. I’m genuinely trying to wrap my head around how a place that I’ve trusted could serve something so appalling.\n\nWhat’s more disheartening is the response I received when I called to express my concerns. The owner was anything but friendly, insisting that this is how they always make their pizza. If that were true, I wouldn’t have ordered from them again after my first experience. Instead of taking responsibility or attempting to make amends, I was met with indifference. No offer of a replacement pizza, no refund—nothing. It’s as if they couldn’t care less about the quality of their food or the satisfaction of their customers. I’ve been a loyal patron, but this experience has shattered that trust completely.\n\nAfter this encounter, I can confidently say I will never order from them again. It’s disappointing to think that a place I once enjoyed has fallen so far short of acceptable standards. My hope is that I—and my family—can recover from this horrible experience and find a better pizzeria that values quality and customer service. It’s truly unfortunate when a local business fails to uphold the basic tenets of good food and hospitality."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbHRPYmxRRRAB",
            "text": "So good ! Love the l&b pizza !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYN3J1QkF3EAE",
            "text": "The Brooklyn Pie is Amazing, L and B got nothing on them...Always Amazing never and off day.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3b2VLeWxnRRAB",
            "text": "Never ate in, always got take out, found this place through toogoodtogo and so glad we did! That brooklyn slice is so so so good, and I don't typically ever like thick slices"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eHBQMzJ3RRAB",
            "text": "The pizza was excellent, even after being reheated. Thin crust, tasty sauce, and enough toppings. The garlic knots were doughy, and lacking in a good, buttery garlic taste."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6dFBqTUl3EAE",
            "text": "Love your pizza.\nBut I really love your Brooklyn pie.."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZ2ZTamxRRRAB",
            "text": "Excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNUxiT2RBEAE",
            "text": "Amazing!!!!! The food is delicious!!!! I love it!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUM0txM0VBEAE",
            "text": "0 stars for horrible customer service yelling a customers and refusing to give back stolen stuff from customers"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5ak02UXVBRRAB",
            "text": "Had the brooklyn square....very close in taste and texture to L&B which is rare in a clone of this type....only downside was the slice was sitting around a while and was kind of dry.  I saw a fresh pie come out of the oven and it looked great.  Sfincione slice was also very good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdE1xSnRnRRAB",
            "text": "I'll never pass on an opportunity to try a good vodka slice, and Keke's Pizzeria offers a great one with a delicious sauce. The Sicilian slice is surprisingly light with a very crispy crust. In my opinion, it rivals L&B Spumoni Gardens. Yes, it's *that* good. I also love the fact that they're open and serving pizza at 10am because some of us pizza addicts need a slice for breakfast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbUxLUGVBEAE",
            "text": "It's a classic American style restaurant and pizzeria. This place is one of real hidden gems on Staten Island. Seats are comfortable. The atmosphere is comfy and laid-back. Foods are great. Only on Staten Island you can find such a nice pizzeria. It's a must-visit in my opinion."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNac09IM25BRRAB",
            "text": "Its a 2 for 1 deal here depending on which door you walk into. They have a pizzeria and cafe serving all sorts of food. They have wraps, pizza, salads, etc. They make a sicilian pizza wit breadcrumbs and onions. It was unique and actually worked. The chicken caesar wrap wasn’t bad either. It wasn’t too busy but not a ton of parking outside. They are very nice people here as well. I would come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMzRLYnVRRRAB",
            "text": "The pizza is very good and the customer service is very friendly. The girls are very nice and helpful on the phone and always look good in the store. The pizza is cooked well and has a perfect crust."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdG9HOU5nEAE",
            "text": "Delicious pizza   loved the chicken marsala slice"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdXU2RzF3RRAB",
            "text": "No longer going to Brooklyn for L&B style pizza."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNk1lRXhnRRAB",
            "text": "Great Brooklyn Pizza!\nAppetizing menu.."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybG9TN093EAE",
            "text": "Delicious and crispy pizza. Had the sicilian slice with Pesto and Pepperoni was delicious.\n\nthe upside down sicilian has delicious red sauce and crispy crust (better quality and more flavorful than LB Spumoni Gardens Square slice)\n\nFriendly staff."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhLU1QR0RnEAE",
            "text": "Ordered pizza was good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxcHBEajBBRRAB",
            "text": "I don't think you should call the Brooklyn pizza the Brooklyn pizza..  million times better than L&B's..  just name it Staten island pizza"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxNU5icHh3RRAB",
            "text": "Their Brooklyn pie is better than L&B's. Fight me in the streets over that."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLNE1tV2VnEAE",
            "text": "Excellent food at both Pizzaria and Cafe. Cafe is indoor casual dining with prompt service, a quiet and intimate setting. Prices are fair. A very good experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5d3JhOFB3EAE",
            "text": "Brooklyn pie 💣 chicken wings were gone before a pic could be taken. Two cats and a chihuaha helped. A lot 🤨 complimentary garlic knots were delish too,  thanks GiGi's!…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5dnBDbGhRRRAB",
            "text": "👏🏽 I wanted to give this staff some major kudos! I didn’t want to drive in the snow (since I’ve never driven in it before) and my bf loves the burgers here so I ordered one for him and the chicken pesto for myself.\n\nAbout 40 min after we placed our order, the owner called us to let us know that one driver was stuck in the snow and the other wasn’t back from a delivery yet so our order was going to take about another 40min. I honestly anticipated delays due to the weather and was grateful that they were still going to deliver. I’m hoping that anyone who experienced a delay gives them kudos for contacting customers with an honest update. What’s most important is to remember that they are our neighbors and of course safety comes first.\n\nWhen our food arrived it was nice and hot! It was my first time ordering a pasta dish from here and it was amazing! I loved finding whole garlic cloves in it 😋 thank you again!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5LXUyTDh3RRAB",
            "text": "Had the Salmon Oreganato Today so good.\nIm eating it now as we speak with these garlic mashed potatoes and vegetable medley and my mouth is very happy.. !0 stars for me"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTbVpPU0ZnEAE",
            "text": "Just ordered the Sampler & Fisher Shrimp Panini ~ highly recommend 👍🏻…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNWF1SGt3RRAB",
            "text": "Always amazing!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjcFBqVERBEAE",
            "text": "Their Bklyn Pie is just as delicious if not better then L & B’s. It’s good to know u don’t need to spend money going over the bridge. Lol The service for eating in is great they are all pleasant & helpful. Menu is for everyone including…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjNzVUM1dREAE",
            "text": "Phenomenal service and food"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjMGN1V0tnEAE",
            "text": "We come here regularly, the food is fantastic! The Brooklyn slice is literally the best pizza on SI and their wraps and salads are great! The only small thing I would change is enforcing their waitstaff to write down orders...makes it easier for everyone and no mistakes :)"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzdXR1eThBRRAB",
            "text": "Tonight was the first time eating at GiGi's and KeKe's. The atmosphere is warm and inviting. The owner Dina and Chef Mike were so friendly and the staff was so attentive. I would give it 10 stars if I could. I didn't even know the place existed until today and I am so glad I know now. Their new menu starts in February, I can't wait."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZN2JmOHFRRRAB",
            "text": "Food = great the restaurant is and staff so nice, I'm definitely going back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwZy12WERBEAE",
            "text": "Omg!  Best food we have had in a long time. So glad we tried Gigi's. Its a must! You will never go any where else. Party of 5,  we each had something different and we were so busy enjoying our meals that we lost track of time. Beautifully…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBZy1lbnFBRRAB",
            "text": "Beautiful, clean, casual, and great service. Definetly my go-to place to hang out after school. Five stars!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMjRhUVNBEAE",
            "text": "The owners are very friendly and accommodating.  The food is very good and their Brooklyn pie is highly recommended.  A good choice if you are looking for a quiet place to have a simple dinner."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRa2VYWnVnRRAB",
            "text": "I have eaten here a few times and food was always delicious . Went there tonight and food was gross. What a waste of money. The Shrimp scampi had no taste at all, even with pouring grated cheese on it. Shrimp Fra Diavolo was edible because…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndmFYRmVREAE",
            "text": "Nice food, I like to come here for a quick bite. It's very child friendly. Family welcome, and the owner is so nice! The fried Oreos are the best! I do come here often and will continue to come for awhile"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZaHQtU3pRRRAB",
            "text": "The food was amazing and so was the service"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVcFplb1p3EAE",
            "text": "Amazing l&b slice! It's like a hidden gem, and an amazing dinner service,  truly enjoyed my dinner"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJdzlHVl93RRAB",
            "text": "The food was amazing waiters were very friendly and our food came very quick"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncHBPRzZnRRAB",
            "text": "Good food, great service and a friendly staff. Highly recommend."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNFk3UDdnRRAB",
            "text": "Good food, fantastic host and staff, needs better acoustics."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRck1fSGlnRRAB",
            "text": "Great place to go for brunch. Family friendly environment."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNbzhUeFN3EAE",
            "text": "Delish food love the nice family who owns it!"
        }
    ],
    "reviews_count": 47
}