{
    "name": "Laila Restaurant And Lounge",
    "place_id": "ChIJC8_ABDG1w4kRzefkwksjFRY",
    "grid": "SI3",
    "address": "45 Page Ave, Staten Island, NY 10309, USA",
    "rating": 4.5,
    "user_ratings_total": 756,
    "phone_number": "(718) 984-0006",
    "reviews": [
        {
            "date": "20시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SlpXTnNWWGgyWm1kUVdIb3RTVVJmTW5Kd1VXYxAB",
            "text": "Do you want more 5-star Google reviews? Best of all, they’re free! We can provide as many as you need to help your business reach the top of Google Maps. Contact us on Telegram: @gthisjpeg"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMloySjVlbVZEZG1Gc01HNTNiRXh6ZWpaemVYYxAB",
            "text": "Excellent service food so delicious coming back definitely"
        },
        {
            "date": "2일 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWk1tcFVibmcwVjBwMWJ6VjFVR1I1ZERkdVdrRRAB",
            "text": "اطيب اكل والله يستاهل خمس نجوم\nThe best food and services"
        },
        {
            "date": "수정일: 5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaE1UOURnEAE",
            "text": "Service and Food Quality to be remembered for a long time.....\n\nThey brought cold appetizers, then hot appetizers then more of it and then main entree comprising Beef, Chicken, Salmon and then dessert and then tea. Also, there were fries on sides for kids.\nEvery single dish was tasty and of fine ingredients.\n\nHow about service.... hmmmm? Usually great food places don't necessarily have great service.... but this place does.\nThe food servers and manager were attentive, stayed at the top of their job almost throughout.\n\nOnly the drinks order for the kids was not fully cared through a couple of drinks were forgotten,  but that's is not such a big deal.\n\nMy family and i had such a great time and truly enjoyed our time even though we drove from Brooklyn to Staten Island."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KSFF6VlRaVGQxU0d4RVFUbDRSa2xKYjNwSlUyYxAB",
            "text": "Great service, delicious food and lovely atmosphere!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WemQwa3RYMFV3VTNCeGMycE9kbXh6VGs4NVptYxAB",
            "text": "This place was amazing. Food was excellent, staff was wonderful, and the atmosphere is so beautiful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTE9VNVlZMU5XUjFkU1oxUndiemR4UTBOUGJWRRAB",
            "text": "Excellent Mediterranean food! The waiter Roger was kind and polite. I tried the Chicken Shawarma and fruit drink. It was delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNmNIbENkVFYyVjBkSWFqWmtUbHBIWm1Zek0wRRAB",
            "text": "Food was excellent. The grilled branzino was amazing. The bill leaves a lot to be desired though. They force a 20% tip on you. And there's a $5 operating fee. What's that even?"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4U1EySXhWR0pyYkZaUVMwaGpkVU5sVWt0elFYYxAB",
            "text": "I ordered shawarma yesterday, it was excellent and tasted amazing. Thank you. I am very proud of this taste.\nThank you, Habibi"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSGJUZ3lURzh0U0VkUVRrSXlNVko2VkZOQlRVRRAB",
            "text": "Love this place! Food is always delicious, place is always clean and great, friendly service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NFdFUjZWbDkwZEhBM2MxSTVXV3B0VVUxYVQxRRAB",
            "text": "A delightful burst of flavor in every bite!! The food is above and beyond any other Mediterranean restaurant I have eaten at. The staff is very pleasant and friendly and the decor is very nice. Eating here was an absolute pleasure. Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnNVVHMVFaV2xLWldsTGNtOU1kM1ZWTVd0c1FXYxAB",
            "text": "Everything here is absolutely delicious. By far the best Mediterranean food in NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZeFdWUlZVVlJ2YlRCSlZWaDVhWGd0WkVKeWJWRRAB",
            "text": "The menu alone was impressive, but, when you arrive and see the restaurant in person, the decked out decor will surely make you do a double take. Then when the food came, I kid you not, literally every dish we ordered was SO GOOD! From the salad to the mixed grill to the homemade baklava—they were all so delicious! Customer service was amazing as well! So attentive and kind. I’m staring this place because I think I just found a hidden gem on the island!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWeGJqaHBMVUpXVnpaV09HSnhjR2QwV0ZBdFZIYxAB",
            "text": "All foods so good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWldtcDBWM1k1V2s4eVR6UnJRazlRUzJ0ZmFIYxAB",
            "text": "It was a beautiful atmosphere here threw a small engagement party diner staff were lovely and John took amazing care of us definitely recommend it to anyone on the fence about trying this place :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabmJVWkZXamhvVFhoS1ZVSnBkRXh4UVZCcU9FRRAB",
            "text": "Food Is amazing John is beyond the best it’s my new favorite spot"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMU5WbzBUWEoxUTBKNGNsWnVUR3BGWVdKZlRFRRAB",
            "text": "Food is phenomenal, real authentic Syrian food. Service was 10/10! You’re missing out if you haven’t tried this place. Can’t wait to come back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSmExWTVObXBJU25WNVRtbGpNVzlJV0ZFMWRHYxAB",
            "text": "I had a really disappointing experience here. They overcharged me, especially with their automatic service fees and tip charges. I originally ordered a chicken shawarma to go, but changed my mind and asked to dine in while I was waiting. From that point on, I was getting rude and uncomfortable looks that made me feel unwelcome.. On top of that, the food was dry. Definitely not coming back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWWQwTnpWSEZsYkhOYVVFdHhNak5EZURJMFpVRRAB",
            "text": "Came for daughter’s birthday and food and service was spectacular.  Would highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTVYxTkRRVlpJWlVSdk5UUTJWVzkzYVRCQlVtYxAB",
            "text": "Amazing Experience at Laila!\nLaila on Staten Island is truly a gem! From the moment you walk in, the atmosphere is absolutely stunning, and the owners are two of the nicest people you'll meet. Their hospitality and the warm ambiance make every visit a joy.\nThe food is delicious, fresh, and flavorful, and worthy of praise. The garlic sauce is especially noteworthy!\nThe Filet Mignon Kabab with rice and the Shish Tawook, which are perfectly grilled marinated cubes of chicken, are recommended main dishes. The Laila Salad, served in a unique thin, hard-shell cracker-like bowl that's fun to crack open, is also recommended.\nThe hummus platter and the calamari are both fantastic. The cheese pulls are outstanding.\nThis is my 11-year-old's son’s favorite place to go on his birthday, and the belly dancer on Friday and Saturday nights adds to the fun. Laila offers an exceptional dining experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKZmw1TmpsZzdqLTVRRRAB",
            "text": "It’s alright but over priced"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLQzBtdnFjdmV1bFpBEAE",
            "text": "This is not the first time to dine-in Laila restaurant, me and my family love this restaurant and we go so often. The whole staff are very nice, friendly and welcoming"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNnBxWmRnEAE",
            "text": "Excellent middle eastern food! A little on the pricey side, but worth it for good quality food and atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2JqanJnRRAB",
            "text": "Came on a Saturday to dinner and a show! It was my first time there this past weekend with my family and the food was great. Service was quick and very nice. They also had a belly dancer and was great vibes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2FqNHNRRRAB",
            "text": "Food was amazing, ordered the lamb chops med rare with mixed grill for my brother. Enjoyed it very well, service was excellent and quick to meet my needs. Will come again!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaFkyQUJ3EAE",
            "text": "Excellent food! And the fig Martini was fantastic!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvblAtWmxnRRAB",
            "text": "Food is good , portions aren't huge but it is nice to order a little of everything.  Servers were very nice and the plane has a unique look. They were very honest with us,  we tipped them because we didn't realize to was included,  and they called us and refunded the extra tip that we wouldn't have even realized. Will be going back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa2JYLW1BRRAB",
            "text": "We went there for dinner on a Saturday, the place was packed. Thank god we had reservations. We got seated right away. The place is lovely and the atmosphere was great. The food was delicious. The service was quick and very friendly. Will be back for sure."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJak5MTFp3EAE",
            "text": "Food was good but over priced. They charged us for gratuity and processing fee"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bzZLWmxnRRAB",
            "text": "Great food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MHZfdzRnRRAB",
            "text": "Excellent service. Food authentic and delicious. Highly recommend. 10 stars."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNV8zcEVBEAE",
            "text": "The only issue with Google is there is not enough stars to describe Laila’s restaurant!\nThe Food Is Delicious like i mean out of this world Delicious the atmosphere is absolutely perfect and the service is equivalent to being a a 5 star all inclusive resort. This is one of if not the best run restaurants in Staten Island.  10 out of 10!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRN0p2Z013EAE",
            "text": "excellent food and atmosphere."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnd1pTLVlnEAE",
            "text": "Love their lamb chops! The atmosphere is very nice and great date night spot!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcFBPUW5nRRAB",
            "text": "A taste of home 🤍 everything was made with fresh ingredients and was spiced and flavoured perfectly.\nCan’t wait to come back on the weekend when they have entertainment going!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NTY2bjl3RRAB",
            "text": "This Syrian restaurant is an absolute gem! From the moment we walked in, the atmosphere was warm and inviting, and the customer service was impeccable—friendly, attentive, and made us feel like family. The food was out of this world! My wife had the meat shawarma, which was perfectly seasoned and tender, while I went for the Adana chicken—juicy, flavorful, and grilled to perfection. We also shared the hummus and falafel, and let me tell you, they were fantastic! The hummus was creamy and rich, and the falafel was crisp on the outside and soft inside, with just the right balance of spices. This was more than just a meal; it was an experience. We’ll definitely be coming back to enjoy more of their incredible menu. Highly recommend to anyone looking for authentic, delicious Syrian cuisine!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfN05tZFJnEAE",
            "text": "We had a great meal here this past weekend. The food and the ambiance is very good here. Welcoming and warm. The only negative take away was waiting for our drinks. I guess it was a plus because I spent less $ on drinks but it took a while…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCM2N2and3RRAB",
            "text": "Delicious topped by wonderful service. It was first time visiting the restaurant. I've heard wonderful things about the food there for years. It was definitely worth the drive down to page avenue. I'll definitely be visiting the restaurant soon."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxc3ZxRGlRRRAB",
            "text": "Food was great! Place was clean, and service is quick. Portions here are humungous! An entree here is enough to fill you up. The place is wheelchair friendly and there is an outdoor dining section if you want as well. Parking can be somewhat tricky but there is ample parking spaces out front.\n\nUpdate- went with a few friends recently and just wanted to update the review. We went in the late afternoon on a weekend and most of the lunch rush was gone but we were still inexplicably rushed. Not sure why, we had already ordered our food and were just talking but were still rushed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6em9HVkp3EAE",
            "text": "Laila Restaurant is a culinary gem that offers an authentic taste of Middle Eastern cuisine. From the moment you step inside, you are welcomed by a warm, inviting atmosphere and a beautifully decorated interior that transports you straight to the heart of the Middle East.\nThe menu is a delightful array of traditional dishes, each prepared with fresh, high-quality ingredients. The hummus was creamy and flavorful, perfectly complemented by freshly baked pita bread. The lamb kebabs were tender and juicy, seasoned to perfection with a blend of aromatic spices. The falafel was crispy on the outside and soft on the inside, just as it should be.\nThe service was exceptional—prompt, friendly, and attentive without being overbearing. The staff were knowledgeable about the menu and provided excellent recommendations, making the dining experience even more enjoyable.\nLaila Restaurant is a must-visit for anyone looking to experience genuine Arabic flavors in a cozy and welcoming setting. Highly recommend\nFrom the moment I walked into Laila Arabic Restaurant, I knew I was in for a special experience. The ambiance is warm and inviting, with intricate décor and a comfortable seating arrangement that sets the perfect mood for a memorable dining experience.\nThe culinary journey began with a selection of appetizers that were simply outstanding. The baba ghanoush was smoky and velvety, while the stuffed grape leaves were bursting with flavor. Each dish is a testament to the chef's dedication to authenticity and quality.\nThe main courses are equally impressive. The mixed grill platter was a highlight, featuring an assortment of perfectly grilled meats that were juicy and flavorful. The chicken shawarma was tender and succulent, with a delightful blend of spices that left a lasting impression. Vegetarians will love the moussaka, which is rich and hearty without being heavy.\nThe service at Laila's is top-notch. The staff are incredibly attentive and go out of their way to ensure that every guest feels welcome and well-cared for. They are knowledgeable about the menu and eager to share their recommendations, enhancing the overall dining experience.\nAnd let’s not forget the desserts—truly the icing on the cake. The knafeh was a standout, with its crispy pastry and sweet, gooey center. Paired with a cup of traditional Arabic coffee, it was the perfect way to end the meal.\nLaila Arabic Restaurant offers an unparalleled dining experience that combines exceptional food, outstanding service, and a wonderful atmosphere. It's a true treasure for anyone looking to explore the rich flavors of Middle Eastern cuisine. I can't recommend it highly enough!\nLaila Arabic Restaurant offers an unforgettable dining experience that captures the essence of Middle Eastern hospitality and cuisine. From the moment you enter, the beautifully designed interior, with its elegant touches and comfortable seating, sets the stage for a fantastic meal.\n\nThe menu is a culinary journey through the Middle East, offering a wide range of dishes that cater to all tastes. The mezze platter is a must-try, featuring a variety of dips and salads that are perfect for sharing. The tabbouleh was fresh and zesty, and the muhammara had just the right amount of spice.\nFor the main course, the lamb tagine was a standout. Slow-cooked to perfection, the meat was tender and infused with rich, aromatic flavors. The seafood options are equally impressive—the grilled prawns were succulent and cooked to perfection, with a delightful blend of spices.\nThe staff at Laila's are exceptional, providing impeccable service with a personal touch. They are attentive, friendly, and always ready to go the extra mile to ensure that every guest has a wonderful dining experience. Their knowledge of the menu and their passion for the cuisine truly shine through."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbDRlelp3EAE",
            "text": "I’ve eaten here many times and every time the food is delicious. I love their spicy potatoes and kebabs. My husband and I loved this place so much we booked the restaurant for a family gathering. Their decor is also beautiful. I highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NGZmc3lRRRAB",
            "text": "Great dinner!  My friends and I enjoyed 5-6 different appetizers, both hot and cold.  There are a ton of menu options to choose from.  We enjoyed the parsley salad, Laila’s combo which included four different dips (baba ganoush, hummus, muhamara and a yogurt based dip), octopus entree, cauliflower with tahini sauce, and the mini hot pies. All very delicious!! They also had a belly dancer perform through the dinning room.  Fun atmosphere. Staff very kind and friendly."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKa3R5WGZREAE",
            "text": "Recently  we visited the Syrian .  Unusually quite tasty, food from simple ingredients, but prepared with taste and professionally.  The cuisine of Syria is similar to the Turkish one...a lot of vegetables, spices, but also very little meat, of course, mainly lamb, beef and chicken.  In general, it is inexpensive and tasty"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEb19QM3NBRRAB",
            "text": "We went there today, easter Sunday, and everything was perfect.\nThe service is really good, the food was so delicious.\nHighly recommended"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpOC1QeUV3EAE",
            "text": "Really nice time, we we're greeted immediately by a very friendly gentleman and shown to a table. We ordered a few appitizers and entrees Tish had seen a dish on Instagram but was told it's actually not on the menu. Our friendly gentleman returned and informed Tish they had one of the meal she had seen available and he was going to give it to her. Appitizers delicious and then the entrees arrived My Shwarma was very good Lora enjoyed her Stuffed Cabbage from Grandma's Kitchen but Tish she hit the jackpot, her meal was amazing in presentation and flavor, we all tried a piece and aggred it should be on the menu which we of course let them know and our friendly gentleman told us it was being added. Great meal great service and even though we were outside with the heaters great atmosphere. Highly recommend a visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCLTRmaGtRRRAB",
            "text": "We were the first sitting customers during the weekday - I'm sure if we came later, the atmosphere would've been a lot more lively and fun.\n\nDecided to try their mama ghanogh - it was ok, a bit boring, just pepper taste. Their complimentary pita and olives were great though! Toshkah original is a must try! Just the right spice and again, their pita was on point.\n\nI decided to go with the Laila mixed grill cause I didn't want to be disappointed with the lamb shank which I probably should try out another time. The mixed grill was nothing spectacular - imo, the rice won the dish lol.\n\nHubs went for the meat fattet shawarma which was really good, much preferred than my dish. The yogurt garlic sauce was fantastic.\n\nWe also got 2 coffee's and a pistachio ice cream which were all good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNjZEQlp3EAE",
            "text": "Everything was delicious. My first time trying Syrian food and it was a great experience. Will come back again, especially when we still haven't tried the pistachio cheesecake."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwLUpUVS1BRRAB",
            "text": "Flavorful, friendly feast!! Really enjoyed the freshness of ingredients and our waiter John was super prompt and helpful with my dietary restrictions. Fantastic service, delicious experience. The boys were pumped! I was even rapping to the beats playing! Healthy & satisfying! ✅ 🙏😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNXBMYUxREAE",
            "text": "On July 30th, I visited Laila for the first time. It was an incredible place. Everything was 5 star. Very friendly staff, delicious food, and the place looks beautiful. Really appreciate separated restrooms for men and women."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocXNLcWVREAE",
            "text": "Celebrated my birthday here with some friends. The hosts were beyond helpful. They kept checking on us and the atmosphere was great as well. It was a little chilly in the outdoor covered area but we were accommodated very well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtOWVhdXNBRRAB",
            "text": "We had a wonderful time. Delicious food, amazing service. The music was a little too loud for dinner. But at 830 a belly dancer came and it was wonderful. Will keep Laila's in mind for a fun night out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPenJqUkd3EAE",
            "text": "First time to visit Laila Restaurant. I liked the interior of the place it is so oriental and even the menu is in a good design and fabric. Kebba was amazing but other plates we didn’t like ( Fatta Mix , shawrma sandwish) they were greasy. Kunafa was not fresh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWOXJqZ3JBRRAB",
            "text": "Every thing good here. Food tastes good as well.\nOnly the hookah area has very cold. We were sitting in cold all the time. And heater was not working properly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbE43QmZ3EAE",
            "text": "The portions here are too big for a Lebanese/Syrian restaurant. We ordered different stuff hoping we could try a little bit of anything and everything but unfortunately we had to waste a lot of food. It is not entirely a restaurant, starting from 8pm the place becomes so loud with a belly dancer dancing around. So if you’re looking forward to a quiet evening/dinner, this place isn’t yours."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaay0zc2JREAE",
            "text": "Food is amazing and the staff is really nice. They have a lot of seating, was easy to get a table even on a Friday night.\n\nGreat to have some more variety on the South Shore. Can’t wait to come back and try more food!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5eXY3Y3h3RRAB",
            "text": "The welcome bread and olive was great and the food was sooooooO delicious 😋 going to have their food again soon. Everyone should go and taste their food. Service is also good.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dUlDYUdBEAE",
            "text": "The owner is very nice and helpful. He gave us a bunch of great recommendation’s. Food and drinks were amazing. The belly dancer was also very cool. Will definitely come back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5dzZ1S3lBRRAB",
            "text": "My son and I were both hungry and we were about to enter a diner.  As I approached the outdoor shopping strip to get there, I noticed Laila Restaurant.  I always like for my children to try cuisine from other countries, so I decided at the last moment to visit Laila instead.  Once I entered, the restaurant had a warm and inviting atmosphere as if it were somebody's home.  After we were seated, we were served a bowl of pita bread and olives marinated in some kind of spiced oil.  I dipped the pita in the oil and it was delicious.  Since I am mostly a vegetarian eater, I ordered a falafel dish with an order of babaganoush.  I have eaten at several Mideastern restaurants in my life and this was the best babaganoush I had ever tasted.  My falafel dish included pickled parsnips and home-made french fries.  This is a great flavor combination when eaten together.  The fries weren't oily at all and were a great addition to my falafel dish.  I also ordered a hot coffee.  I wasn't expecting the coffee to be so good, but it was.  Laila Syrian Restaurant is in Tottenville, the southern-most part of Staten Iskand.  Being I'm from Brooklyn, I don't visit this part of Staten Island that much, but now when I do, I will make sure to consider eating at this place again.  I already told my Lebanese friend about Laila and she was intrigued."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNlllWFZBEAE",
            "text": "The place looks fancy, the food was ok, they brought the food after 1 hour and the waiters were so lost they don’t know which order goes to which table, they kept asking us every single time they come with a dish.\nThe only thing I like is the drinks"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaM1piYjNRRRAB",
            "text": "Chicken Chops - $20\n\nThese chops were grilled to perfection! Soo delicious - 9/10.\n\nLaila also has amazing outdoor dining. Their heated set-up keeps you warm even in this freezing weather. They are currently offering a Valentine’s Day special so definitely check them out!\n\nFollow our insta: @nyc.halal for more halal food reviews!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzaE02ZmdBRRAB",
            "text": "The servers, kitchen chef & staff and owners are all Syrian . The owner is from Damascus and all their food is fresh, beautifully and lovingly made authentic  stlye....and artfully presented and I know.... I'm Syrian.  Do not miss this fabulous restaurant."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrMTRQbkd3EAE",
            "text": "Delicious food and excellent service.  Really happy that we have this kind of restaurant on the south shore now.  Quick edit - this place is BYOB!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzd0szaVlREAE",
            "text": "My favorite restaurant.  Real authentic food seasoned beautifully and perfectly cooked. Great atmosphere and very friendly staff.  Its a must try!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcFk3MWZBEAE",
            "text": "This is by far the BEST Shawerma i've ever had!! i've tried it in many places including Egypt and Lebanon, and this is by far the most delicious one i've had. My dining experience at Laila Restaurant was truly exceptional. From the moment we entered, the welcoming atmosphere and attentive staff made us feel right at home."
        }
    ],
    "reviews_count": 64
}