{
    "name": "Coral Bay Cafe",
    "place_id": "ChIJ8Zcs173Kw4kRbIjQkXWb_48",
    "grid": "SI3",
    "address": "722 Rockaway St, Staten Island, NY 10307, USA",
    "rating": 4.2,
    "user_ratings_total": 237,
    "phone_number": "(718) 356-3501",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMllWa3pTazFRV0ZSU1FtRk5jbTAzVjBWVlZVRRAB",
            "text": "Their on line men is outdated, prices not even close"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVk1FMVdZWGt5TFRsRFZYTnZXVVZJVm5kelVFRRAB",
            "text": "This place was SO good when I had Xmas dinner there in December. Yesterday.... it was DISGUSTING.\n\nI usually don't complain like this, but I went there for my birthday and it was absolutely dreadful.\n\nMy brother ordered linguine with clams in RED sauce. They gave him white sauce. OK no problem they take it back and fix it. Literally 4 mins later they bring out a plate and the sauce is ORANGE. Not RED... O-R-A-N-G-E. It looked gross and my brother was gagging just looking at it. He couldn't even eat it. It's as if they just poured red sauce over what was already there. There's no way they fired up a new plate of pasta in Literally 4 mins. And for the prices they charge, that is pretty embarrassing.\n\nMy mom's red sauce was also extremely hot and oily. Even my veal saltimbocca was not that good. Why they put a soft boiled egg on top is beyond me but it was just oily and not good. I was so disappointed. The only thing I enjoyed was my chocolate raspberry martini.\n\nThere was also NOBODY in there and the service still sucked. It's safe to say I will never waste my money here again. :("
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wb1FTMTZRbkJGU25sV1kwdEtZbGQxZG04M2QzYxAB",
            "text": "This was my first visit here and I’m blown away by how amazing the food and service was.  Kim was my server and she was absolutely sweet and knowledgeable. I got the filet mignon and penne vodka and it was to die for. Oh and I can’t forget about the Bloody Mary. It’s the best I’ve ever had. I highly recommend coming here. I promise you, you won’t be disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRU1YZG5hM3BYU1dKVFNYSnRVa0ZSWjJ4TE1YYxAB",
            "text": "Beautiful Restaurant by the water, food is amazing and the service was great."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NVpubFR3EAE",
            "text": "First time at this restaurant for my 36th Anniversary.  My husband and I could not believe the quality of food.  A very welcoming staff even sang to us.  Everything was just delicious.  I am very fussy with food but baked clams amazing.  Shrimp Oreganata just perfect and oysters for my husband.  Drinks and desert terrific!  Can’t say anything more.  So happy we found a great place to eat!  Thankyou for everything!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJNFltSkpSREZ0VWt4cGJFUmZiRjlNWmpkcFVtYxAB",
            "text": "Pricey. Food was good but too expensive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WM2JXOUpjVGRVWXpONFpVbzFTWEU0ZUhKSlJWRRAB",
            "text": "Food is is delicious waitress is old and slow and forgets everything"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214S1ZFZHFiREk0Y3pab2IydFdZa0U0VjBGeU1XYxAB",
            "text": "The food is excellent, the service was perfect, they are friendly and welcoming.  The drinks were perfect.  The owners are a husband and wife they are so nice.  You have to try this restaurant you won’t be sorry.  You will love it"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoajh6Tk13EAE",
            "text": "We had to sit outside because my cousin had the dog with them, but it was very good until the sun went down and the mosquitoes came out to feast on us.\nThe food was very good and the server,Kimberly, was so nice.\nAppetizers were the usual fried calamari, baked clams and cheese stuffed zucchini flowers. All very tasty.  Entrees of pasta with clams,shrimp and broccoli rabe, shrimp francese, clams over fusilli and my incredible pork chop parmigian that was the size of a tomahawk steak! We all enjoyed it and even took some home. Coral Bay Cafe was very good and I would return again, but definitely bring mosquito repellent if you're looking to dine \" AL fresco\""
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPYVR2NFRsaklPMHRRRRAB",
            "text": "A true hidden gem! The waterfront location is beautiful, and the calamari is the best I’ve ever had. Kymberly is an exceptional waitress—warm, attentive, and makes a fantastic espresso martini. She makes you feel like family. I love everything about this place—the food, the atmosphere, and the drinks (even if they’re a bit on the pricey side)."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcWExOWtNVEUyWVhkeGJFRk1VVVpCVEdFek5FRRAB",
            "text": "The food was amazing! But the service had something to be desired. We had to wait an hour for our entree. But it was really amazing 🤩! And it’s right off the beach."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQYl8ySTZNb196OG13RRAB",
            "text": "We went here for lunch on a beautiful day outside. Me my husband and my friend and her little girl. We went for lunch. We ordered two salads off the lunch menu with shrimp on them a heroe sandwich and and pasta for the baby with nothing on it not even butter. One virgin Pina colada and a beer.They charged me $13.95 for a half penne for a child with nothing on it. $19 for eight shrimp. And it took over an hour to get the food, they were having a party but this was simple food. I told the people never again and they just talked about inflation and they offered nothing to satisfy my anger about this bill. It was $126 for lunch for four people! $150 with tip. If you go there DO NOT 🚫 customize anything. They will nickel and dime you to death!!! Order AS IS only."
        },
        {
            "date": "7달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRenVxWURBEAE",
            "text": "커피 한잔을 구입해서 비치에서 마시기 좋은 카페입니다."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMThIS1BBEAE",
            "text": "Nice place by the water, our waitress was nice too. Appetizers were great but I got the stuffed rigatoni w steak and it was very bland."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNDRPbVhREAE",
            "text": "Great food, the service was excellent 👌 👍 no one in our party was disappointed."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzOXRiaFdnEAE",
            "text": "I’m a photographer and I was looking for a restaurant/Café with nice outdoor seating so I could do a quick branding session for an event planner. I just needed to take some photos of her working at the table and they were gracious enough to let me use the outdoor area while it was slow and rearrange the chairs and table how I wanted. Very nice staff and the restaurant and food was delicious. Not to mention it’s in a very nice area of Staten Island and it’s right on the beach so after you have your meal, you could take a walk on the beach."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeTVtMXpRRRAB",
            "text": "Had some unique appetizers. Everything was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OGJPVVJnEAE",
            "text": "The food, Chilean sea bass & Chicken scarpiello plus the cheese plate ap were excellent as was the service.  It was also nice to be able to sit outside. Would def return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieU9UY0x3EAE",
            "text": "Coral Bay! You will like it. I started with their Blue Point Oysters on the half shell. Excellent! They are my favorite oyster with a mild brine and traditionally served over ice with horse radish, tabasco, lemon, and cocktail sauce. Sorry I dove into them so quickly that there isn't a pic of them...lol My entrée was a combination platter of shrimp, filet of sole, and scallops all oreganata accompanied by a vegetable risotto. The oreganata had a slight bright lemony flavor that perfectly complimented the seafood. Superb."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNib2JtdnBBRRAB",
            "text": "Food & service was excellent.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNib1l2ZWxRRRAB",
            "text": "Everything was fantastic. Sat outside on a cool summer evening. The food was delicious and the service was great. I suggest making a reservation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyZ2VEbmZ3EAE",
            "text": "I found this place on Google maps and brought my fiancée one day to try it out. The weather was perfect to sit outside and we arrived before it got crowded. We had an amazing time. Our waitress was incredibly knowledgeable. Our food was delicious and our time spent was delightful. This place is a real gem, my fiancée and I have been telling everyone we know about it since."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOXVhbzFnRRAB",
            "text": "First time going to this restaurant after living on Staten Island for 19 years, what the hell took me so long lol food was phenomenal. Prices were average and service was exceptional."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMODh1czl3RRAB",
            "text": "Best hidden gem on the island. Food is ridiculously good, atmosphere is great and service was wonderful. It’s a little pricey but 100% worth it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHc01UVWVREAE",
            "text": "Ordered the fried soft shell crabs, after I asked if they were fresh or frozen. I was told they were fresh. If they were fresh, they unfortunately were spongy not crispy. I will go back and order try something else."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMazZMbTB3RRAB",
            "text": "My wife came to the restaurant for the first time. We are big seafood lovers. We ordered a cheese platter, clams on the half shell, seafood salad, and Scungilli over linguine in a red hot sauce. We shared everything. Everything was delicious. My wife felt that the clams were not fresh, but I disagreed with her. I thought the portion was a little small for the prices, but everything now a days cost a lot. The wine selection was adequate,  per glass, and bottle prices were a little high. The menu was huge a lot of choices. The dessert was very good, and Cappachino was so-so. Was surprised to see they did NOT charge you extra for using a credit card. That surprised me. Because every other restaurant does. I would definitely come back and other seafood items. Service was perfect, location perfect. No wait."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMZ3BxM1lREAE",
            "text": "One of the best seafood restaurants on the island!  Beautiful location, right on the water."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMLUktWnVRRRAB",
            "text": "Great atmosphere. Excellent food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dXFqTHJnRRAB",
            "text": "Zero complaints regarding food quality, service, and atmosphere. The coral bay shrimp is delicious, but be wary of the specials. They charged me $60 for a stuffed bone-in veal chop special. Stick to the menu."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNHVQN293RRAB",
            "text": "Have been to this place many times .. food service and atmosphere was always top notch ...update .... Still great food and atmosphere ..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbEp2TmVREAE",
            "text": "I love it!\nFood is YUMMY!\nKim is experienced and fun!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREd2JTMEJ3EAE",
            "text": "The very nice restaurant the food is very good. I think the staff was overwhelmed by the number of people that we brought with us very impromptu birthday party."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqck9ENmtBRRAB",
            "text": "Great food and ambiance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbkpmMWx3RRAB",
            "text": "We celebrated a birthday. Party of 10. Just ordered coffee appetizers and dinner specials. The cost was ridiculous and after we paid over 1400 dollars for a meal that was overpriced and overcooked one of us wanted a quick cup of coffee before we left and was charged 9.00 for it, not even a coffee on the house and when someone took their food home when they opened it it had the bones in it as well. Imagine they couldn’t even take it out. We were the only customers there and the service was slow. Never again going there again and we eat out a lot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bDhlS1NBEAE",
            "text": "Excellent food and service. The atmosphere is relaxed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5aThXcHl3RRAB",
            "text": "I love this place! It's a great local spot and the seafood is fabulous! Their chocolate covered cherry martini is delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcW96UE9REAE",
            "text": "Excellent food and service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeC1tcDBnRRAB",
            "text": "Lovely, hidden spot on the water at the end of a local neighborhood block.  Nice atmosphere, small with great service and drinks.  We all had the specials of the night. Seafood entrees and calamari. Very good   Parking lot. Valet on the weekends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscGZxOGdnRRAB",
            "text": "Our service was excellent.\nOur food was delicious\nWe felt like part of the family"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NnUtT2F3EAE",
            "text": "The food was delicious and the staff was so kind and welcoming"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLUxYU3BBRRAB",
            "text": "I recently had the pleasure of dining at Coral Bay Cafe, and I must say it was a great experience. The service was top-notch, with a friendly and attentive staff who went above and beyond to ensure our dining satisfaction.\n\nThe calamari was simply fantastic. It was cooked to perfection, crispy and golden. The oysters were fresh and delicious too. All the special appetizers were great. Thank you for a wonderful dinner."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxaDd2N2FnEAE",
            "text": "This is an exceptional location on the bay.  Surprising, romantic, amazingly tasty, cozy, not expensive for this level of cuisine.  It is so delicious that there are no words!  Cafe in a quiet residential area.  Good for dinner!  It is definitely worth a visit and you will definitely add it to your list of your favorite places!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNnRxeFFREAE",
            "text": "After being wiped out by hurricane Sandy Coral Bay is back and even more delicious!\nThe Fusilli with red clam sauce was excellent. Clams, garlic in a tasty tomato broth. The white clay sauce is equally delightful."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdFlXQ0lnEAE",
            "text": "I Love Coral Bay Cafe! One of my favorite restaurants on Staten Island!  Hidden gem by the water in Tottenville.  The food is top notch, and Maria is a real pleasure!  Best place to be with family and friends!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSZ3Ffb3ZnRRAB",
            "text": "My partner and I both ordered ravioli but they had just ran out of that so then we ordered something else. Had to wait atleast 45 mins for our food. Then when they finally brought out the food they brought me out someone else's plate the first. Our waitress was sweet. I think her name was Kimberly. When they brought the bill out they didn't bring out the correct one. Maybe it was a long day for the staff but I don't plan to come back here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeFplZkhBEAE",
            "text": "Hidden beach front restaurant in Staten Island, excellent authentic, italian cuisine . Food was delicious! Can't wait to come back in the warmer weather & dine during the day! Service was perfect. Dimly lit and love the atmosphere. Small…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxc2Q3Mi1BRRAB",
            "text": "Nice place\nWas sitting outside\nBut inside it is also great\nPrices are average\nFood was nice, but scallops were a little bit too salty\nService is great\nThe place has its own parking, if coming from Hylan just drive all the way to the end and turn right"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhMHZtcXNRRRAB",
            "text": "Very good food. The sangria was awesome!! Nice ambiance. Great service. Hidden gem. We will definitely be back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbU82MmlRRRAB",
            "text": "Great service, and rich seafood menu!\nWe enjoyed everything we ordered, the food was perfectly delicious!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxNEpDMVB3EAE",
            "text": "Very nice little spot by the water. I sat at the bar with a friend and ordered two Margarita's, a watermelon and Mango one. Steve, the bartender made the two of them perfectly. We also had an order of fried calamari that were made to…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpb3I3TGVnEAE",
            "text": "OMG had the best food ever Frutti di mare  was delicious best I ever had ,I had rack of lamb and my husband had the lasagna vodka sauce pork and beef  and raw clams everything was so fresh .the staff we're incredible and friendly .it's a…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2emVEOXpRRRAB",
            "text": "Very nice place with excellent food and fantastic service. I like the options of sitting at the bar or a table or outside. We started at the bar for a cocktail and dined at a table."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxczdMZXlBRRAB",
            "text": "I had a wonderful dinner at Coral Bay Cafe.  You won't be disappointed when ordering the Seafood Tower...it was delicious!!! Great service too.  Thank you Kimberly!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKa1BiTUF3EAE",
            "text": "What a great spot right off the water ,took my wife and son was such a relaxing atmosphere staff was very friendly. Food was just as good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdXFIU1dREAE",
            "text": "Coral Bay has been one of our favorites since we found them back in 2021. We decided to have our daughter’s baptism there and the staff went above and beyond   to ensure everything was absolutely perfect. The food is always on point and our…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bk1icEJREAE",
            "text": "The food was great. Kimberly and the service was even better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbE83SlFnEAE",
            "text": "Coral Bay is quite frankly one of the, if not the best restaurant on Staten Island. The quality, portions, and service you get when dining at Coral Bay are superior. The wait staff is courteous and very attentive always.  The location is…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1by1HZEN3EAE",
            "text": "Tonight, we dined at Coral Bay Cafe for the first time since it's rebirth. We were very satisfied and will be back. The staff was great, especially Paul and the food was really good. We opted to eat outside and enjoyed the sea breeze as well as an attentive staff. Keep up the good work, guys! We'll be back soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1b3ZhaklREAE",
            "text": "I have to say, if the food was beyond great, and the service better, I MIGHT drive from the bridge to his restaurant, But after waiting a good 40 minutes for appetizers and another 45 for the main, no way, The waitress seemed hurried and hassled by our normal requests, like my soda with the main course, and extra napkins. Food was good, but only if you are in the area."
        }
    ],
    "reviews_count": 59
}