{
    "name": "Mangia",
    "place_id": "ChIJJUytWpnKw4kR_4LxIThf9vc",
    "grid": "SI3",
    "address": "7517 Amboy Rd, Staten Island, NY 10307, USA",
    "rating": 4.6,
    "user_ratings_total": 232,
    "phone_number": "(718) 356-9300",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMVFXcGFZMnRLV0VOelYwZFFZVEE1WDNCUFgzYxAB",
            "text": "Excellent pizza abd very nice staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGR1FYWkZlV3N5VUVwS04xSlhZekZxYjFGTWFXYxAB",
            "text": "I went with several family members today.  They all raved about the fresh pasta dishes, bread, fish and desserts.  Everyone will be returning. Thank you, Pete, for the accommodating and friendly atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWlkxUmxXVVowUjA1b2EyOUJPVWhaY0hOVlkwRRAB",
            "text": "Just had an amazing lunch here. The gnocchi was amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORlVWTm1SazVaVEhKMWNFSkNhRzlrY0UxVWVIYxAB",
            "text": "I have had a lot of pizza in my life and hands down this place knows what they are doing when it comes to pizza. This is the best pizza I’ve had on the island. The onion and garlic square is to die for. You have a customer for life."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQloySllObk5UZFV4clgyUkJaamhuYzNoeFoxRRAB",
            "text": "THEIR SFINICIONE PIZZA IS OUT OF THIS WORLD!!!  It’s worth coming from NJ for it!   I also loved their sun-dried tomato and olive Sicilian!  The other slices I tried were all very good!  They excel at making Sicilian pizza!  I highly recommend Mangia in Staten Island!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbGNFeFdVblZ4ZW1KZlNGOWljSGcyY21jdE1tYxAB",
            "text": "Great restaurant, helpful friendly staff. Will definitely be going back here the next time we are on the island."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SlEwb3lOM1UxYldOc2IzbFdSRWs0UVVNME1YYxAB",
            "text": "Our first time there. The food was absolutely amazing! And they had gluten free pasta. Our waitress was so nice and very helpful. I highly recommend a visit when you're in town."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzNGMxOUhlRVZrUTFKcFNVa3hOR1pzYmtSUmMwRRAB",
            "text": "Fabulous place.  Food was outstanding, I had the lobster ravioli, and wanted to go back the next day to order again.  The bread plate before the meal was a highlight.  We were a table of 9, everyone was thrilled with their meal!  Wine and beer only. But don't let that stop you."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNWJtaFlSMmhpWDNSRFpHdFFVbXhwV0habWJsRRAB",
            "text": "Horrible listening skills my order was wrong.. food is trash. Will never order from there again…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJcnVoZC1EMjlQQ29RRRAB",
            "text": "My husband and I ate at Mangia the other day for lunch. It was delicious. My husband ordered the Filet of Sole Oreganata and I ordered the Fusilli all a Sandra (Pasta with Artichoke, sun dried tomatoes, olives, garlic and oil topped with toasted marinated breadcrumbs) Yum!\nThe Filet of Sole Oreganata, was also delicious I had a little piece of my husbands. Besides the food being great the owner Pete is also very welcoming. We enjoyed a cold corona with our lunch. I definitely recommend this place for lunch or dinner. I almost forgot they serve garlics knots and toasted bread with sauce instead of bread. You’ll see it in my pictures."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOejB3NGFGZ09yaU5nEAE",
            "text": "Everything literally is delicious fresh and authentic. If you chose not to make it yourself this might be the best alternative. Should be your first choice for take out or a quick dinner"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNVlTcm5BRRAB",
            "text": "Mangia is fantastic. This is real authentic Italian food. The owner and staff are remarkable. I grew up in Staten Island now live in NJ. Anytime I’m on the Island I stop here for some good eats. The pizza reminds me of old school Brooklyn pizza."
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLXF1RXl3RRAB",
            "text": "Non è solo pizzeria , ma anche e soprattutto ristorazione dentata da classici cibi italiani."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBanEtZ0Z3EAE",
            "text": "Mangia should give lessons to other pizzerias on how to make a real chicken parm sandwich. By far the best, by far"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdnR1MWZBEAE",
            "text": "Food is great, servers are wonderful!  It's a small restaurant, but packs a big punch!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eDUzVXRRRRAB",
            "text": "Ordered mozzerella sticks and pizza for lunch, for the kids and I; this afternoon.  The order arrived very quickly, was hot, and delicious! Pizza tastes like the pies made in Italy! So very good! Support this establishment; everything about this place is great! Mangia!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2c2F2dFN3EAE",
            "text": "Excellent quality and variety with even better service ! Highly recommended !"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwaWVXWGt3RRAB",
            "text": "Great pizza! and it's BYOB going to go back and try the specials!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNmJpNXlBRRAB",
            "text": "The chicken cutlet were too thick and rock hard.  The rice balls tasted like I was eating blocks of romano cheese and the margarita pizza went straight into the garbage. The tomato sauce had and overpowering taste of oregano and was bitter. Sometimes, less is best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bXBqdjl3RRAB",
            "text": "My family and I went last night to celebrate our father’s birthday. The service was great with very friendly staff that treated us like we were guests in their own home. The food was phenomenal to say the least! Very reasonably priced, and in a quaint little area in Staten Island. Definitely recommend!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdS1Dckh3EAE",
            "text": "Very good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM0lQNnl3RRAB",
            "text": "Pete is great Host !\nGreat food and really nice man."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOUozNmh3RRAB",
            "text": "The food was exceptional, service was great and very welcoming. I will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUM0lLN1pBEAE",
            "text": "Went here on sat before Mother’s Day with my family and we all loved it.  The menu wants this place apart.  They have pizza but this is not your typical pizzeria menu.  I’m an artichoke fan and Had stuffed artichoke as well as the muscles for apps and both amazing.  Spaghetti pie was really good and everyone loved their dinners.   Our serviced was so accommodating and she went out of her way to make sure we were taken care of.  I never write reviews but felt I had to give this place some love.  Go!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbVBIWmxnRRAB",
            "text": "Not only is the food delicious, this place gives back to the community constantly. Highly recommend ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb1A2RVlnEAE",
            "text": "I was invited to Mangia for Easter dinner. The server recommended apps were on point & so good.\nEveryone's meal was delicious!\nEggplant Parmigiano, Chicken Francaise, Veal Marsala, were great. I had lamb chops over spinach. I loved everything.\nEven the kids chicken fingers with French fries were handled with care. I have recommended Mangia to a few friends and they all have had similar experiences. I have been back since & go there on a regular basis now."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5eGZITnB3RRAB",
            "text": "Good food and service\nAnd affordable\nWhat else would you want......very clean"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdTQ3V05nEAE",
            "text": "The best!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0bzlLLU13EAE",
            "text": "Mangia is beyond delicious!! Their \"old fashioned\" slice has a delicious foccacia type crust. The sauce is homemade and makes every slice a mouth watering event. YOU NEED TO EAT HERE or have them deliver you'll be a fanatic like me 😋"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4czdlX093EAE",
            "text": "Mangia is a fantastic neighborhood restaurant.  Their old fashioned Sicilian pie is my favorite and I enjoy that the friendly restaurant staff and quiet atmosphere.\nThey have a varied menu and the restaurant service is attentive.  I also appreciate they are mindful of customers who need gluten free options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0bk5IV3dnRRAB",
            "text": "The pasta purses with the shrimp and spinach is amazing!  Actually, all the dishes are amazing!  I love that they serve you little pizzas on the house while you're waiting for your food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROX0tURmZREAE",
            "text": "Ordered from here a month ago to try someplace new. Been ordering from them since. Very happy with the shrimp FRA diavolo, shrimp Parm, artichokes. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxai11QTRnRRAB",
            "text": "Eggplant was good. Service was awesome."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxOW8ydGNREAE",
            "text": "How pizza should be"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbmVuc2RnEAE",
            "text": "Absolutely excellent inner City New York Italian pizzeria"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c1k3RHFRRRAB",
            "text": "Amazing food. The owners are so nice and attentive. They have a full dining room if you want to sit and dine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MU5UU0pBEAE",
            "text": "The staff was really polite and attentive. The pizza was delicious and unique. I loved the atmosphere of the dine-in area. This is a great place to try if you're in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbWYtdW1BRRAB",
            "text": "Decided to try them again ordered meatball parmesan hero excellent sauce and meatball I live one block away. Food came in less than 15 minutes meatballs barely warm but the taste was excellent I asked for ricotta cheese it was still cold the bread us excellent  and mozzarella just  melted and nit even hot. Food tastes excellent but not heated . Hot heros should be hot. Not room temperature.  Next time make sure the foods hot"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbWJPdUh3EAE",
            "text": "I never taste italian food typically italian.. amazing people, food and atomsphere.. highly recommended"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwa3NMTFhREAE",
            "text": "Best pizza in Tottenville!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aDQ3cnhBRRAB",
            "text": "Mangia, Mangia, Mangia just added to the rotation. New to the area and wanted to try this place out. Heard all the locals go there. And now i know why. Pizza fantastic. Service was perfect they played nice Italian music while we ate. Perfect on pricing. Heres some photos of our time here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURteExqSnBnRRAB",
            "text": "We catered food for our sons birthday. Everything was amazing! We ordered Chicken Marsala, Linguini w/ White Clam Sauce, Penne Vodka, Sautéed Spinach, Caesar Salad, pizza & a tray of garlic knots (the best). Everyone was raving about the…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2aU9yakp3EAE",
            "text": "Food was really good! And huge huge servings!  ❤️ you can even share!\nWaiter is very hospitable.. enjoying Italian music while eating! Mangia!\n\nAdditional info:\nMy 9 month old daughter was being fussy in the restaurant, the waiter gave her this ❤️ and she’s in love!  Very hospitable place indeed!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMXVIdHp3RRAB",
            "text": "Stopped here for a quick slice between games and let me tell you how good it was, I don't have pics of garlic knots but best Garlic Knots I have ever had, next time trying there pastas"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNjdMSmRnEAE",
            "text": "I'm 63 years old, born in NYC and I had never been to Tottenville on Staten Island before today. So I headed over there, and decided to try the pizza at Mangia. Clean place, looked like they have a good crew. The pizza was Crispy! The sauce luscious with an occasional hit of oregano. I had a Sensational Staten Island Summer Saturday."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndDZyNkxnEAE",
            "text": "The food is consistently excellent.  They have the best pasta e fagioli on the island.  Some of our other favorites include the mozzarella carrozza, pollo vincenza (chicken with spinach, mozzarella, and veggies in a white wine sauce), and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcUpQN0d3EAE",
            "text": "Real New York style Italian pizza. Big chunks of real sausage, real pepperoni and anchovies. So many fakes out there, it was great to finally have the real thing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M05XSUxnEAE",
            "text": "Ordered dinner for pick up on 6/3. Ordered Mussels in red and white sauce, fried calamari, chicken wings and a white pie.\nThe best in the neighborhood from everything we have tried. My dad loved the red sauce, Fried calamari was crispy. Food was hot at pick up, the boy at the counter was so nice!\nThank you for the great food and service!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwc2Q2SmZBEAE",
            "text": "Pizza is delicious all types I tried 4 love theml them all. Their vodka sauce is absolutely delicious. Will be going back again and again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1N0x2VjlnRRAB",
            "text": "Mangia is quickly becoming one of our favorite restaurants! The food is absolutely delicious, we haven't been disappointed with anything we've ordered so far! It's homemade and the portions are very large! The staff is friendly and the place is clean. Highly recommend"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURheUxPQzJBRRAB",
            "text": "By far one of the best Pizzeria/Italian eatery’s in all of Staten Island.  The food is always amazing and on point. Warm and friendly staff , clean and comfortable. Why does this place not have a Michelin Star?…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwb3F2RVRBEAE",
            "text": "Ordered their grandma pie and it was amazing. Just the right ratio of sauce and cheese. Crust was thin and crunchy. Best pizza in Tottenville. I also had their Grandpa pie, and wow if you like the Grandma pie you will really enjoy the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcEtmVTRRRRAB",
            "text": "I went to dinner with friends  and my fiancee..they love this place. I thought it was just ok...I had the stuffed artichoke which was cooked beautifully but eas not  seasoned enough. Then I ordered lasagna. So disapponted...the cook layered up sausage....I hardly tasted the pasta...no meat sauce and not enough cheese. They were kind enough to let me change my order. I then ordered a chicken Cesare salad which was very good. Their wait staff are very good which is why I said it was a four not a three.\nOverall...it is good...not great."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNFN3JYSER3EAE",
            "text": "Overall, my experiences at this restaurant have been positive. It is always consistently good food.\n\nIn MY experience-\n\nCons:\nVegetables can come a bit hard on the side of the entrees (but still tasty).\n\nCould (Wish) offer more gluten free, vegan or keto options.\n\nService is usually great but I’ve had some experiences that I’ve waited for refills/food.\n\nKid menu? Not sure if there is one\n\nPlain pizza is okay\n\nPros:\n\nSpecialty pizzas are terrific\n\nMenu has a wide variety of dishes\n\nFood is always fresh and tastes great.\n\nPortion size is large and perfect for price\n\nOverall amazing!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvaXQ3dFVBEAE",
            "text": "This review is strictly for the pizzeria alone, not the restaurant portion. The sauce is by far the best around the area. You can tell they don’t use the cheap sauce like other places near by do. Slices are small but pretty good. Overall, a pretty good place to order pizza"
        }
    ],
    "reviews_count": 55
}