{
    "name": "Patrizia's Of Tottenville",
    "place_id": "ChIJObgjtWi1w4kRt5lfENprOpI",
    "grid": "SI3",
    "address": "4916 Arthur Kill Rd, Staten Island, NY 10309, USA",
    "rating": 4.5,
    "user_ratings_total": 452,
    "phone_number": "(929) 744-1575",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aU1UxVjFSMDVtZDBoSlUydG5Sa05SWW5kWFdHYxAB",
            "text": "Had a party here recently and the food was amazing"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQ1luY3hNV0pLWjI1bFozcG9jMU0zTFdoMFdXYxAB",
            "text": "We had a great time during my birthday celebration today. It was our first visit to this Patrizia’s location and it did not disappoint. There are so many excellent choices on their substantial menu, it was hard to choose. The portions were fantastic, and the prices were reasonable. We ordered a large charcuterie board, appetizers which included an arugula salad, eggplant rollatini, shrimp cocktails, and main courses which included Filet mignon, Chicken francese , Rack of lamb, Crab cakes, and rigatoni with bolognese sauce. Everything was delicious. Similar to the other locations, there are so many delicious desserts to choose from. To top it all off, the service was outstanding. Keep up the good work!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSVVXODVVblZrVTBrNGEyTnhSM1JPZDBoWkxXYxAB",
            "text": "I was there today Oct 19 at 6 pm celebrating an anniversary with my family. It was rudely interrupted by the restaurant blasting happy birthday music to a child at another table. Have courtesy for other families who are dining at the restaurant who are also celebrating and want peace and quiet. I will never go back to this Dump. You ruined my quiet anniversary dinner. Disgusted and disappointed!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poS1dHTTJSbWM1YlY5d1ZXNHphRFk1UmtjNVUyYxAB",
            "text": "Slow service and burnt pizza that was barely edible, the Amboy Rd location is the only location I will go to from now on!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNME1HOXFkMWRQZG1obmIyODRTVU5rUzJsYWNFRRAB",
            "text": "Just want to say we had a beautiful anniversary celebration at patrizios of Tottenville! We met the owner Tommy what a sweat heart! Tommy and staff was so professional and so nice anything we needed they all were spot on! If I can give more than 5 stars I would…. The food was unbelievable delicious and everything fresh and huge portions! Best restaurant on Staten Island by far! We will be back that’s for sure….people your in for a treat high recommended to all!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTFJWWndUMUZUVVVSNWRYVmtkR1ppVERoVVlVRRAB",
            "text": "Patrizia’s OF Tottenville was Delicious Went in my daughter birthday on August 15, and we order family style was yummy food was fresh atmosphere was very good and the manager his\nAwesome forget his name my son also did small party for his son on June 7 , communion was same manager was  good I cannot  describe how good and delicious the food was ,\ngood job and good luck ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONFUycERiMDFYVG5oNFVHODFhSGhHZDNacE1sRRAB",
            "text": "Great food, great presentation and great service!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKd2NuTmthVFY0WkcxS2JFWk9PWEZDVTNCU1kwRRAB",
            "text": "Attended a birthday party so did not try all dishes but highlights were clams oregano, calamari, pasta with pistachio pesto sauce, lamb, steak, tiramasu. All delicious,  service excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MFRXZEdhVEZyYTBjdGRreENURWhrVjNKaFVuYxAB",
            "text": "We come for dinners, our business Christmas party yearly and special occasions large group dinners and celebrations. Tommy and staff are always the best. Professional , courteous and kind. Always go above and beyond for their patrons. Giacomo we thank and appreciate you for always treating us amazing!! The food and drinks far surpass their competitors! They never disappoint thank you for helping us host the perfect rehearsal dinner for our kids  see you all soon!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wd2MzSkhSVGxEZW1WT1FUZHpXRXRFTkc4d09WRRAB",
            "text": "It was a wonderful party and a great experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxekxYaFpPRXRJV2psNmNYZzVZazVSY2tKVmRtYxAB",
            "text": "Always a great experience. The food and staff are amazing. Highly recommended!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJellraDJiMEZoZFZkVGF6RjJOM2R3ZERsS1JFRRAB",
            "text": "Food was good but the service was lacking and bathroom was disgusting. I can't believe they allow it to look like that."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ZlpqTkxjVlUwTjJwMGFrbENTVlUyVDNWamFsRRAB",
            "text": "I just finally got my order from the tottenville location they told me a half an hr and it came after an hr and 45 minutes they gave me a discount but when I ate it the food was horrible the panini was not a panini it was a regular hero that was not toasted and the sandwich was dry same thing with the vodka plus the pizza was undercook and way too doughy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taR1NGTlBNMGM1Y0Zsa2FtSk5abWhHY0dzMFpGRRAB",
            "text": "We had my bridal shower here on Saturday. It was such a beautiful day, the food was amazing, the staff was on point and I had the best day. You can't go wrong with Patrizias.  Emanuelle goes above and beyond to make sure everything is perfect. I can't wait to come back, thank you guys again 🩷…"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdVBlQVl3EAE",
            "text": "Food gooood"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTFlucEZYelF4VlRKU1NqTnNibXR4ZGt0bGJVRRAB",
            "text": "EXCELLENT food and service, I couldn't recommend it more, best one on the island"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaVRXUTJSMmg2VnpaSFUxZENSRE5FY0Vob1ZuYxAB",
            "text": "I must say this place is a vibe. They train their waitstaff very well, not just to tend to their patrons, but to be very polite and kind and almost earn a bigger tip. They are all very sweet, whether or not it’s genuine it comes across like a respectful business. The food is pretty good, my only two critiques were the calamari is a lil rubbery tasting, not the first time but I try it every time I’m there and it’s soggy and chewy; the Lamb chops are over seasoned. The spicy tuna appetizers are a must try very good! My kids like the kids menu and that says a lot bc they’re very picky. The desserts are incredible, can’t go wrong. The drinks are great and overall ambiance is chill"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUVZWUjRNMnB6YzBvM09HdFlSSHBGV0dFNVFYYxAB",
            "text": "This is my third visit to Patrizia's and the third location.  I have been impressed by all of them. Each location has its own vibe and I really can't say that one is better than the other. It all depends on what you are looking for. For this dinner, we were looking for a quieter place so that we could have conversation. We had a 6 PM reservation on a Saturday and fortunately when we arrived the restaurant was not yet full. We were able to have a great conversation with each other and there were no difficulties in communicating with the staff.\n\nWithin about an hour or so additional parties started arriving. Of course the volume would go up simply because of the number of people speaking which was still manageable. Towards the end of our stay (almost 3 hours later) they started playing music which reminded us of 90s club music. The music itself was great, but the volume was a bit loud at which point conversation was difficult.\n\nI can't rave enough about the service and the food. They are extremely accommodating and engaging.  The head waiter made sure that everything is done to spec, and the multiple staff members who served us were always on point, friendly and made us feel welcome.  I'm very happy that we chose this location for our dinner.\n\nKeep up the good work, we want to be lifelong customers! 🩷"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aGNuWm9NRkJaUzNOb2FESlBWMHBDUVdkWlNGRRAB",
            "text": "Very Disappointing Experience\n\nMy husband and I came in for lunch.\nEverything came out painfully slow despite there being no other customers.\nWe waited over an HOUR just to get our pasta course!!\n\nThe food itself was a major letdown.\nThe\"special\" menu had unexpected Asian-inspired twists that didn't work for us at all.\nThe Beef Wellington was served in strange little money bag shapes - far from the classic presentation — and the zucchini roll was deep fried and honestly tasted terrible.\nWith such a long wait time in an empty restaurant and food that was more confusing than enjoyable, we left feeling extremely disappointed. Not what we expected at all."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wd1JXZGphSEoxYm5SemRETkJPVE13V1VSM1NIYxAB",
            "text": "If I could rate this establishment more than a five, I definitely would! We just had my mother‘s 75th surprise birthday party on Saturday and it was more than I expected!\nManny, who runs Patrizia’s, Not only made sure that everything was perfect that day, but also sat with me several times to go over a few things because I wanted to make sure that everything was perfect. He never made me feel like I was a nuisance and was always warm and welcoming, and just made the experience of planning so much easier!\nHe IS the star of the show at Patrizia’s and makes sure that every little and big detail are treated with importance.\nThe staff was amazing as well! They were on top of everything, at all times! Like I said, if I could give this establishment more than five stars, then I would!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbUQtNFBVenZlZnN3RRAB",
            "text": "My husband was there last night i haven’t went personally looking forward to visiting but overall i was told lovely environment"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbUNvZEdZa29tQnR3RRAB",
            "text": "Very good food, big portions!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOcUV5ZURnNzl1YjlRRRAB",
            "text": "Big portions served of gresh very good italian food, but i had to ask for the mozz cheese to be melted much more on my veal parm dinner & that took too long to come back out so i had to get up & remind waiter to check on it...then it came out promptly & there were only 2 other diners in the place other than the 2 of us bc it was early.  Service needs to BE MORE ATTENTIVE."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLdWtrUEN4LXBMazFRRRAB",
            "text": "Everything was amazing the vibe and scenery was beautiful me and my girlfriend had Adnan as our waiter he’s the goat extremely professional , made us feel at home definitely will be going back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQRHZoNlNaN3FiZEdnEAE",
            "text": "The food is consistently amazing. The service is fast and good. Especially the manager Emmanuel who ensured our dinner party was a success."
        },
        {
            "date": "5달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJM0VtZWJfNGFMX3R3RRAB",
            "text": "Patrizia’s  of tottenville"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNU0Y2ZTdudFptdEhREAE",
            "text": "The food is delicious and plentiful, the service is very good.  Ypu will love it"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPVy1zN2JNeGVyYmRnEAE",
            "text": "we waited almost 20 mins for someone to even acknowledge us.. and that’s only cause I had to stop someone to notify them we were waiting to order.. the food could have tasted better.. we had the pre fixed and the only thing I liked out of all of it was the lobster balls.. we asked for a high chair never even brought one for us.. so we just asked for a regular chair for our 2 yr old daughter which was very upsetting.. will I go back maybe not.. but the atmosphere was nice the scenery was lovely.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbUszYXZmbzdHYzRnRRAB",
            "text": "We went to a graduation party and the food was incredible"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNlB5OFQ3M3ZfRlpnEAE",
            "text": "My wife and I recently just had our first born (4 month old) daughter's Christening/Baptism dinner here on Sunday April 27th, 2025 and it was nothing short of incredible from the food to the service and ambiance!!!!! Tommy and Matteo who helped conduct and put the Family event together for us did a phenomenal job of doing so and provided excellent hospitality throughout the whole dinner!!! They were very on top of things and we see how passionate they are about what they do by making sure everyone was enjoying the food and the services provided!! Our families raved about the dinner and we can't wait to have our next event there!!! 10/10 recommend to everyone!!!!! (Again some of the best food I ever had and our guests agreed as well)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaGV2blNnEAE",
            "text": "Huge thank you and shout out to Patrizia’s of Tottenville. We had my daughter’s communion there Saturday night. The food was absolutely delicious and endless! The service was even better. It was packed with parties and the staff did an incredible job with their service and attention.  Thank you Tommy and your guys for taking care of us!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaTVydmF3EAE",
            "text": "I've  couldn't  have asked  for a better  place  to celebrate  my wife's  birthday  .The Manager  Matteo made sure  all went well.\nHe and the staff  were very  attentive  towards  our needs .\nIn addition, the food  was delicious .\nI would  definitely  return."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvODdLUU13EAE",
            "text": "Food was delicious and service was great !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURva3RfYjBnRRAB",
            "text": "We live in Queens and have gone to the Maspeth location and it's nice. I'm from San Diego originally and in all 18 years I've lived here I've never gone to Staten Island but we started to venture over there this month.\n\nThis was my second time in Staten Island and we went here for Easter. It was understandably very busy and crowded but the service needs improvement.\n\nIt took me flagging down these waiters SO many times just to get our order in (10 minutes of sitting there with no water served and no order taken) and once our order was taken they did quickly bring out two of our kids' dishes and the appetizer but then the wait started.\n\nWe didn't even know WHO our server was or have anyone dedicated to our table. The organization for this day was not good. They really need a food runner and to assign these servers to table sections. My husband, older daughter and I were all waiting on our main entrees. It took over a half hour just to get my daughter's spaghetti and meatballs served and it took OVER ONE HOUR and me flagging MULTIPLE servers down (FOUR DIFFERENT ONES) for my husband and I to get our dishes.\n\nOne dish was Shrimp scampi and the other was chicken Francese. These are NOT hard dishes to make so there's really no excuse for that.\n\nWe did still tip a standard 20% and I was pretty understanding with the guys. I'll give it to them, those servers were racing around and hustling hard but the lack of follow up and it taking me FOUR servers and OVER an hour to get two fairly easy to cook pasta dishes was not acceptable.\n\nI'm still giving this place a solid 3 because the food quality was superb. Every single dish was fresh and delicious. I'd even given a little leeway for a long wait time on a holiday.... 30-40 minutes but 1h15m to receive two pasta dishes and nobody coming around for refills even once was not acceptable.\n\nThey gave us a nice slice of tiramasu at the end as an apology but being a small business owner myself and given the nature of this I'd say we should have at least been comped half off on our dishes ... (not the entire bill but at least ours for taking that long to get out).. or a little more."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdGFtWHNRRRAB",
            "text": "Superior service and atmosphere! Loved all the food and I highly recommend for any occasion or just a date night 🙂"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveVo3ZURBEAE",
            "text": "It is the third restaurant from Patricia’s restaurant group I have been dining in. Again and again we had a great experience. Lovely designed space, cosy and chic interior. White tablecloths, flowers, fabric table napkins make you feel like you’re having a special occasion dine in.\nDishes are as always delicious. One of our guests even order the dish that was not on the menu and surprisingly she got it. The meatballs in sauce and toasts and ricotta on side was cooked as asked. Caesar Salad is just right. I recommend to try the fish fillets. One we ordered in pistachio crust with asparagus and homestyle fried potatoes on side and other was with delicious silky capers sauce. The capers sauce was little too salty but overall it was good to try something new. And if you are vegetarian I recommend to order pasta with eggplants and tomato sauce. On my taste it is too al dente but no other complaints. The menu on the website and in the restaurant has some discrepancies. Each Patricia’s location has their own chief’s signature dishes which generally keep you feel like not in a same place different location .\nI have to highlight the desert menu. Most of the restaurants have desserts that taste like they are coming from one place, very dull and similar. But here I was amazed by how delicious was homemade tiramisu complementary with cup of espresso.\nThe special word must be said about service. One our friend had a birthday on the day of our lunch and he was congratulated with the piece of cake with sparklers on house. It was very lovely and touching.\nGreat service, delightful food, stylish interior makes me come back again and again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdUx1RW9BRRAB",
            "text": "This place was amazing. The food was amazing the vibes were great and the music was also spectacular. Me and my friends came for a dinner to celebrate a birthday for a friend of ours. Our waiters Adnan and Henry were great they helped us through the whole menu explained everything we had questions for. They were super cool guys and great waiters. I will definitely be coming back!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbk55bjhRRRAB",
            "text": "Very loud but delicious food!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLVBITUxBEAE",
            "text": "Been to multiple Patricia’s in NJ but this was our first time in SI. We went for a private party but everything was so well organized and food was incredible. Staff was still friendly despite the craziness of the event. I asked for a special serving of steak (carnivore here) and the head waiter got me a plate. Bar staff also very friendly and served up shots with a smile. All along, a great experience. Will eat here again if I am back in SI."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJek5tU3BnRRAB",
            "text": "Henry was the best!!!! He was on point with the service and was very attentive to our needs…the restaurant was great …. He made us feel at home and did a great job !!  I’ll be back for sure …. I love this place !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeDQ2MVNBEAE",
            "text": "Food is excellent and very fresh.  Had a wonderful brunch, everything was exquisite.  The music was just a little too loud but, they did their best to accommodate us at a quiter table.  Totally enjoyed it, will recommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfM2UtRmtRRRAB",
            "text": "What a great place to celebrate my mom’s birthday. They offer a few menu options (standard menu, specials, 3 family style options). We went for one of the family style menus and it was well worth it. We got to try so much food and it was brought out to accommodate the number of people in our party. Food was as expected excellent. From the appetizers, salad, pastas, entrees, and dessert we were not disappointed. The hostess, servers and staff were so friendly and attentive.\n\nLocation is so easy to get to. Right over the Outer Bridge. It’s a modern looking Italian restaurant. Loved it and thank you for making my mom’s birthday dinner enjoyable and memorable. PS wish I took pictures of the food but we were too busy eating lol."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dXBDanhRRRAB",
            "text": "Amazing isn’t a good enough word to describe Lava. The food is beyond delicious and the service is super attentive. The atmosphere is great and perfect to bring a date or a family. I had the lobster the baked clams the steak and even though I was full I wanted more. So good I wants to lick my plate."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSLUpQY0xBEAE",
            "text": "The location is beautiful.  Valet parking on weekends and reservations are a must.  The food is pricey BUT welll, well worth it. The service is beyond amazing.  The ambiance is, for lack of a better term, perfect.  I am here for a Freestyle festival and the crowd is wonderful.  I definitely will be back.  This is a 6 star establishment"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxanMtRmJnEAE",
            "text": "What an amazing meal and a fantastic experience! The food was spot on and they service was prompt and polite. The atmosphere was fun and music was great. Very impressed with the entire experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNU9mckpREAE",
            "text": "I've been here a few times for dinner and drinks. I liked it enough to have a Sweet 16 dinner for my daughter last night. 38 guests, and all 38 loved the place. The restaurant itself is beautiful, the food is fantastic, and the service left absolutely nothing to be desired. Manuel worked with me from the first minute we spoke and always made sure we got what we aksed for and he kept all our guests happy. The wait staff was very friendly and attentive. I would recommend this spot to anyone for dinner or a party."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHc056SnlnRRAB",
            "text": "Great place to have dinner then break out into dancing after hours. The food is good and the ambiance is superb. I went with a group of friends for a birthday celebration and it was a blast. The staff and manager ensured the birthday girl felt celebrated. I will go back again. THANKS!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCenVfOHVnRRAB",
            "text": "Finally! A place that’ll make me feel like in Manhattan😍\n\nWe were taken care by 3 different waiters.\n\nService is great just wish one of the waiter understood what was truffle fries was😅 explained it in different ways lol but still I was told they don’t have it.\n\nWhen the other waiter so handsome btw!\nlol understood what I wanted without me even asking😆 Thank you!\n\nThe last waiter was also, accommodating.\n\nThe only thing I didn’t like about it was the take out was all in one tray literally even the sauce when it was served, it was separated see pic below.\n\nOtherwise, it’s a nice place and good food to go on a date and have fun!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMWJUU0pBEAE",
            "text": "This place is a true find. It's stunningly beautiful. The food is insanely good. I highly recommend trying the truffle balls. They have the most comfortable place in the world to sit in the back and smoke. They turn into a party at night after 10. I'd go here for dinner  ,a date, or a night out. Be aware that you're paying top dollar but for top quality service and food. The wine list was pretty good as well. Go here if you want to enjoy life and you have some extra cash!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHX0tISGZBEAE",
            "text": "An amazing brunch! Lava is definitely one of the best restaurants on Staten Island. Mario and the staff do a phenomenal job. The food, service and atmosphere are the best 👌 The DJ was a great touch!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4X3RXUWhRRRAB",
            "text": "My boyfriend and I came for happy hour and we were immediately impressed by the ambiance, absolutely beautiful! We were very pleased that the happy hour menu had a lot of food and drink options. Normally when you go to happy hour, you notice the portions are a lot smaller but we were very surprised to see normal/large portions for the food we ordered. We ordered the calamari, empanadas, and the steak taquitos and everything was delicious! Drinks were amazing and the service was excellent! We will definitely be returning!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQX3JIdlNREAE",
            "text": "In October I had my daughters first birthday party here and the entire experience from booking to the day of was so easy and seamless. The staff was great and Emanuele handled everything perfectly.  He reassured me if anything I had doubts on.  Space, ambiance and the food was exquisite. Everyone was raving about it. The quality of the food was top notch, authentic as was the restaurant itself.  We will be back for sure. And also we will be hoping to cater with them for outside events as well. I can’t express enough how we enjoyed the food and it’ll definitely be birthday we’ll always love looking back on. Thank you thank you 🙏🏻"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHMzVYR21nRRAB",
            "text": "Great food and attentive staff. Would highly recommend and can't wait to go back! Of the things we ordered, the mussels where my favorite!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwLWFHdjNBRRAB",
            "text": "Had a great birthday dinner with 7 girls. The music was great for a party dinner crowd. The short rib and martinis were incredible! Overall would plan another party here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtajViaHZRRRAB",
            "text": "My favorite spot in the area! The music is always lit, the food is always on point. You can't go wrong coming here. Server girls and management service is unbeatable. Thanks to Cristal for putting me on. 10/10 recommend."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybjRDN0VREAE",
            "text": "Finally a beautiful and fun place on Staten Island! The food is delicious, the drinks are fantastic. Perfect for any celebration or just to hang out with your buddies here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MHFYY0RREAE",
            "text": "Saturday night, packed and reserved in advance. The food was terrific, the service not bad,  they were to busy and focus on the parties around, more then focusing in single tables."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsa1B5bTR3RRAB",
            "text": "I recently visited this spot one evening, motivated by the fact that a DJ friend of my colleague was performing there. The venue, located at Staten Island's southern tip, offered a fantastic atmosphere. For those familiar with Staten Island, the vibe of the place might resonate well. The aesthetic was appealing, with bartenders and staff that added to the overall great experience. My only gripe was the early closing time at 2:00 AM, as I was not quite ready to end my night. Despite this, I had an epic time. For anyone keen to explore new scenes on the island, this place is definitely worth a visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYc3RYOExnEAE",
            "text": "It was EXCEPTIONAL all around!  We had our daughter’s birthday party there, 22 young teenagers and a half dozen adults.  The staff came over to us once we arrived to introduce themselves to us.  The enclosed patio was the perfect set up for our group.  The food was delicious, decor and ambiance was warm and welcoming, and the staff was SUPER!  We had never had anything other than fantastic before when it was Lava, but this time they went above and beyond.  Every kid went home smiling, full of delicious food, and telling their parents how much of a “blast of a time” they had. Thank you."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2amY2SGhRRRAB",
            "text": "Came by last night with a group of 10 women and we decided on family style.  The delicious Italian cuisine just keeps coming until you explode from every delicious bite. Some of what we loved: caprese salad, pizza, rice balls, pasta, steak, chicken, dessert, sangria, wine.  The service was outstanding.  Be prepared for a loud evening of happy tables, lots of celebration and a general great time.\nOh, the decor was outstanding.  We took tons of photos and made some lasting memories.  Highly recommend and loved that we weren’t rushed out!"
        }
    ],
    "reviews_count": 60
}