{
    "name": "DiVino Pizzeria Restaurant",
    "place_id": "ChIJ8S1cMoFnwokRvfkSNGyt_6w",
    "grid": "QN10",
    "address": "164-02 Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.4,
    "user_ratings_total": 1038,
    "phone_number": "(718) 738-2005",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bVNGcGtWMWhZTmtwdVlqaE1ZVzlOYlZSU01rRRAB",
            "text": "Got chicken Parm and pasta that was so over cooked it was like mush . The chicken was so over cooking dried out wasn't fresh and drowned in tomato sauce and so was the pasta  horrible would never get food from them ever again ."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsd1ZqVnlNRkEwVjNvMGJUVTFjSFF5VkVReExXYxAB",
            "text": "Best bbq chicken slice ever!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tab1VVMU9iRTgxVFVWaWNYbHpVWGswV1Y5eWFWRRAB",
            "text": "Did a delivery , front lady completely messed up my order , gave me extra things , and I even told her to repeat the order , she still got it wrong , I don’t understand…."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVk1sZEliV3RZZWtKMVMydGZSREJ0UzBGUE5tYxAB",
            "text": "The food was delicious and the staff treated us like family. We will absolutely be back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MmRYQjBaalJaUW5Oc1dHUXhiVUZDTTFodFoyYxAB",
            "text": "Really good paninis."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSmNtUmplVGxwYVc5aGFXYzRVRlZETkhVdFJuYxAB",
            "text": "it's literally pizza heaven.."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUU56SllRbFkzTkRSSWVrRk1iR3AxUVVkQ1MzYxAB",
            "text": "I came in tonight with the weather being bad and I decided it would be better for me to get something hot and quick. I went into Divino’s, just like I usually do and the service was quick as always. Warm and welcoming atmosphere and the customer service is great. But anyways I went in to order an I was offered a free slice of pizza, it was amazing. I was so surprised and taken back. I said yes anyways. It can’t get any better than this. Divino’s is the best in the neighborhood, I’ll be coming back soon."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVdGFUQlZOazVIVGxKb1NVWXlWR3g0TW5wNFNFRRAB",
            "text": "Such a solid local spot. Food is so reliable and big portions! Love how they always have creative pizza slices. The staff really makes you feel like family!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVlltczJXbFZPYkVsTFZHSmpOR1JRTldWeFduYxAB",
            "text": "Delicious & fresh food, courtesy staff, and relaxed setting for a sit down meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SWNtWnZhV3BYYURKeldYQmhkRkZ0UkdoUVQzYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nWe absolutely love Divino’s! The food is always amazing – especially the Chicken Divino, our favorite dish. 🍽️ Not only is this a wonderful restaurant with great food and service, but we also feel so lucky to have them as our lovely neighbors. 💕"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNVA3eUJBEAE",
            "text": "A must go!  Does not disappoint"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ablIxWnVOWFUyT0U1RWFqVm5hV2swUmw5TlUwRRAB",
            "text": "Hi i was so disappointed  ..I had company over they wanted pizza  so I order from the best DiVino...was so disappointed 😞..we order LG. Pie wish it was so cold and dry..the salmon  was good  and the"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kR1NHWjNZa1ZaTm14a2RHdENiMEYwU0hCYVEzYxAB",
            "text": "The best pizza!!! Everything tastes fresh and like made with high quality ingredients. The dough is both soft, thick, & crispy at the same time, with sweet tomato sauce, cheese and fresh garlic. The garlic knots & chicken rolls are amazing as well."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOHBqckpBEAE",
            "text": "As a native New Yorker who has traveled the country and eaten pizza all over the US, this is hands down one of the best slices I've ever had in my life. The staff is absolutely awesome too.\n\nEdit: place is still absolutely awesome!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNWEySTJTVTR3WW1GV2EwcEJlbWN3UjJaaWRFRRAB",
            "text": "Ordered a large pie extra cheese,,,,,,,,,,got a regular pie bottom burned and I paid over 30 dollars....never again before leaving i asked is this my order showing?  The pizza box was open,  I ordered extra cheese ......the elderly man shrugged his shoulders and walked away....seriously I over paid for a regular pie....not returning anymore!!!....sovraccaricato"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMlJuSXdkRk10V21ORVEybDBVV1EzY1dSSGQwRRAB",
            "text": "Best pizza in Howard Beach"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poZmJHSnBPVXhJYjFCRWJHaHFNSFZqZEVkMmFGRRAB",
            "text": "Very good place to go if you want real pizza from New York City and a good atmosphere.The staff are very respectful and experienced.And this is what you want when you walk into a nice pizzeria.Or restaurant with a good setting.I could recommend this place to everybody.It's a real good place to go especially if you have a small family or a big family"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKR1duSktabFI0VTBOVFpWa3RORkYxZGw4eloxRRAB",
            "text": "Went right before our flight at JFK. Very convenient location and delicious meal"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taV1ptWnBjMmgwTUhVeWIwRk1WRzB6ZVVwdFdVRRAB",
            "text": "Excellent"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzOXRXMTlRRRAB",
            "text": "Busy, loud and great food. What else do you want.  The portions are for one serving at the restaurant and one for lunch the next day."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MVFWVm9kRTl5WjNSelMyNVJjM0Z1Uld0NVVuYxAB",
            "text": "They dont know the difference between a single or a double, Or do they?Leftover pizza from yesterday"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMFQwMHhPRXAyWlVOa055MTBhMEpsVjNKNVJVRRAB",
            "text": "What a place.  Always have loved their food but had our granddaughter 13 birthday there and didn’t disappoint.   Knew food would be great but service and atmosphere top notch.   Thank you so much.    Highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toV1VVWktRMWxTWDBvNFVHRm5VSFJwWjNCVmVFRRAB",
            "text": "Great pizza and good vibes"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbVYzaHVPVnBzVG1SUVoxWTFaRkJMV1dGcWFYYxAB",
            "text": "Top notch pizzeria. Kids had pizza/pasta and my chicken parm came out great!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaVQxSjJlR3d0VlU0dGIxSndZVlZtUTJreGFWRRAB",
            "text": "I think the food there used to be much better. Also, they used to do separate checks which they no longer do. The place is always very cold so if you like that, it’s very good."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMnVHQ2lBRRAB",
            "text": "This was my first time in 10 years,  and the food is off the hook, I can't wait to dine there next time I'm in the area."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYejdXNml3RRAB",
            "text": "Forget the more well known spots further north of here on Cross Bay Blvd.  This is a gem hidden from many people who don't frequent Cross Bay Blvd like a local.  These guys can make some delicious pizza, pasta and other Italian fare.  Walking inside and eyeing the food on display, including the specialty slices can be dangerous as you end up ordering way more than you intended.  I'll update this review soon."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKZjM2WjZ5NHZLaDdRRRAB",
            "text": "Pizza was excellent and very tasty. I’m coming back again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKbU45YjNDbVBlQXNnRRAB",
            "text": "Wow those garlic knots were tasty"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOUDU2WkdTek1XbV9nRRAB",
            "text": "I paid for 3 chicken Cesar salads. Ordered them correctly and was repeated back correctly. Only received regular Cesar salads and was told I didn’t order it that way. Will never order from them again as the girl Sarah was VERY RUDE"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VManZpdHIweUwzYUtREAE",
            "text": "Thank you, Divinos!!\nFood is always fresh & delicious .\nDelivery was exact & punctual!\n\nWe will be ordering from here again!\n\nThanks again!\nMonique"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwM2R1QTF3RRAB",
            "text": "Order Bake ziti it had too much salt and don't give no more bread and salad with it?"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQTFFuOFhaczd6Z0VREAE",
            "text": "Always leaves me looking forward to the next visit"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOLXlpcTN4M19xa0RnEAE",
            "text": "This place was very nice and welcoming fairly priced if going solo just bring 15 and you’ll be able get yourself a slice garlic knots and a drink\nAlso the bathrooms are amazing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNeXkxZlNTLWJtbWtRRRAB",
            "text": "Came here with reasonable expectations for a pizzeria restaurant and were blown away by both food and service. Surroundings are more typical but hardly offensive. Became abruptly overcrowded but progressively overwhelmed staff maintained their composure, which speaks volumes. All in all, a very pleasurable experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdmZMNnVBRRAB",
            "text": "If you’re looking for cozy vibes and classic Italian comfort, DiVino Pizzeria in Queens is the spot.\nTheir Pasta With Broccoli Rabe is served with crumbled sausage, sauteed in garlic and oil. This dish hits that perfect balance — sausage, broccoli rabe, and just the right amount of oil with garlic. Their wings and fried zucchini? Chef’s kiss.\nIt’s the kind of place where you feel like family the second you walk in — casual, welcoming, and full of old-school charm.\nPerfect for a laid-back night out when you’re craving real-deal Italian without the fuss.\nPro tip: Save room for dessert... you’ll thank me later.\n\n#QueensEats #PizzaLovers #ItalianFood #FoodieInTheBigApple2025 #DiVinoPizzeria #NYCFoodie #CozyEats"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoM2ZHZG1nRRAB",
            "text": "Both my wife and I have been coming here for quite some time. We were there this past Saturday night, and had to wait about five minutes to be seated. The place was packed wall-to-wall just further proof that my review is correct. The food is amazing, my steak was both seasoned and cooked perfectly. The staff were both attentive and courteous. The dessert was delicious. And Samantha was amazing and took care of us from the minute we walked in. Take it from a guy who eats everywhere, This place is a must try."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNHFuYVZnEAE",
            "text": "Very nice Pizza Shop dishing out some great Sicilian style slices, and some beautiful looking sandwiches in yet to try. Clean and spacious inside with a good amount of fresh options, would easily come back here."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNnNxbDVnRRAB",
            "text": "We usually get takeout as it’s more convenient for our lives. They have the best pizza in the area and their customer service is good. My family appreciates the quality and craftsmanship in the pizza options they offer. I myself am a chicken parmigiana fan so its my go to every time. Recently, though we have noticed a difference in the pizza dough. Not sure if they’ve changed the recipe but its has made us sick. Nonetheless, its not something we like thus we’ve slowed down on our takeout."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeHZQNFlBEAE",
            "text": "It’s a very nice Italian restaurant across from Launch the trampoline park. The food and ambience is great. The portions are ample with reasonable prices. They have both dine-in and take-out. It was my son’s birthday and they let us cut a cake brought from outside for his party."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMDlQNWZBEAE",
            "text": "From the bread that they first serve you to the dessert this place is top notch.  .  We had the baked clams and they were so fresh and tasty.   I had the chicken sorrentino with broccoli rabe.   The portions are super generous.  Had to take the other half home.  My husband had filet of sole francese with capellini.   The marinara is perfect.   I tried to pass on dessert but I couldn’t resist the rainbow cookie cheesecake.   Fresh and delicious.   The drink had a nice kick and the sangria super delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN0xPdFVBEAE",
            "text": "I stopped in here immediately after arriving from Virginia.  The restaurant was neat and clean.  The service was impeccable.  The pizza was top notch delicious.\nThe reason for the 4-star review was solely because there was only one available restroom.  One restroom had a tacky, hand-written sign saying the restroom was out of service.  This left only one available restroom, and despite waiting for 10 minutes, nobody came out of the single bathroom.\nFix the bathroom because I never got to go pee."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdlppdTJFeFlPd0lnEAE",
            "text": "Amazing food quality and wide variety of Italian fare ! Great place to grab a bite during lunch!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwaU9pTnpnRRAB",
            "text": "Excellent food and great prices. So far we have tried a good amount of their menu: the pasta with vodka sauce, grandma pie, Sicilian pie, chicken parm, buffalo chicken pie, and salads. All very delicious and I love that they have many pie…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdjlmdHJ3RRAB",
            "text": "Ordered  a $23 sandwich asked for balsamic glaze on the side and this is what I get like are your for real I thought it might have dripped but The bag was completely dry"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzd3NmRE9BEAE",
            "text": "They are all very pleasant in here .\nThe pizza is also super good .\n\nThey also make great drinks ."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdFB6WHVBRRAB",
            "text": "The food is good and the staff is friendly. This is a good family restaurant. The parking is an issue since there is no parking lot. You will probably have to park in one of the side streets."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMybnNYVEt3EAE",
            "text": "The food and service was outstanding. The entire staff was extremely sweet and pleasant 💜 can’t wait to try more of their menu!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlb3ZuMlBREAE",
            "text": "Ridiculously overpriced at  $3.75.\nNice thin crust.\nChewy, with  crisp edge.\nGood balance of  cheese and sauce.\nNothing notably Italian about the flavor, in fact seems more Spanish seasoned.\nI'll give it an 89."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMzV2SHJ3RRAB",
            "text": "The food here is so gooooddd! From the bread they put on the table when you first arrive, DELICIOUS! To the dessert, chefs kiss! The rainbow cookie cheesecake is a must try! The staff was very attentive and friendly. Charlie was I serve, must ask for him when you come. Wish I took pictures of the food. We’ll be back"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcUp1NnNBRRAB",
            "text": "A place where you can have a real Italian experience.  The food is great, the service is excellent. And I know some people that know some people, so I've got an in (jstkddg).…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2emNPSVVREAE",
            "text": "We ate here few times already, food and portions are good and the atmosphere and the layout of the place is welcoming. Service is good, the only thing that we don't like it too much but understand some people after few glasses of wine 🍷 get a little too loud.…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJajlyd293RRAB",
            "text": "Tried DiVino Pizzeria and was seriously disappointed. pizza was just bad — soggy crust, bland sauce, and overall no flavor. To make things worse, staff had a rude attitude like they couldn’t be bothered. With so many better options in Queens (like New Park Pizza), I won’t be coming back here. Divinio is a disgrace"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNTgzQTlBRRAB",
            "text": "The best pizza we've found nearby, albeit expensive. The salad slice is good. We get regular pies there often. Their sausage roll is huge and delicious. We usually get their Ceasar salad dressing to go."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeEllZ1JREAE",
            "text": "Amazing spot, with some amazing pizza! I love coming here with my girlfriend for some lunch! Staff is really friendly and environment is clean and well kept."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdTVMOVJ3EAE",
            "text": "We order quite regularly from another restaurant, but we were recommended to try Davinos, and we were SO IMPRESSED! The food was delicious and the presentation of how clean everything arrived was impressive! Thank you for tackling such a…"
        }
    ],
    "reviews_count": 56
}