{
    "name": "Kandela",
    "place_id": "ChIJa37SicJdwokRqjnreDPpkgY",
    "grid": "QN10",
    "address": "150-03 Cross Bay Blvd, Ozone Park, NY 11417, USA",
    "rating": 4,
    "user_ratings_total": 1218,
    "phone_number": "(718) 659-0262",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STWFtZFZiV0ZMVWxkQmRuQnVOVFZZT0U4MFVrRRAB",
            "text": "The food is delicious and authentic and the service is even better Fabian made it feel like I was at home. Highly recommend and will definitely return."
        },
        {
            "date": "수정일: 5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NUtYcXdBRRAB",
            "text": "Loved the music, food and atmosphere.  Felt like I was on vacation and not in Queens.  A lovely getaway right in the neighborhood."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVM016ZGZORXhYUjFkNWVGaExkbGgyYm1KellVRRAB",
            "text": "Food is pretty good but music is so loud (mostly on weekends) you can barely hear person next to you."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREN2ZUaExBEAE",
            "text": "Came here with my spouse, and our 4 and 5yr olds. The food was absolutely delicious. We had the calamari, queso fundido and guacamole as appetizers and the quesadilla, shrimp steak and chicken fajitas and the Maji Maji tacos for our entres. Other than the Maji Maji tacos being greasy, everything was amazing and seasoned to perfection. We also had a pitcher of classic mojito, which allowed for countless glasses and took two desserts to go. We will absolutely be returning as this is a quality local family friendly spot! The final bill was $250 with gratuity included."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sa2MyMVZNa3B3WW5FM2FGOVBPRTE2VmxnNU1tYxAB",
            "text": "I actually love the food here so much and eat here all the time, but I probably won't be coming back. Was charged 13 for a margarita and a woman next to me was told \"it's ladies night 7 dollar drinks\" this isn't a club.. it's a resturaunt that's honestly messed up. How is that even fair?"
        },
        {
            "date": "수정일: 3주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQmExWkxXVGhhZW1ob2FtZE9ZamhwYkV0MFIyYxAB",
            "text": "Deberían entrenar mejor las meseras nuevas\nMi esposo yo hemos sido clientes recurrentes por un buen tiempo, hasta ahora no teníamos ninguna queja, fuimos con una amiga que recién llegaba de nuestro país y la llevamos a comer, pedimos de entrada un guacamole con chips  ( algo que estábamos acostumbrados a pedir) y unos tragos y jugos, nos atendió alguien que vimos por primera vez y cuando esa entrada por fin llegó  estaba demasiado picante, no lo podíamos comer y eso que no habíamos almorzado y teníamos mucha hambre, le dijimos a la mesera lo que pasaba y como que le daba igual y dijo que así es que siempre lo hacer (lo cual no es cierto porque sino simplemente no lo hubiéramos ordenado) y dijo que iba a hablar con el manager, el manager nunca llegó, la chica nunca nos vino a tomar la orden del plato fuerte a pesar de que ya llevábamos en el lugar bastante tiempo tratando de no darle importancia a lo ocurrido, por primera vez nos sentimos ignorados y encima avergonzados con nuestra amiga ya que le habíamos hablado maravillas del lugar pedimos la cuenta  y al segundo nos la trajo sin mostrar ningún interés de absolutamente nada, nos pareció raro que el manager nunca  vino aún cuando ella supuestamente habló con el, pero nos sentimos tan mal que ya no queríamos comer y decidimos pedir la cuenta sin hacer ningún reclamo por la entrada que no pudimos comer, dejamos propina  y nos fuimos a otro lugar."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aakxUQTRkRFpmUzI1cFJWTm9Ra2RIYlhseGJYYxAB",
            "text": "The great after work, hang on spots.Great brunch spot to catch up with loved ones and friends"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMmNVTnNkemROTTNGNlptRklOMWxVVXpodmFGRRAB",
            "text": "Wish they had booths. The food was great and so was the service. But our “neighbors “ were very loud and annoying."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeE5XOXpTVmRMVldwSlEybHVWbkZHVHpCMWVFRRAB",
            "text": "When here in a  random pick and was so happy I chose them love the food the atmosphere the music 🎶 Me and My loves enjoyed every bite ....Highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNGJtOW9RVU5hWm0weFlWOVZObVpST0VwZlZsRRAB",
            "text": "We’ve been wanting to check this place out and went there straight from the airport after a long trip with our fully trained service dog. We were hungry and tired as hell and just wanted to get something to eat before we drove the rest of the way home. They kept asking us for our certification (which does not exist). Despite explaining the law and the fact those online certifications are nothing more than a receipt for how much you paid to get it, the owner they gave us so much trouble, that I had to leave. And when my partner went back in to order food to go, the prices were not as advertised, and the food was salty as hell. For the record, “there is no service dog certification in the U.S. under the Americans with Disabilities Act (ADA); the federal government does not recognize any certification or registration documents, even those from private organizations.” The business is only allowed to ask two questions: “is the dog a service dog required because of a disability” and “what work or task has the dog been trained to perform” If the dog does not behave as a service dog should in public, then and only then can they ask you to leave.\nMay it be a learning lesson to them all.✌🏽"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeU5ITkJSM2hoTTIxSlgzQmplVkJyTVRKek1XYxAB",
            "text": "Natalia is a great server."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rd1N6QlBWa2hMV1doNFYxZzNlVVp2ZW05MlNYYxAB",
            "text": "Great service, delicious food and drink and cool place to hang with some friends."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWS1ZYZHlObFUzYVhseVgwTlFaMWhxVDFCTmFFRRAB",
            "text": "Prefect place to enjoy Mexican food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRFVYbG5kV0l3Tm1VeVp6SkdSVzFQWkZkMlNuYxAB",
            "text": "My wife and I have been to this restaurant many times. Now, I find the need to post a review. FANTASTIC! I don't post many reviews, but this one is necessary. The food, the atmosphere, the service and the dessert were all great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNWVUVXpabGhxT1RSNVFWWnVUVzVRVVRaVE9IYxAB",
            "text": "I live in Brooklyn,  but was in the area walking after a Spa appointment and came across Kandela! What a great spot! The food was good, drinks were good...also pretty...and the service from Camilla was excellent! Juan makes some mean drinks at the bar too! I was really happy I found this place and will definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSVVsZFpSME4wV0VaeU1uWnZRVGwxVG1kZmQxRRAB",
            "text": "Muy buen servicio y buena calidad de comida"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MGRrbG9iVWRrZEd4UVNEbEVOVmRPV2xab2FYYxAB",
            "text": "Gone for dinner with some family and everything was awesome.\nLoved the birria tacos with the consome sauce.\nDefinitely coming back soon"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSFZESlRkVkpuT0RSRlVUSk5SbkZtWlRGV2NGRRAB",
            "text": "This place used to be okay. Now it’s just terrible. The music is always so loud you can’t have a conversation with anyone. Even the hostess was struggling to hear what I was trying to say. Then I ordered salmon & mash potatoes.. this is…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcFptaEVPRUl5T1hkbVgwOUNSV3Q2Tms5Q2EwRRAB",
            "text": "Me and my sister have been to Kandela a couple of times, but this visit was by far the worst experience, especially in terms of customer service.\n\nWhen we walked in, the lady at the front desk had a huge attitude, as if we had done something wrong. She seated us without a word and walked away. To start, we ordered nachos as an appetizer. I ordered a chicken burrito, and my sister ordered a salmon burger cooked well-done. The waiter didn’t take notes—she just nodded while listening, making faces, and carrying a standoffish attitude.\n\nWe waited about 20 minutes for the nachos to arrive, and then another 20 minutes for the main course. When the food finally came, the waiter placed my burrito down and gave my sister a quesadilla—which she never ordered. We immediately told her that it wasn’t ours and that my sister had ordered a salmon burger. Instead of fixing the mistake, the waiter shoved the plate in front of my sister.\n\nAfter a few minutes, she came back with a Mexican burger. We told her again that this wasn’t our order. Her response was, “Yes, you did,” while shoving the plate toward my sister’s face—twice. We refused the food, and she walked away only to gossip about us with her coworkers, which was extremely unprofessional.\n\nEventually, a lady from the back came out and asked if we wanted to wait another 25 minutes for the salmon burger. At this point, the waiter’s mistake had already cost us too much time. To make matters worse, she continued walking by with smirks and laughter, which felt very disrespectful.\n\nIn my opinion, this server needs more training and must learn how to act professionally with customers. This was the most disappointing experience we’ve had at Kandela."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdmVraE5OREp1ZG5CQ1RsVmtUSEIxUm5SSFgwRRAB",
            "text": "Servers can’t get a order right bring wrong orders out multiple time then gaslight you in to thinking you don’t order what you said worst experience ever no one go here"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OV1pEQmtkME56VGsxMWRVWlRXWE5zWjJwUmRuYxAB",
            "text": "Beast enchiladas verse and margaritas in NYC (says former Texan). Great lunch special."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXOE5MODl3RRAB",
            "text": "Great atmosphere.  Great food.  Hailey our waitress was  fantastic and attentive"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oR1dIRXpOM1E1UmtWd2JIbFNTWGxEVkhZNGNuYxAB",
            "text": "I’ve been waiting 40 minutes for food and now he saids I can’t speak to manager there’s no apology nothing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeFdVZGFSVTQxWTNkMmNERnZWbUpxUWs5d1dXYxAB",
            "text": "What a fabulous spot! The food was fresh and delicious. The service was very attentive. We came a Wednesday afternoon around 5ish and enjoyed their fabulous happy hour deals. Margaritas were amazing as were their chicken nachos to start. I had quesdillas al pastor, my husband had the steak burrito and we shared carnitas tacos. We over indulged but enjoyed every bite (& a bit to go). Would recommend to all who enjoy Mexican food and get ambiance."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNE1WRjRlSEZmUmt4elNVVlJla0ZFWDBwUmMyYxAB",
            "text": "Very great spot I love going over with my father and brother enjoying the good food and vibes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbmIxODVTQzAzU1doaVkwZHlWVFpuTFROQ1lsRRAB",
            "text": "No AC in July??? Are you kidding me? Owners shame on you! Especially for your employees and secondly your clients!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVWJHdzBhRkJoYkd4SGRYaHZjVVJmY2xOS2QwRRAB",
            "text": "Awesome food and good service and an awesome staff. 👌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdVlqQmlRbUV4UTBKWFNESlBTRWhwV1c1MlRIYxAB",
            "text": "Came to eat, had a steak quesadilla and yes it was tasting good till I saw plastic in my quesadilla! Not even a sorry smh please elaborate on how in the hell you can run a business like this! Like ok things happen but isn’t it your job to make sure nothing gets in the food and if something happens wouldn’t you at least say sorry!!!! Smfh"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWclZqZFdVV2xXY2pGSFEyRm5ZUzFYT0ROSFUzYxAB",
            "text": "The staff is super welcoming. Especially if you sit at the bar. The Food tastes good just a little pricey but that's how it is everywhere nowadays. Their margaritas are so good and effective. Ha ha.\nSometimes the music is a tad bit too loud where you can't really chat with people.\nPlace is clean."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcGVpelVnEAE",
            "text": "Everything was nice down to the food but the music was loud wouldn't recommend for a date"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJM2NUbFRXRFIzV1RkWGVGVmxkWGc0U0ZWcVZsRRAB",
            "text": "Service and atmosphere was great. Food was ok. If im gonna pay $25 for a burrito atleast lemme get a good amount of steak inside and some real parmesan cheese on top. Would go again and try more options on the menu"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCYVZuQkhWbXBGZVdwNVRrWklhelJIZW1wdE5VRRAB",
            "text": "Love this place Food and drinks are amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQcUNwdnIzMko2UVRREAE",
            "text": "I’ve honestly lost count of how many times I’ve been to Kandela, and they’ve never disappointed! From the moment you walk in, you’re greeted by friendly staff and a beautiful ambiance. The drinks are amazing, the food is absolutely delicious, and I love the music and the overall atmosphere—it’s all definitely worth the price. If you’re in Queens and looking for good vibes, a chill atmosphere, and mouthwatering food and drinks, I highly recommend checking out Kandela."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKSGowTjdkbXJPcmtBRRAB",
            "text": "The Whole Staff was Beautiful ❤️🤩🫶🏽. The Food was Fresh Hot and tasty 😋 My Margarita, I had to and was Good 🍹🍹"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOTFAzTUNtcXRIREdREAE",
            "text": "Next level Mexican cuisine...drinks are incredible also"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKdnozNWY2X05iMWxBRRAB",
            "text": "Music was stupid loud. Service was slow, and food was overpriced ($17 for a small bowl of guacamole, chips and salsa). Birria tacos and Baja tacos were good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLREc5OXZXa1lXalpREAE",
            "text": "So I went today after I had a bad experience with the manager last month because my husband really wanted to go but I should have gone with my gut feeling.the manager has the nerve to point her finger at me and tell me to make sure that I control my 1 year old the nerve of this lady to tell me to control my 1 year old and was nasty about it I will never step foot in there and I will gladly pass this message on to my friends about the rude and unprofessional manager. She doesn’t know how to speak to people"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLSDlqYnU4eHFpdmxnRRAB",
            "text": "Food is good, friendly staff, fast service, parking is hard to find. The music is too loud."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJSGF2Y3VwcVBhczBRRRAB",
            "text": "I’ve been there quite few times. Service is alright, food is decent.  But today this Spanish guy that serve us was a little “too funny”. We asked for a dish and he answered with “ but this other dish is cheaper” with a laugh at the end, to me was very unpleasant. If I go to a restaurant they supposed to serve me because I’m gonna pay for it, I’m not asking for opinions."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQM1JuUDdmaGRUY2R3EAE",
            "text": "I went for the first time last week. Good crowd, good service. Good food I would go back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbU54YUhPd05lUThnRRAB",
            "text": "Came for dinner the day before mothers day, the food was delicious,  our waitress was very nice and the vibes were great! I had the pastor tacos..  so good, the guacamole was fresh and the coconut shrimp was AMAZINGG! this was my 2nd time there and I'll definitely be back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLT2o1SWFLMmNMdGVBEAE",
            "text": "Kandela is a great place for delicious Mexican food and drinks. The atmosphere is lively, the service is friendly, and the food and drinks are top-notch, especially during happy hour. I'd definitely recommend the sangria and tacos!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLVMtczNaMHBmdXhnRRAB",
            "text": "5 Stars!\n\nKandela is absolutely phenomenal! From the moment we walked in, the atmosphere was warm, vibrant, and inviting. The food was bursting with flavor—every bite was a delight—and the drinks were just as impressive. The staff was attentive, friendly, and made the whole experience feel special. Whether you’re out for a date night or a celebration, Kandela is a top-tier choice. Can’t wait to come back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MVBTUGZnEAE",
            "text": "I absolutely love coming here the vibes are amazing as well as the drinks! Shout out to Juan he makes the best Celtic gardens as well as the espresso martinis I can’t wait for the summer & sit outside also love the new decor they added! 😊 I willlll be back like always"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcE8zZXd3RRAB",
            "text": "We arrived at the restaurant and sat down. For around 7 minutes no one came to our table, even though there were several staff members just chitchatting. The chicken taquitos were pretty good and so was the guac. The lava cake was delicious. The chicken enchiladas could have been better if it wasn't for the vast amount of sauce, which did not taste good. The steak burrito was good but the meat was charred. The fish tacos were a bit dry and lacked taste."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSaU15ZE9REAE",
            "text": "I've been wanting to go to Kandela for a while. So for a birthday celebration we decided to try it out. The atmosphere is nice . We sat in booth area. The wait staff was pleasant but not as attentive as I would have liked. There were only a few other occupied tables .\nOnce we ordered food arrived rather quickly.  Unfortunately most of our food wasn't to our liking.  We tried variety of appetizers and tacos. They were beautifully prepared but the pork was overcooked (dry and burnt) The shrimp and fish tacos were good. The Mexican  corn was very good also.\nAs with everything, the items were pricey.  I won't be returning here unfortunately."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNDliZ2ZnEAE",
            "text": "The quesadilla I ordered was amazing! It was a super busy night so the wait was pretty long and service wasn’t the best but I understand. They have good music too! We got a frozen margarita pitcher and it was definitely a lot for two people which was nice and worth the money🥂"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdk5qS2d3RRAB",
            "text": "I was greeted as soon as we walked in. There was no wait time, we went around 2pm on a Saturday. The cocktails was on point. The music had you wanting to get up and dance but not loud where you couldn't have a good dinner conversation. I…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MU1TM1FREAE",
            "text": "I’ve been coming here since they opened since I live down the block as well! I love how they decided to do different drinks for the holidays . I always order the chicken tacos they are amazing! As well as the espresso martinis! Juan makes the best Celtic gardens with fresh cucumber! it’s a special for st Patrick’s day! and all of the coworkers are amazing love coming here! ❤️❤️❤️❤️"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMXNyTnR3RRAB",
            "text": "In the area on a Tuesday night and while\nTaco Tuesdays is very much a thing, we stopped in for drinks.\n\nOne of my girls suggested Kandelas as she is a fan of both their tacos and margarita sampler/flight. Unfortunately the sampler wasn’t offered, so I went with the Hibiscus Marg, which I really enjoyed. I am Interested in returning to try the tacos and happy hour in the future.\n\nWhile we didn’t order any food, we did surprise the Capricorn at the table with a little Feliz Cumpleaños Canción and ordered her one of her favs. A slice of Tres Leches, sadly she didn’t not enjoy it, it didn’t seem to be fresh.\n\nOverall a cool spot with dia de los muertos murals and vibes.\n\nJust A Note:\n\n-There is $1 up-charge for every margarita rim that is salted or sugared\n\n-3.25% Credit Card Fee added if you tap or swipe"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocGU2SkJBEAE",
            "text": "The atmosphere is aesthetically pleasing and clean. The staff are friendly, attentive, and some speak a secondary language for those not native to the US. The food was even better!\n\nOur table had the chicken taquitos for an appetizer. The app only brought three so if you’re a party of more than three a different appetizer should be chosen or more than one taquito appetizer should be ordered.\n\nFor my meal I had the Mexican burger with fries. Very delicious and filling, cooked to my liking. My mother also had the Mexican burger, but with yuca fries, which were also delicious. Soft to taste and perfect sweet, salty, savory combination. My sister had a steak burrito which she let me taste. The steak was seared to her liking and had great flavor!\n\nThe only mishap I encountered was when I used the restroom and there was no tissue left for me to wipe. Besides that, the experience was phenomenal!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcWVMMU1REAE",
            "text": "The fried calamari was probably the best I had so far and the loaded nachos with steak were also real good. I tried the Mexican burger but it had too much going on for me. I'll try something else next time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbXZuY3RRRRAB",
            "text": "The food was flavorful, the fish tacos were the best! One of the women at the front who i presumed was the owner, was very helpful in explaining the menu and Taco Tuesday and helped us make our choices. We were seated quickly and the food came out in a reasonable amount of time. The special can not be mixed, but the taco Tuesday menu has $4 tacos that you can mix and match. Great place to eat good and catch up with friends/family. Will be returning"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdV9YRmpBRRAB",
            "text": "We love this spot on Taco Tuesday , special lunch and drink deals readily available.  If you gave 3-4 people with you grab a booth/ table toward the back of the restaurant.  Very lively atmosphere  clean establishment and hot delicious food.  Try the carnitas, Burrias,  pork and fish tacos for lunch sll fresh and juicy with excellent plate presemntation. Red sangria is very refreshing and spiced just right.  Sweet maduros are crispy, hot and candy sweet (must have). Chips and fresh guacamole upon request and are a must have before lunch. They have a full bar that is fully stock and flat screens on each side. The only reason the are getting 4 instead of 5 stars is their bathrooms are 1 at a time,  so you may have a wait , other than that we will be back next Tuesday.... and the Tuesday after that...... and the Tuesday after that."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWeGZHYkV3EAE",
            "text": "The service was on point and the food didn't take long to arrive at our table. The chicken wings came out hot flavorful with mix of crispy and saucy. The main dish of chicken rice and beans tasted authentic but not too spectacular. Great experience for a quick bite and a craving for tacos and burritos."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NHJ5UWZ3EAE",
            "text": "My first time here and I definitely enjoyed everything about it! I usually order an entree when I eat out but this time I decided to just get 1 steak quesadilla and my bestfriend got steak nachos with no jalapeños. I got two passion fruit frozen margaritas & she got two passion fruit margaritas both with salt on the rim. The service was quick, food came fast and the drinks were strong but not overly strong! The music was good and there were television screens everywhere which was great cause a Marvel movie was playing at the time! I would definitely suggest to come here if you’re looking for a good Mexican restaurant in Queens and I would definitely like to come again and try more of their dishes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyOWNMejNRRRAB",
            "text": "Late night dinner I was in the area during our visit, we enjoyed the salmon burger, tacos, fried calamari, flautas, a pitcher of margarita and yuca fries, each dish showcasing the restaurant’s commitment to quality and flavor. The salmon burger featured a perfectly cooked Alaskan salmon fillet with pickled jalapeno, tartar sauce, lettuce, and avocado on a brioche bun, accompanied by French fries. The tacos, including the Steak Al Carbon and Chicken Tinga, were prepared with fresh ingredients and packed with flavor. The fried calamari, with its tender squid rings in a seasoned batter, paired well with tangy marinara sauce. The chicken flautas, topped with lettuce, pico de gallo, crema, cotija cheese, and green tomatillo salsa, were bursting with flavor. The yuca fries, crispy on the outside and soft on the inside, offered a unique and satisfying texture.\n\nKandela is a must-visit for anyone craving authentic Mexican cuisine. The extensive and varied menu, combined with excellent service and a lively atmosphere, makes for a memorable dining experience. Whether you’re in the mood for street food favorites or more elaborate main courses, Kandela delivers on all fronts. Highly recommended!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dWMySVJBEAE",
            "text": "Kandela is like home. Everyone is so friendly. The food is delicious and the drinks are A1. Happy hour is every day 12pm to 7pm Happy Hour drinks and appetizers $10 from 4pm to 7pm . Fabian is the best literally the sweetest and Juan. Kandela is a must!!!!!!!!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1Z0o3ZF9BRRAB",
            "text": "This is a pretty nice place. I brought my family here for my daughters birthday (party of 7). There were a few minor issues. Parking is at the top of the list. The very small parking lot is shared with other stores located within the little strip mall. Service was decent, definitely could've been better. Waitress wasn't very attentive. Drinks were ok. Food was good 👍 😋 👌.  Other than that my only other issue is the 3% charge for using a credit/debt card. Most people don't even carry that amount of cash on them. So on top of gratuity I payed an additional fee for using my card."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVbzZtNWJBEAE",
            "text": "Service is amazing, Food was delicious especially the tuna tartare, fajitas didn't come with rice, sauce or beans but delicious none the less.\n\nA great date place. Atmosphere is awesome.\n\nA little pricey, they are currently waiting for their liquor license."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaVlpckRnEAE",
            "text": "Came to this place and the food was okay. The enchiladas with the green sauce was the best plate out of everything we had. The guac was very small for a $14 appetizer. My salmon was very raw. I did love their piña coladas and will come back for drinks. The service could have been better as no one came to check on us not a single time. Our drinks were done and no one asked if we wanted another drink.\nPrices are on the higher end. But, I guess that’s everything these days. Had really high expectations for this place. . . That were not met."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cUstOVh3EAE",
            "text": "Nice vibe, good music, decently strong drinks (I recommend the Picosito). Portions can be considered in the smaller side or just enough. Pictured: birria tacos, chicken Milanese (Kandela style, topped with spinach, onions, avocado and cojita cheese), enchiladas verde, side of chips and guacamole, side of french fries, mexican rice with black beans, carne asada and picosito."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVb3ZXX193RRAB",
            "text": "First time but won't be our last definitely our spot now. Food was amazing thanks Jeffrey the bartender and Daniella best server Jammine and Xamena for your hospitality. Recommend this place. Jasmine and  Xamena best host I ever experienced hands down they will treat you like family. Tuesday and Friday best times."
        }
    ],
    "reviews_count": 63
}