{
    "name": "New Park Pizza",
    "place_id": "ChIJmfrimH1nwokRhflc9s_zHSU",
    "grid": "QN10",
    "address": "Parking lot, 156-71 Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.5,
    "user_ratings_total": 5661,
    "phone_number": "(718) 641-3082",
    "reviews": [
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1M2MxQjNUa3B5VkRWSlVFeDZZMFozYW5JMVIwRRAB",
            "text": "This use to be awesome pizza now it's over cooked nothing says Italy sad 😢…"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SFVtOHlUREpaYzE5a1pubG1RMmMzWjJZMVNYYxAB",
            "text": "Took the sky train here from JFK after seeing it recommended as a local place. TLDR  will go somewhere else next time.\n\nCrust is good but otherwise the heavy toppings on the everything were undercooked due to the fast cook in a high-temp oven, while meat one has sausage sprinkled on *after* it comes out, so is constantly falling off.\n\nVERY expensive for what you get, and cash only is a PITA If you don't have it. Two thin slices (one everything 6.75 + one sausage 3.75) was over $11!\n\nIf this is peak NYC pizza I feel sorry for this people.\n\nFor JFK visitors add ATM fees and skytrain cost of $17 round trip. Much cheaper to eat at the airport or get a cab to go somewhere else."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xObFMyeDVNMVZsTkdsNmFVTnZORVJmY3pGVVZWRRAB",
            "text": "One of the best pizzas in NY!!!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORExXd3RVMHhvUTNsd00wcGxhbFZKVTFJeVYzYxAB",
            "text": "One of the best NYC style pizzarias in NY. Worth a trip."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWU0xcFpVMWhGUmt0SGRHNTJTMVpNUVRRdGNIYxAB",
            "text": "One of the best pizzas in NYC"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTVJXSkNlamgwZVcwMVgySjNSbUY0TFdKTFJsRRAB",
            "text": "Located in a popular mafia Neighborhood(Gambino) One of the more decent pizzeria in Queens. Ordered cheese pizza cheese has amazing flavor just the right amount of sauces and the dough was good, but it’s worth it to have a fresh Pie. all made by hand..FRESH...It is best to get a FRESH pie."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMVMyZHNOM2RzZUV4cWMzWm1kelZvTjFRMlVFRRAB",
            "text": "My favorite pizza when I vist NY"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWU5rSXlRbU5CVFRGMFNHbGFSUzA0WkY4emJIYxAB",
            "text": "Great option for lay over in JFK to experience a quick New York style pizza and a great water port view.  A few minute walk from train station I think new port beach is the station name."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQmJURTJXa1JQYldGSU1XRTJjalJmVkdwNFIwRRAB",
            "text": "This is the quintessential NEW YORK SLICE!\n\nI was in town with work and walked here with my coworker. He was blown away. I always get the white slice but this time got a pepperoni... All incredible.\n\nSmall seating area, order from a window inside a covered porch.\nAnd a mobster turned youtuber said he used to conduct meetings here in the 90s!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNlF6UkllVnAxYUVSdE5EVllhMFppYm01TlNuYxAB",
            "text": "The pizza was not good. Chewy dough."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc1QwZ3lUR05pWVVZeE5sWndRV2RNVGkxWFdtYxAB",
            "text": "One of the best regular slices I have ever eaten!   Cash only"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OUllSWFREAE",
            "text": "Pretty good make sure you ask for your slice well done."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RVdIQlJTMFZ6Vm1ZM2JsUnViR2RhYjNnd2NIYxAB",
            "text": "My favorite pizza place 😋 never fails. Have been coming there for years. I was visiting my old house from 4 hours away and definitely had to get a pie to go. Yum and it definitely warmed up well in the air fryer. Had some slices there and the pie to go"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTVMyVnBOV2xoU204NFMwazRPRlJtT0Y5UFNGRRAB",
            "text": "Years ago this place was one of the best around. I went back today for the first time in a while since I was in the area and honestly it was an absolute joke. The pizza was practically raw, loaded with way too much cheese, and barely any sauce. My stomach’s been hurting all night since eating it. I don’t know what happened — maybe new owners took over or they just stopped caring — but it’s really a shame. This place used to be great but today was the worst slices I've had since I could remember. Took a few bites and tossed it."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTcGVXSjlBRRAB",
            "text": "Definitely one of Queens' best slices, as long as you don't get an over-cheesed or undercooked pie. Consistency is an issue, but when they are on point it's awesome."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTk9XdGtSVGg0V0V0YWNuRmFNMDk2TjFwMVowRRAB",
            "text": "Great crust!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTFZtaFlPRTlyYUV4bWVEY3hTM2wxUlY5R2JIYxAB",
            "text": "Been going for years and they still pump out a great pie. Gotta get it well done tho. One of the best tasting crusts I’ve had. 1 reg 1 pep 1 white with the fruit punch everytime"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaE0wRnhXVFJLYkVGSGRsQjZZbUZDTVdOUmFrRRAB",
            "text": "Best Pizza around!!!\nBe sure to try the white pie!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MVlURlRWazFVVFdaWlgzQmZVVVZqU0dSb1JYYxAB",
            "text": "Pizza was good but a bit floppy. The square was mediocre at best. Regular slice-8.2/10. Square-5.5/10."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b1gxWnFjbll0YzJ0RVFVcHROV1pTZG5VMGExRRAB",
            "text": "The family favorite pizza place in New York . It’s cash only. Great place"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSYVptdFZTbFJwZUhWb00waG9iR2w1VWpBMWNuYxAB",
            "text": "The best!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscmRWTk5SVXhhTjA1bFpIcG9aSEZvZEZKeVpWRRAB",
            "text": "It's all about the pizza. Get the best pizza around and get on with your day. This place has been the best forever and I hope it stays open forever. Two slices and a large fruit punch! Let's roll!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWk1YQjBRV2hpWVRWU2J6bHFkQzFNZWpkSlJXYxAB",
            "text": "Iconic pies—and the crust is next level good."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMU5WSTJaR3RLYVhSNVpXVTJNSGhWYkVZeE5sRRAB",
            "text": "The food is great. Simple pies, nothing crazy with what they serve. Just the basics, Pepperoni, sausage and onions, peppers and cheese. Why do you need more? I took a star because it's cash only. I understand it as a neighborhood spot, just be mindful as a visitor, like me. LOL!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRldqZDNYMkZRYWpOWGF6SjZWbE01VDBsemNYYxAB",
            "text": "Awesome service great customer care and of course NYC best Tasting PIZZA"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205a1kwYzNPSE5GT1hwMFJqZzBZMDVSYUUxNU5HYxAB",
            "text": "Really solid pizza. The crust was good, and I liked how the sauce and cheese worked together. My only complaint is that I didn't get to eat it right away—it probably would have been even better hot and fresh."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbWMxWjFTRkUwTVRjd1FWSklUbUpDZG5SNFJFRRAB",
            "text": "Old school pizza!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neGFIbDJUR0Z5YlRCSlNtTjRkV3BYZGs5MlExRRAB",
            "text": "Good plain slice 9.5"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaWF6WkpiM1ZxWW1ORVoxWnBMWGcyYzI5eFRtYxAB",
            "text": "Really good pizza. Reminds me of the way pizza USED to be. Will definitely visit again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVlFrVm5lVk13TmpSYWRtSklaelJHWm5wRVZsRRAB",
            "text": "Something is missing from when I was a kid to now 30 yrs later. Counter guys should be more..... Friendlier. Especially when you arrive with like 6-10 baseball players."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdVdIZEdjRjh3TjBSWldGRTNYMmhLZDI1eVptYxAB",
            "text": "This is a real New York pizza place. Nothing fancy, just amazing quality pizza. I come here every time I fly through JFK. Even on layovers. Cash only!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjM2FWUlFWWGRVWlZKdWFGSnROblppVVVGNGJHYxAB",
            "text": "Classic NYC pizza, a must have one of the best slices in Queens."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRlNEUlROMHMxVkdGdlIySm9kWEkxVlZoc2IxRRAB",
            "text": "In my opinion, it's okay at best."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dmJETm1WbEJsU0VOVVJYRlZOMU50TTNCTVpGRRAB",
            "text": "Delicious! Add the garlic to your pizza... Chef's kiss!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMGVrVTBPR1prTUVnM1ptTktTbEZGTFhwcWFuYxAB",
            "text": "If not the very best, then one of the couple best pizza places in New York. Fresh right off the oven 🤌🍕"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeVVYQkpMVlJZY0RaTFIyTjBNblJ0WTJWaFNVRRAB",
            "text": "NY knows pizza. And New Park Pizza is king\nPerfect texture. Sauce/cheese ratio is spot on. A delightful slice."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPX2JyemVBEAE",
            "text": "The best pizza 🍕🍕😋 in Howard Beach New York."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eWJGSmxWVzE1TUZKM09VeDFORVZ5WWpkNU5HYxAB",
            "text": "Great spot for a slice or even a pie! Classic wood fire pizza with that New York feel! Classic New York Italian pizza spot with only pizza like the old days. Pizza is delicious! 5 stars for sure"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwaXV6V0tBEAE",
            "text": "거리가 깨끗하고 주위 환경 먹거리 볼거리가 최고"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rdGIxOURXR3BXZUUxSk0ybDFZVXN0YzJKMFZsRRAB",
            "text": "New Park Pizza is a Queens staple and arguably one of the best spots to grab a slice in the borough. I tried both a regular slice and an everything slice, and both were absolutely delicious with a crispy crust, flavorful sauce, and perfectly melted cheese.\n\nService was fast and efficient, so you won’t be waiting long for your order. The pizzeria offers both indoor and outdoor seating, though space is limited and outdoor seating is seasonal. The ambiance is casual, making it an easy, no-frills spot to enjoy great pizza.\n\nIf you’re in Queens and craving a quality slice, this place is a must-visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toa1FrWnZRM2xIVkZCblh6WlBUVkZtYTFaSWRrRRAB",
            "text": "Top notch pizza\n\nWas in the area\nSaw a line outside the door decided to stop and try it and wow fresh and delicious pizza\nI tired regular slice and a Sicilian. $3.75 each cash only\n\nLine outside took a while to get to the window.\nInside line wasn’t too bad.\n\nDefinitely be returning"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkb1VVdHZSVjgzUjNSU1MwRktSVzQwZEV0allYYxAB",
            "text": "I was craving New York pizza so I made the Uber from JFK. The pizza was good, just not great. I did like the flopiness but it needs more because it’s paper thin. Other than that, the toppings are plentiful, the extra cheese was exactly what I was looking for.\n\ncash only and bring a lot of it because it can get expensive"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMGNQTm5RRRAB",
            "text": "Landed at JFK and came right here. It’s often praised as a top NY Slice… 🍎 🍕 🏆 So I finally was able to check it out myself.\n\nAnd after devouring 3 slices, this ex-Long Island kid sure ain’t gonna argue! 😋🥰😋."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dGFHZE1XRVExT0RsSFZXZHJZMlpuTFZvd2NVRRAB",
            "text": "In my top 10 pizza places of NYC. But with them being on the monopoly board you already know it’s not just me saying this! Guys are great behind the counter. Pizza slice is thin and salty just like a Napoli styled pizza ( I spent 3 months in Napoli) !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMWRVdFFORlJJZG05VFNVcEVUR1pqWjJONWFXYxAB",
            "text": "The pizza was alright. Service could be better. Be prepared they only accept cash, and state it proudly on their signs. The younger guy working at the counter should be more friendly. Tables were dirty, at least in that separate takeout area, it looked like nobody cleaned them after the customers left."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bE9XMW9UeTEzUVhOU1pWaFdSV3c1UnpKVVlrRRAB",
            "text": "One of best pizzas 🍕 I have had so far, helpful and happy, cheerful\nstaffs make all the difference well done"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBa2Q2OTRRRRAB",
            "text": "I was in NYC for work and one of my coworkers who grew up in the area took us (fellow coworkers) to his pizza spot.\n\nCash only but no worries, there is a chase next door so easy to get cash out. Ordering is a breeze and wait times are low and get your food quick.\n\nThe pizza is really good and hits the spot when you want a good slice. This place is close to JFK and the surrounding hotels. I’ve already been twice and I’ve got a few more trips coming up and you know I’ll be hitting this place up for a slice or two!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRVpXVjBMVkJCYlRjMWJEaG5XVjk2UVZVeVVrRRAB",
            "text": "New Park Pizza is a true Howard Beach classic and one of the best spots in Queens for an authentic New York slice. The vibe is simple and old school, with a busy counter, plenty of locals, and pizza that always delivers. The regular slice is thin and crisp with just the right char, balanced sauce, and perfect cheese, while the Sicilian is thick, airy, and golden. Ask for your slice well done if you like a little extra crunch.\n\nPrices are fair, portions are generous, and the service is quick even when the place is packed. It is no frills but full of energy and flavor. If you want the kind of pizza that defines New York, New Park Pizza is a must visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GZlRXcHBaRWRwU1hNek5sOXRXSEZ5TlZRM1lYYxAB",
            "text": "I’m almost 70 years old and they are everything’s done got a spinal celebrating the 70th anniversary in New York remember coming here since I was at least 10 years old on the way to Rockaway Beach. Great Brick oven pizza"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMV1h0ZUxXeU0zX0F3EAE",
            "text": "Best pizza I ever had in Howard Beach, NY. This place has been open since 1956. Would definitely come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNNnRrSVN0eC1iUm1nRRAB",
            "text": "Workers come off rude, single slices tend to taste better and look better than the large pies. When I had single slices they were amazing,  today I bought 2 large pies for the family and they weren't as impressive."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eUlqLURnEAE",
            "text": "Great service and pretty good pizza. Parking available in the back. Enjoyed it overall. Cheese was the best and the white and pepperoni were just okay. Cash only"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdU5YQk1MVkl3TWtoRmRUbGpWa2xCVkZkV1RHYxAB",
            "text": "Best pizza in the area ,got to find in with my toddlers n my service dog outside n seated great for a beach day picnic!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcGZyTTZnRRAB",
            "text": "After flying 16 hours around the world, the first thing I wanted after landing Stateside was a proper slice (okay, 2). New Park nailed it. Thank you for your friendly service and making my slices extra crispy!\nFYI: cash only!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ga1dWZHhiWFptTUdvM1YyaFhlSHBNUldKaFdXYxAB",
            "text": "Flew into JFK and looked this place up. It was good NY Style Pizza. Very packed and crowded, and not the best parking. But overall good pie"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MlpfVmJBEAE",
            "text": "Ended up at New Park Pizza in Howard Beach NY, Slices came out Very Good. Wish i was in a situation to get a pie to-go  because one came out as i was walking out that looked very good. Had an Apizza \"char and chew,\" the cheese was pretty fresh, and the sauce was a very basic tomato puree, which is how a lot of og spots do it. Would definitely recommend 8/10 for me."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNFRXRjRkRnBKYzNOalkybzFVbG93TUVkbk1XYxAB",
            "text": "Delicious pizza is out of this world in Howard Beach! Love New York Thin Crust Pizza and Italian Ices"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOZ3ZtTnpnRRAB",
            "text": "This landmark pizza joint is a mandatory stop off whenever I go into the area. IMO it's one of the best round pies and that says alot because in NY they have alot of competition."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NnBfM0lREAE",
            "text": "New Park Pizza is undeniably a neighborhood staple. Their pizza is fantastic - hands down one of the best in Howard Beach. If you're in the area, it's a must-try.\n\nHowever, the inconsistent service is a major drawback. While I've personally enjoyed my experiences, it's clear from other customers' reactions that the staff's attitude can be a real turn-off, especially when dealing with requests for non-burnt slices. The pizza is a star, but the service needs serious improvement. Also, it's cash only!!\nIG📸 @adventureofourlifetime"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeVp5dDhBRRAB",
            "text": "This is the perfect NY stop for your JFK layover. It is cash only so come prepared, there is a bank next door so don’t let your lack of cash stop you. If you are looking for NY quality pizza and you only have a limited range from the airport, this classic NYC stop is well worth the adventure."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3M2NGUlRNWEY2ZDNSVmFIbDNNM1JKUVVzNFlWRRAB",
            "text": "Okay, so first off parking lot, it's not that bad if you know how to park, You're good. There are plenty of tables it does get packed.\nThe prices are slightly higher from what is advertised online for the pizza and drinks. I didn't get anything else, so I can't speak on other items .the cheese pie was 24 dollars and it was burned!! the crust was burnt the bottom  part of the pizza underneath was also burnt and no it wasn't crispy it was black burned big difference! the sauce was sweet you can taste the sugar in it . it lacked spices even after adding garlic powder.it needs more  cheese. Will I recommend this pizza shop? Probably not, but as another person told me, try it again it just could have been an off day for the pizza. I  am not sure If I  would do that since it wasn't the best."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KYVJraHhUekJvVDJOWE5qZG9kR3BKWDJwbVZVRRAB",
            "text": "Great pizza terrific taste best part fair prices.  Definitely recommend 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdi15b2F3EAE",
            "text": "I won’t say that New Park Pizza is the best pizza in all of NY but it IS my favorite! Hard to be objective because everyone’s tastes differ.\nFor me New Park Pizza has the right combo of chew, sauce and cheese. I had to give them a four star rating because their pizza sauce was on the salty side. Other than that it was perfect, for me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaC1IY2RREAE",
            "text": "Great place to get a slice or pie of pizza especially late at night. You can’t get a slice no fresher than this. This place has been around for decades. I came here only a few times over the years. But it never disappoints. I hope they continue with the same good food and most importantly the quality of the food for many years to come. They have to best white pizza here in my opinion. They only take cash here just to warn you."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReWV6MGtRRRAB",
            "text": "Best classic New York slice. If you’re looking for an old-school Italian-American pie, this is your place. My family and I have been going here for ages. FYI: cash only"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oV09XTktVRFpyWW5sb2NHc3RWRU13WVdWb1RrRRAB",
            "text": "Was honestly expecting this place not to live up to the hype, but it surpassed my expectations. Very fresh tasting sauce, delicious crust, cheese not too greasy; honestly may be the best slice in NYC. Ordered a whole pie for takeout, got it in less than 10 minutes, and the cashier went out of his way to make sure we had some paper plates. Will go again when in the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNVMxZDRWRjlEUVRoT2JHZGxOMmhtU0doZlVYYxAB",
            "text": "Probably my favorite pizza joint ever. Been going there for 25 years. Usually great thin crust pizza. Once in a while a little heavy on the cheese, but how do you fault a place for that? Cash only,  don't forget your wallet"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdWJXeFlREAE",
            "text": "I’ve been coming to this pizza place for years, and it’s still hands-down one of the best in town. The consistency, quality, and flavor are unmatched. Whether it’s their perfectly crisp crust, rich tomato sauce, or generous toppings, every bite is a reminder of why I keep coming back. The staff is always friendly and welcoming, and the atmosphere feels like home. It’s rare to find a place that maintains such high standards over time, but they do it effortlessly. If you're a true pizza lover, this spot is an absolute must."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNaVVvWWk3eThqcWt3RRAB",
            "text": "This pizza was not what me and husband expected it to be. We were craving a nice city pizza and thought this was the place to go based on the reviews it had. We ordered a 8 slice margarita  Sicilian pie that was 24$ and a small sprite. The marinara sauce was very sweet, it did not taste like a margarita slice; and the soda tasted like dirty fountain soda.\n\nI usually don’t write reviews; however me and my husband feel sick after eating this pizza; we would not go back here and definitely not worth 24$"
        }
    ],
    "reviews_count": 69
}