{
    "name": "Gino's",
    "place_id": "ChIJ1Wmna35nwokRTaAs8qAaCok",
    "grid": "QN10",
    "address": "158-46 Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.4,
    "user_ratings_total": 1733,
    "phone_number": "(718) 738-4113",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdlpsWjJPV0ZsU2xsTlZGaGhSazFHVWsxWWQwRRAB",
            "text": "Excellent service since the moment you walk in, some of the best pizza I’ve ever had, that pepperoni was so thick, such a flavorful pie, plenty of mushrooms and cheese"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVWNqSnhia2R0Y3pOWVZFNVhUMlYxVEhKM1NGRRAB",
            "text": "Amazing pizza and incredible customer service.  Highly recommend!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNFpsQk1Va1phTFdkMWJrRmxVRkkzYW5NemJuYxAB",
            "text": "Nice place and very tasty pizza!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acFNVeHZXWFZYV0RsRWNYRTBiRXBFVnpFeVozYxAB",
            "text": "I like this place but not to eat all the time.i give the food a 5.5 out of 10.will try again in future.  Very expensive for mediocre pizza"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paelNsTkdjVzgzVmw5U1UzcHJORWw2TVhsVlFVRRAB",
            "text": "I recently visited what seemed to be a promising pizza restaurant, but my experience was far from satisfactory. It felt like the staff only provided good service to those they knew personally. After being seated, I was given water and a sampling plate, but my order was simply forgotten.\n\nDespite my patience, I found myself growing hungry and increasingly curious about the status of my food. I made two attempts to inquire about my order, but both attempts were unsuccessful. While I didn’t leave, the wait and lack of communication from the staff made the experience unbearable.\n\nTo top it off, when I finally received my food, it was mediocre at best. Calling someone “sweetheart” doesn’t make up for a very unpleasant dinner. If I could give a negative rating, I certainly would. My only regret is not choosing a different place to eat."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNjcyZHZRRRAB",
            "text": "I love this place, delicious food"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTmRtdG1NM0pQUVRCcU1VOWxjVEZOVm1aMGQwRRAB",
            "text": "Excellent! Waiter was very helpful with great recommendations. Got the chicken parmigiana and it didn’t disappoint! Parking wasn’t horrible for a Monday around dinner time and service was quick, food came out hot and fast, and staff were very friendly. Will come back next time I’m in NY."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUmFuTTFOMVZzYzAxc1VWUmlSRzFTWDBreVMzYxAB",
            "text": "Great good and atmosphere slow service though still great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTVgyWk1UblJQVW5sU1FXbHRUVGx3T0VwWVNHYxAB",
            "text": "Great neighborhood restaurant.  Friendly and nice staff.  Food is always fresh.  Had cauliflower pizza gluten-free, which is so good. They had different pizza to order.  Had seafood salad is my favorite.   Prices are very good.  If you like wine they had it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5QmRUQnBRbFZRZVV4QlMxVXhSVFpaY1Y5aFFrRRAB",
            "text": "Pizza/restaurant on busy Cross Bay Blvd. Take out and table seating options. Service is pretty good, food is fine and the prices are reasonable. Parking can be an issue. ♿️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeVVXdDNNRGxPUmpSV09VUnFlakpMYkVJNVNHYxAB",
            "text": "Great place to eat"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKS1dEUjNlRlZGVUU5WmRGOTBaRWMyWkRVMmVVRRAB",
            "text": "Grate place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMWFqTmFZV0YyVmpnMlRFSlNjRUZUYTBVMGNGRRAB",
            "text": "The food was great and the service was attentive. I'd go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNVQyTmFXWGRKZDJ0cVkzVTJXVTlMZG14Qk5XYxAB",
            "text": "Gino's is an excellent family-friendly restaurant offering delicious food and generous portions. The owner and staff are exceptionally warm and welcoming— the owner even took the time to personally visit our table and speak with us, which added a thoughtful, personal touch to our dining experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNWNqRnZkbGRGZW5ObGFtZFBTVFphVGpVMlEzYxAB",
            "text": "I Love this place. The food is amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUWIwUkhSa3hGT0dkM1JVWkNSMVpZTjAwMFNHYxAB",
            "text": "Plain Cheese pizza slice and Sicilian rice balls. Maybe it's cause I haven't had a slice in ages but this slice is up there among the best I've had. Nice spot too. It was 10 pm on a Saturday night and there were families in there. Service was great. I'll be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VmVGVTFYMUJ0UTNvNVpWWlRTVXREVVZsZlRFRRAB",
            "text": "Great food, great people and I always make it a point to stop if I have time whenever I go to JFK."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKb1ExTlpTV3BFU1VkSlUyaFpkMVpKY0ZGWmNGRRAB",
            "text": "I ordered a pie today and the quality was horrible the whole thing smelled like fish I tried to exchange for a fresh pie and was told absolutely not I would not recommend this place to nobody verry bad customer service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbE1YUkZPV1pEU0dweU5saFZUVmhtZVdkU1ZXYxAB",
            "text": "Rude countertop service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaWNEUkpOa3RIWWkxS05rcE5RbkJOZWtkVWFWRRAB",
            "text": "Had dinner here after a fun day at the beach. Calamari and pizza were on point. Veal Marsala though, very tough. When the server asked how it was and we told him that it was tough, he responded “it’s supposed to be tough.” I’ve never had tough veal before, not in America, not in Italy. I don’t even know what to say. Seafood pasta was also disappointing. Mussels were not fresh. Avoid both dishes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNU0zQm5aMGRmUm1WQlh6TlFRMHB5UkdKc2VHYxAB",
            "text": "Top-quality.\nExcellent ingredients, perfectly cooked dishes, and a clean, well-kept environment.\nThe staff is extremely kind and the prices are more than fair.\nFinding all this in New York is no easy feat.\nYou can clearly feel the Sicilian touch and heart behind it all.\nSincere compliments!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VE9VOXVhRzVRZEdGT1V6UmFkWFpXUlRSbU5GRRAB",
            "text": "Im trying to figure out how this place has such good reviews! Maybe the locals really like it. It does come across as a hangout spot. Anyways my experience was mediocre at best but unfortunately the food was atrocious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMFoxVm5OMmRoTUZaVVpuVTBla05UUVhwWGRsRRAB",
            "text": "This place has been a good spot to go to in Howard Beach. Their pizza is definitely some of the best in the area."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbk4xaHVTbE53VVhOUFRYZHFOM051UkhkWFoyYxAB",
            "text": "First time here went with 6 friends and had a blast, service was excellent and food was amazing, moderately priced for the amount of food they give you"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjbGVicWF3EAE",
            "text": "I've been there with my family,  for the last 10 years. I have to say it never gets boring,  and the food is off the hook,  please drop by and you will see for yourself."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkelVqQlJVRUZoVlRGaWMyaEpNa3BYYzNWb2VtYxAB",
            "text": "I had a mixed experience at Gino’s Pizzeria & Restaurant in Howard Beach. I ordered the penne alla vodka, and unfortunately, it was bland and lacked flavor  really disappointing. I was so let down I didn’t even take a picture... that’s how sad it was.\n\nThe pizza was better. I had a pepperoni slice and a white slice, and both were actually good nice texture, solid flavor, definitely more enjoyable than the pasta.\n\nThe ambience was casual and fine for a neighborhood spot  nothing fancy, but clean and comfortable enough for a quick bite.\n\nService was okay. Our waitress was friendly, which I appreciated, but overall the experience just felt average. I might return for a slice on the go, but probably wouldn’t sit down for a full meal again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPT042cjc2azVtRUxnEAE",
            "text": "I've eaten at Ginos before and thought the service and food was great.  However not today.  I took my husband for Father's Day, made a reservation online last week and a couple of days ago got an email to verify I would be there.  When we got there the reservation was not there.  They said the online reservation doesn't work and we should have called.  At first the woman in front was a bit annoyed that we used the on line reservation. How were we supposed to know not to use it? They should either fix or take it off the website.  When we were at a table the wait time was atrocious! We got there at 5pm. After 15 minutes we got a soda and a water.  25 minutes later we were asked what we would like.  Very easy, just one entre each.  35 minutes later we got it.  No bread on the table, no salt and pepper, no offer of parmesean cheese, no refill on what we were drinking. We had no idea who our waiter was.  3 different people were bringing us what we ordered.  The food was ok but looked like it was just smooshed onto the plate (I had manicotti).  Cheese was on only one, sauce on the other. No balance.  After eating we waited another 25 minutes for the dishes to be picked up and the remainder of our food to be packed for us.  We asked for a Capucinno and cheesecascake to share.  35 minutes later still nothing.  Plenty of servers all over the place too. We just decided to pay and leave. We were disgusted by that point The waiter apologized that it wasn't brought out.  Not his fault at all.  He gave us the cheesecake on the house.  It was a lousy experience.  This was supposed to be special for Father's Day.  It certainly was a huge disappointment.  I don't think we'll ever go back.  I don't recommend this place at all."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNWDQ5ZlRnLXBPMUxREAE",
            "text": "It was great!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOQ3QySnJfNWFXZTVBRRAB",
            "text": "Honest, transparent, and fair"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPU1J6NURoNDdPdHZnRRAB",
            "text": "We ordered shrimp and pizza.   Didn’t realize how big the pizza was and we had too much food.  It was absolutely delicious though!  Definitely will eat there again on our next trip."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKTDc2NGFDaU1MMzZRRRAB",
            "text": "Para ispanos recomendado muy amables muy buenas personas excelente servicio"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQN0RwTWVpbzdTaXlBRRAB",
            "text": "Authentic Italian food with reminders of home"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJTEhvc0N0OE16Z19RRRAB",
            "text": "When I’m in the area this is the spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQV3owdU9Rd2RYYzVRRRAB",
            "text": "Delicious pizza and even better food at the restaurant. Their Chicken Francaise is one of the best I have ever had. Everything is fresh and flavorful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQUG96ZWJqa19UQV9RRRAB",
            "text": "The pizza is good. I had the tortellini Alfredo and it was alright. My child had the pasta and meatballs and did not enjoy it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS3ZpWmo0eTZTdHB3RRAB",
            "text": "The best pizza in the world......in the world Craig! Amazing selections and the portions are more than generous. Great people that obviously take pride in their work. In all honesty I don't like buffalo chicken pizza but theirs is literally the best I've ever had and there were rivals. Also their chicken wings are real chicken wings not the frozen stuff. A rarity these days and I don't know why......check em out."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLdkpqN1h0cHRTVF9BRRAB",
            "text": "Great food and service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeE9Pd3BRRRAB",
            "text": "Good Italian fare, nice decor, comfortable seating and plenty of it. Service is OK."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Mm9pVGp3RRAB",
            "text": "Excellent salad, meat rice balls,  fried calamari,  sautéed spinach, lasagna,\nand chicken franchise, I believe.      Street parking only.   It's not a good thing.   It's a pizzeria and restaurant, so it's not elegant but clean and efficient.   The portions were very large with plenty to take home.  Everything was tasty except the rice balls.   The balls were of good size, but they lacked meat and flavor.   I live over a hundred miles away, but when in the area, this will be my go-to for italian food in Howard Beach"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3eHFEa0lREAE",
            "text": "There's a nice selection of pizza, rolls, etc. Food is good, portions are large. We frequent this place at least 4 times a month, the food quality is consistent. The wait staff are very pleasant, even if you sit at a booth just to drink wine. There are so many Italian places to eat in Howard Beach but as a local, I can say this is my favorite on the boulevard for both pizza and sit down dinner. Never disappoints. Pictured: Antipasto Caprese, Fried Calamari New York style (spicy), Shrimp Francese with broccoli side, Chocolate Mousse cake, Cannoli, Spaghetti Primavera and Avocado Salad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOHZpTXp3RRAB",
            "text": "The restaurant is huge. They do have valet parking. When you walk in to the left is a huge area where they make pizza 🍕. Pizza looks great but we didn't have that. We decided to dine in. The service is really nice but the tables and chairs and really close to each other so the waiters are always bumping into the chairs. It's rather annoying. My friend ordered the chicken Parm and I had the penne Alla vodka with chicken. Honestly both dishes were not great. I've had better pasta 🍝. It lacked flavor. The pasta was super runny and the sauce had no flavor. The chicken Parm tasted like they just put tomato sauce over it. To be honest, the best part was the bruschetta they give you on the table before your entree arrives. But the actual entree was no good. I wouldn't return personally. The price was okay and it is a lot of food so that's a plus . The waiter was great. Very friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbDdMT2tnRRAB",
            "text": "Grandma's slice was delicious! The staff was very friendly and all of the food made was fresh and filled with flavor. Would definitely go back for another bite. The tiramisu was just layers of tastiness."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbDh2TnV3RRAB",
            "text": "Stopped for a quick bite, what an awesome meal. Their bruschetta is amazing. And their little slices of pizza for starters are a whole meal! We had the veal hero and chicken wrap with portobello mushrooms. Both were cooked to perfection. The staff is very friendly. I wish we had room for dessert!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcVpYdHhnRRAB",
            "text": "my favorite Italian restaurant in the neighborhood, great food & amazing service. Senad the Manager really took care of us. Definitely recommend this place!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNmVLQWF3EAE",
            "text": "Been here twice.  Both incredible.\n\nI spent $20-30 per person but was trying to try too many things so ended up taking a LOT of food home.\n\nGrandma pizza slice was pretty good but Caprese slice was better.  Ordered whole pie second visit.\n\nSausage dinner with pasta was delicious and huge.  As was the pasta with white clam sauce.\n\nChicken parm sub was pretty good but chicken veneziana was better.  With garlic spinach.\n\nStill full from yesterday or I’d go back for the third time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOZ2VUT3R3RRAB",
            "text": "Amazing portions . Always consistently good . Been coming here for at least 10 years . They bring you homemade focaccia and bruschetta to start . We start with a large cheese extra crispy for the table then proceed to order our meals . We got the chicken cordon blue , pasta fajiole, eggplant Parmesan , chicken franchise , and today the special rigatoni Sunday meal . We love this place and want all to share such a great vibe . Highly recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNab2V6Ti1nRRAB",
            "text": "The pizza here is decent. I ordered a pie and a pecan salad from uber eats and found this foreign object in my salad. This is DISGUSTING and unsanitary. This tells me that they don’t prepare their food properly. Be careful ordering from this restaurant. Who knows what this is and/or where it came from. And who knows why nobody noticed it before boxing it up and sending it off. My job solicits a lot of business from this place. They will no longer be utilized by us. This is absolutely unacceptable!!!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldUxHNzN3RRAB",
            "text": "I love this place. Their pasta sauce and Sangria are phenomenal! It's a wonderful place to have an italian meal. Great ambience, great service, delicious pizza and dishes, delicious desert, great wine, you'll definitely leave this place feeling satisfied."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5emNDRUZnEAE",
            "text": "This is an old-school Italian restaurant serving authentic and delicious food with generous portions. We had the Chicken Paesano & Filet of Sole in lemon butter sauce with sautéed spinach. The food literally melts in your mouth!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbXZxYnBBRRAB",
            "text": "Food was mostly good, no wait to be seated, and portions are pretty massive. However service was very slow the evening I was there and it took a bit longer than it should for apps and food to come out. Had to ask multiple times for the check as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPZ29ycktBEAE",
            "text": "I came here tonite for the first time for a co-worker reunion dinner\nThe inside is very beautiful and relaxing even tho very busy\nWe were a party of 5 and were seated and taken care of right away\nI ordered the Anitpasto Mozzarella Caprese\nWhen the waiter brought it to me - it was in a platter a foot long - I said “ this is for ME?”\nThis was enough to feed the whole table !!\nIt was such a beautiful work of art I didn’t want to eat it!\nHowever I did and it tasted as amazing as it looked !\nThen for my main course I ordered the Chicken Sorrentino\nThis is chicken layered with prosciutto , eggplant and topped with mozzarella - I chose pasta as a side that comes with the dinner\nWhen it was served to me there were two very huge pieces of chicken on that plate - again enough to feed 4 people and I swear they gave me a whole pound of ziti in my side dish !\nNow I have recently eaten Chicken Sorrentino in two other very well known restaurants and Gino’s tops them 100%!!\nThe other places served this dish in a brown sauce - Gino’s did not ,however, whatever sauce they put around the chicken  was so delicious - I will now not eat this dish anywhere else but at Gino’s !!\nEveryone there was so attentive and friendly - made me feel like I eat there everyday for years and years!\nThank you Gino’s for this wonderful first time experience and to the friendly waitstaff !"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvdy11ajdRRRAB",
            "text": "This was sooo good! The chef came out to meet our group. He clicked our pictures. We had salads but the portions were huge. The chicken came with a salad or side order, so its a lot to eat. I had the grilled chicken salad, the person who…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaHRIZUxBEAE",
            "text": "Came here on Mother's day with my wife and daughter. Food was good however I noticed all the wait staff saying Happy Mother's Day to all the customers but not once did someone say anything to my wife not even our waiter.....then when I gave one of the wait staff our check with the money ($60 for a $43 check) he didn't return with our change. Never said keep the change, I waited 15 mins and then had to chase him down for my money...not leaving a $17 tip. Not coming back so thanks for the great memory!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcE03dUtnEAE",
            "text": "Not sure if this place is known for the pizza but it was absolutely bad. It compares to the $1 pizza in the city. Dough was simple. Cheese was stale and the sauce was nothing special. Customer service was great. Street parking. Beautiful dining area. If you’re strictly coming for a slice, look else where."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOaG9iTXJRRRAB",
            "text": "Its a real family style restaurant. They make you feel very welcome and the food is delicious. Its no wonder they always have traffic. Great job guys."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOUlqaGpRRRAB",
            "text": "The place is packed. I can tell how much the locals love it, and food tasted amazing. The service was great. The staff who served was very friendly and helpful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c3VyTTFBRRAB",
            "text": "Gino's is a nice comfortable restaurant to bring friends and family. The waiters were very friendly and helpful. We  visited for a quick Pizza Pie half plain and the other topped with meatball (4). I found the meatball slices to be a bit dry to my taste. I would assume the rest of the menu would be to anyone's satisfaction. There is a very limited list of beers and your usual soft drinks. I would like to try more off the menu next time I am in the area."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNzRUS0d3EAE",
            "text": "Ok so Ardin was awesome. We came in around 6:30 on Labor Day and they were very busy.  We had great service and the food was perfect. I had chicken Marsala (requested to serve over linguine) stuffed mushroom and Tuscan chicken soup (don't…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbGJuR0RREAE",
            "text": "I come here with my dad a lot just to chill out and enjoy. Grilled octopus is delicious. Pizza is great and everything overall is pretty consistent especially during the busier times. Great salads too"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOTZhSUx3EAE",
            "text": "The quality of the food doesn’t matter when your employees don’t have basic human communication skills. I was the only person in the restaurant waiting for a pickup order, and when it finally came, I asked if the order was for “name.” The rude middle-aged European man asked me to confirm the phone number, and when I did, he gave a nasty response, saying that there is more than one “name” in Queens. You would think he’d have enough common sense & decency to realize the one and only pickup order is for me, especially when I confirmed the name and number, but unfortunately common sense isn’t too common nowadays. Very rude man who had a huge superiority complex"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZdkpyU25nRRAB",
            "text": "Absolutely Fantastic! Both Traditional Italian Sit-down Restaurant And Full-service Pizzaria, with a Fantastic Dessert bar!! Well worth going to! Park in neighborhood behind restaurant, easy walk, well worth it!! (Dont patk at KFC, they tow!!)"
        }
    ],
    "reviews_count": 61
}