{
    "name": "Romeo Pizzeria",
    "place_id": "ChIJVdEd84pdwokRrR9JmMC_2SA",
    "grid": "QN10",
    "address": "134-24 Cross Bay Blvd, Jamaica, NY 11417, USA",
    "rating": 4.5,
    "user_ratings_total": 754,
    "phone_number": "(718) 845-3300",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paclJtcGFhME5UV25sc1NuUjNabEpmYkdGTE1FRRAB",
            "text": "Have tried all the other pizzeria in the neighborhood and this is must say it's the best"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMmJqTkhaWFY1ZUZsemJIa3dkakZsVEc5RlpXYxAB",
            "text": "as soggy or burnt crusts, lack of flavor, and poor-quality toppings,"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbE5WRndSR0ZCZEZkYU5sVlJjVlZ1VW01ZmRuYxAB",
            "text": "Fix your times. Place was closed before 10pm."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbFYwaHZTMGxpVUMwMFkwaHpSbkpvVEhaVFRIYxAB",
            "text": "The upside down sicilian slice is amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSVRrZFVkRmRyVVhoc1FteFFNa3BYUlMwM2RtYxAB",
            "text": "We were so happy with everything we ordered. Highly recommend this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRVUySm1ObkJzVGkxMk1YRXhSWGRxWVdvNFZVRRAB",
            "text": "I love this pizzeria, they make pies fresh and just right. I tried different pizzerias all over NY State and NJ and I truly recommend this place it excellent and I give it a thumbs up. And I do and  will definitely come back again and again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRGVYTkVNRE10U1RkSWNEaFplalpwZG14bGQzYxAB",
            "text": "Romeo Pizzeria is just an ok spot. I will not return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paV1kyUlVSSEZCV0dkTVdGUlFZMnhpV1MxcWJHYxAB",
            "text": "This place holds its own and then some in a tough market. It's a mile from New Park Pizza which is a mile from your other neighborhood favorite and your friend's favorite spot and so on. The pizza is great, the people are friendly and the price is perfect. They helped me waterproof my order tonight to walk back home in the rain and the crust on the other end was still delightful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4U2RuQlpWM0pKTlhWRGVtbG1RM2gzUzIxaExYYxAB",
            "text": "Great experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RVNTMTVRMDFCU1Rsd05uQmtXSEI0Y1MxWFUwRRAB",
            "text": "Romeo’s Pizza\n\nLayout/atmosphere\n*Five tables\n\nFood/drink\n*Regular slice - solid\n*Grandma slice - solid; garlic cloves"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Wk5rUlplSGxXYWtOVmVXMXVOMU5QYWxKVmQxRRAB",
            "text": "Best pizzeria in the neighborhood! My husband is New Park all the way, but I will ALWAYS pick ROMEOS on crossbay time and time again. Their sauce is so flavorful and their Sicilian slices are the best and my go to. Crispy yet fluffy. Thank you Romeos for being a classic staple in the community!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOck9XZDJiRzFXWmtWdmFXWldha1ZzUkVKdVlYYxAB",
            "text": "Delicious 😋"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHbGVtaEpREAE",
            "text": "Excellent pizza and the best Baked Clams in New York in my opinion."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKWGQ0SmZEd3BqZERnEAE",
            "text": "Place small and the pizza not cook enough salty oil thin and the price ridiculous"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLQ3A5Nm4xczRuZk9REAE",
            "text": "Went to have lunch today with my wife at Romeo’s and the food was outstanding. The server was unbelievable. What a great guy took care of us. Well, I enjoyed the food the apples everything was so delicious. Can’t wait to go back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VONmt1dHpUcVBtdnRRRRAB",
            "text": "Romeo’s got the best grandma pizza, I love their pie so much. Thank you Romeo’s so much. Delicious grandma pie in Ozone Park, Queens. 🤤 - 8.4/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZM3JYRFNBEAE",
            "text": "My kids love this pizza. I think the crust is better than most spots, it's definitely not undercooked which is a problem with most places but certainly not overcooked either."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHBXVGx3RRAB",
            "text": "My girls love this pizza spot. They are little pizza critics only the best will do. Next time I'm craving pizza i will have to sit inside. I love the drink selection an seating. Would not recommend bringing a stroller inside."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJanY2d25RRRAB",
            "text": "They are good, food is good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdWRhQi1RRRAB",
            "text": "I usually order my pizza as delivery, but when I do show up they treat the customers very well. Pizza is GREAT!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMFlqa2F3EAE",
            "text": "Really good food and reminds me of my uncle's pizzeria where I worked as a teenager and the taste had a fresh Italian piece of southern Italia to its the margherita pizza was made with fresh ingredients and the marinara was very acidic but also had a good flavor of garlic in it not too much onions because he hated when I put too much sugar and onions in our marinara sauce but loved his garlic just like me and I would overload the marinara sauce with garlic and pepper flakes in order to make it a little bit more savory and spicy than sweeter and acidic but because we didn't want people getting sick and having to go to a doctor after a few weeks and months we didn't want to use too much butter to cut down the acid and started pureeing the carrots and using the natural sugar to cut the acidity of the tomatoes in the marinara sauce but the pizza sauce was very good and I loved the fresh basil leads and mozzarella on the pizza slices was a great choice to make at romeos only if they had a brick oven it would taste like it came straight from Italy to the storefront like across the street at new park pizza shop and they don't know how to make it like romeo's does if only they were combined to be one entity but new park only does pizza while romeos is full service pizza spot on crossbay."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdHV6WXh3RRAB",
            "text": "Counter person was very welcoming and took my order right of way. 2 sandwiches and chicken fingers. Was told 10 minute wait. 10 minutes later counter person brings out food to me. Excellent service and great food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d3Zuc2RnEAE",
            "text": "I ate there pepperoni pizza and my day got so much better would really recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dDh2em1RRRAB",
            "text": "I've only ordered to pick up and it's usually either a pizza pie or chicken wings. Both are delicious. The space inside is small but there are chairs and tables. The service is good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRZ2QySWJBEAE",
            "text": "Keep it up you becoming the best pizza spot on Crossbay"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaHJiSDlBRRAB",
            "text": "The food is truly delicious here ! Very nice people and friendly. Variety of foods plus catering . Recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRN2NqMkdBEAE",
            "text": "We order from here once a week! You have to try the eggplant ricotta or the hot honey pepperoni with vodka sauce pizza… OMG you will never go anywhere else!!! Best pizza ever, super fast delivery, reasonable prices, and very friendly staff."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdWFHS2lBRRAB",
            "text": "The pizza is delicious 😋"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbVpDdjlnRRAB",
            "text": "Expensive however customer service is good and food is good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRZ0xlWkpnEAE",
            "text": "Best pizza I've ever had!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndnRTUmRREAE",
            "text": "Excellent food there!! The price was great too!! I highly recommended ⭐⭐⭐⭐⭐"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBMi1qLTVBRRAB",
            "text": "First time there. Very good food. Clean and friendly staff. Will go back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNXBISnd3RRAB",
            "text": "Good pizza"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfb3R5NEZnEAE",
            "text": "The Sicilian slice was huge and was excellent"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NFpIazJBRRAB",
            "text": "Always a great slice. I do not eat cheese so getting a slice with a tasty sauce is a great find. Definitely hits the spot. Vegetarian and vegan options."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNmNIWDJRRRAB",
            "text": "If you’re from Brooklyn or the Bronx you know GOOD ITALIAN PIZZA. If you’ve been to Ozone Park or Howard Beach, you would know that most of the pizza on Cross Bay Blvd are thin, expensive, and salty. Me being from both Brooklyn and the Bronx, honey Romeo’s will never see me again.\nHad an upside down sicilian pizza. It was ok, they put some low grade high sodium grated Parmesan cheese on it the sauce tasted too seasoned as well. Like it’s all being made by some wino craving salt.\nThen the garlic knots are extremely small at 4 x $2 and tasted like pure garlic. So I guess that’s what you pay for.\n\nNow the most heartbreaking part were these donuts that they called zeppoles. Grossssss. Why did they taste like cinnamon donuts. I needed the fried doe and powder. Please don’t get creative and then only have one type to disappoint my food loving soul.\n\nBut hey they’re in business and feeding people that like it. I’m just not one of them."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3bmFLb3p3RRAB",
            "text": "Luv luv luv their zeppoles 1 of MY TOP 10 in NEW YORK hot & crispy crunchy on the outside soft doughy & warm on the inside it's great just how its supposed to be & they r a good size also .. NOW the pizza on the other hand not my favorite…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2clBMbnp3RRAB",
            "text": "Fresh & delicious seafood salad, margarita pizza, and clams orgento."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4b28yQVFnEAE",
            "text": "Romeo's Pizza in Ozone Park, is delicious and  edible art!🤤🤩🥰😘😍 Cash only, (ATM  $2 fee inside)…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCckpuV1NBEAE",
            "text": "Delicious Pizza!!!! I would definitely stop by again for a few more slices when in the area!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTZ0k3cEhnEAE",
            "text": "Fresh Pizza 🍕 ! Excellent service! Assortment of Italian made specialties, small inside , cash  💸 only , no parking area  feed the parking meter too. I love there Sicilian Pizza .I recommend this location to all 👍☺…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMjRPRmFREAE",
            "text": "Although it's cash only and on the pricey side, it is worth every penny.  Food it delicious,  staff remembers you even if you haven't been there for awhile.\nMy wife went in recently,  although it was early and they weren't ready to do baked clams, they did it for her.\nWe love their mixed fresh seafood. But their pizza is second to none. Their pizza in our opinion is NY BEST. Any topping you want, they have. You'll eat every bit, not even the crust is left over, in fact you work your way to the crust and that's the finishing point.  That leaves you completely satisfied and filled.\nLove this place!!!\nI'll update with pictures next visit so you can visualize how delicious their food is."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2azlpRTJ3RRAB",
            "text": "One of my favorite places for garlic knots, they are soooo good and tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNTctN21RRRAB",
            "text": "We love the pizza but this time they failed by giving us a uncooked pizza"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQLWRIaFdnEAE",
            "text": "Great pizza & people, from a local who’s picky about both! Upside down slice is my fav- tender dough with crispy bottom & delicious flavorful sauce covering the cheese"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbExhS2RnEAE",
            "text": "I remember when Romeo owned this pizzeria and made good food. When he and his son died (tragic story) and these young guys bought it, it turned into total mediocrity ...\nBland dough that is often very undercooked. Very light on the mozzarella, which tastes more like food vendor bought junk that's overly salted to create some flavor as opposed to authentic Italian made mozzarella with that depth of flavor, and a thick sauce more in line with a Bolognese or marinara made from a mirapoux or sofrito mixture than an actual pizza sauce simmered in large pots for 6, 7, 8 hours straight to create that bitter-free, rich pizza sauce taste.\nIs there worse pizza? By far, so I won't say don't come here. Hell right across the street is even worse. But if you're looking for what this Ozone Park/Howard Beach area is really known for (some of the best Pizza in all of the 5 boroughs, being a true old school Italian neighborhood) than gona few blocks down in either direction and look for New Park or Ozone Pizza"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaTZUMDFnRRAB",
            "text": "Amazing pizza place at Cross Bay boulevard. Loved the chicken tomato pizza."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN01ubmlBRRAB",
            "text": "Been going here since I was a kid, love the pizza here all the food really. Not longer living in queens but still make the trip to go and have a Romeo’s slice"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNzZmQUhBEAE",
            "text": "THEY ARE THE BEST,  FOOD AND SERVICE. HIGHLY RECOMMENDED."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcE1DMTJ3RRAB",
            "text": "Stopped here on the way back to the airport, In October 2022. My family & I came to visit NY (from ARIZONA)   for a week & we were on the hunt for GOOD pizza. We thought we found a good spot but this little spot was by far my favorite! I STILL think about that ONE slice of Pizza & \"Little powdered donuts\" I had. We were in  hurry to eat & I'm sad I couldn't eat more. WHAT ID DO TO GO BACK ! =(  IT WAS DELICIOUS!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRM2NUdjdBRRAB",
            "text": "Pizza is soooo yummy here and great to go after school is done"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCaEptWkFREAE",
            "text": "I enjoyed their sausage pizza and chicken rolls. Garlic knots were delicious and definitely some of the better knots that I've gotten from pizzerias in the area. Compared to other pizzerias on Crossbay, the prices at this place were actually not that bad in comparison. Only downside is that I think this place is cash only"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNjlfNXFBRRAB",
            "text": "This place is outstanding.  I spent ~2.5 weeks near JFK for work in 2016 and a coworker (no longer living in the area) knew about this place form many years before.  We ate here almost every other day of our work trip (in part due to…"
        }
    ],
    "reviews_count": 53
}