{
    "name": "Cross Bay Diner",
    "place_id": "ChIJDXQudX9nwokRJoYaIcOsTdM",
    "grid": "QN10",
    "address": "160-31 Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.2,
    "user_ratings_total": 3617,
    "phone_number": "(718) 848-9401",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMWRVeFNRMjB0U2psM1gzUlBkRVExUzJwQlJXYxAB",
            "text": "Best diner on cross bay"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KS1NWWlhaRXBSYlhWc2FFZ3lVR0ZvYW1wVVUzYxAB",
            "text": "Didn’t even bother to acknowledge you after 30 min of seating. Do not go"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpbGJiZGV3EAE",
            "text": "I visited the diner today and had an unfortunate experience of bullying by management. I attempted to use a valid Citibank card issued by the bank. Manager claims they don’t take cards that don’t have chips. Citibank operates in accord with New York State banking rules (in Howard Beach) and regulations. Language used against me: “I told you last time.” “I can’t visit every bank.”  This is unacceptable as I’ve been a long customer and spent a lot of money at this diner. The card was processed on their machine regardless. If I get denied my legal rights when I use the card provided by the banking institution, I reserve the right to call Law Enforcement in order to get them to follow the law and stop the petty nonsense. Chips on cards don’t always work!!! I was told, “do what you have to do.” And Did. 1 star. Poor service, bullying by management, harassment of a long standing customer. Lack of interaction with patrons. Poor communication. Unqualified for management. One manager left recently. Update: This is not a recent review as system indicates. And is true as written. ***Permanently Closed***"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wQ2IxQjJkMkZ5UkhaeGJTMU5NVzVSVjB4bVZsRRAB",
            "text": "Service is fine the food is absolutely horrible.  Today I had pastrami on rye.  The pastrami was like shoe leather, literally.  I keep going back hoping my bad experience was just a one off but no luck each visit is as bad as the previous. Stick to breakfast only here."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcVNHeEpVMjlOVHpKUVRGWkNWbXByYUMwNVpFRRAB",
            "text": "So I’ve been coming to this diner for over 15 years same guy behind the register with the same attitude… They forcefully put a 18% tip on the bill I asked if we could pay less on our tip because i was $2 dollars short the bill that was $309 dollars But take in mind, they charged us $12 for pickles SMH.  he said No, you can’t and if you don’t give 18%, we won’t serve you again.. and if I don’t like it, I should just sue them lol so I end up charging my credit card for the extra few bucks.. The Food is OK. The staff  needs to have a little more respect for the customers…."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQ2RWOWxVWEp0TjJWU2FVTnROVFJYVEdGRmRHYxAB",
            "text": "Nice experience and food, thank you!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOM2NWOWxWM2xIZG5wR1NuVlRUWGwwVURWbWNtYxAB",
            "text": "Casual New York Diner...muffins baked in-house"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VVYybG9PWEkwWkhSQ1IyRTVRbXN0UkRSNE5uYxAB",
            "text": "Good food. Fast and quick service."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NVVWRnpWV3RqWkc5b2N6UndXRzFLU1ZObGJVRRAB",
            "text": "I don't recommend the sandwiches but everything else is a plus."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ka1IxUkhVM1pmYlRCRVREVjFVMXBXZUZoYVJrRRAB",
            "text": "Great food and service !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMU1HdDRaa2wyU2sxdU9VMVFaMVF5UmpsV1NWRRAB",
            "text": "I had a very lovely breakfast with a very lovely women."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odGRuUnJXVWhMVUdRM1UybFNlWGR2WDFObFptYxAB",
            "text": "The food was delicious. Our waiter took amazing care of us.\n\nThank you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQmQzSXlNell3WWtFelQxUTVVVUphWm5WV1EzYxAB",
            "text": "I don’t do reviews, but this time I had too!\nOrdered an iced caramel latte. It was 10/10 super delicious. Will be comming back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdGVWQlZiVmhGV1MwelpWZERTekpwZWtOUFdGRRAB",
            "text": "Great diner with reasonable prices. Stopped in early morning before our flight from JFK. Great food, and also convenient parking."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaVpraE9RMWgyV25KaU4yUmhiMGswWVY5R2IzYxAB",
            "text": "This diner is very clean and has a good atmosphere.  Food is delicious.  Staff very courteous.  I highly recommend eating here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeVYzWndkMU4yTTNOU1FWZFVWbU5DWlVSaFlrRRAB",
            "text": "Great Diner"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaFQySkRTWEp2ZG5SVGJHbFpXVWRLT0VGWVZsRRAB",
            "text": "Good food"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbXBLUzRnRRAB",
            "text": "Traditional diner, conveniently located off the Belt Parkway on Cross Bay Boulevard in Howard Beach. The menu is extensive and everything is good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMmExQnBUM28wZG0xa1V6ZHVTV3BVU0VOdmIzYxAB",
            "text": "Great 👍 food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMFdISk5TRVJ4T0ZONGVrUm5NV3BTYjNoSFlYYxAB",
            "text": "Dinner by the bay. Breakfast is good and staffs are nice"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNGRheFl3EAE",
            "text": "Nice place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oaVpHeDRWVVp4YUd4RU9VcHlVM0ZPVEZoTGNVRRAB",
            "text": "All around service is perfect"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSmJtTndZa2RsV0dWQmRWRmtVbk5VUW5JMGNXYxAB",
            "text": "Open late"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxU1JrTXRlalZ4VFd4RmIwbHVjWHBDUVZkdmFFRRAB",
            "text": "Most expensive diner in the city"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnb3RQRWFBEAE",
            "text": "Food delicious, fresh ingredients and portion size good.  My family loves to go there."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taM09YSjZjMUIzVVdKT1ZUaFpaRGwxWVVoNU9IYxAB",
            "text": "Perfect breakfast spot!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbFMwTm5iVFpWUW05cGMyNDJja1ZSUTI1U2RFRRAB",
            "text": "Good Diner with great views of the bay.\nStaff is very friendly and the food is good.\nI went with friends for breakfast."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRk1IcGZNbmxRV0U1bE9IQlZXVmh1U0ZJMmVuYxAB",
            "text": "How do I start the service was average the girl made a few mistakes but she was very nice she was nowhere near properly trained now the food was horrible I will never ever go back to this Diner ever again I'd rather drive an extra half hour 45 minutes somewhere else then eat at the Crossbay Diner one thing I definitely will say the place was clean I looked in the kitchen clean bathrooms clean but that doesn't make up a terrible food and they definitely need to learn a difference between tenderloin and skirt steak I asked for a pork souvlaki and I said to the waitress please make sure they do not make the meat well done the meat going to come out well done it came out over done past well"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRVlWcHZNRUpEUlhGalVGQXlVelV4UVc5b2NXYxAB",
            "text": "That's where my 8th grade Senior Prom took place back in June of 2008 before my Middle School Graduation from I.S.73. The food for dinner there at the time was astonishing."
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNdFp5ODR3RRAB",
            "text": "Buen desayuno y excelente atención"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRM1RHNXdXR0pvV1RsMFltczBiSGhSUnpkc1FWRRAB",
            "text": "Amazing!"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdU4yaDROWGd3ZG5VdGRHOWFRbGN6VkVsc1VWRRAB",
            "text": "Mondo 🥲"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cE9XcERNbko0WlZCNFJrZ3daWFZwUkZsd1NFRRAB",
            "text": "Had a hiccup however they fixed it in seconds"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWak4waEZaRE10VTJWSmJtdGlUVkpYY0dsemIyYxAB",
            "text": "Great spot for breakfast! The atmosphere is cozy and family-friendly, making it perfect for a relaxed morning meal. The breakfast food was tasty and satisfying—classic dishes done well. Service was friendly too. We’ll definitely be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcjhXNkxBEAE",
            "text": "We love the waffles! 😍 will definitely go back in summer and sit next the window to see the boats.. food is typical diner food.. usually diners give coloring stuff for kids but this place didn't.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbjI4dG1MMk1uYWRBEAE",
            "text": "Old-fashioned style diner booth seating high pace restaurant can customize any dish you desire for adults and kids as you can see my daughter chose a mini pancakes with sausages. Me and my wife came here driving through the Cross Bay. We decided to stop for a brunch at this diner."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLZnJsdGFRenV6bGRBEAE",
            "text": "I recommend breakfast here. The pasta and sandwiches I would pass. They lack flavor and are on the drier side, but the breakfast…the breakfast is SO YUMMY! The fall waffles are amazing. The whip cream is EVERYTHING."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdWVXVGlRRRAB",
            "text": "Tried them for the first time today. Very nice spot with nice view of the waterways in area. Very decent parking lot available. The hostess and waitress we had very nice and accommodating to our request (wanted a change in seating to be by the corner and view. They hooked us up). Waitress was very knowledgeable about the menu.\n\nFood came out and was good portion sizes. Nothing too greasy and oily. Space was comfortable as well. Definitely want to try this spot for lunch/dinner at some point."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NU1Qa1dBEAE",
            "text": "Hands down the best diner in Howard Beach! The food is always fresh, delicious, and generously portioned. Whether you’re in the mood for a hearty breakfast, a classic burger, or a late-night snack, they never disappoint. The service is top-notch—friendly, attentive, and fast. The atmosphere is cozy and welcoming, making it a great spot for both family meals and solo dining. If you’re looking for quality food and great hospitality, this is the place to be. Highly recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPYjIzLXFKMXBPT2lnRRAB",
            "text": "Awesome diner with a huge menu and warm atmosphere. Staff is friendly and the food was terrific. Would definitely come back to try more items. Highly recommend!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNzZUZVRREAE",
            "text": "My first time in NYC in 18 years and a family member picked this place.\n\nThe sandwich I had - Cubanito - tasted horrible and the meat was ANYTHING but fresh. The off flavor was not covered by the mustard. I was starving after traveling for 16 hours.\n\nThe fries that I picked off of my sister’s plate were good and that was the extent of the meal.\n\nMaybe they were trying a new take on diner food but I’d avoid this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyOHZYRVp3EAE",
            "text": "Nice diner. No too large, with sun exposure in three directions, so it’s nice and bright inside. Got a booth by the window as soon as we walked in.  Food was good. Coffee was hot and kept coming. The menu shows the price for cash vs card next to each item, which was nice. The lady serving us seemed as though she didn’t want to be bothered. Which wasn’t nice."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMElQckhnEAE",
            "text": "After a long flight into JFK  we were starving. We stopped at this Cross Bay Diner, which is close by the airport for a bite to eat. We went in with low expectations and came out delighted that we chose this place despite our hesitation. It’s quick, easy, no-nonsense and the portion sizes are huge. We could not finish our dishes. We’ll be back next time we’re in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5N3ZpaG1RRRAB",
            "text": "Where do I even begin? This diner is an absolute treasure! From the moment you step through the door, you're greeted with warmth and hospitality. The atmosphere is cozy and inviting, making it the perfect spot to start your day. And let's talk about the breakfast – it's beyond delicious! From fluffy pancakes to perfectly cooked eggs, every bite is a delight. But what truly sets this diner apart is the friendly service. The staff goes above and beyond to ensure you have a fantastic dining experience. Whether you're a regular or a first-time visitor, you'll leave with a smile on your face. This diner has become my go-to spot, and I can't recommend it enough!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNDZiSE13EAE",
            "text": "I would have given this place full 5 stars but I only tried the apps, but I'm looking forward to my next visit.  The L.I.T I had was completely on point - zero disappointment. The wings - Buffalo, where yummy. I loved the fact that the wings were a dry rubbed type, so it wasn't wet. However, you could smell the Buffalo sauce, which made you want to try it even more.\nThe service was great.  Everyone was super  attentive  - it didn't matter if they were waiting on you or not. Definitely a must try if you're in the Howard Beach area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSanFUcW9nRRAB",
            "text": "It was empty when we arrived, and we were fortunate to get seated right away; that is where our fortune ends with this place. As most of the food ordered here wasn’t very good\n\nMy favorite item was the egg cream drink, and that should say a lot about the food. It seems like they prioritize quantity over quality; This is telling when you see the overwhelming number of menu options. Our waiter was no better since he came out over five times to verify our order even though he had a notepad on him. Finally, the food was not very good and tasted mediocre.\n\nIf I ever came back to the Queens area, I would never return here. Go to a dinner chain instead."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c3QyRC13RRAB",
            "text": "Place was pretty decent looking when you walked in, it was visually appealing. The hostesses seem like they rather be somewhere else. The diner has a great array of consumers at that time of day. We were seated in a booth far back by the window. Which was fine I wanted a window seat.  Our waiter didn't introduce himself he actually didn't say too much. He just gave us all the menus & asked if we knew what we wanted to drink.  All in all the place was fine, we ate  well, some of the food like the crab cake was beautifully prepared. It was pretty basic as far as taste. Would come to try other items but not a bad place to go for a quick bite."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncnFXMGZBEAE",
            "text": "Cross Bay was a great finding! A couple of months ago I was picking up a friend on JFK airport and got hungry. We went there for food once the Dinner is 5 min from the airport. The food was great so when I was coming back from my flight yesterday, we stopped there for food. The menu is a typical dinner menu with pancakes, eggs and waffles, but they always have different (and good) seasonal stuff. We couldn’t resist their specials and I got a Waffle Benedict and my husband got the Buttermilk Fried Chicken sandwich. I know I said breakfast, but in our defense we had airplane breakfast at 4:30am on the plane! 😬\nFood was tasty again, all flavors matched perfectly as the last time, service was great and the atmosphere is awesome! That’s our new spot for food after flights from JFK now!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdjdtREtBEAE",
            "text": "Went to this diner with my girlfriend on a Saturday night around 7pm.  After parking the car in a crowded lot, we took our seats. We sat about 5 minutes waiting for water, and eventually received our meals 35 minutes later which wasn't good.  Our waiter was cool, very organized and able to jot everything down, but we felt like the service was very slow and we had to raise our hands several times to get what we needed. I would not recommended anything from the sandwich wrap menu.\n\nWe ordered chicken wraps, and felt like the diner was cheep on the chicken and the wrap was overloaded with lettuce and others.  Definitely will not order that again. Parking was ok, bathroom was clean, area was bright and the place was spacious enough to hold private conversations.  I was shocked at how fair the prices were.  Nice job with the pricing menu.  We'll come back if we pass by, but not one of our favorites."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eGJqTmdnRRAB",
            "text": "I haven't  been to the Cross Bay Diner in years. I was very happy we decided to grab lunch there.\nEverything was great, the price was fair, and the service was awesome! Next time I'm getting one of those yummy looking pastry too!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dExmQ3F3RRAB",
            "text": "We had a great time , the place was clean and friendly   .\nWe ordered the Bacon and Avocado on toast  , and a Garden Burger deluxe  , everything came hot and fresh  ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacExVWkJjR2RGWm5SVmJHRjJjR2xRYTJoeFNHYxAB",
            "text": "The old lady at the front desk is horrible. She seems so miserable. The wait staff is so pleasant and the food is okay but the lady behind all the cakes is such a nasty human being. If it weren't for her the place would probably have been a better experience. She should retire if she's not satisfied with where she is in life."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNWFhTEVnEAE",
            "text": "Amazing food.  Everything was more than amazing. Service was superb!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eXFLTU53EAE",
            "text": "Came to the diner on Sunday(Mothers Day) it was packed. We were actually seated right away (no wait). Had enough time to look over menu which catered to almost anything you want (breakfast/lunch/dinner etc) prices are a bit high but is expected. The Food did take a little while to come (perhaps due to mother's day). Server was in and out, had to look for him a few times however Everything tasted awesome especially the Vanilla Ice Cream Soda 👍"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMDdUc1FREAE",
            "text": "The place was right across from my planet fitness gym I've been going to for the last 3 years so I just decided to try it out. I has the chicken and waffles, mozzarella sticks w/sauce, chicken parmasean, pancakes with blue berries an strawberries from the brunch menu. Overall it was a delicious meal. The only thing that they messed up was the pancakes which wasn't cooked thoroughly so we had to send it back. The attention given by the waiter was great so he wasn't to blame and I still tipped him well. The screwdriver drink I had with my brunch special was quite strong so I like that. The place was clean and there was a lot of people on there. The wait wasn't long for the food. I would go back again"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2X3Q2SzhRRRAB",
            "text": "I’ve been here a couple of times & enjoyed their food but this time I wasn’t too satisfied with my order. They forgot to give me waffle fries like I had asked for(got def fries) my chicken wrap was way too full of avocado & the mozzarella sticks were dry & over cooked..they usually taste good but this time they only tasted OKAY cause of the homemade pink sauce I had made of my own. Next time I’ll definitely just go with what I originally wanted instead of choosing something different or tell them to go light on the avocado.Their breakfast is great though..def. suggest their French toast."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXc05pXzJRRRAB",
            "text": "The best breakfast I’ve ever had in New York. Highly recommend the Eggs Benedict. Bacon was better than the sausage. But the sausage photographed better. Wonderful view of the water. Servers were excellent and there was parking!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURha0kyWUZ3EAE",
            "text": "Been to this diner a couple times but always forget to take pictures and leave a review.\n\nTo be frank, I have no concerns, inquiries, or gripes about this place.\n\nAlways refilling my coffee, bacon was cooked crispy just as I like em, and who complains about eggs however way they’re cooked. I used to get their Belgian Waffles because they’re crispy on the outside and soft on the inside. Definitely need to get that when I revisit but I was just feeling eggs and bacon for breakfast today.\n\nThey have their own parking lot and street parking available. Best and only convenient diner of Cross Bay!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbElEVVB3EAE",
            "text": "Vast meal options for all times of the day. Staff is friendly, prompt and helpful.  Food is quite good though it can be pricey. There are early bird and breakfast specials if you are budget conscious. The brunch menu is worth it in my…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOMlkzRmh3RRAB",
            "text": "I love it here. I go to this diner 2 times a week,my best friend and I always get the bacon 🥓 eggs 🥚 and cheese 🧀 on a roll cause this New york u know the vibes!! And a Philly cheese steak with everything on it!!! It be bussing!!!!!!!! Oh yeah and don't forget the 🍟"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdmZEWENnEAE",
            "text": "Good diner, although I really miss a southern diner breakfast! Milkshake was a little overpriced at $8 and not very big. The beef patty on rye was tasty. Enjoy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdlluWDZnRRAB",
            "text": "Came here for a quick bit to break my fast.\nFood was ok. Coffee was good.\nService was great. Other food looked delicious, I didn't like the hashbrowns.\nThey had a whole big case of yummy desserts that If I was not on a diet I definitely would have gotten something."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d2ZuWDNBRRAB",
            "text": "Local diner, typical, pretty costly. The food is as expected nothing bad nothing that blows you away. Except the mozzarella sticks that were each the size of a twinkle. That was different lol Pictured: your basic scrambled eggs with bacon, homefries, toast and mashed potatoes with gravy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SalEwOWxlV3BZY0RrNGNYZGtUbXRZWVhaelRsRRAB",
            "text": "Today happened to be the 99 degree outside day and I made the absolute mistake of staying n dining here w zero air conditioning. It was absolutely sweltering.\nThey should’ve mentioned before seating us that the place is an oven.\nNever again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhcXQya3pBRRAB",
            "text": "I ordered a BLT (see photos.)   It was tasteless and the presentation was awful.  There was not enough bacon, lettuce, tomato or mayo on it.  My friend ordered the same and theirs came with no tomato at all.  The french fries and onion rings were delicious.  I was very disappointed and will not be returning."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdTg2ejd3RRAB",
            "text": "I’ve been coming here since the pandemic and I’m upset that I wasn’t coming here before.  Everyone here is so nice including the owner who is always helpful.  The location is convenient and they have plenty of parking.  The food is always…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMFAzbW5nRRAB",
            "text": "Whenever I'm in New York must stop in and at least have one breakfast meal there before I go back home. The staff is so accommodating the servers are extremely polite. I love coming there it's like coming home to family every time I have a meal there."
        }
    ],
    "reviews_count": 67
}