{
    "name": "KPOT Korean BBQ & Hot Pot",
    "place_id": "ChIJEdCpPwBnwokRu0B2TwrQMpo",
    "grid": "QN10",
    "address": "161-49 Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.7,
    "user_ratings_total": 536,
    "phone_number": "(718) 808-1049",
    "reviews": [
        {
            "date": "2시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaU5WUmtkbEF4YXpOcGNHdG1kakJxZDNObGRGRRAB",
            "text": "Do you want more 5-star Google reviews? Best of all, they’re free! We can provide as many as you need to help your business reach the top of Google Maps. Contact us on Telegram: @gthisjpeg"
        },
        {
            "date": "7시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV05qSktiMEZRY0VjdGJqTk9PVzVMYkRWSkxVRRAB",
            "text": "This is the place you wanna go if you wanna throw a party in Howard Beach. Great food, great vibe, great service."
        },
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OekxXbzJkMjR5ZW1NMmVtTTBOazVuU2kxWGNrRRAB",
            "text": "The restaurant environment is really good"
        },
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVFdWWlBXR3d0YlZkT2VHWnNNMDFLUTJKb05sRRAB",
            "text": "Food was great! Very very good for the price."
        },
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVVlXdG1MVXg0Y0V4T09UZDZUSE5uZUc1U2NYYxAB",
            "text": "Great AYCE place. Great food, great service, great vibe! Highly recommend!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsM09FcHVaM2hhUW5oS2QzaG5NVFYwTjBGNWNHYxAB",
            "text": "Fast service! Lugo was attentive and efficient! Food is always fresh given that it is buffet style. Servers are always cleaning up the Buffet area as well as individual tables. Would definitely recommend!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWldHUjZlRmQzVFRsclUyc3hlamxOYVRsMVlsRRAB",
            "text": "Love this place ! Servers are so polite & nice"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUmJUSlVNR2g0U0VwaVZqTktkV2hCTlVWVFRsRRAB",
            "text": "Very nice experience for my birthday. Very nice waiter jacky."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SkxWZDZNbWRITUZSTFJFZFNSa05yTjA1bFFuYxAB",
            "text": "Thank you waiter Jackie for helping us tonight :)"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25relNGODFNbmx2TlZSV1RFZFhkbmx6WW5oM2RGRRAB",
            "text": "The staff here is truly exceptional, providing quick and efficient service that keeps us coming back time and time again."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcVkzY3diREJRVEY5RldXWlhha2xKYmpGb2JHYxAB",
            "text": "This is the worst KPot I have ever been. Our waiter Jacky is not attentive at all. He only gave us a few cups of water the whole time. We have to ask other waiters to look for him to change the hot plate for us. We have six people doing all you can eat BBQ. Six people are sharing one hot plate. The hot plate is not even hot. It takes forever to cook the food. DON’T GO TO THIS KPOT."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcVdqTlFVWGt6T0d4Tk1scHJSVGd5VWs1a2VtYxAB",
            "text": "I love the place and the perosn is approavhable"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SGJGOW1OV1JSZW5SRk5VZENVR0pQY0c5WE1IYxAB",
            "text": "Good food great experience first time coming in we’ll definitely come back for more."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNGJtOWFaVk56U0Vnd1RGUjBXWEJIWDFaMVZIYxAB",
            "text": "first time trying out a kbbq spot, our server, Ben, was very helpful and informed us on how it worked. with the kindness that was shown it made it an enjoyable experience."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCT1drSkxhemhQY1RCaVMySjRhak5vVnpkR1FuYxAB",
            "text": "The food was fresh, flavorful, and the vibe was lively in all the best ways. But the real standout was our server, Ben. He was attentive, upbeat, and made sure we always had what we needed — without us ever having to ask. Truly top-tier service! We left full, happy, and already planning our next visit. ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFME1tNDJSelpWY1ZsamJ5MTFkVUV4YmxkQ1NrRRAB",
            "text": "Ben our server was excellent, very attentive to detail and patient. The food was very delicious and filling. I was full off of the soup alone. I would definitely come again!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcmFIbHhiM0pFVjJONk0xSm5kVlJFV0dwRGMyYxAB",
            "text": "Great everything.  Food . Service. Atmosphere.  Selection."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sa2MzVnBURFJ3YjNCU01EVlpMVGhzZDNkM1NFRRAB",
            "text": "Lugo was my server and he was amazing! He was very friendly and helpful. It was the best experience I’ve had at Kpot and I’ve been to Kpot in more than 1 state. Great staff!!!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRFVVZFdTVkY1VGtkTlRHZzVUbk5OV0VwMWRVRRAB",
            "text": "My server Moe was the absolute best. The food, atmosphere and ambience was also great. Will be going back next week!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcE5UaGlUbG8yZUZaWVFUaFNUbGxmV2tkbWRtYxAB",
            "text": "Most amazing food restaurant you could ever go to. I love everything here. Everything here is so amazing. I love it. I love it. I love it wow."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaVVVNXZYMUU1Tm1OUGVtUlZRVXQ1VFV4dlgyYxAB",
            "text": "Great food great price great service"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadlRHZFpPVkZsT0daRVEzZzBNRjlMWm5Bd1VFRRAB",
            "text": "I've been here a few times before but my daughter wanted to go for her birthday yesterday and we all  had a good time. The drinks and food was good no complaints. The workers did an excellent job with Singing happy birthday and taking care of us. I l arrived hungry and left stuffed."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRWJXZE5VazFOUTJWR1N5MWlUR3hQUnpSaGRWRRAB",
            "text": "Been coming here awhile new server Jackie was a joy. Attentive and polite!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjeFIzSTNRbmc0TUVrd00wSXpWemxJUkdkRVMzYxAB",
            "text": "great Location for KBBQ&HotPot\nSmall Parking but def Worth the Wait\nThe Area Itself has Calm vibe"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prelgxaHpZM1pmUVhCSVZqVndiM04yUzFjd1NXYxAB",
            "text": "Moe was a 10 out of 10 for a server, i’ll be coming back because of her service. Give that girl a raise! If you don’t pay her more, somebody else might!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORWNESnhlWGQ0VURsTVkxWXpPVmh1VW1JMWRYYxAB",
            "text": "Jacky was an amazing server! Very informative for my families first times being at kpot. Jacky was helpful with food options and recommendations. He is very attentive to his table and always around when you need him! He has a very very polite attitude!❤️"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUk1XUXdaa2hGWVhkaGJVeHFSVTl6WkRWSVNVRRAB",
            "text": "This place was great, good quality meats & great atmosphere. Lugo was the best server, super nice and calm."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTE1uRlZOelJpT1hkd1lsUTVhbFpYUmpaM01GRRAB",
            "text": "This place is awesome! The food is amazing, the meat is well seasoned ever before cooking, and the selection is great with many food options to choose from. Additionally, Lugo our server was great, he welcomed us, walked us through how everything went, and was extremely helpful. Will def be coming back"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWaGNIaG9lbEJxU0VGa2IzWnhTVFpsTVZCeE0wRRAB",
            "text": "Service at K pot was really amazing with Moe as our host. Moe made sure our drinks were always filled, empty plates were off the table and meats were continuously flipped. 10/10 will definitely be coming back to this location."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NE4yZG5ZbVZtZUVSeFRFMUlkV3QzVEVkQ1RVRRAB",
            "text": "The food was so good. The people were so nice and respectful."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gb00yMVZiV2xTTTBkMmNFWk5kMUExVTFsb1pGRRAB",
            "text": "Was there last night, was served by Lugo and what a great experience! The service was top tier and the food was great! Will def go back to relive the experience!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGemNrNVJaa2N5YW5wZlV5MURTWHByUVhGdWRrRRAB",
            "text": "Our server lugo was amazing. Definitely will recommend others to come. He ensured we were good all night. He is a very genuine and honesty person.\n\nThank you Lugo once again for making me and my friends night fun and more special."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdU9XWXdNME5ZZWpsb1ZYaExYMUpTTjE4NE9HYxAB",
            "text": "Had a great time, awesome customer service, they explained everything as it was our first time."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGblJIRndXa0pIZW1oeFpYZzBhbVV6WW0xT1RXYxAB",
            "text": "Lugo was exceptional. Attentive and very welcoming and accommodating."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMWIzVXpZVWRHVG1Jd016aHhNbXQxY1hoS09HYxAB",
            "text": "Lugo was absolutely great! From recommendations to service he was attentive and kind 10/10"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bk5sUk5TSEJXWW1oVlNFbHNaWE5UT1RGd1kwRRAB",
            "text": "Went for my niece 15th birthday. She had a good time l, enjoyed the whole Kpot experience. We were surprised and happy to hear the birthday person eats free with a party of 5 or more. Just let me say this if the birthday person does not have an physical ID they won't be eating free. If the birthday person is a child bring their birth certificate and one of the Parents ID to match the birth certificate. They will probably say the person on the ID must be there. They come up with any and everything thing not to give a free meal which they advertise, but  leave off the fact you must bring your 6 points verification like the DMV."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRFJFZEhjRnBSU1dGSlkwNUxWM3BEYW5BeWQyYxAB",
            "text": "Armando was great, attentive and  great server. It was my first dinner out with my little girls. An experience I’ll never forget. I’m vegan and  Still had a great time ."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOblpITjNhRXRzWmtveFoxaGxiRXBrWDA1elRFRRAB",
            "text": "Has an amazing time. Armando was a great server."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sb2FWQjZZMnBrTVdFd1ZXbEdRVXh6VW1KcmVrRRAB",
            "text": "I've  been coming here for about a year.. and never received  serivice like this ..LUGO WAS THE BEST HANDS DOWN!!  HES VERY ATTENTIVE AND VERY FRIENDLY!! HE MADE US FEEL LIKE WE'RE  SEEN .. THANK YOU LUGO!! SO MUCH"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVmVqVnhWWFZhTlU4MlJVOHRVelJhYzI1MlZVRRAB",
            "text": "Lugo was amazing my friend and I have been over 10 times an this was the best experience we have ever had thank you for being so attentive to us"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BelJFZG5Ra1phTFZkUWFWaG5kMHRmVlhkRVNFRRAB",
            "text": "This was my fifth time visit. I had an amazing experience here! The hotpot broth was rich and flavorful, and the BBQ meat was fresh and juicy. The staff were very attentive, always making sure we had everything we needed. The atmosphere was fun and lively, perfect for a group dinner. I’ll definitely come back again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MmVEZFVVMFpZVWxrMlFWbzVUbDkxZDIwMlowRRAB",
            "text": "II’ve been here many times and the experience has always been great. The staff are helpful, the food is delicious, and the value for money is excellent. Hotpot and BBQ together for just $5 more is unbeatable."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcGJLTEpREAE",
            "text": "This place can feel overwhelming at first because there are so many meat options—chicken, beef, lamb, pork—and even seafood like fish, scallops, squid, shrimp and calamari. There’s also a sauce station with just about everything you can think of.\nThe explanations are available, and the staff is very helpful. Our server kindly showed us what to do and where everything was when we asked.\nThere is a station with desserts and ice cream, as well as a selection of pre-cooked mostly deep-fried food for those who don’t want to wait.\n\nPersonally, I love this place. It feels like your own little cooking class/school. You get to experiment without the hassle of shopping, cleaning, prepping, marinating, or cutting—it’s a great time-saver. It’s a perfect way to try out cooking in a fun, hands-on way. It helps if you bring someone who’s done it before, but even if it’s your first time, exploring on your own is part of the fun.\n\nI forgot to mention that you have some fruits, vegetables, and noodles that are typical in Korean cuisine. If you’re not familiar with them, it’s a great opportunity to try something new and discover new flavors-it’s a great option!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eE1VZEZSMmhIT0VzdFJuTjBSMmRKT0ZwcFdXYxAB",
            "text": "My first time trying Korean BBQ, The overall atmosphere is good and I would visit again. However; I gave them 3 🌟 because a 18 or 20% gratuity is added which i feel is wrong. We are basically doing everything ourselves except getting our own drinks therefore gratuity should be up to the customer. I am a tipper, let me make that clear I want to tip based on the service I received.\n\nIn addition is best to choose Hot pot or BBQ because if you say both at check in you will be charged for both even if you change your mind and only have one after you're seated."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKYU9XWk1Sa0p3ZUVoYVRubHBURVY0VFhseWMxRRAB",
            "text": "I had a great time. Its a little pricey but worth it. It made more sense to get the pitcher than individual drinks for $12 so that's what we did. Everyone got about 3-4 glasses each. 🥂 sorry I was hungry/ greedy and forgot to take more pics. Spent about $160+ I think and thats with a $3 discount 😪"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preVJESnRkbWRyTkVsUlJ6QmhiVlpKTmtJMlprRRAB",
            "text": "I had an absolutely fantastic experience at this Kpot location hands down the best one I’ve been to in New York! From the moment we walked in, Jay and Kevin went above and beyond to make our visit memorable. Their service was truly exceptionally attentive without being intrusive, friendly, and incredibly knowledgeable.\n\nThey catered to our every need with genuine enthusiasm, answered every single question we had (even the picky ones!), and made sure we were comfortable and satisfied throughout the entire meal. Whether it was keeping our table spotless, recommending the best broths and sauces, or making sure our drinks were always full, they nailed it all with professionalism and a smile.\n\nIt’s rare to come across such dedicated staff who clearly take pride in what they do. Jay and Kevin elevated the whole experience and thanks to them, this location has officially become my go to Kpot. Jay and Kevin are the best!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBM2F5RExnEAE",
            "text": "This place was so cute! Went to lunch with my friend and it was just such a great experience. It wasn’t too packed, played great music. It was super clean and the team was attentive to not only the cleanliness but the customers. They had an amazing lunch special $20 for two hours I believe and we had really cute drinks that was the special for Valentine’s Day! You will get full so choose your noodles wisely! I had the udon noodles and I was full af after one serving. However they had so many options! I loved it here and I would definitely go back and try other locations as well!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nd1h6ZDRUVlY2TFcxVk4zQlZhbmgzV2pNemRsRRAB",
            "text": "The servers are very pleasant. Moe did a very good job. The food is always fresh with great selections and the restaurant is always clean.  It is my family's favorite place to go."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTE4zVk5kSGhETkU5aWRVc3hhMVk1U0RkWmNGRRAB",
            "text": "This is a fun experience to cook  and flaro your own food.   I love the ramen and  pork belly.  Great for large groups and celebrations"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoZldGa3pURmhtVkZneWJWbGxiRTlyTnpSbWRGRRAB",
            "text": "To start off I was sooo prepared to be disappointed because I'm a glutton for making reviews. Here I am to say I was disappointed, I couldn't say anything bad and left with a smile on my face which is even better. I'm starting to think some of these reviews are very unreasonable & unreliable that rated this place low.\n\nWe arrived. My self & my date. We were told a 5min wait. Eventually called to be seated. Now let's begin for those who don't understand what type of place this is. This is a self cooking spot and no the servers do not cook for you. It's a experience within it self to have the grill at your fingertips and a hot pot ( soup) that's stays constantly hot for you to keep adding food.  We ate & drank and took food home. Total of under 130.00 for about 3 hrs & left overs. 3 drinks & 2 bottles. Seats & tables are clean. OUR SERVER : AKEEM *SHOUT OUT TO HIM. from the reviews on google you would think that the service is crap but may be we came at a good day & time ( Saturday) 330pm leaving at 600pm. All I know over all it's a definite revisit & may be a regular spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aR1RWTkplVFpzY3pkclZuaFZOVk14VkRRMldVRRAB",
            "text": "We had a great time in this specific location because of the food/drinks variety, the friendly atmosphere and the excellent service we experienced. The place is clean and spacious. I’ll never forget the frozen pinacolada, plus the attentive server we had, Arjay Liwanag. I can tell he love what he’s doing and knows what he’s saying. A person like Arjay made our family dinner more fun! I totally recommend this place!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NGJVbFBNWGRhTFROTlNsUXphV013YlZZeFRrRRAB",
            "text": "This place was amazing the food choice for the price is perfect and delicious! My nieces got a boba tea twice in our sitting. It was a must get! Also the mojito I got for my self was great. Not to mention ARMONDO was spectacular made us feel real comfortable and was super friendly. Definitely took care of us.! Would definitely recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3N2EybWZ3EAE",
            "text": "The best all you can eat buffet i tried so far, especially when they have special price on slow hour😁😁, plenty of choices all of it were fresh, unfortunately my eyes were way much bigger than my stomach, i got charged 10$+ for extra .7 lb food leftover, its pretty fair they put it on to go box anyway, note : maksle sure your eyes same eize with your stomach🤠🤠. Recommended!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJdE0wdEliall0T1hoeFZuVm1jVVZIVlZoRE0xRRAB",
            "text": "First time here and everything was great food was fresh and delish! Our server Jin was excellent! I appreciate his attentiveness & timelessness"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueExQSVdBEAE",
            "text": "I’m so excited that a Korean BBQ spot has finally opened up close to my home—it’s a much-needed addition since I used to travel all the way to Flushing just to satisfy my cravings for this amazing cuisine. This is the first time I’ve been to a place where you pick out the meat yourself, and I love having control over my portions while being mindful not to waste food. I recommend grabbing the large tray to try different cuts until you find your favorites. Personally, I can’t get enough of the regular and spicy bulgogi!\n\nI’ve already been here twice, and the service the second time was exceptional. Our server went above and beyond—he made sure the oil with minced garlic was on the grill and was super attentive with refills and suggestions on meats. I wish I remembered his name, but I’ll definitely find out on my next visit and update this review.\n\nThe place does get busy, but both times I’ve shown up without reservations, I’ve waited no less than 5-10 minutes. What’s great is that they have a bar where you can sit and relax while you wait for your table—super convenient! If you’re doing both BBQ and hot pot, it might vary, but the short wait is well worth it. Plus, they have great finger foods for kids, and I was pleasantly surprised that my child ate for free both times, given certain requirements.\n\nOverall, this spot is a fantastic addition to the neighborhood—perfect for families or a fun meal out. I can’t wait to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MU1VRTNXWGxSVGsxZk5XdGpja1EwZVhSTGMyYxAB",
            "text": "Jin was an amazing host! He explained everything to us being that it was our first time there and made us feel at ease doing everything ourselves and trying things out. Will definitely be a new regular!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINHNQd05BEAE",
            "text": "Delicious! Would definitely go back! The boys there were very attentive! I already know how things work, but he made sure that everything was still a good experience for me. They made good recommendations in terms of drinks! Everything tasted fresh!\nIt’s a buffet style, so you don’t have to worry about ordering. You’re able to just grab as much as you believe you’re able to eat.\nEverything is separated so you don’t have to worry about cross contamination if you’re religious or allergic.\nDefinitely recommend! Price was manageable too"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMM01qSmoxMzYyNkF3EAE",
            "text": "Came for lunch...it was great, quiet. The food was fresh. The staff was pleasant. The parking was plentiful... first time to a Korean BBQ. I enjoyed the food, but the experience was the star today! Highly recommend 👌"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJblpUVlhBEAE",
            "text": "My first time here I must say I was greeted by friendly staff that explained the menu and selections they had to offer. I was very comfortable the seating and table space was very spacious and secluded. A wide selection of all you can eat meats and sides. You do have to cook the food yourself which was pretty awesome. My only hiccup is the grill they are electric and take some time to heat up and cook. The drinks were also amazing a bit on the strong side just the way I like it. I’d definitely come back here with friends thanks again KPot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNVpuSTNURmRaUm5WMlRYUTFhbE5aUWxad1VtYxAB",
            "text": "Buffet style kpot is the best!! Where you can freely get your meats and vegetables in your own time frame and the amount of food u can finish. Me and my bestfriend ate there and we had a great time! Shout out to Arjay who served our table he made our experience even better! It’s gonna be my go to AYCE restaurant now!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVVJqbE1RVlIxYUU5SlFsVTFNbEJJV25WV1RGRRAB",
            "text": "Personally, I love this place. It feels like your own little cooking class/school. You get to experiment without the hassle of shopping, cleaning, prepping, marinating, or cutting—it’s a great time-saver. It’s a perfect way to try out cooking in a fun, hands-on way. It helps if you bring someone who’s done it before, but even if it’s your first time, exploring on your own is part of the fun."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQS2tqT1hteXFPa3lRRRAB",
            "text": "Came here with my husband on Monday, just want to say that the food here is excellent and so is the service! It’s our first time here at this kpot location and our server Jay was spectacular! Special thanks to Jay for making our meal so enjoyable! We will definitely come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucktXLVR3EAE",
            "text": "It was my first time visiting, and I will definitely go back. The experience was amazing. The food was good, and the short rib was delicious. You can cook your own food on either the grill or in the soup. The service is excellent—they clean your table quickly and assist with the cooking as well. I absolutely love this place and would definitely recommend it to anyone interested in BBQ, hotpot, or both!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNnF5WGlRRRAB",
            "text": "Seems that the area is growing in other food options which I like. New addition to the Howard Beach area that I appreciate. Love the options they have from seafood, meats, veggies/fruits and sauces. I would say I was anticipating/looking for slices of sashimi and sushi like other K-Pot locations I’ve visited. However, this one did not have the same items. Like other locations you have a 2-hr limit so your party will all need to be there to be seated. They do not take reservations so it’s a first come first serve (FCFS) situation. The wait time was about 25-30 minutes when we arrived@520pm. They requested we place our names on their waitlist so you would be informed via text. Not sure if their system was having issues but whilst waiting a couple stated they didn’t received text but had been waiting for some time (we did though). Our waiter seemed to be overwhelmed at some points in service but we got through it. We had a pretty decent time until it was time to leave.\n\nA member of our party car was hit and the person cause some MAJOR damage to the passenger front side. When we walked out from dinner there was a puddle of liquid leaking/spewing from what they think is the coolant or windshield reservoir. When they went inside to speak to the host & manager trying to get some information they were told the parking lot to the right (when facing) is not their responsibility. The member then asked if they can see video. Was then told they do not have cameras in that are. Thus be careful where you park. He ended up filing a police report since no one goes to dinner expecting there property to be damaged and get NO ANSWERS!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnenNESWRnEAE",
            "text": "We were super excited when we learned that this K Pot location finally opened since we used to travel all the way the one in Westbury. Third time eating at this K Pot location and it didn’t disappoint. Setting is a bit different from the Westbury and Toms River location wherein we have to order via the tablet. In this location, all the bbq and hot pot are set up in a buffet style along with the condiments and other dishes like fried rice, crispy chicken, dumplings, spring roll and etc. Food tastes very delicious and there are also options for dessert including different flavors of ice cream that my kids love. Our server is Eddie and he has been very attentive, checking in to make sure we have what we need. Definitely recommend this location we’ll be back again for sure. 👍"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNE1XV1FnEAE",
            "text": "This is a BBQ/Hot Pot buffet where you cook the food YOURSELF (shouting for the people in the back).\n\nThey are very busy and you are more than likely going to have to wait. We waited at the bar, and unfortunately the drinks were a little light on the alcohol (iykyk), but they tasted very good - the pineapple painkiller was very good.\n\nThe food is laid out on the buffet tables for BBQ or Hot Pot, which is important due to the cooking times and methods. They provided us with tongs and meat shears for cooking. Overall, a great time and we're looking forward to going back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ2R5Q3BBRRAB",
            "text": "If you're a fan of Korean BBQ, this all-you-can-eat spot is definitely worth a visit! The experience is both fun and delicious—grilling your own meat right at the table adds an interactive and social element to the meal. The restaurant offers a wide selection of meats, including marinated beef, pork belly, short ribs, and chicken, all of which are fresh and flavorful.\n\nOne of the best parts is the unlimited side dishes that come with the meal—kimchi, pickled radish, and more. Plus, you get dipping sauces that perfectly complement the grilled meats. The service is generally fast, with staff frequently checking in to refill plates and make sure the grill is clean.\n\nThe atmosphere is lively and casual, making it a great place for groups, dates, or just satisfying a big appetite. The only downside is that it can get crowded, especially during peak hours, so reservations are a good idea. Overall, if you’re looking for a fun, filling, and authentic Korean BBQ experience, this place won’t disappoint!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sb1dsaFllV0ZYVlhreGFUZFBiR1ZKUkU0elpsRRAB",
            "text": "We’ve been here a few times and before today we loved it! However, the last two times they sat us in the back corner near all the dirty dishes and it was an unpleasant experience. But today, there was a bug in my soup. When it was brought to the managers attention, she said “it’s a small bug, it’s not big so we could only offer 20% off because you could still eat the bbq”. We said we’re not eating anything anymore. She continued to say because it’s summer time flies are normal and again, it’s not a big bug so it’s not a big deal. I don’t care if it’s a small bug or a big bug, it’s a bug and a terrifying looking bug IN MY FOOD. We asked for the check and when she realized we were not going to eat anymore, she gave us 50% off and took away the soup bowls to make sure we really weren’t going to eat anything. It felt insulting, as if we would eat bug broth soup. The discount was still not enough being that there was a bug in the food. It’s a health hazard. I’m not sure how long the bug was sitting and boiling in my soup but it was very gross and I’m disappointed with the way the manager handled this. I’m not sure why she thought it was okay because it was small and why she thought we would still eat the food. Very disappointing & we feel like we overpaid especially because we barely ate much"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNma2Z6eENnEAE",
            "text": "Just went here this evening for the first time, with a party of 3. Had an overall great experience. The restaurant is one of the cleanest when it comes to a Hot Pot. The dishes, the trays, the sauce bowls, everything was clean. The buffet area which housed the plentiful ingredients were tidy and well maintained. The waiter Ming was very helpful in explaining how to use the hot pot and the grill. The technical grip I had was with the moral compass of the management, not our table server Ming. My mother knocked over her Pina Colada, and yes it was her fault. There was alot of plates and trays on the table. The accident was cleaned up immediately without issue. Technically we don't know who was right here, but my mother was hoping they would offer her another. Yes, we inquired about it, but the inquiry was brushed off. We finished our food and saw that the gratuity was on the rather high side. Especially being that Ming only gave us information at the beginning and really only moved a few plates during the meal. I get it. There's a bigger service involved with the transaction besides your waiter... but i spoke to management about the inquiry to replacing the knocked over Pina Colada. The manager spoke to the waiter to prove the validity and asked him did you give her a replacement. They gave us a virgin Pina colada to take when we were leaving. A very kind decision for us. We were pleased because the gratuity for 3 people was about the price of 2 Pina coladas!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3X0kzWHV3RRAB",
            "text": "New addition to the neighborhood and it did not disappoint! Fun, inviting atmosphere. You have the option to choose hotpot or Korean Bbq or both if you prefer! We chose Kpot and our server asked if it was the first time there, after we said yes he took us to the buffet area and explained how the experience would be (very helpful). There were a wide range of meats, seafood  and vegetables options available. The sauce station was impressive, definitely enjoying mixing to create a delicious dipping sauce. There was also a section with cooked food such as fried rice and chicken tenders, perfect for picky children. And to top it off, ice cream!!! The entire experience was worth it, highly recommend. The server regularly replaces the grill and ensured we had drinks. The prices are affordable and our bill for a party of 3 was $93. They do have a sign at the table saying if excessive food is left behind they will box it and you will be charged $13.99 per lb which is understandable because sometimes people take more than they can eat. I will be visiting again and hope you decide to check this restaurant as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neE0zVktNVGRQZUY5T1ZsQlJjak5SV2xWUVdXYxAB",
            "text": "Came here for lunch and it wasn't bad we were a party of 6. Now the soups we all had were delicious however the table only had one pot to cook our meat in and the meats took time to cook so we all were waiting around for a turn which was annoying and very time Consuming our noodles or whatever you make in your broth will over cook if you start cooking it before you can start your meat because of all the waiting. Kpot places are more ideal for 2 people. Large groups I don't advise coming here ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuM1lHbUlnEAE",
            "text": "My experience here was awesome. The hot pots are delicious and the BBQ has a larg variety of seasoned beef, poetry, pork and lamb. Kosher and halal friendly. The friendly staff are very helpful and attentive. It’s clean and well maintained. The bar makes some good drinks that includes mocktails. I recommend this place to everyone. Finally a hot pot on this side of queens. K-Pot is the best thing to come to Howard Beach."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3alpTYzFnRRAB",
            "text": "First time trying Kpot and it was a great experience. Definitely give it a try guys. We did both the Hot pot and the Korean BBQ option. I think it’s worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbTl2aG5RRRAB",
            "text": "Amazing buffet style all you can eat I'm south queens! Staff is super friendly without feeling like you're being asked every 5 minutes if \"everything is ok?\" The meat selection is quite eclectic, and the same can be said about the vegetables I didn't try because who eats vegetables at an all you can eat? 10 out 10 will come back to this awesome place!"
        }
    ],
    "reviews_count": 74
}