{
    "name": "Bruno",
    "place_id": "ChIJawjtdH5nwokR1HRZJHJCx6k",
    "grid": "QN10",
    "address": "158-22 Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.7,
    "user_ratings_total": 977,
    "phone_number": "(718) 322-7866",
    "reviews": [
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRdE9EbHRjR3A1WW5GWVQzQlNSMmxsWTBkdVUxRRAB",
            "text": "Absolute family vibe!\n\nI had one night staying near JFK and picked this spot out of the blue and I couldn’t be happier about my decision.  I travel for work so I like to sit at the bar.  Upon entering I was greeted with a warm welcome and treated like I was a “regular”.  Sal and Felix behind the bar were amazing and the service and attention to detail was impeccable.  The manager (Nick, I think) was accommodating to my dietary needs and the food was great.  If and when I come back to Long Island/the JFK area this will for sure be my first go to for dinner."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNU4zWnlkemRDWVV4Nk9GZERNR1Z4UVRkalgyYxAB",
            "text": "Staff was great, food was delish. Very pleased with the service we received. Accommodating to my food choice with no problem."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0a1RVUm5VVzVRV0dneFpGRktNRXhtUjA1RmRYYxAB",
            "text": "Went for a friend's wedding rehearsal dinner. Everything was perfect. I will definitely return!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1a1drcHBjVkZwYjNwNmJ6SkNiM0F5ZVhwRVNuYxAB",
            "text": "This place is one of the most beautiful atmospheres there is, the customer service was excellent, and the food forget about it, the tomahawk was extremely great and cook to perfection, desert was amazing , will recommend to all my friends and family members, and we will be back very soon!!! THANK YOU SO MUCH!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ka1oyUkZWbWhEVlhSV2FsWmxNaTE1TWkxUE1WRRAB",
            "text": "Best restaurant experience in a while !\nGreat customer service ,"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWWVtMTBiVE5EUVU1V2VHRjZaVEIxWTBodlNuYxAB",
            "text": "Dinner at Bruno’s in Howard Beach was amazing! Joe was our waiter tonight and he was excellent — super friendly and on point. Great food, great vibe — we’ll definitely be back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NE4xUmhTV2RKVWtwMVJ6Qk1hRkpEZGxGeE1HYxAB",
            "text": "Staff was very nice. Food was average. I hate to say it. But olive garden is better. Not what I expected from an expensive Italian restaurant."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeFNVVmtPV055TVRoeWNtdHZPRXg2Y3pjeldrRRAB",
            "text": "The food is some of the best food I have ever had and the service is impeccable. I love having a special occasion just so we can go to Bruno's!! We always feel welcomed and are made to feel comfortable."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNGJIRnJXbXBZVlRWVVowaDRhbWRQV1dwc2JsRRAB",
            "text": "Great find in our travels. Recommend stopping if you’re in the JFK area and have time to unwind and enjoy quality time with friends and family. No rushing, good food, great time with friends"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toclpGSjRkMUF4YW00MFpuUkZZalJDVG5sNFpsRRAB",
            "text": "Went here recently for a dinner party… food was disappointing. I ordered chicken parm… the sauce was an orange color and tasted off. My son had the pork chop which he said had no flavor either. My rigatoni which was cooked al dente (thank you) and was good. We had some appetizers which were also good.\n\nTo access the party room, you have to walk through their main dining area which is a nuisance. I felt bad for people trying to eat there with people constantly passing through. Maybe consider opening the door in the party room?\n\nService was courteus and attentive. They have valet parking which is obviously a plus."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeWVESkdRVVpXZURaTlZVRjFYM1V3U0VoYVRrRRAB",
            "text": "Extensve menu with numerous daily specials. Nice variety of prime meat cuts available The pastas were divine—perfectly al dente with rich, authentic sauces. Top-notch service and a cozy atmosphere made for a fantastic dining experience. Highly recommended!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMlIybERUekp2U1hWaFJFZHBjMmN6TTBVMWFGRRAB",
            "text": "Pretty authentic Italian cuisine. Food was very good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204M1JXeGtSVXRsUkZkRFFtdDVjR1pVVkRWNk5YYxAB",
            "text": "I went to Bruno’s for the first time for lunch. I had the grilled chicken with lettuce tomato,  buffalo mozzarella, peppers. It exceeded my expectations and was very reasonable. Everything from start to finish was delicious and perfect!!  highly recommended 😊"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cbk1WbEhVamM1VG1aUFprUndlRVZzUjJaV04xRRAB",
            "text": "Very nice restaurant! Food is delicious."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkelBISW9nRRAB",
            "text": "It's always a pleasure, it's my birthday dinner"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ka2REY3dXRXh1Ulhsc1gzaEhVVUV0YmprMlowRRAB",
            "text": "A true dining experience. A special place indeed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdVFVaG1kME5WVFRGc1dsWlRSalpqWTNKMFpVRRAB",
            "text": "Absolutely one of the best places you can go!\nThe attention from the staff, paying attention to the details and the mouthwatering food is just something you should also experience! 🤗\nThe pizzas and  the pastas and excellent but have you ever had a cappuccino so good, you actually considered to drive by for one every day?! Yeah, that good!!\n\nThank you for the hospitality, we had a fantastic time with my mom and sister!\n\nJackie"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KU05GUTJWRnBWYm5KSFMxTk5OalpXYW05WFZVRRAB",
            "text": "Great customer service experience and good food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQlFTMXRXV05vTVRrMlEyWkNlbU5qY2xjeFgxRRAB",
            "text": "Authentic!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd1ExWjJPRnBJVkZGaE1YaGZSVXRJYVU1blZVRRAB",
            "text": "Perfect place for a date night. Amazing food and the specials are phenomenal !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaVExa3hhbFp2T0hWR1VFeDNVMEZ2WkhWQmVIYxAB",
            "text": "This was a nightmare to be honest, although it was at least tasty food.\n\nWe got there just before 7pm and didn’t get out until 9:10pm. Took 40min before we had our orders taken, 30 more minutes to get food, then we ended up asking 3 people across a 15min period for the check. Eventually we had to go to the front to ask for our check. Then we got the wrong check and had to work with the person to sort it out.\n\nI do genuinely appreciate the politeness of the owner/manager though. He was apologetic and helped us work through the bill to make sure we got sorted away.\n\nMost people seem to have great reviews though so you’re probably gonna be fine"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcldVeEJMVEZXTXpScUxWRnhORk52VkZSRGQxRRAB",
            "text": "I’ve got to say, it’s fantastic."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsM2VXWlpiVFYwVlZsWVMwRldibGxKWnpkUmVHYxAB",
            "text": "Everything we had was 10/10. Highly recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRlFrazRNaTFUVDI1YWVUTlRWREZPWlVOVVNGRRAB",
            "text": "The kind of place you remember."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsS1RWOXVXRzV2UTFVNVduUkNSblZKTXpsQ01XYxAB",
            "text": "We stopped in after a flight across the country.  We were welcomed in even though we were not dressed up for an evening dinner.  The service was amazing as well as the food.  We have zero complaints.  Thanks for your hospitality.  I will be back next year!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWM09XMHRXbkJVV0VsR2QySkVTSEJKWW1ScVFXYxAB",
            "text": "Sunday sauce was on point!\nSautéed calamari, the best I ever had!\nThe servers were right there,and the manager stopped  by several times to check on us.\nI highly recommend this restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVVdsYzBSbkY2YTFaT1prSkhOMjlQV1VwblkzYxAB",
            "text": "Great food Great Service !!! Thank you Nicky that pizza was amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WeVoyeGtRbkZ2TldSdE1UUk5jbkZHZEZnMmFIYxAB",
            "text": "Sewer and Drain Services. Excellent! Mario was honest, efficient,  reasonably priced and most of all, Does Great Work.\nI have and will continue to recommend him to everyone!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcldHcDFVa3RKVTBkaE0xQXpiRzFsTTJKQlRFRRAB",
            "text": "Staff is friendly, very nice restaurant. We had a reservation, but we were extremely late, and they still accommodated us with no problem. Good food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TlgzVlRPVk5OUlZkVlRIaHRlSEZRYmxSeFQxRRAB",
            "text": "The tasting menu was a culinary journey. Highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRk1WaFhTa3BETm1sclNGWkhYMHhEUkZCSlprRRAB",
            "text": "Bruno’s is such a great place to take your friends, family, or even host a party. I was introduced to this restaurant 3 years ago, and since then, I’ve recommended it to everyone. I have also hosted my graduation party here, and the service is impeccable. They treat you like family and their food is always on point. The staff are all so nice and they get to know you by name.\n\nThe food is absolutely AMAZING and I always get the Tomahawk Porkchop, Penne a la Vodka, Penne with Broccoli Rabe, Garlic & Oil, Eggplant Rollatini, & Zucchini Flowers. Their chocolate cake is homemade and DELICIOUS!!\n\nHighly recommend if you’re in NY and looking for a true Italian food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPT0QtZXp5cnZTNFV3EAE",
            "text": "Very good food, cheesecake was the best part of the night. Service was a tad slow, but it was a holiday so I don’t fault them too much for it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOVF9zUEd2aFktRk5REAE",
            "text": "Last night of our holiday, staying in a drab airport hotel. Ventured out for dinner...sooo glad we did! What a lovely place Bruno's is. Great staff & lovely food and atmosphere. 17 minute drive in an Uber well worth the time & cost."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMaWN2WTdRbDhmSDd3RRAB",
            "text": "The passion of the waiters at this place is amazing, I actually for a moment thought that an older gentleman working in the place was the owner from the amount of passion and the attitude towards the place. The food was great and very punctual in serving it and it was delicious, would recommend this place for sure"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYlZuNGlsNWNuc3dRRRAB",
            "text": "Me and my wife finally got to have dinner here and it didn't disappoint. I love the burgers and the drinks. Coffee was awesome. My son liked his pizza the time I got it for him. Staff was great and we are going back for that tomahawk steak.  Nick is great.  Oh and I really enjoyed the tiramisu."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQTGVsTEtsd2Z6Q213RRAB",
            "text": "Everything was great but every item on the bill was bumped up above the menu price. Is that a service charge like a coperto?"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPT2V2YnpwOFpMLU5BEAE",
            "text": "We wish we had discovered Bruno's sooner. After several Friday Date nights here, it is our new go-to place. The food, service, atmosphere and dedication to detail is outstanding! Whether you are in a fish or meat mood, a waiter presents the sample platters with a description of preparation. It all looks so fresh and appetizing that it is hard to decide which to choose! Wine and cocktail choices are perfect pairings to the meal. Nick and Joe visit your table to make sure everything about the evening is perfect and it always is!. We look forward to our next visit and we highly recommend Bruno's."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPM2Z3TG5JbHN2YjdBRRAB",
            "text": "Exceptional service, great ambiance, amazing food & drinks 🍷"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOS0lsXzd0bU4yQTB3RRAB",
            "text": "I've been here once before and had a pleasant experience. But, that was a slow weekday so that may have been why. I went for a Mother's Day dinner and ordered chicken rollatini. I ate a few bites and then realized the chicken in the middle was raw. When I told the server, she immediately brought it to the back and was kind about it and agreed that it was raw. Though they were kind, it's just really not pleasant getting raw food. They were apologetic and brought me a different meal. It was an extremely long dinner and did not bring fruit to the table like they usually do before dessert. I knew I was in for a long dinner when it took a half hour to seat us even though we had a reservation. A three hour dinner and 40 minutes between courses is just too much, especially in a loud, packed restaurant and waiters keep bumping into you at the table. Also really gross seeing employees on their cell phones and then touching people's food with their bare hands. Disappointed and don't want to go back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMFl5QlNREAE",
            "text": "April 2025. Very good courteous staff, very good atmosphere,  very pricey,  but tasty food, Omaha steak for two can b share by three. Nice & professional presentation of steaks & lobsters prior to ordering.  Excellent location with plenty of street  parking in the area. High clientele from 7pm forward. Fully recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6bG8yV3JRRRAB",
            "text": "Absolutely fantastic service, quiet, an inviting atmosphere, delicious food and desserts with good portions.\nTo celebrate our son’s graduation from college, he wanted Italian food, I didn’t want to drive to NYC on a Friday, opted to find something closer and Bruno was a great option, happy we went there, everyone was happy with the food and service we received."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvX0xtSExnEAE",
            "text": "So I just want to take a moment to recognize excellence!! This was on my top 5 experiences. The staff awesome the restaurant beautiful and the food & Beverages was amazing.🤩 What an experience for my families really enjoyed ourselves and will return for more"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbTV2TzlnRRAB",
            "text": "We had to pick up our dog at JFK airport and were told by a friend this restaurant was very good and just 10 minutes past JFK. We didn't have much time but enjoyed every moment. Can't wait to go back 😋 Easy parking out back. Nice Waite staff"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dE0yNXl3RRAB",
            "text": "This restaurant is absolutely amazing, the service was impressive, prices were excellent and the food was absolutely delicious, the show the meat and you choose what you want before the cook it. The dessert are displayed on a platter and brought to your table for you to choose. I’m impressed! Beat birthday lunch 🥳🎉🎂…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMTZxakx3EAE",
            "text": "My husband and I have been going to Bruno’s for the past 8 years now and it has always been the same. The food always taste amazing and delicious. Everything is so flavorful and fresh. Any dish we try has never failed us. We love the way the owner, mangers, and staff treats us. It’s such a warm welcoming atmosphere. We highly recommend Bruno’s to anyone looking for authentic Italian cuisine!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudFl1MG53RRAB",
            "text": "Wow! I couldn't be more impressed with the food or service! Miguel went above and beyond to make sure our experience was unforgettable. The clams oreganata (whole clams and full of flavor) and fried zucchini flowers were amazing. The Mixed Seafood Di Mare with linguine was amazing - great quality seafood that was very fresh and perfectly cooked. A true, authentic New York Italian restaurant in every way."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXc3NUQWVBEAE",
            "text": "I spent a good time with my loved ones here . Very accommodating and accepting. Very comfortable place and homey vibe. Food is very good but not excellent, could use some improvement in better taste but doesn’t take away from how great this restaurant is. Nice staff and it gives me the feeling of a family owned business."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnd0luVGhBRRAB",
            "text": "Absolutely delicious from the minute we sat down, fresh bruschetta, homemade pizza complimentary, the most delicious food outstanding service.."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnb2VhMmZnEAE",
            "text": "Went here on a weekday around 2pm.\nWas greeted immediately and seated in literally 30 seconds. They brought certain dishes out on a platter to help visualize what certain items on the menu were. It's a little detail that I think all restaurants should take notice to.\n\nIn summary:\n\nTheir presentation is amazing.\nTheir food is amazing.\nTheir service is amazing.\nCome here!\nSpend money and enjoy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNzVqTjFnRRAB",
            "text": "We had lunch here with a dear friend whom we consider a brother, he suggested this place because he’s been here many times before, and the treatment we received is as genuine as if dining in southern Italy, including the music. They (Giuseppe, Martin and Nick) are very hospitable and treat you like family, we even had a nice conversation with the owner. The style of cooking, the love, attentiveness, the suggestions and conversation from the waitstaff is superb. They get to know you to make suggestions of what you might like or try (very clever). The colorful custom plates and decor demonstrates their flair to be creative. Some finger foods were served: provolone, black and green olives, and mortadella. We ordered the antipasto Burrata w/ Prosciutto di Parma graced with crunchy arugula, a slice of beefsteak tomato and sautéed eggplant.\nThey also had us try their version of calamari (from Long Island) called Calamari saltati.\nWhen it was time to order the entree, they brought out trays of prime cut meats and fish to choose from, I mean… wow! Vincent and Pete chose to share the Tomahawk Ribeye with fried onions and zucchini. I was looking for something lean, so they immediately brought out the fish platter… I decided on cod, and when they asked how I’d like it prepared, I said “have the chef surprise me.” (Cod livornese made with black olives, capers and onions in tomato sauce).\n\nFor dessert, we selected the tiramisu and shared it, it was prepared the authentic way, and the dark cocoa made it “eccezionale!”Bravi 👏🏻\nThe perfectly cut pineapple was very sweet and organic.\n\nThe hot towels after dinner and the complimentary limoncello that came in ice frosted champagne glasses was a nice touch :)\n\nThey have a private valet parking lot, and there is metered street parking in front of the establishment, also, around the corner is residential parking (no meters).\n\nThey sure know how to make your dining experience a memorable one."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeTdXU19RRRAB",
            "text": "Bruno first impression from the guest services to the wait time was amazing. We were greeted and seated right away. They provide all the essentials such as bread cheeses and meats to start. They can make any drink you ask them and they also offer a meat special platter that you can choose from. The food was made fresh from the pasta to the well cooked chicken cutlet. The fried calamari is amazing and is recommended 👌 😉"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeFoySlZnEAE",
            "text": "Service is superb. Food was delicious. Highly recommend stopping here and enjoying a really good meal."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycjRyclRREAE",
            "text": "It's a beautiful restaurant. Very clean and nice decor. Friendly and attentive staff. Calming music. I enjoyed the merlot wine. The grilled salmon and vegetables were delicious. They have the best tiramisu I've ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNGV6ZGl3RRAB",
            "text": "The atmosphere here doesn't get any better, this is the place you want to be for excellent service. They have trained their wait staff so well that you don't want to leave. The food is really good, fresh you can tell everything made in house, the cocktails are well done, this is a gem and the best option for Italian cuisine in Hpward Beach"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlay1lVVZBEAE",
            "text": "The photos speaks for itself. May I just say I’m kinda disappointed.\nYour salad got lunch meat on it and on top of that your Shirley Temple tasted like cherry flavored cough medicine. Aside from that, you get some bonus points for having a somewhat decent main courses."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1N3F2cjVBRRAB",
            "text": "I’m not italiana but just figured out what pasta Al dente is….\nBest dam pasta I ever had.\nThe seafood appetizer and main course is amazing\nAnd the service…your king period\nAnd if your waiter is less then perfect management fixes that in seconds.\nYou get what you pay for\nI highly recommend this place"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5dDltOFBBEAE",
            "text": "Amazing restaurant! Best Italian food I have tasted and the service is wonderful. I wish I can give them more than five stars. This is a must go to place!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhemZqWFlnEAE",
            "text": "Ate here for the first time and OMG everything was so good! The service was great, the food was delicious and the ambiance was beautiful. We ate outdoors but the inside was beautiful as well!! Definitely going back! Everyone was friendly!❤️"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRZ1p6ekpBEAE",
            "text": "Very nice restaurant. Great staff and very professional. The food is very good and they now have brick oven pizza."
        }
    ],
    "reviews_count": 59
}