{
    "name": "CJ's",
    "place_id": "ChIJUdp2EopdwokRJZ_ReMUb3JI",
    "grid": "QN10",
    "address": "137-09 Cross Bay Blvd, Ozone Park, NY 11417, USA",
    "rating": 4.3,
    "user_ratings_total": 437,
    "phone_number": "(718) 848-2498",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxd1duTTBjRkZ6YzFCM2FqSnJVbkZ3VXpObWRIYxAB",
            "text": "​My partner and I visited CJ's Bar, drawn in by its historical reputation in the neighborhood. The bar was almost empty, with only a few people at the counter. We took a seat at the bar, and the bartender was very friendly and conversational. She even showed us the back garden, which seemed to be a smoking area but wasn't very well maintained. We ordered typical bar food—beers, sliders, wings, and fries. The food was okay, but the prices felt a bit high for the quality and the neighborhood, even during happy hour. The empty space and overall vibe made us wonder if the business might be struggling. It's a shame, as the place has potential, but it didn't quite live up to our expectations."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSM1dFOUVjSE5vV2kwemVHMUZSWFZhVUZwcE1VRRAB",
            "text": "Great local gem. Bartenders are the best! ♡"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVaTRqZ0V3EAE",
            "text": "Is chill,  good vibes, good music,  good food, and great staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKZVkzZjY5di1DenR3RRAB",
            "text": "Bartenders are awesome. Good vibes and all about fun."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNemhucG5Ma19iOHlRRRAB",
            "text": "There are no products (draft beers, common beer and blue moon, highnoon, angry orchard, etc) and the place seems they are going out of business.  The price is good, but poor food quality as well.  It used to be a fun place to go to."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLTzgzcHI3aWJfZ1BBEAE",
            "text": "Very chill spot to spend time with friends & family thanks CJ's 😎"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuclpEWUx3EAE",
            "text": "It’s a cool place to listen to music , watch tv and vibe .\n\nThe food was not great . Maybe stick to French fries"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OE1EejZ3RRAB",
            "text": "Good appetizers. Not too many options. Very limited menu yet good"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNXVfQy1RRRAB",
            "text": "The bartender rushed me & my friend drinks wanted us to leave I guess since it was closing definitely didn't tip her. Don't think I'll be coming back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNWZyV3J3RRAB",
            "text": "Cool place to grab a drink and wings and watch a game."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdG9HRXd3RRAB",
            "text": "Great little dive bar. Had an extra long layover before an International flight and stopped for lunch and drinks. Food was great, service was excellent, and atmosphere was very enjoyable and friendly. Great place to hang out near the airport!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OGNldExBEAE",
            "text": "Good hide away bar. Good food prices. Long bar with a few tables. Food was above expectations. I'll hit that place again if I'm back in town. 🤙🏼"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURac3RMU3h3RRAB",
            "text": "I'm glad this place reopened! The renovation is nice and glad to see daily specials like $5 all you can eat wings and drink specials. The wings are delicious, all flavors were very tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eXRuQ1p3EAE",
            "text": "Wings are really good, bartender is nice , great local bar , a lot of people love this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5X01iei1BRRAB",
            "text": "A group of us went to celebrate a birthday and the staff was so accommodating, from the DJ booth with the bday shout out to the sparkle candle & free shot from the bar. We were only there for 2 hrs & it was awesome. The DJ was blasting hits and the bartender, Lauren was so attentive. We didn't order any food but the service & atmosphere was great. The cocktails were great. Thank you for a great time, Lauren and team! ☺"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkaV8zdG5RRRAB",
            "text": "Felt like a criminal being I'deed & pat dwn"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROcV9lZ2NnEAE",
            "text": "Had a few drinks looking forward to going back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMWU3S3ZBRRAB",
            "text": "Best time ever! I've been here a few times on different days and I've never been disappointed. Their food is so good. They make everything fresh in small batches daily. The Ropa Vieja (shredded stead) tastes like my grandma made it. The DJ played a nice mix of music. Something for everyone. Everyone on staff is so much fun to interact with. From the security to the bartenders, everyone is so friendly. The 'regular' patrons mingle with everyone and it feels like I'm at a friends house party. Everyone is so accommodating and we had so much fun. Def a fun spot if your in the area. Doesn't matter what day of the week it is. Mondays are wing night. I think it was like $5 for all you can eat wings."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGOC1IS1JBEAE",
            "text": "Doorman apparently needed to scan id. Bartender took a while getting to me. And the guiness came in a plastic cup. Definitely not my kind of place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1c0pudWdBRRAB",
            "text": "The Food Is 10/10 , Drinks Were Amazing!!! Definitely A LOWKEY Chill Spot. Went Twice & Plan On Going Back. The Owner Have 3 Locations “CJ, Cheap Shots & The Alibi ( Have Karaoke Night Available) 🔥🔥"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMjVleTBBRRAB",
            "text": "A cozy place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNk9DdDFBRRAB",
            "text": "Great place to relax and chill. Food is great and service is on point. Big props to the bartender Sam I Am, Jay and the whole staff"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJcTlhV1lREAE",
            "text": "Came to kill some time between flights and before check in at our hotel, barmaid VANESSA was super sweet and accommodating! Prices were fantastic, would definitely come here again!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdk1DOHB3RRAB",
            "text": "My favorite neighborhood bar, even though I don't live in the neighborhood (I work nearby). The bartenders are always the sweetest, attentive & on point. The atmosphere encompasses the perfect mix of a laid-back vibe, with great music, food, and a great mix of people (both regulars and newcomers). The great drink prices are incomparable to other bars, and it is well-kept, clean, and a pleasure to go to. Whether I attend on a Tuesday or Friday evening, it is sure not to disappoint. The late night music selection always inspires customers to dance and have lots of fun. Thanks, CJ's, for always ensuring an amazing experience!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMExTZi1RRRAB",
            "text": "We had a great time and the bartenders were great. I was there for a birthday celebration so there were a lot of people. If someone lets you know about something like that the bar should schedule more bartenders to work on those days or nights."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndjlLRDFRRRAB",
            "text": "If I could give this place 10 stars I would. From the good music to the friendly people that work there. I had the fried Calamari which was amazing. The drinks are good not stingy with the alcohol like some other places. My bartender was…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjaG9QaEN3EAE",
            "text": "Awesome local bar! Very mixed crowds. When there isn't a DJ playing, they have a jukebox.  Monday night .25c wings are my favorite.  Moderately priced drinks and there is always a special going on.  Staff is friendly and always welcoming."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteDZ6VDRRRRAB",
            "text": "Nice vibe, friendly bartenders and great wings. My wife and I stopped in after a flight from Costa Rica to JFK. It was around 11:00pm when we arrived and was busier than expected but not enough to turn us around. We got served quickly.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDc01LSGxRRRAB",
            "text": "Great place for anything from a quiet drink to a party of legal size. Owner is ver gracious and accommodating. Wonderful bartenders and staff. The only reason why I'm not there every day is I don't wanna end up an alcoholic."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNdzhHV1VBEAE",
            "text": "You better off ordering at the bar if you can get a seat there. The waitress taking care of the tables dont care about you. If you trying to watch a game on the tv, be prepared to listen to music playing off the jukebox instead. Soda was super flat. Our drinks were horrible cause of it. Wings are good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSazd1WXp3RRAB",
            "text": "Love it here. My local bar. Good is amazing especially their wings. Drinks are on point. The staff are like family. Highly recommend"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndFBhSURBEAE",
            "text": "I went here for mothers day and to be honest, I was expecting much more. I felt that the experience was dull. Seriously, who plays beer pong with water. The bartender was very inattentive. For such a small crowd, it took a lot to get his…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwb1oySG5RRRAB",
            "text": "Spot is cool friendly\nDrinks are good\nMusic is nice they play for everyone\nWish they had hookah\nAnd had a better Ac system it'd like a sweat box but good vibes"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcE1EQU9nEAE",
            "text": "Chicken avocado pressed sandwich. Get it and you won't regret it. It's one of their most ordered sandwiches and although it is a bit expensive, the melt in your mouth avocado is worth it. I've also tried their frozen coffee latte and it was…"
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdk4zTTdBRRAB",
            "text": "This is a local bar. They offer specials on the drinks. There is a tub of beer special. They offer a big menu of pub food. Burgers, fries, hot wings, and more. Food is good. There is a DJ, who plays great music. Prices are reasonable. There is a long bar, as well as tables and chairs to sit with friends.Service is very friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoM1kyOWdnRRAB",
            "text": "Had a great time with cool crowd!! Pescatarian so those shrimp nachos & crudite were BANGING! Music & DJ on point.\nWill be back!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3aFBMZzFBRRAB",
            "text": "A really nice neighborhood bar with great staff and friendly partrons.  The music is not blasting so you can have a conversation without screaming.  With the airtrain to JFK right across the street you get some people heading to the…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcXEyc1R3EAE",
            "text": "Great environment to chill, eat, and dance! I love the owner, she's an amazing person, a sexy fierce red head with great energy! I will recommend this place to any one."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNHNMUGhnRRAB",
            "text": "One star only because I can't give it minus 100 Stars.\nIf you're looking for the lowest form of life to hang out with this is the place for you if you're a brawler it's even better because this place is nothing but problems. Fights all the time and the staff and owners will sit there and watch no matter how bad it gets and believe me it's never one on one sometimes they'll even close the doors fact! If you want to get jumped this is the place for you and If you're a low-life this place will be like a natural habitat for you, you'll fit right in if you have an ounce of class stay away from this place it's nothing but garbage a local Watering Hole for low lives."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNl8zMDJBRRAB",
            "text": "Meant to give it 5 stars instead of 2, problem with my phone. Great food, great crowd, great bartenders especially Samantha. An excellent neighborhood spot day or night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4d2JUeUh3EAE",
            "text": "Nice Sports Bar, great bar menu… Drinks are good and reasonable prices! Nice vibe… cool chill spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSOXVpQW13RRAB",
            "text": "I went there on a Friday night!Music was great and the beef & chicken empanadas were so good and that sauce they gave 😋!!!"
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eklDby13RRAB",
            "text": "i went to CJ bar about 6 months ago, clean and friendly people. i hung out for a while and had a few drinks and then of course i got hungry, so i ordered a DOUBLE bacon cheese burger and WOW, the cook came out with this master piece of a…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3M043Nk93EAE",
            "text": "The dj was great ... Food was okay... Just don't order the sliders. Drinks are amazing though.. you get crowd makes for an okay atmosphere"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbU9tZnFBRRAB",
            "text": "Love this spot. This is our go to placeee great food great music. Great staff I def. Recommend just missing some hookah to top it off 😊…"
        }
    ],
    "reviews_count": 45
}