{
    "name": "Nana's",
    "place_id": "ChIJS2des8FnwokREnoijqCfk50",
    "grid": "QN10",
    "address": "164-26 Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.4,
    "user_ratings_total": 138,
    "phone_number": "(917) 994-2454",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMmFXbE5VeTA1ZFdOdVJrNVZORVEyTVdzMVZsRRAB",
            "text": "We went on. Friday mid day. The place had traffic but not crowded. The service was phenomenal. The woman held it down and she was so pleasant. We asked for recommendations and she nailed exactly what we were craving. The crème brûlée French toast was amazing. My husband had the breakfast burrito he loved it. Drinks were on point. Will be going back for sure. I also want to add the space was immaculate from floor to ceiling."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQmRYYzJOSEpZUkU5UlF6ZE9TblpvTFdZMVkzYxAB",
            "text": "The universe sent me to Nana in my search for pancakes Saturday afternoon\nThank you universe…. Job well done!!! The  pancakes were delicious!! The customer service top tier. Don’t walk… run to Nana on Cross Bay Blvd. thank me later😊😋😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQ1N6TndkemhXUkZoS0xUaGxkR0pxZGtreVRVRRAB",
            "text": "Excellent! Enjoyed a lovely brunch. Lemon ricotta pancakes, eggs, bacon, hot chocolate, and even the coffee exceeded expectations. Thank you for a great experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZdE5tazRNVWhyY0VWeWFtdE9aRTk2Yldrd2JYYxAB",
            "text": "This is a wonderful breakfast and lunch spot.  Lots of fun and delicious breakfast items."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RFZ5MUVWM05oZDNkMlVpMXRhalZaZFVoclNsRRAB",
            "text": "Nana's was a life saver.  We have been stuck between airports for 2 days trying to get back to Colorado.   Nana gave my wife a bloody mary on the house after hearing our nightmare travel story.  Got refueled with great food.  Staff was the best, the food was absolutely the best.  If I lived in NY it would be my go to place for breakfast.  Thanks Nana and staff!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORWFWOVNRV2xrYWxaYWVGQmtTVmQ1UjJKaVNsRRAB",
            "text": "We went today for brunch today and everything was amazing. The atmosphere was so welcoming and the food was very tasty!!! Had a chance to speak to the owner who was more than welcoming and very kind. Will absolutely be back to support local businesses!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscVoyNURkVTlYWTE5TWVXUjRZbmR3Y0RkNGExRRAB",
            "text": "Fantastic restaurant, perfect for brunch! We stopped here on a Tuesday early afternoon and had the best experience. Food is delicious, service is excellent, it can get a little loud but all in all definitely recommend and would come back!! YUM!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMM2Qtc09QNmVDOHJnRRAB",
            "text": "This is a hidden gem! So relaxing and inviting, the servers are on top of things, and the food comes out fast! Everything I've eaten from here has been delicious and high quality! Highly recommend (but also want to keep it a secret so that I can still walk in anytime and get a table)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJREQ1YWlXdnQ3ZkZ3EAE",
            "text": "There are two things that matter most to me when I go to any restaurant: good food and good service and this place exceeded my expectations on both. Try It for yourself...."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLU2lrTzI5dHRTY3J3RRAB",
            "text": "We love Marta!! The food, atmosphere and staff are great! We will be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPNlB4Y1M3aHBpaEh3EAE",
            "text": "Had an amazing experience and the food left my speechless , definitely recommend , going back again for Mother’s Day !"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeU16eTNBRRAB",
            "text": "Très accueillant et bonne cuisine ! Nous avions réservé pour 7 avec 3 enfants, les chaises hautes étaient déjà prêtes en arrivant. Service très aimable et kids friendly ! Bonne cuisine et copieuse en plus !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbHR2V2t3RRAB",
            "text": "As soon as ai read the manu i had a feeling the food was going to be good and i was not wrong about that… food is great!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdzRDbkhBEAE",
            "text": "Love Love Love this place. Eat here once sometimes twice a week. Food is spectacular never ever disappointed. I’m such a regular they already know what I’m getting before I even sit down! But sometimes I change it up on them to keep them on their toes but they are always up for the challenge. Always attentive always having great conversation with the staff. Management is absolutely top notch. They really actually care about the customers. Love you guys and keep shining."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJby1HcVVBEAE",
            "text": "Nanas- A Breakfast Gem\nIf you're on the hunt for a breakfast spot that feels like home and tastes like love, look no further than Nana’s. This cozy little gem has mastered the art of comfort food with a side of nostalgia. From the moment you walk in, you're greeted with the smell of sizzling bacon, fresh coffee, and a welcoming atmosphere that instantly makes your morning better.\nThe menu? A perfect mix of classic breakfast staples and creative twists that make you want to try everything. Whether it's fluffy pancakes stacked high or perfectly cooked eggs with all the fixings—Nana’s nails it every time. And don’t even get me started on the cinnamon rolls… they’re worth waking up early for.\nWhat really sets Nana’s apart, though, is the feeling. It’s not just the food—it’s the kindness of the staff, the familiar hum of conversation, and the way every plate feels like it was made just for you. It’s the kind of place you keep coming back to, not just because it’s delicious, but because it feels like family."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJby1iZjl3RRAB",
            "text": "Love this place!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcE5lTXB3RRAB",
            "text": "This place came a long way. Much better!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRb2VET3B3RRAB",
            "text": "Love this hidden Gem!! My new go to breakfast spot."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcU1pYm5RRRAB",
            "text": "This is a review for a visit on Friday, 2/21/25. We arrived just after 12pm. We were seated promptly. We waited a bit for menus. 10-15 minutes after ordering we got up, cancelled our order, and left.\n\nWhat I am about to describe is from my observations while being there for 30-35 minutes, and we never even received our drink order, which was two regular coffees and a water. The only staff seen was one server, a lady with glasses, and a busboy. This was the scenario:\n\n- There were two people seated at the counter, by the wall. They already had their food. I do not know if they were still eating or finished. At some point, one of them had to approach the staff to get their check and pay.\n\n- There was a group (family?), with kids, seated by the wall where the piano is located. I thought they were waiting for their check. Apparently this family had already placed their order before we arrived. They were just receiving their drink order when we decided to get up and leave.\n\n- There was a group (family?), adults and teens, already finished eating waiting for their check. Someone from the table had to approach the staff to get their check.\n\n- There was a couple sitting at the table facing outside. They already had their food and the food looked about halfway eaten. The male kept looking back towards the counter. I am assuming they wanted the check. No one checked in with them during the time we were there.\n\n- Behind the couple was an empty table with dishes. This table was attended to by a busboy 20 minutes into our seating.\n\n- There were two ladies seated by the other wall, opposite the piano, by the window. They already had eaten their food. One of the ladies had to approach the staff to let them know she wanted another drink and the check.\n\n- There was a group of three ladies two tables away from the window by the wall opposite the piano. They had already eaten and wanted to order dessert. They had to flag the server for their dessert order after our order was taken. The ladies received their dessert order before we left.\n\n- Two ladies walked in and approached the counter to be seated. The lady with the glasses remained by the counter and pointed to where the two ladies could sit.\n\nOther than what was described above, there were no other customers to attend to. During our time sitting and waiting, no orders were taken, and no food was brought out. The lady with the glasses looked shocked when we were leaving and told to cancel the order. She didn't ask why. On her own, she said it hasn't been that long.\n\nOne of the ladies seated next to us said she was sorry we were leaving, that the food was very good. While the food may be very good, the service was very poor.\n\nFor a service and customer oriented business, I would say no matter how good the food is, it is definitely not worth the lack of service. While the pricing is a little on the high side, it was definitely going to be a treat to dine at Nana's.\n\nI would say that while the Howard Beach and Ozone Park communities are trying to support Nana's, if things don't change, Nana's won't be around much longer. There seems to be a lack of reviews. Reviews help people make decisions."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNnZhelpBEAE",
            "text": "Nana’s is a charming breakfast spot that feels like a warm hug the moment you walk in. The inviting atmosphere, friendly service, and comforting menu make it a standout choice for anyone craving a delicious morning meal.\n\nThe menu features both classic breakfast staples and unique house specialties. Their Nangiettes—delicate, golden-brown pastries with a perfectly crisp exterior and a soft, buttery center—are a must-try for anyone with a love for flaky goodness. The Potato Tart is another standout, with layers of thinly sliced potatoes baked to perfection, topped with a hint of herbs and cheese for a rich, savory bite. And for those with a sweet tooth, the Velveteen is an absolute dream—a decadent, melt-in-your-mouth treat with a texture as smooth as its name suggests.\n\nBeyond the food, Nana’s excels in service. The staff is warm and welcoming, always ready with a coffee refill or a recommendation. Whether you’re stopping in for a quick bite or a leisurely breakfast, the experience at Nana’s makes it a place you’ll want to visit again and again.\n\nIf you’re looking for a cozy spot with unique and comforting breakfast options, Nana’s is the perfect pick. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMS1MZ0ZnEAE",
            "text": "Food was amazing, very fast and fresh.\n\nMartha was very friendly, amazing waitress.\n\nI had the Peach Melba French Toast.\nThe other plate was a Classic Benedict and a fresh blend plate."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNTQ3bjBnRRAB",
            "text": "Great neighborhood find. Always looking for a great brunch spot. The food was well thought out and very tasty. Everything was delicious and well portioned. Really attentive service. Good luck. Welcome and hope to have more brunch days with you guys. Go check it out everyone."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmLXR1V3Z3RRAB",
            "text": "Diner place located in a strip mall off the Blvd. Parking during the week is tough. Park around the corner. Seats are mostly low, slightly uncomfortable and somewhat flimsy. Grab a bench seat if you can. The menu has a couple of interesting items described but overall it's a breakfast/lunch joint. The prices are somewhat high unfortunately but that's the norm these days it seems. Deal breakers are the 7 buck iced coffee and the fact that we were tagged with a mandatory gratuity for a group of 4 or more. Overall a clean place but it's a one and done for me and my crew."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmd2V2WEZBEAE",
            "text": "Nana’s is my go to place for brunch every Sunday! My husband and I have tried many places locally and on Long Island but still come back for the inventive dishes, served by friendly, professional staff who anticipate what you want before you ask. My experience has always been positive and I’m somewhat confused by some reviews that say otherwise. I’ve never spent over a $100 for breakfast for 2 even with breakfast cocktails! I’m assuming to total that these folks  may have had a few cocktails each that day (why not), but drinks do add up. I also note that we have spent about the same amount at IHOP or the Crossbay Diner both of which also had to raise prices to cover the higher cost of ingredients."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMXAzLTJnRRAB",
            "text": "Slow service, out of drink ingredients on the menu, $100+ for 2 people and small serving sizes. They will comment that the portions are generous, but you will see for yourself and leave with an empty stomach and empty wallet."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eWF6NlBnEAE",
            "text": "Food quality was not great. Bland and cold.\nFood quality is small. Food to price ratio is lacking.\nPlates had chips in it and utensils were not well kept.\nThe fork was sharper than their knife. The fork has a piece of metal sticking out that scraped my mouth.\nI ordered a simple breakfast so that’s my comparison point.\nPlace is a decent size but seating space is limited."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2N2YzdER3EAE",
            "text": "Loved the creme brulee French toast. Must have!!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2N2YybWtnRRAB",
            "text": "The crème brûlée French toast is a must!! We loved the burrito too! definitely recommend this brunch place!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2clBtUlBREAE",
            "text": "A classy looking place with a beautiful piano in a chain of stores with parking right in front on Cross Bay Boulevard.\nI went with my best friends and we shared some Breakfast dishes. They also serve lunch and dinner.\nThe pancakes were amazing and I’m a pancake guy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzLXFPckdREAE",
            "text": "Let me say Nana's is the absolute best!! My family and I absolutely adore that place and the service is fantastic, you feel you're right at home. The food is delicious, seriously, dangerously good. I say run don't walk there you won't regret it. Did I mention it's super clean?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbmJlQnd3RRAB",
            "text": "Hold up, I couldn’t leave without leaving a review. This place is absolutely amazing, you will leave happy. The service is top notch and the food  is tasty. Nana, the owner, is warm and inviting and Marta is hilarious. This is my second time here and it will become a regular. I love it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYLW9qdWxBRRAB",
            "text": "Food was incredible. Fast. Service was even better. First time trying, and will absolutely be back. Affordable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubG9mMjR3RRAB",
            "text": "I've been a good customer of Nana's since their openjng.  Service is iffy at best, and the Hospitality was sometimes good, sometimes not so good. Good food! But now, just a TERRIBLE, NASTY Staff ATTITUDE upon entering! Ive never been spoken to so rudely at any establishment, anywhere in all my 55 years! Take your money and business elsewhere in the neighborhood. There are countless wonderful, delucious,  kind and hospitable Restaurants, and cafes  in Howard Beach. I'm a born and raised HB girl, and I will never go back to this RUDE establishment. Get your pancakes and omelets anywhere but here! I would give ZERO STARS! Terrible, such a disappointment to Howard Beach."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdHBHLUdREAE",
            "text": "I can’t rave enough about the amazing service here! The staff is not only super friendly but they genuinely go out of their way to make you feel at home. From the moment I walked in, I was greeted with warm smiles and attentive service, and it just got better from there.\n\nNow, let me talk about the food—specifically the omelet called \"Vermont.\" This omelet is out of this world! Packed with the perfect blend of cheese, bacon, and fresh veggies, it’s savory and delicious in every bite. You can really tell they use fresh ingredients, and the combination is just divine. The flavors are so well balanced, and it’s easily one of the best omelets I’ve ever had.\n\nIf you’re in the area and looking for a cozy spot with top-notch service and food that hits the spot every time, Nana's is it! I’m already looking forward to my next visit.\n\nHighly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3X1piSVlnEAE",
            "text": "The food is very good and the waiter is so friendly. The food came out fast than expected."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dGFTMFBnEAE",
            "text": "Coffee is delicious, food is consistently fresh, and atmosphere is very welcoming. We've gone here several times for brunch. A little pricy, but worth it for the food quality IMHO."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicTVyS0FREAE",
            "text": "This place is great every time I come here the waitress is such a great help answering any questions we have on the menu, getting us any additional sauces we may need. The food is amazing and the service is even better, one of my favorite places in the area for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib3VUdlJREAE",
            "text": "Had the pleasure of going to Nana’s today for the first time my wife has been wanting to go there and we finally went with a dear friend of ours. Courtney was our server who was absolutely impeccable. She was doing everything I had the pleasure of meeting one of the owners and it was absolutely absolutely the best lunch I ever had in a long time Courtney, thank you so much for all your done for us today and I can’t wait to come back and try the French toast"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNkt1Sm9RRRAB",
            "text": "Food is good, but prices are ridiculous. The portions are not big for the price they charge. 1st time trying, not bad. Would I return? Not really. In this economy, it's just not worth the price. And looking at their response below, they are offended easily and pretty rude."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeXFpMmR3EAE",
            "text": "Update 6/7/24: We just had Nanacue for dinner and it was incredible!\n\nWe ordered the \"Feeds Two\" which had:\nSmoked Baby Back Ribs\nBBQ Baby Back Ribs\nBrisket\nPulled Pork on a Brioche Bun\nBarbecued Chicken\nSlaw + Mac N Cheese as sides\nBourbon Lemonade (on right) sold separately.\n\nOrder up! Every Friday or Saturday in June!\n\nUpdate 5/10/24: Had Dinner at Nana's! The Eggplant appetizer was amazing!\n\nUpdate: 11/17/23: The Omelets are incredible!\n\nUpdate 9/17/23:\nThe Velveteen was amazing! So was the Cinnamon Bun!!\n\nUpdate 7/30/23:\nThe Lemon Ricotta pancakes! They were incredible!\n\nUpdate 7/23/23:\nWe were joyous to go to Nana's again. We tried three new things that were beyond incredible!\n\nNana's Fritatta, Breakfast Burrito, & Creme Brulee French Toast! OMG!\n\nThe Service was delightful: like being with friends or family !\n\nThe vibe was modern, classy, and upscale. Great way to start a Sunday morning!\n\nAm soooo looking forward to the next time!\n\nJuly 16, 2023:\nWhat an amazing experience!\n\nThe food was mind blowing, drinks were delicious, decor was classy,  and the service was great!\n\nWake up! There's a great breakfast/lunch here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NTdiZXBRRRAB",
            "text": "This place was suggested as a local spot in Howard Beach for brunch menu items. The atmosphere was nice and inviting, lots of tables to choose from. The grand piano is a nice atheistic style. We try quite a few options on the menu. The only…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbDhiWXF3RRAB",
            "text": "First time at Nana’s! Once I stepped in I immediately felt like I was in a fancy hotel on vacation, the gorgeous piano at the entrance and the beautiful chairs and decorative pieces. The food came and it was very well presented. I had the Lemon ricotta pancakes and my husband had the brunch burger. The pancakes were so so yummy. They had the most delicious homemade whipped cream. The burger patty was so juicy and thick!!! The Service by our waitress courtney was above and beyond! She was friendly, attentive and quick! Couldn’t have had a better experience! Highly recommend Nana’s!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdnZuMXlRRRAB",
            "text": "Great place! Parking in front, nice wait staff, and well decorated. I had the velveteen: great breakfast sandwich and very filling. My friend had the Lemon Ricotta Pancakes and she liked them. The almond milk hot chocolate was so good! It tasted like s’mores. I’ll be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsdjhYOVdnEAE",
            "text": "My friend & I were visiting from Washington, DC. While reviewing a few brunch spots, we came across Nana's. I have to say that I had a wonderful experience as soon as I called this restaurant to ensure that they had easy parking. The ambiance was a vibe & we also enjoyed the music that was playing. As far as customer service, our server, Courtney, not only went above & beyond to ensure that our meals turned out to our liking, but she was also very accommodating. If you decide to go to Nana's, you won't be disappointed!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNE9LMnBnRRAB",
            "text": "I was heading to NJ from Long Island and placed an order. It was ready in 20 minutes (exactly what I was told).  The restaurant is beautifully decorated and sparkling clean.\nMy food was in these adorable cartons with everything packed separately (fruit, fresh whipped cream, syrup and butter).  It smelled so good and transported well. The lemon blueberry pancakes were perfect.\nMy egg blt was delicious. The tomato had something on it that made it so tasty. The guacamole was a great addition.\nI wish they were closer to where I live but I will definitely travel back there for breakfast.\nAdded bonus, the owner and staff were so nice. The owner told me If I was dissatisfied with anything to call and let her know."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdktLcEN3EAE",
            "text": "Best brunch in queens! Incredible food with such unique and delicious twists to classic breakfast/brunch staples. This is a must try place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScUtLZFFREAE",
            "text": "I love this restaurant. I had breakfast with my friend. We loved the atmosphere, the service and the food!! The coffee, breakfast burrito with avocado mash and freshly squeezed orange juice were delicious! I’m definitely going back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1X2NLLV9BRRAB",
            "text": "AMAZING! what a delightfully upscale restaurant in Queens, so many delicious food choices my entire family enjoyed their meals. The place was elegant and well kept.\n\nThe staff was inviting, the food was hot and fresh and I cannot believe how memorable this culinary experience was for breakfast.\n\nTake a trip and try this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLWJfbHlnRRAB",
            "text": "Cute space, great menus, and friendly service. I enjoyed the lemon ricotta pancakes! Parking was a plus! Will definitely be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdXVhbXNRRRAB",
            "text": "Food was great and service was great. They need better coffee, that's about it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUa01pSXRRRRAB",
            "text": "I loved the food. The presentation was lovely,  taste was great, and everything had a wonderful flavor. The coffee was so good. The Charcuterie board was fantastic. I have no complaints about the service or food. I can't wait to go back  . My complaint is with the customers that were there when we went. They would go use the bathroom and leave the door wide open when getting out. We are all eating and the bathroom isn't that far away or around a corner from where some tables are."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaS1uQVJnEAE",
            "text": "Food was delicious,  Sharon was wonderful. Definitely recommend this place. Atmosphere was very pleasant. Drinks were good too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUazc2bzFBRRAB",
            "text": "Limited menu of mother's day, food was okay and the service was mediocre. Extra charges were added onto my bill for a \"custom omelette\" as they allowed me to swap out one ingredient of the two omelette options that they offered that day. Apparently it was done so the kitchen would not be confused which is understandable and they refunded the extra cost after I asked. She did not apologize or say anything after speaking to the manager but reached over my shoulder and placed the money on the table. Did not care for the overall experience, would not go back as there are much better brunch spots."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbGVxMVJREAE",
            "text": "Went here for my parents anniversary. The food was great. HOWEVER, the service was HORRIBLE. I made a reservations so they knew we would be 7 adults and 2 kids. It was a Sunday morning which they are known for a brunch. It took me 33 minutes to get a cup of coffee and then when my mother asked for a refill and a water, the waitress said with a nasty attitude “yea I know I said I’ll be there in a minute” every other table got waited on, and we had to sit and wait the longest. They definitely need to RETRAIN their staff. Super disappointed and will NEVER go back which is a shame because like I said the food was great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSMTllVHVRRRAB",
            "text": "Went here for breakfast last month and it was phenomenal! The lemon ricotta pancakes were mouth watering. Definitely recommend."
        }
    ],
    "reviews_count": 55
}