{
    "name": "C & C Italian Deli",
    "place_id": "ChIJhVrNemFnwokR3PGf1EoQXvs",
    "grid": "QN10",
    "address": "149-19 Centreville St, Ozone Park, NY 11417, USA",
    "rating": 4.4,
    "user_ratings_total": 343,
    "phone_number": "(718) 641-4585",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSVowNVBRVmxYV0dSS1psaFNVa2M1YlVOc1pWRRAB",
            "text": "Chicken cutlet hero is my favorite. Nice people very helpful every time have the chance I'm there"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbWNqVmxlRU5sUkVSdlRqQnpkMXBXUTJzdGJsRRAB",
            "text": "Disgusting place dirty . Ordered a sandwich and had a big inside . That place isn’t as clean inside as it use to be ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUWIyNU1jR1pKVTJ4WVdXcHROMmxtU3kwNFlsRRAB",
            "text": "The drinks were refreshing and the food was outstanding. Great time all around."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wdFdsZEtNR1J4T1RCRVVrOWlkR2xwWW1jM1VrRRAB",
            "text": "Awesome"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeTd6ek93EAE",
            "text": "Solid Italian delicatessen in Ozone Park serving up delicious deli fare at reasonable prices. Friendly staff!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMGVWQmpUazl3VjNaNVMybzRabnBzZVdsME1IYxAB",
            "text": "Sandwich was good. Place is a bit pricy. Staff was attentive and service was quick. They user boars head meat and cheese."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVlUzQk1kMU5uY1VNeFRFWnJNREZJY1Y5eGJVRRAB",
            "text": "Good corner shop for a quick meal.\n\nNo tables inside. This is not a sit down restaurant. It's a grab a sandwich and keep walking type of establishment. It's a convenient store with fast food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScGFIWnFaRWRVTWxwaVJHUnBhM1ZrZGkxb1FtYxAB",
            "text": "I go to this place a lot for breakfast and occasionally for lunch. Service is great. They have good bagels and that’s pretty much all I ever have for breakfast. It’s not touted as a bagel place. But I must say I with they had lox. It’s more of a sandwich place. And the sandwiches are good. But I likes me a heapin’ helpin’ of lox wit a smear of cream cheese, some capers, tomato, & light onion, with some large grind black pepper on an onion or pappy angry toasted brown enough to make the seeds toasted too. Oh yeah, that’s what I’m talkin bout! However, even without all that, like I said, the place is good and I’ll be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQemN0c1RoaktXODdRRRAB",
            "text": "Best 👌"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbHJ6SktnEAE",
            "text": "Food is good.  Staff is friendly."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMXBuU193RRAB",
            "text": "Great deli. Only reason for the 4 star atmosphere is because it's packed. For good reason but still packed 😅 I stop there every time I'm back in the neighborhood. 👍🏾👍🏾"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbnFTNmN3EAE",
            "text": "Good Italian restaurant"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNROG9XRVlnEAE",
            "text": "This food was disgusting! I ordered 2 bacon egg and cheese in a roll and 2 hash browns. The sandwich was lucky to have on egg on it dry and the bacon was old. The hash browns were Definetly from the day before greasy and full of oil the food was not edible! I called and told the girl on the phone and her reply was oh sorry that’s it. Do yourself a favor stay away from this place. It’s not the same."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMzdTZ3hBRRAB",
            "text": "My first time there, I ordered 2 sandwiches,  which came in a timely manner\n,  they looked busy, which I like to see in a deli, and the food was good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbjVUN3FnRRAB",
            "text": "0 🌟 for this place honestly they are very rude, so PRICY don't have any idea how to deal with clients..specially those girls on the front very rude,no respect for people who go there and PAY MONEY FOR A GOOD SERVICE ..…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cUxxeHRnRRAB",
            "text": "Very expensive and not yo thrilled with the food. Never get what you ask for"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuazZPOXdBRRAB",
            "text": "Best hero sandwich turkey cheese Swiss lettuce salt pepper mayo\nThe sesame bread is what makes it the best\nWorth every penny spent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OXFhX2N3EAE",
            "text": "AMAZING ICE COFFEE"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMHFxWS1RRRAB",
            "text": "Clipper Lunch was delicious. Best hero sandwich ever and packaged neatly for delivery"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibXZMMFp3EAE",
            "text": "By far our favorite spot for breakfast and lunch. The staff is friendly and everything is fresh. By far the best rice balls around. Great place with the freshest food. No reason to look anywhere else"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibEltTWJBEAE",
            "text": "Great sandwiches"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaW9uM2pBRRAB",
            "text": "Been coming here since I was a kid, over 25-30  years. The absolute best breakfast sandwiches, lunch sandwiches and cafeteria style lunches (every day is a different menu) you can get. Bacon, egg and cheese made with care - thick and hearty and on a quality roll, not paper thin on a crumbly stale roll like everywhere else. Chicken Parm is top notch, great on a sandwich. I recommend trying the Double Mess egg sandwich in the morning and The Champ or Godfather cold cut sandwich for lunch .. you will love them.\nI will admit if they are busy, the egg sandwiches might be tossed together a little sloppier than usual but even thrown together sloppy it's still better than anywhere else you can go, and it's not even freaking close. I'll also admit they have steadily gotten much more expensive, almost too expensive. But the quality is worth the extra 4 or 5 bucks for a sandwich. I wouldn't go anywhere else if you can stop here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyZzZyQzZ3RRAB",
            "text": "The godfathers hero is a must get!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZck1UU0tBEAE",
            "text": "Great breakfast and lunch sandwiches"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeGFXam53RRAB",
            "text": "Hero was excellent!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "ny",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6dk5fdkpREAE",
            "text": "Malo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUR6MkxkUhAB",
            "text": "Love their food. I stop when I can. Always get tasty sub"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6Z01IUzJBRRAB",
            "text": "Best Italian style deli in ozone park"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNjhHanJnRRAB",
            "text": "First time going, cashier was friendly but I was not pleased with the hero I ordered. I ordered a \"godfather\" hero and while the hero had multiple slices of all the cold cuts that make up the hero I genuinely felt cheated to find just one…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREN043ckZ3EAE",
            "text": "We (JFK employees)order from multiple restaurants and this by far was the worst experience. The lady taken orders was very very rude and acted like taking orders and a customer asking questions is a crime. We ordered about $80 in food and will never order here again. We asked for toasted bagels with cream cheese and receive pre wrap cold n I toasted bagels. The\nLady acted like she did not want to tell what meats were available that were not pork because majority of us do not eat pork and she was very rude. This is the worst experience I ever had and this restaurant has lost our business. Good luck."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadXYzWHZBRRAB",
            "text": "9/7/23\n\nI was driving through the neighborhood and drove past this gem. I made a U-turn to check its menu. My son and I went inside and placed our order. Godfather hero for me and turkey and cheese hero for my son. We enjoyed our sandwiches so much that my son wanted to come back the same day for another one.\n\nI’m very selective about where I purchase my sandwiches because I love good sammies. C & C Italian Deli has reeled me and my son in as new customers. Thanks C & C!\n\n9/8/23\n\nI think that I purposely drove through the neighborhood today so that I can have a reason to stop in again lol. Danielle recognized me immediately lol and the guy who made our sandwiches did as well.  They are very friendly and made me feel welcome. Sandwiches are definitely top notch stuff."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNThlbFBBEAE",
            "text": "I'm gonna be honest, the sandwiches here are a little pricey but they make some of the best sandwiches in the whole borough imo. My go to is a Beef Supreme with mayo and it literally never disappoints. I could pay less money for an average…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEN3VmYnJRRRAB",
            "text": "Let me start off by saying I don't really write reviews, but I had the time today.\n\nI ordered here once for breakfast and enjoyed the food. The next time I placed an order over the phone for delivery after halfway ordering my food I was told to hold, which I did with no problem. I was then told by another staff member they were too busy and would call me back to follow up with my order after waiting almost 10 minutes. Usually businesses just tell you to hold and not tell you they'll call you and end the phone call. I never followed up with the order because I found this weird and was already displeased with my experience being passed around for a simple order that will take no more then 2 minutes.\n\nOn a separate occasion I decided to try this spot out again since it is close to me. I placed my order and was told to hold. The woman who was taking my order asked me \"we're not going to have this happen again right?\" in a very condescending tone. Me, confused asked her what is she talking about. She goes on to say that the last time I ordered they tried to deliver the food and nobody ever opened the door to get the food. The last time being the incident where I was halfway through ordering my phone and was told they would call me back to finish my order. Which never happened! I never finished ordering my food with them and was going to pay with card over the phone. I never received a call for the food to be delivered, no doorbell was rung. When I told her she began to argue with me and say well she saw the person come back and the food was just sitting there.\n\nWhoever is the woman taking orders needs to attend a training on being professional and how to speak to CUSTOMERS to ensure you maintain them. Communication is key and is all about how you speak to others. Had this woman spoken to me with some respect and not a toddler I wouldn't be sitting here spending my time to write a damn review. Clearly the incident was all miscommunication, and a simple way to address the issue while treating a customer with respect would have been to say \"Hey, thank you for ordering with us again. I see here in the system we tried to deliver an order to you in the past, however we weren't able to. I just want to make sure that you are aware of this incident so we can prevent it from happening again so you can enjoy your food this time!\" BOOM! Nice way of telling the customer what happened while being respectful, acknowledging and thanking them for their return and ensuring it doesn't happen \"again\" while talking to them courteously and not a child.\n\nPlease get that woman some training before you continue to lose more customers over someone with attitude."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRZ0lfMU5nEAE",
            "text": "Always have a great meal, the food is fresh and the service is excellent it's the best place in ozone park"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSc1plVHN3RRAB",
            "text": "Old school deli. They make a great sandwich and how ever you want it. Great place for breakfast or lunch on the go. One of the best eats in my neighborhood. Prices don't matter when you're hungry. Enjoy ⚓️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaEtqb3FBRRAB",
            "text": "Just came here. Four employees working here having a casual conversation/fooling around while some of them eating at the same time. Zero attention to customer service. Tried to order food at the front and I was told I order at the back, even though there was no other customer present, so why not stop eating and goofing around and take my order? The two male cooks were busy but the two women were doing absolutely nothing but fooling around eating and would not take my order. First time here and I  just left very hungry and with all my money in my pocket after this completely unnecessary lack of professionalism and lack of customer service. This is a business that deals with customers so I expected some customer service, but I guess that is too much to ask from four employees working at a deli with a single customer inside."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1M0pqWWJnEAE",
            "text": "I was very impressed with the freshness of the chicken parmigiana hero! It was delicious! You Definitely have a new customer and I will be suggesting you guys to friends, family and coworkers!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNObklIeHdnRRAB",
            "text": "My bf ordered a chicken parm sandwich for lunch and he said it was really good, it was perfectly executed the way in which he ordered it. It didn’t make it home for me to try lol! Thank you for making him a happy man!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bl9LS3NnRRAB",
            "text": "Place is absolutely horrible service is terrible! Just ordered off the menu and asked for bread gutted and toasted since it’s a bagel. I got a cold soggy bagel u toasted. I asked to be credited since it was a pick up order and It’s out of…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNjVPM0pnEAE",
            "text": "I definitely plan to recommend this to all of my coworkers that stay near JFK or the casino. Personal favorites were the godfather sub and their bacon, egg, and cheese wraps."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwbHFfa3hnRRAB",
            "text": "Food is fresh and tasty. Great customer service, and they are fast! I do not just live around the corner. I do not live in walking distance yet I still find myself going there at least three times a week. Places like this one in Queens are hard to find."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLMV9qaTBnRRAB",
            "text": "I've been living in Howard Beach for 15 years and never knew about this place. I came yesterday for the first time with my buddy who told me about the place really great fresh hero's, you got a new customer, i'll back soon. Cheers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsNjhmZjN3RRAB",
            "text": "The Godfather hero was delicious.  I had it with sweet peppers and can’t wait to try the hot peppers next time.  Quick walk from the Hyatt."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMVlIX2pRRRAB",
            "text": "Breakfast was terrible. I ordered scrambled eggs with bacon and Hasbrouck. The hashbrown had so much grease it looked like they poured oil straight on it. I ordered scrambled eggs and over easy came instead. Ordered a large hot coffee and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMGJha1ZBEAE",
            "text": "Bacon and egg with ketchup on a roll. Always a great sandwich from CC."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbzZienFRRRAB",
            "text": "This place was a lot better I'd say 5 or 6 years ago as they used to have an elderly Italian couple cooking late at night and would have all the food ready for the next morning and man was it good!…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnOS1ESTRBRRAB",
            "text": "Best food in queens, hands down!! I caught this funny guy in there a couple of time's doing horse racing impersonations, must  be a regular. Great people to go along with great food. Check it out.."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbXUyMENnEAE",
            "text": "Great Italian deli good eats served fast\nUpdate: I have been going here for many years and recently decided to get delivery through GrubHub. The delivery option is the same quality as in the deli , hot food comes hot and cold food comes cold all delicious."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTMDl6bW5RRRAB",
            "text": "Had two heros catered by them and we all enjoyed the freshness and quality of both the heros and salads. All salads were delicious but the potato salad was my favorite..thanks Danielle for your great customer service and professionalism!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aktTSEtREAE",
            "text": "I learned the hard way to order before coming in. Went to get some sandwiches took about 20 mins before I could place an order , another 15 after that they had so many online orders coming in . Great sandwich, don't get me wrong just should have ordered first . Will be back for sure"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdjlxdnl3RRAB",
            "text": "They are seriously one of the best !! I have used them to cater parties ( with their 4/5/6 foot heroes and salads), as well as just a daily lunch or dinner to go. Always friendly and always a pleasure."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2bGJESHNnRRAB",
            "text": "New to the area this place seem to be great. People are nice in the store accommodating everything question and the food is good. It’s a bit pricey but worth the pay."
        }
    ],
    "reviews_count": 52
}