{
    "name": "Don Peppe",
    "place_id": "ChIJ4Vgyn2tnwokRi3vnVvaHfv8",
    "grid": "QN10",
    "address": "135-58 Lefferts Blvd, South Ozone Park, NY 11420, USA",
    "rating": 4.5,
    "user_ratings_total": 1480,
    "phone_number": "(718) 845-7587",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreVRGQXhOWFJ5TWpCVVdtWTNWVlJOZWxGeFQxRRAB",
            "text": "Doesn't get any better."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCYU9GUm1aMncxZWw5RWEzazVWM1Y1YVU5a2JXYxAB",
            "text": "I have to get back here for a lunch, it's been too long.\nDon Peppe's is a wonderful Italian restaurant. You need to go here with friends. Many of the dishes are family style. That is you share and allow plenty of time. They don't rush you. You can sit back, relax and enjoy your meal.\nAnd you will!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscmN5MXJPWHBXVUhKRmR5MVBTMGRpYUZGMVpHYxAB",
            "text": "You need to go here once and you will be hooked."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSk1IUXdNelptV0VZeGEzUklTVmRGT0VWRE1uYxAB",
            "text": "Food was very good 👍🏻 waiter was very nasty and not able to get people in our party he adamantly refused dishes requested 😑 not good for business."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvemNrYzVPRmx4U2taV2IwaFBOVTFsZEdzMk4wRRAB",
            "text": "Old school family style classic and traditional Italian food. Baked clams and linguine with clams a must .  Overcooked/ dry/charred chicken scarp. Left three quarters of it .. waiter looked suprised when we refused to take the leftover home"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KV1JtSk1XVzExY3pWcFZTMUhZazVzTmpONlRGRRAB",
            "text": "Ghe baked clams dip the bread in the sauce shrimp luc veal don pep tomato onion salad olive"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twaGVFcENjMlZ6VDJoWVZ6aFVaM0ZQUzFaYWVXYxAB",
            "text": "My favorite Italian restaurant been going there since i was a kid. Highly recommend"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMFYzaElkekZyWlRsNFVITm1TRU50VVRkWWRVRRAB",
            "text": "Very friendly service. The food is excellent and the restaurant is actually quiet so it is easy to have a conversation at your table.\nOne of my favorite Italian restaurants of the city."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MFp2VXZnRRAB",
            "text": "Nice Italian foods in this area"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSExXaFlWVGx6UTJkMWJIWnNaV2hXUWw5dWRrRRAB",
            "text": "Real Italian,  family style.  Delicious!!!!  The linguini and clam sauce is a must."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twaFVXbExPRGRCTkVSTFFVbE9UVUpWYlhFd1dFRRAB",
            "text": "Delicious Italian food and the best baked clams and mussel marinara!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVlUyazFZbHBUUzBGck1rcG9XR1JsYXpFM1owRRAB",
            "text": "Food was unbelievably good. The server Frank was super friendly and helpful. Decor a little old but food and service really made up for it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSVMwRnFWVUZXWDFBeGVEbEdZbkZQTlUxc2ExRRAB",
            "text": "Feels like eating at home. The service is outstanding and the food is delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNFNGZDRjRFZOZWxvMFR6aE9iRzEzT1VsUVpuYxAB",
            "text": "The wait can be long but it’s definitely worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTE1sRndhM0ZZUTIxNVlsRlpNa0V6V0hCc01tYxAB",
            "text": "My wife was in the restaurant, I paid the bill and tipped which I was still finishing my beer and waiting on my wife in the rest room which a waiter came up to me and asked me to leave. I spoke to the manager Mike about this which he told…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ZlFuZFNZeTFOZG5GZkxUSmlaMjB3VFZWdFRYYxAB",
            "text": "Great old fashioned Italian food and huge portions"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaU9GbEtXWGhuTWtJelExVnZMVkJ6V0c0MlRGRRAB",
            "text": "Fantastic old school spot. I like the menu on the wall. Service was very good, our server made recommendations and we got a great meal. Still ended up with leftovers despite tried my hardest not to fill up on bread haha. The shrimp Luciano was fantastic, my bf was sopping up the sauce with bread. We didn’t get it as a pasta because we got the white clam but boy do I wish we had, so good! 26 dollars for the house wine so you can know. Did annoy me that there no prices for that. The baked clams were very good but I prefer traditional clams in wine sauce over baked but if you like baked you’ll love. The white clam sauce was so so good. Must order. The veal eggplant was also quite good. First time trying and I enjoyed, I would probably do chicken or beef next time though, so much looks good. Now I have to knock a star if a place is cash only in 2025. I only had 200 cash and I felt bad I couldn’t tip our server more. He was great. Don’t know if this is on purpose but there were only male servers. Can’t wait to return and the location is so convenient for me for once ! MUST DROP A STAR IF YOURE CASH ONLY IN 2025"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNGExZGhSbHBvWTBvelltSjRSbEJQT1doYU9XYxAB",
            "text": "Always great food. Waiter was very attentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUmJpMVBNazlRUm01TWNHMVhlV1pHU2xoWWRGRRAB",
            "text": "It is closed for vacation. I will have to give a review at a later time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sck0wdEdVa0pMTlV3MmNHWXhZM014YW5GV1RtYxAB",
            "text": "Traditional red sauce place. Been going for over 60 yrs. Don't miss this spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVU5EVjNOa0p1TUVOdE9TMVZlRU13Y1ZJMmFXYxAB",
            "text": "Great for family style dining.\nPortions are plentiful and well made.\nNo menu its read off the wall"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBd0xXRmliMlZ3V2pWRWIxQTJSVTFSV1ZSc09YYxAB",
            "text": "A friend from work who lived in the area wanted to thank me for helping him out & took me here for dinner. (7pm on a Friday in July) I was able to find a parking space around the corner but could tell parking could be difficult in the area. This place must get pretty busy, they had a bunch of benches outside in a covered space for those waiting for a table. Luckily there was no wait when we arrived & were shown to a table immediately. The restaurant has jockey jackets & pictures of race horses everywhere. I guess because it’s close to a race track. We had the mozzarella and roasted peppers with tomato & baked clams as an appetizer. Then spaghetti with bolognese sauce and chicken parmigiana for the main. The waiter was very polite and professional. The food was pretty pretty good as well. The bill came to $165 including a bottle of house red. ($200 with tip) Not the a bad place to have dinner if your in the area."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SmMxWjJkalp1WjB4MVZ6Sm9aVkp6WjBWaWRXYxAB",
            "text": "Best Italian food I have ever had. Large family style portions. Tender meat. Great flavors. Service was awesome. It’s cash only, so stop by the ATM on the way."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUlkzRTNXR2wzTWs5dWIxQnVPSGRHVlhsdE5tYxAB",
            "text": "CASH ONLY business!! They might be doing something shady with all that cash being recieved and not filing taxes!! Our waiter can not provide us with an itemized receipt on what we ordered. He claims the receipt was handed to the owner and the owner would not give it back, our waiter will only issue a hand written total amount spent and date! No stamp or proof of purchase from this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGb1pYb3pRbmR3V0hSdGEyUlNVMUpUYUhrNVNuYxAB",
            "text": "Real Italian family style food. Must have the linguine with white clam sauce and the Veal Don Peppe. The house red wine is great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTGMzRXRkV015Wm0xVE1YSjZTMGhWZHpGWE5XYxAB",
            "text": "Growing up and going to la parma in long island, this was a welcome nostalgia hit. Good service and didn’t try to upsell us on food. Cash only and emptied out the wallet which was only thing stopping us from tipping even more on the friendly waiter."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GZmFVSkdTbFEyUjFoMlpYQTRhMDVPVERSWlZrRRAB",
            "text": "Delicious food - every dish and super efficient and friendly service !!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UllsUnpaakYyUlVSWU4xRlljbmt4UTJ0Vk0yYxAB",
            "text": "Had a layover flight and looked for Italian close to our hotel.  This place was busy but the food and service was great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdlZtRlhiMVp5V1U1MGIyOTNOemRyZWw4MGJVRRAB",
            "text": "The food was just okay nothing exceptional about the food.\nThe seafood pasta sauce was very good but the seafood was very limited. Mostly calamari and a few pieces of shrimp. No other seafood was included in the dish.\nThe Veal Don Peppe was okay but not exceptional.\nThe cappuccino was terrible. The bathroom was a mess.\nThe service was below standard most of the waiters were just scrolling on the phone because the place was not very crowded.\nMy friend and I were excited about going to this restaurant because of the great reviews but we were both very disappointed. We both felt that the waiters would have been happier if we had not visited this restaurant.\nA major disappointment sorry we went to this restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRM1dtc3pYMHR2YTJWbFMzWmlZamRNWW1SNVpXYxAB",
            "text": "Very good Italian food. Will definitely be coming back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSVdFMTNlamhDUTFobmEyMUhjVGQ0VkdWUldHYxAB",
            "text": "2nd time here and we love everything about it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U1JrNDJTbmxWU25kcU5YVlZWRmhRT1hKMVNrRRAB",
            "text": "Best Italian food, just like mama made."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xME5FeEdiMUJYTUhOTFNWSmhTM05FYTBKcFlVRRAB",
            "text": "Old school, delicious food! No menus (look on the wall), homemade wine, all cash."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWGVrbGFVR0oyZVdoQ09GQk5jblZSYVRsdGExRRAB",
            "text": "I have dreams of Veal Don Peppe!"
        },
        {
            "date": "4달 전",
            "language": "ja",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNQzJfNGlWN09xaUFREAE",
            "text": "イタリア人のイタリアンレストラン\n地元の人達で常に賑わうレストランでとても美味しい\n現金のみも昔からのイタリア流"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKLW45TU9jN1lxUWF3EAE",
            "text": "Very good food and amazing flavor on the bread"
        },
        {
            "date": "4달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLX1FvXzJaMzVhazZnRRAB",
            "text": "Excelente 👌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKN0YxZXpxcllLVjZRRRAB",
            "text": "Food is OK. Nothing to write home about. Mandatory 20% tip."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLMkwzYlBxM09DbTB3RRAB",
            "text": "Don Peppe never disappoints. Always fresh and delicious food. Staff is very accommodating , great place, great food!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPS1BzZlMwMGVpSHNnRRAB",
            "text": "It's everything you'd expect from an authentic Italian family owned restaurant in NYC. Hey look, I'm not eyetalian, but I love their culture (I married one too) and commitment to the finnest food, dinning experience ...and attitudes. Mike will be the first to tell yah \"don't wear a tank-top here\" whe you tell him you're a truck driver. I love this place. Great food, ambiance and service. Thank you."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1Nk1pZ2pRRRAB",
            "text": "나의 가족 4명이 1개의 스팀 조개와 1개의 새우 링기니 파스타를 먹었다. 스팀조개는 맛있어지만 링기니 파스타는 짜다. 파스타는 큰 사이즈였고 $66과 새우값 $28을 추가했다. 스팀 조개는 $30이었고 팁 $27도 포함되어 청구했고 나는 캐쉬로 모두 $162을 지불했다. 뉴욕 유튜버의 \"인생 파스타집\"이라는 말에 속아넘어간 것 같다. 약간의 돈을 서 쓴 것보다, 그 유튜버의 말을 너무 신뢰했던 나를 자책했다.\nFour members of my family ate one steam clam and one shrimp Lingini pasta. Steam clams are delicious, but Ringini pasta is salty. The pasta was large and added $66 and $28 for shrimp. Steam clams were $30 and charged with a tip of $27, and I paid $162 in cash altogether. I think I was fooled by the New York YouTuber's \"life pasta restaurant.\" Rather than spending a little money, I blamed myself for trusting the YouTuber's words too much."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnbTgtNV9nRRAB",
            "text": "모든 음식이 맛있습니다"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZ2VxNVJBEAE",
            "text": "Hidden gem, everything on this menu is amazing, the clams and linguini to die for. The calamari was excellent, the rigatoni was insane. Chicken was really good too. You cannot go wrong with ordering anything from them. Only issue is cash only but totally worth it!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZak1HRGR3EAE",
            "text": "Every time I go to Don Pepe, I’m always impressed with the service, it is consistent. The staff is very friendly, professional and accommodating, the food is outrageously delicious and the deserts are top quality. I highly encourage everyone to try Don Pepe, I promise, you will be very happy you did."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMek55THlBRRAB",
            "text": "Been dining here since the early 80s. And it’s still special. One big room, many personable servers. No cocktails. Wine choices: red or white. And the bottle arrive with no cork and no label. But delicious. Baked clams are the best I have ever tasted. Always. We had planned on ordering salad and pasta, but the server said we were making a mistake. The fillet of sole was a rare ‘special,’ and the Portobello mushrooms were delicious.  That we could have pasta anytime. And because he made sense we ordered the fillet of sole and mushrooms and they were, indeed, delicious. Cash only. Noisy room. Happy people. Accessible ♿️.  You don’t know what you’re missing."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3eG92X0JBEAE",
            "text": "This is a must try or revisit. The food quality never fails in my opinion. The servers are very helpful in selecting quantity, as this is a family style restaurant.  Cash only, no reservations. Table service is excellent, they will portion out and serve each person. Pictured: Sausage and Rigatoni, Salad Don Peppe, Chicken Parmigiana, Stuffed Shells, Bruschetta Chicken, Baked Clams and Tiramisu. \"House\" red or white wine is served along with a small selection of beers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeVB1UHp3RRAB",
            "text": "If you’re not Italian, I would avoid this restaurant. Everyone in our group was Asian and we all felt the micro racism. Even though the food is good, it’s definitely NOT worth the hassle and horrible service. The food came out so slow and we noticed all the other tables around us getting served first even though they were seated after. We waited forever for the broccoli rabe and it arrived severely overcooked. We paid $28 for a plate of soft and mushy baby food. At the end, an older Italian customer laughingly walked past and said “you guys can’t stay forever. You know you guys have to leave right?” Mind you, we were finishing our dessert with my friends two year old daughter. Definitely will NOT be returning esp for the price point. 1 star for their rudeness & racism."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENDlUZXdRRRAB",
            "text": "First time for me at Don Peppe. All my friends were quite surprised it took me this long to go considering I am the foodie of the group. The baked clams are amazing which I heard beforehand that they are a must order. The other appetizers we ordered were the roasted peppers, and the famous house salad. For dinner we ordered the veal which was unbelievable. It was so tender and as they say can be sliced with a spoon. The bruschetta on top of the veal was a great accompaniment for the veal. We ordered two pastas. The linguini with clams were very good but the Shrimp Luciano and chicken scarpariello were amazing!!  The whole experience was absolutely great. The house wine was good and the delicious cannolis topped off the night. Will absolutely be back!! Please be aware that this place is cash only, doesn’t take reservations, and parking is quite difficult. That being said it’s still worth it to go and experience a great dinner at Don Peppe’s!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeUxfOU1BEAE",
            "text": "Food was pretty good, but by any means not amazing enough for our trouble or travel and money spent there. We came here from Brooklyn, the second we walked in the whole atmosphere and establishment, every 6 of our party can feel and tell how unwelcoming and off it is. We were always so kind and polite too. We waited sooo long in between our courses to come, for the pasta to come after the appetizer, then our fried veal don peppe took sooo long too after we quickly finished our plates of linguine clams. All that, after receiving such poor slow service we got rushed out after. We weren’t even the last groups to leave to leave either. Every one of us agreed that we haven’t felt such a micro aggression racism in a while. It’s a very old school Italian joint. I definitely would not ever be coming back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvOExEYTdnRRAB",
            "text": "Friendly staff and spacious restaurant. I hear they have lines out the door on weekends. We came on a Tuesday at 8:30pm and got seated straight away. My favorite dishes were the shrimp spaghetti (sauce was sooooo flavorful) and the lemon…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNDhucFJ3EAE",
            "text": "Mike and the crew are amazing!  I stopped in for some Italian food and was treated like family!  The best spaghetti with meat sauce I’ve ever had, hands down.\n\nIt’s family style, so the extra portion was boxed up for me before I left. There’s plenty of food.\n\nI want to thank Mike again for welcoming me in. I told him I was visiting from Arizona and he made sure my experience was the absolute best!\n\nIf you’re in the area, and even if you have to take a drive - GO EAT AT DON PEPPE!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdzZ1RjRRRRAB",
            "text": "Finally made it over after wanting to try for years. Great food and service. The clams and pasta were some of the best I’ve had. Could’ve skipped the chicken, but it was still good. Desert was good as well."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCaWJ1aVBBEAE",
            "text": "Great authentic Italian classics. Fast service. Very crowded aliitle noisy but enjoyed my food so much. The crowds move along fast. Food is hot, fresh and great flavor. Only issue is you have to get up and read the menu on the wall and stand in front of people's table."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeF9IeU1nEAE",
            "text": "Still the best!\nYep, best Italian food around! Family style and straightforward. No fancy wine lists here, but boy is it great!\nGot to try the shrimp Luciano with linguine, stuffed clams, mussels white and red sauce, and chicken don Peppe!\nAnd yes, even the house wine is delicious!\nWhen your 12 years old tells you they love everything here even the onion you know it’s good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydjd2T0JBEAE",
            "text": "Very much out of the way, and probably not worth fighting the airport traffic to go there again. The linguine and clams, portobello mushrooms, and fish were as the waiter recommended: delicious and flavorful. Other than the recommendations, the waiter was a little impatient and brusque but not rude outright. They don't have menus other than the large board in the back, which apparently has a 'typo' about the raspberry tartufo. The other dishes we ordered: broccoli rabe, veal ala Don Peppe, peach sorbet and tortoni were just ok.\n\nOddly it says they close at 9pm on the door but they started cleaning up around us around 8pm and by 8:30 we felt rushed to leave. It would have been fine but it also took a while for the food to get to the table after we ordered.\n\nLastly, the air conditioning here is not great, so on a hot and humid summer night in NYC, be prepared to sweat."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleXBxNjR3RRAB",
            "text": "Great Italian amesphere!  Large portions, but all wonderfully delicious!  Fantastically simple, but refreshing salad, pastas were so flavorful that we couldn't stop eating.  The fried veal was outstanding, love the tomato toppings."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyOGVPektREAE",
            "text": "A place that doesn’t get more authentic. Had the best baked clams of my life here. Portion sizes are big as advertised and I recommend to come with at least 4 pax to ensure you can try some of everything. The veal parm was phenomenal too. No cc which is find a bit outdated. Its 2024. Get over yourself, take the credit card."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbHVTdktBEAE",
            "text": "Only had time for a quick bite but everything was good here.\nStaff were attentive but not intrusive.\nThe veal was well cooked and the tomato bruschetta type topping was delicious.\nPortions are family style and size.\nWould definitely come back to try other dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNU5hWVVREAE",
            "text": "Always perfect!!! This has been my family’s favorite spot since I was a child. I take everyone who hasn’t been here, here! It’s the absolute best. You will NEVER find better linguini and white clam sauce, anywhere. House red wine is also amazing & the baked clams are literally exquisite. Don Peppe is a MUST!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNWQyVmJ3EAE",
            "text": "I've heard about this place for years and always wanted to try it. We met friends who live in Queens, we came from Rockland county on a Saturday night, no traffic 1:15, waited 30 minutes for a table so not bad. We had baked clams, veal parm, chicken marsala, linguine with white clam sauce, and escarole. I will say that everything we ate was very good, enjoyed every bite, pasta perfectly cooked, tender veal abd I really liked the escarole, something Ive never eaten. With 2 wines and tip food, it came to $125 a couple, so it was really a great value. Hideca great vibevto the place and service was excellent. I'd come back if in the area, but it's not worth the long ride for us."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdU5Ec0l3EAE",
            "text": "Although this is mainly a fish and meat place, they had vegetarian options. The eggplant was delicious!! Highly recommend ! Dani was an excellent server !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQteGFmSWd3RRAB",
            "text": "Just LOVE Don Peppe!! While they don't take reservations, Mike made sure we were set for my son's birthday. The service was excellent on top of delicious dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1M1lQSi1RRRAB",
            "text": "I simply just love Italian cuisine and my friend suggested that I try this restaurant because it’s old school!\nI loved the food, the spaghetti and shrimp sauce was really good and well as the Don Pepe chicken!\n\nOnly reason I gave 4 stars, the service was horrible, the waiter didn’t introduce himself, we are yet to know his name, there was a wait for my food, my significant other received his food before I did!\nWe just wanted to get out, I did even wanted to get dessert!\nHe pretty much just ghosted us! Had to sit and wait 15 mins to get the check, but very present to receive his tip!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMelhucTd3cV8tUExREAE",
            "text": "When I was a kid, my aunt and her friend took me to this place, and it was kind of a dump. I actually liked the humbleness of the place. It still kind of is, but the lemon butter veal was one of the best things I'd ever tasted. It is still a favorite.  I've only made it back once in 35 years but need to change that."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRbjhhcHRnRRAB",
            "text": "This place has amazing food, authentic Italian . The food alone is delicious and deserves 5 stars. However the 3 is because the hospitality and service really sucks. Not sure if it's because they have a lot of pride when it comes to their food but definitely a deal killer for me. This was my first time here No one told us that there wasn't any menus. After 25 min I decided to Google the menu. 10 min later the waiter asked if we were ready to order I asked him what happened to the menu he pointed to the wall. We couldn't see anything due to the angle of our table. The waiter didn't even bother to tell us the drink menu. I wanted to order a glass of wine and as he walked away I asked him what about my husband he said \"Oh I thought you knew it's a whole bottle\" He knew it was our 1st time why ask. Personally they aren't nice. The food is way over priced for the small potions they give you. Whatever was packed to go was thrown in the container over flowing which was a huge mess once we got home. We had ordered 3 dishes and he only packed 2.... What happened to the other dish? This place has horrible service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOWJtZ0RREAE",
            "text": "This was a phenomenal dinner my wife and I had. We found ourselves in Queens for the evening staying in the area for an early morning flight. The hospitality was amazing and the food as great. Our server took excellent care of us, suggested house specialties and checked in on us frequently. The house red was excellent and a great price for a whole bottle. Further, we tried to order the stuffed artichokes and we were told that the artichokes just didn’t taste right and were not in perfect season so it was off the menu for the time being. THATS how you know quality is a huge factor. If you are in Queens, do not cheat yourself, come down to this monumental Italian restaurant and get yourself a good meal."
        }
    ],
    "reviews_count": 66
}