{
    "name": "Lenny's Clam Bar",
    "place_id": "ChIJJZUbfH9nwokRB4PiUl_hUls",
    "grid": "QN10",
    "address": "161-03 Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.4,
    "user_ratings_total": 3218,
    "phone_number": "(718) 845-5100",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZM1NWVlBNVzVSVmtOeFgwTm1VbDlwZDFCT01uYxAB",
            "text": "Lenny’s is not only delicious, it’s friendly. They make you feel like a part of their family. Excellent service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paZmMweGphRkJyVkdWYVgzQmhWMFpLYVVrdGJIYxAB",
            "text": "We went to a retirement party Saturday night.. we had a private room and I found broken glass under one of the tables. The bathroom, which was on the same floor had a very sticky floor…\nThe skirt steak was probably one of the worst I’ve ever had.\nI will not not not be going back to this place"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWGNqbHlkSFYxWm5SaU9XNVdhelpsTkMxeVZWRRAB",
            "text": "DAVE THE WAITER AND SERVER WAS AMAZING, THE CALIMARI WAS THE BEST AND SHRIMP LIGHTLY BATTERED WAS ON THE MONEY!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaFl6bERXbFJtT1VrdGF6WTVObnBGYzE5aGNXYxAB",
            "text": "Everything was excellent!  Can’t wait to go back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obk1UWlZjbk10VlZwM1oyWndTWGMwY0Vsc2NIYxAB",
            "text": "Awesome dishes and service was great and helpful"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MVgxRnZZemxhYVd4NlNqUnVSVmRJYUZZMk1rRRAB",
            "text": "The best service,  and the food was amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdGNqWlhXRlEyTlRaR05YaE5NRFpXTW5FeGNWRRAB",
            "text": "Excellent sea food & service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toR2QyMW1jM2hyZHpNeE5tNXBTMEpuUmxjeFVuYxAB",
            "text": "i was party of 1 in an empty restaurant for lunch. that was my mistake. it's like being dumb enough to get on the only empty car on the subway. iykyk! i got the broiled platter of scallops, shrimp and sole, and the minute it landed on the table, i could tell the sole was off. like very FUNKY with a mix of ammonia. not good.   ordered a baked potato as a side, received sautéd zucchini and carrots. a big potato would have given me something to eat. the restaurant was empty mind you so it's not like they were busy.\nfirst time. last time. a waste of $79. the martini was good. take a whiff of your plate people. clams casino was just ok"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNFoyRTNhREpJYWt4dE5YVTRjbDkwTTFReE5sRRAB",
            "text": "Delicious food and great service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taU2FHdGpNMGM1VlUxa09ISmlXVEp0YWxOaWEwRRAB",
            "text": "Try the chicken cutlets they cut like steaks. I’ve never seen a more thick chicken cutlet in my life."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRVowSm1URTlXZWtGTFZUVjFORVZsV21ObGRXYxAB",
            "text": "Been going there 25 years. Food always good and on point. My favorite is the fried butterfly shrimp with waffle fries"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbVVIRklYekZKTjNvMGVrMTRTMk5xZUhKbVdWRRAB",
            "text": "We had a fun time and would come back.  We had the Fra Diavolo seafood 🦞 platter for 2."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNFFWRXhlWFV0V2xoU1NtNTBRVmhEZVRsQ2FuYxAB",
            "text": "Everything we ate was delicious. Not one bad thing to say about the food. Tasty, perfectly seasoned, and it also looked appealing. The baked ziti was my favorite and the clam chowerder was the second!\n\nHighly recomend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWU1XaG1RMXBIZURrNFZFbFpZVXd6VmpjNE5IYxAB",
            "text": "Amazing food and wonderful service!  The staff is extremely attentive and accommodating.  You are always greeted with a smile and like you're part of the family."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObmFubEtZbE5TYWpGSFdIUTVUbVphT1dRMlgxRRAB",
            "text": "I was born in Sicily so I know what good italian food is. I know what's real and what's fake. No other restaurant in the whole state meets my expectations but this one. If I lived in Howard Beach,  id be here for every meal. Id have a gazillion pictures of me and my family all over the walls. Id have my kids work here just so I can come here even more often. Every restaurant that I've gone to in my entire existence never satisfies me. The food here especially the seafood is fresh and is made right. The calamari is cooked to perfection. Its cooked so well its like eating a fresh batch of McDonald's french fries.  This food cures cancer and my diabetes.  No matter where I go on the planet ( besides Sicily) no other place compares to this by light years. Lennys and lennys only!!!!!! I swear once this place closes heaven forbid , ill never go out to eat again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdFdrbDNkWEZqYzFBeWF6ZHZlWGt5UzNrM1prRRAB",
            "text": "We flew in for a funeral and we’re staying at the Hilton near JFK so we decided to have dinner in Howard Beach. This was our first time to Howard Beach so I left the dinner pick to my wife. She picked Lenny’s Clam Bar and we weren’t disappointed. We started with the clams casino and then she had the Crab Cake special and I had the soft shell crab special. Everything was good and the restaurant has that old Italian vibe. We split the  Tiramisu  for dessert and a pair of cappuccinos. All in all we recommend Lenny’s especially if you like large portions."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcVV6VTFYMEZqYzJOUU5VcHNhMUJYVkZwNFpHYxAB",
            "text": "Delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GV2N6QlhNV3BQWmw5TWJVMU1PV3BXYURWRGRXYxAB",
            "text": "Seafood trio is the way to go if you're indecisive and love all the seafoods. The crunchy breadsticks are unusually excellent, my husband liked them so much he wanted to ask all about them."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0T1VFOVlaa0pwVDBWUmFGcFNNRVp1UjAxUkxWRRAB",
            "text": "Portions was huge, wasn't over the top great, I think i just chose incorrectly, Clam chowder was awesome."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSFFreGpjSGgwVFVObWNsTkZNa2c0VDBSaVRIYxAB",
            "text": "While deciding where to go for lunch my friend’s wife called & mentioned that there were some new restaurants on cross bay Blvd so we decided to take a drive. Then ended up at this classic spot which celebrated its 50th year in business last year. (They still had the signs up) Neither of us had been to in years. Upon entering they have pictures of various celebrities who have dined there in the past. We were shown to our table by a polite hostess. I ordered the lump crab cakes, which weren’t what I had in other restaurants. They were more like your typical fried crab cake except larger. They were ok but I felt as though they were missing something. My friend went with the lobster bisque which he said was great. For our mains I went with the linguine with clams which was good & he went with the shrimp & calamari which unfortunately he was less than happy with. He skipped dessert but I couldn’t resist trying the crème brûlée doughnut. It is extremely delicious however incredibly sweet. If your sweet tooth is at least level 9 you’ll probably find it sickeningly sweet. They have a small bar area & it looked as though there were more sections to the restaurant for busier times of day. 50 years in business they must be doing something right."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RE1UUnViR2d6VkcxUllWVkxVVXhqWjBSbWRrRRAB",
            "text": "Had my mom’s 90th birthday lunch here today.\nWe were in the main dining room, 16 of us in total.\nAppetizers, pasta, main course, dessert…everything was delicious.\nThe waiter and rest of the staff were all amazing…everything came out in a timely manner.\nThis place handled our group flawlessly, and for a very reasonable price.\nThank you Lenny’s for making it a great day!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdVRISnJlWHBPTTB4RmFsaFVOM0ZmZVUxdkxYYxAB",
            "text": "Goat"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TmRrUk1TRWxPWWxwSlFWVlRXak14WjNCR1JGRRAB",
            "text": "Forgetaboutit"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjd1QwRmtVRXBZV1VreVQxazRTbVIyZERkdE1YYxAB",
            "text": "OMG that was the best lasagna ever I had in my life."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cl83My1RRRAB",
            "text": "Update, not what it used to be. Calamari was greasy and the seafood fra diablo was just ok. Their sauce was not that explosion of flavor I was used to. Past: One of my all time favorites.  Years since I was last there and I can say their food is always amazing.  Baked clams very tasty, the Lenny's special was a 10. Thanks 😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeGFFeFBPSFZsV2tSbWFVdDRjRk5LYUd4R1QyYxAB",
            "text": "Get me in the kitchen. My amateur vodka sauce can’t compete with the blasphemy of what they call vodka sauce"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psc1NVTTBMVlJTVW1veGMwUmtNRWxZUlRoZk5WRRAB",
            "text": "Always great when I go for professional meetings with my organization!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVVlrczBkbE5QWVZSUlVWQlROM1JsUlY5RU4wRRAB",
            "text": "great food"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNemFtTnhURUo0WVhwMFVqVkNiMEpaYTNONVgwRRAB",
            "text": "Amazing food and  experience"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWS01EVkpjRGRLT1ZkVFNFMDBUMWRPWlZoNVlWRRAB",
            "text": "Great sea food selection. Very nice wine list. Very flexible with the orders. Would recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjd05GVXROWFZaWjBocE9HOHlZa1ZKUjI1VE4zYxAB",
            "text": "I still dream of the clams on a half shell and a good friends from grade school!!!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORlRFRTNjM1ExYWxsZkxYRlVNM2RSYmtSdlpsRRAB",
            "text": "Buen lugar para comer comida italiana. Te da una entrada y la comida estaba deliciosa."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMVpHcFZVVGgxWTJoQlMwVnBTbUk0Um1JNVNHYxAB",
            "text": "First and last time i went there.  The food was horrible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRWNrOU1PRTFhY0ZWdFUyOWZWblY2YTBKRVkyYxAB",
            "text": "Clams uggg terrible"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4dGIwWXpOR1UwUm1saVRYSnJVRTkwYVhaZloxRRAB",
            "text": "Delicious Italian and seafood."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQmJDMHpUMFJQTFVjNGNFeFlVaTFTZUVOVlpsRRAB",
            "text": "The food was great no complaints my only complaint is the big manager with long hair I didn’t get her name but she’s completely unprofessional on my way leaving the restaurant Sunday night I overhear her talking about her staff . And laughing about it I looked for the owner but couldn’t find him unfortunately because no way would he let that level of unprofessionalism in his restaurant and to his employees"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VdGFqbENZMHBQTlV0Rk16bGFRbmM1Y0dWMVZrRRAB",
            "text": "Terrific fried calamari"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTGFYTlpUME52U0U5TFNGUnliM3BUYTB3MFMwRRAB",
            "text": "This restaurant is a staple that celebrated their 50 year anniversary in 2024. I was in the area and decided to try it and was glad I did. We started off with fried zucchini which were sliced thick breaded and fried, served with tomato sauce on the side. They were very tasty. We also had the fried calamari and shrimp combo also served with side choice of spicy, medium or mild sauce and the baby back ribs which came with choice of potato, baked mashed or French fries.  Everything was delicious. The ribs were fall off the bone juicy and not greasy or fatty and the fried seafood was crunchy but tender. The service was very good.  Our waiter and the busboys were attentive as well as courteous. The decor was a little dated and the ceiling tiles which are yellowed from age need to be refreshed. I would revisit this restaurant if I was in the area again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeFlVdHFjbEJ0VDJaZllXaHVUSFJpT1dST2RYYxAB",
            "text": "First time at Lenny’s Clam Bar and it definitely won’t be the last! The whole place had a warm, family-style vibe that made us feel right at home. Service was great, and our waitress was incredibly sweet and attentive.\n\nThe food? Absolutely delicious. The fettuccine Alfredo with grilled chicken was creamy and flavorful, and while the BBQ chicken had more of a rotisserie style to it, it was still tender and tasty. The calamari with marinara sauce was a hit, crispy, fresh, and perfectly seasoned. And the strawberry daiquiri? Spot on, sweet, refreshing, and well-balanced. Cappuccinos were a nice way to top off a perfectly dining experience.\n\nDefinitely recommend and already looking forward to our next visit. A great spot for a cozy, satisfying meal!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvamJ6ZzVRRRAB",
            "text": "Great food and service. We had the baked clams and tried the fried calamari, shrimp and scallops. All made to perfection. Their medium sauce was the perfect flavor and the right amount of spice. Love coming here and enjoying some fantastic seafood. Definitely try this place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbXBtS3FBRRAB",
            "text": "Lenny's Clam Bar is a true gem. The place is warm, welcoming, and full of old-school charm. From the moment we walked in, the staff made us feel like family. The food? Unreal. The lasagna was hands-down the best I've ever had. It was perfectly layered, cheesy, and packed with flavor. The calamari was light, crispy, and fresh, and the homemade cannoli was unforgettable and the shell had that perfect crunch, and the filling was rich, velvety, and just sweet enough. Every dessert we tried was next-level, you can taste the love in every bite. It's the kind of place that leaves you full, happy, and already planning your next visit. Don't miss this spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOTlEMWxRRRAB",
            "text": "This is an amazing seafood and clam restaurant! I had the snow crab legs which were amazing. And the clams and linguini was great too. as well as fresh raw oysters. They also serve steak and chicken For those that want meat options. I highly recommend it!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cWRhQ1BREAE",
            "text": "First time here and the food was very delicious. On the house bruschetta was excellent. An order of chicken Parmesan and penne alla vodka was enough to feed 3 people. Cocktails were a little expensive ($18 for an apple martini). I would come back whenever I’m in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUMzNUpGdBAB",
            "text": "My husband and the kids decided to go to dinner spontaneously, couldn't figure out where exactly we wanted to go. We're always in LI, so we figured we'd try something different.\n\nEnded up here and let's just say, this will be our new go to spot!\nDelicious food, friendly staff, and great drinks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMk5paW53RRAB",
            "text": "Lenny's Clam Bar is an absolute gem! The atmosphere is cozy and welcoming, making it a perfect spot to relax and enjoy a meal. The waiter is always friendly and attentive, adding to the pleasant dining experience. The food is fantastic, with fresh ingredients and amazing flavors. I highly recommend trying the fried calamari, pastas, and baked clams—they're all delicious. The Lenny's special is a standout dish that you simply must try. To top it off, the prices are incredibly reasonable. Plus, the outside seating make dining here even more enjoyable. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMck1qZ0VREAE",
            "text": "We decided to check out this restaurant. The room facing the water is only for banquets, so they put us in a back room. We felt like in a box, it was hot, we asked for more air conditioning, but got no impro.  The service was great,  the food was just ok. I've tried much better Italian food. It's pricey.  So we felt like paying the money for ok food and no view wasn't worth it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMnREcm53RRAB",
            "text": "Came in on a Tuesday evening, the ambiance was great and our server Ivan was wonderful!  We got the raw clams and mussels, unfortunately the clams were not as fresh as we hoped for. We also got the barbecue sampler … the mashed potatoes didn’t seem authentic and the barbeque sauce was way too sweet and it ruined good meat. The Italian cheesecake had good flavor but was dry and grainy. This is an honest review and I loved the service. This is a clam bar so I’m sure it has its specialties but what I ordered was not as enjoyable as I hoped for. Will definitely come back again to try other meals (:"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MmFQTFlBEAE",
            "text": "This is a 3 star review not because of the food, but because of our waiter, everybody else was great !!\nSo my husband and I came here for dinner we haven’t been here in quite a while.\nOur server was Eugene .\nI’ve never seen him before so to me he was new .\nMy husband ordered the calamari. I got the fresh mozzarella with peppers and tomatoes and add olives added. .\nFor dinner, my husband got the ribs with mashed potatoes, and I got the Ravioli .\nTwo times I wanted to say something to either the server or the runner and they walked away before I had a chance so it was like  Ummm\nBut they were gone.\nSo instead, I went up to the host and had him help me.\nFood is always good.\nJoe DeCandia, who is the owner is always here on hand, making sure his guests are happy .\nWhat bothered me is four top tables with two people sitting there they were empty when we sat down and yet we weren’t given that table. We were definitely given one of the worst tables in the house.\nAnother couple next to us sat down same time as us different waiter and we just got our entrée and they already have their to go bag everything was expedited much faster at their table , including the bread.\nThings were forgotten. I had to go up to the host to ask for them and I think it annoyed the waiter.\nEmpty beer bottles, glasses things that were ready to take away from the table weren’t done. I had to ask.\nAnd I don’t believe that the server was attentive to the table at all. He almost seemed like he was mad at us maybe he didn’t like the hat I was wearing. But he did spend some nice time with the host at the host stand visiting with him instead of taking care of his Guests at his tables!!\nOur server never came up to see how the entrées were. Or if we needed anything.\nHe came up after the appetizers were done to see how they were.\nOf course I’ll be back it’s my neighborhood restaurant\nBut to be honest, I wasn’t thrilled with the service and by the time I left I was actually pissed off at how Rude he was.\nI’ve been eating here for over 25 years,\nNext time I’ll have one of the old timers taking care of me!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eU5UdUVBEAE",
            "text": "Place is great! Location is great! Make reservations. Drinks are delish. Food is tasty. I wish I took more photos but take my word for it! The place is a must visit! Oh! And when you visit....ask for Joe for a free glass of wine!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOWRyU3Z3RRAB",
            "text": "Went in on a Wednesday night in early October without a reservation and was seated right away. Servers were attentive and explained things. They bring you bruschetta and a bread basket complimentary first up.\nServing sizes are generous! We ordered the fried shrimp and calamari combination and it was awesome! The sweet marinara sauce was surprising good with tue calamari!\nWe ordered the Lenny’s special and the linguine with clams in White Sauce. The lobster on the Lenny’s special was a small piece of meat but was so good. We switched out the side of pasta on Lenny’s special for cooked vegetables and it was great, it also came with 2 a grimy and 2 baked clams so it’s the perfect taster of a few things.\nPerfect amount for the two of us! We ordered the red sangria pitcher as well. Total was $140 included tax and tip. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaUlDT2RREAE",
            "text": "I forgot how good Lenny's Clam Bar actually is as we visited for dinner only because we were picking up some folks from JFK during the evening rush hour at 5:30. Getting in NYC at 5:30 is easily a 1+ hour traffic jam and everyone was already hungry. Lenny's was only 15 minutes from JFK driving local streets. Best decision ever as we reunited with Dave (no need to ask for \"Joe\"-haha) who's been here forever. We ordered a dozen of the baked top neck clams, fried calamari, shrimp and scallops trio, an order of linguine in white clam sauce and a bottle of Italian red. Everything was excellent. Clams were fresh, sweet and garlicky. Fried seafood was not greasy whatsoever and the linguine was all dente. Finished with a half dozen mini cannoli and cappuccino. The cappuccinos were a little light and Dave brought us some espresso shots to tighten them up by us just pointing to the cappuccinos. Service like that in 2024 is unheard of. Dave also did not ask us for a 40% tip like some places do now in Manhattan (uh, Per Se, we're alluding to your totally outrageous behavior!). A local classic, I hope Lenny's is here forever. We have to get back here more often, so yummy! 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdmVQQl9nRRAB",
            "text": "The 50 year anniversary. The baked clams are signature at this place. There is  seating on the outside when weather is permitted.  They have their own parking lot and  there’s plenty of parking on Cross Bay Boulevard if needed.\nThey have a party room with ocean view that holds approximately 40 people.There are smaller parties rooms as well. A Full bar and you have the option to eat at the bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNODRuUk5REAE",
            "text": "I had the ribs fall off the bone melt in your mouth. wow wow wow! we also had the calamari with the The medium sauce and they also brought a regular sauce and added oregano to the top so we would know they were both delicious 😋 I've eaten in here quite a few times. everything is always on point. delicious, delicious, delicious, excellent all around Thank you for all you do for the community. we love you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdjlpbVp3EAE",
            "text": "Lenny’s food is simply delicious. It’s also affordable and one of the few places opened on the Blvd between 10 pm- 12 AM. Great cocktails and a decent wine list at decent price. The owner Joe is almost on premises to accommodate any requests. A family restaurant. I highly recommend the fried shrimp with medium sauces and the rack ribs. Most Italian dishes are well made and taste of Italian American cuisine"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEZ2FfZGZ3EAE",
            "text": "We haven’t been to Lenny’s in a few years and decided to go for dinner on a Thursday night. The food was just as good as I remembered it. The fried calamari was great. My son devoured the mozzarella sticks. My husband got the linguini alfredo with breaded chicken and I got the penne ala vodka with grilled chicken. The portions were huge, we could have definitely shared. But the food really was fantastic."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZc04zTkFnEAE",
            "text": "My friend took me to this place instead of the local Italian chain restaurants and I am so glad!!!\nThe service is great.\nAs soon as we arrived they brought bread and bruschetta. Our server introduced himself and asked for our drinks which are delicious!!!!\nI had a margarita and the stuffed shrimp with crab.\nThe food is fresh, tasty, perfectly plated and the prices are fair.\nI love the family ambiance, the cleanliness of the the place, the attentiveness and most of all how the owner/manager Bob makes sure to check on EVERYONE throughout the night!\nIf you want great authentic Italian food, excellent service and want keep it local, try this place. You won’t regret it.\nAsk for Joe for a free glass of wine 🍷!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTE4waHdkRGh4VVVsbFVEZ3haM1phTXpWdU1tYxAB",
            "text": "Came here with my brother as we took our mom for her 75th birthday. The wait staff is nice and friendly. The food is delicious, and the seafood is very fresh. The atmosphere is great and very ambient. Will definitely come back here. And a great place if you enjoy seafood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0NFpYY1ZBEAE",
            "text": "I could tell coming into this restaurant it is a community staple. The staff greeted many regulars and were very friendly. I wanted to like this place more.\n\nThe dishes were cooked well but the food lacked flavor. Perhaps that’s is to compliment the house sauces.\n\nI did not like the table placements. Some areas were really tight. As someone who was sitting on the outside it was very distracting watching out for the waiters/guest passing by or worrying if something would be dropped on me.\n\nThe icing on the cake for me was the waitress complaining about the size of her tip. She actually approached someone in our party. Very distasteful. I would not return or recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYd2V5Z2VREAE",
            "text": "I recently stayed at the Hyatt hotel at the Aqueduct racetrack near Cross Bay Blvd.  I had to try Lenny's.....it was right close by.  I was very pleasantly surprised by the clam and spaghetti dinner.  It was really delicious.  Cooked to perfection.  The bread was perfect too.  It was a memorable meal.  I highly recommend the place.  The service was great too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeGQzWlBREAE",
            "text": "If you’re looking to have an intimate Wedding dinner party, this is the place to do it! Lenny’s service is beyond Amazing — special shout-outs to Sammy & Angela! Thanks for everything!\n\nDetails:\n- I had the Juliet Room with 65 invited/58 attending comfortably\n- on 2nd Fl — not Accessibility-friendly\n** however I DID have someone with a wheelchair — family carried them upstairs.\n\n- 2 private bathrooms - 1 w/ baby changer!\n- coat hanger section\n- Room was clean & left ready for us 24hrs in advance for decor set-up\n- they do offer a kids menu!\n- Cannoli Cream Cake filling was a hit!\n- we did not have a DJ — we had a large Bluetooth speaker & mic / but it can be done!\n\n(All pics are from the night before)"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReEpyZDV3RRAB",
            "text": "One of the best Italian restaurants I’ve ever been to. The food was absolutely delicious and it came out quickly. Our waiter (tall guy with a full beard- sorry, I forgot to write down his name) was very friendly, helpful and attentive. Overall, great experience at Lenny’s. Will be back soon!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLal9ySjZFOTR2WU53EAE",
            "text": "Transport yourself back in time at Lenny’s clam bar!! To a time when front of house managers stood outside to greet guests, music played outside, and servers were attentive and changed your silverware and plates after every course! And this isn’t even a fancy restaurant, they just have great service. But you’re really coming here for the food. Some of the best steamers I’ve ever had, even early in the season! Tons of options for fried, steamed, and sauced seafood. We loved the fried scallops and shrimp. And the cannoli at the end was PERFECT!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodGV5d1NBEAE",
            "text": "I had not been to this place in about 34 years and was only there once before. We were greeted very warmly at the door and seated immediately.  The waiter gave us ample time to review the menu. I started with the NE clam chowder and my daughter ordered the fried zucchini sticks. Both came out pretty quickly. I was surprised how many sticks were on the plate and we were able to share them with no problem. After we finished that, the waiter came back to take our entree orders.  I went with the sizzling steak. My daughter had the stuffed shrimp with crabmeat. My steak was cooked to perfection. Neither one of were able to finish our meals and I took them home with me. I really liked the fact that we weren't rushed at all. Most places usually take your entire order in one shot. Quite a few times I have received my appetizer and entree at the same time and I don't like that at all. I am giving them 5 stars which I normally don't do. Everything was great from start to finish. If I am in the area again, I will definitely go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbzlUNVhBEAE",
            "text": "Excellent selection of foods. Service was great. Nice location. The sizzling steak was exquisite!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNEaks5ZhAB",
            "text": "We had a group dinner here for a friend's birthday. There are several side rooms where you can have a nice gathering. The room we had accommodated around 25 people and at a cost of around $55 per person. This included bruschetta, baked clams, caesar salad, fried calamari for appetizers, penne alla vodka pasta, and a choice of entree (chicken francese, veal parmigiana, or shrimp). Soda in pitchers was also provided. They also cut the cake for us. Service was fantastic, the staff was very accommodating, we didn't get a chance to check out the rest of the venue, the bathroom was nearby another plus. I would like to return to check out their other items and perhaps sit outside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROa2Nub2NnEAE",
            "text": "It's the 50 year anniversary of Lennys Clam Bar which makes this review very difficult to write. Many of our close friends are from Howard Beach and grew up with this restaurant as a much loved neighborhood staple and \"go to\" place for excellent Italian food. Not so much anymore... Firstly, just walking in was really strange as there were 3 younger girls behind the counter not paying much attention. Finally after some uncomfortable standing there we finally got noticed and one girl was told to seat us and scrambled to do so. We didn't expect the Taj Majal but this girl seating patrons was wearing a white and blue tye dyed hoodie sweatshirt which just seemed really unprofessional. The decor is dated and the lights were too bright. The tables were uneven, old and wobbly. The man that brought over bread 🍞 had dirty hands and fingernails which was extremely off putting. The waitress came over who was also wearing a hoodie sweatshirt...and gave us the special deal food list much after we had already looked through the menu.. The waitress was polite. We ordered baked clams and Fried Calamari and were discussing what main dish to order. I had an espresso Martini which wasn't served in a Martini glass and didn't seem to have any alcohol in it... The bread was warm but stale. The bruschetta was ok but lacked esthetic appeal. The baked clams were greasy and practically tasteless. The Calamari was ok... but was served on a small plate and was awkward to eat it without it slipping off the plate trying to get a piece... Under the small portion was the typical piece of bread to absorb the oil but we realized that took up most of the plate! The \"sweet\" marinara dipping sauce tasted too sweet and weird. We decided not to order any entrees after all because we weren't confident they would be any good. We did order dessert which I will say the Tiramisu and Italian ricotta cheesecake were good and we were told they are made on the premises. We had to request whipped cream for the dessert... The presentation of the dishes was poor... Upon every occasion we were trying to get our servers attention she was sitting up by the bar eating... Bizarre... In reading the reviews quite a few people have said similar to what we experienced. We always support local businesses and this review is not to purposely hurt this establishment but in being 100% honest hopefully, someone reads this and steps up the game there so they can stick around for another bountiful and successful 50 years!!! 🙏🍽✌️🙌"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOXJUUC1RRRAB",
            "text": "Lenny's Clam Bar delicious food Italian dishes, Clam, Steaks, Burgers Fries, Calamari. We ordered Pineapple Steak sautéed in BBQ sauce, Spare Ribs, red wine."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyd00zcFlBEAE",
            "text": "This place never disappoints. My meal was basic but none the less delicious. I've been coming here for years and will continue.\nIG: wildeatsandcampites"
        }
    ],
    "reviews_count": 68
}