{
    "name": "Dannys Szechuan Garden",
    "place_id": "ChIJAR-0zYZnwokRVRkonvEJA8A",
    "grid": "QN10",
    "address": "156-40 Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.3,
    "user_ratings_total": 649,
    "phone_number": "(718) 738-6500",
    "reviews": [
        {
            "date": "17시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU1RXWk5kMHBNZFRRMlRtNWtSMGRwVlhaQk9HYxAB",
            "text": "Food is delicious. There fried dumplings are the best I've had."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paR1kyTkJTemx0VFVSellWcHlVSGRYZEdwTlExRRAB",
            "text": "Food tasted odd.  General Tso's looked delicious, but the flavor just wasn't there.  The fried rice tasted off, but looked fantastic.  Won't be returning."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcVFrWnFja2xOY0cxdVlWTmxUUzFyVVZWamMyYxAB",
            "text": "We come here for the lunch special.All the time service is good.Food is great place is clean.Everyone's friendly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMldXbFpMV3hHZW5wbmJtcFJRMUJDYTJGWVdYYxAB",
            "text": "I come to Danny's for the lunch special all the time. The food is always good and the staff is super friendly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poelVEUmxTRU5QVFdSWGRVMHRZWHBFWlRGSlUxRRAB",
            "text": "Egg drop soup I got for my wife had a fly in it. Ordered hibachi fried rice got regular fried rice instead, which smelled and tasted like cigarettes. Quality of dannys has gone done drastically in the last couple years never going here again."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UmIzcHBSMDFFTWtwSWIzZHRUa3BFZWtSaVIyYxAB",
            "text": "I used to eat here all the time but the food hasn't been that great lately so now I only order three things an egg roll roast pork fried rice and soup and sometimes they don't get that right either but when I ask for extra duck sauce extra mustard they still give me only a few packs on top of that they forgot my noodles three different times tonight was the last straw that's why I'm doing a review it's just a headache you can't get anything that you want done the right way"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNW8ySFd3EAE",
            "text": "Very clean and spacious, and the service too was good. We went there on a holiday but our order didn't take long at all.\nThe portion sizes were very descent - and the prices too.\nI would definitely return to this restaurant 😁"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRWNXMTJNVXRUTVU0elZWaHRNbmxKWmxST2JHYxAB",
            "text": "This place is the only reliable Chinese restaurant in Howard Beach.  However the chicken fried rice and low mein has no flavor.  Chicken needs more seasonings.  It has none. Taste like the chicken was just stir fried with no sauce and seasoning.  I would like to request the chef to add more flavor to the dishes please, so we can continue coming.  Thank you .  This is constructive criticism."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6c2JTLVFREAE",
            "text": "Good food\nGood service.  Orange beef. The best"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ak1HdHROV1l6ZUVKU1kzRlVlVGhIUzNsaE9HYxAB",
            "text": "The food have no taste."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV2J6Rk9hbkJuZVUxbE9VeGtZbFpCWkdsbWRIYxAB",
            "text": "My favorite Chinese restaurant. Food is great. Service is excellent and the people are so nice. I don't eat Chinese food anywhere else but here."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMmZlSEJ3EAE",
            "text": "Terrible service waited 10 minutes just for the server to come no water hot tea or cocktail order . Only to be ask r u ready to order. Answer no I would like tea, water and to order a cocktail. The food was good , we had bbq ribs , scallion cakes , shrimp in garlic sauce  , orange chicken and beef  mei fun ."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcDRPNUJnEAE",
            "text": "Delicious comfort food. A nice local spot. They offer hibachi as well."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWVVGTlRVaTF3Y21FeE5YaE1ibFZ2TUZCdFIzYxAB",
            "text": "food was good. i loved the experience of the hibachi. the atmosphere was very cool\n10/10 experience, also really good service"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNva0x1MFJBEAE",
            "text": "Always delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeE9GOVBSelJNTVRCVFgxbDBjRzFJYVRobU1XYxAB",
            "text": "I read a review from here a few days ago about the girls in the front not getting tips.. why did you guys remove it? You respond to every comment and instead you delete the comment that tells the truth."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSU1JHNXRjMGt4WVRWWU5UWkRWRGRLTkhwUU5sRRAB",
            "text": "Great hibachi restaurant"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25saE5rWnVTWHB4YkVwWVJVaG5NVTQxTWtObGFHYxAB",
            "text": "So I ordered chicken and broccoli combo the chicken was tied together with the vein I kid you not I called the manager was rude and dismissed my call I have a picture of the disgusting chicken my receipt and a video which I cannot post the health committee will be hearing from me if nobody returns my numerous calls to mgmnt 6/25/25\nKevin PANYNJ"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVZ2NmNHFnRRAB",
            "text": "Delicious food. Friendly staff, & Danny greets all his customers the same. I have been going to Danny's for years . I would recommend this place to everyone. Just to add something you need to update your menu with the correct prices. It make a big difference for the folks I recommend.\nThank You"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVE5rOUhWVUZPVGpGeU1YTldXSEU1WkVWQmNHYxAB",
            "text": "Not good service regarding communication since there was only 2 of us they didn't want to serve us hibachi but tried to pressure my wife to eat Chinese"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNNmp1dnZQaWE3QmZnEAE",
            "text": "Five stars! The Chinese food at Danny’s was absolutely delicious. Alex and Allen were our waiters and they were both so kind and attentive, which made the experience even better.\n\nThank you, Danny’s — we really enjoyed our meal and will definitely be coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOVzc5cHZjM09UVnR3RRAB",
            "text": "A great place to sit down and have dinner with friends and family. Atmosphere was great and service was equally as great. Servers were very friendly and kind and also attentive. The food was also delicious !! Highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKN1gxNzJidUlTQ29nRRAB",
            "text": "We’ve been going to Danny’s for years, always a great dining experience. The service and the food is great every time! Our servers Alex and Jenny are always personable and very kind, they go out of their way to make sure everything is perfect. The food is always delicious! I recommend Danny’s very highly!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJX1cySmk2aC02anhRRRAB",
            "text": "Had a problem previously but was resolved,food replaced...exellent food"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcnVuUVJREAE",
            "text": "Old school  Chinese  food loved it"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdU02dU8zbWF1QnVnRRAB",
            "text": "This place is great! Service was excellent, the food came out quick. We ordered chicken brocoli, pork fried rice and general tso chicken to share. The general tso chicken was perfect sweet and the chicken was a little crispy but soft not too hard or dry at all. The chicken brocoli sauce was perfect also not too salty. Will def come back again to try more things from the menu."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQeUFuSVN3Mm9idzNBRRAB",
            "text": "Shredded beef with shredded hot peppers! Absolute best dish on the menu! Smoky beef with HOT peppers!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJamVsS1BRZ3RLR0dREAE",
            "text": "Food was great people were nice didn't have any issues except trying to get to the bathroom from time to time but that's because I got a bad knee other than that great place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNYmotNkxNOThyOHd3RRAB",
            "text": "Great Food, attentive staff, good prices"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdzZiZkpnEAE",
            "text": "Love this place, great service and my favorite hibachi dinner spot. Best tasting hibachi I’ve had and I’ve been to many locations"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOWNLUldnEAE",
            "text": "Great place to eat. The food is delicious and plentiful.  Hospitality impeccable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNklLNjRRRRAB",
            "text": "Was good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNkpDcDRBRRAB",
            "text": "First time at Danny’s and the service was great the food was delicious especially the shrimp appetizer at the hibachi table. I will definitely go back for the Chinese food. Keep up the good job."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURROFpfSEdREAE",
            "text": "This is the worst Chinese food I have ever had. The rice is disgusting. I've never had such flavorless food. I threw everything in the garbage. I'm so pissed I wasted my money on this restaurant."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX2ZfUkNBEAE",
            "text": "Seems like there's some strange organized effort to drag this place's reputation all of a sudden. They are hard working and make some of the best Chinese food in South Queens. Nothing but love for the crew at Danny's."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbVlpcHRRRRAB",
            "text": "The food and hospitality was amazing"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaEtHWnNRRRAB",
            "text": "I have been going to Danny's restaurant since 1977 when my husband and I were first dating.   Loved it than and love it now.  I remember when he had a very small restaurant in Howard Beach and was so happy that my husband and I discovered it. I hope this restaurant lasts forever just love it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN2ZXUFNREAE",
            "text": "Great restaurant. Doesn’t matter what you’re getting there."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaHBtU013EAE",
            "text": "Hibachi style chicken was lackluster. No flavor to the fried rice or chicken.. veggies were soggy and I paid extra for hibachi noodles that were soaked in oil. Usually there is a tasty teriyaki and garlic flavor to the noodles but last night was one of the worst I’ve experienced from Danny’s."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN01XZmRREAE",
            "text": "This is one of the worst restaurants we’ve been to, I seriously don’t know how they’re so highly rated. Came here for valentines dinner, the waiter barely gave us any time to order and started pointing at us for our orders. I understand it being busy but if you’re charging a mandatory 18% gratuity (actually 20% on our check) at-least be a bit more patient. When we tried to order the guy rushed us and would give vague answers on the food despite the menu having no information what so ever on the food. I tried ordering one soup and he made us order two when the menu mentioned nothing about this. I’ve never seen chowmein like theirs, its cabbage, onion, meat of your choice in gelatin. The food was nasty with undercooked onions and overcooked rice. Don’t eat here, just order from your local chinese spot, overpriced and overrated."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbi1Qdjh3RRAB",
            "text": "They just remodeled a bit more like paint and some minor cosmetic changes but it looks 100 times better than what it did. The food continues to be great and even though they made an error with my order they fixed it with no issues.\n\nI had the pineapple beef it was amazing so was the fried rice the pork bun was good not the greatest but can’t complain. Their spare prices were delicious as well.\n\nThey do however need to fix the AC too warm borderline hot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIX1plWkNnEAE",
            "text": "Danny’s has been one of my favorite Chinese Szechuan  spots for number of years really love how they do the general Tao old school preparation get a old China school vibe in this place went through today with the family. Had the pan fried noodles with beef the fried noodles with chicken and steamed buns all delicious. The food here is really good and so is the service quick hot with the old-school fried wonton noodles as an appetizer all good here. I haven’t tried the hibachi in a while, but it was good when I tried it definitely worth the trip if you’re in the area. Of Crossbay."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNlBDNE9REAE",
            "text": "Very nice Chinese bistro to stop by and have lunch at in Howard Beach.  The atmosphere is laid back and food is on point,  made to order,  to hot to eat when it arrives,  piping hot portions of your Asian favorites.  General Tsos made with plump chicken breast strips, well seasoned beef chow mein, and shrimp lo mein that is to die for. Be sure to try the pan fried dumplings as well.  There is a full bar as well meant to quench any thirst.  We like to go here on lunch breaks from work when it's nice and quiet. Very upscale yet relaxed establishment."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyak5XUldnEAE",
            "text": "Went to Danny's for lunch with my son. It's nice inside. It felt peaceful. The food and drinks were good. I love the dishes they use and their napkins. Friendly attentive staff."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNGRMMjNnRRAB",
            "text": "Excellent food, very nice staff and great dining experience. Well worth the money and everything looked very fresh prior to being cooked Definitely I will go here again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaE5DZzV3RRAB",
            "text": "I absolutely love this place. I order from here anytime I want Chinese food and I dine in whenever I want Hibachi... However, today I decided to mix it up a bit and ordered Chicken Chow Mein... I didn't get chow mein I got cabbage; meanwhile I'm expecting stir fried noodles because I mentioned noodles to them and yea - I got a bag of fried noodles on the side 😒 which is not what I wanted... They said that \"I\" ordered incorrectly that I should've asked for Lo Mein if I wanted noodles because Chow Mein for them is a cabbage dish... (google Chow Mein cuz I promise you it's not cabbage for anyone else lol) So, I had to pay for a whole new meal because I was not compensated for their mistake because they said I ordered wrong and I didn't want to take a chance and order their Lo Mein at this point... I shouldn't have paid and asked to speak to someone instead but I'm hungry and just wanted to eat, so at this point I asked for my usual go to... Moral of the story Beware that Chow Mein for them is Cabbage and NOT noodles & if you order something and they say oh no for us this means xyz, let them pay for their mistakes"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoanVIX1dBEAE",
            "text": "Hate it, bad chinesse..not cook for you..us more like mall chinese food...dont waste ur money.\nRibs were cold and hard\nThe rice noodles weee grease and burn\nThe pork lomein was vold and missing tradicional flavors\nThe peper steak was boil in cheap thick beef gravy\n\nVery dissapoiting...as I though tjeir reviewd were true...apparently buying out reviews\nI dont understand how in the world they would have 4.4 rate.."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aGRqRWR3EAE",
            "text": "We went to celebrate 2 birthdays and tried the hibachi.  We were not disappointed!  Everything was delicious!  Filet mignon, chicken, shrimp & scallops hibachi style...so good! Definitely recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbHU3MDJBRRAB",
            "text": "We went to celebrate the birthdays of some family members.  We had a great time and great service.  There was plenty of food and it tasted great.  Only two people weren't happy with their food. I ordered the same thing they had and I had no complaints.  I had the hibachi chicken and shrimp with the noodles.   I had so much fun interacting with my family I really didn't get to eat all my food.  This was what I took home and warned up. Smells just as good as when they were cooking it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtM1kzLU1BEAE",
            "text": "I don’t know what happened to this restaurant but It surely isn’t the same, I see all the good reviews and  maybe those are dine-in experiences but I placed 3 orders of Chicken and Shrimp hibachi dinners for pick up ($28.99ea.) it was by far the worse food I’ve ever had in my life, (3 spoonfuls that I forced myself to try, before I couldn’t take it anymore) I’ve had better $8 plates from the local Chinese take-out restaurant). For starters, everything was jammed into this one container, of course they make it look nice with the shrimp and chicken on top, that was s Trojan horse, underneath that was a pile of mushy and wet rice with probably all of the baby corn they had left in the kitchen that day, the taste was horrible, I like salty, but this was on another level, that’s all you would taste. We wind up tossing all this food in the trash, I called the restaurant and expressed my displeasure, no apologies, the lady said “next time you order tell them you don’t want it so salty”  I continued to explain that that wasn’t the only problem with the food, she said My card will be refunded for the order, which was a lie and probably her way of getting me off the phone, I never received a refund,  $99.00 dollars to be exact."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dEltaDBnRRAB",
            "text": "Portions are large, food is very good and prices are affordable. Just go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0eEo2YVhREAE",
            "text": "Nice Chinese Restaurant in Howard Beach, the food is taste and the environment is good and clean"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMza09IbVRnEAE",
            "text": "Always see a lot of people going in. Tonight was our first time there. The food was delicious! The fried crispy dough with the sweet dipping sauce, love it. We had the shredded beef, spicy and just perfect. Definitely going back. If you’re ever in the area, give it a try.\nOh, they also have hibachi!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQay1mRUJnEAE",
            "text": "I work in the area and this is my “go-to” place for lunch. Not only because my dish is made delicious every time, but because of how fast and efficient the team works together. Its only took them a couple of days to know me on a first name basis and memorize my order (granted I order almost everyday).\nAlongside these qualities, I do admire the aesthetic look they have inside, amongst the bar, they have a table where they give hibachi performances, good music, and beautiful workers.\nWith so much variety you can ensure they will have something for you to enjoy.\n\nThank you to everyone at Danny’s Szechuan Garden for making my experience amazing everyday.\n\n-E.J."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbzVlQnVnRRAB",
            "text": "The family has been coming to Danny's for over a decade and we are never disappointed. Great food, great laughs. Fun for everyone. The staff is amazing and super friendly. Our hibachi chef tonight Andy had us stomachs hurting from all the food and all the laughs. We'll see you all again soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSLXZpZWxBRRAB",
            "text": "Really delicious spot.  The general tso chicken and beef broccoli was fresh with great authentic flavor.  Yummy chinese food spot.  Also have tapenyaki side."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbDlTUmdBRRAB",
            "text": "We had a wonderful time there for my son's  32nd Birthday food was delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaFliTWRnEAE",
            "text": "I walked in for a late dinner with my family and immediately I was happy we did. Everyone here is super welcoming and friendly. We got seated right away and ate within minutes of the staff taking our order. The hibachi chef is very entertaining and funny. The food was fresh and tasty. No more driving to the city or Long Island for some great Hibachi when we have the best in our neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3clpEYUNREAE",
            "text": "Came here to celebrate my mother’s 65th birthday hibachi style and they treated us so well and helped out so much with everything. We were able to use their fridge to store the cake, bring balloons and they even helped cut the cake. Everybody was so helpful and we had such a great experience. The food was great too! I didn’t care for the salad too much but still a 10/10."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvX3J5TkpREAE",
            "text": "Excellent food, very nice staff and all in all a great dining experience. Well worth the money and everything looked very fresh prior to being cooked. Great filet mignon!!!"
        }
    ],
    "reviews_count": 60
}