{
    "name": "Prima Pasta & Cafe",
    "place_id": "ChIJA5Eqy4FnwokR6cfXrY00jKY",
    "grid": "QN10",
    "address": "161, 50 b Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.2,
    "user_ratings_total": 797,
    "phone_number": "(718) 659-7278",
    "reviews": [
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeTRiRkFnEAE",
            "text": "We were supposed to have my daughters HS graduation party there 6/23 and the department of health closed them down almost 2 weeks before. Management didn't have the courtesy to call and let us know. We only found out because we stopped by 3…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKZ2ZTMXZBRRAB",
            "text": "I liked this place but it has been closed down.  I hope they get it inspected and it reopens."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVd3FlSkd3EAE",
            "text": "Fantastic atmosphere, unbelievable food which Iis affordable, and super friendly staff. Extremely polite and attentive. Very relaxing atmosphere. And they make the most delicious brick oven pizza. Love it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dXZEYVZ3EAE",
            "text": "Terrific food. Terrific service. One of our favorites in Miami."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ai1IQld3EAE",
            "text": "This place never disappoints. Kitchen is accommodating to your preferences."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OTUtdllREAE",
            "text": "Party room experience was terrible. Room was not ready or clean. The appetizers are very good and the pizza but everything after that was quite terrible. No one from our party ate the 2 main courses. Watery penne vodka, chicken pieces are werid and chewy. Flavor missing, freshness not up to standard. Food sent back uneaten, no money returned or even an apology even after expressing our unhappiness. They want your money more than a returning customer.\n\nThe wait staff are overall very friendly and accommodating, except for one main waiter with the biggest attitude possible.\n\nI wouldn't recommend the party room. I am not sure if the food is better at a smaller level. People are still talking about how bad it was which was so embarrassing. The party before us expressed the sane issues too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cC0yZENnEAE",
            "text": "It’s a real shame we were loyal customers the food was horrendous burnt bread mussels that tasted like the were caught of pilings across the street What is veal Marcella and it taste like pork cutlets in jar gravy we use to go all the time last two times it was bad so we said let’s try one more time and it was worse then the two times before"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4N3AtaFR3EAE",
            "text": "Flat sodas, an hr to make appetizers which then came out undercooked, 20 mins to bring our drinks, clueless waiters..Got up and walked out.. Terrible experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dHRfR2JREAE",
            "text": "Terrible service, food was cold, not sufficient food. Would not recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aXNIeFdnEAE",
            "text": "This place was and Is usually better than today. Ordered appetizer and waited over one hour just for that."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4a29UZmFnEAE",
            "text": "I went here for a dinner. I haven’t been here in years! This place is absolutely horrible! The service was terrible and so was the food! The eggplant was not cooked and the hot anti-pasta salad looked it everything was frozen! The soda was flat. I just can’t believe how bad it was.  What a shame. This place was soo good and I was looking forward to going back. I will never go back there!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeGYtZnJnRRAB",
            "text": "I was recommended this place by someone who used to come here often.we had lunch here. She said the food isn't the same. The quality has gone down. Bread taste old and we were told the credit card machine didn't work after getting the bill.  The quality of the food is bad. I do not recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOGNxRFF3EAE",
            "text": "Spaghetti chopped up."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSOExESzZ3RRAB",
            "text": "The service is always good. Some antipasti could have been better quality but overall good"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURSMEw1TBAB",
            "text": "Cuando comas ahí, el mesero de 17 años le pagan 20 dólares el dia"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSaTRHSE53EAE",
            "text": "The good memories of this place and food is all that remains. It's been several years since i came here but i use to love the food at this place so me and a friend decided to go there for dinner. The restaurant looks like its stuck in the 90's and desperately needs a refreshing. We got there for 6 o'clock for dinner and the place was only 1/3 full, it took a few minutes for the waiter to get to us but we finely placed our orders and waited for the appetizer. It took more then 20 minutes for them to bring us the fried calamari and by the time it came out it was burned and tasted like a pile of rubber bands. The main meal took another 30 minutes after that to come out and the chicken francese that i ordered was so thin that you could see threw it making it tough and rubbery. The side dish of linguini carbonara ( that they charged me an extra $3 ) was a mixture of linguine and spaghetti that looked like they scrapped it off someones left over plate and had absolutely no heavy cream and the most grey looking pieces of bacon you could ever find. when i questioned the waiter as to why there was spaghetti mixed in with the linguini he just shrugged his shoulders and walked away. Between the extremely slow service, the horrible food and the dirty outdated atmosphere i will never come here again. The next time our in the mood for Italian cuisine and are thinking of coming to this place do yourself a favor and open up a can of Chef Boyardee and you'll have a much better meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSay0zZW5BRRAB",
            "text": "Sold me spoiled tiramisu."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSN2RXQUh3EAE",
            "text": "La mejor comida italiana de NY, recomendada"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBMS1iYmd3RRAB",
            "text": "Friendliness and great food"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVX29tMWVBEAE",
            "text": "Went there 3 years ago it was nice gave it 4 **** wow went on\nThursday evening around 730 with my two granddaughters it was not at good I order chicken cutlet Parmesan in a few minutes the order can and Omy look like they just put slots of spaghetti sauce on top no and went Ian eat am looking for the meat and it was a very small chicken cutlet took maybe 6 bits and that it a lot of spaghetti and sauce u it cover the hold plate but barely any meat come on Prima pasta done with u what happen"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodV9lYjFBRRAB",
            "text": "What an incredible place to be.Friday nights are the best. Live music and an amazing food. I’m a big fan of their Veal Parmesan. Highly recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodnQzVzRRRRAB",
            "text": "We had a family get together to celebrate my mother. Everyone loved the food, and the staff helped us with preparing special crumb cake to honor my mother."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocnJ6T1VREAE",
            "text": "Awesome place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoak9xQk9REAE",
            "text": "Food was not as good as it used to be celebrating 2 birthdays waiter didn’t remember what desserts were ordered after I told him 3-3 times about birthday then put the cake down stuck the candle in lit it and walked away didn’t even try to sing or anything also on after bill was paid on receipt said had to tip in cash also had lobster ravioli which were heart shaped it was 2 weeks after Valentine’s Day"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobTVpZFF3EAE",
            "text": "The things I have to say are so bad I just won't say them and give them a 1 star instead."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobmVhTE9BEAE",
            "text": "Friendly employees"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodnBpcTh3RRAB",
            "text": "Good food and service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZ2IyUkFREAE",
            "text": "Very lively on Friday nights, nice live music"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcXZQUi13RRAB",
            "text": "Marginal service and food. Came for lunch with wife and was left waiting for a waiter. The bread was burnt and  food was marginal. Not worth the price. Better in the past. Will not be returning anytime soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCLTl2T2JBEAE",
            "text": "I really enjoyed this day. Apparently one of the former people who work here invented the pizza dance which is both hilarious and amazing. The ingredients in the taste of everything that I had was fantastic. My only complaint was my chicken parmesan sandwich didn't really have a lot of chicken parm on there. It was very thin and with the amount of bread there was it just didn't seem like a balanced sandwich.. there is numerous bites where I took a bite and I couldn't actually tell if there was even Chicken in there and it made me sad.\n\nThe customer service was amazing, the product quality and taste was fantastic, and I would definitely come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCcS16UUlREAE",
            "text": "The main course was armature at best . Not worth the $$. Service was horrible.  Overall I'd rather eat home."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCOHZXZFNREAE",
            "text": "Only good thing is the pizza"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCME9PczVRRRAB",
            "text": "Pomodora sauce is AMAZING."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbFozaXZnRRAB",
            "text": "Isn't my 1 choice for an Italian restaurant in Crosbay blvd.,"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtem8tMUlnEAE",
            "text": "The pasta, the gravy, the garlic and oil vegetables, omg, a must stop in Howard Beach!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbktXZ0l3EAE",
            "text": "Some of the garlic nobs were raw and there's was something spicy in my pasta"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNWFPb3BBRRAB",
            "text": "The owner was very friendly.\nHe gave 3 mini cannoli on the house"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtcHYzU1lREAE",
            "text": "Very nice place, they have a animator who sign very good. Only food take some time for be served."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteE9mdHFRRRAB",
            "text": "Went after a funeral. Appetizers were good. Meals were terrible. Cheap sausage, Fish was cold, had plenty of bones and one really skimpy piece. They sat us in a dirty back room which looked like a store room with boxes and junk. Don't recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldjllaHNnRRAB",
            "text": "Food was ok, nothing special about the sauce or pizza… It’s pricy, the menu prices online are not the same( $3.50 for a tiny cannoli) . They were nice and friendly."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5enVmWVV3EAE",
            "text": "Great clean place with good food. I went here on a Saturday night and it was kinda busy but there were tables available to sit at. The waiters are good with taking your orders and giving you your food but if you ask for separate checks they…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyc2VfRWFnEAE",
            "text": "Many years ago I went here for a party in a private room. Today I went for lunch with my son. They bring you water without you having to ask. You get a complimentary basket of garlic knots and sauced bread. The soft drinks have refills. The food tastes really good and it fills you up."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNzdyVjBBRRAB",
            "text": "3rd visit and I do like this restaurant. A little short staffed lately.  The food is great, lots of options. I had the Mixto Fritto and the seafood was cooked perfect. Would recommend this restaurant just please invest in more staffing."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzb3RENHFRRRAB",
            "text": "Haven’t been here in many many years and it didn’t disappoint ! Food was just as amazing as I remember and outstanding service. The portions were abundant. I truly recommend. And that back party room...ideal for gatherings."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUN1cjRvcxAB",
            "text": "Went here 2 days in a row for dinner because it is close by in the neighborhood. We sat outside and order a pitcher of sangria to beat the heat. Our waiter was friendly. The appetizers we got (stuffed mushrooms and rice balls) were stuffed with stove top stuffing which was disappointing and bland. The mixto frito is okay but that’s it. I had the lobster ravioli which was delicious except for all the dried tomatoes that were added. Overall, this would be a really nice spot for dinner if the chef reinvents the menu and use real ingredients instead of substitutes like stuffing. I think they have loyal customers (an older crowd) that goes for the community togetherness. I am unsure if I would recommend because I believe that someone should try before cancelling out this place, maybe you can have a five star experience who knows."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwNnVMbk13EAE",
            "text": "An absolutely wonderful Italian owned pasta restaurant with excellent and professional service. They bring a basket of bread and a full pitcher of water when you first sit down. The bread is warm and fresh. I ordered the rigotonni pasta…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2MjdmZGJBEAE",
            "text": "Delicious from the starter bread that tastes like pizza to the authentic mozzarella. The service was fantastic and the staff super friendly. I appreciated that they asked to see your vaccine card upon arrival. This experience couldn't be better"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXc0xDWVlREAE",
            "text": "Where to begin… when I made the order they could not tell me the price of the food… it sounded like they were gonna make it up (red flag 1).  I ordered anyway I generally like this location.  Order was made at 5:10.  I waited until 6:53 to call to request an update on my order.  They stated the driver got “lost” no biggie I thought (although at this point I was starving).  They stated they sent another driver out with the food.  (Why would they not update the customer on the error?) Not going to complain, I just want the food.   Plus there is no way they sent the same food that was lost probably 20 minutes ago to me 40 minutes later right? Wrong! Food got here after 7 (almost 2 hours later), it was FROZEN, soup wasn’t warm the bread that is in the stay hot bag was cold, and the FOOD WAS BURNT!  Has anyone ever eaten COLD BURNT FOOD!? Cannot believe the level of service i received.  I spoke to my family about it and they too have had their deliveries  take over an hour and a half to come in (I had experienced this before as well).  I would not recommend this location for deliveries to ANYONE, PLEASE STEER CLEAR AND DO NO MAKE THE SAME MISTAKE! THERE ARE BETTER DELIVERY LOCATIONS OR GO THERE TO EAT.  I WILL NEVER, EVER EVER EVER order from Prima Pasta ever again and will deter anyone that asks me to EVER order from there again as well (for delivery).  Let me go have cold cereal instead now…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNU4ycXZBRRAB",
            "text": "Fresh ingredients,  nice and stretchy mozzarella.   Nice environment for relaxing dinner.  The best was the free bread starter."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dDltRXJnRRAB",
            "text": "My wife and I are very tough restaurant customers. Why? Because we both can cook. We ordered two meals that we both are expert at, Lasagna and Chicken Marsala. For anti pasti we ordered chicken wings and zucchini frittata. First came the bread with pleasant surprises (including garlic knots). Awesome bread --the basket was empty in no time. I ordered a Cappuccino and it's one of the best. So the meal finally came and we truly enjoyed our meals. It has been a while for us to really enjoy the food we ordered. The sauces were authentic, home made with hints of Sicilian style. We were too full for dessert so we ordered a Napoleon to take home. Prices were very reasonable and service was friendly. It is definitely a simple family style (with its shortcomings) and not fancy serving, but truly enjoyable. A friendly touch of someone greeting us and bidding farewell up front wishing a Happy Mother's Day, made the experience truly enjoyable. Thanks Prima Pasta --arrivederci, we'll be back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MTZ5WHJRRRAB",
            "text": "Food is vary delicious and appealing size. See waiter Memo for excellent service!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtXzREZEV3EAE",
            "text": "I normally would just say the pasta I order isn’t always consistent, but unfortunately my order yesterday consisted of a roach stuck to the garlic knot. I will not be ordering from here again."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNaWFtRzF3RRAB",
            "text": "This is my second time coming and I gotta say, it was even better than the first time. I love this place and I highly recommend it to anybody looking for some italian cuisine at affordable prices. The atmosphere is great, the staff is super attentive and the prices, even better. Do yourself a favor and visit this place."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDOXZTdHBRRRAB",
            "text": "some of the best pasta around. The staff is friendly and the service and food are impeccable. Had the best Friday night."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDMXJuYlJREAE",
            "text": "Delicious Buscayola Pasta Sauce, you are probably going to want to know what's in this Pasta Sauce, Mushrooms, Sweet Peas, Chop Meat, Tomatoes, and a touch of Cream Delicious!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBM3RfMllnEAE",
            "text": "Excellent food and very cheap prices nice atmosphere"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2ejdXdFdnEAE",
            "text": "Service is on par with a high school cafeteria. The good is good but nothing to scream home about. There are better options next door."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJNDQ2WTV3RRAB",
            "text": "Place has very good Italian food and at a decent price.  The bread baskets are awesome and are very generous.  The parking can get chaotic if they are busy.  They also have valet parking for a fee.  Seating is a little cozy but you won't be on top of other people.  Overall a great place for a meal or a special occasion."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLXzczU0xnEAE",
            "text": "Great food and a great show but very slow service"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdGVhU2ZnEAE",
            "text": "Lively fun atmosphere! Great music, fabulous singers. Nice variety. Clear and descriptive menu. Lots of great choices. Attentive staff. Good food. Clean. Been going for thirty five years and it's better than ever!"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMHA3cUV3EAE",
            "text": "I've been coming here for many years and this place has been consistently good. The portions are quite generous and the food takes a bit to arrive because it's made fresh! The wait staff have been nothing but accommodating and pleasant to…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhd3BMeGR3EAE",
            "text": "I was meeting friends there, & was greeted by Prima Pasta’s elegant owner. The food was as excellent as the service!! My fish was covered with spinach, each complimenting each other but delicious on their own. I also asked for angel hair pasta on the side and mama mia!! Perfect in its roasted garlic & olive oil!! Did I mention the service? Accommodating to each of us, friendly and professional! I can’t wait to go back again!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLN2NYeWNnEAE",
            "text": "Decor and ambiance was very nice. Service was good.\nHowever the food 《veal and Chicken)tasted like it was cooked 3 days ago,and not fresh.The sauce was over seasoned.\nThe food was not  pleasant, portions were dried out meat & miniscule.\nLast by not least the parking lot had so many giant holes in it, it could ruin the axle of your car,  never mind someone falling or getting a twisted ankle."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndVBmN0tREAE",
            "text": "Our family has been coming here for years.  We like that they treat you like family.  Food is good and portions are generous.  Try not to fill up on the complimentary basket of garlic knots and pizza bread!  Weekends can get busy, but they do take reservations."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dE16eU53EAE",
            "text": "I've only ordered take out at this joint twice and both times I was sadly disappointed. Their entrees were not up to par with the price and their pizza had a crust that was harder than the box it was delivered in (see the video). Perhaps the sit down experience is better because the place was packed every time I picked up my orders."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMjlyVlRnEAE",
            "text": "Absolutely terrible customer service. Called in for a pick up of food on a Saturday afternoon. Was told 45 Minutes for pickup. Arrived 50 minutes after the phone call. At first when I arrived, they had no idea what order I was even talking about. Then when I noticed the order slip right there on the counter I said something and they went in the back and disappeared.\n\nWaited an hour and a half for my order to be ready. After coming all the way from Brooklyn to pickup from this establishment, this is disgusting. First you forget to even put my order into the kitchen, and then you lie to me and tell me the order is ready 5 minutes and keep me waiting another 35 minutes.\n\nThey took payment before the food was even ready, and when I demanded a discount or refund I was ignored. Never coming out of my way for this place again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNveWRYNkd3EAE",
            "text": "We had a private even here and the price was good.  The salad was OK, the pasta was on the tough side and not really flavorful and the meal was good.  Pizzas was also really good.  I would run back anytime soon, but I'd give them another shot maybe sometime down the line"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZdzk2Q0tnEAE",
            "text": "Traditional American Italian fare in a warm and welcoming environment. Prices are very reasonable and the portions are very good.  The complimentary breads are fresh, hot and delicious.  The only poor grade would be lack of restrooms and…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbm8zeGlRRRAB",
            "text": "Howard Beach has such a plethora of good Italian restaurants it's hard to make a selection and find the unique attributes of any one.  We were at Prima pasta for my grandson's birthday party and they did a great job.  The staff had the table set up when we arrived and they made sure that everyone was seated, had drinks, and we're in a festive mood.  Well the food is not exceptional it is good and the portions are a decent size.  The only thing I wasn't very pleased with was the appetizers, some of which were fried a little too long. In addition I believe they use the same fryers for fish and cheese sticks and vegetables so they all had a certain sameness of flavor that was not appealing (to me and some of the other guests).  Overall the meal was well prepared and the attentive wait staff made up for any shortcomings by the appetizers.\nMost important, the birthday boy had a fantastic time!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLbzliQnNBRRAB",
            "text": "Excellent local restaurant, there was enough seafood for 3 in one plate. Felt like Italy."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxd2JXUEVREAE",
            "text": "We hadn't been there since before COVID-19. So glad they survived. We used to go more often when we lived in Queens. Rarely get there since we have been in Nassau nearly 20 years but we go whenever we can.\nPortions were a bit smaller than in the past but all the restaurants are doing the same. Food still good. Highly recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeGRLd1lREAE",
            "text": "The experience started OK, our order was taken. 15 minutes later a couple of garlic knots and bread with pizza sauce on it comes out. 20 minutes my sons pizza comes out. 1 hour later the rest of us still have no food. When our food finally arrived, mine was burned. It was replaced.\n\nI'm pretty sure this is not normal for this place, and to be fair it was busy.\n\nHopefully on my next visit the experience will be different."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxX295X0VBEAE",
            "text": "On Sunday we arrived for a party of 4, service was very slow. It took 30 minutes just to get some dry bread, additional 20 minutes for plain water. We placed an order and waited over an hour the food never arrived. This place lacks professionalism and communication if the food is taking longer to wait. The tables around us even got concerned after they got their food and finished their meal.\n\nWe decided that it was better option to go to Popeyes next door where the services was faster and the food was better than dry bread.\n\nI do not recommend this place , don’t waste your time."
        }
    ],
    "reviews_count": 73
}