{
    "name": "Vetro Restaurant & Lounge",
    "place_id": "ChIJDUv9tYZnwokRrU6L3xqMmSA",
    "grid": "QN10",
    "address": "164-49 Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.6,
    "user_ratings_total": 1705,
    "phone_number": "(718) 843-8387",
    "reviews": [
        {
            "date": "수정일: 17시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbnVucUhBEAE",
            "text": "2025 Event Space Review:\nVetro provided EXCELLENT customer service from the moment I submitted my inquiry for my event to the actual date.\n\nOur sales manager name was Meena and she was very professional and friendly through the entire planning process. She provided us with a walk through to give us 3 options of space for our event date and estimated party of 40. We loved the decor of the Wine Cellar and loved how she would set up the room for our event.\n\nThe day of the event Meena provided updates via phone after setup until our guests were seated. I had to enter after the guests were seated because I was bring the guest of honor for his surprise entrance. I felt comfortable that the Vetro staff was reliable enough to handle everything without my presence.\n\nThe manager \"PJ\" was very welcoming and helped us to get our slideshow on the TVs in the Wine Cellar. I love the fact that they already have a laptop in the room synced to the TV and all you need is to provide the pictures or slideshow.\n\nAll guests were impressed by the table setting and personalized menu with food options that included vegetarian options. Everything was timed well with our head waiter who handled everything with ease and worked hard to accommodate all requests from the guest.\n\nEveryone enjoyed the food and loved the cake that comes with your package. Due to dietary restrictions I got the Tuxedo cake which was simple and delicious.\n\nMy cousin was so impressed she is considering Vetro for her dad's 80th birthday in the next few months. I will definitely refer her to Meena who she is already impressed with her planning skills. Thanks for a wonderful event and I will definitely be back to the restaurant for brunch or dinner soon.\n\n2020 Restaurant Review:\nI have eaten at 5 star Michelin star restaurants from US to London to Dubai but honestly my experience at Vetro restaurant topped them all. From the moment you walk into the venue the hostess was attentive and seated us quickly. Our waiter Gennaro greeted us and gave us 5 star excellent service for our entire dining experience.\n\nWe tried 3 different cocktails: TRUE MOSCOW MULE, HUCKLEBERRY LEMONADE, RASPBERITA. All of them were strong and delicious, I will definitely have them again. Entrees: SALMONE AI FERRI, SHRIMP RIPIENI, SKIRT STEAK. All three were seasoned and cooked to perfection, compliments to the chef. Desserts:TARTUFO CARAMELO was like heaven in your mouth, it is the BEST Tartufo I ever had. This is a MUST Have dessert. We also tried the FLAMBÉ CRÈME BRÛLÉE and STRAWBERRY SORBETTO which were also good choices. The owner of Russo's came in the restaurant and checked if each table was enjoying the experience which was a pleasure to see.\n\nI can't thank the manager Tele for checking on our table throughout the night and ensuring we had an excellent dining experience with your personal touch. Thank you for an extraordinary experience!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VE9VdzJiWGxrZDJkWk9IcEpVSGRLY1doSlVXYxAB",
            "text": "One of the finest dining experiences around."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Q09GZFBjMjFaVFhSS1lXMXNVMUJTVlRCNmQwRRAB",
            "text": "Amazing experience and food as always. Special shoutout to our waiter Mario, he is one of the kindest souls and made our dining experience so much better !! Highly recommend coming to Vetro for any special event or even if you just want an amazing meal."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaGNWWk1aSGszTVhGcmRFRmxiVFV5YjA4eWFIYxAB",
            "text": "Was there recently for a friend's birthday party,  great food, atmosphere,  cocktail hour, dinner & dessert. Including a beautiful very tasty birthday cake! Premium pkg...top shelf drinks as well. Service very good.  Valet easy once you pull in. Highly recommend"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV1FUUXdhRVJWWlhadFZYaHJVRGQxYzNkb1pFRRAB",
            "text": "Excellent service, food was impeccable, and we loved the atmosphere as well!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veFpsUkdlVjl0WDFNMk9UZ3hlazVpYzB4SFlYYxAB",
            "text": "went there for my friend 70 birthday party. No complaints"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQ2FEazVZbmh6YkVwaE0xbzBObVp5T0VoamNuYxAB",
            "text": "The service was super atmosphere was lovely food excellent 👍 highly recommend it 😀😌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paM2QwTjZOVU5PU0c5TFVIVlNVV2RxYlVobVRHYxAB",
            "text": "Great place to have an event.  Valet parking is available."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMU9URkRZVzFrTUhoTU5VcEhPRkJaY0dsQ1FsRRAB",
            "text": "On Saturday night I took my boyfriend here for his birthday. I have to admit that from start to finish our experience was a 10!  The ambiance and hospitality were superb. The food delicious!  Teal, the host, was very accommodating and even found comfortable sitting after dinner on the rooftop so we could get some dancing as they had a DJ. Thank you for making our celebration extra special  Also special thanks to the waitress and barmaid.\n\nLydia and Juan"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMVMzQmxUbTVvTm5GeVpUSjBUUzFYU0ZkU1RrRRAB",
            "text": "The food was fabulous, Mario gave great service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUlVIVlZZbFJwUm5FMFNHSkdSR0pKVW1KMVZtYxAB",
            "text": "Just an all around good time .\nAmazing food great Waiter Mario who had a great sense of humor ! Cappuccino and dessert also just delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWmRuSnViSEpPVWxaalFWRmlTalE1VEdweE4yYxAB",
            "text": "I used to frequent Vetro regularly 10+ years ago and loved it.  Moved to Staten Island and haven't more than one of 2 occasions to come back.  Decided to have a birthday celebration there tonight and I thought \"I,m sure I'll enjoy the venue but I was really happy with the food and great service.  Just like I remembered.   Great job staff and ownership."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWU1IUmtNMWc1YW1wVGJIcGZjRVV4V0hGNmNWRRAB",
            "text": "Everything was just fabulous a hidden gem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SR1ZGY3lTV3QxTkZWWk5EbEJZa1ZLUkVOdWMxRRAB",
            "text": "Excellent in every aspect.\n\n❤️ it!!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaFlXbDNRMlpTYkRCTldWaGhVMUk0ZUdobldFRRAB",
            "text": "Food is not good  salted expensive, cocktails no good\nI have been in the travel industry for a long time\nWe deserved better,"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sak9Wa3lVMHRNT0Y5bmR6TTBTa2MyUTJGVVMyYxAB",
            "text": "We celebrated a friend’s birthday with a brunch.\nThe service staff were very professional and friendly. The weather was great so it was a perfect day to be outside. The food was excellent! The prices were reasonable for a party of 8.\nHighly Recommended the Brunch!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkb1lYTlpVR1JLWVVaTVpFOWpXbXh3TlZrelIwRRAB",
            "text": "Great place for brunch. We came in from California for a concert and decided to walk the strip and stumbled upon Vetros for an amazing brunch and live music. Was divine timing as we leave today and this was a highlight on our trip. Food was great and service is friendly. One man piano band made our Sunday perfect. Thank you for the memories.\n\nMario was our waiter and was superb!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbFRGa3hPRVZtVlc1TFJHTkpaWE51TWxKTlNFRRAB",
            "text": "I can’t say enough about Vetro. I was surprised and engaged at the restaurant in May and the staff executed exactly what my finace wanted to perfection. I did my engagement party at the wine cellar this past weekend and from the valet to the set up to dinner the service was IMPECCABLE. Everyone was impressed. Frank Russo lll (I think-I apologize if I am wrong ) is a star there are NO words for his care and kindness and attention. The Bartender Dana (I hope I spelled it right) -well I’ve been to many places but she rocked and I need her for my wedding. All my guest couldn’t stop talking the service. I know my wedding will be a dream."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdFEydzFNVWxzYkVaT1RXMUNWRFJIVkRWR1kwRRAB",
            "text": "Everything I tasted was good"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMFlsTnJkWFpXTFZCSGJIcHJXR0pEVEZocVRFRRAB",
            "text": "La vista es hermosa, el personal es súper amable y siempre muy pendiente. Yo no hablo inglés y amablemente me enviaron personas que hablan español para ayudarme. Me sentí muy feliz y cómodo. ¡Muy recomendado!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25saVFVTnJVRTVHTVhaR1lXaHlSbmQxTUV3MWJYYxAB",
            "text": "Went during resturant week.  Ordered carbonnera but the cream was missing.  Salad extremely salty.  Really wanted to like this place as I had not been there in a few years.   Beautiful venue.  Would try again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MVZVNURZV0p6VFZRelRWWTVOa1pwWTI1MWEzYxAB",
            "text": "This place might just be one of the most immaculate restaurants that I’ve ever dined at, truly. It was almost my girlfriend’s birthday and they treated us with such warmth and kindness - it really stood out to me; Olessa personally, she’s the only hostess you’d want on a special evening. The food was other-worldly and the servers were outstanding with us. If we’re fortunate enough, we’d love to come back 🙏🏻."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUmJUVnFhMkkwZVVkVVpHMVVVbE56WWpaUk1FRRAB",
            "text": "This restaurant is truly one of my favorites! The staff, food and atmosphere is top tier!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNk1VSnFSVmwxY0ZSRmVqQk1OVjlPVVY4elgyYxAB",
            "text": "Had a group dining experience and worked with Group Dining Consultant,, Meena Sukhdeo to plan event.  Meena was attentive and professional and worked with me to accommodate various requests\nDuring the event all the staff from our lead waiter, Ricardo, on down were professional and courteous, helping make the event a pleasant one.\nThank you."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNFVHSnRZVkZEZDNvelRqZG9WbmRRUzNoTWExRRAB",
            "text": "This is a nice place to enjoy the music,  they have great DJs, yummy drinks"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQM3ZuYldJd0o2NE1nEAE",
            "text": "The senior manager/managing partner in the grey suit was not welcoming. No hospitality from a senior manager who should be promoting this beautiful restaurant. The manager/owner approached a set of 4 guests who he clearly knows and had a 10 minute conversation with them while we sat at the next table with a birthday card on the table and this manager never came over to show us who are new patrons any hospitality. As a licensed clinician advocating for seniors and disabled people it’s important to show compassion and respect.  And we choose this very beautiful reputable Venue to\nCelebrate my birthday dinner only to be treated cold & as second class maybe because we are brown people by the manager/owner.  But the wait staff who are minorities were very pleasant and continually checked on us and the food is very appealing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMlNXbFhha2t4WVhJemFrUlphVEJxYzBsa1RWRRAB",
            "text": "I have to say… this is one of the places I’ve absolutely LOVED the most! 🩷 The service was incredible — everyone was so kind and welcoming! 🌟 They have a promo (not sure if it’s every day 🫣), but for $39.99 you get an appetizer, a main course, and a dessert! 🍽️💖\n\nOn Wednesdays, bottles under $250 are 50% off 🍷🎉 and I found out that on Sundays they have brunch with a DJ — how cute is that?! 🎶✨\n\nI’m 100% coming back because I had such a great time 💕 Everything was amazing and the people were sooo sweet to me 🥹🫶 I honestly thought it would be more expensive, but I ended up spending less than expected 🙌💸\n\nEverything gets a 10/10 from me!! 💯💗 The food was beyond delicious 😍🔥"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRd1YwWkhlWFJ6ZGtFM1JtUjVjSGhTY1U5TGVIYxAB",
            "text": "I attended a Retirement party last night.  The food and venue are great but what takes it over the top is the service.   They are young,  motivated, enthusiastic and very personable.   I'd like to specifically give our server Jalisha the…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbFgzRjFUMVJVT0VWNU1USTBjbFJyU0RWM1VuYxAB",
            "text": "Super nice place. Love the workers"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaU4wOVlSVGQyUVVvd2N6aDFjMHRrZHpCbFdtYxAB",
            "text": "Everything was fresh and made to order."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWGFESlhhRmR3WldaU1lqTnBlRkZsV21kVE9GRRAB",
            "text": "Very poor experience. I'm on my honeymoon. We fly out from JFK tomorrow and wanted to kick things off well. We saw this place had good ratings. They served bread with olive oil but no salt, pepper, or parm. Not sure why anyone would dip bread in plain olive oil. We waited an hour for our entree, which was a $60 t bone. We ordered medium rare. It was well done. Incredibly, the manager came out to tell us it was \"a hair over medium rare.\" Needless to say, lying to customers' faces is neither appropriate nor a good business strategy. In case the manager is reading this, we do, indeed, have eyes. Lying about the steak after we saw it is silly. ANYWAY, We left without asking for a replacement because the steak did not look good regardless of the temp. The servers seemed to be working very hard but service was ungodly slow, making me think they don't staff properly. Three drinks, a salad, and an app was $73. We were shocked this place has 4.6 stars. Should be 3 stars at best."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPREdrS1R1enRiajB3RRAB",
            "text": "incredible & unparalleled service from the moment we walked in until we got into our uber. staff made us feel very special & celebrated! our waiter Mario was especially accommodating and knowledgeable. we will be back soon!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJb0pLNjV3RRAB",
            "text": "I was hired to shoot a birthday dinner here  . The ambiance was beautiful  and the food was so delish. I loved the servers. They paid attention to detail and made sure to keep the drinks full and the food moving."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cU9mVzJnRRAB",
            "text": "11/21/24: Had a holiday dinner with the office and the restaurant wasn't busy at all. Granted it was a Thursday night but I was still a bit taken back. We were a party of 11, they sat us in a somewhat separate space, which was nice. The service and drinks were on point as usual. This is a great spot to bring people who have never visited.\n\nCozy and surprisingly casual place. Pork Chop Milanese and Fish dish off the specials menu, Shrimp Santino, salad with grapefruit, Skirt Steak and a dessert assortment pictured. Charcuterie and Cheese Tasting not pictured but was delicious."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OFAtZG5BRRAB",
            "text": "First time here for a party on the rooftop. Decided to get a table after seeing the reviews.  Alexa greeted us and was so accommodating. Even after I requested a different table she was amazing. But the food is truly the star. Clams Oreganata were superb and a perfect way to start. We followed with the Seafood Risotto which was perfectly cooked and full of tender seafood. We finished with the Pork chop and peppers and I have never had a pork chop so tender and favorable.  The party was fun and the music on point but the best part of the evening was the food and of course Alexa."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbU0zb2lnRRAB",
            "text": "I recently hosted my wedding here, which I planned in less than two months, and the team at Vetro helped make this process so much less stressful. Truly was the perfect choice! Anna, my social planner, was amazing from start to finish—great communication, expertise, and endless patience with my many questions. The team was incredibly accommodating, helping to customize everything to my vision from from the menu to even decorations.\n\nPhil, my day-of coordinator, was a huge help in bringing everything to life and ensuring the day ran smoothly. The venue looked even more beautiful than I imagined thanks to their setup team, and the service was impeccable—never an empty glass or dirty plate. The food was delicious—so many of my guests complimented the meals! Yes plural... there was different variety of food on the hour perfect for someone looking to get a little bit of everything from savory dinner, to hot/cold apps, dessert and late night bites.\n\nWe also had Roger as our in-house DJ, who did a fantastic job reading the crowd and keeping the energy high the entire night. I honestly can’t recommend this venue enough, the entire experience was flawless. Anna, Phil and the rest of staff helped make my day not only perfect for me and my husband but also for our guests, who all had an unforgettable time. If I had to do it all over again, I’d choose this place without hesitation. They made our dream wedding come true!\n\nAlso thank you to Olessea for being sweet and helping me find some missing decorations that were misplaced by my guests after the event ended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NTdiTTN3RRAB",
            "text": "What a great experience at Vetro. The staff is amazing. They are so polite and respectful. Special thanks to Teal at the front desk for finding a table for my wife and I so we could celebrate our wedding anniversary!! The place is spotless clean. Food was tasteful and yummy. We're definitely going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkM08taVhBEAE",
            "text": "I'm definitely going back to this little slice of heaven. Maybe it was because it was the day before Valentines Day, but the atmosphere was serene, beautiful, and intimate. It's just a 25-minute ride from Brooklyn, and you've reached delicious food and an ambiance that is designed to create connection an intimacy. Loved it here!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYenRpaVNnEAE",
            "text": "What a fantastic place to eat for a special occasion.  The service, atmosphere and food were excellent.  Highly suggest this if you would like something special."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURud2M2X1F3EAE",
            "text": "⭐️⭐️⭐️⭐️⭐️\n\nI’ve been coming to Russo’s on the Bay for decades, and Vetro is no exception to their impeccable service and outstanding staff. My Aunt Diane has brought me here for many family milestones, and the experience is always incredible. The food is award-winning, and the attention to detail is unmatched. We’ve celebrated my aunt’s 50th birthday, my daughter’s Sweet 16, and are even considering Russo’s for my grandma’s 80th next year. A special shoutout to Mario, our wonderful waiter, who was kind, attentive, and sharp, as well as Iris, our matron, who ensured everything was perfect. Truly a 5-star experience every time!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzclphZTBBRRAB",
            "text": "Went here for my 2 year anniversary. Although it’s a bit upscale, I didn’t feel uncomfortable or out of place.\nService was amazing. People at the neighboring table were very friendly.  Even the water was amazing! But what really blew me away was the pan fried skirt steak. OHMYGOD! When I tell you I was at a loss for words. I definitely want to come back every anniversary."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d2ZQaTZBRRAB",
            "text": "Our waiter was Mario, he gave us excellent recommendations, we celebrated a special night here, he made our evening an incredible experience! The food was delicious, I recommend the salmon and the ravioli! Our favorite desserts: creme brulee and apple pie ❤️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbTk3eUp3EAE",
            "text": "Vetro’s is a great place to spend time with family and friends. The service is fabulous and the attention to details is much appreciated. The drinks could be better but other than that it’s always a wonderful time.\nThank you for everything."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcEpHd3V3RRAB",
            "text": "We visited Vetro Restaurant & Lounge for our Wedding Anniversary and it was a beautiful dining experience.  Staff was very professional, friendly and knowledgeable.\nWe ordered the Shrimps stuffed with Crab meat and Short Ribs and Shrimps, NY Cheesecake and Flourless Truffle Chocolate Cake  (which was like a slice of heaven) and Coffee.\nWe received an Anniversary Card and Mr Russo came over to our table to  greet us. The Staff surprised us by singing Happy Anniversary to us. Our desert and coffee were compliments of Mr. Russo, so sweet.\nIt's a beautiful place and definitely will be coming back again and again.\nBeautiful view of the Bay. Highly recommend it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMDU3Q3NBRRAB",
            "text": "We had a family dinner here and it was an amazing experience. Impeccable service, nice setup and delicious food. The appetizers were really good as well. Love everything about this place and it’s a perfect spot for dates and gatherings. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScTRuYXF3RRAB",
            "text": "We recently visited Vetro for dinner.\nMy wife had the Orichette and i had the Skirt Steak .Both dishes were delicious. The atmosphere is very nice .The waiter Giovanni was very attentive visiting many times to check on our meal experience.\nHighly recommend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldmN1ZVNnEAE",
            "text": "Amazing place I made a reservation for my son birthday with a view I was told all tables was book out. Then I received a call stating that I can have the enclosed porch which I was happy to have with the view of the water.\nUpon arrival I was told their was a party going on so the table was not available. I would of prefer a call before my arrival.\nWhich I could of made  other plans.\nwe were seated by one of the staff from the front desk,  but felt rush by Mario R To start our orders.\nBut the dinner was delicious the waiters who brought our food did and excellent job also the drinks they did an outstanding job. The manager came out greeted each table. Wow that was  awesome ,  I have never see such greeting at any restaurant. I\nhighly recommend the Vetro to  anyone looking for a place to dine with food with flavor and tasty Vetro is the place to be further solidifying their five star review I wish I can give more stars."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDaUpmdFhnEAE",
            "text": "I can not express how amazing our dinner was. I went for my step mothers birthday and it was soo soo good! I called to book a reservation literally half an hour prior, and the lady on the phone catered to my needs and was so sweet. It was so last minute and I was beyond happy to hear she was able to seat us. Our server Gennaro was extremely helpful and so sweet, he helped us with making our decisions and our order and made us feel so comfortable. The other guy named Giovanni I believed was also sweet and thoroughly explained the difference in all the waters (flat, tap and sparking) to one of our party members. Overall, wonderful experience to celebrate an event such as a birthday or even a date night. It’s more on the expensive side, but the food and service make it very worth it! The server recommended the specials so we got the scallops (AMAZING and cooked so well, amazing sauce also and served with spinach) and the bisteca (a big steak that is a shareable size and around $55.) I prefer thinner steak, such as skirt steak, but if you’re into thicker meat this is the perfect cut. My party members enjoyed it, also make note that it was recommended to be cooked no more than medium. I will be returning and very excited to show this place to other family and friends. Also, the drinks are very strong haha, my mom was tipsy off two margaritas so that’s a plus. Thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCb3BXUWhBRRAB",
            "text": "Came to have a friends dinner for the holidays and we stumbled upon the Santa dinner that came with a prixe fix menu for 35$. After having had their food at Russo's for my wedding, I knew they wouldn't disappoint. Everyone loved their meals. And the cheesecake was light and sweet enough."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXBhWV9RRRAB",
            "text": "I recently attended a bridal shower at Vetro Restaurant & Lounge, and I can’t say enough good things about the experience. From the moment we walked in, everything was absolutely immaculate. The staff was incredibly attentive, professional, and welcoming — you could tell they take great pride in what they do.\n\nThe food? Outstanding. Every dish was flavorful, beautifully presented, and served at just the right pace. You could feel the quality in every bite.\n\nAnd let’s talk about the scenery — absolutely stunning. Whether you’re inside enjoying the elegant ambiance or taking in the waterfront views, Vetro provides the perfect backdrop for any special occasion.\n\nThe service was truly top-notch from beginning to end. If you’re looking for a venue that combines incredible food, breathtaking atmosphere, and five-star service, look no further. Highly recommend!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4eThEVmhRRRAB",
            "text": "Consistently good food, service and overall, environment. We have had events in all rooms for all occasions.\n\nYesterday we went out for dinner on the patio and I wanted to write this review specifically for those who are hesitant about going out during this pandemic. Sitting on the patio made us feel like things were normal even though we know they aren’t. The staff wore masks throughout the entire evening. Shout out to our waiter, Gennaro for being so attentive and welcoming. The scenery is gorgeous and welcoming. The food was delicious, as always. I suggest making a reservation since this is the only location on crossbay Blvd that is actually secluded and not facing the Blvd traffic. It was packed for a Tuesday evening, so I am glad that we did that. We felt like we weren’t in our neighborhood, almost overseas which was nice.\n\nWe ordered the lemon shrimp, fried calamari and the truffle macaroni and cheese. For dinner I had the shrimp ripieni and my husband had the shell steak. We can’t wait to go back, thank for you a lovely evening."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMC1iZjd3RRAB",
            "text": "We had my parent's 50th anniversary here a few weeks back.  It was absolutely amazing.  The staff, the food and service were second to none. We will surely be back and every one of our guests raved about the entire experience!  I highly…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscllPSGdRRRAB",
            "text": "Very classy. Nice ambiance. There was a wait from earlier parties still there. We had a reservation. Frank was very accommodating with getting us seating and drinks on the house, especially since we came all the way from Bayshore, NY. 1st time there.  1st time eating out for Thanksgiving."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOUx1NlFBEAE",
            "text": "We celebrated my daughter's bridal shower in the Murano room and couldn't have been more pleased. The room itself provides an ambiance of elegance and class. The view of the water was a beautiful surprise to many of our guests.  It was another perfect backdrop for pictures. The weather was beautiful and many of our party goers took advantage of being able to go outside to take in more of the view.\nThe staff is professional,  attentive and their experience shines through the whole planning and party experience. Priscilla went beyond when I asked her to  help with the elaborate scheme to surprise my daughter. Phil was so helpful with suggestions and taking care of every detail. He answered every phone call and had answers for every question. Christine ran the party smoothly and made sure every aspect was taken care of. She even made sure me and my daughter had a dish set aside for us to eat. The service was wonderful as well.\nThe food is plentiful and delicious. No one leaves hungry. So many choices!  And the cake was gorgeous!\nI am so happy that I chose Vetro's for my daughter's Bridal Shower and so is she. Everyone hasn't stopped raving at what a perfect party that it was!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxak9iNC1RRRAB",
            "text": "Had an amazing experience last night, staff is super kind and friendly. Food and drinks were absolutely delicious! Highly recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbEpDZVJREAE",
            "text": "Quite a nice hidden gem for locals and those afar!\nOutdoor dining experience was superb and the staff exceeded expectations. The quality of the food was very good and diverse options were offered. There is a vast drinks and wine selection for those who are interested. Indoor dining was a more intimate setting yet formal.\nOverall, this is a nice upscale dining experience with awesome water views if you choose to do outdoor dining. Will be visiting again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX2R6d1hBEAE",
            "text": "Stopped by today for lunch for the first time. The space is absolutely beautiful and the staff could not be more attentive and professional. We had the fortune of being attended to by Mario. He was nothing short of an absolute pleasure and made accommodating my particularly picky tastes seem like his mission. I cannot say more how fantastic the staff and ambiance were and the food was delicious! I definitely will come again and highly recommend this spot for a great meal"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMTlxSWZ3EAE",
            "text": "Came here with my mom and loved it so much. Service was great, they were very attentive. The appetizers was so VERY good. Everything felt very fresh and perfect for my taste. For the main, i like the steak a lot. The waiter was so nice they…"
        }
    ],
    "reviews_count": 58
}