{
    "name": "Souvlaki Spot",
    "place_id": "ChIJcSm_IUhnwokRYW4EpgXemME",
    "grid": "QN10",
    "address": "156-40 Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.3,
    "user_ratings_total": 137,
    "phone_number": "(718) 322-3021",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOa1lqQXRZblF6Y1Zkb2JrMW5ZVnAwWHpGRGMwRRAB",
            "text": "Terrible service and long waits, I was also told I could not dine in to eat, even with available seating, didnt even ask if i wanted to dine in"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsamFFOUJkRGhaVFVWbVEzUkJPVXBGTFhoR1YwRRAB",
            "text": "Some items could be pricey but really good food overall"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eU9ESklRM0pDZWprMGFrUXdUbUZ2VmpOVk9YYxAB",
            "text": "I was visiting from Scranton, PA and decided to stop by Soulvaki Spot on Crossbay Blvd and wow, it was one of the best meals I’ve ever had. The food was absolutely delicious, fresh, and full of authentic flavor. You can tell everything is made with care. The portions were generous! the staff was warm and welcoming, and the atmosphere was nice .\nThis place is truly a gem ! whether you’re local or just passing through, it’s worth the stop. I’ll definitely be coming back whenever I’m in New York!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseldsQjFTemhwZDNKeVRUVlRYMDVmTFRGcFZXYxAB",
            "text": "Love this spot !! Food is always on point, delicious!! Service is phenomenal, cleanliness is a priority, and portions are more than generous. A+ all around !! Definitely highly recommend! You won't be disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbU1IZEhaWFZJY0RkSlpEVjJRMGxmV0ZCNlNuYxAB",
            "text": "Soup was awesome"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvM1ptSjRNVlZwTm01dVYyTkpiekoyUXpCRE1IYxAB",
            "text": "Love this new place to me. The ambient was great.The platter that I had was amazing fresh and so tasty. The place is so clean , I love it. I think all the food will be amazing here. The platter I had was excellent and very fresh"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MGRHOXhWbmxsVlRKQ01HdHJUVzVGVURWNmEwRRAB",
            "text": "The hummus is tasteless and the Gyro it’s so dry and the customer service it very rude I don’t recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paR1owaHpaVWt5WW5sR2IycFplSEEzVWpJeUxWRRAB",
            "text": "Everything is fresh and delicious! Staff is wonderful , so kind."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVmIxUTBRVWsyTFdwU1RsVnpZVWRuVGsxSFMwRRAB",
            "text": "Impressively clean, absolutely delicious, reasonably priced, extremely friendly service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMmJDMDNXbFp6Ym14bGNISkJkWEZzZGswNVJYYxAB",
            "text": "Craving satisfied!\nCame to the beach today with a serious craving for a lamb gyro and stumbled upon Souvlaki Spot — and wow, 10/10! As soon as I looked at the menu, I knew exactly what I wanted. I ordered the beef and lamb gyro with tzatziki and lemon potatoes, plus a side of falafel bites. Everything was incredibly fresh, full of flavor, and absolutely delicious. Highly recommend if you’re in the area!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUlVITlNXVmQ2VDB0dlR6QTFkWGx3WjJGTWJXYxAB",
            "text": "The food tastes pretty good but the prices are too high for amount of food you’re given. My recommendation is if you’re going to charge as much as you do give more generous portions to the people! I guarantee if you guys do this business will increase!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKelNUVnVUR3BhTVU5NVMzUlRhRWRDU1c0M1FXYxAB",
            "text": "Great food, great service. Highly recommend."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMX0xwNU81MEtUbU13EAE",
            "text": "The order was ready on time. The food was great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sYVNIVmpkVXBaYTNGdmFHZE9UMnBvVFcxWFduYxAB",
            "text": "I placed a large order for an important client meeting and everything about the process was WONDERFUL! John answered all of my questions and was able to arrange food for a person with unique requirements. They touched base on the morning of the event and followed up afterwards to be sure that we were happy. Even the delivery was top flight and arrived on time at our hard-to-find location when expected. I recommend this place to anyone who needs great food for a lot of people at a fair price. Will order again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VObWQySUtMaHRHTHRBRRAB",
            "text": "Easily a 5 star experience\n\nThe food has never once been stale or not cooked to the utmost perfection. Take out or dine in.\n\nCustomer satisfaction and service is by far laps ahead of any Greek restaurant I been to in years and I have been to over 15 restaurants in NY  NJ & Connecticut\n\nThe owner and management is handling the business to a T\n\nBest Greek food by FAR\n\nDine in is definitely a 5 star experience\nAnd waiters are waiting for you to look up and they are there in an instant!\nI Can’t exaggerate enough on the service, it is truly what all restaurants should strive for.\n\nKeep up the great service and the amazing food.\n\nLove this spot and so does my entire family."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYk92dVcyei1qMnJ3RRAB",
            "text": "Clean and cozy place with good food and reasonable price. Not far from JFK, free parking across the street."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOejRqNG1BcVBxc2V3EAE",
            "text": "Picked up a delicious meal & we loved it- fresh, flavorful and plentiful!  We loved the packaging!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKZkszc3UybE9hUGx3RRAB",
            "text": "Ight, so Yo this is Souvlaki Spot in Howard Beach Queens\nI wasn’t expecting anything crazy, I just wanted something good, something quick… and man, this spot surprised me in the best way. Possible\n\nWe walked in and were greeted right away. The staff was mad cool, made us feel welcome—none of that awkward, rush-you-out energy. Just chill.\n\nI got the Beef Souvlaki Platter—and yo, the beef was soft, juicy, perfectly seasoned. And really tender like that butter\n\nMy wife got the Beef Souvlaki Pita, and listen—she’s from Astoria. She grew up around real Greek food. She took one bite and hit me with that look like, “Yeah… this is it\n\nThe rice was good, the tzatziki sauce slapped, and the portions were right. Not OD, but not stingy either.\n\nI didn’t come in expecting a fine dining experience, but it honestly felt like one. Respect to them.\n\nWould I bring family? Already told my cousin.\n\nHoward Beach got one with this spot. Real talk.\n\nWould I come back again absolutely 5 out of 5 stars !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLN2lxcC1SejZUZHpRRRAB",
            "text": "Good Greek place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPLUU2cHllcF92dHJ3RRAB",
            "text": "A side of lemon potatoes is almost $10 and they give you 4 tiny potatoes The gyro is very dry and if you ask for extra tzaziki its a charge"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURva1ppUGVBEAE",
            "text": "Great Greek food and good prices and great portions. My new favorite Greek spot. Better than gyro world imo."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOGJtYnNRRRAB",
            "text": "Food was great and alot for the cost!!  Customer service was excellent! They even wished me a happy Easter!  I appreciated that!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvam9mZkRnEAE",
            "text": "Came here for lunch, the food was amazing! The atmosphere is nice and calm. Good music, polite server. You can tell the owner cares a lot, he's attentive."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMWJUUVpnEAE",
            "text": "This was my first order at this restaurant and  I must say the food is excellent. I couldn’t eat it fast enough. It was so delicious!! The delivery was also very prompt and it was packaged nicely.  I will definitely be ordering again from this place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeWRMTURnEAE",
            "text": "Pick upped an order today chicken kebab, Greek salad side of taziki and a gyro and we thought the food was great! So happy to have a great Greek restaurant to stop at on my way home from work! The chicken was very well seasoned and taziki and pita were delicious! Gyro was also very yummy!! I highly recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJenZ1cDNBRRAB",
            "text": "Absolutely fantastic experience from start to finish. The service was warm, attentive, and genuinely welcoming. The food? Incredible—authentic, flavorful, and clearly made with care. Every dish we tried was spot on, from the appetizers to the main courses. The atmosphere made it even better very inviting. Highly recommend this place if you're craving great Greek food and top-notch hospitality."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dG8zU3R3RRAB",
            "text": "This place is a gem within the Howard Beach food scene! The pork souvlaki is so juicy and filling. The staff are always incredibly welcoming. I would go here every night if I could!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3by1iZTFBRRAB",
            "text": "22$ for a bowl with 5 pieces of meat. Unreal."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMmJ6am9BRRAB",
            "text": "Excellent quality food...immaculately clean...the waiters Jhonnie and Estefania are helpful and friendly... You can tell the owner cares about quality and about your experience at the restaurant. I eat there often and always enjoy the food and my experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdnV2OUp3EAE",
            "text": "I rarely write negative reviews, particularly for local restaurants, but unfortunately, I feel compelled to share my recent experiences. This isn't an isolated incident, and I know others have had similar issues with the service.\n\nMy primary concern revolves around the phone service. The individual who answers is consistently defensive and argumentative, which only exacerbates customer issues rather than resolving them.\n\nMost recently, I placed an order for two Lamb and Beef Gyros through Grubhub. What I received were two containers of plain meat, without any pita bread or toppings. Upon calling to clarify, referencing my receipt, I was told I hadn't ordered pita. When I pointed out that a \"gyro\" is universally understood to be a sandwich, she insisted I received exactly what I ordered. I requested a return or exchange for the actual gyro sandwich, but this was denied.\n\nI offer two suggestions to the restaurant:\n\nPrioritize Customer Service: Given the restaurant's consistently low customer volume, it would think you would want to ensure every customer has a positive experience.\n\nAccurate Menu Descriptions: If the \"Gyro\" item doesn't include pita bread, it should be clearly labeled as \"Meat Only\" or removed from the menu entirely to avoid further confusion and miscommunication.\""
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnX2NIV3BRRRAB",
            "text": "Food was excellent and services is very good"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNm9ES3pRRRAB",
            "text": "Like a piece of Greece as soon as you walk in! The staff is really nice and food never disappoints. TikTok @excuseurosee for food review on here"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNnZpZlZREAE",
            "text": "The entire experience was wonderful. The place is very clean. The staff was very attentive and extremely friendly. The food was excellent!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdi1TZHJnRRAB",
            "text": "Modern space big portions love this spot!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBaW9hWkdBEAE",
            "text": "Recently ordered takeout from here, which usually wouldn’t justify a review on my end, but I had to take time out to give this restaurant its deserved praise. It speaks to a restaurants quality to justify a review even through a delivery service.\n\nI’ll admit, the online menu was a little confusing (though I don’t know if that’s simply a result of the delivery service we used, so I’m not going to factor that into my review), but what made this restaurant stand out was the service and attention to detail. I was pleasantly surprised when the staff on the phone went out of their way to be more than helpful in making sure our order was correct.\n\nSpeaking of, the food was delicious, there isn’t much else to say on that end. It was good, really good. They didn’t skimp out on the meat, I got two lamb and beef gyros which were both wonderfully seasoned, wonderfully full and well balanced. It may be the bare minimum to some, but it means a lot that the modifications on our order were honored first try.\n\nI will definitely be going to this restaurant soon in person, delicious food and wonderful staff."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBay1LTXd3RRAB",
            "text": "Best gyros close to Rockaway! Grew up in Astoria and love my Greek food. This place is pretty darn legit."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdGFlR0xBEAE",
            "text": "Great! friendly staff, fresh food;  lovely atmosphere &seating"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBb091cEdnEAE",
            "text": "finally some greek food in howard beach and it’s delicious !!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdTd1X1V3EAE",
            "text": "The server was very attentive and made sure we had everything we needed. The food is a 10 out of 10! Absolutely delicious! I highly recommend eating at The Souvlaki Spot if you haven’t yet."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbHZXR2t3RRAB",
            "text": "One of the best chicken gyros I’ve ever had!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubjhmQ2FBEAE",
            "text": "I was lucky enough to be in New York and visited the souvlaki spot at Howard Beach. Honestly, their tastes were like in Greece. The staff smiling pleasant and very helpful. The prices are very satisfactory. I strongly recommend you to try the chicken gyro as well as the mozzarella stick and the spinach pie. Our group of 6 people were completely satisfied."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyM0xuZDRRRRAB",
            "text": "recently dined at a Greek gem that left a lasting impression with its authentic flavors and impeccable service. From the moment I walked in, the staff’s warm and welcoming demeanor set the tone for a memorable experience.\n\nThe ambiance was charming, with a mix of modern decor and traditional Greek touches that transported me straight to the Mediterranean. The menu offered a variety of classic dishes, and everything we tried was fresh, flavorful, and beautifully presented. The moussaka was rich and hearty, the grilled lamb perfectly seasoned, and the tzatziki was the best I’ve ever had—creamy, tangy, and deliciously garlicky.\n\nWhat truly stood out, however, was the service. The staff was attentive without being intrusive, ensuring our glasses were never empty and that every need was met with a smile. Our server took the time to explain the dishes and even shared stories about their origins, adding a personal touch to the meal.\n\nOverall, Souvlaki spot is a must-visit for anyone craving authentic Greek cuisine paired with outstanding hospitality. I’ll definitely be returning soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeXBiN1lREAE",
            "text": "As someone who grew up with Greeks in the same house, I lived on homemade food made by Thia's hands. This previously used to be Greek Grill (if anyone in the neighborhood remembers) and it had been closed for a long time. Now Souvlaki Spot opened and it's a win as Greek restaurants are far and few in the surrounding area. They opened up the space and gave it a makeover that's now bright and vibrant.\n\nWe dined on their 3rd day of opening. We were greeted by the friendly servers and our order was taken. Unfortunately by 3pm the lamb chops were already sold out. I'm assuming they didn't account for how much business they'd be getting. We waited about 20mins and got our food. As other reviews have mentioned, we consider ourselves lucky because other tables were waiting close to 40mins. Take out line was getting frustrated. 1 table got up and left. I feel the kitchen forgot their order. At the end of our meal, the register didn't have enough bills for change so we were given tons of coins. Speed from the kitchen is definitely lacking, and everyone should know how to operate the registers. I wanted to give them benefit of doubt as they just opened.\n\nWhat we did try though was exceptional. We got lamb gyro, pork gyro, & pork souvlaki. The tzatziki was thick, rich and delicious and reminded me of home cooking. A lot of Greek restaurants serve a watery tzatziki so I appreciated that theirs was better. I would like to see tyropita & calamari on the menu.\n\nOverall I will try them again when they get themselves a little more organized."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNk5UVGJ3EAE",
            "text": "I have been back a number of times (at least 6+) and my wife absolutely loves the sandwiches.  Great change of pace from what was available around here prior.  First week service was slow (they actually make the food as opposed to it sitting around) and the fries were not great.  They have speeded up the process a bit though (I still recommend you call in the order) and the fries are much better now than prior.  Although it’s a bit expensive the food quality and amount you receive is worth the cost of admission!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMGM3RF9nRRAB",
            "text": "Dine in or take out options available. Staff was courteous and friendly. Went in for lunch, had the pita sandwich (chicken Soulvalki and beef Soulvalki) highly recommend very tasty (only issue was too much sauce so recommend light sauce or on the side) also had 1 beef stick great taste. It is worth the try but prices are a bit high."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbGZmb29BRRAB",
            "text": "Went in for the first time with family and the food was AMAZING! Service was fast and friendly. We will be coming back again. To all the comments saying they are slow and service is bad, they just didn’t give them grace in their first few days open. Give them a try and I promise you won’t regret it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNTZuLWhnRRAB",
            "text": "Went in to order take out. The process is very… odd. After you order, they print out a receipt to tell you the cash price and the credit card price which is very rare to see. Then you have to tell them verbally if you want to leave a tip…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdnVLMTh3RRAB",
            "text": "Been here 3 times since they opened (dined in once and take out twice). Each experience was better than the next. The food is on point. Friendly and attentive staff. Had chicken souvlaki sticks and a horiatiki salad w/bifteki tonight. Super solid. So happy to have Greek food close to home again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycUlYbVVnEAE",
            "text": "The food at souvlaki spot was unbelievable! Totally fresh, delicious, well cooked, and generous size portions would highly recommend it! What a great addition to the area!  It’s a winner 🏆"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMS11R3F3RRAB",
            "text": "By far the best Greek food in NY City! I had the pleasure of dining in at this spectacular restaurant. The food was fresh and super delicious. It reminded me of Greece. I highly recommend this amazing restaurant. We had a night that was second to none. Keep up the greatness!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOUlyYzJBRRAB",
            "text": "Ate there about 2 weeks after they opened. The service was very friendly, it took a little bit for the food but the food was fresh and delicious. As far as people talking about takeout taking too long, I have called my orders in and they always tell me like 15 minutes. And when I get there and park outside and walk in it's always ready waiting for me. I like this place better than the Mediterranean Grill that was there before."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURya2ZxYmN3EAE",
            "text": "Ordered to go because I was on a tight schedule.  Waited for a while for my food.  I finally got home only to find the rice spoiled, and it was slimy and stinky.  I called to speak to the manager, and the person who answered the phone insisted on what the call was about. I'm calling to speak to a manager! I told her the rice I was served is spoiled. She proceeds to get someone on the phone. I'm not sure at this point if it's the manager or an employee. I spoke to him and told him the rice I just ordered is spoiled. He said \"okay thanks for letting me know.\" Click.\nNo apologies. Well, that was my first time and last time there. I'll drive myself to Bay Ridge next time."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmanFhd1FBEAE",
            "text": "I’ve had take-out 3 times so far. I’ve tried the bifteki; chicken; and beef platters. Each are consistently fresh, flavorful, and satisfying. The portions are large enough where I am left with left overs for the next day; this makes the price well worth it. I am so grateful to have Greek food in this neighborhood.\n\nIn regard to the atmosphere, everyone is very friendly, and the decor is very cute. Very clean. It’s cozy during the day, but the lighting is a little too bright for a nighttime setting.\nA kind hearted suggestion: For the evening hours, maybe dim the lights a little? and then maybe add faux or real candles on the tables to create a more intimate/ cozy atmosphere for dinner?\n\nWishing this restaurant much success! Thank you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3N3JUVGxnRRAB",
            "text": "Do you want to feel at home? This is an excellent place, the service is excellent and the food is very delicious. My favorite dish is lamb chops, very very good and they have delicious desserts I loved the galakto boureko😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ19mazB3RRAB",
            "text": "I love coming here it is by far my favorite place to dine in when in the area. The atmosphere is amazing and so welcoming. The food is 10/10, everything is hand made and fresh. This is the closest you’ll get to the food in greece. The staff is so friendly and will continue to come here!!!! I recommend John he is the the sweetest and friendliest waiter i have met. He makes you feel so welcomed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cnFqWGFREAE",
            "text": "Really great food. We went in with my family a bit skeptical at first but will be returning. We got a platter for 4; meat was cooked well, not raw nor dry. Salad was fresh, and falafel was crispy on the outside and tender on the inside. I really enjoyed my meal, and the staff was friendly. I had a good experience there."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfLVBtQll3EAE",
            "text": "My family and I love coming here! The food is always so fresh and flavorful. The staff is welcoming and the restaurant itself is beautiful and always so clean (including the bathrooms). Def one of our favorite Greek spots!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNDdYemt3RRAB",
            "text": "Very clean, nice atmosphere. Our server was very sweet & accommodating. The food was excellent. We had spinach pie, Greek salad, chicken soup, a beef sandwich on pita. & galaktoboureko for dessert. It was all very good. Highly recommend eating here. ."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOXZDemVBEAE",
            "text": "El lugar es muy bonito limpio entiendo a penas abrieron tengo mucha expectativa y deseo probar más del menú recomiendo las papas al limón con algunos de sus sticks como el Bifteki sus ensaladas y postres están deliciosos tuve que esperar por mi\nComida pero valió la pena."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOGZhQTdBRRAB",
            "text": "You feel\nLike in Grece. The food is sooo tasty and they have even greek sodas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNFB6cGZREAE",
            "text": "I hit this brand new spot today for lunch and truly I am impressed! This neighborhood definitely needed something other than another Italian place and the Souvlaki Spot did not disappoint. I ordered the chicken gyro for lunch and an order of spanakopita to take away and have later on. Both were authentic and flavorsome. The service was on point and the dining room, freshly decorated, was definitely giving Greek summer. All in all it was a thoroughly enjoyable meal and I will come here again."
        }
    ],
    "reviews_count": 61
}