{
    "name": "Frenasia",
    "place_id": "ChIJhU6ZQIFnwokRlv9xznRrlO8",
    "grid": "QN10",
    "address": "163-35 Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.3,
    "user_ratings_total": 881,
    "phone_number": "(718) 322-7690",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNlYxUmxUbHBFWVdoRFNFaGtjbVJIVHpJMlpWRRAB",
            "text": "Luv it here. Great service food etc. and reasonable prices"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUVpISjVlVXN4VldoR1YwMVJWbVV0ZGxZM0xWRRAB",
            "text": "They were very rude! If you are an African American do not come here. We couldn’t even enjoy our food because eyes were being stared at us the whole entire time which made us feel very uncomfortable. They were not very welcoming only to the people of they’re kind. Do not come here if you are a black person."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NVUxRktWV2xIWkd0b1JXcHplbXhQTVZVMGNWRRAB",
            "text": "Service, food and atmosphere is great! The food is amazing! We love ordering several appetizers and whatever the selection is,  it does not disappoint. The seafood is always fresh."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5clJEQkZOSE56WjI1VmFqUXROR2RVYUhkRFIzYxAB",
            "text": "Love this local spot. Sushi is always very fresh and service is lovely. Shoutout Nicole- she makes the best lychee martinis!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOSHUwcHIyaWZYTjZRRRAB",
            "text": "I like the food but one of the delivery guys is the worst delivery person I've ever met. Extremely rude, speeds up the block where kids play and then honks the horn like a madman when he comes to my house. Now he screamed at my wife when she didn't give him enough tip because she thought she had more cash. It was an accident and we always tip at least $5 and only live a 1/2 mile away. I've complained about him multiple times but management seems to not care. Plenty of other sushi restaurants in Howard Beach and the surrounding areas. I'll be avoiding this place from now on."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNjkzaWl3RRAB",
            "text": "Love it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saVNWazJORWhNUkhWRWRreDFVR1p3WTFWdFJYYxAB",
            "text": "The best sushi evvvverrrr!!!! We keep coming back. Everytime, we are in taste-bud heaven."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMlYxOW9ZelJFYm1rMGEzZGFSbkpOWlhNNVVHYxAB",
            "text": "Sushi Very good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todE1rMTNZMnhCYlVwcGMySlBSMWQzYVZKWlpXYxAB",
            "text": "Nice restaurant!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNVlubFBiRzVpVG14WllqWnJja05mU0ZGeGFWRRAB",
            "text": "The service is very good and the food is delicious. I will come again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMlFrdzNjWGgwVEdoeU5UaFZhMmQ0YjBSUGRWRRAB",
            "text": "No good service the all over the place serving"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VemJIWnRObnBCTjNWSU1ERTFVVFJ3VVc1cFoyYxAB",
            "text": "Amazing experience! Sushi was fresh and so good! King Kong and Dragon special rolls a must! So much more to eat there, extensive menu! Outside seating with an amazing view."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbGF1UmVBEAE",
            "text": "Overall, good experience I would definitely return and recommend for dining around that area."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vd2QxQmFTRTkzVWtoWVdFZGFhRkZqV2swek1FRRAB",
            "text": "Years are living around and just now try. Highly surprised for the food, good flavor, amount, and price."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNS15TnNRRRAB",
            "text": "The dishes come to your table like Art"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRlZYRktVRjh6UVhFdE1uaHVXbkJGUTBSMk1HYxAB",
            "text": "Hadn't been to this place in a while and was excited to go.  Unfortunately the visit wasn't that great.  There was four of us, and one of the meals was served cold and my dish didn't come for at least 10 minutes after everyone else hot there meal.  Then I didn't even get the vegetables that it was supposed to come with, but they brought me the extra ones that I paid an upcharge for.  Appetizers were good.  Maybe caught them on a bad night, but they really need to step up their game.   Hopefully next time I can give a better review."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VVRVVXhiVnBZYzFSVGVqSXhZM1ZhZERRelNWRRAB",
            "text": "Pretty disappointed with the fact that we paid $23 for a normal \"special\" roll from this place. Extremely overpriced for just a fancy shrimp tempura roll disguised as a \"special\" roll."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CalpuSXRUR3RSZGtsa0xYaDNjMmRuZDNKWFpIYxAB",
            "text": "A great place to go. The food and the service were excellent. I recommend the basil steak. The sushi was also very good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGc1RrdFNkM2xpVlhCZlUwVkZTMDlUWTBFNFFsRRAB",
            "text": "I am very upset … I love the food . On the other hand , the delivery man left a bad taste in my mouth. He came into my place of work very rude and loud . I am very disappointed . I will never place an order for delivery ever again ."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc1pqcHR3RRAB",
            "text": "My favorite sushi place in NYC!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dHFqNFJnEAE",
            "text": "Great service!! Food was great! Love this plate! I was with my friends and we had a great time! I would definitely go back again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cDd6VW9nRRAB",
            "text": "love this place!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNnNfckd3EAE",
            "text": "Food was really good and the price was not bad at least for what I ordered, Service was also good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNnB5SWJBEAE",
            "text": "Hibachi was splendid"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNk1lNHRnRRAB",
            "text": "Great food. Amazing sushi and impeccable service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneU42Q1RnEAE",
            "text": "Eat late so not crowded. Food is delicious and lots of choices. Prize is not bad!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnbE5fVjRBRRAB",
            "text": "My favorite.  Always a good time ."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNmUzYUlBEAE",
            "text": "Loved the food and service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cnBYdUJBEAE",
            "text": "Sushi here is definitely a must BUT…. I ordered the garlic prawns today (12/10/24). Highway robbery!!!! $31 and only 4 prawns! Highly disappointed and it was burnt! The sauce was sweet and you can taste the burnt in it! More like someone put their cigarette out in it"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMmZYMWNBEAE",
            "text": "Celebrate  early birthday  lunch  for my daughter. Each food was presented  very nice and tasted delicious."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQb1picWZnEAE",
            "text": "Food was greasy, taste wasn't there and place was cold. They sell hibachi food but without hibachi tables or chef.. it makes no sense.  You better order Chinese food from your local restaurant. My wife and I had bad stomach feelings after a few hours ."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQX3BuV0ZREAE",
            "text": "Lunch is very affordable\nPresentation is beautiful\nAnd food is very good and they serve a good amount"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzLWV5dnJBRRAB",
            "text": "My husband loved this place, I was never crazy about it. Here’s the perfect example WHY:… ordered take out. Received my order. Began eating the hibachi rice, and to my surprise? A DEAD ROACH. When I called to complain, staff was completely…"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvcDRxakNnEAE",
            "text": "Delicious 😋 everything 🤤"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBMk9Ea3R3RRAB",
            "text": "Excellent food... drinks have improved and are Tastyyyyy..the lava cake is the size of a spoon."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdC0tRGdnRRAB",
            "text": "This place gave me food poisoning! I was sick for 4 whole days with severe stomach cramps and constant diarrhea from eating the sushi they serve at this restaurant. It’s such a Shame because this place use to be my regular spot for sushi, now with the new people they have working there I have no clue if they are even following proper health code guidelines! I would never recommend their sushi nor will I eat there sushi again. Be mindful of how raw food is prepared, or any type of fish they serve there. SUCH A SHAME!\n\nResponding to “the owners” comment, should I show you my hospital bracelet? I wish I did take pics of the slimy salmon and sushi.\nTake some responsibility, I knew what I ate and I knew what I put in my body that day and your food was the only thing I ate. How dare you. Impossible? Nothings impossible, well Looks like you’ve got your first. Unbelievable. Seems like the kitchen staff isn’t the only unprofessional people working there. Believe me, If I had more evidence, I would’ve pursued legal action, But don’t worry you’ll never see my face in that disgusting place again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NmI3ZFJREAE",
            "text": "A local spot, they offer a small section for hibachi in the front. The food is decent, nothing out of this world. Drinks aren't strong at all, stick to a beer vs mixed drink for a buzz. Pictured: Fish of the Day and Curry Chicken."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3emVuWUlREAE",
            "text": "This place was simply fantastic. We were going to somewhere else, but because of parking limitations we search for something and came up with here and it was an excellent substitute. The menu was overwhelming. We wanted to order more and we decided to limit. We ended up taking food home because the portions were very big. Now we must go back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXblBQaC1nRRAB",
            "text": "Food and presentation...... Amazing. Haven't had anything I didn't like. Extremely fresh tasting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNDh6R2RREAE",
            "text": "Best sushi ever !!! 😍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaEltRTV3RRAB",
            "text": "The customer service was absolutely extraordinary, leaving me feeling valued and well taken care of, althought the wait at times is a bit long. The Ribeye Steam was an absolute delight, with its tender and flavorful meat that left me craving for more. The hibachi chicken was outstanding. The drink selection was extensive and offered a wide range of options to satisfy any preference. Don't miss out on the Oreo Cheesecake and Warm Chocolate Cake - they were pure indulgence! The only slight drawback was the price, which could be on the higher side. Nevertheless, I personally recommend Frenasia."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOU5HZWJREAE",
            "text": "Can't get over the taste of the bland food. The waitresses were very kind and attentive, almost to make up for the fact that the food was anything close to good. The chicken tempura tasted like from the frozen food section of Costco. Plus it was more expensive compared to most places I dine at, which would have been acceptable if the food was good at least."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaUktenlBRRAB",
            "text": "If your a fan of seafood and one of a kind unique dishes with unlimited flavors and a huge menu then this place is for you. When i eat here my socks come off everytime they never disappoint. To put it in perspective i never once ate the same thing twice from here thats how much i trust the chef and how much variety they have. I officially stamp this as my favorite japanese restaurant and im Jamaican from NY so this says alot. Thanks for the upmost quality frenasai !!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXbWFTMkZnEAE",
            "text": "Lovely place for those sushi-fusion lovers. Fantastic food, nice spot to relax and eat by the water. hibachi is lots of fun for the little ones.\n\nIn summer, choose indoors (mosquitos will kill you outside).\n\nOther than that, quick service and excellent music."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdmFmQUF3EAE",
            "text": "Great place for Asian eats. Have done  take outs from here especially during pandemic and food at times seem hit or miss. Service is excellent very attentive for the most part.  Food comes out quick. Nice atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacmRucjVBRRAB",
            "text": "We had a great view from our seat. The menu is interesting and different. The plating is beautiful. The food is tasty and delicious. Attentive and on point staff."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZMnRDRGxnRRAB",
            "text": "Always great customer service, lovely ambience for friends, family or even a date night. We love the cozy little outdoor sitting area that overlooks the bay. The food is amazing and the presentation are always on point!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhc04tQXBRRRAB",
            "text": "The food is boring and tasteless. The fountain soda is flat. The prices are of a trendy restaurant and I suppose the decor is decent. Unfortunately this restaurant is in the middle of the cultural wasteland that is Howard Beach so I suppose…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdWN6ZzFnRRAB",
            "text": "We ordered food from here today. The reviews were good and the description seemed like the food would live up to expectation. Not the case.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZeHNTRHZnRRAB",
            "text": "This is a great place for authentic hibachi.   The service is superb and the food and drinks are the best in the area.    Nicole, the server, is attentive, courteous,  and well experienced. Jason,  the hibachi cook, is an excellent entertainer, especially with children.  This is a place very deserving of 5 stars."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTc2Ntd1ZREAE",
            "text": "Friendly and attentive staff. Decent “outdoor” seating with adequate heating during winter. Their Pad Thai portion was huge with plenty of beef. The sweet sauce was a little too much. I didn’t like that it was not spicy at all- especially since I didn’t ask for it to be that way."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvdTl1MUhREAE",
            "text": "It's Hump day, and me hankering for some of that Good Soosh. Been to this place dozens of times, take a table in their backyard. Like having space to my self. Enough people inside enjoying the AC. The waitress looks at me funny, why you sit outside? Too Hot. Don't care, there's a nice breeze coming in off the bay. If your a local looking for a local Eatery, always go for lunch. Tells you everything about the kitchen Talent. They serve Lunch till 3pm M-Sat.\nGot the beer: Sapporo. Got the Chirashi: Yummy Yum Yums; Pretty Sashimi over seasoned sushi rice, dollops of Red caviar strewn about, with edible flowers for the Cutesy points. The waitress is super sweet, everyone there is always friendly and engaging. They're having a special of Fatty Touro and Yellowtail. Order the Touro Sashimi, melt in your mouth Buttery Goodness. A consistent, Tasty Spot to get your Japanese Cravings met, the menu is the size of a 90s dinner, or a 2018 upstate motel Whitepages.\nSomething for everyone here from Habachi tables to excellent apps. Personally, not a roll guy, too much rice not enough Fishees. However, people are Just\nFace pounding Specialty Rolls, as me saunters in. Highly recommended, clean, great Service.\nThe big difference here is that each dish is a little work of art, edible flowers, light up devices, smoke and artsy swirls of sauce hold true to that we eat with our eyes first. True dat here.  Return on the regular."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZOV82YlZnEAE",
            "text": "Great service. I recommend the hibachi the chefs are so playful and entertaining! The presentation of the food is tremendous! We went for my daughter's 20th birthday, they perform happy birthday like no one else!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLdGJYNFdREAE",
            "text": "I've been coming here for sometime and was overjoyed when restaurants opened back up. I love the bar area and now that there's bar tables I'm even more thrilled. Kim is a bartender but her knowledge of the food and experience keeps me coming back. Stop by any day but Sunday and Monday."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDaGJMcTVnRRAB",
            "text": "Prices are reasonable. Staff is very accommodating and sweet. They didnt have scorpion bowls which was a downer and the bottles of wine were too small and pricy. They should have a BYOB policy which would have given me more money to order…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtc2UtS19BRRAB",
            "text": "A very good place for sushi lovers. Price might be little up but worth it. Definitely a go to place to celebrate special events of your life."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNamJINkRREAE",
            "text": "Amazing sushi, very good taste, beautiful atmosphere. Will try hibachi next time. Oh and pricing is great."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDdDVQVm93RRAB",
            "text": "One of the best places to eat on Crossbay Blvd  when you need a sushi fix. The basil flank steak is amazing, it is my go -to dinner choice. In the summer time, their outside space overlooking the water is relaxing and refreshing. It’s always nice to have brunch with a view. Staff is friendly and inviting."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLNk5IMlh3EAE",
            "text": "This place has great quality food for quality prices. Their hibachi platters are so delicious and filling and come with both rice and noodles, so it’s been my favorite go-to lately, but I always have to get at least one roll as well. Cute outdoor seating too!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyeGFHVXVBRRAB",
            "text": "Came at seven pm with a party of 12 on a weekday for an event - and Service was a++ , food is exactly as shown in pictures... Everyone was very happy with everything that was ordered;\nThere is easy parking; ambience is okay; not a five cause it needs a make over .... If there is a second floor that would be ideal for the rest rooms for more dining space; the outside needs better signage.\nWould return."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvdjZiWHNBRRAB",
            "text": "I visited this place not too long ago. My husband and I wanted to seat at the hibachi table, but unfortunately it was unavailable. We waited for a couple of minutes and got seated to a regular table. We ordered from the hibachi menu, I had…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaWJUdzVRRRAB",
            "text": "Went here with my coworkers and we had such a wonderful time. The food was amazing, the service was on point. and the atmosphere was just perfect.   Will definitely be going back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleFBlWWZREAE",
            "text": "Asia fusion with views of the river, if you are in the area and looking for amazing sushi stop by. The staff is super friendly and service was good. Additionally they have many vegetarian and vegan options and will make custom rolls if you want to change the ingredients. Definitely my go to spot when I'm in the area."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvd2RHNWt3RRAB",
            "text": "I love this place. The food is always great and presentation is beautiful. Everything on the menu is delicious and their dinner/ lunch specials are amazing!"
        }
    ],
    "reviews_count": 64
}