{
    "name": "Panino Rustico of Howard Beach",
    "place_id": "ChIJwd6aRaRnwokRfdFnBOZOmOw",
    "grid": "QN10",
    "address": "161-16 Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.8,
    "user_ratings_total": 68,
    "phone_number": "(718) 290-2636",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUFJrbE9aaTFhZEhCRFkxVkpOR2RDU1RseGVtYxAB",
            "text": "Wonderful selection of foods, including gluten free options. Very  friendly staff as well."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIZ2JtSWxRRRAB",
            "text": "The first time I dined in the restaurant with two other persons was in July.  On Thursday, September 5, 2024, I placed an order for delivery.  Very friendly & cordial people."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscVl6Ukhka1p4ZVZSSWQyOXBjazAxV1RCNlYzYxAB",
            "text": "Friendly staff. Tasty and healthy options of food. Gluten free available as well.\nBest in Howard Beach"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUmFVaE5VbE5RZWxwcFEzRm1PWGczTlc5V1pGRRAB",
            "text": "You're nuts if you don't come here. Large, reasonably priced, awesome panini. I had one with burrata and prosciutto\n(pro - shoo-toh). Absolutely amazingly scrumptious!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcmJXbEJVblZYWVRKdGRGZFRNVlZPWlV4cWNHYxAB",
            "text": "Excellent food and great service. Thank you!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eWNYbHRlVjlZV2pSYWVqY3RVbWh4WDNock1WRRAB",
            "text": "Ordered the \"P50\" panini which had a pretty suitable amount of steak, chipotle mayo, onions and some sort of yellow cheese that didn't really strike me as American cheese although I could be wrong. The panini was tasty as well as the truffle fries that I ordered. It was almost $10 for the fries but they literally give you a small bucket of it and for a fat dude with a big appetite, I struggled to finish the fries. The fries didn't seem like your standard frozen fries, it looked like they may actually cut the potatoes in house. I had ordered it for delivery on GrubHub and received it very quickly, bearing in mind I'm almost a 10 minute drive from this place. Maybe I just got lucky, delivery guy was an older guy who was very friendly too. I'll definitely order from here again, especially as I want to sample more of their huge menu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMk1HWlRUbFZqZW1reVNGOWhjVU5LZW5kdE5uYxAB",
            "text": "Jared was a super kind and always has a  positive attitude.  His work ethic and team spirit made a real difference, and it was clear he genuinely cared and made sure things ran smoothly.I would happily recommend coming here the service is amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMmFscEJWMjlFUVZaSlRHUk5ha0p4Ym1oVFRHYxAB",
            "text": "Everything’s top notch especially that P50!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOeUc5b2k0bHFDTnZ3RRAB",
            "text": "LOVE this place!  Food is always made exactly as ordered and is delicious, and the staff are always friendly and courteous.  I HIGHLY recommend this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKelE2cmV6MHBXSXlBRRAB",
            "text": "Omg this place is great!!! I bought a grilled chicken panini. It has roasted red peppers and pesto. Bread is nice and crunchy. There are a lot more items. A must go! Staff are really nice and friendly. Italian on the outside Mexican on the inside, but it's great food!\nAnd nothing wrong with that. I'm just saying who works the kitchen.  ❤️ mex"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS1Ixci1GOExtRXl3RRAB",
            "text": "First stop in New York for us & it far exceeded our expectations!! Truffle fries were hands down the best fries we've ever eaten!! The wraps were amazing & the smoothie was great!! Service was so friendly & on point! Highly reccomend when you're in the area!! Special thanks to the ladies there for amazing reccomendations, service & kindness!! Can't wait to try the Cannoli later!! Thank you!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbXF2ZjMwekxyMFFBEAE",
            "text": "Very nice selection of food and paninis!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOXNQT0dnEAE",
            "text": "Loved the food and the location. Wish the service was a bit better more attentive. My coffee was forgotten and when I asked for it I received the wrong one. It was only until a little after my meal was almost gone that a female worker came over and asked if we were ok and if we needed anything. She was so pleasant and lovely! Wish I knew her name. Also wish that was the customer service across the board. The food was delicious! Would definitely come back 👌🏻"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMHRMa2xBRRAB",
            "text": "I ordered a salad, arugula, cherry tomato’s, lemon oil dressing, parmigiano reggiano cheese and grilled chicken.\nI assumed the chicken was grilled fresh, no. It is cooked, “in the morning”, and reheated. It was dry and gross. Not worth $19 and anyone can get a way better salad with fresh grilled chicken from Gino’s.\nNEVER AGAIN.\nStep up your game for a $20 salad."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dmZlVXV3RRAB",
            "text": "I went in recently for a bite, the customer service was amazing! I was met by Ava, who works there, and she was nothing but kind and made sure I had everything I needed. The food was delicious, and I will be going back! I highly recommend it if you are in the area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRc196WFpnEAE",
            "text": "Was there for the first time? The\nPanini sandwiches were great and so were the French fries."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbGFQZjdnRRAB",
            "text": "The young ladies were amazing at the service!!\nGood was amazing!!!\nEasily parking !!\nCoffee is amazing !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReF9hdXZnRRAB",
            "text": "I've been here a number of times, and each time, I am happy with the service and the food. P36 on the menu is my go-to and the side of potato salad, delicious"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBamNxd3V3RRAB",
            "text": "Delicious soup, salad and paninis! Kids chicken fingers and fries were also great. Will definitely be ordering again"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2X3BQMlpREAE",
            "text": "5 Stars on hospitality and accommodations. They did not have an item and they went out of their way to let me know. Most places would not and simple replace it with no notification. They went above and beyond to add additional items and then call to check in! This was my first of many more experiences, with my business. The wraps were so yummy flavorful dessert were super yummy and must try! Can’t wait to get again!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Z2NLUHJRRRAB",
            "text": "This s ok for breadfast or light lunch... service and atmosphere could be better..."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcE8zWHpRRRAB",
            "text": "El lugar muy agradable, la comida extremadamente rica, pero lo mejor, el servicio."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNk5uUXFRRRAB",
            "text": "What an awesome place!\nI've been to Panino Rustico a few times, and whatever I've ordered has been so tasty!\nThe place is clean, the staff is outstanding. Also has a nice atmosphere, even some outside seating. If nearby stop in, the menu has something for Everyone!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYejlqVXZnRRAB",
            "text": "Delicioso ❤️ buen lugar buena\nComida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbGUyckx3EAE",
            "text": "Fresh and delicious food and best customer service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMGVPTE9BEAE",
            "text": "My family went to Panino Rustico to celebrate my daughter's birthday because she loves their crepes! It was my first time at this location. From the moment we walked in, it was a glorious experience! Jack, who I imagine was running the place, greeted us with the biggest smile. His entire staff was polite and attentive. We were treated like VIP's. The food was great! We honestly could not have chosen a better place for our family to celebrate. I can not say enough about this place. Jack and his staff made our experience the best ever! We will certainly be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeTR2U013EAE",
            "text": "Food was great, good people and nice atmosphere ✌🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdWEzaEdnEAE",
            "text": "Yesterday afternoon i came in here with a friend. Ive eaten here a few times before and i usually don’t write reviews but this waitress named Angelina is such a sweetheart. So welcoming and attentive. I got the Broccali rob with mozzarella and chicken. The food came out fast and delicious. This place is immaculate. Again, i usually don’t write reviews but i appreciate good service and good staff. Definitely my go to spot in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMXZhN0NBEAE",
            "text": "I ave them five stars. Because the Costomer services was excellent, and the food it’s so delicious, the place very famyliar. 💜💜🩷❤️🧡💛💚🩵💙💜💖💘"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3XzkzQ0p3EAE",
            "text": "I brought my kids here after a nice day hiking around the waterfront, and I’m very glad I did!\n\nThe menu is full of so many amazing options! And the prices are very reasonable for a place in Brooklyn. The service was some of the best I’ve had in a while. I wish I knew the name of the server who took care of us, but she went above and beyond to make my kids very happy. I will definitely be coming back here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NTRxMFV3EAE",
            "text": "The Panini were delicious! We had the Howard Beach Breakfast panini, Hot Pastrami, & Burrata w/Prosciutto panini.\n\nThe staff were incredible & professional.\n\nVery beautiful, classy decor & outdoor seating was available on a beautiful day!\n\nWe've been there twice this week!\n\nGreat value for the money.\n\nDine in, Takeout, or Delivery."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aUxfQzNnRRAB",
            "text": "Such a pleasant place to\nEat at. They have so many options that you can never go wrong choosing something different every time. The service is excellent, and all the ingredients are always fresh!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNW82UnJ3RRAB",
            "text": "Staff was terrific , food was served in less than 10 minutes, huge selection to choose from and all at a very affordable price"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiLXVHVWFBEAE",
            "text": "Want they with my partner for lunch? It was very nice the weight staff nice food was good will be back soon met one of the owners"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMDYzTHpRRRAB",
            "text": "We had a great breakfast this morning.  Wonderful atmosphere and great food! Delicious breakfast sandwich with egg, cheese, spinach, onions and tomato with a side salad that was superb!\nWe will definitely be back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyOWRuempnRRAB",
            "text": "Absolutely adore the atmosphere. Very cozy and quaint with food made to order. Fresh tomatoes and avocado grilled chicken panini explodes flavors together that are incredible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyOWRHZjBRRRAB",
            "text": "Absolutely adore the atmosphere. Very cozy and quaint with food made to order. Fresh tomatoes and avocado adorned atop crispy bruscetta bread. The panini made to perfection with a toasted taste that adds to the flavor!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyM3EtejFnRRAB",
            "text": "Absolutely amazing pesto mozzarella crepe and the people working there are so sweet and accommodating! They helped my daughter pick up the beads from her bracelet that broke all over the floor and gave us all some nice cold water while we waited for the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaTZuN3h3RRAB",
            "text": "Great new spot! Food was delicious for dine in or dine out. They have soup too! I loved the corn chowder chili delicious. And the paninis were so yummy. Tasty paninis. Will definitely be back. Staff was nice too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeE9hN3V3RRAB",
            "text": "Ordered for the first time last week restaurant; expected the food to be great as the restaurant has only recently opened. The Eggplant Panini was large enough for two meals and was good but not great. The two salads we ordered were wilted, mushy and obviously had been laying around for a while. My first impression - not good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdjhId21RRRAB",
            "text": "Very busy 1st day of their soft grand opening.  Their service was excellent as all the employees were running around taking orders and delivering food the entire time I was there.  They even ran out of some of the items they needed to cook.  My food was good (although a bit cold) but my wife’s food was a bit undercooked probably due to rushing to get everything done (very busy!).  I will be heading back to try something different in the near future where I’m sure they will be better prepared for the business they are seeing.  Good luck!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6ODhLUHd3RRAB",
            "text": "Long time fan of panino rustico from when they started in Bensonhurst. Dinner there tonight & had paninis, fries & crepes. Everything was fresh & delicious & great service!!\nHappy to have them in the neighborhood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaGZPQU1BEAE",
            "text": "Very good panini and cappuccino. Good quality bread."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdUlPSVd3EAE",
            "text": "The food I got for pick up was horrible the panini wasn't even pressed and cold . 2nd I know the delivery driver that works the afternoons shifts and I hear the owner screaming at him and cursing when I was there for pick up . That is not cool ! How do you treat your employees like that !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMWFHT293RRAB",
            "text": "This business is fantastic, and right near my work,  which is even better.  Their food and customer service are exceptional.\nHighly recommend."
        }
    ],
    "reviews_count": 45
}