{
    "name": "Matteo's of Howard Beach",
    "place_id": "ChIJWTpgXX1nwokRWZPXWUw7N-k",
    "grid": "QN10",
    "address": "92-10 Shore Pkwy, Howard Beach, NY 11414, USA",
    "rating": 4.4,
    "user_ratings_total": 1032,
    "phone_number": "(718) 322-2606",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdFMwTk1kemRsTUZKeVN6aDNSalY1TjNGaGJHYxAB",
            "text": "I finally stopped in after driving by it for 30 years and always wanting to try it. Everything was great. Generous portions. Looking forward to returning."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUGQyTTVORUpDVFZkcVdGWk5kRFpHVkZwSE1YYxAB",
            "text": "The atmosphere here feels almost cinematic — gentle lighting, quiet music, and dishes that arrive like carefully framed scenes."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMVZGbEpWbEJ4UzBrMFh6QjFNWHBNVTFGMFpVRRAB",
            "text": "will start off by saying that I wish that I can give more than 5 stars. This restaurant is conveniently located at crossbay blvd. An amazing area and near transportation.\n\nUpon arrival, we were greeted by the valet and walked into a very warm welcome by the staff. They were very hospitable and accommodating. I loved Anthony Amoroso who made me and my guests feel like family. My servers Louis and Frankie were nothing short of amazing. There is excellent customer service all around.\n\nHere are some highlights :\nRestrooms- clean, nice decor, smells amazing\nRestaurant- nice ambiance, well lit, romantic setting, clean, comfortable, and classy\nFood & Desserts- no words. Chefs kiss\nAtmosphere - family- like, respectful\n\nMy group of 9 enjoyed our celebration. The staff went above and beyond. Yes the price is slightly elevated but if you see white linen tablecloths you know what to expect. Was worth every dollar.\n\nPlease note they have accessible bathrooms available. I cannot wait to go back."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUk1WOHlNRUZuWlVGSFZtZHZYM1JuWTFodlFuYxAB",
            "text": "Such a neighborhood staple, and for great reason. Love the family style vibe and specials, food is always tasty. The staff really makes you feel like family."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NdFdWcEZPVkJFV0Y5c05VUmhUVjlFVVhwVk0xRRAB",
            "text": "It's ok, food was a bit flavorless, came out fast but place was empty so maybe that's why"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSU5VRTRhemxRVkZvMGJsaGpkRWx0WjI5SFRVRRAB",
            "text": "Food and service were excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSmJXVXROVVJyZFhaTVVFRXphbDkwVDFZemVWRRAB",
            "text": "Sorry guys! We stayed there almost 3 hours. The food was good except it was warm and cold on top I think it was left on the counter for so long. My husband had the honey glazed salmon. It was cold, dry and over cooked. Was so noisy you could hardly hear my family talking. It was my daughter 's 25th wedding anniversary and hoping to have a good time. We were so disappointed with the way they acted. They were more concern with the other guests because they are Italians. Nobody even bother to ask if everything is ok."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Uk1UVlBSVmg2VEVsNmF6Qm9hMUI0TVY5WU9YYxAB",
            "text": "⸻\n\n✅ Example review you could post:\n\n“I was very disappointed with this restaurant. The prices are outrageous compared to the quality of food. I paid almost 900, the service was slow and the server was giving the wrong price information and when I asked about portion sizes, the server was dismissive. Overall, the experience felt like a scam—definitely not worth the money. I would not recommend this place to anyone.”"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6ODVuWXh3RRAB",
            "text": "So well receive ! We were there for a birthday celebration. Food delicious and service was excellent...Birthdays cake was more of a pastry but it did what it was suppose to..Looking forward to returning!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReUxXMDVlR2xVYkd4TGRWRkllbFU1VERCMVdrRRAB",
            "text": "Great place with an old school feel and classic Italian menu. Everything we had was delicious. Valet parking made life easier as well. Top notch"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYU4zRnlhREp2ZDFCemRYbHVUemxIYW5Kc1IwRRAB",
            "text": "The staff are courteous and attentive.\n\nTheir food is fresh, tasty, right-portioned & tender.  My Chicken DJ is unique in its menu.  The two pieces of chicken breast were served on a bed of spinach.  My husband’s chicken with tomatoes, mozzarella and balsamic vinaigrette was also served differently.  He enjoyed his meal although the chicken breast pieces were not as big as those on my dish.\n\nWhite table cloths - 👍\n\nDim lights - Cozy but too dark to read the menu even with the mini lamps on the table.\n\nStreet parking spots are few but I understand that use of the Capital One Bank parking lot is allowed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5clQwMHdMV0psWDNkSlVtMHdOWE5tVUhZNGFWRRAB",
            "text": "One of my favourite, if not the best, Italian restaurants in New York. I always visit when I am in town, and it always delivers. Chicken Parm is a must! Service is always good. Great ambience, feels like a local but very welcoming. Top marks!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSmJuZG1PVGRtYjJaUlZqVXlhM2RqYUhSaFNXYxAB",
            "text": "Alex was our server. He was informative and very hospitable. Food was top notch. Always a great experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbGFuRlpibGg2UlRWQmQwRkZTREpIUVRkaU1rRRAB",
            "text": "INCREDIBLE. We had Penne Vodka, Caesar salad, and tiramisu. All of them were the best we ever had.\n\nOur server Alex took amazing care of us.\n\nPerfect dining experience"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBM04zYlN3EAE",
            "text": "Never a bad meal. The bar is great for a meal, see i e is top notch, especially if you want to catch the game on TV."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BM2JYcDFXVWc0ZUZkamVrcHRSMEY2Ym5ob1VrRRAB",
            "text": "Excellent, excellent food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUVJVNDBUbXRLYTFkSVVUQkNUWEZvWnpWTmVXYxAB",
            "text": "The food was ok, but the customer service was excellent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSWR5MXVia3RUVG5Kc2NVMU1SSFZXUkVnM2VVRRAB",
            "text": "I came here for dinner with my family. All family style dishes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRmN6aEViRk5uYzB0T2VXVjBWMUZGWHpFMVNtYxAB",
            "text": "Great food and great service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kb2RucHNNRXRsU1ZGU2FWRjRTWG95WkhsRmVuYxAB",
            "text": "Bruno’s was closed for vacation and Don Pepe isn’t open on Monday  so we tried Matteo. The  martinis were barely passable.  The veal saltimbocca was  floating in grease red sauce. Service was poor with dirty plates remaining on the table for 10 mins.   The bill came and when I paid and I notice they charged me 5%  for credit without telling me. Finally, they asked for the tip in cash.  Enough said."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvcnZTWExREAE",
            "text": "One of the best food I ever had."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWGRtazNjVVpRWlZRNGMwWnBTWEV4Y1dnd0xYYxAB",
            "text": "The place is very cramped with tables.  They tried to pack too many tables into a small place.  There is not much space between each table, very uncomfortable.  Food was okay nothing special."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toQk9WQlpSakpMVEZwYWJFNVpSRVJCTUdoQ1RFRRAB",
            "text": "Family style here seems to work better than other restaurants with the same concept. The food is very good and the service is efficient and friendly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cU9GWkRRVEF5VWxGcU9VdE1iazl5YlRkSk0yYxAB",
            "text": "Great food great service I must go to!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVU0zVmhURjkzWTFwbk9UZ3RNazFsYm5ndE1WRRAB",
            "text": "Spent my Father’s Day with my family at Matteo’s of Howard beach. What a classic to go to a family style Italian restraunt with the people you love. We enjoyed our meal together lots of pastas, cheese, seafood, and wine of course. The waiter was helping us cut our food and served it on our plate too. The place is decorated very elegantly yet still has a cozy feeling as well. Overall lovely, delicious and great time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbXN4Y1NMMVltWUFnEAE",
            "text": "Great staff and excellent food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKTzIxZHkxNUx2OWlnRRAB",
            "text": "Stopped here for to proximity to JFK. Food is great, and service to match."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQX2dyY0N3enNXdHJnRRAB",
            "text": "It was ok. Super over price and food was average, there was a small bug in my water 3 different servings disgusting."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPTEg0S1hkMzhqUDJRRRAB",
            "text": "Very cozy friendly staff, good and drinks very hood good is do fresh and tasty."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLdU14WV9jNTVXLXlRRRAB",
            "text": "The food here is amazing, they give you super large portions, nothing but delicious authentic Italian food."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dHRTWVNnEAE",
            "text": "Haven't been here in several years, but it is just as good as I remember. Everything was excellent, from the food to the service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJVF95Y3VwanFTS2d3RRAB",
            "text": "Best Italian food I’ve ever had!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLckNocmpGaS0zZFd3EAE",
            "text": "Great Italian chow"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM0pPV2VREAE",
            "text": "Went there on Easter with my girlfriend everything was going okay and our waitress brought over the menus so I was asking her what was in the food certain stuff I was allergic to she was Like “ are you asking questions or you gonna order “ I was so pissed my Girlfriend had to calm me down not gonna go there again"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdHVhZWFnEAE",
            "text": "For 20 years I've been dining this restaurant and the food tastes exactly the way it was years ago, excellent!!! Service is impeccable and the atmosphere is something out of an Italian mobster movie. Nothing but 5 stars here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuc1p6N2lRRRAB",
            "text": "Place was really nice service was great food was outstanding.  Somewhat small . Prices are very expensive for the average person plus they charge extra for using a credit card. Plus tip was added to the bill. Overall good place don't see going back anytime soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbHNyTWp3RRAB",
            "text": "My husband and I were celebrating our son’s baptism and we felt Matteo’s did an absolutely amazing job! The day couldn’t have been anymore perfect. We had about 67 guest and we were all blown away by their incredible menu - we purchased the platinum package and it was the best! The staff and maître D showed some of - if not the best hospitality I’ve ever seen In the industry. We will be back again and again. Thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxcy1mZFRnEAE",
            "text": "Matteo's has been recommended to me multiple times by many friends of mine.\nDecided to take wife here for her birthday, and it was most definitely the right choice.\nFood is amazing, well seasoned, and the timing is on point.\nWhen we asked for a glass of Jameson on the rocks, we got a HUGE glass, filled to the rim.\nPrice of more than 3 hours of feasting and drinking to our fulfillment was WAY cheaper than expected.\nStaff was super professional, attentive, and very kind to us.  This is a wonderful establishment we plan on visiting way more often."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aU9qM1pnEAE",
            "text": "Celebrated my MIL's birthday at Matteo's. Highlights were the broiled veal for me. Kids loved their penne a la vodka and Fettuccine Alfredo. The dessert platter they bought out was insane. It had everything on it. Two week before we rented the room downstairs for a team dinner for about 40 of us. Both times were great service and great food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2cFBydXhRRRAB",
            "text": "First time visiting with no reservations. We were welcome with a party of five. The atmosphere was absolutely fantastic, Godfather  movie setting. The service was on point, very attentive.The food was good, nicely presented with very little waiting time. Yes I would revisit Matteo's."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbUtxWjRnRRAB",
            "text": "My daughter just had her baby shower there today and everything from the service, food, hospitality, price, ambience, was nothing but near perfection. Everyone was raving about the food and service. We also had dinner there before booking this place and absolutely loved the food and service. I would definitely recommend this establishment for either dinner or a party experience. The men hung out at the bar and the drinks were amazing as well. Valet parking was very convenient too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadFo3R0Z3EAE",
            "text": "My cousin paid an unexpected visit after her plans fell through. We decided to grab dinner, Matteo's was pretty convenient. The food was good, the wine was better 😁, I had the chicken Caesar salad, she had pasta. Overall recommended."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcjZLVVlBEAE",
            "text": "I was miserable when the original restaurant once in this place went out of business.  I can gladly say that Matteo's is even better.  The eggplant rollatini served as an appetizer was so tasty. I would have preferred thicker cut fried zucchini,  but it was also very good with a really nice sauce on the side. Main dishes offered were very,  very good, Service was friendly and attentive. Count on a return visit."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbUtmZXhnRRAB",
            "text": "Had my Daughters Baby Shower here.\nIt was awesome! Food & service were amazing.\nWould definitely do another party here.\nPeople couldn’t stop talking about how great the party was. They loved the food & the friendly service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdUthUmFnEAE",
            "text": "My fiancé and I have been dying to try this spot around our neighborhood. They did not disappoint! Everything tasted so so good and the vibe was so calm/homey. Best Valentine’s Day dinner!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1aHFpWl9nRRAB",
            "text": "On a business trip and went to Matteo’s for dinner, what can I say.. it was amazing!!!  Great service, great recommendations from our server, huge portions.  Can’t wait to come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OXNHQ1VBEAE",
            "text": "We have been coming to this Italian Restaurant consistently for a few years since relocating to Woodhaven. We ordered several times online (GrubHub) with mixed results, onsite service is spot always. Most recently we came for Mother's Day, considering how late I was in finding a place and making reservations, I was surprised we found a spot. It was a tight fit as there were a bunch of large table setups, the place was truly packed. They had a set menu for the day. Ultimately it was a lovely experience and we were happy to share it with the folks at Matteo's."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNEo3LUh3EAE",
            "text": "We love dining there ! Always tasty good and I personally enjoy the way the staff sings “ Happy Birthday “ for guest."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaX0tIRzlBRRAB",
            "text": "I've been wanting to try this restaurant for years, only because it's been around for a while and I'm a big fan of Italian food. The food was good, nothing really stood out. Regular Italian food. The outside of the restaurant gives you an old Italian restaurant vibe but the inside decor is very... Bland. Didn't give me the Italian vibe I wanted that night. But if you want good Italian food, this is the spot."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwbHBIYnd3RRAB",
            "text": "I went here for a birthday party everything was absolutely delicious. It's also very well staffed there by the service was amazing as well."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNGRUZUZREAE",
            "text": "Booked a luncheon for a family function. It was just the week before and I had many people coming from Cali and FLA. I passed on 5-6 other places because of the size or parking, reviews. Anthony put me at ease but I was still nervous until an hour in when everyone was raving about the amount of food, quality and service. There is valet parking, a lot and also street parking. Chicken Matteo, Shrimp dish, baked clams, fried calamari and the Napolean cake were all amazing. Difficult people in my crew came up to thank me. Book with confidence."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmazYzcjlnRRAB",
            "text": "We didn’t know anything about it when we noticed the place while driving by. Went in for lunch and loved the food and atmosphere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlXzZmX3ZRRRAB",
            "text": "Ate at Matteo's Howard Beach last night for our anniversary dinner. Let me tell you, it was the best meal we have had in a while!!!\n\nMy husband started with the Lobster Bisque Soup, which he said has nice chucks of lobster in. I started with the Matteo’s chopped salad, which would have easily fed 4 people as an appetizer. Then we shared the bucatini carbonara and the veal Milanese special, washed down with a bottle of Riesling.\n\nI wish I new my waiters name, he truly was a gem, huge heart and loved his job. Our glass was never empty, our plates were never empty, got the whole wait staff to sing happy anniversary over a pistachio tartufo.\n\nWe loved the table side service and the hospitality. The only downside was there was a party upstairs and we could hear the muffled music over the music that was trying to play in the dinning room. Definitely won’t stop us from coming back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJalA2a293RRAB",
            "text": "Can't wait to go back. Frankie, our waiter, suggested I try the Chicken Marie and I WAS NOT disappointed. Great place for friends or family to meet and share a beautiful meal.\nP.S. The Peroni glasses are amazing 😉."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReUpQUFdnEAE",
            "text": "Wonderful service,Great Family Style food"
        }
    ],
    "reviews_count": 55
}