{
    "name": "Brother’s",
    "place_id": "ChIJm7dAK4BnwokRuW9s--k5egw",
    "grid": "QN10",
    "address": "158-14 Cross Bay Blvd, Howard Beach, NY 11414, USA",
    "rating": 4.5,
    "user_ratings_total": 575,
    "phone_number": "(718) 843-7263",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25waFFYbHRRVW90YzBoU2F6ZGpVRUZaZUdWRU9VRRAB",
            "text": "My grilled  chiken wrap had no taste , chiken was at least a day old , I asked for Chipole/ mayo none given provided in hero ."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ST2RsTTVaME5hVkV4bFRWQXdhR1k1YTB4amFuYxAB",
            "text": "ok; would only come here for a \"cheat meal\" cause the heroes are far from healthy choices... but prices have gone up to the point where id rather go to the supermarket  - street parking could be iffy..."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdE9WbDZSR3ByVldOTWNsTldaVjlIWm1Kd1JrRRAB",
            "text": "I had been there twice before but yesterday would be my last time.\nThe guy who waited on me tried to cheat me and then told me it was me who was nickel and diming him.\nI ordered 6 items to go. Yet he billed my credit card and on the receipt for seven items. One of the charges per him was to cover two items which would have brought my item count to seven when I only ordered six.\nHe tried to shame me putting me on  the defensive when it was clear he was trying to cheat me.\nWhat made matters worse was the fact that all the dishes behind the counter that one orders by weight had no pricing. He basically can charge whatever he wanted.\nAfter trying to cheat me, he said \"if you want, you can leave without any food\" to which I replied \"whatever you want to do.\"\nI spoke calmly responding to his every comment. He knew he was wrong trying to get over. He was angry that I caught him in his lie.\nIn the end, he asked for my credit card to apply a credit.\nI won't be going back any time soon."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZd1gwZFlaV0ZYT0dOT1lURjZXRWgxTUc1S2FsRRAB",
            "text": "Everything that we have tried is delicious and fresh. We eat from Brother’s very often and we have also ordered many catering orders from them, the prices are very reasonable and you get a lot of food. We definitely recommended this place to our family and friends every time we are talking about food because this place is worth every-time we order out."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214a1QwazJUR2gwWVVkU0xUSlZXRzVKUW5kNWNFRRAB",
            "text": "Good authentic Italian food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMWVXODFkbGxpVVVsaFZERktVWFZxVm1zd2RWRRAB",
            "text": "Chopped Italian sub was bangin’!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQmFsODViRVF4YWtKSFZIRXdWMnBoYm5Gc1ZHYxAB",
            "text": "Best in the neighborhood 👌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swd1oxYzNlV0pVY0VVelRqUnZabE5yUzNWMGNYYxAB",
            "text": "Not so good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMU1qbFpUM1JNVVdneVFVZ3dVa0pQTmtONGJYYxAB",
            "text": "Awesome spot, great food and friendly service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaVl6UkhhV1pxTW1vdGRtRm1kWGhDVDJ0Wk0yYxAB",
            "text": "Brothers is top notch! We ordered hero’s for my daughter’s 1st birthday party and they did not disappoint! Even the leftovers tasted just as good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxYU9WUlRjMnAwYUVodFNHUjBNREJHY2tsZmFWRRAB",
            "text": "Great sandwiches! The size of the sandwiches are huge so they don’t play when they say it’s a big sub. The sandwiches also taste great so the price is definitely worth it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NVdFZFNOVnByYmtKalpXeHlSWEZrZDFneFZIYxAB",
            "text": "Great Spot for sandwiches, I’m A New Customer There I Called for delivery and they delivered with care and everything was so hot and fresh and directions were listened the right way and I will continue ordering there, Best sandwich I ever had I ordered “The Howard Beach” great sandwich to enjoy. Ty so much for ya service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnM1ZWWXpSVFZsTkVzM1NuVlVPVVp2YVhOdmFGRRAB",
            "text": "Got a chance to stop by this place and wow was i amazed by everything here! I ordered the baked raviolis that they make fresh and you can tell by how delicious it was along with there homemade sauce that I could drink it it was that good! The fresh mozzarella balls were fantastic as well! I wanted to order so much more but I’ll definitely be back for sure this place is a must try definitely gotta check them out!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbFUyeGFZMTk2UjNsdlF5MU1ZVjluUlRVMWExRRAB",
            "text": "Not the best but there is nobody better!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21reU5IQlNhVTVIWVROWVluZHlaVkZDV2xKeGFuYxAB",
            "text": "Food wasn't great other places are better c&c deli has better food never coming here again also the male worker made a female worker cry while I was there"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMFgxb3dXR281TTJGRE1XMW5TRVEyZUVSTlIwRRAB",
            "text": "Brother’s has to have the best sandwiches on Crossbay. They never disappoint."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVllWcGtUMDFLVDNCTWNrTklXV1JVUWxab1dGRRAB",
            "text": "A WASTE OF MONEY! I DON'T RECOMMEND. I was looking for a great sandwich with fresh soft bread. So whole driving down crossbar I decided to give this place a try.  I was better off going to the supermarket stop n shop across the street.  I ordered a turkey club that came with avocado. It was $18 for the sandwich. I Even said to the cashier wow $18 is it worth it and she smiled and said yes,  you won't be able to finish it.  I asked that my bacon please be soft. It took about 15mins for my order because yes the place was busy.  When I got my food I didn't open it until I got home. Yes it was a thick sandwich but very bad.  First it was like they gave me a brick wrapped in paper.  The bread was so so so HARD when I cut it crumbs went EVERYWHERE. It was NOTHING fresh about that bread.  I believe they toasted it some but that was old toast. I will say it did have alot of meat but it was dry and bland.  I don't know if they ran out of the special sauce that was supposed to go on it but they could have just given my mayo. I added onions but they put chopped small onions on a sandwich🤦‍♀️🤦‍♀️🤦‍♀️ it was just all around a very very bad sandwich.  I could have gotten a better one from the corner deli. So sorry don't go if you're looking for a fresh, soft,  flavorable sandwich"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOb1p6bFJlVTR0UnpsaFJWWmlMVE5uYXpFMFVYYxAB",
            "text": "The sandwiches are so good. Perfect spot to stop on the way to the beach! They are hug so you can definitely share.  Everyone who worked there was super nice and will to make any substitutions we asked for! Definitely want to go back for some of their pasta!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVmRrMU9hblJUZWxjeGJWOTBPRkJKUzBRd2NVRRAB",
            "text": "Will start of by saying we have been regular customers and have had no issues until today\n- we will not be returning to this establishment\n\nThey called in for an online order - stating 1 of the 2 items were unavailable\nWe then advised they may just cancel the order since the unavailable item was the only thing my wife was interested in\nThe guy told my wife to cancel it from our end since “they’re unable to do so from their end”\n\nWe tried to proceed with that and the app wanted to charge us the full cost of the order to cancel the order\n\nWe call back to ask them to cancel it on their end & The guy on the phone then proceeds to tell us “well one of the sandwiches are ready - its a $26 sandwich the assigned driver is already here - im not giving you your money back take it up with uber” and hangs up\n\nNo food arrived, and this place proceeded to mark the order as delivered on their end and went on with their day.\nYOU GUYS HAVE YOUR OWN DELIVERY DRIVERS FOR UBER DELIVERY wym the assigned driver, you mean your own employee?\nWhy lie each time we reached out and make the refund process harder for returning customers"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KalMxcFVkbEl5WldSSk5ETlhWbVpQT1V0UE1XYxAB",
            "text": "The Best sausage and peppers hero iv had in years..Incredible with chilly sauce. You just can't beat it..👍👍👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVU4ydzJZbVZIZUd4SmRERkViMlV5WkRCQmExRRAB",
            "text": "Best chicken parm ever!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWemVWcFhlbDl6WlZWYVNUTmhWM0kxTWtnemJFRRAB",
            "text": "The sandwiches are delicious and the fresh ravioli and the sauce are scrumptious. Come all you'll enjoy"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GM1ZrbHZXVFJRTmpaRWIxOUpMVGx1V0hjeGExRRAB",
            "text": "Brother’s is now part of my regular Rockaway Beach trips. I always make sure to stop by and grab a bite — everything I’ve tried has been delicious. Great flavor, friendly vibe, and perfect for a beach day!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMlgwWnNSMlZhTW5CNmNVUlFTalF6VWpsbFpYYxAB",
            "text": "Out of this world Hero. Fed Three people."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOU2FHOXZkVm8xVFhCbmJ6Rk5lSFZGWVVaRFRWRRAB",
            "text": "A must when your in Howard Beach Best of the best always fresh brothers will do you justice pal trust me."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSmJFSjJReTE0Y2poWVRHWmpjVVEwZURJME5sRRAB",
            "text": "The heroes are great. I ordered the pink lady which was great and freshly made. The women working there were friendly and accommodating you can tell they care about their customers. If you want fresh authentic Italian heroes and are in the area you must try this place at least once. The prices are decent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5emFHdzVReTFLVDFCcVdGWlVOVTFWZG1SR05rRRAB",
            "text": "Best place to get deli sandwiches in Howard Beach"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNVNHcDZaVFptWmpCdFgyUjZWMUJZY2w5clJtYxAB",
            "text": "Solid food every time"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSM2JERm1kbTg1UVVGT2RrODBVazVPVkZnMGExRRAB",
            "text": "Yesterday I ordered five sandwiches and some side dishes, which was absolutely delicious. Just like to talk about my pepper potato and egg with hot peppers. It was the best I ever had in my life. Thank you Nick to you and the staff once again for doing it outstanding job"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdGJxam9nRRAB",
            "text": "UPDATE: Gotta update my review to emphasize just how good the sandwiches here are. I've had their indoorsman sandwich a couple times recently, one of the pricier sandwiches on the menu costing $24 on Uber eats. That said, it's a huge sandwich and this particular sandwich has chunks of actual steak in it. Not roast beef, actual steak. I've had this sandwich twice recently and both times that I ate it, I thought to myself that this particular sandwich might be amongst the best sandwiches that I've ever eaten in my life. I like to option it with the garlic mayo and let's just say it's one of those sandwiches that you think about the next day. I'm a fat man and even I struggle to finish the sandwiches here.  This place is pricey so I wanna hate on it but truthfully, they make some really good food to justify the prices. If you live in the Howard Beach area and want a good sandwich, I don't know why you would go anywhere else.\n\nGot a Philly cheese steak here and there wasn't much cheese in the sandwich, so it felt more like a steak sandwich than an actual Philly cheese steak. That said, it tasted great for a steak sandwich, with the steak pieces being large and very tasty/juicy. The bread itself was of higher quality and the sandwich was big which felt appropriate given the high price tag ($18).  Will definitely be back, just wish it wasn't cash only"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdFJsbE1kVFk1ZUdWRldsQkZhaTAyWVVSVFRGRRAB",
            "text": "Amazing sandwiches and of course rest of the food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TWQxOWxOSGxPVkY5U1NXUnVXa0UwZEVWSVkzYxAB",
            "text": "Really amazing sandwich’s. Tons of options. 1 sandwich can definitely feed two people, they are huge."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbFNHdE9ibkZDY1hSaGQwMVZkRWRFWlZad1NFRRAB",
            "text": "I ordered a custom chicken cutlet sandwich and it was on point! Everything tasted super fresh — the chicken was crispy and juicy, the bread was just right, and they didn’t skimp on the toppings. Staff was chill and friendly, made sure everything was exactly how I wanted it. For the price, it definitely hit the mark. Quick takeout spot I’ll be coming back to."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NmRHOXdiMmRXVjI4M1gyZzVkM1V6ZEROcFUwRRAB",
            "text": "Nice place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLZnJ1NWJWb3I2dTlBRRAB",
            "text": "Got a sandwich  chicken cutlets broccoli rabe n roasted peppers,  got bout 1/3 lb chicken cutlets, all broccoli rabe  n peppers, for $18 . What a ripoff. Last time ordering from them. STAY AWAY!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOQ3p4TzJyMGRIM2l3RRAB",
            "text": "Steak sandwiches was HORRIBLE. Couldn’t even bite into the sandwich it was so hard. Waste of money!!!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQUHcyWS1GcHVxV0JREAE",
            "text": "The older lady who was running the counter looked at my sandwich several times and just ignored it to take and make other orders."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQWDEycG1LbG8zWWRnEAE",
            "text": "Female employee was condescending.\n\nI like playful banter but she said a comment wholly unnecessary.\n\nWill never visit again.\n\nSandwich was ok.   I expected better from the reviews and price.\n\nAnd I'm majority Italian so I know good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MmZickFnEAE",
            "text": "So many great food options, it was hard to choose. I went with the eggplant caprese and it didn't disappoint! The hero was big enough to have half for lunch and half for dinner. $15...such a reasonable price for a hero of that size! Also pictured is the chicken cutlet caprese."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocF8zOGNREAE",
            "text": "Brother's is a must-visit for anyone looking for delicious Italian food. Their turkey cranberry hero is a personal favorite, but their salads, wraps, and other heroes are equally impressive. The standout feature of this shop is the outstanding service and friendly staff, who make you feel welcome from the moment you walk in. Additionally, they offers fresh food by the pound, making it a great spot for a quick and satisfying lunch or a grab-and-go meal.\n\nOne of the best things about this shop is the large-sized heroes, which provide a generous portion of meat, cheese, and toppings that are perfect for sharing or taking home for later. Overall, this spot is a fantastic option for anyone craving great subs or wraps and looking for a warm and welcoming atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMklic3JnRRAB",
            "text": "Sandwich guy here. Great portions and balance. Bread is perfect. This one is called the grinder."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjNGQzTkpREAE",
            "text": "Update 4/14/24\nWow! I've  been going 30 something years. I have used them every year for Christmas.\nMy wife orders a sandwich brings it home its not what I want. She calls up says they made a mistake, they no you misheard. Lately they been getting the order wrong. Just last week we ask for macaroni salad got tuna. I did even bother to call complain, things happen.\nI will be passing the word around ,double check your stuff if you go there. I won't be going anymore and neither will my family. Very disrespectful way to deal with any customers, no less loyal ones!\n\nUpdate 11/2/21\nI still love this place!\nThe food is so fresh and made prefect. I think they're probably the best food in the area. The Staff is great  so its always a pleasure going there!\n\nWe have been going there for years. Always great food and service also very clean. Its not cheap and its a few miles from my house down the Belt Parkway but worth it ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeWNDVjJnRRAB",
            "text": "My first visit here. I got the Italiano steak sandwich. I ordered the mini and it was still a large sandwich so good value for the money. The steak was perfectly cooked, the bruschetta was sooooo fresh. Honestly, one of the best sandwiches I've eaten in a long time. This place has tons of pasta, veggie, and seafood salads and homemade pasta. I wished I could have bought one of everything, it all looked great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX1BLS19BRRAB",
            "text": "The sandwiches here are huge, tasty, and definitely a once-in-a-while treat—especially with how the economy is these days. That said, $20+ for a sandwich is steep, even if it’s bigger than most.\n\nI’ve ordered here a few times, both from work and home. They deliver their own food, which you'd assume would mean better service.\n\nBut here’s where I have a serious gripe: I placed a phone order and asked for the total—pretty standard, right? I was told they “can’t give prices over the phone.” Excuse me? What kind of policy is that? Makes zero sense. But fine, I let that go.\n\nToday, I ordered two sandwiches and a soda. When I arrived, it was semi-busy but fully staffed. One woman seemed to be handling phone and app orders. She called my name, handed me the bag, and I asked her to confirm everything was inside—mainly the soda. I didn’t check the bag myself (my mistake), assuming it was correct.\n\nI got back to my car and nearly home when my friend checked the bag—only one sandwich. I immediately called the store, got placed on hold, then finally spoke with someone. I told him which sandwich was missing, and he goes, “Yeah, you can come back and get it if you want.”\n\nIf I want? No apology. No ownership. Just a dismissive \"come get it if you want.\" You messed up the order, and I have to drive back for your mistake?\n\nThat’s not customer service. That’s indifference. Disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNmR5dGxnRRAB",
            "text": "Oh my god!  Jersey Mikes you are dead to me now!\n\nThis place is awesome.  So friendly and so good.  Plus one star just for appreciating the D20 tshirt.\n\nThe Cugine and the load of baloney are devine, and huge.  The cracked olives were delicious.  And didn’t break the bank.\n\nAdmittedly from away (Canada) but have been all over.  I know about superb NYC sandwiches but this is above and beyond.\n\nTomorrow I will be late for work because I need to hit Brothers before I head in.  Thursday I’ll be picking a few up for the drive back to Canada."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlb3EzamdBRRAB",
            "text": "Very filling sandwiches, very tasty and quality ingredients. We got the bench girl which was good. The fried ravioli had fresh ricotta inside. The cold salad bar looked great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OHJYa09BEAE",
            "text": "First time here the sandwich I got was very fresh tasting , really good provolone and all the ingredients were so fresh , make sure you tell the order clearly to the person taking it ,they always so busy you can tell but I would definitely come back"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MjUzYXVRRRAB",
            "text": "Brothers is always a go to place for great local homemade Italian delights. Top notch food and excellent service. I have been treated like family since my first time going there. It will forever have my business"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEclBlbEdREAE",
            "text": "Was told about this place from a friend. I decided to give it a try and I wasn’t disappointed.  All this time I never knew there was an awesome sandwich spot such as Brothers."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnXzkzd1FnEAE",
            "text": "The PAPD was great! I frequent this restaurant often. This was my first time trying something different and I think I have a nee fave."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReFB6TWFREAE",
            "text": "Brothers Ravioli (aka Big Ass Subs) in Howard Beach truly delivers on all fronts. Their sandwiches are consistently delicious and have become my go-to for takeout or for any party I host.\nTheir food  is exceptional and their sauces are the best-the vodka sauce is my favorite.  However, what truly sets this place apart is the outstanding customer service. Angelo and the entire staff are simply the nicest people. If you're looking for fantastic food and even better service in Howard Beach, this is the place to be."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjMW9tNjNBRRAB",
            "text": "I had the wonderful Hot Honey Lady sandwich which is pictured below. It was very very good. This is not a sit down place; you grab your order and you get out of there so keep that in mind but i just drove around the corner parked under a…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURna3R1SXl3RRAB",
            "text": "I heard about and passed this spot for a long time and yesterday I finally gave that spot a chance. I ordered one of their sandwiches the Ribeye and it was really good I heard they usually put onion rings in it and when I got it I had cooked onions but either way it was good. I wouldn't mind ordering it again along with their other recommendated sandwiches. Also the staff was really nice as well, I wouldn't mind coming back again one day"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLOHJIQ2NREAE",
            "text": "I just love this place there is nothing absolutely nothing that I do not like their food is fantastic it's great and I only live in Howard Beach because I'm near Brothers that's how much I love this place"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNHY2LW1BRRAB",
            "text": "The employees are always friendly. The food is great, but my absolute favorite thing on the menu is the Brothers House Salad. So delicious. Highly recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNheUx1bWZBEAE",
            "text": "Holy cow the chicken cutlet, vodka sauce, fresh mozzarella hero and a grilled sesame hero roll was to die for. Worth the drive from Manhattan or JFK or wherever you’re coming from. It’s so good I forgot to take pictures"
        }
    ],
    "reviews_count": 56
}