{
    "name": "Russo's On The Bay",
    "place_id": "ChIJdbOZr4FnwokRiOekV4KN0UQ",
    "grid": "QN10",
    "address": "162-45 Cross Bay Blvd, Queens, NY 11414, USA",
    "rating": 4.7,
    "user_ratings_total": 1830,
    "phone_number": "(718) 843-5055",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbVZHMDBiRXBPT1RsMmFHMVRaamh2UWxSaWMxRRAB",
            "text": "This is a Top Notch Pl.. I had my prom in that place going back 30 years. I went back for somebody’s wedding and wow, we’re still amazing Top Notch food service music. Everything is as good as it gets. If not better I know anyone would love it would love it."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMWFXdFJSMHd3UjFRNFZtbHpNekZpY0VONWRtYxAB",
            "text": "Writing this review while i am currently at event held at this amazing location. Italians know cuisine & hospitality & they do it the best! The food absolutely AMAZING. Staff is great. The decor of each room is fantastic. Great location to hold events"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTk5qZEhNMGRrWVMxeFExbEZaREJaWkRCMmEyYxAB",
            "text": "Great food at a private Gala event."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxc1QycHRNRmxNVDJGclkxQkpOM2x2WVhaWFZGRRAB",
            "text": "Great respectful people"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVlZFUjRNRTFaVGtKRlN6ZHdUMDVVU2tGRE1uYxAB",
            "text": "I've been going to Russos for quite some years now and the staff is always very professional. The food and drinks are always superb."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paS1NsaDBaRE55ZVhKZkxWWXlVbXBWY1UxaVJYYxAB",
            "text": "Our daughter just had her wedding Sunday October 12 at Russo’s. This was the first time\nwe’ve been at an event there… let me say Russo’s met and exceeded our expectations.\nEveryone was so nice and pleasant they really treat like family. And the food is like dinning at a fire star restaurant best steak I’ve had in a long time.. The food during the cocktail hour was amazing everything was fresh and delicious. Many of our guest thanked us and said this was the best wedding they’ve ever attended and two of them were over 70 years old.\nOn behalf of the Stewart and Murrell families thank you for making Samuel and Courtney\nMurrell’s wedding a day they’ll never forget."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todFltbElUMk0yWW5oa05ucFZhM2RtTjI1d2JXYxAB",
            "text": "View, parking and food was excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeFNIaElOREpFVG1JNWRreHZObkV5UmpJM2QxRRAB",
            "text": "Food is always great here.  Service too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdk1IbHlNbWh5V1dZdFQzUnZlVXBITm1kRmVHYxAB",
            "text": "Great service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TlpGQm9RbFEwWnpCbGJVMXhVRlJoZWxKNFlsRRAB",
            "text": "Went for a travel event.  Service was tops. Friendly and smooth"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaVNqWlRWV2RRV1V0dkxVWm9aWGx3VUhGVlMyYxAB",
            "text": "one of the best place for met with groups of professionals or celebrations,food is great and the view too"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxU1dHZHhXR0pwV2toaFl6TnZjMGRVTlhCeFNIYxAB",
            "text": "Amazing cocktail appetizer and service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSk9XeHBOVzFQU2s5V2JFTXpjR3RITUdGMVYyYxAB",
            "text": "I just had my wedding here on September 5th. When I was shopping for a venue I looked at about 7 places. But there was something about russos that made me and my wife feel so comfortable. You can tell everyone here loves what they do and…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcWFXTnFZbkF6VGpZMWIzbElVazlsTlZNemJuYxAB",
            "text": "I went here for a birthday party. I mush say the food for the cocktail hour and the main course at the reception were amazing. Open bar...why not!? Celebrate at Russo's On the The Bay!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSlNtbHJVMWRsUkZkYWQydzRObTU0TjI5SVRtYxAB",
            "text": "always great for any event i attended there"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SU1HZGhielF6YW01WWQzTmtOVmRNWkRGbU4xRRAB",
            "text": "I came there as a guest last night for a friends wedding. I can confidently tell you all,  the service was fantastic. Our waitress Hailee was very attentive.\nThere was a surprise dance and great cocktail hour food. If you ever think of going order the strip steaks."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210M2VpMXBNbVpoYkROQ2VFeE9YM2N4U0hkRE1GRRAB",
            "text": "Nice wedding venue in Brooklyn."
        },
        {
            "date": "2달 전",
            "language": "ar",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVVpGbHFOVjlHT0dSMFVsaHFTMWRyWjBSclMzYxAB",
            "text": "القاعة جداً رائعة وجميلة لقد نالت إعجابي حقاً 🔥🔥…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oelpHZHVVbkkzU0ZWcVdUSjJPREZZZWxJdFRsRRAB",
            "text": "If I could give Russos 10 stars I would. My brother got married there in 2005. When I got engaged in 2022 I knew I wanted to get married there.  From start to finish everything was AMAZING.   Joe was our contact person and I couldn't ask…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSllrUkdjRXRaVjFWU2FVaENSamcxZEUxZlZXYxAB",
            "text": "spectacular! The cocktail hour id amazing the dinner choices were excellent.  I had the strip steak and  when you are preparing meals for 120 plus people it can  be difficult to deliver a great steak and they did.\n\nI've seen many amazing Venetian Hours and this one ranks in the top 3. awesome  job."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNFdVeFFZV1JEYW1KUlZWWjVSVWxZVVRSM05XYxAB",
            "text": "We had 2 birthday party's for my Mom at Russo's.👍🏾👍🏾…"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdmNUTXhiVWwyWTJ3eVdFOUZRMnBLY25CdE9WRRAB",
            "text": "The food, the ambiance, the service, all was top notch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcFIzUkRSemxLWlMxUmJHTlpTbGRaWjJNMlNrRRAB",
            "text": "we visited Russo's first time for a reception and cocktail.  This is an amazing place.  superb food and ambiance, service is world class.  Will visit again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWd2FFeG1heTFoZFY5S1RHeEtYMHh2WVhOVmJHYxAB",
            "text": "In 2024, we celebrated my son’s first birthday at Russo’s on the Bay. The service was outstanding, the food was excellent, and everyone we interacted with was truly wonderful. Robert Russo personally took care of us during the party, and he was incredibly kind and attentive. We’re forever grateful for the wonderful experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTFFqbGlja2QyWjB0cFJWUjZjMkpSTTFCZlFXYxAB",
            "text": "I Went to My Friends Wedding and was a great experience and would come back again"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodTZTZzNRRRAB",
            "text": "The best food, service etc.  Frank Russo is hands on and doesn’t stand for inferiority.  Only the best!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5R01qbFhlR3g1TkVOb1NUWkdTVTlITUZSWVZsRRAB",
            "text": "My husband and I went for a wedding reception. It was Beautiful and Elegant. The service could not have been better. When I say the food was delicious I mean it was fantastic.  During cocktail hour food was layed out buffet style. There was everything from Asian food to soul food and everything in-between.  Between my husband and myself we tried almost everything. When dinner came the servers wore cloth gloves which was a nice touch. Hubby and I both had salmon but couple of the other guests at our table had the ribeye steak. Now my salmon was good but when I saw the steak I was wishing I made that as my choice because it looked so tender and juicy it made my mouth water. The steak eat guests as well as my husband with salmon ate every last bit. I did not finish my meal as I was stuffed. Both meals were large size portions. Oh and the server was so attentive that every time a beverage was empty he was there replacing it with a full 1"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toa1NqRTVlbGh3Tm5kbFVGUkJabUZ5WDNkRWVGRRAB",
            "text": "Russo’s On The Bay is in a class of its own! From the moment you arrive, you’re treated like royalty. The venue is absolutely stunning — elegant, timeless, and immaculately maintained. Every detail, from the chandeliers to the waterfront views, adds to the magical atmosphere.\n\nThe service was beyond exceptional. The staff is professional, attentive, and genuinely dedicated to making sure everything runs perfectly. A special shoutout to the entire team for their warmth, efficiency, and commitment to excellence.\n\nAnd the food — wow! Every dish was a masterpiece. From the hors d’oeuvres to the main course and desserts, everything was delicious, beautifully presented, and full of flavor. You can tell they take immense pride in their culinary offerings.\n\nWhether you’re planning a wedding, a special celebration, or just attending as a guest, Russo’s On The Bay delivers a five-star experience on every level. I can’t recommend this venue enough — it’s truly unforgettable!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wM1RsRnpaazVFUlY5YWFHaHlZWFpXYkd0MUxWRRAB",
            "text": "My favorite place for parties!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMGNHVmpURXgxYW1keVRYSllZMDloV2xveWNrRRAB",
            "text": "the staff doesn't know how to behave"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VWFVRnpaMFU1U2pobVRubFNNV3RmV0ZsUlZFRRAB",
            "text": "So I went to the venue as a photographer hired by my boss for his wife’s retirement party, I’ve been to many venues, have been in the room with the biggest names in Manhattan. So would believe how surprised I was that this was most organized I’d ever seen an event! The staff here are truly one of a kind, a lot of them seem to actually enjoy their job. As someone who formerly was a server and bartender I must say I was thoroughly impressed by Ms. Kelly the maitre d and her servers especially Kaylee. Both photographed below. Everything was organized, GORGEOUS, and absolutely perfect! If I had my own hospitality company I’d snatch them up so fast and offer them more money. My expectations were low because of the past but they took it to the moon and back. The men on the team were wonderful and cool as well but the women kept the tempo and that’s what’s truly important. Everything ran smooth. And for Kelly to be a boss I think she actually has a team that likes and respects her. That’s huge! Treat your staff right and they’ll treat the company and those in charge right! Bravo to the entire staff, I will definitely be recommending this venue to others. It’s pricey but WORTH IT! And the catering didn’t taste like crap. Plentiful and delicious. Thank you for hosting us! Also Kelly thank you for making sure I alright and taken care of. Rarely do others think to even grab the photographer and DJ some water! Hope you stayed hydrated as well. Thank you all again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKekVuSkxEM3RMenZnRRAB",
            "text": "Russo's on the Bay is one of the most iconic place in NYC. Every time i come here, i spend at. least one dinner here. It's great for events like marriage or Award Dinners. The food is great and the steak was absolutely ASTONISHING.\nCONGRATULATIONS!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLS1o4YzdwMk9qSG5BRRAB",
            "text": "Just had my wedding at Russo's on May 25th this past Sunday. I would like to send a very big thank you. To Joe V,Priscilla,Kristen, and Theresa. Thank you for your service and for making me and my wife and guest feel like royalty. Many…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodlNuaG5aMFUyY1ZvMWFXOXNTSFpWVWtGc2FGRRAB",
            "text": "From the moment I posted in the Class of 2025 Facebook group back in September 2024, asking if anyone had started planning prom, I had no idea that simple question would lead me to take on the role of organizing the most unforgettable event of our seniors’ lives. With no prior experience in planning something of this scale, I dove in headfirst—completely unaware of the amount of time, effort, and energy it would require. But I can confidently say: every second was worth it.\n\nI began by touring Russo’s On The Bay in Howard Beach, NY—the same stunning venue used by the classes before us. I was immediately greeted by Bert, who has been with Russo’s for over 24 years and is also a proud parent of a Class of 2023 Kellenberg alum. From the very beginning, Bert made me feel supported, informed, and inspired. He introduced me to Suzanna, who walked me through every detail—menus, contracts, upgrades, ideas I hadn’t even thought of. Any questions, any concerns Suzanna was the Russo’s guru who was there for me every step of the way! So accommodating,  so available, whenever I needed her she was there! A complete and utter Godsend! I went in thinking I’d help coordinate a prom. What we ended up with? A full-blown dream event.\n\nFrom that point on, Bert became my guiding light. Through his company, SGE DJ Entertainment, he offered a one-stop shop with everything—DJ, lighting, MC, 360 Photo Booths, canyon blasts, robots, dance floor extras, you name it. And his wife Marcella of dolce couture candy, worked with vendors that SGE fully endorses to provide that one stop Shop benefit! she was an absolute miracle worker. She handled the coordination of the florals, added show-stopping extras (like the 6-foot “PROM 2025” marquee that wowed every guest), and was there for every single detail behind the scenes.\n\nThe night itself? Magic.\nFrom the second guests walked into Russo’s, the energy was electric. The decor was stunning. The music had kids dancing nonstop—not one teen sat at their table for more than a few minutes. The MC kept the crowd engaged from beginning to end, and the entertainment was next level. Kids were on the 360 photo booth, posing with the robots, living their absolute best lives.\n\nAnd Russo’s On The Bay? There are no words strong enough. Even Mr. Russo himself came in and designed our sit down plate with his top chef, Jeffrey Nathan, it  was nothing short of absolute perfection! The food—from cocktail hour to sit-down dinner to the out-of-this-world Venetian hour—was phenomenal. Guests were blown away. The service was impeccable, but the real MVP? CHRISTINA, our maître d’. She was everywhere—making sure the flow of the night was flawless, that every kid was where they needed to be, fed, safe, and happy. Her attention to detail and calm leadership made all the difference. She was, hands down, a superhero in heels.\n\nWhat began as a simple plan to “put together prom” turned into one of the most extraordinary events I’ve ever been part of. With nearly 600 students in formal wear, I was naturally nervous—but the team at Russo’s, SGE, and Dolce Couture Candy completely exceeded every expectation and made the entire nine-month process not only smooth, but truly enjoyable.\n\nIf you’re looking for the perfect venue with unmatched service from start to finish, food, and staff who know how to throw an unforgettable event—not just for adults, but for teenagers—look no further than Russo’s On The Bay. And if you want a team that will make your vision a realistic dream that couldn’t have even imagined and guide you every step of the way? SGE DJ Entertainment and Dolce Couture Candy are the only way to go!\n\nFrom the bottom of my heart, thank you to Mr. Russo, Bert, Marcella, Suzanna, Christina, and the entire team at Russo’s,  SGE and Dolce couture… You made Prom 2025 everything and more. I will never forget it—and neither will our kids.\n\nWith endless gratitude,\nElaine K.\nProm Chair, Kellenberg Memorial High School Class of 2025"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNDd2OW93RRAB",
            "text": "Always such a great time at the annual Breakfast for parents of children with special needs event hosted by My Time Inc. Event was incredible, moving, powerful, and very impactful for everyone. Russo's catering hall is an incredibly beautiful venue that can accommodate and host any form of event needed. It's aesthetic ambiance exemplifies high class luxury and style in many ways. The variety of food and preparations are simply delicious and there's always something for everyone's taste palate and desire. Forgot to take pics of food as I was more focused on enjoying the variety, so maybe next time I'll share pics of food menu. Being by the bay it offers a calming and soothing relief of the sea that adds to its charms and feeling of peace. Every event I've attended here has been nothing short of breathtaking and I always look forward to being there. Thank You to the management and staff for a great place to be and such beautiful, friendly, welcoming, and professional staff. Will be back soon."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLV010LTZXMzlyZVFREAE",
            "text": "Don’t know where to start , the service was beyond beyond amazing , all my guests were very pleased not one cup was empty at the tables during my wedding, the setup was amazing we told Joe vacca aka let’s talk  about it we showed him a sheet how we wanted it and let me tell u it was down to the tea couldn’t be any happier, Mr Frank Russo was in the room thru out the night greeting my guest and making them feel like family , making  sure everything was good .Christina was amazing to work with she helped us in so many ways and helped us in all our needs when needed .this place is hands down the best well recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMN2FIbW1RRRAB",
            "text": "Had an excellent time at a Birthday Banquet as the view of the Cross Bay were cool as it was an elegant evening. The staff for the most part were cool, you always have that one that moves robotic during the cocktail hour but the rest of the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMajhIX3ZRRRAB",
            "text": "Thank you for the awesome service at Russo on the Bay 4/24/24. Joe, your  flexibility and willingness to go above and beyond to make sure everything was taken care of was greatly appreciated. Our wedding wouldn't have been such a success without your help. Everything was perfect and we could not have chosen a better place nor more wonderful people! We just wanted to thank you for making our wedding such a perfect night! Thanks for all of your help leading up to the wedding and for the exceptional service.\n\nJewel & Sean Speller"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvN3FpN0VBEAE",
            "text": "Update (2022-12-16). Management contacted me a couple of weeks ago wanting to discuss my issues. I agreed to talk to them at my next event at the restaurant on December 15, 2022. The event was beautiful, and the food, service, music, and mood were all good. After the event, my wife and I went to the management office to meet with the manager, and there we met with two seriously looking, non-smiling female employees who could not help us find the manager. Therefore, we left.\n\nSo, it seems hospitality at this once very welcoming place is deteriorating.\n\nFinally, we were hoping to attend the holiday party at this place, but our plans have now changed.\n\nUpdate. I am changing my rating review for this place; they now have some of the worst customer service representatives.\n\nI just got off the phone with a customer service representative by the name of Regina to make a reservation for the Thanksgiving Dinner. She was very argumentative and unaccommodating. I am shocked and surprised that a big restaurant like Russo's on the Bay hires individuals who interact with the public and lacks good public relations skills.\n\nThis call was preceded by two other calls initiated by the restaurant asking if I was interested in coming to their annual Thanksgiving dinner event. They are looking for customers but do not know how to treat them properly.\n\nMy previous review is below:\n\nThis is a great venue for corporate and personal events. It a huge place easily accessible by public and private transportation. If driving, the place provides convenient valet parking. I have been to many events at this place and have never been disappointed. The view of the bay is gorgeous, the food is always good, the drinks are always mixed well, and service is phenomenal. Their internal decoration and corridors designs are really are really attractive. The place is perfect for wedding ceremony and receptions. They got, I love this, a gazebo on the water and plenty of garden space for great portrait photography.\n\nFor all the years I went there, I never had an issue with the staff or  anything at all broken down like elevator etc.\n\nAll in all, it is a fantastic place to hold or attend an event or even just have a drink at there bar."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRb2F5RzNnRRAB",
            "text": "🚨PSA: If You Haven’t Been to Russo’s on the Bay, Are You Even Living?! 🚨\n\nListen, I’m not here to sugarcoat things—I’m here to tell you that Russo’s on the Bay is THAT girl. Period. Our social service agency has been gracing this establishment for over a decade—I’m talking so many events, I’ve lost count. But last night? LAST. NIGHT. Hit different.\n\nWhy? One word: Sophia (she spelled it differently. Safiya I believe).\n\nWhen I tell you this young lady understood the assignment, I mean she aced the exam, got extra credit, and was probably the teacher’s pet too. Our population consists of individuals with intellectual disabilities, meaning they require a different level of attentiveness, care, and patience. And let’s be real—not everyone is up for the task. But Sophia? She stepped up like a queen claiming her throne—smiling, engaging, and treating everyone at our table like an individual. No rushed “What do you want?” energy. No exasperated sighs. Just genuine hospitality. She took drink orders like she was serving at the Ritz and brought back each one with grace and poise (because let’s be honest, some servers bring your drinks back like they’re mad at you). From start to finish, she delivered service smoother than a luxury car ride—and baby, that cappuccino she made? Life-changing.\n\nNow, let’s talk about Russo’s itself. Because if you think this is just a banquet hall, think again.\n\nFirst of all, shoutout to the staff who immediately let us know about the different bathroom options. Inclusivity? We love to see it. The Saint Patrick’s Day celebration was giving everything it was supposed to give—hats, funny glasses, the whole festive vibe. And then—THE FOOD.\n\n🔥 If you don’t get the penne a la vodka, are you okay?! This dish is a crowd favorite for a reason, and last night, we went back for seconds, thirds, and if I had no shame, maybe even fourths. We opted for a buffet-style meal, and let me tell you—bless whoever made that decision. Unlimited access to penne a la vodka should be a human right. Also, the calamari? Chefs kiss. Didn’t have it this time, but I’ve had it before, and it slaps every time.\n\nAnd let’s not forget the valet service. Some places act brand new when they see an accessible vehicle, but not Russo’s. They handled our agency’s specially equipped vans like pros.\n\nAt the end of the night, my individuals walked away saying this was the best event they’ve ever attended at Russo’s. And that’s saying something because we practically have a frequent flyer membership here.\n\nIf you’re looking for white-glove service, next-level hospitality, and food that makes you wanna write a love letter—book Russo’s. And if you’re lucky enough to get Sophia at your table? Consider your night MADE."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyd2NINndRRRAB",
            "text": "We were their for a retirement party. Beautiful building, location perfect. Staff amazing friendly & helpful. Food delicious. Drinks on point.  One special room for cocktail hour and another room for dinner and event, both equally…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPTFQtcXZyNll1S3JnRRAB",
            "text": "I went there for a captains retirement.. It was so classy. The food was amazing.. The open bar was amazing as well. Lastly, the workers were so professional and friendly. An establishment isn't successful without their workers. If your…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2ZzRuT253RRAB",
            "text": "Beautiful place for private parties. Every year my work company celebrates the Christmas party, it is very cozy and spacious, the delicious meals, the dance floor is great. I recommend you if you are going to celebrate any activity"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aHZ2R09nEAE",
            "text": "Was there for a retirement party along with 320 other guest.  Food was delicious.  Staff was attentive.  The aucustics in the room were great.  The bar tenders gave generous pours.  The scenary was beautiful and the vale parking ran like a fine tuned machine. A great time was had by all."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPLXZrcURmdTY3UkN3EAE",
            "text": "Been here before and it still remains the high point against which all others are measured. Around 400 at this event and everything moved smoothly and professionally and elegantly. The good during the cocktail hour was breath taking and we…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKS0p3dFhWMjkzUnBBRRAB",
            "text": "We recently had our wedding at Russo’s On The Bay, and it was truly the most magical and unforgettable day of our lives. From the moment we toured the venue, we knew we were in good hands — and Russo’s exceeded every expectation we had.\n\nFirst and foremost, the venue itself is stunning. Located right on the water in Howard Beach, it offers an elegant and romantic setting with gorgeous views, especially at sunset. The indoor spaces are just as impressive — from the luxurious bridal suite to the crystal chandeliers and beautifully maintained ballrooms, everything radiates class and sophistication.\n\nBut what really sets Russo’s apart is the service. The staff was impeccable. Joe Vacca was relentless on making sure us and our guests had a great time. Our maître d’ and bridal attendant were incredibly attentive, making sure everything ran smoothly and that we felt relaxed and pampered the entire day. Every detail was executed perfectly — from the timing of the ceremony to the flow of the reception.\n\nThe food was outstanding. The cocktail hour was nothing short of legendary. Our guests are still raving about the variety, quality, and sheer abundance of options, The dinner was equally delicious and beautifully plated. Russo’s doesn’t just serve a meal — they create an experience.\n\nPlanning with Russo’s was also seamless. Jennifer was professional, responsive, and incredibly helpful throughout the entire process. We felt supported and heard from day one, and that made all the difference.\n\nIf you're looking for a venue that combines elegance, world-class service, and amazing food, Russo’s On The Bay is it. They helped make our wedding day absolutely perfect, and we’re so grateful for the memories they helped us create.\n\nHighly, highly recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MHV2VGtBRRAB",
            "text": "Dropped in for a work function.  The event was amazing all around from start to finish. The place has been around for ages and is still numero uno !! The catering hall is breathtaking with a beautiful atmosphere. During the the cocktail…"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyck5tTWRREAE",
            "text": "Bellissima location, elegante e finemente arredata. Ottima Organizzazione.\nOttimo cibo e personale molto gentile."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPUGQxNUM4eEl6Tmd3RRAB",
            "text": "I went for Mother's day pre fix party and it was great.  5his is the only place I would go on mother's day"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdDhpRXhBRRAB",
            "text": "Modern, luxurious, and upscale catering hall. An absolutely beautiful and stunning location to have whatever social event you're hosting. Do you need or want valet parking? Yeah, they do that. Everything you need from bar to waiter services. Top shelf white glove service. They even have a bathroom attendant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbnhxc1RWNmYtU1BnEAE",
            "text": "My wife and I just had our wedding at Russo’s On The Bay, and it was by far and away the best day of our lives.\n\nA beautiful venue on the water, the Russo's team makes sure all are left with nothing but smiles, great memories...and full stomachs.\nWhen we first went venue shopping... Russo's stood above the rest, their team and Mr. Russo himself showed a care for us as we were not just another customer/event for them...but truly wanted to know us and our story, and it was a no brainer for us to have our wedding here.\n\nThe staff and service of this venue is the best in the business. and their team and management is why Russo's has been incredible for decades.\n\nMr. Russo, Joe Vacca, Priscilla, and the entire staff were on top of everything  to make sure us and our guests....and our entire wedding experience was flawless from start to finish!\nThe food is the greatest, the quantity and quality of it has had our guests reaching out to us nonstop to talk about how much they loved it.\n\nIf you are looking for the perfect wedding venue, this is it!\nThank you all!\n\nLove,\nThe Ianniello's 05/23/2025"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDd3BIRGVBEAE",
            "text": "I am a wedding photographer and had the priviledge to photograph a bridal shower at Russos on the Bay NEW tented and paved gardens with water front views. The staf is absolutely amazing people and so attentive to even vendors and the guests…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBc19PME5BEAE",
            "text": "I attended Russo's for my uncle's wedding and was very impressed by the facilities. The food was great, the scenery in the different rooms was elegant. The only complaint would be that the reception area was freezing and the staff advised…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3LUtfYi13RRAB",
            "text": "Calming and Beautiful Atmosphere! The staff was friendly and courteous."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNk9qcnJRRRAB",
            "text": "Words cannot describe the amazing experience, I had capturing Byron and Philipa's Wedding Reception at Russo's On the Bay. (Digital Illusions Photos)\nLove the outdoor photos... it blows my mind, every time I look at them."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaFptQmt3RRAB",
            "text": "Nice place for the wedding, I ben her second time,  in last couple of years and avery time I'm impressed with the place. Food is very good and is so much you will not be living the place  hungry 😋…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4d1pMalJnEAE",
            "text": "Have been going here for years, so many great parties Valentine's dinner, Mardi gras, Mother's day, Father's Day, New Years always a fabulous time, no complaints the staff is always GREAT and Mr. Russo is always there to greet his guests and make sure your having a good time he makes you feel like your in his own home."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLN0sxT3VQdHVmNDBRRRAB",
            "text": "I love Russo's On the Bay. Music was on point. ✔️ Food was on point. ✔️ The scenery was on point. ✔️ I have been there about 5 times now and enjoyed myself every time..."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJcktldnZBRRAB",
            "text": "We went there for my son's wedding day,  have been to russo's for several functions. Always a great time the staff is friendly and professional. The cocktail hour was awesome starting with an open bar, buffet that had to much to mention…"
        }
    ],
    "reviews_count": 59
}