{
    "name": "Arepalicious",
    "place_id": "ChIJVVVlH4pdwokRC7c1qB7qO8Y",
    "grid": "QN10",
    "address": "137-20 Cross Bay Blvd, Ozone Park, NY 11417, USA",
    "rating": 4,
    "user_ratings_total": 1027,
    "phone_number": "(718) 480-6049",
    "reviews": [
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWFJGcFFhbU41VFd0M09IbzRSRFJxWW5BNGVuYxAB",
            "text": "La cazuela de frijol con chicharrón es un 10/10, y la arepa wow, por fin un restaurante donde no dan la típica arepa blanca insípida  ✔️"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeVgwZG9SV2w1ZDFsZk5tVlVSa0ZRUTBSblFtYxAB",
            "text": "La comida, es muy buena, pero la atencion al cliente no fue la mejor.... un camarero con pesima actitud... le pregunte si me podia cambiar la porción de Yucatan frita por papas hervidas y de una forma despota, me dijo que no se podia que si lo Cambiaba era extra... sin embargo he ido varias veces y si me lk han cambiado...."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRelRWWmZURlE1V2pWTlYzUXRTRmRVVFRoQ1lWRRAB",
            "text": "Good food, good service."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eU1UaEJUVXBoZGpoVlRYTTVUVGRQWjNSVlNtYxAB",
            "text": "Excelente comida y la atención del joven de los aretes,  fue excelente el mejor mesero que me ha atendido allí y en otro lugar, volveré mil veces. Ojalá coincida con este chico.\nRecomiendo este lugar y a este mesero 100%"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNVYzSnVObXhOVHpOdmEyUkhiRkYxWVhSMk9HYxAB",
            "text": "Excelente comida, muy deliciosa lo juro, para chuparse los dedos, me gusto mucho el ambiente y su decoración muy bonita, la atención al cliente excelente en general y la del chico alto con aretes muy excelentes, me atendió super bien muy simpático amable y servicial en lo que necesitaba 10/10👌🍛\nSúper recomendable este lugar para un buen almuerzo o simplemente comidilla de tarde✅"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTWFWQTVZVm8zWkRjNVNVVXlTRGhDUkhsbldVRRAB",
            "text": "La atención al cliente ES SUPER HIPER MALAAAA, LOS MESEROS NO SIRVEN, SON MAL EDUCADOS, YO  CREO QUE ESOS MESEROS LOS SACARON DE TEMU, NO VOY MAS NUNCA A ESE SITIO,NO MAL GASTO NI $1 MAS EN ESE LUGAR......."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUE5tVnljMHRQYURCbVlsaFhjRmM1TTE5dGNYYxAB",
            "text": "Amazing food, friendly staff. Highly recommend this place you want to try some traditional Colombian food"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRU9XRjBOWGhtWmxCV1pGOUhaM0UxTFhsS00wRRAB",
            "text": "I love the quality of the food, is fresh and delicious. But the service sucks, when I walked in on a Sunday none of the servers sat me down I had to asked the cashier if I could have a table for 1 ( there were only 3 tables ) I sat, one of the server gave a tablet and walked away. I waited about 10 minutes until someone from the kitchen asked if I ordered already I answered no then a server took my order. Then a different server brought my order, he was about to walked away, I looked at him, he looked at me and asked if I needed something else. I looked at him and looked at my plate trying to hint that I didn’t have any silverware. He asked me what else then I had to tell him that I needed utensils. Again I like the food. I ate half my dish and I wanted to take the rest. I had to wait more than 20 minutes with my plate half empty for somebody to ask me if I wanted the check."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWWRIcEZUWHBpYmtWUk9WUlNNME00VTFOTmQzYxAB",
            "text": "I haven't went inside, but I did notice that young people do eat at this Restaurant/Cafe. It always well kept on the outside when I'm walking by. I guess after this quick survey I'll stop in soon."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeGMza3ROMG80YW1WUk1UWnBiMWg2YVU5SlFsRRAB",
            "text": "Siempre vengo acá porque amo la comida pero cada día el servicio es más malo, los meseros no hacen su trabajo correctamente, necesitan definitivamente mejorar su servicio hacia el cliente para que puedan esperar recibir una buena propina… llegue el mesero me vio entrar no dijo buenos días ni bienvenidos, dure sentado unos 4 minutos a esperar si me traía un menú y no lo hizo tuve que parar a decirle que me traiga menú, luego de eso quise ordenar desayuno porque como mucha gente me despierto al medio día y pensé que había aún algo mas ligero para comer, me dijo que la supervisora no le gusta que después del medio día sirvieran desayuno, duró mas de 15 minutos en traerme un agua y un jugo de naranja que por cierto comenzó hacer el jugo 20 minutos después de ordenarlo, y solo había 3 mesas, honestamente no tiene sentido, tener comida tan buena y que el servicio sea una basura. Tengo 8 años trabajando en hospitality me encanta y odio colocar un review pero creo que se lo merece, no le quito créditos al lugar y la comida siguen siendo de muy buena calidad, pero el servicio apesta cada día mas hay que poner cartas en el asunto."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOQ2RYTlJUV1pqT0ZoVGFuTXdVVVJ1TFUxblQyYxAB",
            "text": "Orrible la atención los meseros simples y lo más feo me dieron un arroz con sabor a trapo de cocina los plátanos sabían viejo y salada la sopa que me tomé 🥱😣😣no vuelvo a ese orrible lugar menos lo recomiendo les gusta solo robar el dinero soy colombiana y que pena ese lugar no me representa 😡"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRE1sYzRla2t5TUZnd1EzRjNSM1ZyTkROM1ZWRRAB",
            "text": "Mal servicio"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbWRHUnRUa1JYYldKWVNraFplQzFOT1RGc1VHYxAB",
            "text": "hoy fuimos a comer y los tres meseros que habían pésima atención , el que estaba fuera perdido con tres mesas olvidándose todo como tres veces , el chico que estaba dentro haciendo tiempo y pasando de todo y lo peor la chica que cobraba súper soberbia maleducada y altanera viendo su compañero perdido y no es capaz de ayudarle , le pedimos algo nos miró y se fue como si fuéramos inexistentes  con una actitud  horrible y totalmente desegradable solo preocupada por cobrar más nada pésimo servio el de hoy a comparación de otros meseros nada que ver con otros días ,"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRmNXWlNiSHBxVjIxTU15MVlNR2syZVZoVmIyYxAB",
            "text": "The food was absolutely fantastic, workers were ok and the atmosphere was a bit dull and boring."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoV1REVlZjRGRtU0RsMk5HOURRV1JZV1ZOdVZYYxAB",
            "text": "I have been going to Arepalicious for about 3 years now. The food has been consistently good. Obviously not everything is going to be everyone’s platter here but I can attest to their consistency when it comes to general quality of food. Eating in person is certainly a better experience than just taking the food home. The Grilled Chicken Sandwich has been my go to. It has been consistently good. The staff is very nice and friendly over the years regardless of the time of the day or how busy it is(They do get really busy sometimes). Other than the Grilled Chicken Sandwich I would recommend the Beef Empanada, Coconut Lemonade and Shrimp Arepacone."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxM0xVNVNZemh3ZFZaV0xUQndTSFJRWkRCSWRtYxAB",
            "text": "Muy buenos los panes y el Café, excelente atención y muy buen ambiente, recomiendo para desayunar."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNGFqaERRVkpGZEZWSlFVSnJSbUZJVUVoQ1VuYxAB",
            "text": "Ive known this place for a while.\nService was pretty slow and platters come out randomly. In a party of four two of us got served then the third platter came out 7 minutes after and the last platter finally came about 13 minutes later. We got served by a lady and she is great no complaints about her one bit.\n\nTheir food is good but not excellent. Example is the chicharron it used to be meaty but I find they are serving the cuts with less meat. Steak was decent just needed a pinch of salt and pepper but it’s actually a good thing they serve it like this so you can add S/P to your taste. Salmon salad definitely needs work, the Salmon looked boiled not baked.\n\nPricing seems to be expensive if I compared it to say the restaurant “Tajadas” On Jamaica ave. But given today’s economy it is what it is.\n\nOverall I think they should do an overhaul of its menu, serving amounts and food quality check in some things. Service from the kitchen definitely needs improvement. The restaurant wasnt full and food takes forever to come out, cant imagine if it were packed.\n\nLast thing and this is nitpicking, the music the music the music… reguetton why? Horrible choice of music for a restaurant. Play some light indie music to soothe out the atmosphere. Also take into account Salsa music is player and some of the diners, are not Latin so this is why i suggest light Indie music."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWFFWUlNSakp0ZG05VlprbGZORFZNT1dSeU5GRRAB",
            "text": "I like to come here but services is not the best,phone calls are the worst nightmare they need more personal and this will be 10/ 10"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NGRxWWtRRRAB",
            "text": "Went twice because food was fresh and tasty.  Want something different go there."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcmNFMU1OVGgwY3paRFFubDVZVkIyWmxod2JFRRAB",
            "text": "La comida deliciosa, la atención, el lugar muy limpio, la música muy top!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbFdqWklPR1JMY2paZlVrOTFibnA2Y0RWRmJtYxAB",
            "text": "It's okay"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMllqUkVUMjVNT0dvMlFYaEtOMHRHZVRObVFWRRAB",
            "text": "Arepas was trash"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQmRFeGxWbmRUVEhGb2JHdFhaekJCYkdWYVExRRAB",
            "text": "I came here with me and my family for breakfast. The service was horrible. We wanted to order breakfast but they said that they didn’t serve breakfast after 12 pm, that’s fine but the issue is how are you gonna say that but serve other guests that came AFTER US what we were told no to. The waiter was just as confused to why the other guests were served breakfast. Then they got our order wrong after they took it we waited 20 more minutes for them to get the correct one and we didn’t get our hot chocolate for more then 30 minutes after we got our food. When we asked for a manager they said they’re not here yet. Great. So no solution to fix this horrible experience. Will definitely NOT BE COMING BACK. Mind you as we walked out other customers were also complaining about their long wait on their food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTGNFTm5SRXBsV1VsTlEyNHliR2QwU0RSZlRFRRAB",
            "text": "Delicious arepas, test different than other colombian restaurants 😋"
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkN09QSHZnRRAB",
            "text": "Deliciosa la comida"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbmJtSk5XVzE0ZVhsT1dsTnJPV1Y2ZG01b2NrRRAB",
            "text": "Imagine being so cheap that you give customers just two sauces for 4 empanadas and an arepa cone even though they requested more? And then you lie about the amount of sauces given🤦‍♂️\nPlus the food to go was almost 40 minutes late. Plus despite that the order being late, the food was actually sitting there the whole time. The food tastes good at least."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObVEyNTVWVGxsWVZGZlZIWkdZWHBWWWxodFlrRRAB",
            "text": "I have only tried the empandas, they were delicious. Absolutely recommend it 👌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTVlVNVlkelpqTjB4MFRIcGpWRVUyZVU5SlMwRRAB",
            "text": "Hands down one of the worst experiences. I’ve explained my order throughly I expressed that I wanted my mango smoothie with milk not water. I’ve repeated my self 3x and I proceed to get a mango smoothie with water. I try calling the male waiter, proceeded to get ignored and he’s just on his phone or sitting down. Completely unprofessional, or he may be slightly deaf, no clue 🤷‍♂️. Food was somewhat decent but the service completely ruined it. They struggle with English and cannot comprehend simple requests even when speaking spanish. Not coming back here. I forgot to mention I try going there a second time. They didn’t even wanna serve us. As soon as I saw the guy approaching us ready to take our order. I just left.Don’t recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKblpuRnZYMUZXWW1WUWFXOXRZa3hMTUZjeVoyYxAB",
            "text": "Irá a really Good option of you like the colombian food really Good flavors, nice quality of the ingredients, totally recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aWRVVkljRWhETUdwblFXSlJWM1pETUVWMWRHYxAB",
            "text": "Empanadas are flavorful and delicious, sauces were good too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbGNHc3lka1JOVEhaWVluaFVjSGhXVlMxNmRuYxAB",
            "text": "I can only rate the food, for I ordered it to be delivered. I ordered the chicken empanda, it was very flavorful and tasty. The only downside was it was very greasy. I also ordered the guava and cheese which was filled to the rim which was really good. The arepa with chicharron I ordered was ok. I never had one before therefore I was taken back how sweet it was. I would visit the establishment to try the  arepas again, because having them delivered did not do it justice. It was cold and the chicharron wasn't that crunchy."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KalJVdHpNV3Q1TXpKbVNVWmZlblZvZWxKcFVWRRAB",
            "text": "La comida me parece muy rica pero el servicio de meseros no es el mejor, hay pocos meseros y el.servicio a la mesa es demorado."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVVQxVnVOVWMzVEdKWFNYTXhWV041Vm14NGIwRRAB",
            "text": "Muy mala la atención últimamente, meseros distraídos que nunca están pendientes de los clientes . Rica la comida pero MUY MALA LA ATENCIÓN así no vuelve nadie 👎👎"
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZcnJUbWlRRRAB",
            "text": "Me encanta la comida la recomiendo"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZk0wTnZPR1JUYkhGclVXRllWMUJ6UVdFNVRsRRAB",
            "text": "Deberían darles pena vender algo que no es ofrecen un producto y llega otro por una ensalada de frutas de 14 dólares y nos traen una crema batida sin nada la verdad que me siento estafada 😡😡"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSE9YcFdiRWxRY2tZdGFFZFdSMFZwU0c5SGMwRRAB",
            "text": "Wonderful spot with a great selection of food. The service was prompt and the portions were good.  I will definitely be returning soon."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnd1ZqTnphbkEwV0dGZlFVbG1Razl6TTJaYVJIYxAB",
            "text": "La comida, el servicio, todo de este lugar es delicioso e increíble! No me canso de venir una y otra vez acá, todo es delicioso!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeVlqVjZXR000YTFGc2NETkVVbkEwVVhkcE1VRRAB",
            "text": "Very nice people"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYVN6QjVNVjgxZGw5R2NEWkhZVUp0VFZVMlFuYxAB",
            "text": "Pésimo servicio,  estuve esperando un plato más de 30 minutos, habían 5 clientes en total,  les dije que por favor me empacaran el plato para llevar y no lo tenían ordenado, me había comido una empanada maluca y cara, ni disculpas piden, que mala imagen."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dVdrNXBYMDQ0VUVwaWFrbzFYMjVVTkZOR2RVRRAB",
            "text": "Colombian cuisine, great taste and service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMN05pZHV5eFp5UVF3EAE",
            "text": "The appetizer w/ plantains very good! The Bandeja not so much. Steak didn't have much flavor and very fatty. Service was mid none of the two male waiters asked if we wanted water? When I tried to get pastries the 2 lovely girls were super busy on the phone and the other packing Togo orders to acknowledge so we just left very rude! Maybe my coupon was the wrong color?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3emVuQzFRRRAB",
            "text": "Beautiful restaurant, well decorated and nice atmosphere 👌 The food took some time to come and it wasn't bad, but it didn't amaze me to be honest. Probably they should season the food a bit more. The service was great! The two young buys who served us were super polite and helpful all the time. The prices were reasonable as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsMjRTOE1nEAE",
            "text": "This was me & my boyfriend’s second time eating at Arepalicious & we loved it. The food is always flavorful & fresh. The waiters are very nice & attentive, always asking how are things and if your food is good. Our experience was great and I would recommend this restaurant for a date idea as the atmosphere was nice too.\n\nI recommend the grilled chicken with rice & beans and the arepalicious burger.\n\nThanks Arepalicious 🫶🏼"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NV83a1BnEAE",
            "text": "Small restaurant with limited seating, the menu has a wide variety of options, I highly recommend the loaded steak fries, think homemade crispy French fries with guacamole, steak, cheese!! That was so delicious!!! The breakfast platter can be shared and the coffee is delicious. The parking lot is crowded. Not pricey for the amount of food. The waitress wasn’t really checking up on us but the vibe is more of a cafe than a restaurant so that may be the reason. They were doing quite a lot of takeout. I would recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMaTlULUh3EAE",
            "text": "It was a really nice place. Food was good. My kid did not like that the mozzarella sticks did not have cheese inside. Also the chicharron has to be well done. Lemonade was good.  Parking is very convenient at the rear of the restaurant and free."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MUpyb2d3RRAB",
            "text": "I’m sooo happy that we stopped by. I love me some Colombian food. I’m not bias but it’s just the absolute best. My family and I came in and we absolutely loved it. Every dish was spot on. The service was perfection and very attentive. I will definitely be coming back again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZLTllZjdRRRAB",
            "text": "This is definitely a hidden gem!\nI had the Arepa sampler and the cono with a passion fruit juice.\nMy friend has the Arepa de chicharron and a hot dog with an apple soda. The food was delicious! We were stuffed and all we had were appetizers!\nI could eat 10 of the mini arepas and never have enough. They’re soft and gooey on the inside with just the right amount of sauce and toppings.  The service could get better as our server never checked on us. But, the flavor is SO there! The place is also very clean and presentation is a big thing to me so I definitely appreciate the time they take to make sure the food is presentable.\nI could come here everyday and never get tired of it. Too bad I gain weight by just looking at food 😩"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNXRiOGhnRRAB",
            "text": "This location has earned the 🏆 for the BEST arepas in my book. Not only are their arepas good, every other thing I have ordered was perfect too.\nThese arepas will leave you wanting more and more.\n\nThey are a bit pricey, so please be aware when ordering. Their menu does NOT have any prices.\nI spent about $65 on three arepas and a soup.\n\nCustomer service was alright, my waiter could’ve been a little more attentive, but its okay."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVFJGZGFVMWxwUTI0M2IwMUhRbkZwZVdab1gyYxAB",
            "text": "Decepcionado, tener en consideración el sabor de las carnes a la parrilla, estaba amarga, quizas no lavaron la parrilla antes de asar, deben chequear eso, la sazón de sus carnes, en cuanto a hamburguesas, son las mejores, pero las carnes, no recomiendo."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMya003WXpRRRAB",
            "text": "Great authentic food.  Best Sancocho soup I ever had.  Food takes long to arrive to the table but it arrives fresh and hot.. So worth the wait!  The staff are amazing. So polite and courteous.  Denise was our server and she made sure we had everything we needed.  She stopped by our table a few times.  I’ll be back really soon..Buen Provecho!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKckxIXzZ3RRAB",
            "text": "We found this place on Groupon so decided to check it out as we have been chasing the taste of this amazing arepa we had in England, but so far, no luck. Anyway,\n\nArepalicious was delicious.  A pleasant young man, Juan, was our server.\n\nThere's a step and repeat wall when you walk in, so you can take adorable photos there.\n\nWe started with empanadas, which I didn't get to take a photo of because I was so hungry (fasting) and forgot. It was small, but tasty and the too sauces were perfect, but they only gave two tiny ones for the two empanadas which wasn't even enough for one empanada.\n\nThe arepa cones are a nice touch for a fairly neat way to eat your arepa and presentation.  They were well seasoned but could be served with a little more sauce one the side as the sauce it comes with only sits at the top.  We also added an order of Maduro (fried sweet plantains).\n\nOur juices were tasty, coconut lemonade is very acidic. Lime and coconut isn't a usual mix, so I was curious. My stomach cramped at first, which scared me lol,  but it adjusted. If you like sweeter drinks, then the passionfruit (w/ water) was exactly that.\nEnjoy!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeFlXbzVPREZpVG1aTk9VOWtkRzUwY21OcmMxRRAB",
            "text": "Bought a family size meal the french fries was super soggy. The chicken was cold. The only thing good was the rice and the beans not even the dessert was good it was a great waste of money never again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUOHRqX2hBRRAB",
            "text": "Ordered one arepa carne asada, chicharron, and guac ($16.64), one arepa chicharron and chorizo ($14.56), one arepa Hawaiiana ($12.48) and a blackberry (mora) juice ($5.72) all to go. The food took about 20min to prepare. For the price I felt the arepas were very small (could also be thicker) and would have had more meat. You'll notice in picture the arepa with chicharron and chorizo had the guac with should've been for the carne asada. Lapse of attention to detail. I think the juice cup was 12oz. Overall the food had good taste (Hawaiian I'm confident the pineapples were canned). My drink was last to be given which could have been given before food was handed over.  Staff could keep floor cleaner as there was some debris. Music was native for nostalgia and decent volume. I'd rather go into Corona for stuffed large arepas at a lesser price. Gentleman who took my order was friendly. If I were to go back I'd check out a full entree for total quality experience. Parking in rear is a plus."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMktESnJRRRAB",
            "text": "I've been visiting this restaurant for a few weeks now, and I really enjoy the food. However, I believe there could be some improvement in the Togo order process. During my last visit, I encountered an issue with one of my orders being incorrect. Unfortunately, when I called to address this, the interaction with the staff member (Javier) was not very positive, and I felt dismissed. While I appreciate the quality of the food, I think enhancing customer service would greatly improve the overall experience. For this reason, I will not be returning."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVbXBHa3RnRRAB",
            "text": "Food was amazingly delicious very fresh nice and clean presentation. Great custumer service it feels like you belong there you definitely have to try the arepa de pollo with avocado. The great thing about this restaurant  is the freshness…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyd082QnR3RRAB",
            "text": "Deliciosa comida 😋, me gustó mucho y en especial el servicio brindado por el joven llamado Nick es muy amable y atento!!!."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbTk4ZmFwZ191elNREAE",
            "text": "¡Qué delicia de comida! Fui a este sitio colombiano y quedé encantada. Pedí una hamburguesa “colombiana” y un maduro con entraña… ¡y wow! Todo estaba espectacular. La carne jugosa, el sabor muy bien logrado y las salsas… brutales, le daban el toque perfecto. Se nota la calidad en cada plato. Súper recomendado si quieres disfrutar de comida con sazón y buena presentación. Definitivamente volveré. 👏🇨🇴🍔🥩"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ajV2ckpBEAE",
            "text": "Excelente lugar súper recomendados la arepacono es espectacular y los postres deliciosos, muy chévere la música colombiana y la atención de FELIPE excelente super recomendado 🫶🏼👏🏼👏🏼👏🏼❤️"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDaDQyYkFnEAE",
            "text": "The food here is delicious! I've tried the chicken and beef arepa cone. I decided to open it up though because all the guac was at the bottom. I ended up evening it out so I could get a bite of every flavor. The Colombian hot dog was so…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6b01EbVR3EAE",
            "text": "This was the best bandeja paisa that we’ve ever had, and I’m Colombian. The beans were extraordinary, the steak was good enough to be the main dish, and nothing was lacking in quality. Exquisite!\n\nThis is definitely a meal that can be shared between two people, it is an unbelievably large portion of delicious food! Sangria is delicious."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNGE3Zy1RRRAB",
            "text": "La comida de este lugar merece un 10/10 pero lamentablemente el servicio es 0/10 súper malo!! fui a comer con mi papá y tuvimos que esperar más de 20 minutos al ver que nadie nos llevaba el menú fui a la registradora a preguntar si era que yo tenía que ordenar en caja el chico me dijo que no k alguien iba a ir atenderme y luego de algunos 15-20 minutos más volví a preguntar si no nos iban a atender y al final el tuvo que salir de la registradora a atendernos. Definitivamente deben de mejorar en ese aspecto!"
        }
    ],
    "reviews_count": 61
}