{
    "name": "Hollis Deli and Grill",
    "place_id": "ChIJByZG1WNhwokR_XErBdLak4A",
    "grid": "QN12",
    "address": "206-02 Hollis Ave, Queens Village, NY 11429, USA",
    "rating": 4.3,
    "user_ratings_total": 1103,
    "phone_number": "(718) 740-5566",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTGVraEZkRFZrVjB0d2VraExNR1o2VjNRd2VtYxAB",
            "text": "Awesome"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tselREZ3pkV1ZIU0ZaVU5XTk5SMGxDY0RGdWNHYxAB",
            "text": "I ordered a turkey sandwich with everything but tomatoes, but it looks like it's missing the lettuce and salt & vinegar in the picture. I'm feeling a bit disappointed since I'm stuck at work eating this sandwich that isn't quite what I expected. 😤"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eGQzTlVVMnhQWmxaSlYySXpVV2RFVVVwTlVWRRAB",
            "text": "Got a sando here that was mind blowing. First time coming in, didn't know what to expect. It's right down the street from my new place. Loved the food, will absolutely come back in the future. I can see why they ahve so many positive reviews here. Would recommend!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjdFUyZDRRVVJxVTNoM1VtcHhUMUZwVkhnMGVWRRAB",
            "text": "The food is always fresh. Their salads are the best 👌🏽"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWc1MwZ3pjbWN4Y0d0cmNYRmxkVFV3U0hOTWRVRRAB",
            "text": "The worst breakfast platter I ever had.\nGrits were old and cold . It’s takes 5 mins to make fresh grits … this was lazy. Eggs tasted like the mixed with powder eggs. Cornbeef was not fresh . Very disappointing. If it’s not packaged and sealed avoid any over the counter food ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBME9Gb3pWRGswWVdaSFpITXdia2hQZWt4Zk5sRRAB",
            "text": "Great 👍🏾"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MGMxbzBjRVpzZG5WSFZWOHpTbEZFU0cxamEyYxAB",
            "text": "This has been my go to for over 30 years and the service and food still delicious 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdmNURnZSbUpXV0dGT0xUSmlORmQ0VUhKUWFrRRAB",
            "text": "So I use to like this deli a lot , I’m a bit agitated as I get the simplest order , and all I ask is to have extra mayo on my sandwich and this isn’t the first time , but it will be the last . Dry sandwich , and the bread isn’t even toasted . Only writing it now as I was gonna eat it on the belt pkwy but decided to wait til I got home . So over it will not get my money any more , if someone else buys that’s with me it’s different . Thanks"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdlpHdEdjMk5RYlZveGRqazJPVGRwTkZWNU9VRRAB",
            "text": "Great Quesadillas!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOXNQbmRBEAE",
            "text": "Nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSVRrbExlWHBYTWtRNVgxQnFiRVpOTTFkRVEzYxAB",
            "text": "Great selection of original deejays electronics"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJanl3Nzc5LWNDRF9nRRAB",
            "text": "I experienced poor customer service recently a customer paid for products that’s were glass. The worker shoved the bag off the counter where the the glass fell out the bag and dropped. When the glass dropped it broke and scattered almost causing the customer to almost get cus and all the liquid that was in the glass got all over the customer all white shoes and the worker did nothing but give attitude as if it was the customer fault . SADDDDDD"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQSEFzTTNucHVTMjVRRRAB",
            "text": "I have been coming to this deli since 8th grade never once had a issue. Up until tonight where a worker was so careless enough to push my bag with my food and glass bottle of sorrel towards me without even handing me the the handles on the bag.   Result of that my sneakers got damaged and the worker felt the need to yell at me. The professionalism is low and I was told nothing could be done."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMlpTODFBRRAB",
            "text": "Hollis Deli makes thee best sandwiches. When I'm in the Q borough. The spot. Yes indeed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMaW40UC1ROXFmMW5RRRAB",
            "text": "One of Queens best delis. The half & half is a must have when you go!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveGJMS2RnEAE",
            "text": "Excellent"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MS0tbXZBRRAB",
            "text": "Really good sandwiches!!!! Its really the best in the hoOd\n\nI moved and when i visit this is my FIRST STOP!  #Shadyville #Queens"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3LVkza2ZBEAE",
            "text": "Food was salty"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbTV6YURBEAE",
            "text": "Food was early 10 out of 10"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBb2FxSEhBEAE",
            "text": "A lot to choose from and a major menu! I recommend this deli"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMklYUGd3RRAB",
            "text": "Every single time I eat from here I don’t know what’s wrong with their meat or this mayo but it makes me extremely nauseous or I throw up…. They need to use better quality meat. I bought a few juices and they were expired. They must do better !!! Also who ever is making the food needs to take their time it’s a deli not a fast food restaurant ! I order cold cut sandwiches and majority of the time the meat is on half the sandwich or not spread out properly.\n\nYall need to do better. I’ve been coming to this deli for a VERY long time and the quality of food just keeps going down hill!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldnUyRjFBRRAB",
            "text": "I had a delicious chicken parmesan sandwich on a hero. Also had a turkey and cheese with everything on it with salami it was delicious also. great place to get a sandwich. A staple of the community."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldTVyNlFBEAE",
            "text": "The BEC was 🔥🔥 & the coffee was good too. Be prepared for a small wait but relatively fast service. They even sell the old school oj cartons I used to drink out of as a kid. BEC is my mom's favorite breakfast sandwich so the whole experience felt nostalgic.…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmak92cnd3RRAB",
            "text": "I was in a mood for a nice NY Sausage egg and cheese and got hot dog egg and cheese instead .. i am so pissed !  it doesn’t even taste good 😣…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OTgzaElBEAE",
            "text": "I found a hair in my Philly cheese literally buss almost the whole thing down ended up opening it to find a long piece of hair inside disgusting"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNzZHUlp3EAE",
            "text": "I asked for a chopped cheese and the burger isn’t even chopped up. Doesn’t even have flavor, too many times I’ve come to Hollis deli and it’s always something they’re doing wrong. This is unacceptable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdWVhd1VBEAE",
            "text": "Worst e worst experience ever the cooks have an attitude and they put aluminum pan inside the microwave, which is cancerous. FAKE BACON FROM DOLLAR TREE"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWX1B2MjlnRRAB",
            "text": "Their breakfast and sandwiches are amazing! Sooo good. Their ice tea/lemonade drink is very refreshing and the guys behind the counter are very friendly and kind too. Love all their options and they give a great portion size. You are definitely getting what you pay for."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNmFUbHNnRRAB",
            "text": "Food is great but they always mess up the order if you order the meat by the pound it’s always short they never give you a full pound of meat Also order One hour in advance still have to wait 20 minutesThey care more about money than…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRN3FfN2VBEAE",
            "text": "This is my favorite corner store I grew up right down the block whenever I come back it's a must that i go they have the best food for breakfast lunch or dinner and many different beverages to choose from"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbXNhSUlREAE",
            "text": "New owners black own the best food in a deli ever"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5czRxYWN3EAE",
            "text": "Their food is pretty good but their customer service is not all that great. They rush you And if your in there for more then five minutes they say order or leave!🤦🏾…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGelliY0VnEAE",
            "text": "Hollis deli has been there for over 40 years and they have always served the community correct!\nKnown for their bacon egg and cheese on a roll everything else on the menu is on point as well except the pancakes they're not the best."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobkllSE5nEAE",
            "text": "I always like to support the businesses in my neighborhood, but I will not be going back to this deli. I’ve bought breakfast sandwiches from here a few times while I’m on the go with no issues. One morning, while I was around 6-7 months pregnant, I decided to order two breakfast sandwiches, which totaled to about $7-$8. When I bit into the sandwich it tasted like cigarettes, I immediately threw up. I thought it was just that my nose was sensitive from the pregnancy-no that wasn’t the case. My boyfriend had to throw out his sandwich as well because his too smelled and tasted like cigarettes. It’s very unfortunate that these businesses in our neighborhoods don’t care about the well being of their customers. I did call Hollis Deli and told them what happen and they advise me to come back and get something else for the same value. Unfortunately, I haven’t returned and don’t plan to return. It’s not about the money-it’s about my health."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaDdXOHJBRRAB",
            "text": "If I could leave zero stats I would worst sandwich spot in Queens ordered a BLT they messed up my order twice then gave me old bacon. Never returning ever"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdTRMN2JBEAE",
            "text": "You can always get it in at the 2$ Hero spot! Great food all day"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eG9MQ1N3EAE",
            "text": "BABBBBYY, I'm over here reminiscing about my youth in NY and I'm talking about THE BEST heros ever. This is it. I've eaten so many sandwiches from here from high school through adulthood, I could explode LOL. This is the breakfast sandwich of champions 💪🏽. My favorite hard salami, egg and cheese on a roll. Yummy 🤤. So happy they are still around. #givingempress 🫶🏽✌🏽"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvdWM3QmZ3EAE",
            "text": "The sandwiches were tasty. I questioned whether they actually toasted my bread. The fries were warm( I walked2 blocks to my destination).The atmosphere was calming, no rowdiness considering  school was over.\nI'd give them a 3.5 for the day."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhNHI2aXVRRRAB",
            "text": "I want to give 2 1/2 stars. Give a half-star for past experience.\n\nMaybe I came on an off night, but was very disappointed in the sandwich I got.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhcHBQY0F3EAE",
            "text": "Huge store with a lot of options to choose from. Service was quick but thorough. My son wanted the Chopped Cheeseburger 🍔. I think he's found a new ❤. When back in town, we'll be back! The spirit of greed took over so no pics this trip!!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSb3ZDLW1BRRAB",
            "text": "I ordered twice from here. First time order a hot honey turkey on a roll, the meat was burnt and I was too far out to go back.\n\nSecond time, they messed up both my orders and continue to burn food. The lady in the back did what she wanted to do and gave me a completely different sandwich. One order was the home fries platter but I ordered french toast. Then I also ordered cold honey turkey on a wrap but they gave me a breakfast sandwich with egg. Not sure what's going on with the communication but I don't think I'm coming back here."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwc01iNDN3RRAB",
            "text": "Horrible store!! Never going here again. Disrespectful workers except for the African American man in the morning and the big man during the day. The man that always wears the same black shirt and sweater is wild disrespectful. My daughter…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOMnRiVjlnRRAB",
            "text": "Ordered a roast beef, it was very salty. You couldn't even taste the roast beef because the salt was so powerful. The meat doesn't taste fresh."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNmIyQWF3EAE",
            "text": "Place used to have really good food. Last couple of times food has been terrible. Chicken like biting into rubber and the philly steak was a little undercooked and way too greasy. Mozzarella sticks were terrible and the marinara sauce looked like it went bad. Steak fries were good."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrNzRXVlBREAE",
            "text": "This place has been around for years and business is still good. If you want some good and fresh food, this is the place. They are most popular for their sandwichs like Bacon Lettuce Tomato, Bacon Egg and Cheese, to custom requests from the…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNDhIRFlBEAE",
            "text": "Chicken over rice.. Excellent...\nWings and fries... Excellent...\nEverything is always fresh because they sell out fast... it’s most times crowded but that’s because they’re so good at what they do..\nAnd they’re clean that’s very important.. Clean, clean, clean, especially when your making my food if you’re not clean I’ll won’t even give you a look and waste my time..\nAll the guys are very courteous and they go above and beyond to make sure you’re happy..\nit’s the only other place I eat from outside of my home..."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZdEtxMTNnRRAB",
            "text": "They don't understand when you order food, they always messing up somebody order.  But they food is good. The store is always clean. They do not sell Pork at all. The store is always packed with people and school kids. Yes, you can park there but watch the sign. Parking is good."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwc2QtWWVnEAE",
            "text": "The food is really good for a corner bodega. My 1 complaint is the wait for the food it can get quite crowded on the weekends and in the morning. That is because the food is really good. It's best to call in your order, so you can minimize your wait time."
        }
    ],
    "reviews_count": 48
}