{
    "name": "Datz Deli",
    "place_id": "ChIJF8bnGFdhwokRY2l-tONBN90",
    "grid": "QN12",
    "address": "190-01 Hollis Ave, Hollis, NY 11423, USA",
    "rating": 4.2,
    "user_ratings_total": 613,
    "phone_number": "(929) 356-3400",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzME1tNTBjRWRLTldWclZFRnNTM2R3VkMwd1NIYxAB",
            "text": "The food is amazing, the best of best and that’s a fact. BEST IN NY!!!!!!!!!\nShout out to SHANTIE for the phenomenal service super welcoming and joyful made the experience one never to forget for sure!!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdVdFRnJTMUZzTVZOTU0wVlRWMlExT1RCcU9FRRAB",
            "text": "The flavor was good but definitely NOT worth $16. As a born and raised Queens girl I was surprised by the Manhattan priced food but I figured it must have a lot of meat and be good. Unfortunately like other reviewers have said I was surprised to see that my sandwich was mostly bread and patty. There was barely any Mac and cheese or meat at all. I think the story behind it is inspiring but come on man- think about the people buying it: they’re also trying to make a living. Maybe the hype has caused to skimp on ingredients but please don’t turn on your fellow NYers."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR2FXUldWVmx5ZFVjeFkzSkxMVTl4YUU5b1kxRRAB",
            "text": "perfection at its finest. came all the way from Miami for this and was worth every moment. service was adorable and worth the comeback just for the cultural refreshment and tune for the islanders lime-ing like that. cool vibes! I think I gotta crush on the host’s hospitality and service style. eitherway keep shining like a rock star doing what you do girl!\n\nshe made the experience like we were at home sweet home but that sauce would have topped the food if there was mo to go with it. lol but the host made up for it!!\n\nbless up yourself G!! Irie"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abU5UZGZabGhhTWxkUGJHTnJXV1J2YldWa1VtYxAB",
            "text": "The best! Love their Mac n cheese and jerk chicken"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSFEybG9XV1Z4Vm05TU4wRldNR2Q2YUhCbmRFRRAB",
            "text": "Overrated viral hype 🚮🗑️ sorry wish I can say the plantain was the best part of the Mac Patty but I never received it 🚯"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaE5GcEJjRTFPVDNCd2NHbElSbW96TjAwNFlsRRAB",
            "text": "Shante was great , she made me a nice patty and it was a wholesome experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seVdVeE9aMU5sU2twbGNERjVjVE5ZVVVWd1NuYxAB",
            "text": "The food here is good — I always get the oxtail patty. I came in today to get my usual order, but the lady taking my order had a nasty attitude. I asked for extra gravy, and she told me there was already gravy inside the patty and on top. I already knew that, but I always ask for extra because depending on who’s serving, they can be light on the gravy at times.\n\nShe then gave me a very small scoop of mac, even though I usually get more. I politely asked for a little extra, and instead of just helping, she got upset, started being sarcastic, and tried to argue with me. I kept saying “ok, no problem,” but then she told me, “I don’t know who did that for you because my brother is the owner,” which was completely unnecessary. And for 20 dollars for a patty it shouldn't be a issue\n\nHer attitude was terrible, and after this experience, I would not support this business again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SblozaEZlVTlQUVhjM1prSm5aQzF6YkRZNGNYYxAB",
            "text": "Tried the oxtail Mac and cheese patty they went viral for. I ordered via Uber eats and to be honest it wasn't worth the hype of seeing people on endless lines when it first came out.  It wasn't bad but it wasn't anything life changing the way folks made it look on social media. My sandwich barely has meat or gravy, it was more bread than anything else. I guess when it was a new novelty it probably was made better but now that the viralness wore off they are skimping on the ingredients. To have people commuting across the country and city for this is bizarre. I live less than 5 minutes from this place btw."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSmJGTkZSWEJEWDFaNWFHbFNORko2TFZoS2RtYxAB",
            "text": "Very nice corner spot. Not much of a dining area or plenty of seating to enjoy if your a big group. Food was amazing, service was awesome. Only thing is it was a bit out of the way, but worth it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTFFtNDNZakJGTWs5NU1tWlZSakF4Y1hoSlZtYxAB",
            "text": "Great customer service!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUWQzSmFjRTU2UjFoak1qSklhVnAyY0dGNVdFRRAB",
            "text": "Guy working closing shift is the best. Brother blessed up a group of Church goers after closing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdVZIbzFZbGxEYjE5bGNuTXhZak5JYVVKV09HYxAB",
            "text": "Best food in the hood\nDef not a cash grab spot, worth every penny and then some!\nTheir food is very intentional\nFresh thyme, bay leaves, actual brown sugar based Stew Chicken 👀\nCurry Chicken 🤯 Pattys 👋🏽🔥Rice and Peas hittin too could use more coconut milk. They flavas be flava’n though facts.. I look forward to trying their Goat next time and see if it goes up against my fav spot in Little Caribbean for Curry Goat. 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVFYwWkJVRVZyTkdOMWVuSkpVMkZFUkRCd1oyYxAB",
            "text": "10/10 best sandwich I’ve tasted in my entire life. They were really nice and great people with an amazing aura to them. I was visiting New York all the way from Ohio and when they heard I was gonna be on the way back they hooked us up just because. The food is seasoned to perfection and you would think all the flavors would be overwhelming but everything pairs perfectly. If I ever come back to New York I will be back for sure. Thank you!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oT1dXZHpkRTQ1V2pCdVZsRnhSa3N3TXpKdFRFRRAB",
            "text": "Preemptive 5 star rating, because I have had people in my nit tight circle tell me nothing but good things about this place. I am a foodie head so I am anxious to go here for food, unfortunately I live far away, and I am still planning a visit here!! Will update after I reach this place of business!! Super excitedd!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNVIwVkhWREl3TjFCNVJYbE5TbXgzWlZaNVFtYxAB",
            "text": "I had the beef patty mac it was juicy 😋 and the  jerk chicken mac patty. Service was good 👍🏼"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UFJVNDVjbTV6UVVwcFQyTkhNVEZrY1VSbGJXYxAB",
            "text": "Total vibe in there. David was a great person. The food in very unique its a modern twist to traditional food. Definitely worth a try!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWGNFd3dZM1V4ZGpoalltSnNMVUZOVFd3d1dFRRAB",
            "text": "Who wouldnt want an a fresh oxtail sandwich.. insanly good and cool people esp David!5 ⭐️, all around. Thank you,"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSblRHVjFOR2hsUVZSb1VUSk9ZMmcxTW1SUWNuYxAB",
            "text": "Portion to price ratio ain't adding up. Its good to try once then thats it. Jerked chicken over rice had 2 cutlets on it.  There staple oxtail macpadddy was solid. But for 18 dollars is ridiculous."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUmNrNHhiM1YxYmtvMVlWVkJSamxaYzB0TFYyYxAB",
            "text": "I rarely leave bad reviews, but this visit was a letdown. The food lacked flavor and seemed like it had been sitting for a while. My dish was lukewarm and under-seasoned, and the portion size didn’t match the price. The service was friendly, but it couldn’t make up for the poor food quality. Needs major improvement. Never going there again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsc1JXbFRkMEZtVjJ4Q1ExOWZTRmxDTWxobFFtYxAB",
            "text": "The food is small bad and I get really sick from eating it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdmRFSlJTeTFWV0hnd04yOXFaVnBTVlhwU2NVRRAB",
            "text": "I’ve never been this sick from food before. A few hours after eating here, I was violently ill with food poisoning—nonstop vomiting, stomach pain, the works. It ruined my whole day and could’ve been dangerous. This should never happen at a place serving the public. I wouldn’t wish that experience on anyone. Never again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSU0wbDNVVzVIWldGNlIwWkJMWGxqVXpGbVduYxAB",
            "text": "Had to try what everyone is talking about. It was good, bread soft and not moist from the oxtail gravy"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjM2JGSkZWRlpUVGt0RGFYVkRNMmhJUVRaRmRFRRAB",
            "text": "A Bold  Comfort Classic Gets a Modern Guyanese Gourmet Twist\n\nIn the ever-evolving landscape of Caribbean culinary innovation, few dishes manage to hit the sweet spot between nostalgia and novelty like this remarkable Guyanese open-face patty stuffed with meat and mac and cheese. A bold reimagining of a beloved street food staple, this dish elevates the traditional meat patty into a gourmet comfort experience that surprises at every bite.\n\nAt first glance, the open-face presentation immediately sets it apart. Rather than being sealed into the familiar half-moon shape, the flaky, golden crust cradles its fillings like a savory tart—showcasing a hearty scoop of creamy mac and cheese nestled beside (or atop) richly seasoned meat. Whether you choose  chicken curry, spicy beef, jerk chicken or pork, oxtail,salt fish or even a plant-based alternative, the protein anchors the dish in bold Caribbean flavor traditions, while the mac and cheese adds a luxuriously indulgent counterpoint.\n\nThe crust retains the signature buttery crispness expected of a well-made Guyanese patty, but its open design gives it a rustic elegance—almost like a West Indian vol-au-vent. The macaroni is smooth and decadent, not overly cheesy or greasy, but balanced enough to complement the spices in the meat without competing with them.\n\nWhat truly elevates this invention is the harmony of textures and temperatures: the crunch of the pastry against the creamy pasta and tender meat creates a layered mouthfeel that's as satisfying as it is comforting. Each bite evokes warmth and familiarity, yet feels entirely new.\n\nThis dish is more than a meal—it’s a celebration of Caribbean ingenuity, where cultural authenticity meets modern-day food creativity. It’s the kind of innovation you’d expect to see at a trendy urban food truck or a forward-thinking fusion restaurant—but still rooted deeply in home-cooked soul.\n\nVerdict: 10/10\nA must-try for anyone who appreciates Caribbean cuisine🇬🇾🇬🇾🇬🇾🇬🇾🇬🇾, comfort food, or imaginative street food done right."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUlowaFpjMnQ2TjJkSGRHcHZTVFV5VFVKUk5YYxAB",
            "text": "Great mac patties that most people come for ... nice to try it . Very nice Guyanese ladies in the front ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kemVrZDZOMGt4WmpSM1pEQlJZMUZ3VTJwT2VtYxAB",
            "text": "The store employee is not 😡\npreparing my order and is going out to smoke a cigarette.🤬"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCak0ySnRSRUZoY205bU9FbHhlbVJ2WjNGVlRXYxAB",
            "text": "It's worth the experience.  I'm definitely going back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNWG54WUtwM043c2F3EAE",
            "text": "Wow Wow Wow!!!! The food was soo good. Also shout out to the owner very down to earth and very kind. Def coming back and will recommend this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdVY2SWl6c3ZpSmJnEAE",
            "text": "Shanti was amazing for my girlfriend and I first time ever coming here. 10/10 asl around. Please give her raise ASAP! ❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJajNzb3pDcDQzNi1RRRAB",
            "text": "Awesome food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNWF2SUdREAE",
            "text": "After Marcus Samuelsson featured this awesome gem💎 on “No Passport” I knew I had to try it!  ANDDDD IT WAS ALLLLLLLLL THAT!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM0t2MDdBRRAB",
            "text": "Closed on a Tuesday"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdDZqX1dBEAE",
            "text": "This isn't how ppl make it sound so good! It was ok! Spice on beef Patty masked the Oxtail tail! Not worth the price or time! But ppl should still try it if they're curious like me with all the hype about it!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcnJlTnFnRRAB",
            "text": "I couldn't wait to take it home to eat white plains Westchester county"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbUl2bEZBEAE",
            "text": "Great people almost forgot i was in a public setting because of there hospitality 10/10 experience would come again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ajlDeklnEAE",
            "text": "Overpriced! Smells like pot"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eHFhR1RnEAE",
            "text": "Really great food!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRN08yQVR3EAE",
            "text": "BELIEVE THE HYPE"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbmI2cGtnRRAB",
            "text": "I just checked out Datz Deli, located on Hollis Avenue in New York. I might have mixed feelings about the experience, but the prices were reasonable for the area, which was a plus considering how expensive some delis can be in NY. However, the food, while decent, didn’t live up to the hype I had seen on Instagram. Many people rave about this place, but I found the dishes to be average.\n\nThe Mac patty sandwich I had, though large and packed with some good meat, lacked the wow factor I was expecting based on all the online praise. The flavors were fine, but nothing about it stood out as extraordinary.\n\nThe wait time was a little longer than expected, which was disappointing, especially considering the relatively low-key atmosphere inside. The restaurant was not overly busy, but it seemed like they were a bit understaffed, causing delays in service. On the plus side, the customer service was great. The staff was friendly, attentive, and made sure we were comfortable while waiting.\n\nParking was another issue—finding a spot was tough, as it’s located in a busy part of town. While the food and overall experience were acceptable, I expected a bit more based on the social media hype. I might return, but I won’t be rushing back anytime soon."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnckpxMGV3EAE",
            "text": "Food was great but a little overrated"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdzdMRzN3RRAB",
            "text": "I had the oxtail mac-patty from this location. My thoughts exactly after taking my first bite were wow, this is different, this is really good. As for taste, it is not spicy. The taste of the cheese from the mac isn't overpowering. And the oxtail meat is super tender and seasoned mildly. The snack is definitely good and worth the experience to try."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc2J6NmhnRRAB",
            "text": "Since we were in the area we decided to check this place out. Typical corner store vibes but serving up some interesting sandwiches. We had one with a beef patty, mac & cheese & oxtail, another with veggie patty (they did not have the chicken patty... bummer!), rice & peas & stew chicken. Both sandwiches were very tasty. We also got a side of rice & peas with oxtail gravy. I did not enjoy that as much but it could just be it was just a bit different than rice & peas I've had in the past. Service was friendly & fast. We will definitely come back next time we're in Hollis. Thank you!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbGVTRjdBRRAB",
            "text": "I read the reviews before I try  a new place. People usually hype up a spot, and I'll say 7 out of 10 times it's not worth the hype. But this spot is all the hype and them some. The beef patty with oxtail and mac n cheese is my favorite. The flavors will give your taste buds an orgasm. you can't go wrong with whatever you get. Don't forget to grab yourself the  natural fountain  drink. I love the lemonade. Delicious. The staff is super friendly. Good people."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQd3NILUZ3EAE",
            "text": "We saw this viral spot online and decided to check it out for the famous Mac patties. It did not disappoint, the Mac patty was delicious. We also tried the salt fish and bake and a locally made peanut punch. We will definitely be visiting again to try the other items on the menu. Street parking is available."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0b0plaFRnEAE",
            "text": "I love food and of course , me being absolutely in love with oxtail , had to try this oxtail beef patty with Mac & Cheese .\n\nFrom the moment I took my first bite, I knew I was in for a treat !\n\nThe oxtail was cooked to perfectly with the meat so tender it practically melted in my mouth. The flavors were rich and savory, with a depth that can only come from slow-cooking but the beef patty is the heart of what holds this beautiful concoction together.\n\nThe curry goat MORE equally impressive( Called the Drake) The meat was incredibly tender, and the curry sauce had just the right amount of heat and spice was so savory ( best I will get the dish with rice and peas) !!!The flavors were well-balanced, also combined with Max & Cheese and sauce that had a perfect blend of aromatic spices that created a joy for my mouth!\n\nI’m short I loved both patty sandwiches but the curry goat was my favorite and next time I can do it with just cheese and no Mac and cheese ! I love the touch of the sweet plantain on the top and that the store is full of different/imported chips , snacks and drinks ; making even more unique of a deli !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaXQtTmFnEAE",
            "text": "The food and customer service were both absolutely amazing! I had the oxtail mac & cheese beef patty on the coco bread and a side of plantains it was served fresh with a smile. I will definitely add on every trip that I visit to New York."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzN1p5LUVBEAE",
            "text": "I knew this place is overhyped... but had to try it. What a disappointment. First of all got food poisoning from spoiled collard greens. Like why!!. Second the mac patty was basic. There was barely any mac and cheese in it. Had curry chicken with rice and peas and the guy gave me 1 piece of chicken and 4 pieces of potato. Third, the owner is rude... it's not my fault that your too cheap to have at least 1 more employee working during lunch time on a workday to answer the phone. I tried calling in an order to pick up and I couldn't hear him and asked him to speak up. He proceeded to say he has a store full of people. I was 5 minutes away... when I got there the store was empty. So fake hype all around and overpriced for sub par food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzd29iSWt3RRAB",
            "text": "I don’t even live too far from this place. I’ve been in there a few times, but never realize it was the same  place with all the hype first time trying their beef patty with plantains And jerk chicken but it was well worth it. The customer service was great atmosphere was cleaned. Thankful"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcHB1MVhnEAE",
            "text": "Oxtail Datmacpatty……it’s so freaking yummy!!!! Can’t wait until one comes to Florida, I’ll drive to Orlando for one of these!! The oxtail is so tender and flavorful and the portion was perfect and the only reason I would order 2 would to be greedy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyOVliYzlRRRAB",
            "text": "I wanted to see what all the hype was about and waited a few months after to visit. Got the beef Mac patty and not going to lie it lives up to the hype and expectations. I was impressed that after all the hype and excitement it still held up well. I recommend it if you’ve never tried it worth it. They also have exotic snacks, drinks, and much more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWaWM3NmdBRRAB",
            "text": "The sandwich wasn’t bad. I heard the hype about it and wanted to try it so I came in on my birthday to try it out for the first time. Ox tail mac and cheese beef patty on a coconut roll with ox juice on top. Great idea. Very messy. The guy did give a lot of napkins though without me even asking which is always nice and definitely necessary in this case! In theory it’s a great sandwich. In reality it was 3 stars. Nothing to write home about. Or maybe that was just a bad day. Who knows?  They also have lots of interesting exotic snacks from different countries around the world. And even some interesting variations of American snacks that you definitely don’t see everywhere."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNW8tR05REAE",
            "text": "Update 8/4/23\nThis time around I purchased the  Jerk Chicken MacPatty with extra sauce!\nThis thing was so flavorful and but I had to save half until later... And even cold this item held flavor and taste.\nLove the relationship between owner and family and mother welcomes everyone walking through the door!\nThis is a gem in the community!\n**This time upon returning I was able to enter this family's owned deli.\nThe owners seem genuinely friendly & concerned with the customers enjoyment.\nThere's a wait time due to the fame of this menu and I can attest that the food is very favorable! Due to how busy this place is the food is also extremely fresh & doesn't last long.\nParking is local streets & difficult but there is a bus stop in front."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacEozWW93RRAB",
            "text": "This is a must try. I came here because it kept popping up on my feed. It really was an amazing experience. The staff was kind and patient even with the overwhelming amount of orders.\n\nThe oxtail and jerk chicken Mac Pattie’s are delicious! An explosion of flavors. This was such a creative idea!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuc0tESFhnEAE",
            "text": "Atmosphere very shady. The street this is on has some shady characters passing through. I stopped here because of the LIRR and the name sounded familiar.\nI walked in and I saw the menu and I thought beef patty with rice and peas sounded good. Thought of picking for me and my friend.\nThen the nice counter guy said they're out of rice and peas then I was like wait a second aren't you those Instagram famous guys he's like yeah I said what is the famous dish he said beef patty coco bread and with oxtail I said bet gimme that. So they didn't take long at all. I took it outside to munch on and charge my phone. I ate half of it and saved the rest for later.. But this was 10/10. I am definitely coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOG9LUVhREAE",
            "text": "The Food deserves the hype it receives. The oxtail beef patty with mac&cheese on cocoa bread 🤤 so good! I also has the saltfish and bake, again another 🤤\n\nThe owners sister was running the show and she was extremely helpful and cool , overall 10/10!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbjRtRTlRRRAB",
            "text": "WOW, JUST WOW. Datz Deli is doing something I've never seen in a bodega. They have this Dat Mac Patty which is a Jamaican beef patty with Mac n cheese (or rice and peas) on Coco bread and this gravy that is just to die for! They also do natural juices like ginger, sorrel and other West Indian favorites. you can also do plates of brown stew chicken, rice and peas, cabbage, etc. it's family owned and everyone is so friendly. I wanted to eat two of those patties!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsc2NIRzVRRRAB",
            "text": "Datz deli has a great creative infusion of Jamaican flavors into small bites. The oxtail was juicy and tender, the Mac and cheese was cheesy and light, and beef patty sandwich in between the bread held everything together very well. We flew in from far away just to try it and I’d gladly do it again.\nDrink, chip and snack section pairs well with any sandwich.\nI didn’t catch the name of the young lady at the register but wanted to thank her for having such an amazing spirit and patience. Great customer service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabG9TWXFRRRAB",
            "text": "Saw this place on tiktok and since I was traveling from Los Angeles I knew I had to stop there. Real Question..was it worth the hype?? YES, it was 100%!! Service was amazing and the food...omg delicious! The patty had great spice level, the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyamVyODNRRRAB",
            "text": "I have wanted to try this place, I might've come too late in the day. The bread was stale and crusty, the guy that served me was less than willing to help me because he didn't want to get off his phone. I chose the jerk chicken and mac & cheese, there's not a lot of mac & cheese in the sandwich, honestly the bread is really ruining it for me, and the dry chicken.  I paid $19 for the sandwich and I did expect more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWbjhDSmpRRRAB",
            "text": "Datz Deli in Queens, NY, is a culinary gem that beautifully blends Caribbean influences into their dishes. We recently tried the DatMacPatty, a veggie patty bursting with the delightful combination of warm mac and cheese, spinach, and cheese, all enveloped in a soft coco bread – a true flavor explosion that exceeded our expectations!\n\nAdditionally, the Drake DatMacPatty, featuring goat curry and baked mac and cheese encased in a Caribbean-styled beef patty, was a taste sensation like no other. The choice of warm cocoa bread elevated the experience, making it a must-try for anyone seeking a unique and delicious dining adventure.\n\nThe ambiance was welcoming, and the staff provided excellent service. Datz Deli has certainly carved its niche in bringing innovative and mouthwatering Caribbean-inspired dishes to Queens. We can't wait to return for more culinary adventures at this fantastic location!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmOGFmRklBEAE",
            "text": "Had the viral patties, and they were extremely delicious! I had the curry goat patty 10/10. My wife had the curry chicken patty, and she said 8/10. My sister had the jerk chicken patty, and she gave it a 9.2/10. Lastly, my sister's boyfriend had the oxtail patty, and he rated it 10/10. Must go if you're in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaZ0w2cUJnEAE",
            "text": "Wow!!! The flavors hit here and the prices are reasonable for what you're getting. This hole in the wall deli is a gem with great food and very friendly workers. The cashier was patient with people and read my order back. The food traveled well as I waited 30 minutes after to eat. I got a Datz Mac Patty with oxtail and no American cheese. I wasn't sure I would like the coco bread with all the extra ingredients but the sweetness really mellows it out. I'm officially a fan and understand the hype of this place. It's nothing complicated but they're taking a few ingredients and combining them in a way that mends! Definitely give Datz Deli a try!\n\nI see people leaving 4 star reviews because the line and how busy it gets. Well, you know they went viral and have many fans looking to try. Ratings should be based off food, customer service, and price. When a line is long you can't expect to be in and out. When the line is short, they're quick. Wait time once you order is around 5 to 10 minutes. Very reasonable.\n\nIf lines are an issue for you I recommend going during your lunch break on a weekday as the crowd is very light. I was in and out within 10 to 15 minutes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNk5peWVREAE",
            "text": "I had the beef patty with American cheese with oxtail topped with Mac and cheese in coco bread drizzled with oxtail gravy!\n\ndatzdeli190 is the new hot spot in Hollis Queens !! 4 months to date, I learned speaking to the owner who was so humble!!! I even meet the “Deli Baby”\n\nThis family owned business changing the game, one patty at a time Not only offering #datmacpatty but they also have exotic flavored deep fried Oreos, and a hot food buffet which I I try every thing! Everything looked fresh & smelled delicious!\nI waited 3 hours and it was worth it!!\n\nI got to see how dedicated this family is with Jennifer checking out customers, Josh making the sandwiches and updating us on the wait time, Bobby and their dad in the kitchen.\n\nYes I know the names because they all told me their names!\nWhen I got to order they was out of the “drake” but I got the Kendra and a wide variety of snacks!\n\nLittle by little as people were coming back from being told the wait time for the fresh batch of food there was already a line forming. I got to see it all be prepped in front of my face and the minute I took a bit of this sandwich It was unlike any other. This family business will be booming! Make sure to be ready to wait in line!!! The prices is great as well!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSOHZMOHRBRRAB",
            "text": "Just stopped by Datz Deli\nto try the food for the first time and I must say the customer service definitely made me feel welcomed and to top it off, the two Mac Patties I ordered with…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyeDRyT1V3EAE",
            "text": "Jamaican beef patty stuffed with oxtail and Mac & cheese on coconut bread = 🔥🔥🔥👍 Wash it down with a lime Ricky and call it a day! A+ Staff is super friendly too, great people."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSX2R2d3lBRRAB",
            "text": "The wait was about 3 hours long, but that's to be expected when you've gone viral. The staff kept us informed about the possibility of no oxtail and communicated with us the entire time. The mom was so sweet! I'm assuming this was a brother…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNktYdUpBEAE",
            "text": "I purchased two patties, one with oxtail and the other with curry chicken. The oxtail patty was a miss. The oxtail flavor wasn’t it. The gravy tasted like store bought marinade seasoning out the bottle. Very little oxtail meat, which is normal these days, with three chunks of fat on my patty, that I thought were pieces of meat until I put it into my mouth. I will not buy it again, but the curry chicken patty was hitting. The flavor was there the chicken well seasoned and marinated, and I have no complaints about this patty. If I had to recommend an item, it would definitely be the curry chicken Mac patty.😋This restaurant could definitely keep their work space cleaner as well. I came in the evening after 7pm and the temperature holding counter were food is kept, was very messy. I traveled a far distance to get to this restaurant. It’s not worth me making the trip, I came all the way from downtown Brooklyn, but if you live in the area or close by, it’s worth trying out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4a2ZlYjhnRRAB",
            "text": "FIRST, the customer service is TOP NOTCH which is MANDATORY for ME; now let's get into this Mac-Patty..... DELISH; I'm NOT a fan of coco bread in general BUT THIS IS DIFFERENT.... I throughly enjoyed it ALL, the bread 🍞, patty, mac-n-cheese…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMnNidFVBEAE",
            "text": "Everyone on social media was raving about the Oxtail Datmacpatty, so of course we had to see what the hype was all about. The Oxtail Datmacpatty is a great concept, but needs some work. It was definitely lacking seasoning & sauce. There were several other options on the menu, but we only tried the Datmacpatty & the fish. The fish could’ve been better. Definitely needed more seasoning & was probably cooked too long because the inside wasn’t fluffy. Very dry in my opinion. However, The owners/staff were friendly. Great experience. Would I recommend? I Definitely would recommend everyone to try it, but it wasn’t worth the hype in my opinion. People must like it because they had a long line of customers, but they were able to get customers in and out quickly, which is a plus in my book."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobk5Ta2tRRRAB",
            "text": "Honestly My favorite spot in Queens by far. I’ve been living here for 8years and it’s hard to find a true Caribbean spot that serves delicious cuisine. When they came to the neighborhood this winter it was honestly a blessing. Food that is made with LOVE! They never disappoint!\n\nMac Patty, Bake & Saltfish , Bake & cornbeef!! Must haves. This is the fluffiest bake I’ve ever had, make sure you get it fresh and in the morning it will make your day! My grandmother have competition, do you hear me?!?! Lol this is your sign to go!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGMDdpN0dREAE",
            "text": "This was my first time having oxtail mac and cheese & coco bread. I watched him make someone else sandwich. So I ordered the same sandwich. The oxtail looked dry..... so I requested a fresh batch. So he made me another sandwich and it was much smaller. Fell cheated compared to what I saw first. It wasn't a good experience for the first visit. I'm not sure if I'll come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMW9TY21BRRAB",
            "text": "The lines are really long. The owner suggested coming early, like 9am. They ran out of many things to accommodate those wanting to order the beef patty with oxtails and macaroni & cheese on coco bread. They only let about 3 or 4 people in at a time. We waited for 2 hours. Is that sandwich that went viral worth it? Yes!!"
        }
    ],
    "reviews_count": 71
}