{
    "name": "Juicy King Crab Express (19914Hollis Ave.)",
    "place_id": "ChIJW4NNuMhhwokRdOHnIvfm2fk",
    "grid": "QN12",
    "address": "199-14 Hollis Ave, St. Albans, NY 11412, USA",
    "rating": 3.7,
    "user_ratings_total": 94,
    "phone_number": "(929) 433-0148",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQk1ITjVSM1pxVW5oamVHRmlTSFZDYUhNNVkwRRAB",
            "text": "I ordered the juicy king crab specialty and it was well worth the price. Taste was great and service was quick. The lady I spoke with over the phone was patient and explained to me what I would get with my order. Go ahead and place your order it is worth it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xneVVGbEpTazU1Wm1Kb1Z6WTJha2t6UzFOeVpXYxAB",
            "text": "The owners/employees were respectful & kind, I thank them for that. The restaurant is clean, the decorations are cute, & the service is efficient. The food is hit or miss. I ordered for a family dinner & it was all burnt, save the chicken & broccoli. That was the only dish that was delicious. Things were probably kept warm & torched to order. Very unfortunate food, good service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQV192YkhVbnZXakZnEAE",
            "text": "My seafood boil ordered via uber eats was not good or appetizing at all! I’m trying to figure out how a meal can have so many different bad components I wasn’t able to eat the noodles or the sausage they were very salty, the lobster literally had no taste at all it taste like wet water I shakes the bag up before opening and still there was none of the sauce in the lobster shell when attempting to dip the lobster meat in the sauce, nothing but oil! Not butter oil! There is more oil than sauce the sauce already clings to noodles the shrimp not deveined as if I ordered head on. Waste of money! Never again!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLVkzSXpBRRAB",
            "text": "Love it. The guy dishing out the food is cool .\nThe food was good and the atmosphere gave a sea 🌊 feel.\nNot a spot to sit in .\nEverything is discounted but grade is pending.  Calamari is very inexpensive,  I guess that's why it has no reheat value."
        },
        {
            "date": "1년 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuXzRqMUZREAE",
            "text": "好吃😋给我冲"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdmF5WXhnRRAB",
            "text": "Everything was amazing and good the service wonderful food was delicious will definitely recommend and go again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeVkzNkhREAE",
            "text": "I order my food using an app. The popcorn shrimp was fresh and lightly battered. The hush puppies are tender inside and lightly fried crust on outside. Large portions. Comes with two separate sauces. One cocktail and one mild spicy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdE9PUHFnRRAB",
            "text": "I like the food !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MnVfd2pRRRAB",
            "text": "I come in to buy every time I pass by here. The seafood here is very fresh and the staff in front are also very friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5Mm9lM3hnRRAB",
            "text": "Very valuable place, everything is fantastic. I will come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MnJ1TGZ3EAE",
            "text": "Very nice place and the food is very fresh and tasty. I love it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cS1yd0ZnEAE",
            "text": "Place needs to closed down! Salty, expired crabs and uncleaned shrimp!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWNDc2UnBnRRAB",
            "text": "I give this food a 0 this food made us sick it was not fresh at all it was old the brocolli was so salty too the point where it made my head hurt\nThe crabs stinker I wish I didn’t order this to\nGo it’s sad y’all got my child sick like that with this garbage"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWNmNldldREAE",
            "text": "I ordered and received crawfish 🦞 full of dirt , this place needs to be inspected. After calling them and sending videos, they completely ignored my concerns.\nThey will be reported."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaHBibzJRRRAB",
            "text": "I don't buy food from here as it is EXTREMELY expensive. But I buy the quart of sauce for $18 and buy my own seafood. The staff is nice and the place is always clean."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNnVxSDF3RRAB",
            "text": "I saw this place and it had a grade pending sign but I was in the mood for seafood and besides my better judgement I got a boil the guy I noticed when it was too late didn’t wear any gloves while preparing my food he came out the rest room prior a day later I got food poisoning it’s day 2 and I’m still sick I would not recommend staff is rude as well"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLWZISTdnRRAB",
            "text": "Everything was good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4M2ZtR2xnRRAB",
            "text": "Very good so far"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoa2NqWVd3EAE",
            "text": "The food is real good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoa0xfVU13EAE",
            "text": "Food is very disgusting 🤢…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MUotTHpBRRAB",
            "text": "Worst boil I’ve ever eaten. I definitely could have just made it myself. Shrimp was over cooked and wasn’t deveined. Crab was over cooked they only give u one potato and one corn in a boil. Over 40 for Uber deliveries when high end restaurants are the same and even less. The house sauce which is usually a signature sauce taste like garlic butter sauce with water. No taste the crab legs were at least edible and something scorched my lips and my tongue. I ate it cuz I was hungry but I’m really mad I don’t even do reviews"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPb0o2R2hRRRAB",
            "text": "They don’t know how to serve customers. There was a Chinese lady who was taking the order was rude and barely talk when we ask questions and her tone was like she felt annoyed . When we asked something for breaking the shells of crab the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMybGJDYUxREAE",
            "text": "This is the first time ordering from here. I order calamari and dumplings. Omg the calamari was okay just had a funny a funny after taste even when I try drinking juice omg it was nasty don’t know I have had calamari many time never…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyenFIclN3EAE",
            "text": "the quantity of food in this boil bag is terrible . One potato one corn one crab leg ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyN0lMVFB3EAE",
            "text": "Really good food and good service, they always serve fresh foods"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdzUtand3RRAB",
            "text": "Ripped-Off At Hollis Ave Location. Owner Cheating It's Customers. I normally write glowing reviews, when the product or service deserves it. Not this time. Paid $20 for lobster salad, received 2.8 oz of lobster meat (I weighed it), when it should have been 6 oz. It was a lot of lettuce and tomatoes and an overcooked split hardboiled egg and very little lobster meat. My 5 fried oysters were actually 2 oysters cut into smaller pieces, and sold as 5 pieces. I spent almost $60 on this order. The food tasted good, but I was so disappointed in the portion sizes, that it ruined the entire experience for me. I ordered in person at the location and it was hand delivered to me, so it can't be blamed on any website, phone order or delivery driver issue. I'm insulted that they thought I wouldn't notice that I was being cheated.  But of course no one from this location will offer any restitution or even respond.to this review in a way that benefits ME. Thank goodness there are other Juicy King's in the area. Being penny wise and pound foolish isn't a good look for this company or their bank account,  because it drives customers away and directs them to another location, or a different franchise entirely."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNteFpiZUhnEAE",
            "text": "Fantastic place, price $2 to$3 more than any other crab place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNTVfeU9REAE",
            "text": "Great customer service\nShowed best deals at the time."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHeXV5TDhRRRAB",
            "text": "Ok"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHeWEybXJBRRAB",
            "text": "Foods great,little expensive though.."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHN1B2N0RBEAE",
            "text": "There food is very good. Delicious!!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhanF5UDB3RRAB",
            "text": "This place was terrible the worst juicy king crab I have ever been to unorganized the order took forever never go there"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHMnF2Q013EAE",
            "text": "They charged me $7 and change for what they call a six piece chicken wing this is not a six piece it's not even a full wing"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2Z2VpT21BRRAB",
            "text": "Always call and order great service and yummy food .always on point"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bXIzZVJREAE",
            "text": "Mixed up my order"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NU9USEF3EAE",
            "text": "Enjoyed the food with my sister"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2eVliamFREAE",
            "text": "I just came for the hush puppies. I'm vegan. Ordered some calamari for my mom. Hush puppies definitely were good!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhakxLLW9nRRAB",
            "text": "Very good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxaF9hdWN3EAE",
            "text": "Ordered the crab fries which is fries with a tablespoon of crabmeat on top and steamed scallops which were bite sized.  Wish there were more meat on the fries but what I paid for was not worth the price."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbDhpbHdRRRAB",
            "text": "They gave so much food and it was delicious"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLeHU3ZFJBEAE",
            "text": "This was my first time trying this spot out. I was not happy with my boil at all. I had a shrimp boil and the shrimp was overcooked and very dirty. I could barely separate the shell from the shrimp. I've been to plenty of seafood boil spots…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5aS1YNGp3RRAB",
            "text": "Very time gentlemen greeting me and assist me with my order. I orderd 2 shrimp boil with sausage. Fresh seafood and tasty but was seasoned with 2 much salt. The color of the food was bland not like saucy red as some I experienced. Fare price"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTc01ETzh3RRAB",
            "text": "Today is my second time ordering from Juicy King Crab Express in Hollis, Queens. The food is delicious and my order is delivered in no time.I ordered the Crab legs with corn and potatoes. I highly recommend you try their food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTeC1XX2h3RRAB",
            "text": "I was looking for a good seafood spot in Queens. I ordered the snowed crab legs with sweet potatoe fries. It was very good and well packaged. I will be ordering from them again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLcHJQbDZnRRAB",
            "text": "Food was delicious! Generous and big portions. Wait time was very brief! Great service. Will go back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaU5IZ1B3EAE",
            "text": "This establishment doesn’t deserve a star. I ordered some fried catfish omg the fish was half way cooked never again!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTXzlmek1nEAE",
            "text": "The sauce no good. The craw fish taste like its coming straight from the sea. Not cooked properly"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5X3R1QUlREAE",
            "text": "Food is good online orders are abit delayed and disorganized but doesn't take away from the food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpajhYYUpBEAE",
            "text": "There food is amazing I recommend the shrimp basket! And there service is wonderful"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpd2RpbXBnRRAB",
            "text": "Excellent food!! I will definitely be back soon :)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTdjQ2cGtRRRAB",
            "text": "The seafood is delicious and tasty. Definitely recommend just a little pricey"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5OXAzRUlBEAE",
            "text": "The value for money is horrible, the sauce is bland. I won’t be ordering here again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTb3VPSGN3EAE",
            "text": "Great Portion\nGreat Taste Surprisingly\nMy Go To Spot For Crab Legs"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTa3BEU3NRRRAB",
            "text": "It was good, couldn't waste time taking pictures lol........."
        }
    ],
    "reviews_count": 54
}