{
    "name": "Jamaican Best",
    "place_id": "ChIJeTwEc3dhwokRLJKP-8lMb_0",
    "grid": "QN12",
    "address": "204-08 Hillside Ave., Hollis, NY 11423, USA",
    "rating": 3.6,
    "user_ratings_total": 198,
    "phone_number": "(718) 454-4321",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWVJqSkthbnBPVnpKU09VRTJjV0Y2WkZVd1VVRRAB",
            "text": "Jamaican Best offers some of the tastiest porridge you can find! No matter which type you choose, you'll enjoy a delicious treat. Can't wait to order again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbk5HODFjakZtTlhsWGRIRjBlalZrTjI1RVlXYxAB",
            "text": "Worst restaurant in queens food don't even taste good and it's way overpriced poor customer service a the girls have attitudes"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTWVqRTRjR0ZuZWxWWlgxUkxOelJsTTJvMVEwRRAB",
            "text": "Looking to try something different and taste delicious my own personal experiences I love food from here. Try it and have the same experiences. 🥰😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VManoxOWJIb2RIbVlBEAE",
            "text": "Very rude very nasty people cheap with serving as well taste not there. Would rate 0!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMemVuZUQydGNpRWJBEAE",
            "text": "Just ordered me a curry goat with white rice and it was horrible. She only gave me  Two plantains And the meat was so trashy I couldn’t even eat it, and the lady act like she had an attitude I’ll never go there again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvemJIa21BRRAB",
            "text": "1. Jerk chicken medium bowl with salad and jerk sauce 9/10 bomb flavour good quantity 🔥\n\n2. Spicy beef patty - 11/10 out of this world 🔥🔥\n\nFast service nice parking (PAID PARKING)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeFlpZF9nRRAB",
            "text": "Very lazy super sland time you'll grow old waiting for lunch."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN0kzVk9BEAE",
            "text": "Such warm pleasant people with amazinggggg food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2X2VQS3NnRRAB",
            "text": "I have ordered food from here a few times and every time the food is unsatisfactory to say the least. And this is the only Jamaican restaurant that I know that is always “out” of chicken patty.\n\nThe staff is not friendly!\n\nNot recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibzZ2UTNRRRAB",
            "text": "I bought cow foot soup. when I opened the container of soup the oil was sitting on the top of the soup. The soup was very oily which made me sick."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyXzlmT0tnEAE",
            "text": "I’ve been a customer here for a long time and the food is great, as well as the service. Just wish there was a bit more. The lady who served me yesterday afternoon looks new so I didn’t get the portion of jerk chicken or oxtails I’d normally get. Other than that, I have no complaints."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybDlpV2N3EAE",
            "text": "The food is good but the lady is always mean to me but very kind to the men that come in. She makes me so uncomfortable. If you’re a female then don’t come here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6ejRQYlpBEAE",
            "text": "I don’t like the fact, they force you to buy a medium or large early in the morning for breakfast… what about those that can’t eat a lot of food early in the morning?  There other places don’t force you to buy so much food in the morning time if you don’t want to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NC1QbDZBRRAB",
            "text": "Jerk chicken is flavorful, huge portions, service was excellent, gave utensils, good price"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqb2FlYXJnRRAB",
            "text": "Achee was on point ☝🏿"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqLUxxbTdRRRAB",
            "text": "Didn't like it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5d2R6V3dRRRAB",
            "text": "Jerk chicken was dry, cabbage too sweet, rice tasted too old.\ntoo sad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5ck5QWWdRRRAB",
            "text": "I’m familiar with the culture of Jamaican restaurant staff, it’s often understood they aren’t the friendliest - even a little rude sometimes lol but what keeps you coming is the flavor and quality of the food. Without a doubt. In this case / the staff was beyond rude and not friendly with the food to match. if you’re gonna have an attitude that food and flavor betterrrrrr give top-tier. And in this case, I was extremely underwhelmed by the taste & choice of spices when it came to the oxtails with rice & peas. Unfortunately wont be coming here again. I’ll stick to Genesis #1"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNka0xfM0Z3EAE",
            "text": "Good food , nice customer service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNON05UWHBnRRAB",
            "text": "Any time I place an order via a delivery app I always leave details on how I would like my food but they never ever follow instructions. It’s disappointing to know you are spending money on something you crave but only to get the opposite you ask for ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNm96UnNBRRAB",
            "text": "the restaurant has a sewage scent upon entry. the food caused me to throw up as in vomit before finish eating. the food tasted awful. the service was good tho friendly service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOE9EZHVRRRAB",
            "text": "Jerk chicken was cold. I got so sick after eating my food."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1bVA3YzdBRRAB",
            "text": "got food poisoning after ordering from here they're serving old food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGLWE2N1lnEAE",
            "text": "That red bean soup was everything.  Oxtails and jerk chicken hittin too"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURadmNBShAB",
            "text": "I was looking for some AUTHENTIC JAMAICAN FOOD of Oxtails w/Rice & peas & thought I would find it here…NOPE!.. I got home to find a PLATE OF BONES & RICE!!.. LITERALLY NO MEAT AT ALL!!!.. 4-5 BONES…LOTS OF GRAVY THO’… Uggh NEVER EVER GOING THERE AGAIN!.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURac3VxMXp3RRAB",
            "text": "THE FOOD IS VERY TASTY ESPECIALLY  THE CHICKEN SOUP"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaLTZyRTB3RRAB",
            "text": "Great food, great service, friendly and good prices. A disgruntled customer and a high customer tried to ruin the atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab0otTlR3EAE",
            "text": "Ordered Oxtails an usually very good. This time alil too salty."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNGRQN0JREAE",
            "text": "Never gives utensils. 3rd time this week ordering and requested utensils and never get it and i can eat lunch. Very annoying and they put way too much oil in plate. Asked for a dumpling to replace yams because i cant eat it and got nothing to compensate. Overall absolutely not worth $17.00 for a small saltfish with 2 dumplings and one banana."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOWNDSkZ3EAE",
            "text": "Food was spoil when I got it. Called and they say its not. Food tatse different when it spoil. The server is always rude ALWAYS have attitude and talks rude to customers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcmRYMy1RRRAB",
            "text": "This is possibly the worst\nCurry goat ive ever tasted or had to look at.  The goat chunks of meat were so big with the outside looking curried but when u bit into the meat, it tough and red inside. I also ordered gizzada and pudding which were both dry and stale.  The only thing i could consume from my order was the sorrel.  Horrible just horrible!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeVl2SXJBRRAB",
            "text": "Watch your receipts. As of lately, they started adding on a 25% gratuity fee for take-out orders. It put me in a \"stop going mood\" immediately right after that."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eTRtNzFnRRAB",
            "text": "I’m a vegan so the food wasn’t for me."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4djVXZjJRRRAB",
            "text": "Oxtails from this place never disappoint & they not stingy with it either!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScTRxR1FnEAE",
            "text": "Very filling and delicious oxtail and goat curry. They serve ALOT for a decent price. Always passed by but I went in and tried them out. Did not miss 💯💥…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCbjVlelhREAE",
            "text": "I’ve patronized this establishment on many occasions. Depending on who is serving the food, I may get decent customer service or I may not. This morning a SHORT older woman was serving the food, she yelled at me to ask me what I wanted and walked away instead of saying give me a moment I’ll be with you in a few. This woman also was very pleasant with a man who was ordering food which is fine but that shows me how unprofessional she really is. This isn’t the first time I’ve had an issue with her service. I don’t have any pictures of food  to upload because I walked right out. No thank you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdV9Tb3hRRRAB",
            "text": "The patties are delicious 😋…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdHVPSktnEAE",
            "text": "GRANNY APPROVED after the first sip of their soup. Very personable and understanding staff, plentiful portions and great flavor across all their menu items. I had the beef soup, fish soup, roti, brown stew fish, and curry shrimp. Every bite brought me delight && for a not so bad price point."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNmNlTjV3RRAB",
            "text": "By chance clicked on this in Uber app for quik Old fashioned Plaintain porridge for a try. It was so delicious and fresh to say the least! It reminded me of good soul carribean gem and pleasantly surprised. I enjoyed this today!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeWZtcHZ3RRAB",
            "text": "Went there this morning and the lady serving the food  had a terrible attitude. This is a good way to lose costumers"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXaTl6amRnEAE",
            "text": "I come here once or twice a week and I have only experienced positive vibes from the ladies that work here. The baked salmon is delicious! I also like the stewed oxtails. These dishes for me are flavorful and not overly seasoned. When I'm not feeling well or the weather is cold, their chicken soup hits the spot!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVNHRhOEFnEAE",
            "text": "Delicious ackee and saltfish and the lady at the counter is a sweetheart! I tried the veggie patty and it's just good, but not great. My friend said the shrimp patty was delicious. Just needed a bit more shrimp. Loved the lady at the front because she greets you with a beautiful smile and makes you feel welcome. 👌🏾…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnZzRMS0V3EAE",
            "text": "So Literally about 15 minutes ago seeing that I was doing laundry I figured I’ll grab something to eat from there I got piece of macaroni pie ( Mac n cheese whatever you want to call it )with stew chicken. Stew chicken lacked flavor and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcGFtYnZRRRAB",
            "text": "I wanted to love this place because I’m local but every time I get food from here I’m always disappointed with the taste. This time the chicken curry was watery and kinda tasted like fish .. watever I can get over that but then I found two labels like this inside the curry"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMXNQQTl3RRAB",
            "text": "Pretty good food here oxtails we’re good and lots of food for the money so it’s worth it for me definitely will have this place again"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbnA3NlZREAE",
            "text": "WORST restaurant in the neighborhood, I can go to get Chinese, Spanish, Fast food.....ANY kind of other food and I will pay less get more and be served even more FRIENDLY! They have NO respect here and if I did not go through issues with…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVM01yU05REAE",
            "text": "My mom loves the oxtails.  The ladies at the counter are very friendly and always know when my sis and I come in for my mom.  We love the beef patties  and chicken patties.  I also love the fried fish.  But you have to go early they sell out fast.  Thank you for great food and a pleasant experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNheGFPdmN3EAE",
            "text": "Not Impressed. Lady at the front is very rude. As I waited for her to take my order, she was arguing with what seemed to be a customer on the phone. Then she came to take my order. The food did not look appetizing, it looked very gross, so we decided just to order 3 patties and 3 drinks for myself, my husband, and daughter who were both standing with me. I saw the lady putting the 3 patties into one bag, which was fine. I just asked her to give me two additional bags so I could separate the patties. She had a major attitude, telling me I should have told her in the first place that I wanted them separate. It wasn't a big deal but Um.. do you not see three people standing here? Please get someone else to represent your business. That face and that attitude is not acceptable at the front of a store. That customer service is not acceptable or appreciated. No worries, we will not be back!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDejRfckRREAE",
            "text": "I ate here three times and each time was fresh, plentiful and amazing. You can tell the owner really cares about customers satisfaction the staff are kind and polite. The plates are delicious they give so much in one dish. You can tell everything is made fresh the day of there really is a difference here. Amazing food 🍛…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBc056RGNREAE",
            "text": "I'm usually picky when it comes to my Curry Chicken, so when I first came here I was really impressed. My go to order is the Curry Chicken w/ Rice & Peas and some Roti Skin. One time when they ran out of the Chicken I got the Curry Goat…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwXzV2NzNRRRAB",
            "text": "I ate the curry chicken and the curry goat. That was my first time having curry goat and I actually preferred it over the curry chicken. The plaintains were awesome. They lady that worked there was extremely helpful and handled herself very well. Thank you for the excellent food!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnM3YtRnNRRRAB",
            "text": "I only went here because my sister who lives in Suffolk needed something for he husband in the hospital in Manhattan. The face of the young lady serving this evening  boy not a smile, eye contact, nothing. Their food is good at times but…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDemRibTBnRRAB",
            "text": "Would like to buy the food more often but the Lady there is beyond Rude just like another review stated. She may be nice to her own kind but others get the attitude especially if you do not know too much about Jamaican food and when asked…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDbnVpNFRnEAE",
            "text": "If you enjoy Caribbean food , with intense flavour and spices ,this place fits your taste .\nGo there early and get the specials while they are freshest . I had Curry Goat…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXeTd2dmd3RRAB",
            "text": "I ordered delivery today. They were rated 4.5 stars on Doordash, so I decided to give them a try. The delivery arrived in 30 mins which was a huge plus. But the food was just horrible. I ordered the stewed chicken with rice and peas and…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxdXI2OTJBRRAB",
            "text": "I just picked up my daughter-in-law from the Airport,  we went to get some food, the lady had a BAD attitude, she served the food with a longer face as if she was mad with me. I spend over $100. While walking out I saw there  was a sign…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpaHBEZk53EAE",
            "text": "Jamaican Best\n\nHi! I've been visiting you're resturant for a few months working my way through…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhM3ZlMkVnEAE",
            "text": "Jamaican best? More like Jamaican worst.\n\nI ordered from them for the first time on Uber eats today because my go to (Genesis 1) was closed and I decided to give them a chance. Huge mistake. I ordered Oxtail, Stew Chicken and Jerk Chicken and each was just a disaster. The chicken for each order was BONE DRY and the sauce on the jerk was a pathetic example of a jerk sauce. The oxtail was just a straight up ginger bomb. With every bite was a mouthful of ginger flavor and to top it off, it was bland! Absolutely no seasoning. The spinach patty was decent. All in all, I will never order from this place again. Please save yourselves from making my mistake and go to places like Genesis and Jamaica Breeze.\n\nNever again."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjay1TbGFBEAE",
            "text": "Fish soup had NO fish and tasted terrible! This place smells like spoiled food and the buffet looks dry and old. Juices are not fresh and taste like a cup of sugar water."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwaHJfdGtnRRAB",
            "text": "Haven’t tasted the food yet but the service itself doesn’t make me want to come back or eat the food i bought. The lady in the front was not very friendly. She was very impatient and had a very bad attitude...No thank you, just a mean cold shoulder..\n\nAnd when I asked for a taste of something to see if I wanted to buy it she said they dont give taste. 🤔 So I asked how much would it cost to taste a piece...she said we dont sell taste...😥 Thats not hospitality....thats just mean. I won’t be returning. I wish them the best though...And pray God helps put a smile on that ladies face one day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXLW8tUFRnEAE",
            "text": "Very rude lady at counter at 8:20pm on Thur Feb 24th. She was rude to me and other customers and didn't answer me when I asked how long order would take. No courtesy and very lackadaisical/slow moving and apparently in a bad mood. Never…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBeWJmQlVnEAE",
            "text": "Best Jamaican food I've ever had. I bought some rice and red beans with jerk chicken today for me and my son and we loved it. You won't even need sauce to eat the rice. I will buy again."
        }
    ],
    "reviews_count": 62
}