{
    "name": "Girasoles Mexican Cuisine",
    "place_id": "ChIJTY1pPhRhwokR_TYFAlbM4iQ",
    "grid": "QN12",
    "address": "184-01 Jamaica Ave, Hollis, NY 11423, USA",
    "rating": 4.6,
    "user_ratings_total": 290,
    "phone_number": "(718) 487-4316",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VFJVTlRTWE5IYlZKaVVpMHRPVjkxU1d0bmVGRRAB",
            "text": "Best authentic Mexican food around. The cashier was so friendly and helpful. Everything was great will come back"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoYWJYSmpVblpQY1RWdlIwNW1SSEI1TlV0ZldsRRAB",
            "text": "Food was bland"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMk1FUnhWa1U0UnkxYWRuUlpObTVsZG5CamFYYxAB",
            "text": "Food is very good but a little high in prices. 18$ for a burrito is a bit high."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRVJWVlBlWFphTVdRNFIyYzRiV2REWTBkQ1QzYxAB",
            "text": "Very authentic!  The tacos are fresh, delicious and large!  The staff is very nice!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xS2R6bEpTeTFrYVhaNE5VVjZNRmRGUzNwRFJsRRAB",
            "text": "First time visitor of Girasoles.  Small neighborhood restaurant in the Jamaica area.  There are a handful of seats, some bar style and a table or two.  It’s summer so it’s a bit warm in there even with the AC running. (Sit in the back, AC feels better there.)  The lady that took the order was pleasant.  Decent service, suitable for the establishment.\n\nI tried the Steak Quesadilla as my introduction to their cuisine.  The steak was tender and flavorful, the Cojito queso was new to me but added to the meal perfectly. My platter came with shredded lettuce, one small tomato slice (could have used a few more) and a little bit of guacamole.  This didn’t seem like restaurant quality.  It was better, more like mom or abuela was back there preparing dishes. I added a Coca Cola, the cool glass bottle ones that taste just a little bit better than the others you buy. (IYKYK)\n\nReasonable prices, really good food.  Will be back to try another dish."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201YU9GZDJiRU5JUjFSaGRuSmlSbFZXYVd4VmJHYxAB",
            "text": "Fantastic food 😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4T05sOVFXVmh2UlhSWmFFb3pOMjgzTUdobVVrRRAB",
            "text": "Small Mexican spot with amazing food and great service. You might have to wait sometimes, but it’s worth it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTlMzTXhWMmMwYUV0NFJuWkdWbkZsWVRWNU9IYxAB",
            "text": "The staff here is soooo sweet and attentive. I got the steak burrito and it was so delicious and BIG! My friend got the steak nachos and it was such a big serving and so nicely presented. 10/10 please support this local business!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWlRGYzBNekZyUWtaSE1qSllURUZRTjJWV1FsRRAB",
            "text": "Very nice people and food is great"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLM3M0djdKbGIzNUlnEAE",
            "text": "Por lo general pido delivery. Pero toda la comida deliciosa. A mi me encanta los chilaquiles y la sopa de camaron, son una delicia"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNWEY4ZTd3bGFtUmR3EAE",
            "text": "Excelente servicio deliciosa la comida.."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQaWU1Zks2NzVMWW5RRRAB",
            "text": "Muy rico todo mis preferidos los zopes"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ3NDemJnEAE",
            "text": "You can't get better mexican food on the east coast than this authentic Mexican spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOElLb0p3EAE",
            "text": "Excellent tasting food 🥘 I love ❤️ the atmosphere and the Mexican Culture hanging all around. The people are so friendly it’s a pleasure to visit them. Always greeted with a smile."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOC1pWUlREAE",
            "text": "Been here 3-4 times so far. Doesn’t disappoint. I recommend any of their tacos but if you’re really hungry get the nachos. WORTH IT!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcnB1eUtBEAE",
            "text": "Food was amazing so was service!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NkpXY1ZREAE",
            "text": "Great tacos!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBc0wyb1Z3EAE",
            "text": "The best customer service!! Correct orders and the NACHOS ARE AMAZING!! Everything is well prepared. I wish the hours were longer other than that everything is soo good!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cDRIcTVBRRAB",
            "text": "Era el día del cumple de mi hija ella quería comer torta de asada yo busqué algo cerca de donde andábamos encontramos ese restaurante yo soy de Arkansas y fui de vacaciones a NYC pero nos hospedamos área de queens fue la mejor torta que me e comido dentro de usa y eso que ya tengo 20 años siempre récordaremos esa comida tan deliciosa, buen servicio, y muy auténtica comida mexicana nos encanto"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eHR1MnhRRRAB",
            "text": "Girasoles Mexican Cuisine is a true hidden gem, and I’m so lucky to work just down the block! Their tacos are hands-down the best I’ve had in the area—fresh, flavorful, and absolutely delicious every single time.\n\nThe ingredients are always top-notch, from the perfectly seasoned meats to the fresh, crisp toppings. Every taco is crafted with care, and you can taste the authenticity in every bite. Whether it’s their classic steak tacos, tender chicken, or the mouthwatering al pastor, you really can’t go wrong.\n\nThe staff are incredibly friendly and welcoming, making every visit a great experience. They’re quick, efficient, and always have your food ready on time—perfect for a quick lunch or takeout after work.\n\nIf you’re in the area and craving amazing Mexican food, Girasoles Mexican Cuisine should be your first stop. Trust me, you won’t find better tacos anywhere else!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudWFMaFhnEAE",
            "text": "man they fish tacos slap ! 👍🏼…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIa3ZTb193RRAB",
            "text": "Very authentic"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3N3I3RC1BRRAB",
            "text": "Muy buena la atención excelente"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eXA2Q1lREAE",
            "text": "Local authentic Mexican joint . I take out most of the time but it’s nice id come back prices are competitive"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyLWFqYURREAE",
            "text": "The food is filling and the place though a little small has a lot of character. I pass this place on my way to work every day so I was always curious about it but never went until I had a crazy craving for quesadillas that wouldn’t be satisfied by Taco Bell or a generic restaurant. Something about this place seemed “real” so I figured “why not?” and went and I’m so glad I did. The prices were a little on the higher side but when I saw the amount of food I got I understood. I got quantity and quality food. I ended up changing my mind to get chicken nachos and it’s so good. Would definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqaFpfUldBEAE",
            "text": "I was out with my co worker in the area and we decided to check out this spot. The place was small but once we walked in we got created and the place smelt good from what they were cooking and making. We both got tacos and quesadillas and I got a milk shake with milk. Wow! Delicious and highly recommended this taco spot!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNEtQOUVREAE",
            "text": "Amazing food. They are very welcoming and friendly. This is my go to spot when I’m craving some Mexican food 🙂🙂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcXYtMDVRRRAB",
            "text": "Ordered vegetable soup from here and I got sick"
        },
        {
            "date": "1년 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5aC1lSXF3RRAB",
            "text": "Biraz pahalı ama gidilebilir"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dGNLQ3FRRRAB",
            "text": "The Tacos here are really good!!!! Ordered tacos from there on a regular my daughter doesn’t like tacos but loves their tacos !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkcjV6R0h3EAE",
            "text": "Tasty food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMWZtOGp3RRAB",
            "text": "We were utterly shocked at the delicious, authentic Mexican food served at this hole in the wall spot. The chips were hot & freshly made, & all five of us enjoyed our food. It’s a small space, though, & looks like it used to be a bodega/corner store, but it was one of the best Mexican meals I’ve ever had, & the staff is so friendly & considerate. So if you’re in the area, definitely give it a try."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjcVpTV2JREAE",
            "text": "I LOVE THIS PLACE! Very delicious and authentic  Mexican food. Most people pick up their food but they also have two tables in the back and a clean bathroom. Their mole is amazing! We also like getting their nachos and horchata. A hidden gem! 💎"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0NE1tRU5REAE",
            "text": "I always order the chicken 🌯 it's so good…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcnRURzhBRRAB",
            "text": "Buenísimo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNONmJTbEpREAE",
            "text": "Authentic! The best tacos and lemonade! Staff is super friendly (the girls at the register and over the phone when placing your order & accommodating!) The food is always good here! Will return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOeHNucDBRRRAB",
            "text": "My favorite  spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNXFyOXd3RRAB",
            "text": "Good Mexican food, prepared on the spot. Self service, no waitresses. Tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeEpPS0VBEAE",
            "text": "Food is always great no matter what you get. the staff is friendly. I best prices"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWemQzSHRBRRAB",
            "text": "Banging Nachos.  Service is great"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOS1iOFJREAE",
            "text": "My first time. Staff was very friendly and I ordered a chicken burrito. I usually use Uber eats for my choice but I saw the reviews and wanted to try it. Glad I came. Everything was great. Although I’m use to having my lettuce in tomatoes in the burrito as opposed to on the side it still was amazing!! Deff gained a new customer.  I ate half before writing review lol!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdExyX1FBEAE",
            "text": "The food was amazing! Definitely coming back here again. Highly recommend the nachos."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MmZhS0JREAE",
            "text": "Good tacos, didn’t really like the salchipapa."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPc2ZTd0tnEAE",
            "text": "Best tacos and torta I eat in a long time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsLUlEUnVBRRAB",
            "text": "I am so lucky that this place is just right around the corner from me. They're food is amazing, and everything is so freshly cooked, really large portions that lasts me more than enough for 2 portions. My favorite thing that I've never had anywhere else is the nachos made with chicken and everything on it. I think they refer to it as Texas style. The only unfortunate thing is that it is very small so I'll normally just order takeout."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLLVBIdnZBRRAB",
            "text": "Amazing flavorful !!! Tacos and the agau the horchata Is the best I've had in NYC hands down the cinnamon on top makes the drink perfect ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MXVUVHpBRRAB",
            "text": "Just ordered some fajitas and man, was it delicious, definitely a 5 star place, awesome atmosphere, awesome customer service and awesome food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNWZMTmF3EAE",
            "text": "Best Mexican food\nAlong jamaica avenue in hollis"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTNXR5YUd3EAE",
            "text": "Amazing the food is iust like my grandma used to make!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDM2R1TWFnEAE",
            "text": "Food is delicious. It was exactly what I was looking for. A good Mexican homemade meal. I had chalupas de carne asada, the red sauce was very flavorful, the meat was actually carne asada and not steak. I can’t wait to come back and try more dishes. I’m glad to have found a real authentic Mexican place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NkltUzZBRRAB",
            "text": "This place is low key one of the most underrated Mexican food spot!!! Their food is fire 🔥!!!! Packed with flavor and always satisfying!\n\nI currently do not have any photos of the food as it was a brain fade the few times we had it 😂.\n\nI would highly recommend you try them!!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MzkzenZ3RRAB",
            "text": "My favorite taco spot in New York. Super friendly family that owns the place and the food is always made with love by the ladies in the back. Never had a bad order here, recommend to all friends and family"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MUtMemt3RRAB",
            "text": "WHErE DO I START!!!  I travel for food & i can tell you ive eating mexican food from all 5 boroughs, my favorite mexican resturant is called que rico tacos in northern but lately they been bringin up their prices & closed half of their resturant  , i couldnt  find enchiladas as good as them anywhere! It felt impossible. After searching & going to this spot....... Thank you all gods from the heavens i found  & 2x better enchiladas then where i used to go before its sooo fresh!!! The sauce is perfectly mild! Customer service was great small dining area but whoo cares! Easy parking & its 10 mins away from my house😭😭😭😭😭 Thank you Girasoles resturant for youre aunthentic style of mexican Freshhh food !!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdGZiLXVnRRAB",
            "text": "The ambiance isn't reflected in the food. Girasoles has some of the most authentic Mexican cuisine this side of the Rio. Definitely a must try for anyone looking for something to hit the spot or trying something new. You won't regret it."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRZ3FfYzZBRRAB",
            "text": "This place prepares fresh Mexican food for its customers and it tastes great. You'll be pleasantly surprised by the high quality of its food. Restaurant is conveniently located at the corner of Jamaica Avenue and 184 St and its signage is visible from the either direction of Jamaica Avenue."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDdkpPMkdnEAE",
            "text": "1st time eating there. I got the broiled beef Torta! It was delicious. Steak Mexican cheese onion lettuce tomatoes and jalapeños. Made to order very fresh. Only thing they could have added more than 2 slices of broiled beef."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlamZUMEFnEAE",
            "text": "Girasoles is a great restaurant where you can find authentic Mexican cuisine. Their food is amazing and their staff very attentive. Eating in the restaurant can be difficult because it is small in size, i prefer to order out."
        }
    ],
    "reviews_count": 57
}