{
    "name": "Fortis Restaurant",
    "place_id": "ChIJv7af3fphwokRLKQ8VdVvYhg",
    "grid": "QN12",
    "address": "108-26 Guy R Brewer Blvd, Jamaica, NY 11433, USA",
    "rating": 4.1,
    "user_ratings_total": 70,
    "phone_number": "(718) 262-9352",
    "reviews": [
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfck9lQVhREAE",
            "text": "Put in an order for a “to good to go” bag and they were closed at the time the app told me to pick up . Still haven’t gotten in contact with them yet ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiN29fLU9nEAE",
            "text": "A recent  negative review of this place is complete nonsense. The chef and owners are very personable and the service is impeccable . Excellent excellent excellent place. I live 20 miles from this restaurant but it's worth the trip every time . Food is el Perfecto...the best in NY"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyaWZlQVNBEAE",
            "text": "I tend to never leave a review but first time going since new owner. $20 for medium rice and peas with oxtail(3 pieces of oxtails). Not many options on a Monday, not sure if that’s normal and also server didn’t show much friendliness which is fine and mostly expected. 2 stars on food only because flavor of oxtail was decent but rice did taste a little stale. Could just be my comparison to what I’m use to. Probably won’t return 🤷🏾‍♂️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcFB6amJBEAE",
            "text": "Underrated. Service very fast. Used too good to go app. Love their rice will definitely order from here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMjh6c2pRRRAB",
            "text": "I ordered from TooGoodToGo and only paid $5.43 for a large dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbU15ZExnEAE",
            "text": "I ordered from TooGoodToGo and only paid $5.43 for a large dinner. The food had a good flavor. I’d go back and pay regular price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSMThPakNBEAE",
            "text": "Everything is on point\nThe best"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoX3Jfd3hRRRAB",
            "text": "The food is o good here and so many staff members come back to back. Went there in a Sunday after church and there was no wait."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMlliUkp3EAE",
            "text": "Foodvis delicious each time I purchase."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdGJXbDF3RRAB",
            "text": "I get takeout probably once a week from here. Bc it is that good. Like it is extremely good & the prices are average (you could say it’s a bit high but truthfully with the quality it is right on)\n1. This place is so clean.\nEvery item I have gotten was delicious.\n\nJerk chicken with macaroni and cheese-\nChicken was flavorful & moist- so freaking good.\nMac and cheese portions could be a little bigger to be honest but tasted amazing.\nOxtail rice & peas and steamed veggies-\nAmazing! Could’ve skimmed a lil bit of the fat of the oxtail but I get it. Still so damn good, down to the peas & rice & steamed veggies all tasting amazing.\nCurry goat again another hit!\nTheir patties are the best!!! Like soft flaky buttery, I get one every single time.\n\nI get a variation of these items everytime I go there and have not been dissappointed so they are consistent in good food.\nDefinitely made this my Jamaican spot.\n\nJerk chicken is moist while flavorful,"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtaXVXOU5nEAE",
            "text": "I ordered this as a gift for someone and the ridiculous employee gave the order to someone else without proof of purchase. Disgusting and rude workers, will NEVER order from them!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlamE3SjVBRRAB",
            "text": "Went here 10.15 for breakfast, called before arriving to ensure they had what I wanted was available. The lady that answered the phone and greeted us was sweet and approachable, when I proceeded to place my order she remembered from the call. I tried the food in the car before heading home because some of these reviews were mixed.\n\nBut babyyyyyyyyyy Fortis didn’t disappoint! I cook cook but didn’t feel like this morning. They will forever have a customer in me on days I don’t feel like cooking!\n\nSo good we ordered again this morning on grub hub"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldHZIMHF3RRAB",
            "text": "I really wanted to see the K.C alumni as my husband also attended..I am assuming,, that is where the FORTIS comes from. To make a suggestion. I used to be always able to get mixed breakfast and I always ordered butter beans and salt fish and a little callaloo.\nThe server said \"we don't do that anymore, it's causing problems\"\nI didn't  understand, all they have to do is charge a little more. I was disappointed 😞 and told her I will take my business elsewhere. No more patronage from me or my friends and family!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPc0t2cTJRRRAB",
            "text": "Tasty"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMGRINWVnEAE",
            "text": "My updated review, This restaurant seems like it has declined. I ordered an oxtail dinner medium for more then $20 , for my wife and it was mostly bones ,no gravy on the rice .and this time the customer service was bad. This spot this time around was definitely a waste of money ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNnZPUFhREAE",
            "text": "1st time returning since new owner. I got there, and the sales rep acknowledged me right away and asked if I had any questions before ordering. I ordered Curried goat, rice and peas and plantain. Let me tell you that curry was 100% on size (amount), spice, taste and temperature. I will definitely be back for more curry. 👍👍👍"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdk1fSEdBEAE",
            "text": "Good food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdjVtT2F3EAE",
            "text": "Food was 10/10. Closest thing to being back home ! 🇯🇲"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHcm9XQkVnEAE",
            "text": "Horrible placeThe serverNot friendlyRice and peas overcooked.Yes I amNeverPurchasing food from them againOverpricedAnd the foodIs horribleAs a pillar of the communityThis place needs to be closed downThe Board of Health needs to come inAnd check the establishment because they live around and work around a banded buildings"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHa1A2Q1NBEAE",
            "text": "I have eaten here twice now and this is by far my favorite Jamaican restaurant already. As you walk in, you can see the authenticity. The food is so good. My first time eating here, I tried the jerk chicken rice and stew chicken. Excellent. This week, I had the Rasta pasta and shrimp. Seasoned to perfection. I had a small order and I wanted to go back for another.\n\nI don’t know how they get these things but they have my favorite banana chips there (chippies), magnum, and a few other things that I rarely see up here. The woman who serves the food is also friendly. Not like some Jamaican restaurants where the servers have attitudes. This is my new after work spot every Sunday."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bUxiXzlBRRAB",
            "text": "The food was good.  Ordered two medium\nmeals, oxtail and salmon.  The salmon seem to be in a smaller container than the oxtail.  When I ask the lady she said this is the container for the salmon and when I went to pay she charge me for a large salmon.  When questioned she said the large and medium are the same price.   To me that didn’t make much sense.  Good food but I was not satisfied at all with the portion size."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2cE9Ta3VnRRAB",
            "text": "Was craving Jamaican food and was looking through yelp and google reviews. Decided to give this spot a try and it did not disappoint. The goat curry was flavorful, tender, and not too spicy. Festivals were also great. In addition, the two ladies behind the counter were very nice. Will come back again to try the oxtail!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMXBpVVNBEAE",
            "text": "This place as amazing food. Always clean when I go. Definitely recommend it. Great taste !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMXFqZmN3EAE",
            "text": "This place is AMAZING, best Jamaican food in NY  !!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURha3ZLXzlnRRAB",
            "text": "Love their food especially the oxtails 😋"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhcExHWDZRRRAB",
            "text": "Cool"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURha05QR21nRRAB",
            "text": "This is the PLACE for some good soup if your just in the mood and I can honestly say that the Rasta Pasta Is pretty good and super filling. Have been going here since I first lived in that area many years ago."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhLXJ1MlBnEAE",
            "text": "food was delicious"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxc1liem1RRRAB",
            "text": "Good food and great portions."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxb2IyYWN3EAE",
            "text": "Love the chicken soup"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxa3BPUDdnRRAB",
            "text": "Love 💘…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxOTk2djRBRRAB",
            "text": "Ok but too expensive"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLMmJPZFV3EAE",
            "text": "Great place to eat 😋…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLOUxTVVFBEAE",
            "text": "My meal had the authentic Jamaican taste. There was a wide selection to choose from. The aroma from spices and herbs used to prepare the meals filled the atmosphere.The staff were friendly, and the manager went above and beyond to help my…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLOWFYWk9REAE",
            "text": "Food is Delicious!   I had banana porridge & a mini order of jerk chicken fried rice...Both were Delicious, I would buy the Jerk Chicken fried rice again...and again, delicious 😋😋😋…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5cGNpZ3lBRRAB",
            "text": "Great Jamaica food, with flavor. Very clean and fast! Which is very important when you are hungry. I am glad there is a place near guy brewer. I ordered the shrimp and sweet chili salmon chunks with Rasta pasta, It will not disappoint."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5ek9HUzl3RRAB",
            "text": "My mom and I ordered from this restaurant for the first time and I have to say it won’t be the last!! We ordered the Shrimp and salmon! It was so delicious we wanted more haha! Food came on time & the person who took our order was so friendly."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5ek5tV1N3EAE",
            "text": "Was walking by this restaurant & believe me, best decision I ever did. The food was amazing. Definitely try their jerk shrimp & jerk wings! Wow amazing cannot wait to come back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5aVp1M2xBRRAB",
            "text": "This is a great restaurant! The food tastes great, and is always fresh. I really enjoy the macaroni and cheese and the curry chicken. I will definitely be going back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5NXRySFhBEAE",
            "text": "This was my first time having Caribbean food and it was fantastic definitely going back to try more things"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5bjR6Y093EAE",
            "text": "If you're on Guy Brewer and 108 Ave, go get something to eat... Tastiest Jamaican-West Indian cuisines..."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5ektIZEZBEAE",
            "text": "If you have an ox tail craving, this is THE spot!! Will def be frequenting here regularly. 👍🏼👍🏼…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5cHNQTVFnEAE",
            "text": "The Jerk Chicken and the Mac N Cheese hit the spot for sure 😍…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5ek9uSTl3RRAB",
            "text": "Awesome food great service!!"
        }
    ],
    "reviews_count": 44
}