{
    "name": "RyRy’s Kitchen",
    "place_id": "ChIJp91FRwphwokRb8xSeLwnvM4",
    "grid": "QN12",
    "address": "90-40 160th St, Jamaica, NY 11432, USA",
    "rating": 4.4,
    "user_ratings_total": 131,
    "phone_number": "(347) 233-2349",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcWRFWndRbTlOV1VaaFIyTkVhREpJV2xSR05tYxAB",
            "text": "This restaurant has A1 service. Not to mention the food is on point every time, no matter what dish you try. The prices are reasonable for the quality. One of my favorites"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kd1RVOUNRbTB5Y1VoclNqaEpRWEJIWnpORGMxRRAB",
            "text": "Chef Ryan is wonderful - subbed some of the dishes to accommodate us for dinner when our original items ordered were not available.…"
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsM2VuZGlTa2RWVUVablZrRldSMFpIWkcxZlZuYxAB",
            "text": "Sehr gutes essen ...lecker chicken und garnelen...jederzeit wieder ... Grüße aus Deutschland"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MFJISllWVTU1TW1kTVRHSTVhVU5YWTBKQ2JWRRAB",
            "text": "Omg,,, the Rasta Pasta and Cabbage! Fresh from the kitchen! I'm in heaven!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNGExUnFiR2QyZGs1T01IWkxVbWxIYUMwNFdGRRAB",
            "text": "Jerk chicken sandwich and mango salad are great! Jerk chicken has the perfect kick, and the mango kale salad dressing is just right."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaWRIWlFOREJaVmtoM1RtVkZSWFpqTWt0ak1tYxAB",
            "text": "Highly recommended!!!! I got kale salad + jerk chicken for $13.49 (incl. taxes) and it was sooo awesome. The jerk chicken was perfectly cooked - the meat fell off the bone so beautifully. Mamma mia chef's kiss. So delicious & affordable 👍👍👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaNGF6bEVPVjgwYUhSdk4zQlZNRVJGWVdwSmIwRRAB",
            "text": "Ryan and the entire staff are amazing! Amazing customer service, very friendly, food is amazing 10/10! Tell a friend to tell a friend!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVVprNXNSR2c1TW1Sd01pMTFUblEzUkc1clpuYxAB",
            "text": "Ryry restaurant is authentic and very tasteful. Bring the yard vibes to queens . Staff is friendly and well mannered . Food is always cook to perfection. Won’t be disappointed by dining here ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQlNrbEVhbmx3WTNGWE5VOVZORnBvVERSTFQxRRAB",
            "text": "This was my first time ordering fro. This restaurant, however I got to say I'm disappointed. I did an online order and order two large jerk chicken meals. For $18 dollars for each box I expected actual meat, what I got was three pieces of meat in each container and all of it was bones. After inspection there were all backs of a chicken or something.  No legs or thighs nothing. Don't think I  will order here again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaVZtUjBPVlpaYlRjeU5rWnZTakIwYjNKQlgxRRAB",
            "text": "Want to experience bad customer service and cold food? Just come to this place. Ordered the jerk sandwhich and when I took a bite it was cold I told that too the man in the front counter no apology or nothing. I told him I dont want a refund but instead a small curry goat. Ate the curry goat when I got home and it was chewy just disgusting. Should of saved my time and went to Mcdonalds instead!!!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVVltMTBNMFoyU2tWU2NrRXdVVXRWZERsM2RrRRAB",
            "text": "Best Jamaican food in the world ❤️❤️❤️❤️❤️❤️❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdVlqVkJPRGxuZHpOSFJpMW5kbk5QV0hOdVowRRAB",
            "text": "Chef Ryan is very courteous to his customers willing to make any kind of adjustments that you’re required\nThe food is very good. I would recommend Rasta pasta, the shrimp, and the  salmon."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cmFsTXhkalZsZEZscFZqRnFVVkJYUW1JeUxWRRAB",
            "text": "Some of the best oxtail I’ve had. Very flavorful rasta pasta and perfectly fried plantains. Only downside is that it’s in a food court but that shouldn’t matter to you."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVFNWbHdjemRHWWxKcVJGaHRaVlZSYzNSdWVVRRAB",
            "text": "It was all great! We got the curry goat, jerk chicken, red beans & rice, cabbage & rasta pasta."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xObFpXUnlVR3ByWmpGblIyaDFWWG81VEhZeFVtYxAB",
            "text": "Sorry, never await oxtail  bad. Also, the rice i tried at the beginning  was awesome  now eh fell off"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMVZHeHNSRXRrTTJWTU5YTTRZMVpJWDI5MGRGRRAB",
            "text": "The salmon and white rice is great. They are very patient and the service here is good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUlZGSnphMmhCWW1GeVZtWktWRWhyZDJKTFMzYxAB",
            "text": "Food is so good 10/10 I ordered the kale salad so good and rice and jerk chicken everything was fresh and taste so good"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaTZEbUxREAE",
            "text": "Good food, the mango salmon is a must try along with the mac and cheese balls"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa1pxVHZRRRAB",
            "text": "The honey garlic wings and jerk chicken are one of the best foods there! Highly recommend it!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaHBhMWd3RRAB",
            "text": "The cook is out of this world best Jamaica food I ever had staff was wonderful I recommend ryrys love it here"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc0xXNXB3RRAB",
            "text": "The food is good but I order curry goat and white rice the food was delicious it good Jamacian food but I found a long black hair piece in my curry goat disgusting I threw it away my phone died or else I had a picture to show proof I eat usually from golden crust and never had this issue like this with them or any and I was just being nice to try their food but the hair I found in my food is a turn off"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLVlXZjFBRRAB",
            "text": "very friendly. good vibes!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLWZqWVRREAE",
            "text": "Amazing"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMlBfR09nEAE",
            "text": "Always great food, good people. There is always a line at Ryrys!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIX2VQejRnRRAB",
            "text": "My go to place on Jamaica avenue . They give really great portions and the quality of everything is crazy. Their pasta is crazy good . So is their jerk chicken ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOXIyeXh3RRAB",
            "text": "RyRy's Kitchen catered our team lunch today. The customer service experience was very positive and everything was smooth from beginning to end. The food was amazing! So flavorful and a good amount of food for us.\n\nWe got the kale salad, Rasta pasta, curry empanadas, sweet plantains, chicken wings (which were so meaty) and jerk chicken. Everything was so good! We will definitely be ordering from RyRy's kitchen again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaW9QWXlnRRAB",
            "text": "I was taught not to behave badly for food, but this is absolute foolishness ! I brought 3 to share among family because it was a rave previous orders and they decide to serve scraps today. .. The slaw makes the meal.\nIf you do not have the ingredients to serve a decent meal, don’t offered it ! Simple."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3N3BTRV9BRRAB",
            "text": "RyRy's Kitchen is always on point.  I get the same thing every time Jerk Chicken sandwich and Kale salad.  You can't go wrong"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eUtfLV9RRRAB",
            "text": "My first time buying their food. I bought oxtails dinner and jerk chicken on the side.\nVery good. I especially liked the jerk chicken, it had that real grilled taste."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OVBhX1pREAE",
            "text": "We had a Family Event and the food was catered and we had tons of praises. The chicken was such a big hit. Everyone kept asking me about the Kale salad, which I thought was going to be left back but it was the first to go. Will definitely use for all events."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRXzRPVzN3RRAB",
            "text": "This was my first time coming, the food was tasty, and reasonably priced! Tbe seevice was good as well.\nIm not fond of the location, I do not like the Jamaica Food Market its located inside of.\nI will go back and support, and just ignore everything else."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNmJlSUt3EAE",
            "text": "First time eating here. Food is flavorful and tasty. Hidden black owned gem will definitely be back to try more dishes."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURBNk04chAB",
            "text": "I wanna say....their jerk chicken is sooooo dannnnnnng goooood!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBay1qanJBRRAB",
            "text": "Best Jamaican restaurant in Queens"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfeDU3RXNRRRAB",
            "text": "The most authentic Jamaican restaurant in nyc..firstly i must compliment the staff for their friendly demeanor, and welcoming smiles A+. Secondly, the food omg ,well seasoned to the bone, finger licking good, the presentation of the food is absolutely attractive and price is unbeatable very cost efficient, with full portion, the restaurant front is clean A+.\nIt was an honor to support this gem and will be back. When in NYC make RyRy’s kitchen the #1 go to restaurant.. Chefs kiss."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfc3ZEWExREAE",
            "text": "Sooo disappointed in RyRy!!!\n\nI used to get a small plate of pasta and oxtail for 12 dollars at least once a week exactly enough for me to eat.\nNow they're saying they have to sell me a medium and the price doubled. When I asked about it, he said price changes... I understand prices change but DOUBLE😳??\nHe also charge me for the pasta as a side by itself...\n\nNow I have to find another spot around work for lunch. 😫"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWMVBtZGtnRRAB",
            "text": "I had the garlic salmon today and omg!!! EVERYTHING!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaWM2cmJREAE",
            "text": "The food is flavorful, BUT the jerk chicken is not cooked thoroughly. The first time I got the jerk chicken it was cooked and it was really good, then after a couple times i realized inside the meat was reddddd. I’m not trying to get salmonella. I had to stop buying that and just get the sides. I got the shrimp today and there was a fly in it. On top of that they play favoritism to the people they know and the people from their country. I’m giving you money just take my order and my money and move on. That’s just going to start an argument."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdy1EcEV3EAE",
            "text": "I was really looking forward to trying this place, but the pricing was unnecessarily expensive. I ordered salmon with pasta and vegetables, which was $20 for a small piece of salmon. It felt like poor value for the portion size, so I decided to walk away without purchasing. Disappointed.\""
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ODkyWnBBRRAB",
            "text": "I live all the way in Flushing and Genesis is closer to me, yet Rayan's  my 1st preference always.  My teenage son chooses to have his meals bought only there. And without  any hesitations Rayan's food is delicious!  Although his new server's decreases the average amount of food when serving. But hands down you wouldn't be disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NjlYV0FnEAE",
            "text": "First time getting food from them. Honestly the first time I ordered(via Doordash) a month ago they ran out of oxtails and cancelled my order. This time I ordered Oxtails, Jerk Chicken Empanadas and Mac & Cheese via Seamless to pickup.  They cancelled the jerk and Mac. Pretty disappointing.\n\nBut besides that the oxtail were meaty and flavorful. The sauce tasted tomatoey which was fine.  Rice & Peas were fine as was the cabbage.\n\nId get food again I just need them to either have food advertised or edit their online menus to what they actually have."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMkt1VzZnRRAB",
            "text": "I placed an order for my birthday and the chef made it extra special. Flavors were on point and so fresh. I LOVED the caribbean shrimp tacos. Def a must try."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNnAzbTRBRRAB",
            "text": "I had such a wonderful experience at RyRy’s kitchen. The customer service was immaculate. I had the jerk chicken with the rice and peas, with oxtail gravy, and let me tell ya, they did not shy away from the gravy. I also had the Mac and…"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbWVfQl9RRRAB",
            "text": "Saddened to have orders cancelled because the food was sold out BUT there’s a reason why the food was sell off.  The food is amazing !! The jerk tacos were flavorful . The oxtail was well trimmed  with NO FAT on the oxtail, and the bone was cooked good . Food was not oily and everything fresh !!! Will be back . Thank you Chef Ryan.\n\nUpdate : don't go in person . The woman at the cashier doesn't know what she's doing as a cashier and will have you pay twice for a meal If you're not paying attention. Food still good though"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdTlETFFnEAE",
            "text": "I tried the Jerk Chicken Sandwich for $7. It came with a good sized piece of chicken with cole slaw and the sauce in the sandwich. The chicken had a nice char grill flavor to it but I did not really taste much jerk seasoning. I tried a piece by itself without the rest of the sandwich and I could taste the jerk seasoning a bit more but it still wasn't that noticeable. As a jerk chicken sandwich it needs more seasoning but as a grilled chicken sandwich it's great especially since it has that nice char from the grill. I would buy it again but not if I wanted jerk chicken."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcVppdUN3EAE",
            "text": "The salmon Rasta pasta was absolutely delicious and this review is well overdue. The salmon was super moist and flakey and the Rasta pasta is the best I’ve had in Queens. I ordered through DoorDash for pick up and it was ready when I got there. Can’t recommend enough"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dmR6eEx3EAE",
            "text": "Their jerk chicken is really good. Try to go when they start lunch at noon for fresh jerk chicken. Also the kale salad was delicious. The only thing is that it’s Not the best atmosphere and parking is not ideal. But the food is worth the trip."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOODczMjZ3RRAB",
            "text": "My first time here & the food was AMAZING. So flavorful. You get a lot for just 8 bucks"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMG9qZFF3EAE",
            "text": "Deliciosa comida Jamaiquina, probe el Salmon y el Rabo, acompañado de Pasta. Seguro en mi próxima visita regreso."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueDkzVFdBEAE",
            "text": "I found out about this place on Instagram and Tiktok which claimed it was the best Jamaican food in Queens. The food was lacking in flavor. The portions were satisfactory and prices were decent. I hope to visit again and have a better experience next time.\n\n**Update**\nMy second trip it was trash, the chef shown on Tiktok/Instagram wasn't there either time. The food lacked flavor and I wanted to like the food but this is a nah for me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcVlXa1p3EAE",
            "text": "Food  was delicious especially the jerk salmon and the salmon taco-a taste of Jamaica with a twist. You have to try the Kale Salad- they have a homemade salad dressing which is delicious 🤤 and definitely my favorite."
        }
    ],
    "reviews_count": 51
}