{
    "name": "Chris and Sons Roti Shop and Bakery",
    "place_id": "ChIJ33_XJGZhwokRWZyzMgyVm4k",
    "grid": "QN12",
    "address": "198-21 Hollis Ave, Jamaica, NY 11412, USA",
    "rating": 4.6,
    "user_ratings_total": 532,
    "phone_number": "(718) 740-0600",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMFdHUnVkMWhFTmpoMWFYUmlja2RQUm5VMlJWRRAB",
            "text": "My mom went here by herself and left feeling sad and confused about how she was treated. She ordered her food and then asked to add stew chicken. Instead of simply explaining, the lady behind the counter yelled at her for not saying it earlier and then made her wait while serving other customers.\n\nMy mom is such a kind person and didn’t deserve that kind of treatment. Customers should be spoken to with respect and patience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSmVtUnNNQzFFUmtaRU1HMVdkMVp0YlRkdmIyYxAB",
            "text": "Doubles and fritters were amazing! Love the authenticity and simplicity here. Will be returning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjM1gyeEhVMUJMTlcxRlIwVk1URkY1TWpSRmRsRRAB",
            "text": "The meals were amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeFNWQkZha2hxWkdSUWExb3plRWRDYzJ4RFRrRRAB",
            "text": "Very Rude Workers! I called in for order prices driving from 3 hours away and the female spoke so low on the phone I had to ask her to repeat herself and she huffed and puffed like the big bad wolf from 3 little pigs !!! and hung up the phone !!! ... The phone call took place 08/19/2025 @ 1:32pm and I was told they aren't making anymore pholourie for today but they closes at 6pm."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWlEwUnZZVE40TmpGV1lYQmtMVXhZVjI5QlJYYxAB",
            "text": "I love this place. It’s really good food💚💫✅"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMlNGOVJMWEJmWWxKek56RnFZVlZqUVc1NUxWRRAB",
            "text": "Good Morning.\nGod bless very nice service. By the lady, I did not get her name, but I'm sure she's always there. The doubles chicken, amazing. The little candy sweet funnel cake with Caribbean. Honey, amazing the solo soda's Trinidad in soda, amazing Thankful for the service and the knowledge of what I was buying.Traditional Caribbean hot food breakfast.Nothing processed\nhollis queens run DMC LL CooL J"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV1IzSnJWbmR4YWxoWk4wTmFjWGRmUlVKYU4yYxAB",
            "text": "I called to order food this morning since my aunt just passed. It was going to be a big order. The man that answered said i could order it and they can get the food delivered. He put me on to an a lady that was rude. She confirmed she could get it delivered then after i called back to confirm the order, she says \"Call me back when you know what you doing and you get your own cab\"!!!! Then she hangs up on me. I hope the owner addresses this with her. I went to another Roti Shop nearby that was extremely understanding,  patient and gave them 5 stars. So sad to be treated this way."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdE1YTnNWVEp5ZUUxcVdtaGlVamRuWDNKd1RuYxAB",
            "text": "Calling all trini’s!! Randomly stoped here as they were closing instead of waiting in traffic. They were excellent!! Kind from the start, weren’t upset that I came in as they were closing and not the mention the food was delicious!! The ratings are telling the truth!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMX2c4Wld3bWJySVR3EAE",
            "text": "To tell the truth I came across this spot I think last year. And I haven’t stopped going back yet. My family loves to eat from here. Nah de food eat good every time."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMnRfV053EAE",
            "text": "Friendly staff and the food is not expensive."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMTdxSDFnRRAB",
            "text": "The bake and shark was amazing and the doubles are the best I have tasted in a long time. Must vist spot"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdHRUSGJBEAE",
            "text": "My Guys\nBig up,Bless UP\nFOOD GREAT CHECK THEM OUT."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cVpYUXh3RRAB",
            "text": "Great food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRaTVPb0dBEAE",
            "text": "Delicious and the proprietor even gave me free coconut bread since it was my first time 😘😋 will definitely be back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX2Ryd2VREAE",
            "text": "Tried doubles for the first time two weeks ago , decided to try this local spot and since then I’ve been hooked. Tried two other places after that were good but none quite like my first experience. I was also given a currrant roll which was delicious as well. 10/10 overall experience and I’ll definitely be a regular there"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnME5TTFlBEAE",
            "text": "Under new management."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcHBYLUp3EAE",
            "text": "Love this spot to get my doubles! Living in Nassau county, this is the closest location to having a good authentic double. Get out there early in the morning and get your doubles with all the sauces! The ladies working in the front are also super nice which makes for a great experience overall! Also, it’s a to go shop, so order ahead and pick your order up!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdUxfMHl3RRAB",
            "text": "Nice little spot serving tasty food. Friendly & polite staff. Doubles was good."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybzZ1M3hBRRAB",
            "text": "I don't know if it's under new management or what but my chicken roti was dry and didn't have a lot of chicken in it. Not a happy camper. 😞"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyM1B6OVlnEAE",
            "text": "I had a very delicious veggie roti. Great customer service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwcTZHWFBBEAE",
            "text": "This is the worst resturant I've ever been to  service is bad ,servant is nasty and their attitude is nasty also the food is not tasty they give you food from the day before ,,(to explain myself) the food they cook today will be serve next morning,,,I'm a cook and i went there and the food is not to FDA standards.....people be careful buy food ther bcuz their food is not fresh and you can get sick really bad....my kids got sick eating the food from this place ...its disgusting....I'm TELL YOU'LL DO NOT BUY FOOD THERE....I SAW THE FOOD SERVER PICKING HER NOSE WITH HER GLOVES ON THAT SHE WERE SERVING FOOD WITH AND I LEFT THE RESTURANT....ALSO THE PLACE IS NASTY....I ALREADY MADE A COMPLAINT TO FOOD DEPARTMENT OF NY CITY..IM TELL YOU'LL DONT. BUY FOOD FROM HERE...P.S.the owners before the oringinal chris amd son was the best ,freindly and respectful..and their food was always fresh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5a0xfd2p3RRAB",
            "text": "I loved the customer service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNka3E2a1hREAE",
            "text": "The best doubles I've ever had and the biggest bargain meal. Totally worth the half hour drive to get there. Get all the sauces. So delicious"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROemE3Tk53EAE",
            "text": "Love this place..great food..good ppl.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURON2NQcXR3RRAB",
            "text": "I ASK FOR 2!! 2 doubles and i got 1 AND A HALF SMFH!!! I am not say not to go there but do better!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUROOFpWdhAB",
            "text": "The food was very good 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOdWFDRE93EAE",
            "text": "Great food and great service you will not be disappointed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdXNqRk5REAE",
            "text": "Best doubles ever"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeHFPNGp3RRAB",
            "text": "I’ve always loved this place !! Since like 2019 I’ve been coming here for roti, doubles & shark bites. They’re absolutely amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMThEaURBEAE",
            "text": "The food here is so delicious. Although management has changed the people who serve the food are always the same. They are so nice and patient."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsOF96QU9BEAE",
            "text": "Best best best fish roti.\nAnd Mom loves their chicken soup.\n\nOnly wish they had regular hours....they always closed lately when I'm hungry 😩\n\nAlso, treat yourself to the shrimp doubles."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdnNuSEJREAE",
            "text": "Bringing the Home taste atmosphere to us in NYC"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaanRyR1hREAE",
            "text": "This Roti shop might be the best in NYC, it is truly exceptional. The roti itself is of the highest quality, with succulent chicken and a delightful curry top tier. The doubles are simply amazing, especially the curry chicken doubles. The authenticity of the food is unparalleled, making it a true culinary experience. I absolutely adore this place and consider it the best for doubles, Roti, and aloe pies. However, it is worth noting that they sell out quickly, so it's best to visit early."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaX0pXQnV3RRAB",
            "text": "Excellent. The food is delicionos and the best in town"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaalBhZE5REAE",
            "text": "Top shelf customer service.  The very pleasant staff asked questions to ensure that my order would satisfy.  I ordered doubles w/boneless curry chicken (with everything), boneless curry chicken roti, curry goat roti, cornmeal pone and a currant roll.  My feed back on the doubles and curry chicken is very, very good. The food had a good flavor and the meats were moist. The desserts were tasty as well.  I didn't try the goat (that was for sister and mother)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOU12SF93RRAB",
            "text": "Better than Trini food from Trini. Came from Florida to get some authentic trini food and was more than happy with what I got. Nice staff , quick service , y’all keep doing y’all thing . Thank you ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOE96ZlpnEAE",
            "text": "This spot got the best doubles, aloe pie and their yuca cake which is also called pone is good. I had their curry chicken and rice which is also good, tried their buss up shot which js roti they are delicious and fresh. Love that you can get the doubles with chicken or without. Definitely a go to spot on the weekends, love the people love the food. Highly recommended for anyone who’s looking for some good Trinidadian food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdHBfc09REAE",
            "text": "Living in Nassau makes it challenging to find great Caribbean food. I found “Chris & Sons” online and they did not disappoint. I bought curry chicken & curry duck with buss-up roti Friday evening; and best believe that I was there again on Saturday morning for their bake and shark, and bake and salt-fish.\nEverything from their savory meals to desserts were fresh out the kitchen and infused with authentic Caribbean flavors. The teamwork displayed by the staff is the icing on the cake. The wonderfully women serving in the front are always in uplifting spirits and they take their time with every meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaEpmU2dBRRAB",
            "text": "I have to say their doubles, bake and shark, and polourie is absolutely delicious!! The shrimp doubles and the chicken doubles is a game changer!!!! I don’t think I can ever eat doubles anywhere but at Chris and Sons. Also, they are soooooooo friendly in there. Such a warm and welcomed ambiance! Their customer service is soooooo perfect everytime! You have to try them!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyeGFfTXRBRRAB",
            "text": "SO SO yummy!  Came out of the way to find this place and it was so worth it!  Never had such big amazing Dahl Puri and veggie curries were all very good.  Guys helping us were very friendly.  Highly recommend!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNna0l2X0ZnEAE",
            "text": "Walked there before the worst of the snow storm could happen and called before hand and the guy said that they close 5 pm only to get there 4:23 pm for them to say they are closed ... I am really upset everytime I seem to go there they are…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwcWE2QjVRRRAB",
            "text": "The customer service here is superb. The owner and his sons were very polite and accommodating, even though the store was packed with customers. The food was reasonably priced and tasted delicious.I will definitely be visiting this roti shop again in the future."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobTk3cHZRRRAB",
            "text": "I ordered the curry goat doubles, chicken roti, bake and shark, and some of their desserts. Staff were friendly and personable. Food was delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXczg3RjdnRRAB",
            "text": "Definitely one of the better roti shops in NYC area! There was no oxtail the day we went so we ordered goat roti, three vegetarian roti, 4 doubles and 4 courant rolls. Everything was delicious. Service was awesome as was the price = $52.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4OC16c1l3EAE",
            "text": "The food is great but the people that work there is very slow. Also they need to think about the other customer's who do not eat spicy rice. They need to make one without spice in it."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNjVYRThBRRAB",
            "text": "Had the curry chicken roti with potatoes and chick peas. Awesome. Been waiting for a good roti shop in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMnZ2aUt3EAE",
            "text": "Honestly, I want to give Chris and sons a 10/10. I went in after work on Friday and although it was busy they showed interest in each and every customer in a timely fashion. They were so polite and respectful I felt like i was home. The food was great and service was great will most definitely be returning."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpMDh6bF9RRRAB",
            "text": "Excellent service and absolutely delicious food 😋, There's a lil wait but worth it, you will not be disappointed at all, these guys are friendly and very helpful with your order so you get everything you need to compliment your meal. The…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3eF9LZ09REAE",
            "text": "I just came back from getting my doubles fix at Chris & Sons. The food is absolutely delicious. This place is my go to restaurant when I want a good home cooked meal.\nLet's talk about the food: their BBQ chicken is tender and juicy while having the right amount of sauce on each piece. The doubles are delicious!! Their baked goods: coconut drops, currants roll, coconut bake, coconut rolls, saheena is all a must try. I highly recommend to try their CHICKEN PUFFS!!!! I could eat that everyday.\nTheir entire menu is honestly a must try.\nAbove all, they are extremely friendly and welcoming. It is one thing to have good food but to have good food and great customer service is a winning combination. They have catered my daughters birthday party and all of my guests raved about how good the food was."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKN0xtSzVRRRAB",
            "text": "100% all five stars. This place is incredible everyone  is very friendly and knowledgeable of their food. Always gotta make 2or3 stops whenever I come from Georgia , definitely looking forward to visiting them next time"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvenN2WGdRRRAB",
            "text": "I gotta say, when i first walked in i felt a very warm homely feeling. the staff were very friendly and courteous and made sure your needs were met. their service was exceptional. the food is absolutely amazing!!! very fresh, very tasty,…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRN3VIakN3EAE",
            "text": "First off, I cam to this restaurant based on the reviews, and I must say, I am glad i did. When i walked in i was immediately greeted by who i can guess is one of the \"Sons\" (based on the picture on the wall). The place was clean and well…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvMS03YWxRRRAB",
            "text": "Decent and convenient location. Small/cozy atmosphere. Food is usually good and usually prepared ready. Food often tastes fresh, which is a PLUS. Pricing is a tad bit higher than most Guyanese/Trini restaurants I've been to. Good customer service most of the time. This location isn't a dine-in, FYI to other viewers."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJbXByRzlRRRAB",
            "text": "Great food, and great service. Occasionally they're super busy so there can be a wait. But that's to be expected when the food and service are awesome. The food here is literally made as though from home. I love it. And the \"Sons\" are very friendly and kind. This neighborhood needed this place ♡\n_\n\n11/25/2020\nOrdered twice in the past month, and their game is even more delicious! Service is still the absolute best! Love is love.\n_"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJNFBERHdRRRAB",
            "text": "Not only is the food excellent and heart-warming, but the family who run and own it, are simply amazing. Everyone is so nice and they make you feel like your part of their family. Thank you to Chris and Sons for keeping my  customer service experience wonderful every time!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaXEtSUx3EAE",
            "text": "This place is special. One of the rare spots in the world where I can take a bite and wonder if I’ve just eaten the most delicious thing I’ve ever had. Somehow the incredible food is matched by the hospitality. It always feels like I’m…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzdlBXUjNnRRAB",
            "text": "I would give them 10 Stars if I could.  I live in Jersey and I travel to Queens often for work. Even after a 2 hour drive back to Jersey the doubles was incredibly tasty.  Their tamarin sauce is very flavorful and now Chris & Sons is now my Roti spot in Queens. I can say without a doubt that I won't go anywhere else!\n\nThank you, Brandon and Mark! I appreciate your kindness and I can't wait to come back and try all of the food on your menu, not to mention your pastries!"
        }
    ],
    "reviews_count": 57
}