{
    "name": "NYAMINZ & JAMINZ CARIBBEAN KITCHEN",
    "place_id": "ChIJk9zs-ihhwokR-JnD3BOgfZg",
    "grid": "QN12",
    "address": "108-10 Guy R Brewer Blvd, Jamaica, NY 11433, USA",
    "rating": 4.1,
    "user_ratings_total": 95,
    "phone_number": "(347) 644-1214",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jd2VETnViRkowWmpoYVZ6ZFNaelIyUzJwdmFGRRAB",
            "text": "The food is so bad, I ordered ackee & Saltfish, the rice came hard and undercooked. The Saltfish was VERY salty, and the foot seemed to be old and just reheated for the order. It’s weird giving that I ordered food at 12pm so you would think it would be fresh. Couldn’t even eat it, had to throw it away. WASTE OF TIME AND MONEY."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaU1HTjNUVFF5WkMxV2F6UlhiRTFTUldwdFZuYxAB",
            "text": "Owner was accommodating & attentive. Food was delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preVIybzVlSEJzUzNwVVlrNU1SalF4U0RKSVNIYxAB",
            "text": "Food was great and freshly made. Really good, if you're a tourist like me try it out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSVVVc3RkemhxVnpaWE9XbEJaRE13U2tOcVVHYxAB",
            "text": "Some people prefer quality over quantity. But this was both. Most cheesiest rasta pasta $12 and added jerk chicken  $7 iv ever eaten. Also the portion size was so much that the container couldn't close. Check them out. I'd recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210R2NXOTROME5HVkZRelpXVkxaVll6Ym5GUVptYxAB",
            "text": "One of the best Jamaican spots in NY. Delicious Food and great timely service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJNFEzbFZWSGxhUjJOamMyaFBPV2hOVVZkWldFRRAB",
            "text": "Oxtail was delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeVVIWTJkMkZaTTNOeGFXMXRYMnRGYTFSNlZXYxAB",
            "text": "Great food and good customer service really love this restaurant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbVdrdFBhSGRJV2tGc1pGWjFSakpoY1VjNWEyYxAB",
            "text": "This is WORST Caribbean food I've EVER had...\nThe Oxtail was tough, flavorless and SHAMEFUL, the rice & peas was just rice with a couple of peas with NO CORRECT SEASONINGS AT ALL and they put COLD salad on top of the HOT FOOD...\nSix pieces of NASTY Oxtail and a plate of FLAVORLESS rice with a couple of peas is what I got for $23.00   SMDH\nALSO NOT TO MENTION I HAD TO WAIT ONE AND A HALF HOURS FOR THE DISGUSTING  FOOD...\nDON'T WASTE YOUR MONEY HERE!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMV2M1SkNyaTg3NkxBEAE",
            "text": "Unfortunately the food tastes blank.... For Caribbean food it has no taste. And the meat to rice ratio is crazy. I spent close to 40 bucks for mostly a tray of rice and cabbage. The meat seemed intentionally picked so it was small pieces and rationed, like there's a meat shortage. I think it's deliberately done esp when ordering from Uber eats and door dash. At least add gravy or sauce to the food to make it more palatable."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOTHpvcktvOXFpVnZ3RRAB",
            "text": "This place sell three or four days old food daily food be like almost spoil,they warm food up everyday ,even the patties the owners is nasty ,pasta noodles cooked for days"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvamFDbkx3EAE",
            "text": "I ordered festivals plaintains and jerk chicken through Uber eats. The festival was uncooked. Crispy on the outside raw on the inside. The plantains were not fully cooked. As for the jerk chicken. I wouldn't give an animal that to eat. It was burnt with charcoal and bbq space over it. Disgusting. I would never recommend this place. Diabolical and disrespectful."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOXZTbTBRRRAB",
            "text": "I ordered two separate entrees: Rasta Pasta ($17) and an order of Salmon ($13.75). Instead of receiving them separately, both were combined into one dish. The Rasta Pasta was overly wet and runny. The salmon was broken up into flakes and mixed into the pasta—not what I ordered or expected. Very disappointing experience for my first visit.\n\nHowever, when I called to address the issue, the staff was very apologetic and offered to comp my next meal, which I appreciated."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJblBPbUtBEAE",
            "text": "Best Jamaican Restaurant. The food was amazing as well for the customer service. Tashieka who served me was super nice. Will visit again !"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMHJtUm9BRRAB",
            "text": "UPDATE! New owners. Nice enough. Food way more pricey.\n\nGood food. The owner is really nice."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdG9DSkJBEAE",
            "text": "Pathetic really. Overpriced, overly salty, long wait times, bad customer service and bad quality of food"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaE95Z2l3RRAB",
            "text": "Joke of a restaurant. bought rasta pasta, they gave a huge amount which is fine. Didnt even pack it well. Used her bare hand infront of me. Disgusting. Throwed the food away instant. And the jerk wings. 6 wings it will weigh like 5 oz. Hilarious. Spend 20 dollar. Waste of money and time. Never going back and i hope you dont as well."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdlpxWkJ3EAE",
            "text": "I went across this restaurant sometime last week and NYC has been lacking as of late when it comes to Jamaican food. However, when I came here the flavor and the food hit the spot! It tasted like how great Jamaican restaurants would taste over a decade ago. The staff puts real care into their food. Since I’ve been here I’ve ate here 3 times. The great thing about this place also is that they’re consistent! The other Jamaican restaurants on the the Guy R strip are closed or just taste processed. Nyaminz and Jaminz tastes original and the main person here with the red hair is great and understands customer service. I would highly recommend this place anytime."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQZ0piVElREAE",
            "text": "When I try a new restaurant, I try the most easiest and common thing on the menu to try it out.\n\nI ordered two jerk patties. I ended up with one beef and one chicken. Beef tasted worst than school food, chicken tasted a bit better. Both patties tasted microwaved.\n\nThere was a lot left to bed desired. I can’t try more food if the patties weren’t enjoyable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYME5lbk1nEAE",
            "text": "For a $22 plate of oxtail with rice and peas, I got all X-SMAll oxials that had absolutely no meat and the ONLY ONE that did, the meat was rubber; the one I'm holding in the video. I spent $65 and had to throw my whole plate away. The Mac & Cheese that I got with a plate and a side order also went to the garbage, tasted spoiled!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudjZtOEdBEAE",
            "text": "Food was disgusting! Jerk chicken is dry and flavorless so were the rice and peas and cabbage. The Rasta pasta was gross as well who puts peas and corn in Rasta pasta? Idk I’m not Jamaican and my Rasta pasta is way better. I won’t order here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuanNYWlNBEAE",
            "text": "The food the bomb always eat good when I stop here they the best hands down cook with flavor sauna the best good customer service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubHBqSlpBEAE",
            "text": "Great food, great place, and great people . The Mac and cheese was amazing, as well as the plantain"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubkpHMVVBEAE",
            "text": "Is a place really beautiful the employees nice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubk82Q2t3RRAB",
            "text": "Pretty good food. Nice service and pretty clean place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MG9lUktnEAE",
            "text": "The staff are super friendly and attentive. The food is amazing and freshly made,  I recommend this spot if your craving some great food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3amJ2dndnRRAB",
            "text": "Today while wondering what to eat as indecisive. I came across this inclusive restaurant on 108-10 Guy R Brewer Blvd in Queens NY & I order a stew fish & rice. Listen it’s was deliciously good. As a Delta airlines employee. They’ll see me often although I lived far….their food is delicious 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3alpDbDBRRRAB",
            "text": "The food is amazing  and amazing  customer service,  friendly  and make you  feel comfortable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MWNPTmF3EAE",
            "text": "Their jerk chicken is so flavorful with the right amount of spice! There was jerk chicken on the grill outside the restaurant so you know it has to be good. It was about $14 for a meal, which included a drink. I highly recommend getting the jerk chicken with the rice & peas and fried plantains with the stew sauce and bbq sauce drizzled all over. Can’t wait to go back to try some jerk chicken Rasta pasta!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bVkySXF3RRAB",
            "text": "I order jerk chicken n rice n 🫛 n oxtail and it is breathe 👌 taking 😋 i love it please order 😋 yours i give it 10/10 the place to be is NYAMINZ&JAMINZ"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiZ2JtWjl3RRAB",
            "text": "The food was 10/10 delicious and yummy 🤤it  was also a good customer service their and good workers they are always on time and the restaurant is always clean and tidy I recommend all of you who see this comment should go and try NYAMINZ AND JAMINS🙃"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM3FPLXBBRRAB",
            "text": "I try different meals everyday and I must say, their food is amazingly delicious. If u want a taste of Caribbean/Jamaican authentic food then this is the place to buy it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MGQ3cmJREAE",
            "text": "Good to go"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaU9uOEN3EAE",
            "text": "The food at this restaurant is authentically Jamaican. I had a boat ride last year in Freeport, Long Island. The owner/chef not only delivered the food to my boatride but also helped to set up. This is by far some of the best customer service I've ever experienced. My guests raved about the food all night.\n\nThis review is long overdue and I just realized that I hadn't written one. Better late than never I suppose! 😌"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleHBpUGZREAE",
            "text": "This man Niko (owner) was one of the nicest and most hospitable people we've had the  delight of meeting in nyc. This is a small shop that nyc has to try.\nThe food was impeccable. He even gave us a few samples when we were casually talking about the menu.\nThis restaurant is the true definition of a hole in the wall, the food puts the SOUL in soul food. We had the jerk chicken, ox tail, and fried chicken with fries. I highly recommend the ox tail with rice and vegetables and the soup of the day (cow foot SO GOOD). The portions were also HUGE at affordable prices.\n\nNext time im in new york i will visit this place time and time again. Thanks for filling our bellies!\n\n-steven and nicole"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMFBiSXFnRRAB",
            "text": "Best halal jerk chicken in NYC"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPck4zUm93RRAB",
            "text": "Been coming here for 3 to 4 yrs. I usually order the rasta pasta, made to order so it takes about 10-15 minutes. You can request how you like it (spicy, creamy). Jerk Chicken and fried chicken are also really good. When I'm waiting I get to sample the soup or juice of the day that I end up ordering because its 👌…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2Z3BMNFdREAE",
            "text": "Good  Food, I love their oxtail dinner😋 friendly people and good prices 👍🏽"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDOGEyMFdREAE",
            "text": "This restaurant is definitely a top chicken slash Caribbean restaurant. You can get the best of soul food and Caribbean food for a decent price.thier jerk chicken with rice and beans is also on point.\n\nDon't for get about their oxtails and peas with rice an some plantains. Makes for a really good Caribbean meal.\n\nMy wife said that their oxtails are better then alot of Caribbean restaurants hands down.the staff is cool great customer service. The prices are reasonable, and wait isn't long at all.\n\nAnd the atmosphere is mellow. This spot is definitely a  hidden gem on the south jamaica side area, on guy r brewer and 108."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLeGV2RXNBRRAB",
            "text": "Fun"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5bWUyeWxRRRAB",
            "text": "Great food Great place 😋…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMXZDZnVnRRAB",
            "text": "Food is extremely fresh to order. We enjoyed this!! It was so delicious and we definitely recommend!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5cmNqc3J3RRAB",
            "text": "Let’s start off with how hungry me an my girlfriend was so we decided to look online for a place an we stumbled across this restaurant it’s a Jamaican meet soul food restaurant when we walk in I couldn’t believe the customer service that…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpeUlTb19RRRAB",
            "text": "Loved this place , food is delicious , food tastes so fresh , very welcoming , gave my mom and i samples of the food , gave us some hand sanitizer as well ,  just amazing !!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTMHFfdVpREAE",
            "text": "Place is super close. The guy working at the evening is super friendly and the food is usually always delicious. Would definitely recommend this spot."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZbi1INVp3EAE",
            "text": "They have good oxtail .and they give u a lot and prices are great too.better than golden krust!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NU1PSnFRRRAB",
            "text": "Food is great!!! And customer service is excellent.. everyone is very pleasant"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBM3NpTmtRRRAB",
            "text": "Food is great. Prices are fair. Customer service is excellent."
        }
    ],
    "reviews_count": 47
}