{
    "name": "D Roti Hut",
    "place_id": "ChIJiUwz33ZhwokRw9cm7WCphoA",
    "grid": "QN12",
    "address": "208-01 Jamaica Ave, Queens Village, NY 11428, USA",
    "rating": 4.6,
    "user_ratings_total": 933,
    "phone_number": "(347) 676-5000",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMk56QXhkVTkxZW5VMVoyOUtWbHBPU1doRFZXYxAB",
            "text": "Popped into D Roti Hut for the first time and, honestly, I wasn’t prepared for how good that roti would be. Soft, tender, not too oily, the sort of roti that makes you stop mid-bite and reconsider all your life choices. Perfectly matched with their chicken curry and channa, which had just the right balance of spice and comfort. It’s proper food, rich, hearty, and clearly made by people who actually care about flavour (a rarity these days).\n\nWashed it all down with their Seamoss drink: seamoss, milk, vanilla, and nutmeg, and it was a revelation. Smooth, slightly sweet, and surprisingly soothing.\n\nThe place itself has great character, bright, colourful, and full of good vibes. There’s even a row of arcade machines by the window, which makes it feel like you’ve wandered into a Caribbean café with a side of nostalgia.\n\nEuki, the manager, was wonderfully welcoming. The kind of friendly where you immediately feel like a regular. Kephan, at the counter, was just as brilliant. Cheerful, attentive, and quick with a smile. You can tell the team here genuinely enjoy what they do.\n\nAll in all, top-notch food, great people, and a proper good roti."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSlVuUlljWGhxTm5KRFNEQkVSMkU0Y3pWMWQwRRAB",
            "text": "Food are great, we always come to this place for Doubles 😊"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGelVtRXpNekowYXpadmF6bFJTRGxxWlhkdlVYYxAB",
            "text": "The food was fresh, and delicious! We had the aloo pie with beef curry and some doubles. Sooo good. The atmosphere is good, Euki, Sharda are friendly, the music is good and the vibes are good too. We will definitely be back!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdWNVNXhUbXcxUXpGa01FSnRaVmxoYmtwMFJXYxAB",
            "text": "First time eating at D Roti Hut and the food blew away my taste buds (literally!). The Aloo Pie and Doubles are hands down “A True Caribbean Taste”, as written on their storefront. I’m definitely making another trip back here!\n- Rosie <3"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KM1FuUlVWR0o2VEhSd1NtNUpia0pyUkdNNVdrRRAB",
            "text": "Food was so good I practically swallowed it chile leaving no crumbs !!\nThe Buss up Shut with curry goat 10/10 !! Food was delicious and the Staff was very nice . This is my new go to spot !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMVNXaFlTV3N6Vm5RME1VbElhMUJHZVZGemFXYxAB",
            "text": "Vee and Sharda are great the food was delicious."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGalZtSm1TMTlzVDNKRlFWRmlWbEprUVVoVVQyYxAB",
            "text": "D Roti Shop in Queens never disappoints. The food tastes just like home this place hits every time."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdlVGUkphMGhXVTFKQ1UxWXhhREJCTWtKdFMxRRAB",
            "text": "I must say the food at D Roti Hut is like eating at a friend’s home! I work with the Consulate General Office for my Country and have ordered a couple times from this establishment for events we hosted and the food is always tasty, on time and portions more than enough! I fully recommend 😋"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNVNEaDZSbkZKY0Vkek1WSllPVVU0WDJsU2VGRRAB",
            "text": "Authentic Trinidadian roti and doubles, bursting with flavor. Generous portions, fresh ingredients, and friendly service. Best prices for some good food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cb1F6bHFZa0UxWVd0bWNERjNlRUo2V0hoVlExRRAB",
            "text": "The last straw that broke the camel back with this place! When the guy first opened, I always visited and supported him, but a couple things. Attitude and professionalism goes a long way. Also, when you present your food, its not just for Caribbean people, think about people of other backgrounds, look at the food, if it does not look presentable to you, why would it be presentable to others? Now, today is a religious day, and I understand that orders are high......but if there is a wait for roti.....45mins wait. Don't you think its imperatives on you as a business to tell the customer that first??? Instead of having them purchased the food first, then tell them after that there is a wait for the roti!!!!!!!! Its very dishonest, disorganized, and it seems like Pennywise, pound foolish, because why would I ever return to your business after you had me wait 45mins. The lady then said, I should stop discouraging her customers, she gets upset when you talk and correct them, or point out the nonsense, i told her, im not discouraging your customers, you should have told me that there is a wait for roti of 45mins, not just say that i have to order the roti at the cashier, that does NOT tell me that i have a wait of 45mins.....what-ever a customer and I converse about...it our business!!!!! If you do not like bad publicity, then simple, be honest!!!! Do not have people purchased the food first, then tell them after that there is a wait after!!!!!! Now, you have less customer that's willing to ever support your business anymore!!!!! But, I understand that its busy, due to the occasion, and maybe it slipped your mind, but i refused to eat food from people with negative attitude, so I threw it out! This would be the last!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM1dqZDFSVzVXUWs5WFVsUnRSUzAxU2toU01FRRAB",
            "text": "I have my favorite food spots in the area, so I never tried this place.  Decided to give it a try today and I regret not trying sooner.  Place was nice and clean, food looked good, freshly prepared, and the staff was all friendly.  Will definitely visit again soon."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cFFYWkVjR3M0ZDJSU2NGTkhlVWx5UW14QldVRRAB",
            "text": "Bought some roti and doubles here. It was so delicious. Definitely worth visiting. 🇹🇹"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNGNHeENYekZyVGpsS1VXOXhOSGxOYjNCRmFXYxAB",
            "text": "Enjoyed dinning in and took double to go. Great spot and the staff was kind and helpful"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSc1IwMXRPWGd4WVVjMmFrWnJWMmM0VjBSVlRFRRAB",
            "text": "Good Caribbean food"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUVYyVkJZWGhtVDJOME1YaHlVVlpEUm5kclRWRRAB",
            "text": "Friendly place & I love the food"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdGEzUkpkRWRJUWpWWlZrZERlVVV4WVV0c2VsRRAB",
            "text": "Vee, Q, Sharada and Angie provided an excellent experience with my complicated offer. Very delightful from the service to the register. Food was great!! Look forward to my next visit!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRllsOTFVV3hDUlhSVVJsTnViRkZFTm1oV05XYxAB",
            "text": "Best roti shop this side of the Van Wyck.  Good doubles, pholourie, etc. They also have a wide variety of imported food goods from Trinidad"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eGNWbGxUVFF4Ykd4eUxUSlpOMFUyZDA5VGFsRRAB",
            "text": "Awesome music, food, and friendly staff. Coming back here for sure."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNWQxSm1hM05xU1RGWWFVVTNMVTgwY0UxMU9IYxAB",
            "text": "Euki served me my food it was my first time here and he was super nice and helpful. Keshan helped me pick out a drink too and the combination was great."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWWNGQTNNaTFJVTBORVJrNVVSMDVuTVVKMFpWRRAB",
            "text": "Great food the best in queens village"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sc01VTlFhakpFU0VWS2MxTlRPVlZCUlhGcFVVRRAB",
            "text": "Been there a few times. Food is good and staff is ALWAYS pleasant"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrM05sVkdUbWRUTVZkU2VqYzJjbUZYTWxCU2RrRRAB",
            "text": "The food is always great at this place. Maybe the best the best bake and shark in New York(without the rip off price of some of the other places,), Euki and Sharda was very helpful\nAnd even introduce me to some new plates!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcmFVdElSRzFLVlZkT05XNHlSVkJ5VmtjNFFWRRAB",
            "text": "I decided to stop here on my lunch break today and get some doubles. It was my first time coming here, the food was delicious. But the customer was very poor. The Spanish girl at the cash register, I believe her name was Jo-something. She was very impatient and unhelpful. When I asked her questions she was responding very rudely. I hope next time when I come I have a better experience."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMmJubFRaRWRaYTFVeGFsTmlRVXBKYzNVMVgwRRAB",
            "text": "food always comes in variety. the staff and the atmosphere are very friendly."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGYWVXY3pjbnBRTkZwcmMwOTJOeTFqWVVGVlJuYxAB",
            "text": "So you should RUN OVER THERE... don't walk... the reviews are real. I was greeted by Euki, Johanna and Sandy (who took my order). I came in for doubles and mac n cheese and curry coat. The mac was done (not surprising considering the pictures online). After seeing all the food laid out, I decided to try the curry whole snapper with a side of plain doubles.\n\nLet me tell you something...AH---MAZE---ING! It's easy to ruin fish but this was packed with flavor. The curry sauce was delicious and I'm so happy I paired it with the doubles. If you like hot sauce, this one will kick you in the face WITHOUT ruining your experience. It does not linger after consuming (for me anyway).\nI'm looking forward to getting this again with the mac n cheese along with trying the rest of the menu.\n\nWell done!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGd2VsRnJTM0l6VWpsa1VFNW5kMEpmUjI4eFdFRRAB",
            "text": "I visited my old neighborhood and stopped in at D Roti Hut. It is a location I have visited before for the simple fact that the food is good the staff is excellent. This time I tried something I didn't never had before pepper roti to be honest with you it was delicious highly recommend anybody trying it. The curry shrimp and rice were delicious the Aloo pie is a favorite. Thank you very much to the staff Euki,Johanna and Keshon. Thank you the recommendation see you guys soon."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUmREQm9TVU4yZEVGd04zaHNkREJaY0ROUU1rRRAB",
            "text": "Food is amazing and the price is great too..Employees are very helpful and give excellent service, especially V she was very kind thank you. Will always come back especially for thier doubles..."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210emFIcEpRV3BxZVV3M05UZFhjV1U1VVd4WmVXYxAB",
            "text": "Great food, well seasoned.\nHaven’t been tired coming here to my new spot, but I do get tired after eating 😁.\nThe price is also great for the amount received."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGLTlLOGlnRRAB",
            "text": "Great place the the food is exceptionally well and the vibes is unreal v is amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S2NrWXpOVXBKZEdSaFprNTFkVU0wYTFBd1dGRRAB",
            "text": "Always good service when I visit by staff…today was exceptional.\nI was introduced to a double with curry chicken and it was soooo delicious.\nI saw a customer ahead of me order it and then I questioned the staff, like is that really a thing lol. I didn’t know you could add meat or shrimp. I definitely will be back to try the shrimp.\nThe staff was awesome and helpful…\nEuki, Sharda and Keshon…thank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbmQwMXRZMGsyUkhoRFoxUlpaamczYW1keGNtYxAB",
            "text": "I’ve been coming to this restaurant regularly now to get doubles and pholourie whenever I can. The quality and taste of the food is always amazing. There are games to play to pass the time whenever I’m with friends. The service is on point as well. Would recommend this place to everyone I know."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdVpGb3dlbTVtVUcxbE4xQTRWV1kzYlZnNFRrRRAB",
            "text": "The food is excellent. You may have a short wait, but the quality makes it well worth it. Truly the best West Indian in the area—I'll keep coming back for more."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kZlYwUjFhR2xKYTFaeFlWVlhaMGxCTTFZeWVGRRAB",
            "text": "Really a nice spot in Queens. I was very happy when I seen a sign saying all their meat is halal :). There is no menu but you can see all the food selections they had. I ordered the curry chicken with roti and the portion was huge. The person who checked me out name was Vee and she was super sweet. My meal was under $11. Overall, a good place, with good portions and good prices. I will definitely come back here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gd1RuRnVZakpyYkdsaU5XZENlbG90Vld3MWFYYxAB",
            "text": "Big up to my Euki K. Nice and pleasant lady who made me try Doubles ( love it)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weGRsTXhZbTlvWkRObFV5MTJSMVZxWjNCMFEyYxAB",
            "text": "Truly love getting their doubles & always pleasant customer service. Thankful for Euki, Sharde & Johanns for their hospitality."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMk9HUklYMFZJVkhkc1YyTlJXVkZDVFRoSFgwRRAB",
            "text": "One of the best doubles I tried in Queens...Thank Euku Sharda for the great food and service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeVExWTFhVTl1U0daMU9YcG9UamxMUVVWQmEwRRAB",
            "text": "I skipped going to Triniciti because of parking. I decided to come here, based on the reviews. BEWARE don't buy from this establishment. The food gave me food poisoning and cause Diarrhea. Besides getting sick the food was terrible, like a diabetic chef was cooking. No salt and seasoning. I literally garbage about $100 worth of food, I hate wasting food but this is not edible 😑."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aFEzQXRNelpzYlRWaVZ6bE1VMVI1VFUxSmNHYxAB",
            "text": "Ok so I live in the Bronx and was in the area for work today  my Wife is from Trinidad and since her Grandmother died she hasn't had a good authentic Roti so I decided to surprise her the staff at this place is super friendly and patient with me as I ordered 10 doubles oxtails with fried rice and curry chicken with roti when I tell you the food is good the food is good vee was at the register and recommended a nice dessert that my wife might like to help lift her spirits and I really appreciate that I will definitely come back and this might be my go to spot from now on so to the staff thank you and to the cook God Bless your Hands my wife hasn't stopped smiling since"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbVNWRjZjMUp0WlVaaWRVODVPVWhVWVVndE5XYxAB",
            "text": "The food is always delicious. Love their food. The staff is very nice. And love the carribbean music playing in the background."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cc2EwbDBWazVhVTI0NWJVWnZaVXhzZUhwT2NVRRAB",
            "text": "Love this place best foods and very generous and respectful staffs."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPcm5uZUtSbF9QUmFREAE",
            "text": "As someone who has never tried Trini food, this was a good spot. My brother loves Trini food so we saw this spot was only 10min from our crib. Kamini, Vee, Rhea & Uki were so sweet and helpful! Ordered the doubles, curry goat, homemade juices & aloo pie. Everything was so good! Orig wanted to Jamaican & Sorrel juice but it sold out so fast 💔 however we end up trying the Mauby & Soursop juices and we loved it so much! Def recommend 😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcmw2Y09kdm9LV19RRRAB",
            "text": "Fantastic west Indian restaurant. Has all the classics here. Their doubles are excellent, flavorful and fresh. Nice selection of authentic curries as well. Very chill and civilized atmosphere without the craziness you often get on liberty avenue. Cool set of arcade games, pretty plants, and lots of light."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdXNUVWZREAE",
            "text": "Absolutely phenomenal food, an easy 10/10. Eve and Qkie create such a warm, inviting atmosphere with their genuine hospitality and great sense of humor. You don’t just feel like a customer here, you feel like family."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdVRtTTRVbU54ZHpsMldXMU5WeTF1ZUhCNFJXYxAB",
            "text": "V and Candice were amazing!! They treated us soooo well! The food was prepared to perfection! Super friendly and helpful! We will definitely return on our next trip back to NYC! Def come and check out this spot right on Jamaica ave!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQbXJpcm13emRHQlN3EAE",
            "text": "This spot is now my go-to after two visits! The curry goat, bake and shark, and chicken and goat roti are all so tasty. It’s the consistency for me. Only feedback: a visible menu would streamline the ordering process and reduce confusion about portions and prices."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVlRWWk9lbkZPWjIwNVNHTldRM1pIYldKSVFVRRAB",
            "text": "I now fully understand why this restaurant receives bad reviews.\nWhile some of the staff are exceptionally kind and friendly, there is one specific employee with an incredibly nasty and dismissive attitude toward paying customers.\nThis cashier, an older woman in her early 50s who appears to be of mixed Amerindian/Native or Chinese heritage, was working on Monday, September 15, 2025, from 6:45 PM onward. I'm fairly certain she is well-known for the poor service  based on other customer reviews.\nI purchased my food and, seeing no bottled water in the refrigerated case, asked her if I could buy one. She responded by looking over and saying, \"Oh, there's none there?\" I offered to pay on the spot and said they could give it to me when a new supply was brought up. The cashier had the audacity to tell me, \"Oh, we don't have time for that right now.\" This lack of willingness to assist with a basic request was unacceptable and reflects poorly on the business. As a customer, I believe it is reasonable to be served properly and with respect, and this level of disrespect is completely unacceptable.\n\nOn the  food ;\nWhile the buss-up shuts and oxtail curry were absolutely delicious—hats off to the person who made those!—I was incredibly disappointed with the doubles. They had no flavor, lacked color, and were so watery they fell apart. I literally had to hold them together  and shoe em down to eat it. Not an enjoyable experience.  They were honestly the worst doubles I have ever had. To make matters worse, the salara I purchased was moldy when I opened it up to eat today.\nPlease check the food from your outside vendors. It is still your responsibility to ensure quality control for everything that goes out of your establishment.\n\nCustomer service and a respectful attitude are non-negotiable in the service industry. The idea that a bad attitude is acceptable because of a \"West Indian\" cultural stereotype needs to change. It is unacceptable and hurts your business. You MUST (NOT SHOULD)  train your staff to be respectful, as your customers are the backbone of your business. Do better—your customers deserve it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3d3FyVzlnRRAB",
            "text": "I grew up in the neighborhood but now live in FL. I was driving down Jamaica Ave and saw D Roti Hut. I found parking and went inside. First off, the greeting was super friendly. The staff was patient and accommodating. Kamini, Vee and Nats were truly amazing. Now let’s get to the food. The Dhal Puri was fresh and the curry chicken had the right amount of kick to it. I ddnt even have to ask for extra gravy. She understood the assignment. The rice and peas was delicious as was the Channa and Aloo. I bought extra dhal puri roti to bring back to FL. This is my new spot for when I come back home and want fresh and AMAZING food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3b0liVmVREAE",
            "text": "I have been coming to roti hut since I moved back to NY two years ago. I always leave a rating, but the exceptional service permitted me to leave a comment. Such a wonderful team of ladies serving customers. They are very attentive. The…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dmVhMDdRRRAB",
            "text": "I walked in my neighborhood and the Lord sent me here. Being a Black Trini American growing up here I longed to find another Roti Shop. Walking in here was the best decision I EVER made not to mention the Christmas decor and Parang music! That’s the really Christmas Spirit.\n\nKamini & Vee showed incredible customer service. Vee has great communication skills and is very patient. Kamini is very thorough when preparing your meals and welcoming. It was nice to connect with Kamini while enjoying the wonderful food she prepared for me.\n\nI will be coming here more often. I didn’t  only find my heritage food but a community that I can call home.\n🇬🇾♥️🙏🏾🇹🇹"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVk9WcHFRMWx1YTJ4TlNsUmZWWG81UTJGd05VRRAB",
            "text": "Euki and Shanda were very hospitable and nice! Thank you"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa3ByZGlnRRAB",
            "text": "Doubles are so Good. We got the chicken and veggie.  Crowded because the fooood is Goood ! Service Excellent, thanks to Ladies  Kamie Vee Nats! 😋 😋 😋 😋"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURweHJ6YndRRRAB",
            "text": "This is hands down the BEST Trinidadian restaurant in the area! Food is authentic and flavorful, prices are reasonable, portions are generous and the staff is very friendly and accommodating! Very chill vibe, always clean and well kept with lots of seating. Good variety of food, great vegetarian options and everything is always fresh.\n\nI highly recommend the doubles and their corn soup. Their corn soup is some of the best I've ever had, not just in NYC! Bursting with flavors, all the vegetables and dumplings have the perfect mix of textures and just enough pepper to give it a nice kick! Doubles are the second best I've had in NYC (my #1 spot is a trek so I'll happily settle for these). Pumpkin, channa, curry mango are all fantastic and their roti is always soft and fresh.\n\nThe ladies are super sweet and also offer great recommendations and I've never felt rushed. If you see fresh mango chow at the register BUY IT, you won't regret it. They also carry lots of other trini snacks and soft drinks! Must visit if you're in the area!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNFpQWERBEAE",
            "text": "Food was delicious! I was haviing my car serviced across the street & checked out the place while waiting. Had Aloo Pie while in there. Ordered food to go, too (Chicken & goat with roti) They open at 6am for those early risers. Lots of people coming in & out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3LV96VEJ3EAE",
            "text": "Stopped in to get some lunch. The restaurant is very nice and the workers were very polite. We got the stew chicken and buss up shot, chicken curry and dhal puri and doubles. Everything was fresh and delicious. The dhal puri and buss up shot was so soft. My son enjoyed the doubles. Would definitely visit again if I’m in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSR1NEZGFTMlZUY2xnMExWTlBVMUZsU3pGUFYwRRAB",
            "text": "I definitely recommend this place! I've dealt with Mike and he was so great, so easy to communicate with, the ladies at the restaurant are all so friendly as well. I ordered some appetizers from here- mango chow and corn soup for my Khangan and again for my second sunday and it was so good, so delicious! Mike and the team are very punctual and once they know what time you need everything ready by, it'll be set and all ready for you. Picking up was seamless each time. My family and friends loved the food and are still talking about it! Thanks to Mike and the team, we'll definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdlgwbFFUeTAyUW10c1dXWkxURkJZZUZaYVozYxAB",
            "text": "I visited D Roti Hut based on its high Google ratings, drawn by the promise of delicious food. On 8/14/25, I ordered a curry beef double with potatoes and tamarind sauce, plus a solo cream soda, totaling $7.62. The food was amazing, and the server included 3-4 potato pieces, which I appreciated.\nHowever, when I returned today, 8/15/25, and ordered three curry beef doubles with tamarind sauce and potatoes, my experience was different. I noticed the server only put one potato in each double, so I requested 1-2 more per order, expecting consistency with the previous day. To my surprise, my bill came to $22.86, itemized as “3x doubles, $9 beef, and $6 veggie.” This was confusing, as yesterday’s single double with similar ingredients (plus a soda) was only $7.62. On both days, the server called out the order to the cashier, so I’m unsure why I was charged extra today for what seemed like the same items.\nWhile the food is tasty, this inconsistent pricing and unexpected charges left a bad impression. I’m disappointed and unlikely to return, as I don’t support businesses with unclear billing practices. Potential customers, be cautious and double-check your bill for accuracy."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnZ1BudEVREAE",
            "text": "Guyssss!! I must say I’ve found my spot for DOUBLES! Ever since my co-worker introduced me to doubles , I’ve been having cravings for it. I walked the world to find a good spot and I DID ! Try the passionfruit juice that was made by the Queen Vee Herself. To conclude this, the customer service was amazingggg! Everybody had a smile on their faces, and also accommodated me with everything. Thank you Kamini, Vee, & Uki !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNWRtTnFVR0V0UlU5TGFtVjRMVEZ3UlhwWGMxRRAB",
            "text": "This place is the worst, three strikes. The only thing consistent about this place is how bad the food is. I ordered curry chicken, the easiest thing to make and it taste like it was cooked for 15 minutes, it was tough and flavorless. The absolute nerve of this place to sell and package this food. I don’t like writing bad reviews for local restaurants but this is robbery at this point. Take pride in what you serve your local community or people will stop showing up."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aM2IxbE9XWFZDUTJnNWFraHFjbkJVWm5Cb1JFRRAB",
            "text": "Food is amazing!!! All other roti shops shrimp is over cook not here taste like they made it with love!!! 20 out of 10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcGMwb3hjR1l4UlVocVF6TlNZbVZFUmpKV1lrRRAB",
            "text": "Atmosphere and energy felt just like home, doubles were amazing, and service was on point. Special thanks to V for taking care of us, she’s really sweet and funny ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xack4zZEJlRlpuWm10dU0zVkZVVGRQYTAxQ1FrRRAB",
            "text": "Ordered today and spoke to Diane. She was extremely courteous. It was a large order for delivery.  She made sure it got there and was so kind to call me a few times to ensure the order was confirmed, transaction approved and the food was delivered. I'd highly recommend this Roti Shop."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbGJIb3dTVkJzY1hwc1JsQmphM05oTWkwNVpHYxAB",
            "text": "This place showed true expertise. Their dishes deliver on flavor, just-made quality, and healthful ingredients. Employees here showed good manners and I felt absolutely pleased. Friends appreciate both the vibe and food quality here. I'm completely sold on this spot and you will be too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSFNqZFVTRFIxZEVKSGNWQkhkR042UVZwU1FuYxAB",
            "text": "Really nice roti, friendly servers and cashiers they make you feel special, they don't rush you to take your order they are kind souls. I highly recommend this roti for so many other reasons I don't mind traveling the Bronx to Queens it worth it. Keep up the good work guys 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyd0xXZ0t3EAE",
            "text": "This is the 2nd time I bought food from this place/facility bake and shark with everything in it the taste was yummy shark was a bit stale don't know if it was cooked earlier in the am I probably was the last one the pineapple was a bit over riped, I also got the curry fish and rice it was delicious had the doubles had better. Thank you for beautiful faces service with a smile. PS the mango chow was delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkaGVpMVJTSG8xUzJOR2VtczJNMmRJUVhKeU5VRRAB",
            "text": "Love the staff, their food and the atmosphere. Amazing food. Pretty much know them at this point. Kamini, vee, rhea and uki are awesome. The staffs work together and provides the best service. First I tried on my own. Then took the family. Love their classic doubles and shrimp doubles. Have to try the other food."
        }
    ],
    "reviews_count": 65
}