{
    "name": "Aloha Krab Cajun Seafood & Bar",
    "place_id": "ChIJ08pY995hwokR5lkGpxYrnZ4",
    "grid": "QN12",
    "address": "204-13 Hillside Ave., Hollis, NY 11423, USA",
    "rating": 4.2,
    "user_ratings_total": 215,
    "phone_number": "(718) 470-2995",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWS1JuRTNhMHB2VHpGb2JYRkJkMUZaUW5wT2RIYxAB",
            "text": "I love it just wish the crab legs were more meaty but the seasoning and food taste so great"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQk0xSnhRMlY2TlROUGQxcE5WakZaVkU4dGVGRRAB",
            "text": "I went for lunch and the food was just not good. No flavor, overcooked and the portions were incredibly small. Save your money and go to the crab house!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVFNVZHRXbXRYVW1oVVVUQjNORmx1VEZSMGIwRRAB",
            "text": "Birthday lunch was amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWS1kxQm9Oa2RWWkhsM1Eyc3dTWGhQUmxwbVlVRRAB",
            "text": "I don’t know why people complain about this place food was great and Christine was amazing. Look for her she’s the best."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kZmVVaFplVE54VW1oQ01tcE5VMGd6UW5CWlNuYxAB",
            "text": "Food is good , reasonable price, Service is OK there is nobody on the bar all the time so for your Refil you always have to wait, and always  new person comes, personally me always want to deal with same person, The girl named Nancy is wonderful. She’s the reason I comes here."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GYVowRTJhRkJ5U1hacWJYSlJWbXRYZDFWMVMyYxAB",
            "text": "ALOHA!! was FIRE!!! 🔥 food is so good fresh, and the service is quick food comes out PIPING HOT!!! PERFECT!!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RlIyWmFVWGxKYVRadU5uaEhWVzB6YUUxemNWRRAB",
            "text": "Definitely reading the reviews on any food establishment before entering. Me and my sister came here to eat and I was not expecting the gratuity tip to come out of the bill.. I’m not sure why most establishments put gratuity on the bill. Definitely not coming here yall is out yall mind."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNU1tRmxjVGxoYkdOaVdXdDVlVEl3ZEhBMExWRRAB",
            "text": "It was my first time here and I must say it was amazing. The staff was great and friendly and the manager took care of any mishaps. 10/10 recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSlQyZGxVVkJRVVdjMVR5MXBXalYyTnkxTFUwRRAB",
            "text": "Food was excellent.\nAtmosphere was unique.\nService was not up to par for the menu prices, especially if I am to tip on a percentage. Dry drink glasses (of course because it was plain ginger ale- not alcohol)."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Q1VsTldUSFo1VlRoSVFqYzRWRzk2UzNadVRrRRAB",
            "text": "We order the all you can eat for $50 and was very disappointed!, I started with the Thai chili wings & garlic bread 👎🏾 hubby got mozzarella 👎🏾 so we was not full but was turn off so next our seafood came and the 1st batch 😍 was very delicious for me but hubby didn’t like it. Hubby was done but I wanted another cluster at least you know we paid $50 Pp oh yea I got the lobster tail for $6 which was ok as well but when my clutch came it tasted reheated and just nasty 🤮 the sauce have this after taste you can escape ! The bill was a $143 which again not bad if the food was good and the service fee /tip was $26 which was already included  in the bill. I will never go here again but I do like the waiters they don’t stand for BS AND give the same energy you give them. Lastly Pepsi was horrible but I  appreciate they offer free refills vs other places don’t."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wa1UyMHlkRVJSUVVSUmVXSmhhSFkyV0ZrelVFRRAB",
            "text": "This is truly my new go-to seafood spot. For $55 (dinner price) you can eat all the seafood your heart desires! The fried rice is full of garlic flavors, cooked perfectly and fried with egg. The fried shrimp are so light and crispy. The short ribs are sweet and savory. I'm making myself hungry writing this!\n\nI've been there 4 times already and I'm planning my 5th visit right NOW!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNFVHSjRlVGxrWXpOeVducDRlRWgyV2pOdlJWRRAB",
            "text": "Very expensive"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMVZHUmZibkZhTmtsbU1URTFkWE5RUkhaM1YzYxAB",
            "text": "The AC could be cooler ...nice place a bit  pricey but great service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZdE5rTmFRWFZFYkMxd2VVdEdOVkF0WDNNMlZrRRAB",
            "text": "Good was bland. The lunch special do not include any crab or lobster if that’s what you are expecting. You can buy the crab for $5 or lobster at the manger price (whatever that is). The lady said that the regardless if I sat there and did not eat I still had to pay $25.95. Ridiculous. I ordered a blue Long Island and got a blue fruit juice. The drinks are for kids. The menu is very limited to just shrimp mainly. Definitely will never eat here again. If you want decent quality food and better lunch or any specials, go to Hook and Reel, Red Crab, Crab House or your local fish market. I was so turned off by the mandatory gratuity of 15% for trash food and service. MAYBE A DIFFERENT LOCATION IS BETTER!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc01sbEVUR280YldRMlowdE5Wa281UjNGb1VWRRAB",
            "text": "The food was really good. They have a great seafood sauce will definitely return again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ob2JqRk5RMkpVTVhOeWQzTTJka2xxV21WZldtYxAB",
            "text": "For a good price, the food is great and seevice was very accomadating!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMWJHeE1SV1p5V1hKc1FqTlFhV2hVYkc1MWNuYxAB",
            "text": "So good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMFVHVmxabDlwU2xORU9Hb3hTSEkwUm5SU1QwRRAB",
            "text": "Incredible food. Roasted garlic, buttery seafood boil. Wasn't salty at all"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSFJtNXVVMWRPYldkYWVGQjFNamR0U0hCRlFtYxAB",
            "text": "Way too loud was more like a club than a restaurant.  The food was ok. I won't go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMVRVWnNVbXBSWVUxYWNuVlNUWGhxWjNCVGJVRRAB",
            "text": "The Service Was A 2 Because It Was Our 1st. Time And They Never Told Us We Must Ask For The Wings EVERYTIME WE WANTED THEM. THE ATMOSPHERE WAS A 5 THE FOOD WAS A 3. DONT KNOW IF I WILL EVER GO BACK"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWlQwcGtVbU5sWjJsRmNGOWlTVTVhU0dkVVYyYxAB",
            "text": "i went for my birthday and the staff was so awesome! everybody was so nice and food was amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWS2RucFdkMU5aUkc1Nk1UbHJVWE5WUXpNNGJWRRAB",
            "text": "so i went here by my self there grilled shrmp not so good its just like they put only oyster sauce and im not so comftable staff like watching while im eating and the seafood boil mind u that its not really unlimitted crab legs u have to add 6$ per order which is disappointing... and to be fair u give 3 star fair enough i think..."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STWNEQmFWeTAzWlUwMVRrOVZVbU5SYlVwUldrRRAB",
            "text": "Food was very good and the drinks are perfection for the price point definitely a must visit"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSGFEZ3diSFp2TW1sdVIxSmZVRTFqTW1aRVFsRRAB",
            "text": "We came here a couple of months ago to celebrate my brother’s birthday and it was great! We got here around 2:30/2:45 and it was not too busy. They have a lot of options and we definitely went to town on these seafood boils. We got a lot of items such as the shrimp, crab, snow crab, lobster tail, corn, sausage, mussels, potatoes, noodles and more! They also had a lot of good appetizer options such as wings, po boys, fried calamari, and salad. For the price, I think this spot is a great deal. Will definitely find us back here again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNGVFZElXRmR0VjBOUExVeDRZbk5CYjFWbVlrRRAB",
            "text": "Good food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTWQwRllkVWxvVm5sdk5tUjVMVFI1VjFNM2VWRRAB",
            "text": "Great food fast service selection is worth the price"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5eGFWQndWVmRyTms5amNYTnRRekZPVkdFMVUzYxAB",
            "text": "Traveled 2 hours here and was so happy to hear they acknowledged and were celebrating Juneteenth holiday with all day all you can eat. The food was amazing and the drinks and ice cream !! I wish I could have eaten more. I also loved how the tip was already included. Please open a location in the city. ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVd2MyVmFNVWhEYVVaSU5IbHNaRGRrYlZOSk9WRRAB",
            "text": "My friends and I chose to do the all you can eat. BIGGEST MISTAKE!\n\nFirstly, when given the all you can eat menu, hidden in the fine print is that the gratuity (tip) is a\n15-18% up charge. This was not highlighted to us when given the menu. As you are trying to dine the waiters huddle up and stare at you. As the night went on they were not giving us the correct portion sizes that were on the menu. After finishing up we received the receipt and noticed an immense amount of overcharge. They tried to scam us by overcharging the gratuity.\n\nAfter calling them out they :\n1. Blamed their manager.\n2. Then blamed their computers by saying they were not up do date.\n\nThe waiters were incredibly rude and would not talk out the issue or give us reparations for their terrible and despicable service.\n\nIF I COULD RATE THIS ZERO STARS I WOULD!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQaXEyN3lieC15a0JREAE",
            "text": "My go to restaurant with my fam. Food is always fresh, no long wait. Just for heads up, the tip seems mandatory."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKZU9wTGFpckw2eTRBRRAB",
            "text": "Good seafood broil"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOQ21xZmpKLXNtT2hRRRAB",
            "text": "I love their seafood boils the drinks are good.  They have a DJ on Fridays ir Saturday's I forgot he is really good. They offer great customer service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNbXJvb3lGbzVhN0RREAE",
            "text": "Horrible service!!!!!!!!\nYou're literally getting rushed to order the moment you sit down. Be prepared to look at two individual additional sheets (outside of the menu) with instructions on how to order that aren't that clear and when you ask questions the waiter gets extremely close and says it's simple, so simple that if you order the lunch menu before 3:30PM they tell you it's really 3PM, not 3:30PM we just put that on the paper. Thus, I was confused as to why I received what essentially was three different menus (one being lunch and one being dinner). To make matters worse, the tip is automatically included, which explains the horrible service. You have to look closely at the paper it's written in fine print. The ice cream that they give you is disgusting and cheap. The waiter rushed us and kept grabbing plates off the table when we weren't finished eating. The waiter was also pacing back and forth the entire time, which made us feel even more uncomfortable and the overall level of aggression was dissatisfying. I'm never going back again. Hands down, the worse seafood place I've ever been to in my life. I would avoid at all costs!!!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLWRscG1MOGFUWTJRRRAB",
            "text": "Great vibe. Music is live DJ, service is on point, and food is good. Nice for a ladies' night or just some friends look to have some drinks, eat and vibe out."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPYmczdExlMGI3TzRnRRAB",
            "text": "I have Crab legs with corn and potatoes I also have a Pina colada I really enjoyed and the service is always good they're amazing people"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKem1qc2pyNk1leGxBRRAB",
            "text": "The service was great. The food is amazing and the drinks were fabulous. I would recommend this restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKSzQzN0wyal9HdjRBRRAB",
            "text": "Came here with my god daughters. We got the all you could eat seafood boil. The food was really good, but the rules for the all you could eat can ruin the experience if you not careful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPTFZqcERpd3BfemZREAE",
            "text": "Mostly fried food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOaTY4ZDNOdy1Hak9REAE",
            "text": "I went here and I must say the seafood boil was better than I thought. The customer service was amazing, the food was delicious. I ordered and in less than 10 minutes my food was on the table for me to dive it. I definitely recommend 10/10 💗"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZnBrWk91MU5feWxBRRAB",
            "text": "We arrived just in time to beat the crowd. Amazing staff; food was beyond amazing. The servers are all very professional and friendly. We were happily stuffed. For the price, we ate so much and it was worth it. We can’t wait to come back!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbUtLT29nRRAB",
            "text": "Aloha crab is not what we thought the experience would be. It's supposed to be an all you can eat but with small potion sizes and one chicken tender they serve us was crazy. They worries more about you wasting food then giving you food. They are over price and food wasn't the best. Not a great experience for Easter Sunday. Monster crab is tenth times better"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNmRLTDN3RRAB",
            "text": "I loved going in there they had nice service and our waiter was nice she was attentive and food came quick. Everything tasted good as well! I got the signature sauce and spicy and it had the right kicks.Everything was flavorful would recommend trying it out will be coming back in future. The setting is nice as well to have a date and chit chat with friends!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBN2FlVEZnEAE",
            "text": "I drove from Boston to here with my daughter, I was not disappointed, def if you're a local , please try it out. Oh just remember it's all you can eat but you have to eat everything you have first and then you can get different foods, you have to finish what you have, they don't have a no waste policy as such. The portions are small but once you keep getting them back to back you will be full. Our servers were very nice and knowledgeable."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncWZpQU9BEAE",
            "text": "We enjoyed. Really good seafood. I love how you select from the appetizers, sides, mains and dessert for one price. It was $55/person. I had the Cajun wings, a side salad, seafood boil with snow crab, lobster tail, scallops and broccoli in the aloha sauce.  Everything was tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUM3Q2UVVREAE",
            "text": "Early dinner today here at Aloha Krab Cajun & Seafood. Crispy Calamari rings, 1/2 lb Lobster Tail,  Shrimp basket w/fries and 1/2 dozen lemon pepper wings! All were delicious and seasoned well. The wings were a little salty for me personally. (Half the salt/seasonings on the wings would have been perfect) The Lobster tail was perfect and swimming in a garlic butter sauce with a half corn on the cob and potato. I would come again while in the area. Staff was friendly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZ0pUMlF3EAE",
            "text": "I was there this evening, and I see that they are now offering all you can eat. The atmosphere is the best on Friday nights with the DJ, but other than that, when it's someone's birthday, prepared to be deafened by the music. The food is incredibly salty now, and the boiled potatoes are hard. The big kicker is that they take tips on their bills without asking now, even though their prices are much higher now. Pathetic. I won't be back there nor recommend anyone to go there any longer."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBaS1Hc3JRRRAB",
            "text": "Went here for lunch did the all you can eat I’m very pleased with the quality. The place was clean. I ordered the wings it was decent I had a shrimp and crab leg broil the sauce was really good. I went with the signature sauce for $25 it was the worth the price. Also keep in mind that crab legs is extra during lunch special, I found that out when I got here but it was only $5 extra. Overall great spot"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbS1EcUZnEAE",
            "text": "It was a great experience. I ordered the seafood boil combo and it was delicious! Definitely coming back. It’s a neighborhood jewel 🫶"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeGVIZHR3RRAB",
            "text": "This place is so awesome! I was starving and ventured in here. I ordered the shrimp bag with aloha sauce cooked mild which was excellent. It’s the type of sauce that makes you want to literally lick your fingers up. I added in some boiled…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNG9YZkJBEAE",
            "text": "I was excited to try this place because it was brand new. Went in and ordered takeout: wings and shrimp fried rice. Everything looked good really great when I got home. The thing was that the wings and the rice were too salty. They also add this different spice to the rice.I was not expecting that strange taste so I was disappointed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1N2FuUDlBRRAB",
            "text": "Great place, just opened a week ago and in two weeks the bar will be fully up and running. I got the chicken strip basket for $9.99 and it was very good, very tasty. My husband got the shrimp fried rice and he loved it! The staff are super friendly too!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcmF2VWlnRRAB",
            "text": "Me & my friend came to check out Aloha Krab yesterday and it did not disappoint!!! The food was super fresh and yummy. The have a quedé variety of all you can eat which is great. My server Mandy was great and very nice / attentive. The only complaint I have is that there is an automatic gratuity charge added to the bill but other than that everything was great ! I definitely will be back again :) and it was my first time ever having a seafood boil !!! Super yummy"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbDdUOWRREAE",
            "text": "So I heard about this place on Tik Tok and i was a litte hesitant.  I went on a Sunday to do a take out order.  It wasnt crowded at all i walked right up to the counter to place my order. the staff memeber  at the counter was Ok i mean she wasnt rude she didnt really have much to say. I let her know it was my first time there she pretty much gave me the menu and waited for me to place my order.  Now  I had to roder my crab legs and shrimp seperately which was one cluster and a nice amount of shrimp  potatoes and nice piece corn. I paid approx $30 which is a little high but the shrimp were a nice size and their special spicy sauce is so good.  I would return to try other items on the menu.   I will say the  appetizers are a littel pricey too. If you want more than just a seafood boil expect to pay about 40- 50 for a meal"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1c2JTdkRREAE",
            "text": "Great little place that just opened up! Crispy shrimp po boy tasted amazing and the seafood boil with the aloha special sauce was incredible for the value. The fresh oysters were really good too and made a great appetizer. Would highly recommend this place, the amount of seafood you can get with the price ranges is super affordable and worth it. The one let down I had was the calamari wasn't the best. The breading was too crispy and you couldn't really differentiate the meat inside. The other menu items blew my expectations away though and saved my low expectations from the calamari. Our server Adalena was also super friendly and we were treated very well by her."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndVAyZHlBRRAB",
            "text": "Awesome seafood boil definitely in my top 5 service is great waitresses have get energy and personality make eating there fun definitely going to spin the block for more"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aUllNjJnRRAB",
            "text": "The restaurant was a decent size. My Friend and I were seated right away.\nWe initially came to do the all you can eat which is $55 on the weekend. The first server wasn’t too friendly but most of the time there we had the server Christine. She was really friendly and fully explained the deal. We were told whatever we didn’t eat it was $15 per lb left over added to the bill. We decided not to do the all you can eat and just order individual meals fearful that we wouldn’t finish most of the food.\nMy friend ordered the lechee martini and I initially ordered a virgin pina colada but it was watered down and tasted too icee. I decided to send it back and just had a water.\nFor appetizers we ordered sweet chilli wings and the short ribs. Both were REALLY good.\nFor the entrees we both ordered Combo C Which included crab legs, mussels, shrimp and a lobster tail.   She got the aloha sauce which included all the sauces combined (cajun garlic butter and lemon pepper). I got the Cajun but should’ve gotten the aloha special because the Cajun seemed salty. For $48 that was a great price for that much in a boil. It was a lot of food and I had a lot left over to take home."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeWZiZDR3RRAB",
            "text": "I went to this restaurant for the first time today. We decided to dine in for 2 and the customer service we received really sucks. The lady who we got seated by took my order while’s I was ordering she didn’t even let me finished my order and try to take the menu off my hand which was very rude. I had a questions about the food I was ordering and she responded very aggressively. And not to mention the Fried Rice was so plain and tasteless. On top of poor customer service we received they added their own tip to my bill which was definitely not worth the price for what we ordered. Never again!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJc2MzT1pnEAE",
            "text": "I went there with my husband just a few minutes ago. We placed an order and was still looking thru the menu to see if we needed anything more, whilst doing so the waitress started to pull away the menu from my hand. I asked why she’s taking it away I wasn’t finished, she then decided to leave it on the table in a very rude way. There was bearly people inside. We didn’t even finish eating and she came and started to clean the table and brought a take away box. The staffs are very rude and have attitude towards customers. We will never go back there and would recommend no one to go there. And other than poor service they added their own tips to the bill."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcUpmUVFnEAE",
            "text": "I went there April 30, 2025 around 5 pm and the lady at the front desk had so much attitude, I just walked out. The restaurant was empty, so I don't get why she was behaving as if she's stressed from being busy or tending to customers. I was asking about the menu and she seemed annoyed like I was bothering her or something; our interaction wasn't more 5 mins. So, I walked right back out because I am not dining somewhere that I'm paying for to be treated with unnecessary attitude and impoliteness."
        }
    ],
    "reviews_count": 58
}