{
    "name": "Roy's roti shop and lounge",
    "place_id": "ChIJ8ynnT85hwokR5vYzFIcy70Y",
    "grid": "QN12",
    "address": "189-09 Jamaica Ave, Hollis, NY 11423, USA",
    "rating": 4.1,
    "user_ratings_total": 113,
    "phone_number": "(347) 426-9627",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWFVTMVFlWGxGYTNCVlYycEJVbWRSYVZBNGIxRRAB",
            "text": "Annoyed,  order food and 1 hr later  was told no chicken was available. Why wait 1 hr to let me know there's no chicken!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMFZFNXVZVWxrYlhocWVVaFhSSEk1ZEZCVk1IYxAB",
            "text": "Good service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYVZGQjRNbU54WVZWWlVsa3hVMDR0TmpWcmEwRRAB",
            "text": "Best Guyanese food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNE5FNTRkRzl2Y0RSU2JWb3hZblo1Ymtod1RYYxAB",
            "text": "Visited the establishment to blow off some steam after a hard day of work. I was greeted at the bar by one of the rudest female  bartenders ever. Lacks professionalism, common courtesy and decency when dealing with customers. Made my mood even worse. Roys needs to do better in picking people to provide service  to others."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnX28tVm13RRAB",
            "text": "It said they are open till 2 AM, but I went 10 pm there was no food available empty table, nobody to attend"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdTZqUkhBEAE",
            "text": "Fried chicken and fried rice was the worst and this my first experience! Def wouldn’t order again"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURob3B1cC13RRAB",
            "text": "Had the curry chicken which a taste like it was maybe two days old or been out all night. The cashier is rude as ever. If I give you my money in your hand and you see my hand out and place it on the counter we got a problem. Please serve fresh food. Also the white rice… Parboiled?! Really??? Went back yesterday for a roti with veggies the pumpkin was so salty it was inedible. The manager or owner came to the front and posted up beside then behind me as if I was going to steal something all because I wanted my money back for the very salty food. The worker even stated the pumpkin was over salted. What’s the issue??? And why are we paying tips that we did not authorize? That’s customer discretion. Will be reporting that as well $2 each item at that! Disgusting"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQOWNYRjVnRRAB",
            "text": "Food was great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3N3RLelJBEAE",
            "text": "Super clean!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidk5YRUNREAE",
            "text": "People beware and check your credit/debit card, if you used your debit card/debit in the past there would be 5.00 charges that you are unaware of.  ON July 23 i've seen a $5.00 charge to my debit, without being at the establishment.  I want…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyalpmQTdBRRAB",
            "text": "This place has some slamming BBQ!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqODc2LXJBRRAB",
            "text": "Went there on Tuesday 4/23 for some roti. I thought because it says roti shop that they cook it and give it to you boy was I wrong all I heard was the microwave going one after each other I had ordered 3 roti. The when i got home the roti was hard as a rock. Never again will I be going here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqblk2UUxBEAE",
            "text": "Love everything about this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqOGRiX3dBRRAB",
            "text": "Very nice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dl8zb21RRRAB",
            "text": "Place is always a hit...matter fact, I'm gettn dressed to go there now to see Jenny and Sabrina...❤️❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdjVUTXBnRRAB",
            "text": "This place seemed fairly new to the neighborhood. It was around lunchtime, but it was empty.  The service was nice and very friendly.  The food was good with decent size portions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNON2JURnVRRRAB",
            "text": "They stink. No good quality food. Water down curry and never have roti nor dhalpuri"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOZ3BUT1hnEAE",
            "text": "I ordered fried rice , it might as well be cook up rice cause it softer than cook up rice with grain . To be honest since tht the rice was cooked like tht I would never sell tht to customers , cause I was a first timer there n the experience was aweful never go bk there again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxZ2RUMHF3RRAB",
            "text": "First time there, food was seasoned well and roti seemed fresh. I ordered the curry chicken the only thing i could say is that there was more oil in the container than curry sauce, no potatoes, channa, just chicken and curry oil. . Very disappointing.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWLTVXWlJBEAE",
            "text": "The music was bumping, the lounge decor is very pleasing to the eye and they seem to draw a good bar crowd. I spent roughly 25 -30\nminutes waiting to order a curry chicken & bussup shot. The woman at the front counter was overwhelmed and needed assistance. There should be someone handling door dash orders and someone focused on walk in customers. I definitely expressed my frustration and the woman did start to get a little testy … I’m sorry but the truth hurts at times as customers waiting also agreed with my point of view. No one should be waiting 25-30 minutes to order 1 simple dish. The woman did make up for the service with a free soda. I was so happy when i finally got my food,  when i got back to Long Island to eat my food, which I would of eaten it before but there wasn’t one utensil or napkin in the bag….. anyhow when i went to eat my curry, it wasn’t cooked properly: the curry was thin , the potato and the chicken were both hard. I had to re cook the food thoroughly before consuming it as i didn’t wanna get sick. This was my 2nd time giving this establishment a shot and yet again it was a fail. I went out of my way to come for some chicken curry but this unfortunately wasn’t it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1eGUzNTlBRRAB",
            "text": "Beats all the places on Liberty Ave for an authentic and tasty West Indian treats. Curry is top tier and flavorful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaM2VQV2xRRRAB",
            "text": "Great food and service! Definitely you have to check it out!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMklTWVRBEAE",
            "text": "Great addition to the neighborhood! Fresh Caribbean eats all day long, and a nice bar and lounge for drinks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4d19QbEpnEAE",
            "text": "So I went in around maybe 3-4pm , Customer service is definitely lacking   . Was not greeted upon entering and the Chef took my order when she came out to give fresh food  . As someone who worked in hospitality for 15 years definitely not a…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbE9MMFNBEAE",
            "text": "I ordered one of the simplest dish in Guyanese history, chicken fried rice. I waited about 20 mins with excitement, that timing is normal. Now what I received was far from goood. The rice was soggy with a heavy Ginger taste. Chicken tasted old as my grandmother. It was not edible and threw it out in the street how disappointing it was. I don’t know how people like this stay in business. Never again and I will be sure not to have any of my followers or family waste money like that. Btw this is my second time ordering since opening so that tells you they still can’t keep it together for a simple dish like chicken fried rice. Go home and cook"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M3AzR0hBEAE",
            "text": "So it's a great adult getaway for a few hours to unwind and just relax. It's a mix crowd, primarily local older folks so it's not rowdy and uncomfortable. The bartenders aren't fluent in making cocktails so don't bother asking for a mojito or tequilla sunrise. We had the worst heartburn with the Margaritas we ordered. The food is pretty good and flavorful and good portions. There is a pool table which is pretty fun to have if you're not interested in dinner or dancing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NHBTQ3FnRRAB",
            "text": "I would like to thank the manager and staff at Roy's roti shop and lounge for their outstanding services inspite of a busy Friday evening. We enjoyed our favorite varieties of delicious Guyanese cuisine. The friendly staff members were courteous and accommodating. Your hard work and delicious food are greatly appreciated."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKX3M2ZHpRRRAB",
            "text": "I ordered oxtail and white rice and it had absolutely no flavor it felt like I was eating a piece of cardboard. I ordered two servings with white rice and dhal with some other rice. For 57 dollars I could’ve gotten a deli sandwich for 5 bucks and it would’ve had more flavor. Maybe other dishes would’ve tasted better but the oxtail 👎🏽👎🏽👎🏽👎🏽👎🏽 horrible!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd2Etd3dRRRAB",
            "text": "Had the pleasure of attending a pools practise session here with a good friend. I muat say their prices are just right. Highly reccomend the spicy calamari if u like that kick of pepper in your food and the fried shark. It did take a bit of time to prepare, but the wait was worth it."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSai1PUXFRRRAB",
            "text": "First time having their food and it was delicious....definitely recommend 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSME1TYzZRRRAB",
            "text": "Establishment is aesthetically pleasing and well-invested. However, music is overbearingly loud to a point where a conversation with your company is not at all possible as well as lackluster to nonexistent service. The only saving grace is that the food is on point, as in really tasty when it does arrive. This review is after a revisit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoazVIR0lREAE",
            "text": "Didn't know I had to pay a certain percentage of tips for each meal. The chicken fried rice was so soggy with all the jerk sauce. Why charge so much and food is not eat able. Paid $75.00 for 2  fried rice, 3 dhall puri, and 2 curries."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSck5pYm9RRRAB",
            "text": "I ordered chicken noodle soup and BBQ chicken, and neither of us could of ate anything...it was overly extremely spicey that we both started to feel sick after having the first bite, and no where on the menu stated that it was going to be spicy, also before even ordering I specifically called the restaurant and asked about the ingredients, and i told the lady I am order for someone who is ill and i have to ensure the ingredients is what it is and nothing more, she confirmed, i even told her that why I have to make sure of the ingredients, and having even a bite of the food, made the person(s) feel even more worse, that is how spicy it was!!! You all will be hearing from me again and it's not a happy call."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOXFQMHBBRRAB",
            "text": "This is my first time here and the food was amazing. I had the bake and shrimp curry and everything was freshly made. Will definitely be coming again. 10/10 service and food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtOGZ2SVJBEAE",
            "text": "Love everything about this new West Indian restaurant. I had the Pepper Shrimp Fried Rice and Cha Chi Ki Chicken and I must say it was delish! The service was amazing. I found my new favorite spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4c3QzWkhnEAE",
            "text": "I walked into this restaurant the atmosphere was amazing. The menu had alot of choices. The service was quick and efficient, my friends and family would definitely come again to this restaurant.i give it 5 star."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNU02aDV3RRAB",
            "text": "This is a great spot to pick up Caribbean food!\n\nFried rice, chicken, curry, dhal puri, eggball and all you can name they have it and fresh! The girls working here are good as well!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMVBtaHN3RRAB",
            "text": "Food, service and music was outstanding! I had doubles, curry shrimp and lo mein with roast duck. Everything was great. I really like this spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNWF5Q3V3RRAB",
            "text": "Very dissatisfied with my very first order, I paid $17 for a cowheel soup but got a small chicken foot soup instead. I don’t eat chicken foot so I had to dump it. Not ordering there againnnn"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodGVQSV9BRRAB",
            "text": "Great costumer service. This is my first time buying food there ,polourie was hard and raw . For the doubles no taste at all."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKM0txWjN3RRAB",
            "text": "Food is  nasty no flavor at all  . It probably good for lounge part and I doubt that caUSE 911 alway being call ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bzZId193RRAB",
            "text": "Beautiful waitress and dj great food and drinks special with a pool table vybes just rite the place to be..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNExLZ25RRRAB",
            "text": "Had  fun turning up for my friend birthday played some pool had some drinks. It was definitely a good vibe."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z3ZMdXdBRRAB",
            "text": "Very nice place to dine , love the food. Staff is very friendly  and polite ..I recommend 100%"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaOUplanFBRRAB",
            "text": "The food was amazing and the staff was very professional and the music was on point"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaU1XTWZnEAE",
            "text": "The food is good. The place is clean. Fast service.  Casheirs are friendly ."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCeGNmaUpnEAE",
            "text": "I had a few drinks at the bar and the customer service was so polite and nice 👍🏻"
        }
    ],
    "reviews_count": 47
}