{
    "name": "Coco’s Jamaican Fusion",
    "place_id": "ChIJve-MffhhwokRbgyLxW3MKYw",
    "grid": "QN12",
    "address": "203-05 Hollis Ave, St. Albans, NY 11412, USA",
    "rating": 4.4,
    "user_ratings_total": 14,
    "phone_number": "(929) 206-5007",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWV01FRjRZV2Q2VW14M1RWZFpkVEJvWHpKVFNYYxAB",
            "text": "Friendly staff, good food. I will be back"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReVEzbHpUbWRSVTI5NWMyTXplWFJMWTBkeE0xRRAB",
            "text": "Pick up the surprise bag, foods are great!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zelpIZHpaMEpzYnpWZllWZFZiRXAzUmxNMVNWRRAB",
            "text": "I really don’t like leaving poor reviews, but my recent visit prompted this one. This was actually my second less-than-desirable experience here. I didn’t want to judge too quickly after the first time, so I decided to give them another try today.\n\nI asked what the different drink flavors were, and the cashier told me one was lemon ginger. Since I like lemon and ginger, I chose that one. I opened it in-store and took a few sips — immediately realizing it was pineapple ginger, not lemon ginger. I know the taste well, especially because I’m allergic to pineapple.\n\nI started itching right there in the store and asked if there was pineapple in it. They kept insisting no and said maybe it was just the ginger. Mind you, I drink ginger shots regularly — it was definitely pineapple. I wasn’t asking for a refund; my mom was going to drink it since she likes pineapple ginger. I just really didn’t appreciate being gaslit while actively having an allergic reaction.\n\nThe only reason I gave two stars instead of one is because my mom said the sorrel ribs and mac and cheese were really good. Unfortunately, the collard greens weren’t seasoned and were cut too long, the rice and peas were mediocre, and the oxtail was bland and not very tender."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cmNHaG5XalJMYjFsVVNFbElSV1ExZFV4cFYwRRAB",
            "text": "Coco’s Jamaican Fusion is an absolute gem! I had the pleasure of having them cater lunch for my medical office, and everything was fantastic. We wanted authentic Jamaican cuisine, and Coco’s truly delivered—from setup to service. The food arrived hot, fresh, and full of flavor, and the staff was friendly and attentive. I’ve also tried their breakfast menu, desserts, and handmade beverages—all exceeded my expectations. Dining here feels like being back in Montego Bay! Coco’s has definitely earned a loyal customer for life."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cVNrUktjRWw2ZFZCa2QxTm1ZblIzUW1oUmRXYxAB",
            "text": "The food was delicious and authentic. The owners were very welcoming and friendly. I will definitely be going back to this establishment."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTE5FaEVUbEZhU2tkeVgybzRXVFV0YW1JMlVWRRAB",
            "text": "The food is okay."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pac1RHSkZRVE5oWVhscFoxTlhTMU40YVVwYU9XYxAB",
            "text": "Food is very very good. Oxtail Mac and cheese exceeded my expectations. Would definitely recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTU5HcFdTbkJaWjFkV1p6WllMVmxJTTJkT1kyYxAB",
            "text": "The food here 😤🔥 I had the candy yams rice and peas with oxtail 🔥👏🏾"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dmVHbG1VbDl4Tnkwek1IWjFPREZqYlVkZk1FRRAB",
            "text": "Just left here about 15 mins ago and had such a nice experience. The customer service was excellent and the food is really good. We got turkey wings, Mac, jerk chicken and oxtail. Everything was seasoned to perfection, that seems to be rare these days. We did feel like the oxtail portion for a large plate was pretty small for the price but we’ll def be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUmMyNTRSVUZ2WTFGWmNVUkpkVW8wYzNwcE9FRRAB",
            "text": "When I tell you 10/10. This quality but lovely Jamaican eatery is serving baby!!!! Coco the owner and also cook definitely is bringing her flare to our community. Best customer service and the food is A-1. Honestly I am a lover of Rasta pasta and also being a chef, I can see this restaurant will go places!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNFJXOTJORXhUVm1ORlltNW1iMnRwYVUxdVJIYxAB",
            "text": "Overall great experience. The customer service was excellent. I was cheerfully greeted upon entry and then quickly assisted. The food was delicious. I will be back."
        }
    ],
    "reviews_count": 11
}