{
    "name": "Gaby's Pizza",
    "place_id": "ChIJ1U4Yc3dhwokRARHDgoiFe8g",
    "grid": "QN12",
    "address": "204-23 Hillside Ave., Hollis, NY 11423, USA",
    "rating": 4.4,
    "user_ratings_total": 3000,
    "phone_number": "(718) 740-9716",
    "reviews": [
        {
            "date": "수정일: 56분 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHdUlPSzJnRRAB",
            "text": "A staple of the neighborhood but as someone who grew up eating Gaby's, it just doesn't hit the same way like It used to. I don't know what it is and it doesn't help the prices are ridiculously higher now. I think it might just be the nostalgia really causing me to give it a 4 star instead of a 3."
        },
        {
            "date": "6시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GalNUTmhSWEpNUkc5cWJEZEdVRTFvU0U1TWFWRRAB",
            "text": "I ordered the chicken parmesan and was so impressed with the taste and portion size. It’s enough for 3-4 servings. I did ask for extra cheese and sauce but honestly, I really didn’t need to do that. They prepared this dish exceptionally!  For those of you who have commented on possibly not having a good experience, please give them another try their food is quality. They’ve been in the community for a long time and although I have no stakes in this, it’s just hard to find quality food in our neighborhood Gaby’s…kudos to you! will definitely return."
        },
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NE1YVnNWRlUyYXkxdmRWbFpTM0ZuWTFWWE5WRRAB",
            "text": "A classic Neighbourhood staple"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTlNXYzBSbGt6VlZSbVdFeEVVamxmVlVScGFGRRAB",
            "text": "Over rated not worth the hype or the trip. Tastes like freezer pizza from Digorno. Best pizza in NYC is Danis in kew Gardens or New Park Pizza Howard beach"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWS1QxZHVNVXBsVEZOb1ltNVFhbGxyWlZsS1NVRRAB",
            "text": "Food is great. But being that it is so busy. It's very confusing where to order and pick up. You need to know what you want already. And unfortunately they no longer take the buy 10 get 1 free coupons that are on the pizzia box."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psR1pFbElOMkp1TUVOck1qQnhUM1JmVW1GcFkyYxAB",
            "text": "Buena Pizza, pero considero muy mala atenciones del personal porque no se enfocan en lo que pide el cliente por andar de rápido atendiendo a otros, te dan lo que no pediste y encima te hablan con tono de grosería cómo que no estás pagando tu dinero, segunda vez que voy y no vuelvo más."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGclpscHpUemxuYW5aWVVYWjZWWGxyWW5GaFptYxAB",
            "text": "I used yo come here back in 2010 they got the best pizza in the world. they use to give me free pizza some times idk why but that was nice of them."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTE0waHVaemhMUXpKRk0wcFFiRTVwTkVjMWIxRRAB",
            "text": "I used to eat here in the 90s and always enjoyed the pizza when in the neighborhood"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWlR6SkxjekJJUnkxck1rRm9aekZFU0VwQ1pIYxAB",
            "text": "Overrated.  Tastes like a slice from another state.  Way too thick and doughy for regular slice.  Overheated it so pizza was scalding hot it was inedible for 15 minutes (after burning both our mouths on first bite).  Crust was burnt.  Sauce is nasty - too sweet with zero seasoning.  Cheese was too thick and tasted cheap.  Would not recommend.  Best pizza in Queens is Amore but you can pretty much get better than this at any other place.  Only plus - massive slices!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdldqWllRMnd5U0daMGNWaHpWbkpqV0ZkcmFGRRAB",
            "text": "Guy at front wouldn't let us leave tip. Swiped past it without letting me touch it. Then one of the servers we got was an extremely rude lady I think from Caribbean someplace. Was extremely disrespectful, wouldn't give my old mother extra napkins, and cleared everyone's table but ours. We don't have cash on hand for a cash tip, but since she was an awful person from the get go, it worked out in the end. Other lady was super sweet. Either way، not returning here. Furthermore big burly dude who seems to be in charge loves to give me the stink eye every time I visit. No idea why. Well this is the last time. Food's great but we're all human underneath. No need to be racist to Indian people."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WU1oxbEVWRVJhVG1KMU1VbFpkVzk1Ym5KR1ZsRRAB",
            "text": "Pizzeria"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eWVYcDBkbGR1Wm5wNFJqRTRWSGhRWTNsdVRFRRAB",
            "text": "Baby's pizza is great! Service can be better. When the lady answers she's a bit rude but if you go past that you'll get good food.  Also the prices on the website is not updated so be prepared to pay almost double."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxNE9mRHV3RRAB",
            "text": "September 2025. Best pizza in Queens NY. Lots of celebrities stopped by this pizza place. The pizza flavor is unique and always fresh, I also love their chicken parmigiana, Sicilian,  but my favorite is the pepperoni pizza, do not ask for…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNmVuRmlUVGRmVVZOVlowVk9aRkJhYUUxaWIxRRAB",
            "text": "Best pizza in all of New York"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMFNWRkNialk1Y0RGR2FWbFZlamhST0c1SlRWRRAB",
            "text": "Enjoyed the lasagna and chicken wings. They were excited 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204ellVTmlZa1JUWlhCdlIxaExkbTkxWlhCMFozYxAB",
            "text": "I ordered Grilled Chicken Salad and they gave me Fried Chicken on top of salad.\nInside bag there isn't fork and napkins.\nI ate the Salad by hand because I went far from the restaurant.\nI will never go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201c2JUbHBNM1paUVd4MGVFUTBNMmRHYVhRMVdFRRAB",
            "text": "Great food, atmosphere, and service."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNzlqM1pBEAE",
            "text": "Their pasta slice is my favorite slice in all of NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMFJXazJSV0ZZWVdaSFRtUlFjRTlpVm1GdFFXYxAB",
            "text": "Mad oily and greasy how do yall not fix this rather go to aloha Krab least they give you a bib"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSU1JuZHZaMHhRVWsxeVpWVk5TRzlGT1dzNGRFRRAB",
            "text": "My childhood pizza place..Its still so tasty as I remembered"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQlYwVTFUWHB5YWpKV01GZzBjM2wxWWxWSU5FRRAB",
            "text": "Best pizza ever"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaloyOVdaRTQ0ZGxSS1ZGcEJOMk5zZUVGdFgzYxAB",
            "text": "VERY Delicious....!!!! Top 10 New York Pizzas, Easily....!!!! Plus, I Stop By Whenever I'm In The Area....!!!! And, They Have Delicious Riceballs. Also, They Have Taken Pictures With Celebrities. And, Have Them Posted On Their Walls. I Definitely Reccomend To Everyone Looking For Quality New York Pizza. Whether, In-Person, On Facebook, Or On The Facebook Group: Pizzaholics. #Pizzaholics"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTlVrTnhPRTVmWm5sWldVcGxMVTVwV1ZGTFZGRRAB",
            "text": "Chicken parm is not good … they need to use real breadcrumbs and fresh not frozen  chicken .. chicken taste like it’s frozen . Disappointed"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeVdrOVNSazA0ZEY5TFJtUTFaa1pUVWsweWFrRRAB",
            "text": "Best pizza on da EAST COAST"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTE5GcDJTRXBTYm1wMk1tWmxVM2h6T0dOQ1RFRRAB",
            "text": "Gabbys, got the best pizza!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnd1ZtdzRUa2R4UVU5dGFqbEJVMDVmVDBwNk4xRRAB",
            "text": "I had the chicken tomato slice it tasted HEAVENLY OMG 😋🤩✨️😮‍💨 BEST PIZZA IN NEW YORK FOR A REASON THIS IS TOP TIER FR 👌 🔥🔥…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCZlVFVkVOVTFDTlRWNU9FNUxSM0UwYXpSVFpuYxAB",
            "text": "Great pizza and reasonable priced"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMFQyZEJZa0pyY2xKTlVsWkhiSHBhTTFGNmNIYxAB",
            "text": "Great neighborhood pizza."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMXN1YnF3RRAB",
            "text": "Busy, and quick service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNGJrSlhja1ZIZVZOb2FFdzROblprU0RCWWJWRRAB",
            "text": "decent but nothing to jump for"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NC12NjBnRRAB",
            "text": "Love Love Love this Pizza parlor.  My parents always took me there as a child and that is why i love and live pizza.   It has never changed in taste.  In fact it's gotten even better... their sauce is what does it for me... but overall the crust, the cheese and sauce just melts in your mouth.  My mouth is salivating just talking about it..."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwaWNYcGR3EAE",
            "text": "Very good. And friendly service. 정말 고수의 풍미가 느껴지는 숨겨진 맛집입니다."
        },
        {
            "date": "수정일: 9년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNneGVuT1N3EAE",
            "text": "쟁판에 막 나온 뜨거운 치즈피자 맛을 잊을수 없습니다."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMlkycGxSVXhpYjI5TVgyVk5kRE14WjBGMVdIYxAB",
            "text": "A Heartwarming Experience for Our Students\n\nWe're so grateful to Gaby’s Pizza for offering our students on the spectrum such a memorable experience. While there wasn't a hands-on component, the students left thrilled, feeling proud and empowered. The staff’s kindness, patience, and support made all the difference. Thank you, Gaby’s Pizza, for creating such an inclusive and meaningful opportunity. We can't wait to return!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSWRVUkZXbVZLV1hSa2QyMUdOMkUwTm1vd1RuYxAB",
            "text": "Used to be the best Pizza spot in Queens.  Now still top 5 but not as good as 2010's era. Great staff,and great location for parking which is hard to find in the 5 boros"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREM0tLcGpRRRAB",
            "text": "This place is an old gem. The place has been open since the mid to late 1900s and their food has been featured in the Rachel Ray show. The food is exceptional and is an amazing value for the money paid. I paid 4 dollars for a huge slice (plain cheese) and 2 dollars for a drink. The guys up at the counter were very friendly and are fast with service. I hope this place never shuts down."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQ1FubHRZazV2U2toNVVFSlBaSHBOY0RCVE5FRRAB",
            "text": "Amazing pizzas no matter what your favorite toppings are. One of the best pizza spots in Queens...hands down!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MUlTOW5RRRAB",
            "text": "Stop by Gabby's on my way up to Toronto. I've never tasted such a delicious pizza like this before. It has that real authentic NY pizza taste. I had to try all the slices they had, and they were mouth watering. The next time I'm back in Queens I'll be sure to drop by and try other things on their menu.\nHighly recommended!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudTR2RGJREAE",
            "text": "Gaby's Pizza is a family own neighborhood institution for 60yrs and for good reason; consistently delicious pizza 🍕 made with the freshest ingredients. The sauce stands on its own with its incredible flavor. I believe their sauce is used in many of the entrees as well like their Lasagna. I literally haven't had anything I didn't love."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBejZublJnEAE",
            "text": "My favorite pizza in the world! Please follow and visit @gabyspizzaofhollis! Tell them Alex sent you. They also ship out all over if you can't make it into Queens."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4N3Jyd3F3RRAB",
            "text": "Great Pizza Place in Queens NYC.\n\nIt’s a neighborhood institution, lots of history and respect for their craft definitely.\n\nPizza was amazing, the sauce is probably some of the best I’ve ever had. Service is adequate enough to get the job done, overall great spot for an NYC slice in Queens."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWd04yaERREAE",
            "text": "Gaby’s Pizzeria in Queens, Hillside New York, remains an absolute gem, and my recent visit reaffirmed why it’s a must-visit for pizza lovers. Having been a loyal patron for years, I was delighted to find that in 2023, the taste and flavors at Gaby’s have only improved.\n\nToday’s selection of the Margarita and Grandma slices was an absolute delight. The Margarita slice showcased the perfect harmony of fresh tomatoes, basil, and mozzarella, while the Grandma slice, with its crispy crust and flavorful sauce, truly made my day.\n\nThe consistency in taste and the commitment to quality ingredients have been hallmarks of Gaby’s Pizzeria over the years, and I’m thrilled to note that it has remained intact, if not improved. The welcoming ambiance and friendly service complement the outstanding culinary experience.\n\nAs a long-time enthusiast of Gaby’s Pizza, I can confidently say that it continues to be a favorite spot for pizza aficionados. If you’re in Queens and craving authentic, delicious pizza, Gaby’s Pizzeria is the place to be."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKUC1wZXFSLWZEY0R3EAE",
            "text": "This was my spouse and I first date ever 17 yrs ago.  He loves their pizza.  I am not a big pizza fan but I must say I did enjoy it very much.  We don't go often because we don't live around there but it was nice to go again after 17 yrs."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqLWZmQUdBEAE",
            "text": "Truly Authentic. Just your friendly neighborhood Italian Spidey place.\nBeen coming here since my teens and its been the  same great taste and friendliness ever since!\nOver 30 years!!! thanks guys for making such amazing 🍕 and authentic Italian dishes. shrimp parmigiana is to die for, and if u dont like it:\n\n“then forget it about it!\ncement shoes for u, cuz this place “issa the best!”"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLR20zX1NhcGQtOFJBEAE",
            "text": "I had two cheese slices here today. Like all of Queens' favorite pizza restaurants, the cheese everywhere has a strange plastic like feel & taste. It seems as if everyone is using low grade cheese. I'll keep making my homemade pizza with a better quality of cheese and my garlic/ parmesan tomato sauce."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdVpUSkpSbGxqVEdkWU1FNXRlVEpDTjBoMVpFRRAB",
            "text": "Crowded & sometimes the bathroom doesn’t work. But the employees are sweet & very helpful. They always engage with my baby & put a smile on her face. Been going there for years & never had an issue with the staff or my order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybGN1S3FBRRAB",
            "text": "As a person who’s been trying to find a good pizza establishment for my family, I was very pleased with Gaby’s Pizza. From walking into the establishment it was clean, organized and the staff were very polite and quick to take your order.\n\nUpon receiving my food you can smell how freshly made and authentic the food was. I highly recommend this restaurant and can’t wait to try other food on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeUx1RndBRRAB",
            "text": "The ambiance of the pizza store can definitely enhance the dining experience. This particular store had a warm and inviting atmosphere. It was clean and well-maintained.\n\nThe crust is the foundation of any great pizza. It should be crisp on the outside and slightly chewy on the inside. This pizza delivered, with a perfectly baked crust that had a nice balance of texture."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVmRWSmxUWEZVVkRkMWVuZHpaRmM1ZVdaRFlWRRAB",
            "text": "This was the first time I ordered from Gaby's and the owner was so kind! I planned a pizza party for my students and everything was hot on delivery, sodas were ice cold, the delivery was on time, and the kids were so happy! Thank you again and I will definitely be ordering again!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwakwybGJ3EAE",
            "text": "One of my top two favorite pizza restaurants in NYC. I’ve been going here since they opened albeit living in Hawaii now it’s a long journey. I still try to visit annually. The cheese pie stands on its own. All the other topping possibilities just add to the draw. You can’t go wrong here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdUkyOFhBEAE",
            "text": "Good “Queens” slice. The right amount of pepperoni and cheese and love how the sauce is a bit sweet here. Sicilian slices are thick as to be expected. Great spot that has been here for ages.\n\nTip: minimum $15 spend if you want to use your credit or debit card. There’s a Chase ATM in the same complex."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25saVV6bERWbHByWm1nelUzaDBaREUzZGxOaFlsRRAB",
            "text": "Pizza hasn’t been the same since they renovated. Was the best slice in town but something has changed with the dough and sauce. Service and atmosphere is still amazing"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5Z3NTV2RREAE",
            "text": "So I was looking for a pizza spot that was similar to Amore’s but closer to home so I didn’t have to worry about by thin crust getting soggy by the time I eat it. Welcome to Gaby’s. The crust is a little thicker compared to Amore’s but equally delicious. The pricing is almost the same but you save a few cents at Gaby’s. Refer to the menu for pricing. I also ordered a fried calamari as an appetizer and a beef patty with cheese because ... well, I rarely ever go to a pizza joint without trying a beef patty with cheese if it’s available. With the calamari, an extra side of marinara sauce would’ve been nice for the serving size of the calamari. The beef patty was cheesy and I appreciate that they didn’t burn the beef patty, which I guess could be common to other pizzerias. What I like best about Gaby’s is the staff. Extremely friendly. They mocked me for taking pictures of a pizzeria but I said I write reviews for Google. They offered the opportunity for me to go behind the counter and take pictures, which was a first for me but not wanting to dirty anything where they prep food, I opted not to. I would definitely revisit to try their heroes the next time. PS - the higher price tags on the menu is from the catering menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGdVpUcmJnEAE",
            "text": "Who doesn’t know about Gaby’s pizza? One of the most syndicated Pizzarias in Queens. Stopped in to grab a slice or two and I have to be honest it was mid. Like the plain slice idk, the sauce was overly sweet but the Buffalo Chicken Slice definitely hit home. I’ve come to the realization that a lot of pizzerias are really going the specialty pizza route. Meaning these specialty slices are better than the plain cheese slice which is sad. But overall the atmosphere felts good and the service was on point. FYI they only serve fountain drinks which taste great and refreshing and not flat like most places."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodnJQTUZBEAE",
            "text": "Neighborhood favorite for many many years and still going strong. Sauce a bit on “sweet” side however that’s their niche and what Gaby’s known for."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNFptdEtNM0p6VURWU1VVVjRNa2h2VFRGMmQwRRAB",
            "text": "The only thing good about this place is probably a plain cheese pie. Anything else is just frozen and microwaved crap, I swear they must buy chicken cutlets and canned tomatoes from Food Town in the same area. This spot used to be so great for me in the 90s"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhdXM2MzJBRRAB",
            "text": "Really surprised by how much better the regular slice is now compared to a few years ago great sauce to cheese ratio good flavor price is a bit steep at 3.25$ a slice but for how good it was I wanted more definitely be getting more slices from here"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNGV6T1hnEAE",
            "text": "I traveled from Howard Beach to try out the pizza here. The regular slice was 1 of the best I’ve ever had! Sauce is delicious, crust is soft and flavorful, perfect amount of cheese. The neighborhood is garbage but this pizzeria is a GEM! One of the best in NYC!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURreGM3Y3hRRRAB",
            "text": "Nice place. My friend put me on to this spot one of the best pizzeria's in Queens. The texture of the doe is just right. The cheese has a unique taste which compliments the  whole pizza in general. The sauce also good which overall makes the pizza taste even better.\n\nThe pizza is definitely a 9/10."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBaHZ1TU13EAE",
            "text": "\"Great pizza hands down. Won best pizza on Rachel Ray's show and top3 on ABC\".\n\nThat was my original review. 6 years later, my opinion has changed. It's not as good as it once was. Not sure if the fame got to them, it's still good. Also, price for a plain slice is now $4 as of 7/26/24. That's a bit pricey for a slice of pizza when there a number of pretty good slices in an around the city for $1.  Thus the reason I'm updating my review."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMDhmZURnEAE",
            "text": "I haven't  been here in twelve  years.. I didn't  think it's possible. The pizza is better then I remembered.  The service was excellent!!! Staff was super friendly!! BEST PIZZA IN NYC!!!  If your looking for quality  look no further...."
        }
    ],
    "reviews_count": 61
}