{
    "name": "Leng Earth Food Restaurant",
    "place_id": "ChIJycs9WWFhwokR3axvl3l5gBg",
    "grid": "QN12",
    "address": "205-09 Hollis Ave, St. Albans, NY 11412, USA",
    "rating": 4.4,
    "user_ratings_total": 20,
    "phone_number": "(718) 740-2372",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ST1FWOHhkR3BtTUUxS2NVTlZUVXN3TkZsYVgwRRAB",
            "text": "Ordered the Pan fried Snapper and Oxtails. Both were very good. Rice and peas w/ gravy very nice. Mac and cheese is on point. The dumplings are great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcnVHM1F3EAE",
            "text": "Got spoiled curry chicken last night so I won’t be supporting any more"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRaTZpNDB3RRAB",
            "text": "Amazing food. One of the best Jamaican restaurants in Queens. Support. Super proud I found this gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMDlUZDV3RRAB",
            "text": "I was so excited to place on order based on reviews. So I’m not going to say that the food was the worst but the oxtail wasn’t the greatest, barely had flavor. I asked for lots of oxtail gravy and whatever they put is more drenched in black pepper and see no residue of gravy. The jerk chicken has a nutmeg taste not sure about the seasoning they used, but wouldn’t order it again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidUktVDVBRRAB",
            "text": "Customer service was great over the phone. Amazing food. I ordered delivery (I didn’t do Uber eats, just called because I wanted the restaurant to receive 100% of the profit) and it came quick. I received a medium oxtail with macaroni and cheese. I would’ve taken a photo but it looked too good not to take a bite. I wish I got more oxtail because it was delicious!! The Mac and cheese was amazing — perfectly cheesy. I can’t wait to come back for more of their food options like the stew meat or even the banana bread (and tell everyone I know obviously)!\n\nEdit: I got more food the next day! The stew chicken was as delicious as I hoped it would be alongside that AMAZING curry goat. The curry goat tasted like heaven — it tastes fresh off the island! The curry chicken was also very good and I got a great portion of everything. The standout had to be the beef patty which was the BEST Jamaican beef patty I’ve ever had. Now I got to buy one with every order!! I thought the bulla had a beautiful sweet spice to it. Perfect for any meal. Everyone I knew wanted a bite of the curry spiced bread as well. My sister said she’s going to order here everyday if she can 😭. Overall, everything was perfect and I am glad there’s more yummy places to eat in this neighbourhood.\n\nI’ve missed eating things like this (that actually taste good) and they really made my day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyX3M3NlJREAE",
            "text": "Wow the oxtail was delicious! Staff was kind and polite, I highly recommend giving this place a try the food was amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMd2RhNkZREAE",
            "text": "The food was good taste fresh and very flavorful. My only issue is I ordered oxtails I got 6 pieces .. 3 of those pieces were the size of a tooth. I’m disappointed because it’s actually so good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqajdISndBRRAB",
            "text": "Lovely people and good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcHJQcE5nEAE",
            "text": "The food is delicious. More like homemade."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbmJDbE53EAE",
            "text": "The shop owner is wonderful and the food is delicious! I plan to return"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeXBEekRBEAE",
            "text": "I eat lunch here everyday while at work. The food is delectable and always fresh. The Service is top notch and they maintain a friendly and peaceful atmosphere all day long. Really Good People!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aExHZ0ZREAE",
            "text": "I actually stumbled upon this restaurant on Uber Eats after the other Jamaican restaurant canceled on me. I decided to give Jah Leng a try. First of all it came in less than 30 mins. I ordered the oxtail, it was so delicious I am sorry I did not order the large. It was soft and it was not salty or fatty. I love that the salad was in a separate little bowl. I have to find the restaurant and have a sit down meal. Very pleased!! 10 out 10 for me!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0NEtLUWdRRRAB",
            "text": "Their food is good very top-notch Jamaican authentic food made with love their rice and peas, have a similar taste of the door Restaurant\n, rice and peas It’s up there with the Door restaurant for sure I would definitely recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROeWFUcTFnRRAB",
            "text": "The food is authentic and the beef patties is one of the best around coupled with friendly staff."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxMXRySWR3EAE",
            "text": "Food was very delicious,but the potion of the steam cabbage was very cheap giving as if you feeding a toddler smh and no gravy at all on the stew chicken.Its like they didn’t even care nor put any thought to the order.I won’t order there again unless I go in person."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOdXBycEVBEAE",
            "text": "The people are very nice and the food was a 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWX0stMzB3RRAB",
            "text": "My recent visit to Leng Earth Food was nothing short of exceptional. The ambiance, sophistication and warmth, created the perfect backdrop for a memorable dining experience.\n\nThe menu, a symphony of flavors, showcased the chef's mastery and commitment to quality. There was such a variety of options and was very flavorful.\n\nService was impeccable, with knowledgeable and friendly staff guiding us through the menu. I had a really great experience!\n\nThis restaurant is a culinary gem that excels in every aspect. I highly recommend it to anyone seeking an outstanding dining experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWN0oyTkh3EAE",
            "text": "Leng Earth Food is the new kid on the block, but please do not be fooled they have the most authentic Jamaican food! Everything from thee curry goat to the rice and peas is top tier! The oxtail is fall off the bone and the jerk chicken is the BEST! Their most popular item is their beef patties and you have to give this place a try to know EXACTLY what I’m talking about. One Jamaican patty will taste like you got it directly from the island itself! If you want to get your hands on one you have to go early,  just FYI because they’re that good! The customer service is amazing, Jasmine was a sweetheart when preparing my food! Whether you’re a Caribbean connoisseur or someone wanting to try Jamaican food for the first time, give this place a try you will not regret it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsOVlQUXdBRRAB",
            "text": "Omg the food here is amazing ! Good authentic Jamaican yard food! I love their freshly made coleslaw it’s so good ! Try it you won’t be disappointed!"
        }
    ],
    "reviews_count": 19
}