{
    "name": "The Door",
    "place_id": "ChIJQ_nSGs9mwokR2_a-Gi29YnU",
    "grid": "QN12",
    "address": "163-07 Baisley Blvd, Jamaica, NY 11434, USA",
    "rating": 4.3,
    "user_ratings_total": 7145,
    "phone_number": "(718) 525-1083",
    "reviews": [
        {
            "date": "18시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWlRVSnlRa3BpYjFCVE1XdFpSMlZqZGtOM05sRRAB",
            "text": "The staff of this place are one of the worst, they do not offer attention with deliveries for UBER EATS order collections"
        },
        {
            "date": "20시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jd1JIbFdkamRzTlhKNmJXUTNNV1Y1VlZSR1kzYxAB",
            "text": "I enjoyed nothing about this restaurant. The drinks were eye catching, but lacked in taste/flavor. I make better drinks/beverages at home. The jerk wings was the best thing I had. The curry goat was a teeth destroyer. The goat was chopped up so small you had to spend so much time knawing the little meat it had on it off. The rasta pasta was the weirdest rasta pasta I've ever seen in all my years eating rasta pasta. The size of the steak was big, but not in an appealing way. More like, ugh, maybe i should be a vegetarian, or are the Flintstones joining us. It looked dry and the flavor sure didn't match it's size. The Mac and cheese tasted and looked like weeks old macaroni and cheese. Flavor and cheese boycotted that dish as well. It was crumbly, dry, and orange. No cheese present, nothing stretching when you lifted your fork. So needless to say, we all left hungry. I must speak about my server, who was the absolute WORST. Service with a smile is not what this young lady was giving. Her energy was as miserable and dry as she presented herself. Her tone at moments made me wonoder if I was I military school. I'm so sorry we decided to dine on your shift, we certainly didn't mean to be a bother(sarcasm). She ignored calls for attention and passed us on by. She passed food over my head when she was serving plates multiple times. She put my son's (6yrs old) bowl of macaroni down on the edge of the table. So half the bowl was off the table. I had to immediately push it forward or it would have fallen. She hollered at the table for the menus post ordering, a distance from the table that jolted everyone to attention. I wondered if she wanted me to pick them up and walk them over to her, I immediately became confused. Your in the middle of the walkway asking for menus with your hand out. 🙄..Yes, confused I was. Then we're forced to give her a big tip. Tips should be based on service. Yes, we should have to leave something, but not light bill money for poor service. No ma'am!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4S1oxVTFTVkl5VVVSUGFuSmtabUZ3TkU1YVNWRRAB",
            "text": "Lovely experience — calm, comfortable, and very well organized."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdFRYY3lUalphVVVsNWNIZG9ObTR3UmxSMlExRRAB",
            "text": "Such a wonderful place — everything was perfect from start to finish."
        },
        {
            "date": "수정일: 4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbmJ1T1NREAE",
            "text": "⭐ 1-Star Review\n\nI am extremely disappointed in the customer service I received today. On October 31, 2025, I called the restaurant at 11:40 AM to place an order for calamari. I was told by the woman on the phone that she could not take the order over the phone, so I politely asked:\n\n“What is the latest time I can come in to place the order in person?”\n\nShe clearly stated: “12:00 PM.”\n\nI was only 7 minutes away, so I drove immediately and arrived at approximately 11:50 AM — well before the time she gave me. When I arrived, I was told the kitchen was closed and they would not take my order.\n\nI called back to clarify, and the same person answered. When I reminded her she told me I could come before 12:00 PM, she suddenly responded, “The kitchen is closed,” even though it was not yet 12:00 PM.\n\nWhen I then asked for her name, she refused and placed the phone on silent twice.\n\nThis was not only unprofessional, but it clearly shows a lack of customer care and accountability. I have previously rated this restaurant highly (4 stars), but after today, I am changing my rating to 1 star.\n\nI don’t mind if the kitchen closes — what I mind is:\n\nBeing told one thing over the phone,\n\nRushing to get there within the timeframe given,\n\nAnd then being dismissed and ignored when I reasonably expected the agreement to be honored.\n\nThe lack of honesty and respect was the real issue."
        },
        {
            "date": "수정일: 4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvNWF5TW1nRRAB",
            "text": "Amazing people service a little slow for drinks but the food was out of this world good."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVVVVUmFUMFJXU2xVd1EyZHdURUUyTFRWalMxRRAB",
            "text": "Elegant high class Jamaican Restaurant. One of a kind authentic seafood and traditional Jamaican jerk chicken ."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQlJVRlNTbmhWYjE5VVh6VmpRVzVzWjJsa1ozYxAB",
            "text": "Super good"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNjduaVpREAE",
            "text": "For the past two years, they have constantly messed up my orders and the food doesn't taste the same.\n\nToday, they left out the saltfish with my meal, and they purposely cut the banana into tiny pieces.\n\nUpdate: One of new trainees working there has a filthy attitude and she doesn't like to do her job, but loves to roll her eyes, and the manager is stuck up and is of no help either. The food has become mediocre at best. They don't value their customers, they just value your wallet. With take-out, they are constantly messing up people's orders, especially when you call before you come in, and some of them get irritated when you ask them change something."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUlZWZHRTM1ZUTm10eWNYVnZVelZCY1VoVGFGRRAB",
            "text": "Absolutely incredible authentic Jamaican cuisine with fun drinks and great service"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndk1pUGpnRRAB",
            "text": "Great food and ambiance."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaYU5FWlVRbXd5WmpBeVIxVmxWVGh1VkRGMmJXYxAB",
            "text": "If I can give a customer review services, I would give it a zero.  I ordered my Food 123. Why is it 2 o’clock and I’m still waiting for my bloody Food? No one is giving me an answer as to what’s happening not even the decency to say I asked for my food like three times didn’t get an answer the fourth time I demanded an answer. I got an answer that someone went around to get it at least have the decency to tell me that I’ve literally been standing on the queue for that long.  So I just left without any food in my hand because I’m not waiting to spend my food. I’m back customer service that’s rubbish."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWFMxOWFUbDlsZUhCMVprRldWWE50ZWxSR2VWRRAB",
            "text": "The food was great. Good atmosphere and everyone was very friendly. I’ll be back."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvMHE2ZVBREAE",
            "text": "Visited last night couldn't believe I was charged $20.50 for 2 slices of cake."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOTdDZ3RnRRAB",
            "text": "We had a reservation for 7pm, whole party was at the restaurant at 6:45pm...at 9:05pm we were still waiting to be seated. After voicing my displeasure (why bother to make a reservation?!) with management, we were ultimately seated. Despite our time not being considered, and two desired entrees not being available, the food was considerably tasty as usual."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMFEyRktNRFJvTVVReWVpMHpTVGhaUjIxWFFuYxAB",
            "text": "Stop by to grab some food..realize my food wasn't visible red flag.. waiting on my number to be called so I ask how long..5mins, this lady with fake eyebrows getting an attitude bcuz I wasn't laughing jollying up with her..is this a place for business or a meet n greet?? Won't be visiting no time soon..Ice will humble y'all soon..no worries"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSFNXZ3RXVW8zTTBGQlREbFNhelIwUmt4d1NuYxAB",
            "text": "It been a while since I ordered from here\nGot me steam fish and white rice horrible\nThe rice was Stale 1 plantains it was a disappointment."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCa1QwRnJVVVJZUjFNd2QyNVdaekpLY0ZoMFdVRRAB",
            "text": "They do not follow instructions what so ever and when you make a complaint its nonchalant literally said no chicken foot and still put it said gravy on rice no gravy said fish separate and they mix it with the oxtails and tells me after i said i paid a extra dollar for a separate container for my fish and was told to complain to uber eats and get my dollar back literally messed up my whole order"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFM1ExaGhVa1Z5U2pKUE0ycG5NVlpsWkdWTVRGRRAB",
            "text": "Best foof ever"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOd1dIZzRZbmRPTjBaMlN6TnNRWGRhWlRrdFEwRRAB",
            "text": "I was just there sitting down over 20 mins and only served water. It’s like they pay attention to the bigger groups or they need more waitresses. So so disappointing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTFlYUnVSWEI1U2poUGNFeEZWVUU0TW5CVWJIYxAB",
            "text": "The time of day was perfect when I went. Not many diners, drinks were good and the food wasn't too bad. They had great music and the staff were friendly and attentive. The place can do with a little upliftment in the decor dept as it looks very dated... Like late 90s dated 😬"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSk9WUkpVVzgzVGxGVE5UWTJSRXQwTVVnMlduYxAB",
            "text": "Excellent food and service. I took my Mom there for dinner during my visit to her. Hope to be back next time I'm visiting NY."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRM2FDMEN3EAE",
            "text": "Scrumptious food, subdued setting and prompt service keeps me coming back to The Door!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNk9VZGhXRWw1TUdWV2JsVlFkM2xMVm1NME5YYxAB",
            "text": "The worst Jamaican food ever. I will never go back there ever and I will never recommend what they serve and the cooking is a disgrace to the Jamaican way of cooking"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMlVqQTRZMlpmU2pORE5tVlRNRkkzTm5CdlltYxAB",
            "text": "I haven’t ordered from here in years and decided to get a large oxtail tonight, which they served with one single plantain, rice and peas, and cabbage. The rice was so dry and even though I requested extra gravy on the oxtail, it was not as saturated as I expected. I like my oxtail falling off the bone. The meat was so tough, I had to bite harder than you should have to, to get the meat off. Portion was okay, but could’ve been better. This was a no for me, but thankfully, I used an uber eats gift card, so no loss of my own."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205S2RUSldObWhKUVRaTVNXaEZhRE5GZDJwbVUwRRAB",
            "text": "I love their food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFd1MwbDBlRGwwV25SRFgzaHZWazB5TkdGRFZsRRAB",
            "text": "We ordered from the door for an event of about 110 people.  Our menu included rice and peas. macaroni & cheese, collard greens, BBQ wings, fish and we received 4 pans complimentary cornbread based on our order.  The food was delicious and the service was excellent.  From the time we called to order the service was exceptional.  The Door is not only our go to Restaurant when we need to dine in or take our, but it is our #1 place when we need catering for events."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvdGNVdEZhWGw2ZG0xck1GQkxiRlJJYWxWYVkwRRAB",
            "text": "The Door never disappoints - great service, professional staff, and consistently delicious food. Whether it's breakfast, lunch, dinner, or a quick takeout, the quality is always on point!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213eU4waHZjVFF4VDBndFZGOUhVM05YYlVadWFHYxAB",
            "text": "Food was delicious  but portions were small.  Service was good and the atmosphere was nice."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSU5sTTRRVmxMZEV0b2FUZElXVm93ZERKeFZWRRAB",
            "text": "Use to be better for me. The waitress never smile look like she got attitude.  Food too expensive if u bring families.  Stew chicken was tuff on the outside. Fish dinner more costly than other cultural fish dinner. Not worth it to me anymore."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCalptOW9hM1phY0VoRWVUVXRTbDlPTFRoaU1XYxAB",
            "text": "Waiting!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaE0xSlNjR2QzUnpkZlRtVTVZMVppVmpnd1RrRRAB",
            "text": "The Door has been holding it down for years with their food. Always on point."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTWVEbEZaMU5LVTBoTVMwZFlTbTFOTTJOb1RrRRAB",
            "text": "On Sunday my Nephew and I had dinner at The Door, I tried the Salmon-run-Down with Rasta-Pasta, fried Plantin Baby Carrots String Beans Broccoli and Cauliflower it was delicious with Sorrel Drink my Nephew had the Curried Goat with Coconut Rice and Peas, fried Plantin and cold Corona. I certainly would recommend you try these. The atmosphere was great, service was great. Our waiter was Courteous pleasant and helpful. Beautiful music playing in th e background. We had a great time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVmVVSlhORk52V0RJd2FWaFJMVUoxWWt4Q1VVRRAB",
            "text": "Manager wants to talk back when your food wasn’t satisfied lots of bones little portions of meat and expensive"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVNFkwSjFZV3N4Tm5Vd1EwSk1hbGQ1VVVsUWVWRRAB",
            "text": "I LOVE their food. I will always return. That’s how good the food is."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVlZHVlBjalJDUTA1WVNYTkJSbTFRVkZSSE1uYxAB",
            "text": "Food is sub par. Hit or miss.\nOrdered a large curry shrimp. (7) given. And whole container of rice and the shrimp taste like the freezer…. Not impressed at all"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvd1RUWTVTa2RSYmxFMGVFdzVjMWMyZW5VeVJHYxAB",
            "text": "My experience bought me back to 2009 when I was pregnant. Yesterday I ordered oxtail, mac and cheese with veg. The mac and veg was ok. The oxtail was HORRIBLE,  VERY TOUGH and they gave me 4 in large meal. They weren't tender at all. I've eaten in the restaurant and the food was good so I said let me try their oxtail 16 years later and I'm so disappointed they weren't tender at all.. 52 dollars on 2 orders and we didn't eat it.. The rainbow pound cake was good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcWJETnBSV1ZXYmw4eGJWUTJPVGhyVTBoSWJuYxAB",
            "text": "So good. Good service."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJM3NtclN3EAE",
            "text": "Food isn't what it use to be. I mean it's ok but not hitting like back in the days"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjd1gzVXpjMnBNU0cxcVEyeEhWVnA2ZUZFeWMzYxAB",
            "text": "Their food fell off! Probably a new chef but it ain’t good like before. The chicken is dry or undercooked. They put more veggies than rice. They’re stingy with rice and they flood the container of food with gravy!!! The food has been lacking flavor and I believe the food that they give you is leftovers. And on more than one occasion I've found hair in my food, it's disgusting! I instantly lost my appetite and had to literally waste the food. A waste of money for poorly served food, never again! I believe the food and the place are unsanitary"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLWGtqN1hLaV9pem1RRRAB",
            "text": "Regrettably, the recent dining experience at this establishment fell short of expectations. My order of Rasta pasta, which was ostensibly penne à la vodka, was unfortunately misrepresented. The pasta resembled penne, but it was accompanied by a pronounced taste of raw vegetables, including broccoli and cauliflower. My son’s curry goat was disappointingly small, with the goat meat being excessively chopped. My mother’s order of oxtails was also unsatisfactory, as they were not seasoned and the cabbage was neither cooked nor seasoned. The rundown fish, typically a curry and coconut blend, was instead flavored like an entire can of Carnation milk.\nIt is unfortunate that this restaurant has lost its quality, despite the excellent in-person customer service. However, the experience was marred by a rushed and unprofessional phone order process.\nAs a result, I will refrain from patronizing this restaurant in the near future. I am also considering seeking a refund for my recent order."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNlJqbG9lak5FYjI5eWN6QXdaR0ZRV1c1SFFrRRAB",
            "text": "Thank you, Michelle, for your services. You did a wonderful job 👏  and Michelle \"checks\" on us were on point. I was a bit skeptical in dining in the Queens area, but we gave it a shot. The service was excellent. I'm a bit skeptical about the parking... the church parking lot was offered to me to park there, and I was afraid to park. The host said they would take full responsibility for me  parking there, I would not recommend parking at church if you are not a regular guest there. Be very cautious. It does have a warning sign. Read carefully that could be on you. Everything was acceptional, except the part where I'm not sure who failed to understand, when a guest said to the server at taking main course order, I'll take my dinner to go but please put my goat curry in separate container from my rice, because I want eat my peas and rice later, and I want the gravy to go with my white rice I have at home, I'm sure it was not my server, even though she was very busy everything was  👉 on point 👈 from her end. I only found out when I got home, I was very disappointed \"see pics\"  I wished some people would listen to the requests. That is the reason for the 4 star. My server did her part in putting my order in, I told her we were not in a rush and fire our meals when we are ready. Everything is enjoyable, not too much salt or spices, I would possibly give it another shot sometimes in the near future only because the manager came and checked on us... I appreciate all the services. Some of the servers need to smile a little bit more. It will be a lot more inviting. Please don't be too hard on your employees, thanks to everyone who serves us, kudos kiddos 👏"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMWVYUlNNbEpHWlVOVVRHVlpiV1F6VFZScVUwRRAB",
            "text": "The food was great. Best brown stew chicken/rice and peas my wife and I have had in years. The garlic mash potatoes were amazing too. We’ve been trying find good island food for a while with no luck. But that changed! It’s good if I’m being this dramatic\n\nBeware the drinks STRONG.It wasn’t crowded and the food came on time. But I can imagine that on Sundays or just certain days it can get packed. I paid less than I expected which is always a plus. I will be back with my friends and family."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acFEycGFjMjB3UWpKWGVFZENYMFoyTFdNdGFsRRAB",
            "text": "This restaurant did not live up to the hype for me. We were able to get reservations on short notice for a group of 16 and parking was available. Service was average since we barely saw our server. Some meals took longer than others to get. We loved the calamari, but the jerk chicken and stew snapper were a bit dry. The veggies were barely touched because the green beans and carrots were too hard. The music played was enjoyable though."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bk0yTkZWMEpST0ZCV0xXWllUMGx2VkVsMVJWRRAB",
            "text": "This is my second time dining at the Door for dinner. This is a nice place to celebrate an anniversary. The food was good. I had the crab cakes for appetizers, brown stew chicken for the main course, and strawberry cheesecake for dessert. I enjoyed everything. The oxtail is good. I haven't tried any of the other drinks, but the pina colada is a great choice. Excellent service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLU3gxUDZGbmVqNTh3RRAB",
            "text": "The food is worth the wait if you’re walking in without a reservation they do their best to accommodate!! Depending on how busy of a day you might have a wait for the food but the free bread basket does help, the cornbread was great my toddler loved it. It was colder than I dressed for in there but very clean. Bathroom could use more frequent maintenance."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQ1ZIRlllRUZZYkdRNFQxRjNValpwV21wSE9VRRAB",
            "text": "Extremely disappointed in The Door have been ordering with them for many years. Seems that their quality of service has gone down the drain ordered a dinner plus a side of macaroni pie and unfortunately, while eating the macaroni pie, realized that you had mice droppings in the pie thank God I pay attention to what I eat, but who knows if this has Happened to many other people who haven’t been paying attention Extremely disgusting and extremely disappointed in my Caribbean cuisine. I have referred so many people to you sure you do not need my recommendation, but I will definitely let people know what happened tonight."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oa1RYTXlUR3h5ZW5OTmMwdFVUelZhTkVSb0xVRRAB",
            "text": "The Door’s food is amazing. The atmosphere reminds me of your fancy West Indian relative’s house 😂, elegant and proper .  The people working there are very nice and you feel at home ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VON3lfN3ZwdTlYRVZREAE",
            "text": "I did uber eats from this place and it lives up to its reputation. Good food and big portions. The jerk chicken was great - tender and had a zing with the jerk sauce. The roti was large though a little dry. The fried plantain was a nice touch as well. The pineapple ginger was fresh and nice as well"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cGVVdFZja1l3Y25VNFdWRkhaRlUwWW5WME9WRRAB",
            "text": "I ordered through Uber eats. The oxtail is good, not tender but seasoned well. I’ve never seen Rasta pasta cooked raw and tossed in oxtail oil. There’s no difference between sauce or saucey we ordered both and the other just had oxtail gravy on it, and mixed with cauliflower and broccoli? That’s not Rasta pasta. You need to remove the option and explain exactly what you’re serving.\n\nIf I ordered anywhere else my food would last two nights. I don’t enjoy spending $60 on bullshit servings."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4alJsZHpNV0l4Y1RFNWMxcE9PRk5CYjBKa1QzYxAB",
            "text": "EXCELLENT tasty food, Jamaican style!! and great service my our awesome waitress."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNN3FfTlhlMDliRElREAE",
            "text": "If you noticed, all the decent reviews are for dining IN. Ordering take out from the door is a literal JOKE!!  The door is over priced !!! & it’s time we admit that it’s overpriced and not worth the dollar amount.  there’s no way a plate of ackee, saltfish & rice should come up to $25 why is your bottled juice being sold at $7 as if it’s freshly squeezed juice ?!?! The customer service is ridiculous every female there HATES their job or atleast that’s what it looks like! They can’t even smile to try to woo that $25 out of you, everyone is just rude, feisty and lack customer service. AND THE WAIT TIME IS OBSURD!! They don’t offer small / medium sized plates of specific meals which forces you to buy a large buy do not give the proper portions that they’re charging for …. Atleast drain the oil out the plate ! 0/10 won’t recommend! I guess Unless you’re dining in!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaExPLWl3RRAB",
            "text": "Still one of my favorite go to Jamaican spots, although I find that the food used to be better back in the days. The servers are always pleasant and polite. My go to dish will always be curry goat and fried fish entree."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdHJhZHp3RRAB",
            "text": "I love eating from The Door for years now. Dining in is much better than takeout but takeout is still good nonetheless. Snapper Rundown is my favorite. But I have eaten many other meals. All of them have perfect flavor. The drinks are good too. Fresh lemon ginger juice and carrot juice are so good. The servers here are very professional and knowledgeable about the options. The Rasta pasta tasted weird to me, so I wouldn’t get that again. Everything else is delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNWJhZHJBRRAB",
            "text": "Went to \"The Door\" for husband's birthday. As we walked in we were greeted and seated and attended to. Our waiter came over shortly who was very professional with a witty personality,so sorry I can't remember his name...he has locs. We ordered our meal and also asked him his suggestions which he gave. Long story short food was great! And for my husband who usually find faults and couldn't find any I said it's a plus. We had the roasted fish, curry fish, white rice, mac and cheese, corn bread was given as an appetizer. pov usually I must surly have my rice&peas but surprisingly the white rice was really good .glad we didn't over order because it was very filling. At the end of our meal they surprise him with a happy birthday song and a delicious complimentary cheese cake."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNDhXMFJBEAE",
            "text": "Good spot for Jamaican food.\n\nRatings:\nChicken soup 9/10\nSavory broth with mild spice and fresh chicken including well prepared chicken feet, falling off the bone.\n\nOxtail 8/10\nSlow cooked, soft, covered in sauce. They give you full sized pieces.\n\nFried chicken 8/10\nTaste like homemade fried chicken. Fresh and nicely browned.\n\nMac and cheese 8/10\nBaked crust on top, filled with melted cheese. Not spiced or seasoned inside.\n\nRasta pasta 8/10\nBig pasta pieces with veggies and creamy sauce. Not spiced\n\nPineapple ginger 8/10\nHomemade, sweet, mostly pineapple flavor with a bit of ginger.\n\nGarlic shrimp 7/10\nNot sure about the garlic part but it's decent shrimp."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIZzlTMkpnEAE",
            "text": "This place is usually good. However, came here tonight for some food with my friend. We did not really enjoy the food. I ordered the brown stew snapper with rice and peas and Mac and cheese. My friend got the Rasta pasta. Rasta pasta tasted like regular macaroni. It was not spicy. The brown stew snapper was just okay. Not what I expected. My waiter forgot about the Mac and cheese. It seems very busy we did not bother asking for anything else. I paid the bill and was charged for the Mac and cheese. However when I got home I realize it was never in my plate. I was missing my order of Mac and cheese in which I paid for but forgot about it completely.  Drink was fine. Appetizer- the jerk chicken was really good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReWIzLWd3RRAB",
            "text": "What a wonderful overall experience.  We celebrated my mum's 87th birthday.  From beginning to end they were communicating and very open.  Very professional although we were late getting started.  The food and cakes were delicious.  Thank you to all The Door staff, we'll done."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzd3MzUkp3EAE",
            "text": "Looks can be deceiving. I think it depends on the day and time that you come here . But honestly the food was not great and they are a bit pricey .  The Mac and cheese tasted old , the starter corn bread was really hard.\n\nThe stew chicken tasted like a lot of ketchup . The oxtail meal was a small portion. The Rasta pasta taste like just regular pasta and sauce . The curry goat was full of bones that we had to ask the waiter for a new meal . I personally wouldnt recommend someone to come here.\n\nAnd if you’re from NY you would know there are better tasting Jamaican food around ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNFFVUkJkSEJLTjJGRlFWVlpOV2xrUTA1SlluYxAB",
            "text": "Was in NYC for my husbands funeral service. I believe it was 20 to 30++ gathered for REPASS(repast) at The Door. Everyone seemed to enjoy their dishes. I myself had the fried chicken w/ steamed cabbage, mac & cheese. The portion servings was a lot. So much so that some left with to go containers. I usually would've added pics of the plates. The next time I'm in NYC I'll stop in again at The Door restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoak5IcFJkRlYzT0UxUFNYRnpZVmRNY2xCS04wRRAB",
            "text": "The food at The Door is as authentic as it gets. Everything I’ve tried here has been well-prepared and full of flavor. The takeout section offers great value for the quality of the food, with very reasonable prices.\n\nHowever, the same meal is noticeably more expensive when ordered in the sit-down dining area. While the ambiance and service may justify the higher cost for some, it’s something to keep in mind if you're budget-conscious.\n\nThe takeout wait times can be a bit long, but that’s simply a sign of how popular this place is. Thankfully, the staff handles the rush well — they double-check orders before handing them over, which helps minimize mistakes even during busy times.\n\nOverall, I highly recommend The Door. Whether you're dining in or taking out, you can expect delicious, authentic food that's worth the trip."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNieDlQdWJREAE",
            "text": "I recently dined at The Door, a Jamaican restaurant, and the experience was amazing. We had the oxtail and the Escovitch fish, and both dishes were absolutely delicious! The flavors were authentic and perfectly seasoned. The cornbread was to die for! The service was friendly and attentive, making the meal even more enjoyable. Highly recommend this place for anyone craving authentic Jamaican cuisine!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNWJIWFdBEAE",
            "text": "The best run down snapper, mac and cheese and brown stew chicken with rice and peas. 4 meals for $100.  Worth the money.  You get a free lemonade with your meal during the week."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oR1VWa3hiRjlqUms1b2RWSnZPVXhLZDNsc1QyYxAB",
            "text": "First time ordering from The Door and it was absolutely delicious! Cannot go wrong with chicken and waffles for breakfast - skin was crispy and well-seasoned, waffles were perfection, even after coming as delivery. Pineapple ginger juice is a must-try. Will definitely order again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbWRqVXhUekZsY0Y5amJsZExZazlHV1RFMU1HYxAB",
            "text": "The food at The Door is amazing! We did take out from there and it is delicious. We had the chicken and waffle as well as the jerk chicken. Both items were perfectly seasoned and crispy. I'm looking forward to ordering again and trying their curry goat!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSFprbGZTalJGTTFSdFltdDNTV1ZNYldaaVpFRRAB",
            "text": "We went here for my brothers birthday and was nice, the food was good just not much spice . The presentation was amazing. We ended up changing our server and got Simone who ended up being amazing !!! She was so kind and very attentive. I highly recommend her ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJd05mUWlRRRAB",
            "text": "The food was excellent. especially the goat head soup. steamed curry fish with okra, pumpkin vegetables with steamed bammy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURua2QyaDZ3RRAB",
            "text": "I had takeout brunch from The Door Jamaican Restaurant today, and it was fantastic!\n\nI placed my order by phone, and it was ready for pickup in just 30 minutes.\n\nThe service was excellent, and the wait time was very reasonable.\n\nI enjoyed their delicious salt fish, dumplings, and banana, all perfectly complemented by a refreshing sorrel drink.\n\nWhether you’re dining in or taking out, this is definitely a great spot for any meal!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUGJUUjRXRFl4TW5SalFrNUJSRUZwVVVOZlRsRRAB",
            "text": "I had a deeply disappointing and concerning experience at The Door restaurant. I placed an order that included jerk chicken with rice and peas, red peas soup, and curried goat  and nearly every item was unacceptable.\n\nTo begin with, they completely messed up the jerk chicken order. Instead of rice and peas, I received what looked like day-old white rice,  clearly instant and poorly prepared. Even worse, they only included a small piece of jerk chicken, which felt more like leftovers than a proper portion.\n\nThe red peas soup was outright inedible. It had a foul taste as if it had been left out overnight and simply reheated. I had to throw it out immediately.\n\nThen came the curried goat, which turned out to be the most disturbing part of the meal. The goat meat was tough, with visible hair on it, and the curry wasn’t even fully cooked, it had that raw spice taste that indicates it was rushed. Shortly after eating a small portion, I became sick and experienced stomach issues.\n\nOverall, I had to discard the entire $40 meal because it was not only poorly prepared but also potentially hazardous to my health. I will be contacting the health department to report this incident, as no one should be served food in such an unsanitary and careless condition.\n\nTo the management at The Door: You need to do better by your customers. Serving spoiled and unsafe food is not just bad business it's dangerous."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcnV1Y1lREAE",
            "text": "This place was so hyped up that when I decided to meet up with my friend from high school (7-1 gang), I suggested we grab food and drinks here. We got seated pretty quickly - which I liked - we went on a Thursday night so I guess that's why. For appetizers, I got the chicken soup & my friend got some kinda shrimp dish. My soup was pretty good, just wished it wasn't luke warm and my friend demolished his shrimp dish, which is a good indication that he enjoyed it (I think). Our entrées of sweet chili chicken & shrimp and brown stewed chicken were decent. For drinks, I took our waitress' suggestion of Painkiller. I didn't quite like it - it had a creamy, fruity taste. My friend got the Creamy Wray which we both liked. It gave us a Mudslide kinda vibe. I enjoyed the conversation and company most!\n\nI wasn't blown away by my overall experience. Visit though, you might like it better.\n\nChicken soup - 7/10\nSweet chili chicken & shrimp - 6/10\nPainkiller- 4/10\nCreamy Wray - 9/10"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMT0NsZmZPcHZDdGhnRRAB",
            "text": "This restaurant was recommended for a family later,  and upon checking out the menu and getting other personal feedback ,it was my choice for the event.  There are definitely enough choices on the menu for every palate . We ordered delivery for 20 people. Got small pans of curried chicken,  fried chicken,  rice and peas, steam veggies, plantains, and a sweet potato pudding, and they gave us a large pan of corn bread complimentary .\nOur family enjoyed the food. It's very tasty food ,  nicely done ✔️.  The corn bread had a nice twist - very delicious 😋\nThe phone service to order was smooth and efficient,  very courteous lady - I believe Jody.  I tried ordering online, which was easy, except I didn't see how to get delivery, so I opted for phone order..\nI was impressed that I got a call the day before delivery to verify the entire order and place if delivery and if I needed anything else. That's for sure service!\nOnly constructive criticism I had was food was delivery 30 minutes early which I didn't expect because I wasn't at the location to receive it and I didn't make plans to keep food warm because we wanted to be there,  then eat once food was delivered . Therefore, we had just barely warm meals . Gladly, it was good food, so that made up for that turn-off..\nThe driver said that was the only time he had to deliver... Hmmm ( I guessed that was some internal issues with logistics)\nI just realized I didn't take photos ...yikes..lol\nI found this catering service reasonably priced ."
        }
    ],
    "reviews_count": 71
}