{
    "name": "Port Royal",
    "place_id": "ChIJmWXEb9VmwokRjF1jCQqmh54",
    "grid": "QN12",
    "address": "113-07 Sutphin Blvd, Jamaica, NY 11435, USA",
    "rating": 3.9,
    "user_ratings_total": 1317,
    "phone_number": "(718) 323-6444",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eGIzSXRjbkZHYVRrMlVtTmpiV1F5V1RWbVRWRRAB",
            "text": "Very friendly staff makes you feel like you had known them all your life amd the food, good quality amd fresh"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WemNFaEtZV294UWtkRE9HTjBZWFpSWm5sWVZXYxAB",
            "text": "I ordered Rasta pasta and they gave me macaroni salad & missed my plain roti I ordered !!! This is the 2nd time I’ve experienced them and I’m done with them I will be finding another place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTU5WWm9UR2R5TVdKcE4yWXlWMWRPYWpsc0xWRRAB",
            "text": "I ordered a baked chicken dinner, only to get alot of rice and 2 pieces of chicken which had mostly skin and bones. Very little meat after separating the skin and bone.i think chicken is one of the most inexpensive meats so why not serve customers more and better pieces of chicken with the meal instead of packing the plate with rice to make the food seem plentiful. I do hope management will hold a serving class with their workers to ensure satisfaction for all customers who spend their hard working money at this establishment."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMWNURm9WazVIVTIxbFR6a3hVV1ZpTFhkeUxWRRAB",
            "text": "Port Royal is a great place for me nice Jamaican food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GblNHbEdaemxOVVdkeWNtaElWemxWTmsxTWVFRRAB",
            "text": "Port royal is a shit restaurant I spent 45 dollars and no receipt the cowfoot soup have no taste the salmon is rank the curry goat is half hard however the mac and cheese came out while I was shopping I couldn’t bring myself to eat it"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWG02TGlyeC1fYW1RRRAB",
            "text": "Food is great, come early cause they only cook once for the day. When a. Item is finished it’s GONE."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLTGZydGFiNkltTUF3EAE",
            "text": "Port Royal has been in business for many years. So they must be doing something right.  They do Jamaican takeout which tastes good and always has a line. The customer service could be better. They don't allow you to mix and match. And like most restaurants they give way too much rice for their prices. Oxtails are too sweet and liver is cooked too hard. The Akee and salt fish is good. Food sells quick and sometimes they run out. A decent place to order takeout."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOSzVzTWFoaC1xbExREAE",
            "text": "The goat was great and seasoned well"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPQ3ZzTTNqdV9UWWtRRRAB",
            "text": "Bought spinach rice and jerk chicken. The chicken had feathers. Was such a waste unable to eat it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa2JEQnJRRRAB",
            "text": "The food is delicious"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvODgzc1VREAE",
            "text": "I ordered a veggie meal via post mates, and found a weird looking piece of black meat it in. I felt so sick to my stomach… will never buy food from this place again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMTlUVk1nEAE",
            "text": "My husband and I go here quite often and we always have a good experience. The staff was always friendly and we never have to wait long for our food. Love this."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMHBHTGl3RRAB",
            "text": "My food literally has plastic in it. Not even just one piece i found 2 pieces of plastic in my oxtail. So disgusting and obviously not a clean kitchen or chef. Do better."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3Z3VMTmVREAE",
            "text": "Was feeling a little under the weather so I stopped in for some soup. Ordered a large soup and he proceeded to fill the container up with 7/8 broth. I will not pay $10 for chicken foot broth. Then you want to play dumb like what’s wrong with the soup. You mean what’s wrong with the broth?"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRN2ZqajZ3RRAB",
            "text": "I absolutely love the bakery at Port Royal! The cakes are beautifully decorated with great attention to detail, and they taste just as amazing as they look. While I can’t speak much on the food from the restaurant side, the bakery truly stands out.\n\nThe baker was incredibly kind and provided excellent customer service—unfortunately, I don’t remember her name, but she made the experience even better. For a Jamaican restaurant/bakery, the warmth and friendliness she showed were refreshing. I’ll definitely be back for more sweet treats!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNnRENmV3EAE",
            "text": "Ordered a banana bread and a baked chicken (dark meat only) with spinach rice and vegetables.... I got banana carrots  and for the meal chicken breast with a leg (not baked and not dark meat only) with white rice and some dirty looking gravy... very disgusting.. had to get my full refund for this garbage... I don't know if the staff cant read or it they just don't care about people's orders but this is unacceptable... would not recommend ever!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOGRUR3hRRRAB",
            "text": "Good food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnblBhOGhRRRAB",
            "text": "Got Mac and Cheese with salmon. It was really good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaHZ5S1F3EAE",
            "text": "I swear who ever that cook that curry goat on Wednesday make me believe I was in Jamaica for real.. What kind of seasoning was that.? I need a talk with the boss man for I need to know where he find that chef and that real RAM goat for the food taste 3 good. You can taste every season stand up in that thing. I give to the chef. For that taste like when you at areal yard dance and get some real wood fire red stripe beer goat..  Pimento stand up thyme stand up scallion stand  up.. Rate the chef A+++++"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmc2VtdFJREAE",
            "text": "Got two slices of cake from them and both had mold on them. Never again"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NjhySXB3RRAB",
            "text": "The worse. They advertise delivery service. Never have a driver. The customer service is high school. Too many attitudes. They take delivery orders to not deliver. They take orders just to annoy you. if they do deliver it’ll be over an hour…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQXzRIODZRRRAB",
            "text": "food Jamaican curry hits different man"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQLU1UVV9BRRAB",
            "text": "Chocolate cake magnificent veggies stew superb bun and cheese not good"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzODZMaEV3EAE",
            "text": "Food always fresh tasty and delicious 😋"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzblpHd1FBEAE",
            "text": "They don’t care about delivery orders"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcVp5RWZREAE",
            "text": "I had an amazing delicious experience! Food was so mouth watering.  Flavors were authentic! Oxtail meat was my favorite. Goat was well prepared. Mac and cheese very rich. Can't complain about the food or staff. Just wish dinning in experience was more accommodating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscXEzTVBREAE",
            "text": "I got best oxtails! Everyone is so friendly! Delicious food nice environment! I highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqeDVMdVlBEAE",
            "text": "Ordered the brown stew chicken and rice and peas and jerk wings mac and cheese and rasta pasta. Everything was good. Reasonable price. Will be returning I the future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMak9YcXlRRRAB",
            "text": "Ordered the Mac n cheese and cheese cake. Both were disgusting. The Mac n cheese tasted like it was reheated and placed out since yesterday. I will not go back. I was disgusted with the cheesecake as I saw there was mold on the cheese cake. Never go there again"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPN0tuWExnEAE",
            "text": "Disgusting 🤮 they’re trying to pass this off as “jerk chicken”…TRY AGAIN!!…the chicken was BURNT, I tried one piece that wasn’t so bad & it tasted like 4 days old dried out thanksgiving Turkey. I would never recommend this place to anyone. I’m wondering how they’ve stayed opened this long with such horrible food.…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMDhEV0NREAE",
            "text": "I like their variety of food selection, soups, beef patties & pastries. I recently had their oxtail with rice and peas & it was good. Their Jerk pork is also good too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtbzh1clJ3EAE",
            "text": "I usually don’t get their roti but everything else is good so I ordered and received this Disrespectful plate of steamed cabbage in roti skin! Not a dash of curry! This needs to be removed from the menu asap!!! Very disappointed."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnazZ6cXZBRRAB",
            "text": "I ordered for a 4th of July 2018 cake, seeing the cakes and tasting the cakes that were displayed taste yummier than the one I ordered for Independence Day. I had to throw it in the garbage, it was so disgusting. Wacky cake! 🤢 disgusting cake! I just thought to myself, why can’t they bake the types of cakes displayed in the glass. Those cakes tasted way better than the cake I ordered for. I paid up to $50 for a disgusting cake that I had to trash. The icing on the cake was not a buttercream. I know a buttercream icing from a disgusting icing. 🤢 🤢 🤢I am a cake person and I thought if they make the yummiest cake and they displayed it then the cake I ordered will be the bomb but instead I am soooooooioo dissatisfied and disappointed!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaDZEYi1nRRAB",
            "text": "I ordered jerk chicken and cabbage for lunch and the chicken tasted so dry and old. No flavor whatsoever, now I’m sad with nothing to eat. I hate wasting food and money but there is no way I can eat this :("
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNHAzZmNREAE",
            "text": "I recently ate here 2 times in 2 months, the food was average. I ordered brown stew fish, rice and peas with steamed veggies, 2 drinks and a slice of carrot cake. The rice was plain, there was no real flavor, it was just rice. The fish itself was pretty good but the sauce was not good, it tasted like veggies cooked down in ketchup and water. The steamed cabbage was sour as if it was old, it was not consistent, there were large tough pieces that were inedible. The food seem to be prepared in a rush. The carrot cake was dry, again it seemed old as well. The soda the lady gave was hot, she knew what she gave me because it was separate from the others, it was flat and hot I feel like that was deliberate. I will say, the customer service is very good (except for the lady that served me, she seemed nice but obviously what she gave me proved otherwise). The cashier was extremely sweet, professional, and nice. Other employees on my previous visit were extremely nice as well. The food on my prior visit was pretty good resulting in my return visit yet this last visit was quite disappointing and I don’t know if I’ll return, perhaps it was an off day but I expected much more from this restaurant. I did not enjoy my meal, especially after spending over $30 dollars and picking up myself ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKa29Ia3hRRRAB",
            "text": "I’m a regular customer here before but this is the worst I’ve seen my food as if it’s a splash and dash with pure bones after I ordered oxtail."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuLWEtSUlBEAE",
            "text": "If you feel in the mood to be back in the islands this place is the one to visit. Their soups are absolutely amazing, the fried dumplings are wonderful and the meals are extremely tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMWVEQWdRRRAB",
            "text": "The staff is very friendly and helpful. The food taste great and there is always plenty of varieties. My go-to is......well I don't want it to run out so I'll keep that to myself lol."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNVBTQWNnEAE",
            "text": "If you're a fan of Caribbean cuisine, then the best jerk chicken, rice, and oxtail I've ever tasted definitely deserves a mention. The jerk chicken is perfectly seasoned and grilled to juicy perfection, with a delightful blend of spicy and smoky flavors that tantalize the taste buds. Paired with a generous serving of fragrant and fluffy rice, each bite is a hearty and satisfying experience. But the star of the show is the oxtail - tender, succulent, and slow-cooked to melt-in-your-mouth perfection. The rich and savory flavors of the oxtail stew are simply irresistible. Together, this trio of jerk chicken, rice, and oxtail creates a harmonious symphony of flavors that transports you straight to the vibrant streets of the Caribbean."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydG9mdkxnEAE",
            "text": "Nice place to have a quick dinner if it's late so hey 5 star and the customer service is wonderful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuemEza1R3EAE",
            "text": "Place looked like a set for a 90's movie.\nThe fries and chicken nuggets were delicious and unique but the texture of the nuggets remind me of nuggets you can get from a store and heat them up in a microwave"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIajYtT2dnRRAB",
            "text": "Asked for oxtail gravy over rice and peas and got some awfully nasty tasting stuff. Killed my appetite. What the hell. I'm Jamaican I know what oxtail taste like."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2N19TU0tREAE",
            "text": "The food is good for the most part. They have a large variety of selections to choose from. The rice options could be better in regards to the texture, it's too soft for my liking but that's just my personal preference. Customer service is a hit or miss, some servers are friendly but some of the cashiers can be slightly rude/aggressive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eHZXSnhnRRAB",
            "text": "So to be transparent, I went there at night like after 8pm. I was looking for a beef patty but all was gone.. so I settled for a coco bread ( ended up getting 4 after the first bite).. but when I tell you that that was THE BEST melt in your mouth warm to the touch soft like heaven coco bread ever!  No patty needed.. it was in a class all by it self.. then the guy was sooo lovely..Service and hospitality  executed with warmth and pried of the islands he hails from.. I mean he made my night..so much that I gave in to my temptation to all the goodies presented in the show case and got a slice of their pineapple cake...that was another trip to paradise when me and my partner had it later on.  The frosting was fluffy not to sweet and just delightful.  When you get to the cake.. I felt like I was back in my form 2 (8th grade) HomeEcc class and was sampling a well done butter cake crusted but not burnt and not oily either.  The pineapple was not only present in flavor but texture as well in the filling from the first bite and the the last crumb.  So for me this place even tho I only had two items off the many well presented options from the Bakery and Restaurant.. it was more than enough to continue to patronize but also Highly recommend.  GO! visit them, and find your treasure from their menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOWNMblF3EAE",
            "text": "Typical NY hole in the wall restaurant with excellent breakfast. The fish dishes were excellent. The ackey and saltfish with boiled food or fried dumplings were on point. Thank you, Port Royal, you saved a bunch of people on a sad weekend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1Nl9hUnJ3RRAB",
            "text": "I normally eat here all the time the food is good. In recent times they've been raising the prices too high. Customer service sucks I had a woman who argued with me over the fact that she didn't understand what I was saying. I speak English and I am a native English speaker. I said I wanted jerk chicken she gave me stew chicken and she argued back-and-forth with me telling me. I don't understand English or know what I want. I'm not coming back here again you just lost a loyal customer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcE1DTlF3EAE",
            "text": "I used to frequent this place alot since i lived about two blocks away. However; couple months ago got really sick when I ate the spinach rice, oxtail and macaroni salad. Now I only go there for the soup occasionally. Customer service sucks most of the time, especially from the women!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1eTYya3pnRRAB",
            "text": "., 4/11/24,,absolutely disgusting oxtail with lots of fat and hard old oxtail, $20 in the garbage."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCNXRpZE13EAE",
            "text": "There is nothing enjoyable about the food served at this restaurant. In addition to being overpriced, the food tasted terrible and was nasty. I was not impressed with the service and the employees were not friendly, nor were they willing to change the order to make it right. The restaurant isn't suitable for those seeking delicious Jamaican food. There are plenty of other tasty local Jamaican options available. By avoiding this place, you'll save your health, money, and time. You won't regret it."
        }
    ],
    "reviews_count": 49
}