{
    "name": "Yogi’s Restaurant",
    "place_id": "ChIJ2_sR4yhhwokRFUVrHW1Ayfo",
    "grid": "QN12",
    "address": "92, 40 unit c, 92-40 Guy R Brewer Blvd, Jamaica, NY 11433, USA",
    "rating": 4.2,
    "user_ratings_total": 423,
    "phone_number": "(718) 206-1890",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scVpGUjFSamN6WVdadFJXdDBObUZ5YzBWaE1XYxAB",
            "text": "The brown stew chicken was AMAZING! I never had brown stew chicken that was cooked to such perfection. The owner was super friendly too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMVEybFhha2xLTW1GamFXUnpZMHRzTmxoSGJtYxAB",
            "text": "The flavors were outstanding."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUlNWVnpTVUl5YldONWNIZE5ja3M1UmtOeWJsRRAB",
            "text": "The salt fish and okra with rice and peas  was dry had no flavor, no salt, no pepper tasted like hospital food. I even put hot sauce and it didn’t taste any better. Really awful I ordered on grub hub and it was terrible. The lady in the phone was nice though."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKV1lXNVpWV1I1U2sxd2VFbzJWek5UZG10eVIxRRAB",
            "text": "Food was terrible nasty I asked for a small and he lied about the prices 😒  I feel robbed and cheated some of the worst food ever 😤 never ever again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRFdrbGhTVFZaVTNwSk4xOVFNbmd3ZWtSbFNuYxAB",
            "text": "Food is delicious"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQlQwTlZiWFk1WlRaSmFXMVVaR2x3ZVRkeVVHYxAB",
            "text": "I must say the jerk chicken taste good as well as the sweet chicken. But the portion size for the for the lunch isn’t worth the price. I actually went twice and paid two different prices but didn’t get a slushy so I feel they got me. Suppose to be $5.50+ tax and I paid $6+ then 2nd time I paid $7+. Tax isn’t more than 9cent on a $1 and I paid cash."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdVE2ckQza0pyOGhnRRAB",
            "text": "Good one"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOHBpN0hnEAE",
            "text": "Its a small, warm place to sit down and eat. The food is well seasoned, decently portioned, and tastes pretty great.\n\nI got some mac n cheese, a little bit of kidneys, 1 chicken patty and 1 cheese beef patty.\n\nAll were pretty good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMU8zYjJBRRAB",
            "text": "A very short light skin young man told me a paying customer that $30 isn't money. I found him unfit to be serving customers with no customer service skills. I'm sure other restaurants would have appreciated my $30 if I had gone somewhere else. He's very ungrateful he should be thanking me for my support to Yogi's Restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaG9XbFp3EAE",
            "text": "Patty was so well seasoned and delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucjVtdDF3RRAB",
            "text": "Absolutely love the chicken patty 😋🤤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIa3ZDckRBEAE",
            "text": "The service was great! Unfortunately the food not so much. It wasn't a lot of food for the price you pay and the food itself wasn't as flavorful as you would expect for Caribbean food to be. Still a good spot for when you're hungry!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3a3VMRHdBRRAB",
            "text": "Disappointed with the roti skin. Small, not fresh literally thought it was frozen when she gave it to. All for $5.20 which expensive for what is. Y'all got my money this time but never again. I'm willing to travel further for better quality.\n\nEdit to add that this was probably one of the worst roti skins I've had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb0otbUtBEAE",
            "text": "My first time today.\nI enjoyed my meal, the customer service was excellent.  Even if the food  wasn't good,  I would still  go back. I felt  like I was at home, I saw the pictures of Jamaican entertainers I was quite amazed.  The ladies were friendly.  Big up.  Nuff love, more blessings.  Had jerk fried rice with oxtail gravy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6enVTUFNnEAE",
            "text": "The name has changed to Fortis but it's still in the family I enjoy going there"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkcm9TaDNnRRAB",
            "text": "Lady with glasses had a nasty attitude. Won’t be coming back here ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0X2FtVnVRRRAB",
            "text": "Went here for breakfast but disappointed with selection. Had the salmon chunks with bananas and potatoes. I guess it’s an acquired taste to enjoy this food. I always try different cuisines but regretted my selection.\nSalmon was dry and those bananas lacked any taste. Lady serving the food was very nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROa19UVWN3EAE",
            "text": "Those 5 dollar minis come in handy when you financial challenge. And it's a nice portions. Great Food."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcllMVzh3RRAB",
            "text": "Friendly staff with great food.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOdUxpTVZBEAE",
            "text": "Walked in to get curry chicken and rice and peas these people are surviving spoiled rice I kindly walked out she knew the rice was no go but was still surviving it to people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWOTY2Y0JREAE",
            "text": "Everytime I try to order from this place they are so slow. I mean painfully slow. Parking is hard there so you need to double park. You would think employees would be more fast. People come there because we are hungry. Why are yall so slow?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURseGZYc1p3EAE",
            "text": "Best Jamaican food ever … jerk chicken 😋\nEvery dish is 😋🤤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsb3RDYlRREAE",
            "text": "The Food At Yogi's Was Priceless And So Was The Service 💯"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcTZUb2FnEAE",
            "text": "Great food, perfectly seasoned and still warm. The staff were friendly and accommodating."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1ZzVucDJBRRAB",
            "text": "I love the food here. 🩷"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1NGQ3bTNnRRAB",
            "text": "The food was well prepared. I bought breakfast for my team at work, and they all expressed that the food was just right. Not too oily and not salty. Thanks, Yanique."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1eW9YLWR3EAE",
            "text": "I Brought calaloo n saltfish .Two spoons of calaloo and the rest was peppers .One spoon of saltfish. Tasted ok but they gotta do better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1OHFHbzVnRRAB",
            "text": "Nice yummy food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaenZXb1B3EAE",
            "text": "worst experience"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKb2FuYll3EAE",
            "text": "Good place,good food...bad location. You mistake it for a hair salon so,look hard."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKM3FQUkt3EAE",
            "text": "Ordered on DoorDash then they texted “no oxtail today” why would you let me order something you don’t have? Now they won’t cancel the order and if I cancel I won’t get a refund. How is this fair?"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaWVDVWVnEAE",
            "text": "Horrible food. Place needs a serious renovation. Food is Dry tasteless and expensive as far as I’m concerned. The rice is very dry… salmon dry…macaroni and cheese dry and could possibly bby from the box WHO knows… It wasn’t cheesy at all,  just a bunch of noodles stuck together by a little bit of cheese plopped on top! On Father’s Day which was roughly 3-4 weeks ago, my friend got a small food and it cost $13. Prices are not posted. They are crossed out so it’s a guessing game!Today,  me being greedy and nuff as I have never ate here before, got the same exact food/size as my friend did a few weeks ago and it cost $3 more. I guess there must be preferential treatment here as the cashier was also very inpatient and snooty I guess because I am not a man. The entire experience was horrible and I will never return."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dy0zRHZBRRAB",
            "text": "Excellent customer service. Over 7 years i am eating here. Delicious food and great price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4X29pWDhRRRAB",
            "text": "Love the food Asome👁️👁️\nWill always buy.\nAnd thank you🙏\nKnowing HOW TO COOK, BURN, THROW DOWN AS THEY SAY Putting your best foot in it 🤍🤍🤍🤍🤩"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cnNDaWV3EAE",
            "text": "Went here for breakfast this morning the lady was very respectful 🥰 food was delicious 🫶🏾 and they was open at 9 am !! I’m goin back for dinner ❤️😂…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeWRfOFNREAE",
            "text": "The food is straight garbage. It’s always old and stale and completely tasteless. They can’t even heat it up for you. The people dem rude nor rass, completely inattentive and really doesn’t care about quality. Not worth your money, there are plenty of other places to go where the food is actually enjoyable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScGNYeXlnRRAB",
            "text": "Depending on the server portions vary. They refuse to get menu or show price of food why? Furthermore staff Attitude can be funky especially the cashier. The last time I ate here my stomach disagreed with the food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtZ3ItTnpnRRAB",
            "text": "Consistency here is amazing. The service from the lil spanish lady AMAZING! The other lady cashier is always so polite. Yogi I love what your doing here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtd3VldWJBEAE",
            "text": "Nice customer service, I feel welcome"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtaE5qVndBRRAB",
            "text": "Muy buen lugar y buena atención. Sevunda ves que voy y e salido muy bien servido. Gracias."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNS1yYmhnRRAB",
            "text": "Love this restaurant. Family owned and operated. Love the variety of great tasting food and the service. Staff always have a smile. I go every chance I get."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReDRLTFVnEAE",
            "text": "Everything I ordered was fresh and delicious. I plan to order from here regularly, delivery was on time and everything. Great job guys keep up the good work...\nJerk chicken has to be some of the best I've had in the five boroughs, oxtail was a nice healthy serving and the curry chicken was AUTHENTIC yard food."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJMmNmX3p3RRAB",
            "text": "The food is good but the owner must not allow 108 or 109 guy Brewer jobless guys to come and hang out in the restaurant to pick  fight with the customers. i am a client of that place but i am not going back there due to 1-11-2019 incident…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2Mzhqcm1BRRAB",
            "text": "This place is a miracle. My partner and I slogged in after a long day of bad luck and shaken nerves, half dead. We went up to the buffet - the guy behind the counter was very patient and kind to us despite the fact that we were brainfoggy and had next to no idea what we were ordering - and we ordered the crispy salmon, the jerk chicken, the baked mac'n cheese and the rasta pasta with a lemon-lime slushie. Plantains, too, crispy and just hot enough. It was possibly the best thing I've ever tasted, and we walked out of the place feeling transformed. Very large, filling portions, served hot and ready immediately, and the whole thing was less than 25 bucks for the two of us. If we hadn't been famished, there probably would have been leftovers (and it came in good containers to walk out with, too.) If you haven't tried this place, what are you waiting for? Go!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MHVtYjNRRRAB",
            "text": "My husband found this place, right in the neighborhood. He bought me the chicken soup. The soup was so good I had some again the next day. Very hearty and seasoned so well. It also had dumplings and potatoes in it. Delicious!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwMnNUWUdBEAE",
            "text": "I am upset that I didn't know this place was in my own neighborhood! And a family business for years.\nYogi's Rules! You will definitely visit a second time! Home-cooked Jamaican food with out-of-this world fish and shrimp! You'll NEVER go wrong hear brethren!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReTd1aENBEAE",
            "text": "3 years ago....Food is okay, but too expensive. Servers are not too friendly. 3 stars\nUpdate....Jerk chicken plate was dry, taste like barbeque chicken. Rice and peas was bland without any \"peas\". Jerk wings were really good. I spent"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDdk4ycDZBRRAB",
            "text": "Great hostess! #TheQueen is always ready to serve you with kind heart, fair prices, and good food.  Must Ubereats or grubhub your food.  #Highdemandflavor and a #Lifesaver during this pandemic for working ppl who have no time to cook at home."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMWZuaWZ3EAE",
            "text": "Exquisite Jamaican food. Friendly staff and boss is a true general. My aunt left her purse in the restaurant by accident and the server ran all the way down the block to ensure that it was returned. Good people and good food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURFeHVhZ1pnEAE",
            "text": "If you haven’t bought food from here as yet, please don’t I promise you when I say you are not missing a thing. Smh.. anyways on with my review.\n\n👎👎👎👎👎👎\n\nIf I could give -10 stars I would. I literally just bought a mini ackee and salt fish and for one the price is ridiculous but whatever.\n\nThis things has no freaking flavor. Salt fish is fresh ackee is all mashed out and the things seriously has no flavor at all. It’s Atrocious. And this is not the first time but this time did it for me with their food.."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5MjczSlJREAE",
            "text": "I tried the oxtail lunch with rice and peas and Rasta pasta. Everything was delicious. Oxtail falling off the bone. And the portion was huge for a small. Will definitely order again."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRenIzcEZREAE",
            "text": "This restaurant is okay. I like there cheesy beef patties. But recently there food hasn't been the same. I had ordered a small oxtail dinner for $14 ,and the oxtails were undercooked, very tuff to eat and some vegetables that were very bland no seasoning at all . They have fallen off in the oxtail dinner department big time."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjOVB2LVZnEAE",
            "text": "Love love love their food! One of the best caribbean spots in Queens! My favorite is the sweet chilli shrimp, baked mac, and plantains.  Very affordable and the staff are very sweet and work hard. Worth the every penny 😊…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNN2Fmc0VnEAE",
            "text": "The experience is really good. The service was one of the best. Food was also very good. Ambience is awesome. Dessert was very good as well. Good drinks menu. Will definitely come back again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTNHYzMENBEAE",
            "text": "Just ordered Ackee and Saltfish from here and it’s very watery and tastes really bad !! I’ve eaten Ackee from several places and wanted to try this place out... HORRIBLE AND DISGUSTING... seasoning is off just doesn’t taste right I threw…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneUtpeDVBRRAB",
            "text": "Everyone smokes and it's usually crowded but the vibes are good, drinks good.. good looking women and great music. Yogi also has food. Didn't like the bathroom or lack of air circulation"
        }
    ],
    "reviews_count": 56
}