{
    "name": "O Lavrador",
    "place_id": "ChIJk6-kys1gwokRkAcfjddGyRk",
    "grid": "QN12",
    "address": "138-40 101st Ave, Jamaica, NY 11435, USA",
    "rating": 4.5,
    "user_ratings_total": 1550,
    "phone_number": "(718) 526-1526",
    "reviews": [
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnM2RrRjNMV2RMZUdNelREZzFZMG90V0dWUU1XYxAB",
            "text": "The food was so good. Most people don't speak english, so that was weird. But i was able to order food and the menu was in english. I would go back again, it was really good food!!!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eGVsSkNNREJVTkUxcUxXaGxUR2xxWjNGdmIwRRAB",
            "text": "O’Lavrador is the best! It’s a local restaurant that has been in business for a good 4 decades or more that caters to locals and travelers coming from the airport.\nTheir food is delicious! The staff is great too. Always a nice treat whenever we celebrate a special occasion or birthday. Thank you, O’Lavrador, for making each celebration special :)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NdFZTMTBiVU5SZEVGNmJpMUJSakZMY25Gb1ZWRRAB",
            "text": "That waas fantastic"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRLXZiQzlnRRAB",
            "text": "I've eaten here many times but this is the second time that I've come in the last year and the food was horrible!  I came again because in the past, the food was very tasty and well seasoned. However, again their clams were sandy and the food was bland! I thought I'd give it another chance. My guests were very upset and one even had to have their selection changed. They must have changed chefs! The good thing is that the staff is very attentive and professional."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcFoxRTJWbU16UTJoVWEydDBRMlZPUVdSdmNVRRAB",
            "text": "I'm completely taken with this entire establishment. I decided to try this restaurant after reading reviews. Their service sets this place apart. The culinary direction shows courage and flavor awareness. This restaurant avoided service problems."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwR05YUjVWa0U1UTJ0VVoyc3hVMDh5WDNkblUwRRAB",
            "text": "If you want authentic Portuguese food, this is the place!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KR2FsQXhlV1pUZFhCWmVrbG9UbkZCUzNoRmVWRRAB",
            "text": "I almost hate to give 5 stars cause I want to keep this place a secret! Their cuisine failed to stand out. The cost makes sense for the good food. The entire team at O Lavrador is customer-focused. I'm excited about their other food offerings."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padGFFZEtPRmhXVVhWcU5HSldRMkV6UkZST1ZFRRAB",
            "text": "Great experience! Friendly staff and a very cozy vibe."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUk1VRlNOVWc0VTJocVJrMWFNWEZJVVd0Sk5rRRAB",
            "text": "Dinner for 2 (3 if you count our baby). One of the best meals we had in a long time. Atmosphere was warm and inviting. Food was 10/10. There wasn’t anything we ordered that we did not love. Service was excellent. Our waiter Khi catered to our every need. I’m not lying when I say we would make this place our regular and try everything on the menu."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdWFtbEVWakZWVERVMmVWSTJhVkpCU1VkcU5YYxAB",
            "text": "Very pleasant person 😊"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KR1dqZHdaekkyVTNKeGJqZFRja0pvYUhSVWIyYxAB",
            "text": "Stepping into O Lavrador for a traditional Portugues meal is as close as you can get to time traveling in Jamaica Queens.  Firstly there's onsite parking in an isolated lot connected to the restaurant. Once you enter the restaurant you experience the warmth, culture, and heritage of old world Portugal . From the old works artwork, to furniture,  to comfortable atmosphere, everything about O Lavrador screams a great time.  Authentic Portugues cuisine, grilled meats, fresh flavorful seafood,  and a seperate bar on the offer side of the wall. What more can you ask for."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRmRIRk9PWE5YT0hnMGJIRTJPV3gxWm1ocFpWRRAB",
            "text": "Lamb chop was okay, too much sauce though, steaks were too blend, Branzino was okay."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhaW9YZXhRRRAB",
            "text": "As a patron of over 20+ years always a decent experience. Check out the bar menu if you are only a bit peckish."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObmJYSlJYMjVpUW5CcllWRjFNMjF2ZUZoemVIYxAB",
            "text": "We had really great fish dishes. I had an IPA, my son had a sangria, both were good. The dining room is a bigger hall type, not my favorite, but overall good experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oa1JXdG1OeTB3YmxKS05rcHNiMWxWTTNsNlFXYxAB",
            "text": "The food here consistently exceeds what you might expect. The restaurant crew provided extraordinary assistance. The inside space avoided darkness completely. I've ordered different plates and enjoyed each one. Every offering demonstrates quality preparation."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5b2FFaERlRU5PZGpSTk0yTkpSMUl5WkVwc1FXYxAB",
            "text": "We tried O Lavrador for our Friday night food hunt, drawn in by the 4.5-star rating and over 1.5k reviews. The restaurant is huge, with a lively bar and a more formal dining section. We ended up at a high-top table, which was a nice alternative to the loud group nearby. We tried the Lagosta fra Diablo, an Iberian Platter, fries, a spicy margarita, and a beer.\nWhile the food was okay, it didn't quite hit the mark for what I'd consider authentic Portuguese cuisine. Unfortunately, I had an upset stomach the next morning. However, the space is great—huge with plenty of parking. It seems like a fantastic spot for a lively night out with drinks, even if the food wasn't quite for me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aE5qWnpkemhpU2kxWVFXeG1ZWEJSTjB4MWQyYxAB",
            "text": "Nice food a personal very complacent 👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eldVTk5UMkY2V2trMk5WTnhjV2h4Tkdad05uYxAB",
            "text": "Exceptional service. Cozy ambiance, amazing cooking, and attentive team members! The food is wonderful and staff is helpful. My meal satisfied my taste expectations. All aspects work perfectly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTldtUTNUMWRwYTBoRVNWVlphVWhPV1c5VVJWRRAB",
            "text": "Came here for an early dinner before driving back to CT during rush hour. Food was delicious, service great and staff was very friendly. Convenient parking and prompt service. We would definitely return!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNROGVERWpRRRAB",
            "text": "Just Remember Folks. There is not such a thing as bad publicity (marketing) there is only publicity (marketing) good or bad. The goal is to keep people talking about you. Saludos a Banana king 🍌 🤴 and Evil Witch 🧙‍♀️  hahahhaha"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocVMwSlpjV1JTVDBKMlUxaFNjV0U1Y1dGb2RGRRAB",
            "text": "Great food great service by Cesar awesome quality restaurant\nThe owners son and daughter are the gem in this restaurant due to the attention they give to the customers...congrats"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGd2REbG1jMmhTVlhnd2FtOVlXbWh4Tm5nMVVXYxAB",
            "text": "The food and service were good."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNteWZPdmNREAE",
            "text": "Delicious food and friendly staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbmFGRk1aRUZwZW5vdFVXcFJiMngzU1V0RlFuYxAB",
            "text": "I've been coming here for 20 plus years\n\nFood is good, Service is good it's an old tavern looking place, the dining hall is nice.\n\nLove their big appetizer platter and their sole a la delicia.  Their calod Verde is very good, and their cod fish croquettes are delicious if they can get them crispy"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoaWVrVldaekpMTkVWSVUzcGtNbVExVWtGcU9WRRAB",
            "text": "Delicious and authentic Portuguese food - and Super Bock on tape"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSGEwMWthVzAzWWpremMyOTVTMWg1WVc5RlRtYxAB",
            "text": "Staff was polite and efficient. No long waits."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdGFiLXhRRRAB",
            "text": "This place is great. Great service, food and place looks good. Also has small customers parking lot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNN2hwS0NxbnNlRHh3RRAB",
            "text": "I came here on a whim and got the seafood soup for lunch. Delicious. They were just opening but staff was still nice. Would come again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNYkNydDdZek9uSzBRRRAB",
            "text": "Looking forward to visiting this restaurant in person! After making an order on GrubHub, I was so impressed with my food. I felt compelled to call the restaurant and let them know that the Chef actually made my night! I grew up in a small town in Massachusetts that is famous for its authentic Portuguese food and living in New York now I haven’t really been able to find a reliable Portuguese restaurant. I’ve been craving the perfect steak for so long and this place delivered! Not to mention, the portion was insane and I’ll have enough to enjoy it for lunch tomorrow too. An immediate favorite. 🤩"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOcjVoTHkzLWRxZVdBEAE",
            "text": "Amazing experience!\nThe food was great!\nService was also amazing 👏\nMore than experience 👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJMm56TXlfdjZmTTF3RRAB",
            "text": "The food was decent, but the service was exceptional. The servers were incredibly attentive and friendly, creating a pleasant atmosphere. It’s a great place to spend quality time with family, engaging in meaningful conversations without being overly concerned about the food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPLWgtY3V5Z2Nib0ZBEAE",
            "text": "Been coming here for a long time. They never disappoint. Warning, they get super busy and packed on special occasions, like mothers day. I usually order the same entrees and it's always delicious. Great place for a date."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ2RydmtnRRAB",
            "text": "Excellent service and fresh unique flavors. Very reasonable priced and the staff were very knowledgeable and family friendly.\n\nLann Rubin II\nFounder\nNorth East Ford, Millerton NY\nNorth East Service Center, Milton NY"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNTVMQ0J3EAE",
            "text": "Warm, inviting atmosphere with flavorful Portuguese dishes and generous portions. Service was a little slow during peak hours."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcTR1ZWVBEAE",
            "text": "Went in on a Thursday night the week before Christmas. We walked from staying close by and I didn’t really see any parking so not sure how that would go. The vibe once you walk in transports you to quintessential 80s European themed restaurant. Painted murals, dark wood, fake plants. It’s fantastic nostalgia. The menu is huge and sort of overwhelming. So just trust me when I say order the verde. We ordered the tasting platter and it was awesome but considering the serving sizing here, we didn’t need an appetizer at all. In fact the small servings of the mains could have been enough to share between two. This is how seafood, lobster is supposed to be cooked and served.\nIt was expensive. An appetizer for 2, a main each and 2 drinks was $170 with tip and tax. But it was an experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3M1ozYmZ3EAE",
            "text": "This restaurant has 2 parts... a formal dinner area & the bar with a less formal dining area. I've been in the bar area several times. Has a sport's bar football club theme, but not overpowering in decor. It feels like a neighborhood spot that anyone can feel comfortable in. Lots of TV screens. Atmosphere is fun & relaxed. The bartenders are so inviting. One time I went, they had a promotor... free shot of Tequila! Went down quite nice! You will have a great time either going by yourself or with friends. Everything I've eaten was quite yummy. A touch of Portugal 🇵🇹"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX1BDNWl3RRAB",
            "text": "A first with Portuguese food. The sampler to share is enough for 3, a mix variety of seafood, meat and a little of vegetables. Steak is up to expectation,  done medium, tender when you take a first bite. The pork/potatoes is very different from Spanish cooking, superb. At the time of our dinner, it's pretty late, the kitchen closes earlier on a Thursday, between 9:30-10.\nTry for yourself and get the taste, you won't regret it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdG9DemtnRRAB",
            "text": "Last minute call for reservations on valentines day for party of three and was well accommodated surprisingly. Food was delicious 😋,  staff was welcoming and friendly. Especially Eddie he recommended one of his specialty cocktail 🍸 that should be put on the menu💚. The peach Sangria and salmon was really good. Highly recommended will visit again.💚💚💚"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRam9fUVRnEAE",
            "text": "This place is one of my favorite spots to just relax and take a break from the world. The atmosphere is calming, making it the perfect setting to sit, talk, or just enjoy some quiet time. The food is always amazing, and their iced coffee—my absolute favorite—is the best I’ve had. Whether you’re catching up with a friend or just looking for a peaceful place to recharge, this spot never disappoints. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeXR5bHBRRRAB",
            "text": "O atendimento é muito bom, eu fiquei muito satisfeita. Eu achei que a comida podia ter um pouco mais de tempero, mas estava gostoso. A sobremesa tiramisu estava uma delícia 😋. Super recomendo."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxOW91VjhRRRAB",
            "text": "Drinks are sweet, but our waitress hooked us up by making them a little stronger for us. Very familial and European country side feeling inside. Don't remember the names of the dishes, but you won't regret them, except for the grilled octopus 🤢"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeHRLLXFnRRAB",
            "text": "Average food quality. The chicken was really dry and you would have needed a drink to help you to get it in. The appetizer platter was just ok. A mix of seafood and sausage served with a tomato based dressing and some days-old lettuce garnish. Could have been much better. The staff were very helpful and kind though."
        },
        {
            "date": "6달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcGEyYjRBRRAB",
            "text": "A comida estava boa, mas um pouco sem tempero, mas como eu nunca tinha comido comida portuguesa, então talvez é assim mesmo. O atendimento foi excelente, muito educados."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeHJHUUJBEAE",
            "text": "Oh. My. Gosh. What a phenomenal experience I had here! So I came to NY to visit family and I was looking for a good restaurant in Queens, something that stood out in its own little unique way. When I say everything I had was good I mean it and I have serious standards especially when it comes to seafood. My dad and I ended up getting the grilled octopus, steamed clams, and the paella margarita (I spelt that wrong but you get the point). Each dish was in SOLID proportion and was just amazing in flavour - so many explosions. My wait team (because they really be teaming up and theyre efficient) was so awesome, they dealt with my group of five so well. They got my uncle and myself gorgeous birthday cakes, and I honestly couldn’t have asked more of the restaurant I was so happy if I could give a higher rating I would. Oh and the drinks are mod in MY opinion because I tasted minimum two shots in my mojito and it was made to my liking - just sour no sugar. No complaints, great work team!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyd3E3eGZ3EAE",
            "text": "This has been our date night go to for many years. Now it has become our Mother’s Day spot for the last 2 years.  We have never had anything here that was not good. The food is amazing.  The staff is the best of the best. Friendly, attentive and they are good for the best advice about the menu and specials."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1c2JPV3d3RRAB",
            "text": "Great dinner tonight…Very delicious whole fish! Actually the best fish I had this year. The potatoes came with it was also perfectly cooked. The paella was big size and had a lot of seafood in it. And the dessert flan was super delicious - not too sweet, but very tasty, just perfect for after lots of food!\n\nService was great - friendly waiters and waitress provided attentive service. Clean white table cloth. Great wine from Portugal. And the price of everything was very affordable.\n\nI have recommended this restaurant to the hotel I’m staying at, and I will definitely go to this restaurant again next time when I visit New York."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dEo2OGtBRRAB",
            "text": "O Lavrador is a unique Portuguese restaurant housed in a European-style hacienda with brick arches and an elegant dining room. Family-run for 43 years you must make this your destination for excellent Portuguese and Spanish food, fabulous wines and great service and the prices are very reasonable!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaDh6a0x3EAE",
            "text": "Excellent food and service.  Great Portages wine.\nWe called around 9:15 and they were so great to take us.  One of the best food ever.  👌👌👌👌\nLoved everything.  Thank you 🙏 I just wished I lived closer 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNnNLSTNBRRAB",
            "text": "The food and atmosphere were amazing! I had the chicken cutlets with garlic sauce and it was delicious . The chocolate cake was one of the best desserts I ever had."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXeTdhelp3EAE",
            "text": "Family styled atmosphere! Very noisy but not annoying, feels like a large family gathering. Staff is always smiling and gracious! Makes for a comfortable, relaxed environment. Drinks were really good and the food was delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxX192OWl3RRAB",
            "text": "Loverador offers a delightful culinary experience with a perfect blend of flavors. The calamari rings are a standout, crispy and tender. The rice with mixed seafood is a symphony of tastes, showcasing fresh ingredients. The ambiance complements the dining experience, making Loverador a must-visit for seafood enthusiasts."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzOU1ta0RREAE",
            "text": "I really enjoyed my experience here. My family and I had a really nice time. The food was delicious (best paella I've had), drinks were great, but not strong enough...service was pretty good too. I would definitely return!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3a2ItaE9REAE",
            "text": "Food was decent for the price of 151.50 but the overall experience was peaceful and nice.  The steak was undercooked as well and chips were soggy could have been better."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDeGJtdDJnRRAB",
            "text": "Since there are new eating restrictions, called ahead on a Saturday to find out if reservations were necessary and was told ‘no but there would be at least a 45 minutes wait.’ Arrived and the place was packed and really had to wait that long. There were no accommodations for that, so everyone just loitered in the parking lot waiting to be tabled. That’s the only negative here (which is understandable considering the ‘new normal’).\nOther than that, the food was excellent (huge selection!) and the waiter was just the same. Good enough music and adhered to the distancing regulations. Very pricey but it’s NY. Would return, would recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNUliVml3RRAB",
            "text": "Disgusting 🤢 I ordered a burger it was not fresh! The burger patty was one of those premade frozen circle burger patties that you buy in Costco! It was not fresh. It was disgusting. The lettuce was soggy and disgusting. I ordered from Uber eats!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzaklxNDB3RRAB",
            "text": "Was @ O Labrador for another fun filled dinner & they didn't disappoint. We also found our special table, hope I can seat there every time we visit. Waiter was super right off the bat.\nFor appetizer we got Grilled Octopus with garlic & olive oil. So yummy.\n\nMain entree was Paelha Marinheira for the lady, she looked every bit of it.\nFor me Parrilhada de  Mariscos, this comes with homemade chips. Got a side a veggies too. Was all delicious.\n\nDessert was Chocolate Mousse for the wifey, she got the same last time too, that's how good it is. I got Pudim Flan.\n\nThis restaurant is awesome, can't say it enough, great experience every time.\n\nThere is also a bar area with a separate entrance & private room too is interested."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCalBfTURnEAE",
            "text": "Ordered from O Labrador for the last time. As a customer for over 20 years I’ve been hoping that the flavor would come back! I grew up eating there and have fond memories of eating the chocolate mousse but after ordering a lobster fra Diablo will not go back again. The quantity of seafood/lobster was appropriate for the price but the taste was poor. Not overcooked but just bland. The pasta had no sauce on it and there was barely anything to mix it with.  Not worth the price.. You’re better off at Lenny’s.. How can an entree that is supposed to be spicy be spicy without any sauce? I hope the cook changes because I would love to support O Lavrador. Unfortunately the last couple times I’ve ordered have been horrible taste wise."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcFl1TlNnEAE",
            "text": "Great food! Great place and they have parking 😝"
        },
        {
            "date": "3년 전",
            "language": "ja",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOS1EdnR3RRAB",
            "text": "・2022年9月24日(土曜日)19時40分頃入店。\n\n・店の雰囲気、店員さんの感じは良かったです。\n\n・パンとバターは無料でした。\n\n・【collard green soup】思っていたのと違ってた。\n\n・【camarao piri-piri】中華のエビチリみたい。エビがプリプリでタレが美味しい。\n\n・【paelha marinheira】（for 1）パエリアというよりリゾット。サフランと魚介の出汁がそこまで利いておらずトマトケチャップっぽい味付けでした。"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleElIV05nEAE",
            "text": "My boys love their skirt steak and fries. I decided to try something new. I got the cod fish cakes, very tasty. Also it was cold I decided on soup. The seafood bisque is rich, hearty and flavorful. All the staff are friendly and very helpful with questions. Don't forget to order the Sangria! This is one of my family's favorite restaurants."
        }
    ],
    "reviews_count": 60
}