{
    "name": "Ernie’s The French Bakery and Deli",
    "place_id": "ChIJe4toJWBbyoARSP3T5c-sofU",
    "grid": "SI1",
    "address": "2654 Red Cliffs Dr Suite B, St. George, UT 84790, USA",
    "rating": 4.8,
    "user_ratings_total": 447,
    "phone_number": "(435) 627-6759",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvM1N6WjRRelpaZWpSRVJYQlNXRU5FYzJGNllWRRAB",
            "text": "The crepes were so yummy and the service was amazing! I will be back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneVZsQnJaMlZHU1VWSWFtdEhaV05vWTBaRFFVRRAB",
            "text": "Insanely good: the baguettes are perfection"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocWJFdGZkVlUwU1dkbFltUjFYME5vTW5SWWNHYxAB",
            "text": "Fantastic French bread, sandwiches and bakery! Get there early if you’re more interested in the yummy bakery fare, but I had a fantastic Jambon (ham) baguette with Gruyère cheese for lunch and I was transported to the American-loving side of Paris (impossible to find). Very congenial guys at the counter and in the kitchen."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGeFZsRnRObEJPTldWb01UUlhUWE5HYTFKcFkzYxAB",
            "text": "This unassuming bakery has quickly become a family favorite in St. George. Some other bakeries in the area may look more impressive, and those are legitimately awesome as well, but the quality of ingredients used makes Ernie's worth more than a few visits.\n\nThe baked goods are all very nice, but for our family, the Quiche Lorraine (the owner's family recipe) is a standout product.  We've started to buy a few of them one or two days in advance of hosting company and pop them in the oven before serving. Heated as such, these have been reviewed by our guests as \"the best quiches ever!\" The egg and cheese base is dense and complex, the ham is spectacular, and the crisp and flaky crust is somehow a highlight. <<< that's coming from someone who actually hates pie crusts!  Pro tip: if you're patient and dining in, they'll heat your order in the oven!\n\nThis place is no one hit wonder. After struggling to find a good independent deli in St. George, I am please to say that the sandwich at Ernie's finally delivered. Again, the quality is outstanding. The sliced bread is ridiculously fresh and the rest of the ingredients have been outstanding. Fresh basil leaves for the win!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeGRqbDRNRFJLUzBKWlJWZGFhRGQwVUd4b1IzYxAB",
            "text": "The pastries are amazing, and the owner is really nice. We had ham and cheese sandwiches and took home some pastries. Best we've ever had. Highly recommend! We'll be back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVlFXVXpiMDVzUTB0dFQyWkNUSG93TjJSNVNIYxAB",
            "text": "The madelines are so yummy!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaelIzWTFNbTlOY0dOdVFYSkRlbmxQWWtoWkxVRRAB",
            "text": "Really good service and their pastries are great..."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRFZWbGpWR2MzT1dScFJGUlpTVTVxVUhwSVpVRRAB",
            "text": "Great French bakery with delicious treats and great, fast service! A nice stop on our way back to the airport."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUFYxcG5XVVY2VWt4TWFXUkplVVJYYWpSelQwRRAB",
            "text": "A life changing turkey club. The ingredients were amazing, bacon crispy, but the bread.... also crispy and was hands down the best part. Can't wait to come back and eat another"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wYVNYVklXbEV4VkVONFJGRkpOSEE0VFhNd1YzYxAB",
            "text": "This place is incredibly delicious!!! 🤤 the hazelnut beignets are to die for!!! Literally the most delicious beignets I’ve ever had! Got the turkey club and it was also delicious! Loved the cute mini pickles with it! 🥰 and the chai latte was also really good!\n⭐️ ⭐️ ⭐️ ⭐️ ⭐️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWa1dIZHNTVjl1VERGcE1tZGliMEYwZUZFeGRYYxAB",
            "text": "A great simple little bakery.  We got breakfast sandwiches on croissants and french bread.  The bread was fantastic.  Very reasonable prices.  I recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcE1sUkVWakkwYzNoTU9FcGxlbGRqWlRoSFNFRRAB",
            "text": "Savory & good service!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrM1pYWTFkRnBLUW1SSVVWQnNiMlpSV205NlVXYxAB",
            "text": "Sitio tranquilo para tomar un café y comer un rico pastel o Sandwich. Local agradable y con muy buena presencia. Atención de primera y un camarero que habla inglés, francés y español. Poco más se puede pedir."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvd1ZraHJlRmw1VldObWMxRm9WbmRWYzNWWGExRRAB",
            "text": "El sitio muy recomendable para parar a comer algo. El personal muy agradable y muy atento. Habla español, francés y inglés."
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNk9UQkVla0k1ZVhOTVJ6UTFkbTkwT1hsTmJHYxAB",
            "text": "C’est un espace très confortable. Le propriétaire est français et parle espagnol. Si vous voulez avoir l’impression d’être en France, visitez cet endroit. Incroyablement incroyable !!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMUxVdEVNR0k1WTNGc1NITm9Tbm8yYjNsS2NFRRAB",
            "text": "Un lugar ideal para hacer una pausa en el camino. El personal muy amable, habla castellano, francés e inglés. Un 10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSFZYaGZVbmQwV0hkQmEydEVNSHAwVFhWMVVtYxAB",
            "text": "Absolutely wonderful experience.\nVery good food, and wonderful genuine service."
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSVkxTkRlRU5vYTFjeE9EaFFkRTAzUXpSbFYyYxAB",
            "text": "Super freundliche Mitarbeiter und fabelhaft  schmeckende Schokocroissant.\nDefinitiv zu empfehlen!"
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCd00xQkJkVFYwWjBOeVdsRnBTV3BQU0cxM2VrRRAB",
            "text": "Das Schoko-Croissant war eine 10/10.\nDie Verkäufer waren sehr freundlich und zuvorkommend. Alles in einem ein empfehlenswertes Café."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seE5UZHlOWEZ3U0VWdmFGQlhjSFZLUldKRVUwRRAB",
            "text": "Wonderful authentic French bakery - owned and ran by a lovely family. The sandwiches were delicious with great quality meat and cheese. We devoured them before taking a photo! The baked sweet goods looked tasty too. Highly recommend a stop off here - we were so glad we did on our way to Vegas from Zion."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podGNGRTJjbWxqVEhFMGNFa3plRlJZTkZOTVdsRRAB",
            "text": "Spectacular, authentic French bakery.  We’ve spent months traveling around France and always hit up the patisseries.  This gem is up with best of them.  The owner learned the craft from his mother who founded the legendary Ernie’s in Montana"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGa1pFUjFkMVpSVkhkbVUyTkNiakJwTjBKRmExRRAB",
            "text": "I visited here on a whim for breakfast with a friend two weeks ago, and came back the next day for lunch with my family, and have been back again to get items to-go. Nathan the owner, and his brother, do such a tremendous job both in quality of timeliness of the food and coffee, but also the level of service and atmosphere. He was so friendly and you can tell so proud of what him and his brother are doing, and they very well should be. It is small and quaint, and an excellent deli style dining experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oV1VVaGtia1ZwTFd4V2RUaDVZakZXVm1wNVQzYxAB",
            "text": "Really fantastic. Was just passing through and stopped for a sandwich, coffee, and pastry. Wasn’t expecting some of the best of all three I’ve had recently!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GR1NXZGpZMEZhTmtsTVl6VkdUbEI2VkU5eGJWRRAB",
            "text": "Very good people making VERY good food. I recommend their prosciutto panini!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abk1rcGxiWHBDYmpSWmNsaFZNbXQxT0hreFoyYxAB",
            "text": "Excellent bakery. Everything was so delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMlNucDVPVzVUVW05Vk9Va3RMVzVCVWpsV1VYYxAB",
            "text": "Best bakery in town hands town! Great service. Delicious and authentic. We will definitely be coming back."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV1EzTnNkbE52YVZGa1QxaHVaREJZTkdOUVRsRRAB",
            "text": "Vinimos con mis amigos de San Diego a comprar un café en este lugar y nos gustó mucho, sobre todo la cálida atención. Gracias! Thank you!"
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSUxWbDFka3R5UWs5MGJEbDJVRlpwVGtGQ1kzYxAB",
            "text": "Le gérant est vraiment super sympa, ça fait du bien de parler à un stéphanois au milieu de UTAH.\nAllez y les sandwichs sont bons."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJNWVIZGFTSEJKVkhoSk5UTmFaMFptUTI5bWJrRRAB",
            "text": "The quality of food was great! Came for breakfast had both the sweet and savory crepes, both were amazing. The selection of pastries seemed a little less but that could be because we were a little late in the morning. Overall a great experience give it a shot it was delicious!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRU1UbG5OSGwyUmxoTGIxRlBiMmN5ZVRaWGFtYxAB",
            "text": "Very friendly people and the best bread and sandwiches I've ever tried. 100% recommended."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcDdHdDVRRRAB",
            "text": "Always 5 star food and service. Always a must when we are in town!\n\nEdit: The pastries under new ownership are not the same, they don’t have the same things and are dry and bland. Beyond sad that everything changed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMU5uTkxUWE5EYm0xeFlteHBZVWxyYzNGRlJsRRAB",
            "text": "As soon as i walked in i got helped and i felt extremely welcomed. the man taking my order was kind and i really liked the place in itself. the food was amazing. definitely coming back 🙏"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNU1UZzRPRXRTYTNscmVtWklXbVZQUld4Q1FYYxAB",
            "text": "I almost didn’t post bc it’s so damn good and I want it all myself!!!…. but I want this local place to thrive! If you like pastries it’s a must go!!! You’re welcome in advance!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reFFXOVJSMmcxUzFCdlFYWnJSSEJDVjBNeFVYYxAB",
            "text": "The prosciutto Panini was amazing and so were the croissants"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNWNHbGZVRmsyYW5kMmVUbDBRM0ZrVjJOMVJWRRAB",
            "text": "Lovely little spot to get authentic French pastries in the SGU!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTE1rcFhMV3RYVEZGSU4wcDZla05vVFZSSWVVRRAB",
            "text": "A fantastic little bakery with great pastries and cozy atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRFlWaDRiRlJXWTBacVpVSkNORVpNVERac09FRRAB",
            "text": "Cinnamon roll is fantastic. Owner is very pleasant"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSWRsVnJVa3d6YkRCVVNrWnJZVUZuU0ZkVlYzYxAB",
            "text": "Ernie's french bakery & deli in Red Cliffs Square has the best food! All the Hot/Cold sandwiches are a hit. Tried most of the Pastries, each one has satisfied the sweet craving. Will be coming back to try them all. Run, because they are so tasty and sell out quick! I recommend the Veggie panini, apple tart, any crepe and chai latte. Definitely do take out so you can bring it on the go when you head out to the some of the beautiful spots in St George. Business is operated by the nicest and wholesome Brothers, great service and friendly. Great price, great hang out place and even better they are open on Sundays too! Don't sleep on this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKN2stOXlvMGZhMVRREAE",
            "text": "The flavor and texture of the baguette sandwich and the apple tart took me straight back to my memories of traveling in France 🇫🇷 - Delicious!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SU2EwaDBibGQ2WlZsMVYwUk5jREZtTXpSaVJYYxAB",
            "text": "I had the BLT and it was perfect. The bread was slightly crunchy and the 🥓 was perfectly crispy but not overcooked.\n\nI also tried the strawberry filled madeleine and the Kouign-amann which was wonderful.\n\nI highly recommend this bakery if you’re in the area.  The facilities were clean and the staff was polite."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oV1gwSndhMWg2V2s1WlRIUkdha3BwTkhaR2NFRRAB",
            "text": "This small French bakery is located off Red Cliffs Drive and only a short distance from the I15.  This modest café has a limited menu, of coffees, pastries and luncheon sandwiches.  The café has a small dining area of approximately five tables and several cushion chairs with no outside dining area.  We purchased numerous pastries and coffees and, while very delicious, were a bit on the expensive side.  However, we were on our way to Moab, and we always try to support local business in the areas we visit so in the end, it was worth the visit. Oh and yes, the staff member who took care of us was very polite and friendly and the café does have restrooms available for their customers with plenty of free parking in front of the café."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNS2dxUG5pLXJQUlZBEAE",
            "text": "This place is outstanding!! If you have thought about coming here, but haven't, you need to! The food is sooo delicious! Super friendly staff ♡ The savory crepes are delicious as well as all the pastries ♡♡♡ I will make this my personal bakery whenever I am in town! Highly recommend the chocolate torsade! It is divine! Their chai latte is my favorite so far but I need to keep coming back to try more! Got every flavor of Macaroons and they are perfection 👌🏻 soft and crispy but in the perfect combination for macaroons, ♡♡ I am in love!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbjlISm1RRRAB",
            "text": "This is a must visit bakery! We took our order to go as we were creating a smorgasbord of goodness to share. The eclairs were perfect. The creamy pudding like filling was a hit with the whole family. The danishes had flaky dough with perfectly balanced filling. The lemon meringue was wonderfully tart. The chocolate mousse items all had well balanced flavors & textures too. Kids and grown-ups alike were delighted with each treat. The owners were kind hearted, easy to chat with, and have poured so much love into every bite they share. Not to mention, it’s all made fresh, daily.  We will definitely be back next time we’re in town!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOXFHcV9BRRAB",
            "text": "I went in thinking it was the French bakery, but it has changed hands. Now it is Ernie’s French bakery and deli. I was really in the mood for a Croque Monsieur sandwich and at first I was bummed because I thought it would be gone.  They still had it on the menu and it is the tastiest thing I have ever put in my mouth!!! I also had beignets and cream cheese danish. To die for!!! The chef is French, the food is French it is all amazing! The lamination on the pasties is spot on and the beignets are better than Disneylands! You have to go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGaDhhc09BEAE",
            "text": "You HAVE to try this place!! The owner (Mitchell) and his wife are so incredibly sweet and kind-hearted!! James was so welcoming & helpful, too! I went in with the intentions of just trying a croissant or two. Walked out with some cheesecake, apple danish, Nutella crossant, French bread, amazing spaghetti and a French dip sandwich!🤪🍴Everything was sooo incredibly delicious!! Blown away! The pictures don’t do this place justice! It’s amazing that this bakery and all of their offerings are based off just a 3-person crew. Mitchell was so kind and took the time to explain everything when we had mentioned this was our first time in. This place is a great representation of the “old school, classic” small town family bakery. 🥖🥐"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dzl5cVd3EAE",
            "text": "The French Bakery came highly recommended by a friend, and it did not disappoint. We both indulged in the \"James Way\" Banh Mi Sandwich, boasting a delightful assortment of cucumbers, lettuce, ham, and Asiago cheese, which left us thoroughly satisfied. Opting for a to-go order, our dessert selection included a heavenly array of treats: crème brûlée, cheesecake, coconut macaroons, cannoli, triple chocolate mousse, and an intriguing Asiago, basil, and roasted red peppers quiche. Despite the bustling atmosphere with people coming and going, the service remained commendable, and the staff were notably friendly. Overall, it was a delightful experience, and we left with contented palates and smiles on our faces."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpcWIyMC1nRRAB",
            "text": "I had a free half an hour in St. George and decided to stop for an afternoon coffee and a treat at the French Bakery. The owners and the staff are very pleasant and very friendly. The service is pretty quick. I got a latte and mixed berry crepe. They load the crepe up with berries and the crepe is big🤩 I really enjoyed it. I'd loved to have  berry sauce on top, but even without it, it was delicious. There are a few tables so you can dine in or get a to go order. I haven't had any pastries this time, but last time I was there I got a bunch of different ones and loved every single one of them. If I lived closer, I'd be coming in more often for an afternoon coffee and a pastry, for sure."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5Mk1xNkhBEAE",
            "text": "Yes, yes, and yes please!!! I’m sold after my first visit here. The apple pastry was amazing! It was the best I have ever had. It was definitely fresh, the apples had a crispness to them, the pastry with the sweet topping/glaze was perfect. The pastry was seriously perfect. I was also surprised at how wonderful the eclair was. Tasted like the homemade ones my mom used to make. I have noticed that sometime pastries leave a residue on the roof of your mouth, these do not. I used to drive from Utah County into Salt Lake to get pasties this good. This place is here, right here in St George!!!\nOh did you know they have soup, sandwiches, crapes, smoothies, and more?!!\nNow go!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQTHZ0c2ZCdHJQY3VRRRAB",
            "text": "I had a delicious sandwich on a very fresh and tasty baguette! Also a very nice pastry with dark chocolate that was just right and not too sweet ❤️. I will eat there again when I am in St George! I think anyone would be more than satisfied with any sandwich or pastry. The owner was very nice and helpful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMXZLMFBREAE",
            "text": "Passed by. Highly recommend their desserts, cream cheese croissant, creme brulee, tart. So good! Great service. Will return to try more things"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbGRHTDF3RRAB",
            "text": "Ay ese lugar me encanto, los que son amantes del postre, es te te va encantar, son deliciosos crujientes, no son tan dulces ni empalagosos, esquisitos, no ooo es un (máster), me fasino, he visitado varios lugares y este es uno de mis favoritos,  visiten pero una observación yegan temprano pork se acaban lo más temprano k yege fue alas 10 y ya casi no había variedad , yega mucha gente acomprar, visiten cuando pasen por ahí , y es muy limpio el lugar y amabilidad al cliente excelente,"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvX19mMDF3RRAB",
            "text": "Excellentes viennoiseries, respectant parfaitement les codes de la tradition boulangère française : croustillantes, légères, et pleines de saveurs. Et que dire des sandwichs ? Savoureux, bien garnis, et faits avec des produits de qualité. À cela s’ajoute l’accueil particulièrement chaleureux et souriant de ce jeune patron, à qui nous souhaitons plein succès avec cette boulangerie et d’autres encore d’ici quelques années qui sait.\n\nJe recommande vivement cette bonne boulangerie, que ce soit pour une douceur au petit déjeuner ou un sandwich à emporter pour la route. Une belle adresse à retenir. Cela fait particulièrement plaisir de manger du bon pain aux USA…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacHJIN3d3RRAB",
            "text": "Delicious food, everything is good, you can’t go wrong. The chef is passionate about what he does and it comes through in what he makes. The prices are excellent for the quality of the food. A definite must stop!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxanMzMnR3RRAB",
            "text": "Wow! These are fabulous pastries... Probably the best I've ever had. I know that might sound like an exaggeration, but these are honestly just that good. We tried several options today, including the eclairs, macarons, apple pastries and the cream puff.... All of them were absolutely fabulous."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeFpHSlpRMTg1TVZwaVJVSmZkakJvU1ZOYVNuYxAB",
            "text": "Under new ownership as of 2025, the pastry selection is now somewhat more limited - but the croissants and pain au chocolats are the best, most authentic I have had outside of Europe. This is now a regular stop and never disappoints!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbHZYTWlRRRAB",
            "text": "The best bakery I've been to in the states! Seriously a hidden gem for sure. If you love European style pastries you will love this!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN1lHelhnEAE",
            "text": "Brand new business. Nathan was very friendly, welcoming and passionate! Loved the baguette with butter a ham, a true French classic! Great pastries and even the espresso and coffees were great! Thank you! And highly recommended."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN2V2NUtBEAE",
            "text": "This is the type of local shops we should take care of by being loyal customers.\n\nDelicious sandwiches (baguette) with real ham (Jambon). They are just good\nCoffee and almond croissant was the greatest final touch.\n\nThank you very much. Look forward to come back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdHZpMnFBRRAB",
            "text": "Don't let the name fool you. This is an authentic French Bakery! We stopped there on the last day and my only regret is not finding it out sooner. The owner is very nice! I had the best breakfast sandwich in a while. The apple turnover was amazing!! Also the beignets. Another regret is not getting more pastries. 😀"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdEppRmVnEAE",
            "text": "The most amazing pastries I've ever had.  They taste even better than they look, so light and flaky!  I remember Hotel Utah food from childhood, when I read he apprenticed there I knew it would be top notch!  The eclairs are the best I have…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5Mi1XN0h3EAE",
            "text": "Food as art? Nowhere is that more important but in the world of french baking. It is a hard thing to master and shortcuts are easily noticed by the consumer. This bakery shows great artistry in this craft with fine ingredients and perfectly…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDX2QyZ1RREAE",
            "text": "Discovered on a recent visit to the area. You must try their banh mi sandwich!  The French baking was excellent — we loved the almond bear claws and the pecan sticky buns. He uses honey to make the caramel on the sticky buns. Amazingly friendly and kind service by the owners themselves."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd2ZQYUF3EAE",
            "text": "I would highly recommend coming here, delicious sandwich and the crème brûlée was to DIE FOR! You can absolutely tell that the ingredients are fresh and homemade. There’s something for everyone here. Even got to chatting with the owner who was very kind, personable and helpful. I’m looking forward to the next time I’m in the area so I can stop by again. Thank you so much for the great experience!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZTRxWm04MS1EMWV3EAE",
            "text": "Ugh, this food is so good. From the sandwiches to the pastries. These brothers make some excellent treats. It’s French, to its core. Perfectly delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNnJiYUtREAE",
            "text": "The best, authentic baguettes I have ever had in the States. Take it from someone who knows a what a real one tastes like! Farmstead doesn’t even come close to this place in terms of authenticity. As a bonus, the owners are incredibly friendly."
        }
    ],
    "reviews_count": 65
}