{
    "name": "Soul ramen & Noodle Bar",
    "place_id": "ChIJZX-kps5byoAR3MRIUkS-IBY",
    "grid": "SI1",
    "address": "250 Red Cliffs Dr, St. George, UT 84790, USA",
    "rating": 4.7,
    "user_ratings_total": 1295,
    "phone_number": "(435) 562-1318",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cGIxbHhPR2xTUjJFemQzWnROV3RWZUVWSWRXYxAB",
            "text": "Bella was so sweet, and the food was SO yummy! The perfect comfort food, for fall or honestly whenever it’s that good. Definitely recommend!"
        },
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TFlpMDFOblZ4ZG1SQ1dGUjFOVGxSVkY5cFZVRRAB",
            "text": "The food is amazing, the atmosphere is fun and calm and the service is phenomenal! We got the Black Garlic ramen and it was so good!"
        },
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT1EzTkZWVjlvY1dSdWQwRkVRMXBGTFhwbFdHYxAB",
            "text": "Soul Ramen was very spacious and the atmosphere is really fun. Our service provider Bella was lovely and served us promptly a had great suggestions for the food."
        },
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTlpVc3pNVzFrUWxsM1JUWXhXSFpLTVZkWmMxRRAB",
            "text": "Love this place! The servers are so friendly and on the spot and the food is always amazing! Always make a trip here when I come to St George!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTmJIZGFTRmMzVDFwTGFsQkZWV2h3WlROTlJuYxAB",
            "text": "I love going here! The food is always outstanding, and the service from Jenna is phenomenal! She's a rock star! Always sweet and greets you with a smile."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRFVVMUpaVXAwZDJkU1VrTnJWR0Y2UkZKcWRXYxAB",
            "text": "I went with a group of friends, and not only were the staff nice - the food was amazing. Our waitress Julia was new, but I wouldn't have known if she hadn't said something. She was so kind and attentive to us, and always made sure we were taken care of. Whenever I am back in town I will definitely be coming here again."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WVFYaHBhRWRvTURaU1dDMDNNMGxTVVdVNGEzYxAB",
            "text": "I went with a group of friends and it was delicious! I’m visiting from salt lake and loved this restaurant. I wish I had one close to me, I’d go all the time! Our waitress Julia was very sweet. Although she is new, she was very attentive and caring. Everyone was very kind and I loved the decor/ atmosphere. We had an amazing experience. Will be coming back next time I visit!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUFp6bHBSR2RzTjI1MGRVVnRhWEZWUkU0d00zYxAB",
            "text": "This is a really decent and quick ramen restaurant.\n\nI normally don't like ramen, but overall this was pretty good.\nMy partner says she's had better but we both enjoyed the meal and the service was good and they checked in a number of times to make sure we were happy.."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGT2RIUTBSMVpKWDFOMFRWRTJNVjlKU1dsalVWRRAB",
            "text": "Miss Jenna, our waitress went above and beyond.  She deserves a raise.\nWe gotta go skating one of these days!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOelNIUjNNbUZqU3pCblZUZEdhR1pKTmpjMVFYYxAB",
            "text": "The food here is amazing. That’s why I keep coming back. I will say, though I’ve been to this location four times now and the service is definitely not the best granted I thought maybe it’s because they’re super busy, but out of the four times that I went the restaurant wasn’t busy like maybe every other table had a guest. But every time that I’ve came there with my family or just with my partner, I feel super rushed to order my food like I should know exactly what I want. By the time I sit down my server on multiple occasions has forgotten our drink order has not came to take our drink order or Hasn’t came to the table to greet us at all for at least 10 minutes. And then when we do get our food, I feel like we’re rushed or hurried to eat and leave.\nFor example, the last time we went there for dinner about a week ago. We got a table instantly, I asked for a menu. I think it was a manager or owner. I’m not sure what his title is, pointed to a QR code on the table and said to use my phone and walked away. We tried for several minutes to get the QR code scanned thing to work, but every time it would say error to load page or it would just freeze so we waved down a server to let her know that the scan code wasn’t working, and I kid you not. She rolled her eyes and said fine you can order with me. What do you want. I knew right then we should probably leave because this experience wasn’t gonna get better . But we are hungry so we just went ahead and ordered our food, drinks and appetizers. The server came back with cups of water. We asked her if we could have our drinks she said yes what can I get you? And I told her we already gave you our drink order . She said oops. I’m sorry. I forgot what is it  you wanted. OK that’s bad but we pressed on. A while later, she comes back with our food. I asked her where the appetizers were and she said what was it that you ordered I told her spring rolls and some kind of green bean seed thing. I can’t remember the name of it . We were halfway done with our food before they even brought over our appetizers. I asked her for a refill to my drink, she said hold on one second. I gotta get something for another table. I’ll be right back. She never came back with the drink . She came back to give us our bill. I would say it was a pretty bad experience. There was a lot more that went into it, but I’m not gonna waste anybody’s time. It’s sad. I don’t understand how a server could be so dismissive and forgetful. I’m hoping that it was a fluke and she was just having one of those days we tipped her generously even though I feel like we shouldn’t have, but I understand servers live off their tips, and even though it wasn’t the best service she still worked and deserves to be paid for it .. I thought maybe it was just a coincidence that it happened multiple times but four times out of four times is a littlewild to me all in all the food is amazing. I just kinda hoped that the service gets better."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MFRWWjJPV2w1YXpCNVgyd3pZMnB4UkRsS01tYxAB",
            "text": "Had never been to a ramen place! Will absolutely be going back! Black garlic was our favorite! Kids meals were pretty gingery but so good!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONmVsOVphbkEwUWxOcWNUVjNhVEpuVDIxTGFFRRAB",
            "text": "Amazing food, amazing place, absolutely loved the Rainbow Gyoza. I ate the Sesame Chicken Ramen and my partner had the Wagyu Ramen with rice noodles. Loved it all! It is Pepsi products but there other drink options are amazing as well"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcFkwdzFWSGN4VFhsVmMzVm9NVGhwYlU5MlNVRRAB",
            "text": "Great food, great vibes. Service is a touch slow. But well worth the wait."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oc1dVVmFiMFJIVmxveE5tcGtVMjlyWkZSQldVRRAB",
            "text": "Get the Spicy Tumyum but request the Udon Noodles as a sub. It'll change your life"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ScVFrRlZSMmxZTUdsRVFtRTVWa3hJV0hsWVUyYxAB",
            "text": "Great food, good vibes! Ashlyn was so sweet and attentive."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poS1lVb3pWMFkzYzBOallVVlRXRmhTVmxZNFNVRRAB",
            "text": "Food was great! Love the vibe and Ashlyn was wonderful as our server 😊"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRlFVd3dWbnBqVm1GT2FETjVibmN4TUMxUlNVRRAB",
            "text": "The atmosphere is great and the food was yummy! Ashlyn was so attentive and quick!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RVkxSTFUakpwZEY5d1VFZzJVV1JDYmxaeGVHYxAB",
            "text": "Ok"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMmRVeHNlV0ZLWXpCbVRtcFphSEoyT0hoMVlWRRAB",
            "text": "my boyfriend and i loveeeee coming here! every and anytime we visit St. George, this is our go to spot! Everyone is so friendly and the cooks always make the most delicious meals ever! Thank you Ashlyn for the wonderful service !"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aE0wVnRiVmh6TW5KR01rOXVZblExUTBkbVJtYxAB",
            "text": "The best place to get ramen. Always fresh and delicious. Servers are welcoming and sweet! Definitely recommend coming here for a good meal and good people."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seFRWSkxTVkJJUzNkaGEyRlBiV2hRUzAxV1kzYxAB",
            "text": "To be honest, I probably won't be back. We went on my birthday which landed on a Wednesday and felt like we were an inconvenience. The hostess started by seating us and telling us to expect to be waiting at least 10 minutes for our order to…"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGamJWZzRkMHh3WkhORlRHbGhTbHAyYkhwNWVtYxAB",
            "text": "We tried Soul Ramen for the first time last night. Needless to say, with the five starts, but we were very please with the food! After a trip to Japan we have been searching for a good noodle place in Southern Utah and I can say we found it. We had two different types of noodles and the Katsu Curry chicken. Our kids couldn't get enough of the Katsu chicken and we even brought the extra sauce home to have with our own food. It was so good!!! We will definitely be back and are grateful for finding such a good restaurant!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaFYzbGZTQzFEUldWMGJtTmZPVlJhVW5CUlpXYxAB",
            "text": "The best ramen place I have ever been to. The flavors are perfect with nice amounts of spice and not at all salty. Try the spicy Tom Yum Seafood Ramen with shrimp, scallops, and mussels or the Creamy Chicken Ramen which has the most amazing broth. The service was excellent as well."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbVNHVmxNV2h2VUVwU1ZuVkhNMFJ4TFdOQmIxRRAB",
            "text": "We had Korean BBQ. It was such a great experience, super fun. Everything was delicious. Great variety of meat. The Boba tea and icecream were awesome! So flavorful and refreshing. Our servers were great, very kind and friendly. We had a great time."
        },
        {
            "date": "1달 전",
            "language": "hu",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOc2VuQjFabW80V1ZOT1NHdE5lWGhNZGxaRlJFRRAB",
            "text": "Iszonyat finom volt a rámen leves!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSmJtRTRTMlZEVDNaRU5XMVRiMUpEYURadVlXYxAB",
            "text": "Stopped here on our way to Zion. We were so surprised at the variety of food options. The food was very good. Also, Ashlyn was an extremely courteous and attentive server!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SYVNIaFRkekkzUzI1VmRURTVjVTVOYXpCU1VYYxAB",
            "text": "For outside of Orange County, CA, it was decent ramen and Japanese curry. Not the most amazing but it hit the spot. Really cool artwork and ambience, nice staff. I would eat here again on a road trip."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kR1FUQjJPV1p1ZWtVd04wZHVZVGROYlcxQlJYYxAB",
            "text": "Ashlyn was our server she was friendly and attentive. It was our first time and I will be coming back very soon! Try the fried banana! Also the soft boiled egg sooo good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kd1RrVkpTMU15Y0RWTU1IbGFUVGt0UmpOYWFXYxAB",
            "text": "Visiting from AZ and we thought we would give ramen a try with the family. Everything was great and our server Ashlyn was very helpful when asking questions about the menu and making sure we were taken care of."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNFZtWmtaSEZzYzFWQmVWSjFVSE5zUVZjMGNXYxAB",
            "text": "So yummy and amazing and awesome"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQ1NqTTJVa3BMZWpkcmJrbFJOVXN5ZUdKWVJYYxAB",
            "text": "The restaurant was really nicely decorated with Japanese popular art. The waitress Ashlyn was very friendly and attentive. We had Ramen and Boba tea only since we had a big lunch so we just need a light dinner. However, they also have table top BBQ that looked very good too. Good place for dining out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMU1FdDROMHBDYjA1RWJUZENSbTgwTkZWQ09WRRAB",
            "text": "Ashlyn was very nice 😊"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSeWFXcEJVSFJUZUhGa2JsRnNaSEZwZEdRek5uYxAB",
            "text": "Ashlyn was great answered all out confused questions. Both of us got ramen, great. I got mild still had some kick. Might try next level next time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200dE1WWlJhek53TnpWa1RrUk9kVE5tVUZkcVJrRRAB",
            "text": "Ashlyn was a fantastic server. The food was delicious. Definitely recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcGRqUTFhWEkyVGtKU1JTMXhaRFYwYm5kR1YxRRAB",
            "text": "Only issue is Hot last time was super hot. Mild this time wasn’t spicy at all. My wife said her HOT spice ramen wasn’t nearly as hot. Seemed like we got original and mild vs mild and hot bowls"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4b2VXVjRkaTFwZFVGR2RuQXpka3RsY2pOVWVVRRAB",
            "text": "This place was very bland , didn’t taste traditional or good . The plates looked good but tasted like actual water , the ingredients like meat and vegetables tasted old and everything was cold . The boba was also very bland , it just tasted like milk with water when I ordered a Thai tea . Any and every other boba and noodle place in Vegas will taste so much better , it’s not even that far of a drive . The staff was so nice , the service was perfect , everything was clean and everyone was very friendly and attentive ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSUk0ycGFaemxHTURkZmJHZDRXR3MwVVhJMVprRRAB",
            "text": "Phenomenal-\nMy husband and I spent a month in Japan and have been craving shabu shabu since. We came, had an amazing meal for so cheap. Then came back to have the delicious ramen.\nCome in and crush their deli iousness"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcVVISlNjVGhHTjJJMlMwRXdTa3hrVmpsSE1IYxAB",
            "text": "Ashlyn is a very good and nice server"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVFdrcG5XVWxWZWxKa2FEUllVMmMzWVcxT05VRRAB",
            "text": "BEST CUSTOMER SERVICE FROM OUR SERVER BELLA! FRIENDLY ATTENTIVE HELPFUL AND QUICK ON HER FEET! FOOD WAS AMAZING! SUCH A NICE FIND IN OUR UTAH TRIP, SADLY CANT COME HERE ALL THE TIME BUT WILL BE COMING HERE EVERY TRIP FROM CALI! ATE HERE TWO NIGHTS IN A ROW! 1 ramen 1 hot pot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSGRuQkZUVFZVZW5wMlgzWjZPVzVCUlhwNU9FRRAB",
            "text": "Black garlic ramen was amazing. I have high standards for Japanese food and even then this place impressed me!"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dWE3dWNnEAE",
            "text": "육수가 너무 짜고 모든 토핑에 엑스트라 차지가 있음"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMFlsUkRhV1ZaYW1KdUxWaDZVR1ZoVjNReGVHYxAB",
            "text": "This was the best food I had in all of Utah during my recent vacation! Thank you to the owners and to our wonderful server Jenna. This place was so great, my spouse and I came here two days in a row. They make their kimchi homemade and it shows. I could eat a bowl of their kimchi by itself its so good! The owners are so kind, we ordered two shirts that they design each year and since they had none in store one of the owners drove to the restaurant just to drop off the shirts for us. The food is a great price for the all you can eat Korean BBQ. Our server was super on top of changing out the grill and taking our orders. The kitchen staff was great about bringing out plates quickly. The restaurant is decorated in such a cool way and the atmosphere does not disappoint. We were staying in Hurricane Utah and it was worth every minute of the 20 minute drive. If you get a chance, stop here for great food and wonderful service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMlVrcHRkR2RETkdrNWNXUkhTaTFLT0RWaGFFRRAB",
            "text": "It was my first time visiting this small town, and I was genuinely impressed to find such authentic lo mein here. The broth had just the right level of saltiness, the meat was flavorful and tender, and the appetizer was equally outstanding. Highly recommended!"
        },
        {
            "date": "3달 전",
            "language": "zh-Hant",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SlVpMTFlVGRzZG5wSWNHNHphMHgwVWxGYU0xRRAB",
            "text": "有分吃到飽區域和單點的區域。我們這次是吃單點的。裡面有會說中文的員工。拉麵的口味不是那種很正統的，份量還不錯，餐點的選擇也不少，我甚至還看到過橋米線、紅油抄手等等。炸物偏硬，很普。"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaVJXRldlRFV4VGtkblRtTkRjbTFmYTFWVGFYYxAB",
            "text": "We were seated immediately and noticed how many people were in here at 10 pm. At least half the tables were full. We both got taken- the beef one and the black garlic. Both had amazing flavor, especially the beef. Shai, our server was so friendly and gave us great recommendations. We’ll definitely be back and have to try the ice cream next time. If you’re looking for good ramen, we definitely recommend this place. Zero complaints and a few pleasant surprises at this place. I really liked that you can order the dove on the side with their house made chili oils so you can pick the level of heat."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNWEwSkVkVkJhUjFaallreFhVazB0UTBjek1WRRAB",
            "text": "The ramen wars have officially begun in Southern Utah!\n\nI ordered the Spicy Beef Ramen and the Shoyu Ramen @ Soul Ramen & Noodle Bar, and I swear I could hear ancient samurai clashing swords in the kitchen while the broth simmered.\n\nIt’s no coincidence that Slurpin’ Ramen is posted up across the street, this is an all-out noodle turf war, and I’m caught in the middle, willingly!\n\nRumors swirl that every ramen joint in St. George is a front for the Yakuza cartel, and honestly, after tasting the broth, I might believe it. I saw a katana wielding warrior standing behind the register and I think a throwing star flew past my ear when I asked for extra chili oil…\n\n1. Is it dangerous? Yes.\n\n2. Is it the best ramen I’ve had outside of Tokyo? Also, yes.\n\n3. Have I ever been to Tokyo? No.\n\n4. When I grow up do I want to be a sumo wrestler or samurai? Also, yes.\n\nWorth the bloodshed, long live the noodle lords! 🍜🗡️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OYU16QkJVblZCVkdwdFRuUkdXV3hzZGtWUGRXYxAB",
            "text": "Wen for dinner, food was amazing and atmosphere on point 👌. Waitress was very helpful in helping us get familiar with the menu as this was our first time. Our waitress forgot to place one of our orders through to the kitchen but she was very upfront and honest about it 👏🏼, so 5 ⭐️ regardless!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdktxTjZHcy1mWVh3EAE",
            "text": "This place is a 10/10 🤩 the food was incredible and I will be coming back here. I definitely recommend trying the black garlic ramen 🍜 is amazing. And the service was great, our server was very nice with us and really helped us out, cause we knew nothing about what to order. And the owner even came out to speak with us, and got a while too. He was very nice with us, hopefully you guys can meet him too. And the atmosphere was great, it just looked fun in there and it really made you appreciate the food. Overall, if you haven’t been here, come to this place because you will not forget it. Oh! And get the Boba!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTmRGaE5kMHB1Y2xkdFlVZGlORXMxYVhaR1NrRRAB",
            "text": "The new menu items are tasty, fresh and so delicious. The Wagyu is so tender. The snow crab legs are the most fresh I’ve seen in town. Delicious new flavors of meat too! I recommend trying the chef special and the spicy marination. The restaurant is so tidy and the service I had from Jenna was delightful. I will be eating here again as soon as I can. The dessert and drinks are included with the Korean bbq and hot pot. I couldn’t have asked for a better experience. 11/10 !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSlJqQldOMWxZUkU0NU1tMWxkazFTVlZGYVVtYxAB",
            "text": "Genuinely top tier food service and atmosphere. Chose to eat here for my birthday, some of the best food in St. George! Ashlynn and Ashton were the perfect duo in serving us. Their kind and fun energy is amazing and you can definitely trust their recommendations!! BQQ Chashu Buns and Tonkotsu Ramen are our go tos"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aME1rbEJRVWxYVDNkeFNuRjVSWFJtVERaWFVIYxAB",
            "text": "If any of you are visiting St. George and looking for authentic Raman, including vegetarian options, make sure to stop by. Truly soulful food!\n\nWe are visiting Zion this week and we made sure to stop by on our way back home too.\n\nP.S.: if you’re into Naruto, there are a handful of cute posters all around."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUVNGQk1jakJUU1VKbk4wRnRUbHBNY2tOVE0xRRAB",
            "text": "Really good food. Fast and pleasant service. Easy parking right out front. Decent deals and sales on their food. The thai tea is delicious and the ice cream is also delicious!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWE4zQTJiMFpqUlZFMFdESm1XRU5yTUZSNlQyYxAB",
            "text": "The food here is delicious. The waitress Shai is very professional, kind and patient. She gave us helpful food recommendations and is always there to serve us whenever needed.     The dining environment is clean and comfortable. I will definitely come back next time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSGNrOWtRalEyZW05SVVVbFFkblp1ZDBobWJrRRAB",
            "text": "The food here is delicious. The waitress gave us recommendations and is always there to serve us whenever needed. The dining environment is clean and comfortable. I will definitely come back next time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTWFsRk5VRVl5VURKdVZFTjBWR0U1Y0RORFNVRRAB",
            "text": "Great food, large portions, and very attentive staff! Paige was helpful with our party trying to figure out what everything was. Definitely recommend thr black garlic ramen!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaWFuZjd3RRAB",
            "text": "Food was delicious, I practically licked the bowl clean! Service was attentive and friendly. There were lots of anime themed decorations all over, which I enjoyed looking at. The lunch special is a great deal for the amount of food you get. All ingredients tasted fresh, and the tonkotsu ramen broth wasn't too salty, with the right amount of kick. I ordered mild because I'm a bit of a baby when it comes to spice :) I would definitely visit again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvblBuekpBEAE",
            "text": "Food was Delicious & great choices. Our Server Kalia was Awesome, personable, fast to get our next order, Refreshing. Cooking all our food on level 3 was the best as you can slowly cook your meats & vegetables without burning & still enjoy a conversation with your Date. Remember Beef can be 120°-155° with Medium Rare at 130° -135° & pork is always 165° or above so take your time cooking pork.\n\nAnother waitress kept turning our hot plate to level 5 & our food cooked very fast & burnt the hot plate, I told our waitress to tell her to stop messing with our temperature, especially when I would get up to grab more spices & come back to over cooked meats & the plate smoking.\n\nOverall great Experience~!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUFExRm1kMVJyWjJOTWJXTlpUM2RpVjBGTFEyYxAB",
            "text": "Was a little confused when we came in as it’s multiple businesses in one building but the staff were super friendly and helpful. Shai gave us recommendations and the food was delicious! I ordered the Sesame Chicken Ramen and this was the aftermath. Highly recommended stopping in if you get a chance."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncWFxanNBRRAB",
            "text": "Everything was great. We ordered the ramen and the gyoza and loved it. Service was great. Very attentive. Cute place. Nice atmosphere. Will definitely be going back when in St Georgie!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMGNDMWxkVnB0T0ZNMlluaEdYMUZ1WkhjeE5WRRAB",
            "text": "My kids and I really enjoy coming here. We can always enjoy a good Ramen everyone can love. Kiki was so attentive to our needs. The presentation of the food was nice that we forgot to take a pic before we dug in. Haha"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5YVltUnRPRzl5TVhkMVFtZEhhUzFhZUV0VExVRRAB",
            "text": "1st time eating here with the family.  Staff including Kiki were very helpful and kind.  Food and ramen were amazing.   Great atmosphere and definitely would recommend this place to anyone."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSlNsTndOM2R1YzNwVVVEWlhhSEpCYWxobFRHYxAB",
            "text": "Got the black garlic ramen. It was delicious and well prepared. The service was top notch and the owner stop by our table and we had a great conversation.\nWill be back for sure."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paa1UydGZYMk5CTjBSbmIxaFRSVlZIVHpnM2EyYxAB",
            "text": "Shai was an awesome! She was super sweet and nice! Very kind and always checking in on us! Definitely recommend this place to anyone that loves Ramen!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzc1B6QUh3EAE",
            "text": "My husband and I enjoyed our experience at Soul Ramen. The food was top-tier! We ordered the Katsu Curry which was 10/10 and the Black Galic Ramen was just what the Dr. Ordered. Our server Gretchen made the experienceeven more wonderful. She was attentive and provided excellent service.  It was very refreshing to find good food in St. George. We will definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMFdFRnZkemhOVm1sSlMydDBPR05vZDJWaWRXYxAB",
            "text": "We were served by Ashley and Ashton and they made the experience even better. The ramen is delicious and the tonkotsu has a rich taste to it. High quality restaurant and awesome decor"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSlJ6aFBlVTVYTVhKRVZ6Qk1ZbkJQYlZoeU9YYxAB",
            "text": "Highly recommend! Our server Bella was so kind and amazing! It was our first time at this specific Korean BBQ place and she explained the menu so well and recommended us some great options. She checked on us often and got us everything we needed super quick while simultaneously serving a big party next to us. Bella’s was just so fun to be around and made the dining experience amazing!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLUptQkVnEAE",
            "text": "A very large Asian restaurant that serves  Ramen, shabu shabu J BBQ and also Korean BBQ.\nFriendly and attentive server, and the place is very lively and family friendly.\nThey also have a separate bar selling Boba drinks, and another counter selling ice cream."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN05XWHZnRRAB",
            "text": "Such a fun dining experience. The food is really good and filling. Both my husband and I agreed we’d come back again and would love to bring our kids as well. I think they’d get a kick out of all the anime stuff in here. Terrell was our server and was so awesome and on top of everything the entire time. If you get him when you come here you’re in good hands."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKS2x3S0NkNm82eU1nEAE",
            "text": "Boba ice cream hit the spot on a hot night.. so good! Eggrolls and Sesame Raman were excellent as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnemNrWTVaSEpIZVdobWRqYzRZVVZIVkhOd2EwRRAB",
            "text": "My server Kiki was great, she was friendly, patient and very attentive. Really enjoyed the food! Will be back for sure"
        }
    ],
    "reviews_count": 70
}