{
    "name": "Street Eats",
    "place_id": "ChIJmSI5zrdFyoARuTrQF4-isUg",
    "grid": "SI1",
    "address": "446 N 1680 E, St. George, UT 84770, USA",
    "rating": 4.6,
    "user_ratings_total": 528,
    "phone_number": "(435) 703-6993",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcFYyZExOM2xHTFhWeExUZHJNSFZVTldSbGNtYxAB",
            "text": "Fun skateboarding atmosphere. We had the fish tacos and Chicago dog which were good."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWWFXeGZhSEZIWWpab2VVRkJNV2x2U2kxWE4wRRAB",
            "text": "I felt like I threw $75 in the trash for just my wife and me — it was a painful experience. We had ridiculously slow service for a Tuesday night that wasn’t busy; we waited nearly an hour before our entrées arrived. The staff also showed extremely poor sanitization and food-handling practices- our server was very nice though.\n\nWhen we were seated- we received dirty and crinkled up paper menus that looked like they've been used for a week- it was gross. That set the tone for our lame night out.\n\nMy burger was overcooked, the bun was cold, and while the Caesar salad was large, it didn’t come with any cracked pepper nor was I offered any. My wife had the fish and chips — it was average at best, and the fries were overcooked and hard.\n\nOur calamari appetizer was pretty much all breading with very little actual calamari — easily the smallest and weakest serving I’ve ever had at a restaurant, though it did taste good.\n\nOverall, this is just the same generic food you’d find at any bar or state fair, just dressed up a little.\n\nIt takes more than “vibes” and cool décor to make a great restaurant."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRlYxcFhZWE5HTmpacFFYUjRaMHR6YzBkcVgyYxAB",
            "text": "Delicious and unique! Our server was great."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RU16TllURXhTV21sSE5rSlBYekp6V0hOdFdFRRAB",
            "text": "The workers are young and kind. The vibes consist of lots of good music, a bar, and seating. The burger was really good and I'd definitely recommend the fries!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5c1VrUmhVMHRwYVVWMlltZFhSM1pEUmtWUlQzYxAB",
            "text": "Fresh cut fries were very flavorful because they're cooked in beef tallow. Unfortunately the heavy salt took away from that great flavor. It was a similar situation with the burger. The combination of toppings was great, but the burger itself was so oversalted that it killed the other flavors. There's good potential here, but the excessive salt killed it for us."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eWNGazFVMUJPWVVZMFRESkdha2hFVlVsNmMzYxAB",
            "text": "We started going to street eats on Sunset,  they started out great,  but service slowed last several times.  We went to the new location this weekend.  Place looks great,  but it took 45 min to get 2 hotdogs 2 kids burgers and fish tacos out.  It was not busy and staff had no sense of urgency often standing around talking.  Hopefully they can resolve this issue as we liked going there."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dGVENy1RRRAB",
            "text": "Had to change my review. The new place by the mail is great. Food, service ect.."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMWJVOUthRE5hV1ZCSFpVeFhVV1F6U3kxMFFtYxAB",
            "text": "It was fairly busy on a Saturday at 6:30pm, of course. We sat at the bar.\nSadie was our bartender and she's great.\nI had an Old Fashioned first. It comes with one cube of ice instead of many little ones and was spot on. I also had a New York Sour which was great.\nI had a Clam Chowder cup and added the Crab, which I highly recommend. It perhaps could've been hotter, but was warm enough. Probably a slight delay in delivery to the Saturday night busy-ness.\nOverall very nice experience and we will repeat.\nDid I mention Sadie was great?\nEdit: we got creme brulee at the end, omg, so good. Get it. Right now"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5a2NVWlVNMUowT0RoemEwNVROamwxY1Vzd2EyYxAB",
            "text": "Had a great time eating here with my grandkids. Service was attentive & the food was great!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNWNGZHlSM0pHV1dWYVVVZG5kMlY0ZFY5R04xRRAB",
            "text": "Just ate at the new location. Atmosphere was great food was awful. Burnt chicken sandwich and cold fries for $20."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NFFVVTJhMEZMU2xKMVZIUnVTMHRPZFZKamNsRRAB",
            "text": "Sad to say we never got to eat here. We came about 530pm with four adults and two toddles who need high chairs, we were told 35 min. We walked around the mall and came back and check in 30 min later and were told a little longer. At 6:20pm we asked how much longer and were told the kitchen was shut down and would be another 30 minutes at least. It’s so frustrating because we had to come and ask instead of being informed that it would be so much longer and my babies were getting so hungry. We decided to find somewhere else to eat at this point but now it was 6:30pm on a Saturday night in St. George and we were going to have to wait longer for food. We watched them seat so many 2-4 tops which we could have made work, as we have a one and two year old, instead they counted as a 6 top even though two of them were high chairs. The staff really wasn’t kind and seemed relieved when we left.  They most likely could have slowed small parties down so the kitchen could keep up. Really too bad, was excited to try the food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5QlpVdElRbWRhYW5KU1FqZE5UV1pVV1V0dFMyYxAB",
            "text": "I have been to eat at their establishment  multiple times, even at the other location. Service is not the best.Food is just blah. Don’t waste your time"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMlIydE5hM1p6VFVOSk9WSkNNa0ptWjJKbFkyYxAB",
            "text": "Do not sleep on this place! My husband and I drove from Maine to California and are headed back east and just happened to stumble upon this place. In all honesty it is the best food we’ve had the whole trip! My husband got the fish and chips. It’s better than any in Maine or in London that we’ve had. The drinks were delicious, and our waitress Maren was super super sweet! If we lived near here we will be eating here every week as I would love to try everything on the menu! Absolutely recommend the cauliflower appetizer.\nDo not let the fact that it is attached to a mall dissuade you. We ate outside and there are fountains and a beautiful ambience. The inside decor is really cool too. it’s not a chain. It’s the only location. We love it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocFFrOURXVk5LZUV0TFMxUlFValJrZEZVME9YYxAB",
            "text": "Fantastic burger. The best I have had in Saint George."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSWRWbDBUamxZYzNjMk16Wm1kbXB2VGtrdE9FRRAB",
            "text": "My wife and I tried Street Eats on the recommendation of some friends and we’re definitely going to make this one of our go-to restaurants in SW Utah.\n\nThe chef is from Seattle so we tried two fish dishes, fish & chips and fish tacos. They use fresh cod, lightly battered, and the result is at least as good as we’ve had anywhere, including the PNW.\n\nNo pics of our entrees as we were not planning to write a review, but I attached one of the dessert we shared, Earl Grey Creme Brûlée. We didn’t really notice Earl Grey flavors but it was an excellent dessert.\n\nOur server, Santi’s, enthusiasm about the food raised our expectations.  We were not disappointed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eGJIcFpTMUl6YldsbVQzSklRekU1Wm5SamNGRRAB",
            "text": "The food was so good. Never had a burger with that much flavor. 😭😭 it’s the kind of thing you have dreams about."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNVFVWTJORWRGV1ZwM2IxWmxPR0V6VkVFd2FGRRAB",
            "text": "First off, our server Marron was amazing. She was so kind and fun and was so welcoming and made a killer pitch on the food.\n\nThey are NOT messing around when they say they are a scratch kitchen. Every single item was so well crafted. Every item on that menu is a killer set of flavors that are such a great pairing.\n\nWe will stop here every time we are in St. George."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4d2NtSTBXR1ZPVDBNMFUxbElSekpFUzNGVlRtYxAB",
            "text": "The food was okay. The service was not great, but what was hard is the place is not built for people in wheelchairs. They put us outside and my wheelchair was at an angle until they found a place inside where i was able to fo in straight. Still it was hard to navigate it without hitting something and I even hand someone pushing me. The artwork was amazing. I would have given a higher rating if it was more wheelchair accessible."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVM1MwUnpNMHg2YW1GbGVVTjRORlIwVmtVdFYzYxAB",
            "text": "The food is all made from scratch & cooked in tallow. I truly enjoyed how fresh everything tasted. My teens did not like the fries or sauces."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVmQzbFpZa3BOZDFVMU1GUXhkR1oxVFdsT09GRRAB",
            "text": "This place is awesome. We’ve been eating here for years. We discovered them in their first location and this location is even better.  The food is the best. Service is awesome. Atmosphere is top notch. You won’t regret going here!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMVQwOW1RbFUwV0haZmNqaG9aR3BuUjBVMmNIYxAB",
            "text": "Completely underwhelmed at the flavor of the dishes we got. We got the calamari, the nonna salad, and a burger.\n\nThe calamari was the most flavorful out of all 3. It was missing a dipping sauce of some sort. It could've used a cilantro lime sauce to compliment the gochuchang. I was disappointed.\n\nThe nonna salad had a dukkah crumble but there was no flavor at all in the crumble. Dukkah is supposed to have Indian flavors and there was nothing, at all. I think what I tasted was walnuts and tumeric and that was it. This dish totally missed the opportunity to be great. The kale could've been massaged before serving. I brought the rest of salad home, and with minimal effort, sprinkled Indian spices and it was fantastic after that. This dish has the potential to be great, but missed the mark. Please consider adding spices to your dukkah so it is authentic.\n\nThe burger wasn't great. There was no flavor, it wasn't even seasoned with salt. The onion/bacon jam lacked so much flavor. I tasted no garlic at all from the garlic mayo. It could've been great. The fries were decent.\n\nWe will not be back based on the lack of flavor. The dishes were really inventive and had the potential to be great if they had just added a few more components. Maybe the finishing chef was absent that day?\n\nThe atmosphere was great. I loved the decor. I was really happy to see  St George had a restaurant like this. I hope they're able to fine tune their dishes a bit though. Also, please consider getting rid of the seed oils!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSlRqaHFXVE5qV210S2NHd3lMV1pSTWxKRFVGRRAB",
            "text": "Overpriced for wannabe hip eatery. Ordered the fish tacos, got a piece of fish on a cold tortilla decorated with some pickled cabbage and some kind of dressing. Tasteless. Needs help. Does not come with a side. If you order the fries expect limp and greasy. Went there for lunch there was more vibe outside. Maybe dinner is better."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxS0xXTlhhV2RLTnpGdWRtdGlNWGw0UVVvd00xRRAB",
            "text": "Incredible food, amazing service, lovely atmosphere. We are visiting from out of state but would come here weekly if we could. Our server Santiago was so passionate, warm and inviting. Can’t say enough good things, highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kR1VuaHBlVEZ5WWxGT1RFaE5kM2xYU2xrd1NYYxAB",
            "text": "Visiting from the UK, we know our Fish and Chips. Truly the best Fish and Chips we have had in US. Fish delicious and coated in a perfect batter. Really friendly staff.\nThank you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdmREZEdXVEYzYlhRNFl6aHNRVk5NYW1JNVowRRAB",
            "text": "Great service, food and cocktails!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wM05HNXliVEZJZFhwb09GTXRZVU5JVW5JNE1tYxAB",
            "text": "Dorito burger how is this even possible?! This place was unbelievably good. Went here with my grandson. The decorations are great, my grandson could not stop singing the songs, but unfortunately knew none of them. Love this place and the servers."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZd2NWaFdVMmhuYzFkdWNGYzFaa05VUVdacFpIYxAB",
            "text": "Was really looking forward to trying this place after our long drive. Walked in the hostess rolled her eyes when we said there was 10 of us. Was told no tables to accommodate that many. We asked for 2 tables instead and was told that takes room for other people who want to eat. So unfortunately will NEVER be trying here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwd016SjBPRVJFWVZodlRqSmpXVkk0VUdscmRVRRAB",
            "text": "This was our first time trying this place. From the moment we walked in until we left we felt very welcomed. We were greeted with a friendly smile and seated promptly. Our waitress Kamryn was super friendly and attentive. Food was super delicious and I really liked the atmosphere.\nWe will definitely be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eUxUUkhkMVZMWm1sbmVGRmxhbU10ZUROR1gxRRAB",
            "text": "I ordered the late night smash burger with French fries and a margarita. My mother got fish tacos and loved them. Service was great and personable. I had a great conversation with the manager who saw I was a Celtics fan and came over to tell me he was too. Overall great experience and great food too. Would come here all the time if I lived locally.\n\nGo C’s 🍀"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205U05uSmhhV0pNZEVsYVVuQmtVMGRRU21aVE9WRRAB",
            "text": "Nice cozy atmosphere. The ball me hot dog was very tasteful and was a complete meal. The fish-and-chips battered perfectly. Fish was light and fluffy. Fries were excellent. Only negative is that they serve no hot sauce. Guess I need to brimg my own :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVGFWWkRSVU10ZW10blJYTk9ha1pHU2pkNk1sRRAB",
            "text": "Seriously one of the best meals I’ve ever had - I guess I have to add cool ranch Doritos to every burger from here on out. Such an awesome PNW getaway in the Southwest!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sS1owbHRVVEE0VGtVMlNUQm9XRUpWTms4eFMxRRAB",
            "text": "The food was great, but a bit expensive. Fish & chips and a burger with 2 drinks came to $50 before the tip. Music was loud, so it was tough to carry on a conversation. Our waitress was very good, but gave us a long list of items that were not available."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMVF6RTNSWE15WldNdGJuaHdTRlI2TFdkMk9WRRAB",
            "text": "As soon as you walk in the vibes hit!! Great atmosphere, friendly staff!! We stopped for lunch, but looking over the drink menu I cant wait to go back for the evening chill!! Overall 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214YVYzZG9lVUV5VVdObE5UaExja2QyUmpkSFExRRAB",
            "text": "We loved Street Eats! From the atmosphere to the food and the service, it’s was a fantastic experience. The food was exceptional and our waiter, Santi, was genuine, personable and excellent at his job. We will definitely be back and have already spread the word to our friends!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUGRURldVRVJhYnpVMkxYQTNSM1V5VkU1dE1VRRAB",
            "text": "Amazing vibes, Great food! Great atmosphere! Our server, Santi (Hope I said his name right?) was great and gave us recommendations of what to try. Did not disappoint these first timers."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaE1qQkphMHhCYzBWTFkxVndSR1JSVWpodFlYYxAB",
            "text": "I attended a work party here, and I have to say my employer certainly knows how to pick a good location. I will certainly be going back. The burgers were creative, which is a word I usually use insultingly to describe a burger with a bunch of random crap thrown on it, but absolutely not in this case. It was delicious. Major bonus points for a solid fish taco and tallow fries. The staff are also genuinely solid people, too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFM1draFNkRGw2Y201TFZGZFlWVFpITldRNGNuYxAB",
            "text": "The best restaurant in Washington county and the grill daddy vibes are still present. This is what happens when your whole crew gives a shit. Burgers and tacos are awesome, but try it all. None of it is bad."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MlgzUnJRbEF6VDA4NFduTkVha2hIV2t0bk5sRRAB",
            "text": "Yum! This place is the bees knees!! I always sit at the bar, and Ryan is just the best. So knowledgeable and knows just what you want!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeGFVZFlNM2hMVjJKTmN6aE9hR3RoWHpOa0xVRRAB",
            "text": "The staff and hotel property truly defines both luxury and commitment to providing exceptional customer service. This has to be my favorite hotel property. I strongly recommend this hotel while visiting the beautiful area of St. George, UT."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWk0ydGxURkZHV0dock5HeFZSMVZLYm5CbFRWRRAB",
            "text": "Have been frequenting Street Eats since their Sunset location. Love their new location at Red Cliffs and their service is excellent as well as their amazing food! It’s great they added a bar too!\nHaven’t had something we didn’t like! Their burgers are great! My favorite thing on their menu though is their Pikes Salmon Sammie (I crave this sandwich) as well as their Fish and Chips. Best fish and chips I have had! They use a special batter for the fish and their tartar sauce is fantastic!\nBonus - they fry in tallow which is amazing!\nThank you Street Eats as it's so nice to have a place like this here in St. George. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdGVXWkpaRjl3VlRkM0xUTTNUbFU1V0ZKT2JVRRAB",
            "text": "First time eating at the new location and it was amazing! The restaurant is so fun and a much better location- I recommend sitting on the patio if it’s available. The wachos are a must try for sharing! The cocktails were good, excellent fish tacos & the bahn mi hot dog was good. I will be eating here again to try the other menu items. Staff was friendly and happily sat us 10 min before closing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOd2VUVnRNelZPVEcxbFMyNUpZbnBUVkRJdFJIYxAB",
            "text": "We tried Street Eats when they were still in the soft opening and we were so impressed! The service was incredible, especially for having just opened. Everyone was attentive and knowledgeable about the menu. I love that they have an open kitchen (that was clearly flowing so well even when they were busy). We got the calamari, fish and chips, Sway burger, Salmon Sammie, and bacon/brussels guacamole. The Beach Day Pina was perfect. We are excited to come back and try more food (especially brunch)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR05XZDFZWEJTUmpOcFpXTTJWVlJ2UTJaek1IYxAB",
            "text": "-First time in, and I'll be going back.\nThe only thing I didn't enjoy was the cheese sauces on the wachos (waffle fry nachos). Reminds me of the cheap cheese sauce from a can.  The fries themselves were fantastic.\n-The service was attentive and easygoing.\n-The vibe was spot on."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeFZtYzVSM1JKWldkWFJrTkJUbFpIUm0xUlMxRRAB",
            "text": "First time here and went with all three of my kids. The servers and staff were so friendly, upbeat and fun! I got the fish tacos and they live up to the hype. Also got the olive oil cake and crème brûlée. Both had ripe fresh berries and fun flavor combos. 10/10\nWarning: the “Lil Homies” hot dog is a super yummy foot long hotdog cut in half, so the portion is huge! We easily could have ordered one to split between my kiddos, but I didn’t mind having to help them finish it. No complaints here. We will definitely be back next time we are in town!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUGJVWktibnA0V1hBMmQxQnNUblJKYzAxa1RsRRAB",
            "text": "We had an incredible experience at Street Eats’ new location at Red Cliffs Mall! The Wachos were a great way to start the meal. They are basically nachos built on their waffle fries (cooked in beef tallow), loaded with fresh pico de gallo, crema, jalepenos, and pickled onions. The Sway Burger was cooked perfectly, stacked with fresh ingredients and Ranch Doritos, and was bursting with bold, savory goodness. The fish tacos were a highlight—light, flaky fish with crisp toppings that felt like a perfect bite of summer. Those beef tallow fries with house made fry sauce were also a hit. The location has a fantastic vibe, with bold graffiti and neon signs creating a lively, welcoming atmosphere that’s perfect for families or a fun night out. The decor screams creativity and community. The staff were warm and attentive, making the experience even better. This spot is a must-visit for anyone craving elevated street food with a fresh, scratch-made twist. We’ll definitely be back at Street Eats soon."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa1UxWkVWbkEyZVVwVVkwNHRaMDVmUkUwelRGRRAB",
            "text": "We are from Washington State, staying a couple nights in St. George on our way back from Grand Canyon. We picked this place because of the location and rating.  Loved the decor (especially the Blink 182 skateboard). And all the nods to Seattle in the art and menu. Food was great, and that’s saying a lot because I’m kinds of a food snob! Couldn’t decide between the fish tacos and the fish and chips. Luckily husband was dealing with the same issue so we were  able to get both and split. Daughter got the Wacho’s. Unfortunately, she is a kid and picky so got everything on the side.  We put them back together to try and they were delicious!\nCan’t leave out the beverages.  That’s the only thing I got pictures of!\nUsed to paying $18+ for a good craft cocktail at home so the prices here were very refreshing, as were the drinks!\nWould love to say we’ll be back but it’s a very long drive for some food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbFVUUlFjSEZvTVdGa00xVmxUVTV4UW5KcFJrRRAB",
            "text": "Used to be great. New location is nice but table service is slower and costs more.\nFood is also WAY more expensive and some silky things like we ordered the spinach and artichoke dip, it came with one tiny loaf of bread. Plenty of dip but more bread costs $2 for like 6 more servings. Bread is CHEAP. Give people enough bread for the amount of dip. Or go to some chips. Just silly stuff like this that makes our family feel like these guys have lost their way.\n\nBurgers are still great!  Fish tacos (one of their staples) are good but were a little dry on sauce this time. And burger changes or substitutions are very limited. Fish n Chips were a total miss for our son. Huge fish chunks but breading doesn't stay on and very greasy. Go to smaller fish chunks and breading that will stay on.\n\n$250 to feed 9 of us. Used to be around $150. Just don't see the increased value we are getting.\n\nWe used to love going to old location--friendly people, creative food options, and always prefer to spend with a local business over chains. But these guys have lost their way a bit in my opinion. Maybe we will give it one more try. I'm hopeful but not too optimistic unless the owners/mgt really listen to feedback and make some changes.\n\nOur server was great. Helpful, quick to get things, and genuinely felt bad charging us for little add-ons (like the extra bread for a $14 appetizer), but said she has no choice since kitchen brings it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbktYck53EAE",
            "text": "Stopped here for lunch and it was fantastic! Staff were kind and greeted us immediately upon us entering. The place had a fun and cool vibe. The food was good and decently sized for the prices. We ordered the Wachos, Dixie chicken sandwich and hilltops finest. The wachos are deliciously genius! My husband enjoyed the burger and the chicken sandwich was incredible. I personally couldn't finish it, making it 3/4 of the way but my husband was happy to finish it 😂 The sandwich and burger don't come with fries, so we shared the wachos, was perfectly fine. Food is freshly prepped and cooked upon order, so that's also nice. The chicken was fresh out the grease and still releasing heat minutes after I dove in. Will gladly dine here again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBemZhWXpRRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\n\nThis place gives off a chill vibe as soon as you walk in! 🌿✨ Come to find out the whole crew is from Seattle, Washington 🌧️🏔️—such amazing people! 💙\n\nI love the size of the menu 📜—not too overwhelming, just the right amount of choices. You can tell they put so much care into everything they do. 💯 The team respects each other and treats their guests like family. 🤗❤️\n\nWe ordered the Hilltops and the Sway—so good! 🤤🔥 Packed with flavor! And don’t even get me started on the Cajun tots—absolute perfection! 🥔🌶️👌\n\nNext time I’m in town, I’ll definitely be back! 🚗💨 Crossing my fingers they open a spot in SLC! 🤞🏽🏙️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRE4wSTRPVnBzTjA1d1ZVdERTRXhDWlhSbmVGRRAB",
            "text": "This place is awesome. The inside is super PNW. The food is amazing. I am a repeat customer and always happy to come back. The Marg on a Monday is delicious. I have been on the hunt for a non-alcoholic margarita for YEARS and they made a darn good one. Always happy to come here, definitely coming back next time I am in town! Staff is amazing and attentive. The inside is clean and fresh and fun. A little St G escape to T-Town!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdE5mVWd3RRAB",
            "text": "This place blew us away!! We are visiting town, and my girlfriends and I absolutely loved every single thing we got. It was so fresh, and the flavors were so delicious! The French fry nachos, the chicken sandwich, the smash burger, the tots, the fish n chips. Everything was phenomenal and they were so, so kind!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaTV5MEdBEAE",
            "text": "Love this place. This is my second time coming and yet again another great experience. I got the Hilltops Finest burger with some seasoned tater tots. Everything was so good. I loved the greens on the burger that was a nice touch! I’m not sure what else was put on the burger but it all meshed together perfectly. The owners were so cool too, very friendly and gave great recommendations. I can’t wait to come back again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQakxhalBnEAE",
            "text": "Yummy food but we were unimpressed by lack of unique flavor. $12 burger with no sides but the atmosphere was really cool in their small shop on Sunset! Fun graffiti & epic creativity throughout their space.\n\nService was quick and very friendly! Family owned shop♥️ Food was good but expensive for what it was, in our opinion. The flavor is simple, yet they had so many things on the burger… More flavors/sauces/spice or smaller price would have bumped my 3 to a 5.\n\nWe got their Bourbon Burger “Hilltops Finest”. Had lots of caramelized onions which was awesome, but lacked spice or richness… Plain tasting, but solid burger. We also got their pretty plain tasting “Late Night”. The sauce tasted very similar to Big Mac Sauce from McD’s (which we actually liked) and was also filled with lots of pickles, too! Presentation was very appealing!\n\nI would like to try their waffle fry nachos or  “Wachos” sometime in the future✨\n\n4.3 overall which I’ll round to 4, particularly for food price vs taste. We enjoyed our experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6a3ZyTlB3EAE",
            "text": "If you live here or are traveling - support local and eat here!!! We were here from Northern Utah and had to try this place and so glad we did!! Everything was amazing from the personable service to the delicious food! My friend loved their gochujang fry sauce with the dry ranch fries and PNW fish tacos and I had the Wachos which were soooo good! We even got complimentary scones to try and they definitely beat the typical “Utah scone.” Whenever we come to St. George, we definitely will make coming here a tradition!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bV83R053EAE",
            "text": "Came all the way from Arizona. This place is fantastic! Atmosphere is so cool. Service was so friendly and fast. Spectacular! Got the hilltop burger and the fish tacos and they knocked it out of the park! Thinking about making the drive next weekend just to have this food again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOGRYNjNnRRAB",
            "text": "I love finding places that make so much sense but you don't think about until you're standing right in front of it.\n\nStreet Eats is an unassuming place next to a Pizza Takeout and a UPS store. We didn't even know what to expect as the menu offers both the mundane and the specialties you might feel that only your favorite spot can get right. While on future visits we'll try more of the menu on this trip we wanted comfort foods.\n\nMy wife got the Late Nite 2.0 which is fantastic short order burger, it's done perfectly on a short order grill top, it's the perfect amount of flare and flavor without making it snooty..... in short if you like a classic burger that isn't filled with organic garlic aioli sauce and tempura kimchi puffs this is a perfect burger for you.\n\nAs a side we shared an order of waffle fries Ranch flavored. They were hot fresh and crispy and more importantly quality. Fried foods have multiple levels and its easy to take the cheaper way out and they absolutely do not.\n\nFinally is the dish I was excited to see on the menu.... Baja Fish Tacos.\n\nFish tacos are something I love and want to have when I'm nostalgic over teenage trips up and down PCH..... its easy to try and make them overly fancy or add too much to them.... the focus needs to be the Fish..... these are fantastic. The fish was light and fluffy while being Fried to a perfect crisp.... they even have malt vinegar if you wanna give them more bite than the lime slice. The sauce they add is good without being over powering.\n\nI will eat here again and I hope other people give this a shot as its a great short order grill spot and something you kinda just need to go and enjoy.\n\nExpect to pay about $15 to $25 a person and while some might think that's a little high.....where else are you eating other than the value menu of a drive thru? It's good and worth the time and the money!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbHVtYzVnRRAB",
            "text": "Found Street Eats via a Reddit recommendation and have zero regrets. I had the Hilltops Finest burger, and it was deliciously messy. Husband had the Late Night and enjoyed it, but said my burger was better. I didn’t expect that even the salted waffle fries would be such a pleasant surprise. Only downside was that we waited about 45 minutes for our food because they were slammed, but it was a nice day so we didn’t mind waiting outside."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOGNLWHhnRRAB",
            "text": "I went here with my grandpa. I got the Wanchos, he got the fish n chips, and we got some salted tater tots to share. To start, the Wanchos were great. There was a good amount of cheese and other ingredients that I was able to just mix it all over my waffle fries.\nI really liked the tater tots as well. They had an amazing crisp and weren't over salted.\nAs for the fish n chips, my grandpa wasn't a big fan, but he said it was just because he didn't like that type of batter. I tried a piece and I thought it was pretty good as far as fish n chips go.\nThe employees were friendly and the atmosphere was comfortable to me. It might've helped that we were the only customers there since it was near closing time.\nOverall, it was a good experience and I'd go back to try other menu items."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTmRETlhSbTVyTXpRNFJIaEpYMnBsTm1kUU5sRRAB",
            "text": "Pretty cool spot. The vibes were great. The food was refreshing and delicious. I ordered the wedgie (lettuce wedge) with ranch instead of blue cheese and it surprisenly hit the spot, refreshed my body and re energized me. I feel like i ate so nutriciois. My biddy got a burger and fries and upon looking at his food, the birger seemed to be made of home made ingredients. Even his pickles looked homemade, my ranch dressing had a great smell to it i could only assume that was house made as well. As a person who doesnt eat processed foods, this was a great spot to nurish my body with great delicious food. I will have to try again before returning to Texas to see what else they offer. Thank you"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0d19QNDdRRRAB",
            "text": "Cool little place, worth stopping in! We didnt know what to order so we asked for suggestions. I ended up with the Korean beef tacos and my hubby got a burger, we shared an order of waffle fries. The food came out pretty quick and the portions are a good size. Everything was really good, we'll definitely come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeWRESnRVVXR2YUhwUGVrTm1SMU53VjJselNWRRAB",
            "text": "Excellent food: definitely from scratch, so plan on waiting longer for your food, but you can taste the difference. I lived in Portland for 10 years and this place reminded me of the elevated and creative food scene there. Unique classics, subtle layers of flavor, cool vibe. Really solid food. I’m definitely coming back. The cauliflower was amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqZzZ1NDF3RRAB",
            "text": "Really good food for really high prices. The burgers don't come with a side. And $6 for waffle fries is insane. The bourbon burger was delicious, but it cost $14. The fries were great, but cost $6. $20 without a drink (before tip) and I could have eaten more easily. We were caught off guard they closed so early at 7pm.. and they had sold out of quite a few things when we got there at 6:30. I would recommend going once during lunch when they're fully stocked and giving it a try. You'll probably love the taste, then you can decide if your wallet loves it too."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJel9DZUVnEAE",
            "text": "What a great place for a delicious hand crafted burger!\nMy wife is a bit fussy and she really enjoyed their Pike salmon burger!\nTheir waffle fries are a tasty treat too!\nStop by and give them a try, I'll bet you have a new favorite place to go!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRGNUbDNjVkpHUTNGNVpIZGpRME5XUm14SGVHYxAB",
            "text": "Street Eats is fine but probably more exciting if you live in St. George and want something trendier than the usual. The vibe is new and hip which I get is part of the draw.\n\nFood-wise it was hit or miss. My fish tacos came on three tortillas. One was oddly crunchy while the other two were soft. We also had a burger, kids burger, one appetizer, two beers, a cocktail, and a couple sodas. After tip it came to $103. I actually enjoyed my cocktail, the Midday Marg, the most out of everything.\n\nThere was a 35 minute wait which wasn’t terrible considering the space is small. Found out you can make a reservation once we got there. Service was decent but nothing that stood out.\n\nOverall not a bad spot just not one I’d go back to."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGME9hWXdBRRAB",
            "text": "Street Eats is phenomenal. The food is absolutely delicious and prepared perfectly. I ordered one of their gourmet hamburgers and I can honestly say it's the best burger I've ever eaten. And I'm very picky. I highly recommend that you give this place a try. And please be sure to come back and give them a solid rating. Tell your friends all about it. This restaurant is a rarity for our community. It is locally owned, and the owners work the kitchen and the counter. You will not be disappointed. I was so excited by the food I forgot to take pictures of it lol. So I'll definitely be going back here soon to rectify that."
        }
    ],
    "reviews_count": 65
}