{
    "name": "Wood Ash Rye",
    "place_id": "ChIJa5PLkc9EyoAR975V79jfREw",
    "grid": "SI1",
    "address": "25 W St George Blvd, St. George, UT 84770, USA",
    "rating": 4.3,
    "user_ratings_total": 890,
    "phone_number": "(435) 522-5020",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOblVGOXdVakpmYlUxdVRXMVBhM05SU1dKeFZXYxAB",
            "text": "I was invited to a business presentation and dinner at this wonderful restaurant. The service was impeccable, and the variety of menu options was quite impressive. My colleagues loved everything that they ordered even though they have \"refined tastes\" and are often critical of what they're served in fine dining locales. I have some dietary restrictions, but the superb chef prepared menu items in such a way that I, too, could enjoy them! It seems to me that some of the critiques shared in a few reviews were most likely \"planted\" by competitors within St. George's fine dining scene. Whatever- enthusiastically recommended!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WVduQlZRMlJMTW5sRlgzVlZaRmRzTmtkTldXYxAB",
            "text": "Absolutely incredible dining experience! The new menu is a total win — the elk gnocchi was rich, perfectly seasoned, and unlike anything I’ve had before. The filet steak was melt-in-your-mouth tender and bursting with flavor — cooked to absolute perfection. You can tell there’s real passion behind the food and attention to every detail. The atmosphere was warm and welcoming, and the service was just as impressive. Highly recommend giving the new menu a try — you won’t be disappointed!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prd2NVZE9WRXRmWnpObmREbE9UMnRXUm1kcGIzYxAB",
            "text": "We had a big party, and ordered just about everything on the new menu to share. Best food in town! Best food in the state. We were blown away. Shout out to the executive chef Jason."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psT1MxOVNSVU5TYVZCTGNURmhhbW93ZEZWRWJsRRAB",
            "text": "May this message reach your heart as a sign from God, guiding you to the right path.\nIslam is a faith of peace, beauty, and truth — the true religion revealed by Allah.\nWe believe that Jesus, the son of Mary, is a noble messenger of Allah, and that Prophet Muhammad (peace be upon him) is the final prophet and a devoted servant of Allah.\n\nIslam teaches love, mercy, and justice. It calls us to live in peace and goodness, always remembering our Creator.\nWe stay connected to Allah throughout the day by praying five times, seeking His guidance, mercy, and blessings in all that we do."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMmJ6VjBXSEYzWkhKeFpVMUZhSEp5Y2w5U1MzYxAB",
            "text": "Absolutely divine. My husband and I ordered the filet mignon, brussel sprouts, pork belly tostadas, french’d onions, spiced carrot cheesecake, and fruit lemonade. Everything was amazing. Smaller portions but the focus is quality over quantity. It was the best meal we’ve had in a while. We’ll definitely be back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTGQxbHpSVXBsWkZKamFUWmtaMnhCT0ZkTGJWRRAB",
            "text": "We went for the first time for dinner to WAR and brought friends a couple of weeks ago. We had met Kyler, the F&B Director, who invited us to come for dinner. We weren't disappointed, we were thrilled with the excellent service and a delicious menu! I suggest the Pork Belly Watermelon. It's different with its contrasting flavors and so yummy. We're so happy to have met Kyler and this will be one of our favorite go to restaurants!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ndFdrOU5hRnAyWjBsaVNqaERiV0ZqTTNONGExRRAB",
            "text": "We came with a group of 20 people for a bachelor party. Very impressed with our service and the kitchens ability to keep up with all of us. The food was fantastic, and just kept coming and coming. Like, EVERYTHING, was delicious and they did an amazing job accommodating all of us! Highly recommend"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNE1XazJUMnRVYkhCYVVFdFNRazFIZWxwSVRIYxAB",
            "text": "The food was top notch. Awesone service and vibe too."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQ2VuQjJZMDVmUlVkTFRtMDNaMVV3WTBGTFZGRRAB",
            "text": "Pathy was the excellent server and we will definitely come back to see her. Thank you for the lovely food & service!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScGFHaEphMUpSTVZaeGJrcHVlSGRaZFVvNGQzYxAB",
            "text": "We loved the food. We had the filet, shrimp, Mahi Mahi and scallops. Each were very tasty. Loved the muffins and the watermelon pork belly. The only criticism were we felt the portions were a little small for family style."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSmRUbElRVUZhUkdjeFIxWldjemhSY1VwS1JrRRAB",
            "text": "We stopped by for the Octoberfest specials and everything was PHENOMENAL. The elk and sauerkraut fritters were a favorite among my family and myself. Our server Parthy was so kind and did a wonderful job with our big party."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5d1YwZHZabEpLVnpNNFdGVlRYMWR4U2poc1JVRRAB",
            "text": "Must get watermelon pork belly and rib eye. Drinks are fantastic, and great atmosphere.  Parthy was our waitress and service was great.   We’ll definitely come back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dmR6UTNaVEpCYWxaWmNVRm9aMFJvYVUwNFVWRRAB",
            "text": "I would give them a 5 star review except we were served warm beer in cold glasses. The food was great though."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twb1ZUaDNUMWxETm1OSFozRmZSbDlZUzE5amVsRRAB",
            "text": "This is one of our favorite spots in St George. I wish they wouldn’t change up their menu as much as they do though but at least they always have the biscuits. Could improve on consistency as well, something will be amazing one week and just ok the next."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twb2IwMDBSbUZzU1hoeFdHbEdhR0V3TkZBMlJIYxAB",
            "text": "Beautiful restaurant. Great atmosphere, food was amazing. Service was great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMU9WVk1UekZaZDBOdFJFRmFWa1pPTWxCc2VYYxAB",
            "text": "They made me feel extremely welcome and well taken care of when I came in for my birthday. They even went as far as getting me a card and having everyone sign it! Food was absolutely delicious the filet mignon was super tender and delicious. Would highly recommend, also Daniel was an amazing server and super attentive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeVUwZDJkRmh6YzBsaVUzQTRUMTlYV2tSdVUwRRAB",
            "text": "If you happen to dislike salted food and alot of salt don't go here. Everything is salted. The bisquits are toped off and packed with a salted top. If a restaurant has to salt to the level this restautant provides get better chef's. My wife and I had to get up in the middle of the night to drink water and a lot of water the next day to leech out all that sodium we were subjected to at Wood Ash Rye. The service was fabulous btw."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSFlYZFJVV2hrU2xkTmJGVnRTazlEUTJ4Vk1IYxAB",
            "text": "Easily the best meal I have had in years\nExcellent food, concept and vibe"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUk0wUnhaemxaWW05eVNuZDFWMWxqTjJKQ01YYxAB",
            "text": "Do I dream about this place? Yes, yes I do. Those biscuits. Ugh. I am so sad they took their croque monseiur off the menu. SO SO SAD, bring it back!!\n\nWas here a week ago for dinner and ordered the watermelon pork belly—drooling! It is a must try. We also ordered the Brussels sprouts (needed more goat cheese but still so good). So so so good. All of it.\n\nI also love their grilled chicken salad for lunch.\n\nUpdate: went for brunch on Saturday. Ordered their French toast. Delicious! Same compote sauce for the biscuits but add syrup. I’d probably ask for a side of butter next time. Otherwise, absolutely delicious. 10/10."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwd2NERXdlbVJFUkhNeFRqSTFPVUUxWDJGT1VtYxAB",
            "text": "Chef Jason and his team (our server was Jace) served up an exquisite dining experience tonight! This was our first time dining here and we highly recommend Wood Ash Rye. So much heart, soul,  intention and purpose went into the careful crafting of flavors, vegetables and proteins. Thank you! As my 9 1/2 year old daughter said this evening of all the dishes, you are G.O.A.T.E.D.! Thank you, again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQ04yZFBRV3hZUkdWYVJYWlhSVXR6VGxNME1IYxAB",
            "text": "My husband and I went here to have a date night after our destination wedding in Utah. The food was incredible and service was great! I am gluten free and they had great options for dietary restrictions. We got the shrimp, filet, and brussel sprouts. My husband is a huge steak guy but we both LOVED the shrimp and highly recommend the brussel sprouts. Perfect place for a date night!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNFUxUXplVEkzYTFsMVZ6VmpjbVowY21sdlUyYxAB",
            "text": "Nestled in the Advenire Hotel, this is the kind of place once you’ve eaten here, you can’t stop thinking about it. Their croque-madame smacks of real care, the biscuits are flaky-sweet—that “just baked” kind, and the bartender’s knowledge of local spirits makes the cocktails feel like a homecoming. It’s fancy without feeling untouchable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaVVGWkxRVTE0T0dGME9VUlZVRlp3WlMxQmEyYxAB",
            "text": "We had dinner and breakfast with a group. Stevie was our meal organizer and server. She was amazing, went over and beyond to make sure we were happy. The food was so delicious. The homemade biscuits were the most delicious I’ve ever had! Same with the breakfast scrambled eggs, and I usually dislike scrambled eggs. Five stars all around for atmosphere, food and service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5SE1sOXVUVFZRY20xYWRrTTNURFpLVlVrek5tYxAB",
            "text": "The arrachera sauce on the carrots was my personal mouth watering favorite. The restaurant provided a stunning ambience. Cherry on top, the owner Jason took the time, after getting wind of our intrigue of the specific sauces, to come to our table personally to discuss and share the kitchen’s secret. And he most certainly didn’t stop there. He Invited us to try an off the menu item his dessert chef was currently working on. We soon discovered they are working towards creating a gluten free menu for those that would want or need such careful preparation of food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5R1ptSnFWMlUyVUhkaFQzVkZiMUExVDE4MFFuYxAB",
            "text": "Outstanding Brussel sprouts! Excellent service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNWVrb3RVSFZNYmt0dFp6TkdUMDV6ZWpORVlsRRAB",
            "text": "Phenomenal! Chef Jason and his staff did a great job putting together one of the best meals I’ve ever had. Pork belly watermelon is my new favorite! The warm biscuits are the best I have ever had. The ribeye was perfectly prepared and delicious. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201b1NIVTFNR1ZTZVd4aE1WcDNjVTVDYkVSYVZXYxAB",
            "text": "Flew in from Hawaii.\nGreat atmosphere.\nStaff very friendly.\nChef Jason was SUPER COOL!!\nMAHALO!!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdEpEbzZ3RRAB",
            "text": "Great food and great service\nBest pork chop that i have ever eaten.\nThe waitress was so nice and helpful. I can't wait to go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUFJUQnVVbGhXY2xSa1l6UlFkaTFqVmtnM1ptYxAB",
            "text": "Oh my GOODness this was so great, fluffy biscuits, perfect gnocchi, delicious carrots, great service by Jaxon, magical gluten free apple fritter by Bailey, and such hospitality from the owner Jason!! Also such fun ambience let’s be real. Please go here now. Thx bye"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeE1qZ3hUMGxMWDBkcGJUVnplV0pJVVhGVFFVRRAB",
            "text": "We dined at Wood Ash Rye for our anniversary, and it ended up being one of the best surprises of our trip as we had a less than desirable experience a newer \"fine\" dining restaurant a different day. This wasn’t a planned stop—we were actually referred here by our hotel’s front desk host, who also made the reservation and let the restaurant know about our celebration. From the moment we arrived, the team went above and beyond to make us feel special.\n\nWe were seated at a small, more private table set away from the busier dining area—a thoughtful touch that felt intentional. On the table was a handwritten card congratulating us on our anniversary, along with a note that dessert would be on the house. Those little details really set the tone for the night.\n\nOur server explained that the menu was meant to be a shared dining experience and gave us some great recommendations. We ordered the seasonal brie, mashed potatoes, filet, and gnocchi. While we were waiting, the head chef stopped by our table and generously offered us their Brussels sprouts dish to try, on the house. That gesture alone was memorable, but the food itself was incredible. The standout dish for us was the gnocchi—absolutely phenomenal and something we could not get enough of.\n\nTo finish, we tried the hazelnut, cocoa, and chile pepper crème brûlée. At first we were skeptical of the flavor combination, but it completely won us over—it was rich, unique, and delicious.\n\nEverything about this dinner—from the service, to the chef’s thoughtfulness, to the quality of the food—made it a highlight of our anniversary trip. We highly recommend Wood Ash Rye to anyone looking for an elevated, shared dining experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JM2VrWkZOa1kxVUZad2VuQkJTakZJYTJNM2FYYxAB",
            "text": "We had the most amazing experience!! I made a reservation for 25 people with one days notice and they made it happen. Sadie and Carie were on top of it. And STEVIE!!! Omg this young lady was incredible, the flow of food and drinks was nonstop. It was like there were five servers but it was just Stevie. Food was amazing and delicious and the drinks Daniel made were so tasty. I highly recommend Wood Ash Rye if you are in the St George area.\nGary & Connie Schultz"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TFVGRklZWFpYTFdOMGVYbFJlVkpQVTNOZlJFRRAB",
            "text": "Ive attended several Zion Vineyards Wine Pairing dinners with two different chefs and both meals were outstanding.  Shout out to our outstanding server, Summer; you are a treasure!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSVZuSk1MVEUzVEdsSk5tOWxWbkZhYlRVeVIyYxAB",
            "text": "The food is awesome! We had the Brussels, biscuits, falafel, pork chops and crème brûlée…all were winners and best of all was our server  Summer! She was absolutely awesome!!! 5 stars all around!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUlEzWmtNQzA0UVRGRFZERkxOWEJaWnpCeldVRRAB",
            "text": "Every time I’ve eaten at Wood Ash Rye it has been a phenomenal experience. The food today was exceptional. The sous chef, Cody, was friendly and talked us through some of the specials, and our waitress, Summer, was very good. She was extremely friendly, knowledgeable of the menu, and attentive. I’m really looking forward to their new menu that they said they are releasing in the fall."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCT05UUTRiMEpQUXkxSlZVb3dURmwyYjBnek0wRRAB",
            "text": "From the appetizers to the dessert, everything we ate was flavorful!  The Lobster Risotto created by Chef Jason was delectable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNE5tVnZia3A0UW5OdVJHOXlaRmswWkdvM1oyYxAB",
            "text": "Great meal! Accommodated our large party of 12. Service was excellent. Would return next trip to Saint George."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcGQwdDFYMU51Y0RGemJYaHNVM0JoVm0xMGFtYxAB",
            "text": "Amazing food and even better service. Head chef Jason stopped by the table to make sure everything met our expectations - and it did! Delicious meal and would come back again in a heartbeat."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkU2RUWTFWRUpGYTFoRU1EaEljMWxhUlRkcFdtYxAB",
            "text": "Zion Vineyards has done many wine pairing dinners with Wood Ash Rye,  they have all been great. This was our first dinner with Chef Jason and he knocked it out of the park. Our server Summer has always done a top notch job. Thank you for the wonderful experience.\n\nRobert Cec,  Winemaker at Zion Vineyards"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeWJXeFBXR0ZoYW5aQ1UxSk9TSHBPVDNveVgwRRAB",
            "text": "Been a regular at the Zion Vineyard wine pairing dinners. The food and wine are EXCELLENT! It’s on of my favorite places in town for upscale atmosphere, amazing food and great drinks. Great for date night or a business lunch."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMWEyWnpjRTF2Ymt4MGIyY3lTMnhqWlhsc1gxRRAB",
            "text": "Jason is an amazing chef. The wine pairing dinner with Zion Vineyards was fabulous! 5 course meal with wine pairing every third Thursday of the month. Tickets limited."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wek1qQkJWV2xqTW5SUlJIbzRURU5tVXpkeGQxRRAB",
            "text": "The best place in St George! The biscuits are huge and flaky / fluffy!  You can’t go wrong with anything on the menu! The dessert is amazing! Really good  vegan and gluten free options. It’s a must stop!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdGFIRnpSV1JKYkdad1psOXJWMDR0VERKTE1FRRAB",
            "text": "Excellent experience and one of a kind food.  If you are looking for a break from the run of the mill dining experiences this is the place.  Flew from NJ to Vegas then drove to Utah for my nephew’s White Coat Ceremony.  Picked this restaurant on a whim and am sure glad we did.  All dishes have an excellent presentation and are table “shareable”."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJck8taTZBRRAB",
            "text": "We were on a weekend trip to St. George and decided to go to brunch since we've wanted to go for quite sometime. Unfortunately, the experience was mixed overall.\nLet’s talk about it!\n\nFirst and foremost, the food was great. We had got eggs Benedict, croquet madam, pancakes, and biscuits & gravy. All of which were good. Especially the croquet! The biscuits were super good as well. But the hollandaise sauce on the eggs benny was cold which I thought was weird. Although, all of this was good, we got to the restaurant at 1030am and was only presented a breakfast menu. Odd since it clearly says breakfast ends at 10am and brunch starts at 1030am. We made it work but still would have liked brunch options as advertised which is why we made a reservation in the first place.\n\nThe service is what lacked here. We would have expected so much better from an establishment like this. At first, we were passively greeted by 3 different people which told us \"someone will be with us shortly\" and waited several more minutes. After which, we were seated and presented breakfast menus (odd since this should be brunch). Our sever was nice, answered our questions, and took our order quickly. After that though, we basically never saw her again. She dropped off our drinks and never followed up or even brought us our food (a runner did that). Never asked how the food was, or if it was right, or if we needed anything else (which we would have loved more syrup), and didn’t refill ANY of our drinks. We only saw her when the check came and she didn’t ask anything about our meal… Also, the other waitress working in the area was unbelievably non-personable. The table next to us seemed to be unattended just as much as we were. It was just odd overall. We would’ve expected something better for an upscale establishment  like this.\n\nOverall, the food was good but buyer beware of the service. There is some serious opportunity for improvement here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa05IVnNnRRAB",
            "text": "Owen was so extremely kind and attentive!! 10/10 recommend this place for breakfast! We were staying at the Avenir hotel by Marriott and this restaurant is on the ground level. Depending on your Marriott status, you can either choose a free continental breakfast or points. We elected to choose the points so that we could experience the full menu at this restaurant. The eggs Benedict was to die for! My son got the chicken tenders, which was available on both the breakfast and the dinner menu. Very good! Crispy fries are our favorite. And then I got the continental breakfast and it was perfect! The atmosphere is warm and inviting with a very cool and upbeat vibe! perfect for a beautiful morning in St. George. Thank you for a wonderful experience Owen!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkS1NGaENXRzB4YzJoclZGaG1kSFUyVm14WWRsRRAB",
            "text": "What an incredible dining experience!\n\nDining at the chef’s table was so immersive! It was so entertaining to be so close to the action. I met Chef Jason who just recently became head chef. It was a pleasure to watch the team work in such synchronization. You can tell the team has great chemistry!\n\nIt was also a privilege to be given samples of a few of their dishes. I was planning on ordering two dishes. I knew I wanted to try the Quesabirria. That was great. When I tried a sample of the Gnocchi, it blew my mind! That one stole the show.\n\nThe Gnocchi which features braised oxtail, gremolata, sherry wine crème sauce is one of the best pasta dishes I’ve had in Utah, possibly ever. The noodles were tender but delicate. The sauce was rich and creamy, but also light in a way. The oxtail was incredibly tender and flavorful. I’d highly recommend ordering this dish if you’ve never tried it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NEluMktBEAE",
            "text": "Best dining experience I’ve had in St George. Food & service was fantastic. Plates are to be shared. Gnocchi with oxtail was fabulous, it’s a must have. LOVE that they have warm chocolate chip cookies & cold glass of milk for dessert. Summer was a wonderful server. She knew her stuff and was very personable. Can’t wait to go back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdmJUQjFiMDVMVTBWcVFsRlJVRWR6UzFsdk9XYxAB",
            "text": "Great atmosphere and great food. The suggestions of the gnocchi and the watermelon pork belly from our server Miah were spot on. We were also treated to several surprises complements or the chef. Thanks for the wonderful evening!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMFIwWkJORXBXWlVONVdtdDRiVU5uVEdsVmVFRRAB",
            "text": "Their head chef changed this past month and Jason is amazing. He kept some old favorites and made them better and I’m super excited for his dark cocoa tart. He served it at a special event and I can’t wait for it to be on the regular menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIc1lXRERnEAE",
            "text": "I recently had the pleasure of dining at Wood Ash Rye, and I must say, it was an experience that exceeded all expectations. We visited for brunch one day, and then for breakfast and dinner the following day, and each meal was a delight.\n\nThe flavors in every dish were outstanding—every bite was a testament to the chef's skill and creativity. From the vibrant, seasonal ingredients to the masterful seasoning, the food was nothing short of spectacular.\n\nBut what truly set Wood Ash Rye apart was their exceptional service. We were celebrating our 38th wedding anniversary, and it was clear that the staff went above and beyond to make us feel special. They overheard us mentioning our anniversary and, as a lovely surprise, treated us to a complimentary dessert each. To top it all off, we received a heartfelt card signed by the entire staff, adding a personal touch that made our celebration even more memorable.\n\nWood Ash Rye isn't just a restaurant; it’s a place where great food and thoughtful service come together to create unforgettable experiences. I can’t recommend it highly enough and look forward to our next visit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd0ltaExnEAE",
            "text": "If you are looking for a date night with elevated food, come to Wood Ash Rye for a quaint homey upscale experience. Highly recommend the Pork Belly Watermelon.  I know, it sounds strange BUT it is delicious! Cheers!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycmI2bnJ3RRAB",
            "text": "Amazing! Their serving concept is sharing so you will share all the entrees and appetizers with your whole table. In other words, it’s family style servings. The food was amazing. The chef gave us a free house salad which was very tasty. We got the duck tacos which were delicious and the pasta special which was a ravioli. Our waitress was super cool and we enjoyed chatting with her and making small talk and she also really took care of us. We tipped her well of course! Do yourself a favor and try this place out."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaG9HcXJRRRAB",
            "text": "We decided to have dinner here after it came highly recommended. We called and got a reservation, which I would recommend. Our server, Ashley was helpful and very attentive. She explained how all menu items were fresh and homemade, from their pastas to their sauces, and everything in between. Plates are meant to be shared, similar to family style dining.\n\nWe ordered the cheese and bread board, Brussels sprouts, chicken, pasta, cheesecake, and panna cotta. The star dishes were the Brussels sprouts and the pasta. So good! Everything was high-quality and tasted amazing. If I had to order again, I would have tried the grits and shrimp instead of the chicken. The chicken the most underwhelming dish that we got. But it was still good."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaTQtVGVREAE",
            "text": "We visited W.A.R. when they were still in their cold open.  Only a few menu items were available as well as just a small beer/wine selection.  While that visit didn't blow us away, we agreed to return again once they were fully up and running.\n\nOkay, so it took us a while to return.  We invited another couple along for dinner and made reservations for when they reopened with their dinner menu.  Our friends had arrived before us and I was glad to see they were already seated at our table, We were seated centrally on the street side and able to overlook the dining area and the cooking area, which was spotless while the chefs and cooks worked their magic.\n\nOur waitress arrived cheerfully and promptly, inquiring about 1st timers, or past experience.  She very clearly explained the special and how the dishes were essentially tapas style for 2, freshly prepared and depending on cook time for each dish, they may be tabled seperately.\n\nLet's talk about the drinks.  Lemonade and tea for our friends, they were very pleased.  My wife ordered from the specialty drink menu.  She absolutely loved it.  I ordered off-menu, a Whiskey Sour, after being assured they prepare it with egg white.  Our waitress asked my preferences -brands, rye or bourbon.  I appreciated her knowledge.  It was one of the best I have had. Great drinks.\n\nWe came for the food.  Between the four of us, we shared the roasted brussell sprouts, biscuits, pasta with chef's choice portobello mushrooms, and the roasted carrots.  I would be typing into tomorrow to give adequate detail of each delicious dish.  I thought I was the roasted brussell sprout master until now.  So good.  The biscuits were the size of my fist, lightly salted and buttered on top, soft as a pillow on the inside.  The housemade large flat pasta with the portobellos made me want to slap someone.  The sauce was so good, I would have licked my plate clean had we not been in public.  The roasted carrots came with a well prepared chimichurri and cotija cheese, cooked to al dente and just unbelieveable.\n\nHad to pass on dessert, because no one had absolutely anymore room.  Being that full would not do it justice.\n\nOur waitress was right on top of everything during our visit, refreshing drinks. clearing the table and getting the check paid.\n\nI read the past lowest Google reviews before we came this evening, because, well, just because.  Those reviewers were either in a different restaurant, or the owner/manager made good on all of the responses to ?take action to improve.  Bravo, Wood Ash Rye.  A diamond in St. George."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZ2Z1Z1BREAE",
            "text": "We had an absolutely fantastic dining experience! The food was nothing short of excellent, with unique flavors that really stood out. One of the highlights was definitely the accommodating staff. The restaurant has this cool open kitchen concept, and Chef Cody was incredibly flexible. When he found out my husband couldn’t eat cheese, he went out of his way to bring us a special dish that isn’t even on the menu yet—set to debut in the Spring! It was exactly what we were craving.\n\nWe tried the filet mignon and the short ribs with succotash, both cooked to perfection, along with some roasted carrots and the house bread. Everything was amazing!\n\nOur waiter, Connor, and hostess, Charlotte, made the experience even better. Their friendly service rounded out our 5-star night. If you’re a fan of great food at fair prices, we wholeheartedly recommend checking out this place!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bE5tZU1REAE",
            "text": "We did a Sunday Walk-In on a busy weekend so please look at my review from a position of they were busier than usual but that wasn't reflected in our vantage of the situation.\n\nLet me start by saying if you're a fan of Bloody Mary's theirs is top notch. First its not V8 it's juiced tomatoes. It's a very healthy spicy (I did not need to add any extra heat) and it was tasty in terms of it was a Bloody Mary but not theirs is distinctive which is hard to do with a Bloody Mary.\n\nThe Mimosa was well made too, but what you expect when you pay premium price for a Sunday mimosa.\n\nSo when we arrived we were asked if we had a reservation....which we did not... we tried George's across the street and they were PACKED, so considered W.A.R. because it didn't visually look as busy. We were told we could eat at the bar and we opted to eat on the patio. Service was provided by the bartender and he was friendly and professional..... he was just possibly over busy.\n\nWe had ordered an appetizer which perhaps was forgotten, he didn't write any of our order down so perhaps it was just overlooked.\n\n3 of us ordered the same thing.... the Eggs Benedict, wich were VERY good and done well, the hollandaise sauce ON the dish was excellent.... the extra side we asked for was not as well done and a different color so perhaps was not from the line.... who knows... it was still good.\n\nThe forth dish was a Croque Madame and it looked well made but looked more like a version of avocado Toast with eggs instead of avocado. I was assured it was tasty.\n\nAll the food we ate was amazing. Simply put the food is fantastic. The service was friendly but not very attentive which we believe was due to it being a more busy Sunday than they were perhaps prepared for.\n\nThe atmosphere was fine but nothing special, no music, no environment but we perhaps were expecting too much from the patio section.\n\nThis review is based on first impressions and may change with further visits.... which there will be because the food was good.\n\nExpect to pay $20 to $30 a person for brunch and while the servings are adequate the selection is primarily specialty breakfast items.... don't expect the Denny Grand Slam as an option.\n\nFirst impression is a 6.3 out of 10 would try again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbzVtajlBRRAB",
            "text": "Loved all the food. Great ambiance. Beet salad, lemon pasta, half chicken in the cashew pesto sauce, salad, brussel sprouts were all delicious. Ashley was a great waitress."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bUpHUVhBEAE",
            "text": "My boyfriend took me here for my birthday, this was the first time we had eaten here. The food, staff, and atmosphere were amazing. Large portions, fresh ingredients. The drinks were great. I highly recommend you have a reservation as the couple in front of us were told without a reservation it would a 2 hour wait."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIa3RDYkpBEAE",
            "text": "What a great restaurant! My wife and I decided to try it after a recommendation from a friend and wow was it amazing. The atmosphere is modern but not too trendy. The servers were friendly and our reservation was sat almost instantly. They have a good selection of drinks. We ordered a few items: the mashed potatoes, charcuterie board, and steak. Everything was amazing - the steak was cooked well and melted in your mouth. Paired with the potatoes - one of the best dinners I've eaten. Well priced for the quality of food you get as well! We finished it off with some dessert which was equally as delicious. We will definitely be back, and we'll be bringing friends!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pob1ZIaDZNV1ZIZEU5QmRHOVZlR3RxTmxSVU1rRRAB",
            "text": "Went to dinner here with 5 ladies on a girls trip for a birthday! The atmosphere was cute- in a Marriott hotel, with great decor. Although the drinks were just OK (lemon drop, gin drink, dirty martini, espresso martini), the FOOD was absolutely delicious. It was tapas style, so small plates to share and we pretty much got everything- even the CARROTS were amazing. The pork belly watermelon was to die for, the filet we shared at the table, the scallops, the mashed potato side, the Greek fries (have a bite!)..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1X3Rtd0pREAE",
            "text": "Every item on the menu we tried was delicious. Branden was so good to us as a server and we will definitely be back to try more! The restaurant is shared style so we ordered items for all of us to share. We got a lot and had a bill total of about $50 per person, but you could definitely do less!\n\nOur favorite item that we tried was the crispy Brussels sprouts, stunning!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIam9laGt3RRAB",
            "text": "The Duck Tacos, as recommended by others, were great. Perfectly done fork tender duck, miildly spicy sauce, and the crunchy accompanying slaw were sufficient to fill 8 street taco-sized tortillas. Enough for a meal for a solo diner as I was. Note that these werw part of the \"Social Menu\" and recommended for sharing.\nBut the crowning achievement to me was the  Dolce de Leche Panna Cotta. Recommended by my server, Miah, who was perfectly attentive herself. That dessert was a religious experience. I held myself to slow, small bites to savor the joy. I will be back next time I'm in Utah.\n\nVery highly recommended!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NDRDRTdnRRAB",
            "text": "Had dinner here recently and I sadly just wasn’t impressed. The restaurant is really cute and the atmosphere is amazing.\nThe biscuits and Brussels sprouts were amazing.\nI had the filet mignon and it was pretty good but all of our tables food came out at different times.\n35 minutes between the first entree and the last entree.\nMy drink was always empty and had to flag the waitress down for a refill (it wasn’t busy) it was also pretty odd but they never cleared the dishes from the table. It was getting crowded and I eventually had to stack them all up and flag someone down and hand them to them."
        }
    ],
    "reviews_count": 62
}