{
    "name": "Spitz - St. George",
    "place_id": "ChIJ890YbgBbyoAR1wVZc2T_TUQ",
    "grid": "SI1",
    "address": "1543 S River Rd Unit 6, St. George, UT 84790, USA",
    "rating": 4.6,
    "user_ratings_total": 65,
    "phone_number": "(435) 243-7771",
    "reviews": [
        {
            "date": "16시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xc1lXdE5SRUV0VW10b05UVllVR3htZUhSclJrRRAB",
            "text": "Whether it’s been dining in, delivery or take out, each time has been exceptionally quick and food was warm and delicious."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMVZFaENNRkJoVTNwVE5FMTRiVGQwYjJ4dmJVRRAB",
            "text": "Fun vibe! A little pricey"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SlRrTnRVREV5VTNaNE56WnJhMU5qZEROaFlXYxAB",
            "text": "Stopped in for our first time we loved our experience and the food is amazing, as well as the sangria."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aU9GZG5abTVKVlhrMk1uWmplRTV6Um5rdFpVRRAB",
            "text": "Double check your order before leaving!!!We ordered for the second time ever, last night.  They left off the feta and olives on our fries.  I called to talk to the staff about it.  No way to reach a person.  The phone is a recorded message and you can’t leave a message.  I sent a message on the website, no response.  I think the follow up is crappy. Double check your order.  Food is great when it is made accurately.  $58 order but $16 fry was disappointing."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSFJTMWxWbmRaT1c5R2JrOWZUbWRuYTNaTVMyYxAB",
            "text": "Super cool place with awesome food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdFV6bHFkbFZtUnpGTmQzRkNYMFpSVFZSMmJYYxAB",
            "text": "Good food all around. We will be back for sure."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeGIwUjFYMDVUY1haRVMwaHFOWFJPU1ZFemJFRRAB",
            "text": "Street Cart Fries! 🤤"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaVMxYzNSa0ZoV2sxRGIxaHBjalJZVVdFdFpsRRAB",
            "text": "The Berliner wrap was good but the pricing is way too high. I hope they are able to make it but 19.95 for combo is terrible pricing. Edit, ate here for a second time, meat portions are pathetic. 13.50 for a Gyro with a tiny amount of meat is a joke. The Gyro meat was barely warm, probably will not come again. Super disappointed as this is my favorite type of food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWk4wZzNOMUY1WDJSM2RraHZlbVJaVUdGMmVHYxAB",
            "text": "Very nice customer service. Food was given in record time."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tod1RVMVVWalZtY0U1a1pqbHhMVnBvV1VSVGVGRRAB",
            "text": "Truthfully, I really enjoyed Spitz. The food was exactly what'd want when choosing Mediterranean. Im definitely going back to try more options on the menu."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUUxXRjVaMHd6U3paMFlscERkMU5OTTFCS2IzYxAB",
            "text": "while the other mediterranean restaurants have removed vegetarian items from their menu i was super excited to see how vegetarian and vegan friendly the new restaurant spitz is! i got the berliner falafel wrap combo with fries. it was delicious! the sauce the fries came with really took it to the next level.\n\nit is on the expensive side ($20 for a wrap, fries, and soda) but the portion was large. i would love if they offered smaller portions since i could only eat half.\n\nstaff were very friendly and the decor is super cool!\n\nwill be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kak9ETXpTR2N0UmtWdVZFYzBjMkpLYjBNdGMwRRAB",
            "text": "Sure cool place and great food!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bldrc3dPWEkzUW5sRVFteFFURUYzYjNsYU9VRRAB",
            "text": "DELICIOUS 😋 And everyone was so nice! Definitely give it a try!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMmNtMWlaMHRSTVdwV1UxcHFVVUZGVHpSQk5tYxAB",
            "text": "On point! The food is excellent. Fresh, flavorful, and great portions.\n\nAtmosphere is somewhere you could spend time hanging out with friends whether it’s watching a game, going out with friends for drinks, or having a nice meal with the kids.\n\nService is great and food came out fast. There is not much like this in ST. George. Super excited and will be back a lot!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQ2RHSnpNV3hZTFRCRk5EaEZVRGhRUlRORFduYxAB",
            "text": "We love the food here we had a bit of a mix up on the food we ordered tonight but they were super fast with fixing and going above and beyond! 10/10!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUFVWVnJXRGxFVTNCQ05VWnhiVWw1WTJkaU9YYxAB",
            "text": "Ordered lunch for the company today on a Saturday. 7 different orders. Everything was correct and WOW was it good!! Tzatziki so good. Green sauce had spinach we think, super delicious. I got the doner basket with chicken... absolute perfection! Everyone was delighted with their food. Will go again!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSE9VRmtRM1ExYUd4YU5VOW1VekJFTjBwZlpsRRAB",
            "text": "Great place. Highly recommend you grab a meal here. Food was delicious and fast. Just wish I had a spoon. Gets messy trying to scoop up a rice bowl with just a fork. Love that they have craft beer on tap. Good selection."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaR1JsWndWbk5tU1RnNWJUaFZWa2xrZEdGTVIwRRAB",
            "text": "We came in on a Saturday night and Chaston helped us. He was so polite. He knew so much about the menu. Food is delicious! We can't wait to come back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWlZrSklWWEZQUzJkSFJFaHpjVTl6UmpKRFNuYxAB",
            "text": "So delicious I had the Mediterranean wrap!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTE5tcERNSGh2TUZod1IzRXpTRFpVZDNJNGNsRRAB",
            "text": "Potentially one of the best places in St george. I would come here just for the sweet potato fries but everything else is also delicious. Love their Spitz gyro with the berliner sauce."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cc2RsVlZYMnh4VDFFNGFtZEJXbFpwZERoNmFWRRAB",
            "text": "My girlfriend and I enjoyed some delicious wraps recently at Spitz, which is now one of my top go to counter order restaurants in the St George area.  Good food, service, and atmosphere will keep my coming back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMVRXZG5ZVUpGZUVKaGNsbGhiamN0YmtGcWRVRRAB",
            "text": "Really good Gyro. Justin killed it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twaWRVMUtiek50V0ZKeGFrRlFaR1F4TUVaS2NHYxAB",
            "text": "Everything was decent, I feel like it wasn’t not up the standards of the SLC location. Mostly I’m disappointed in the cash less policy. Who doesn’t take legal tender for payment. I wish them the best, but I’ll support those who accept cash."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWb1VIQk1iVTlTVUVwMVVFVk9WV0ZNUlRKTFJHYxAB",
            "text": "Super cute aesthetic! Yummy food options. Very clean!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNFpIQkZURzlFTURkNmNsOWtVRmxhTVRaTlgxRRAB",
            "text": "Great fresh food!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreFdISldlVTloYVUxcWJFcDZTRnBVUW5CdGJrRRAB",
            "text": "The wrap was yummy.  Nice new place in town"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poc2FqSldTRTQ0WTBaZlNEZ3pSekkwYzNGTVVFRRAB",
            "text": "Med wrap was dry and over salted.  Guy upfront taking the orders was annoying and only smiled when he saw that I tripped before any service. Not coming back again"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UmMzSnpiemRWVGxSU1IzTkNaRUpJT1dFeWRIYxAB",
            "text": "Absolutely delicious.  Food is so light, clean and healthy. Will come again. Staff is friendly and outgoing.  Restaurant is clean and inviting."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WVNYcENlRWhYWVhOdkxWQnBOMnBCVkZCbllrRRAB",
            "text": "Food was amazing, but there was a mix up on our order and we didn’t get the mixed fries, instead getting rosemary fries. Would recommend double checking your fries if you order takeout."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSlJWZzJTMDVOZWtoWk9FcFFVMDFVUlZoalgzYxAB",
            "text": "Tried spits at the new location in St. George. Food looked good but all of us got sick from food poisoning. And the only thing that we ate in common the three of us was the food from Spitz. Most likely will not eat there again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NExXeFFOWGhpYld4clN5MXBiWHBzTTJKMFMzYxAB",
            "text": "Cool atmosphere but food was not very good and overpriced for what you get."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V09HRXpRbVYyU0VseGMxY3hTMUJwV1dsQ01sRRAB",
            "text": "If you walk in and the line is long, don’t worry! It goes fast! Their service and food is fantastic! Great patio area and cute inside"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twM1QzbHRURkpRYkcxS1F6Um9ZekV6ZVd4RlMwRRAB",
            "text": "A friend recommend the wings saying it was an explosion of taste buds in your mouth.  I was very skeptical. Butttt they were right there are the best wings I’ve ever had in my life. What ever magic they use to cook these to get the perfect crisp is insane! Not chewy just crisp and the meet inside is so tender not over cooked."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OblVrZEJRMFZzUkZoT2VYZFZTMHhXWlRJdGQwRRAB",
            "text": "Service, and atmosphere were top notch. The  table games were a nice touch. Kids played while parents are. Sweet potato fries and regular fries were great. Gyro was fine but I prefer other places."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscFUxTlhaSGhJY2t4TmVFcDZiRUoxYW5oVGVGRRAB",
            "text": "Finally, a new place that is actually good. We got the Zesty Feta Doner and the Spitz Gyro with a kids meal. Now that came out to about $45 but the portions were big enough you could easily make two meals out of them. They were DELICIOUS. The spitz Gyro had fries in it which is amazing, its like a california burrito but Gyro! The staff was very helpful and had great hospitality. Not much else to say honestly. Just worth the price and will definitely be back when they get their liquor license at the end of the month."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0elRWUnhSbXBaTmxOaFRVNVFXa3hHUVZwaWIzYxAB",
            "text": "First time eating here it’s really good and different tasting than where I normally go. I will come back.\n\nNote they refuse cash I wasn’t paying with cash but I have a personal gripe about businesses not accepting us currency so I got to complain about that but everything food and service wise was perfect."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VVJqUTJRbkZuUVdGWE0zVllOak5hTmpONWJVRRAB",
            "text": "We are thrilled to have a Spitz in Stg! We’ve already been twice the first week open. Excellent quality, service and atmosphere. Even with them training, everything was on point."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Od1RUVnZkR05SYWs5VU1VRmZRMjVQUlhOalJGRRAB",
            "text": "Way too slow. Almost 45 minutes from order to food. Not super crowded. Drink machine already has out of order selections and the place is brand new."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQ1luQkpRbWwzVGs1WGVrSkZiSEpGTTI0dFkwRRAB",
            "text": "I got a remix bowl, and my husband got wings. Both were absolutely delicious! There wasn't much meat in my bowl for the $15 price tag, but it was seasoned well.\n\nMy husband's wings were undercooked. They were raw and cold near the center of many of his wings. He spit out the first bite he noticed, so hopefully he doesn't get sick. Pretty gross. The flavoring on the outside was good though. They remade the wings for him. He took them home to eat, and guess what! They were icy cold in the middle and undercooked. They tried to make it right, but they failed. Just be careful. I'm sad to waste $17 on the wings.\n\nIt took a pretty long time to get our food. It wasn't crazy busy when we went, but it took 25 minutes. I'm assuming the wait time will get better, so I'm not going to hold that against them.\n\nAlso, the seats were very uncomfortable. They were poorly angled and hard."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KeVVqSmthbXRFYTNsb1QySkJZVTVDZEVocVJXYxAB",
            "text": "we saw the good reviews and wanted to try somewhere new! it was awesome! the staff is extremely kind and makes you feel super welcomed! the food was super fresh, filling and came out fast even though it was busy! it’s on the pricy side but super yummy and recommended for everyone to try!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGb2RGazBOV3R0ZFVSTVpEbHdkVGRCWVhSclYxRRAB",
            "text": "This place is rad! Love the vibe. The art is so cool. Their food is art too. Forgot to grab a picture of my remix bowl before I dug in. Got it with the mixed meat (gyro meat and chicken) both meats were delicious and it was beautifully presented. Service was great. They said a full bar is coming soon too. Can’t wait to go back for some of their sangria. They mentioned all their draft beers will be local breweries. Thanks for bringing this to St George!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dFVtUldUM0Y0YWxOTmQzTlRRVms1VEZWS1puYxAB",
            "text": "Totally worth going to.  Good flavor.  FYI what you receive doesn’t look like the pics on the menu for the doners, and side of fries, but once you get it you have more than you can eat.  We’ll be back to try some more dishes. Nice decor, casual setting, and nice that theirs outdoor dining space in the shade in the evenings."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbVUwSjBkRWRIY25oTVFXRTBWMW8zWkVNNU5uYxAB",
            "text": "Worth every single penny! The food is so amazing and fresh and I will be coming here every week. I always get the street cart fries with the gyro meat and it is literally to die for. The restaurant was so clean our food came out really fast and they even had some games and a chalkboard wall which kept my kids entertained! 10/10 the best restaurant I’ve ever been to!!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTVdEZGlUWHBaWW05UGFGSjRNMWRvV1VaRVJGRRAB",
            "text": "What an amazing place to have here in St George. We love Mediterranean food, and this didn't disappoint. The food had perfect flavor and taste. The staff was very approachable, friendly, and answered all the questions we had. I ate the beef and lamb gyro, and I will say it's one of the best ones I've had. Perfect ratio of sauce, meat, feta cheese, and the other standard toppings in perfect pita.\n\nMy wife had the doner salad while my kiddos had chicken wings, a chicken gyro and then my mother in law has the original street cart wrap with the lamb and beef mix. All were perfectly cooked and seasoned to perfection and all stated they would get them the next time we come.\n\nThe service was fast and we only had to wait a few minutes to get our food.  All in all, I would recommend this restaurant to everyone.\n\nWe will be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTVRtZzRlVmt5ZEdJdFdsVk9SRzV6YVd4clZHYxAB",
            "text": "Thank you for bringing Spitz to St. George!\nI ordered food to go today, so fast but so still incredibly fresh. Fries were hot and crispy. Salad crunchy and fresh. Love the atmosphere inside too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWM2QwTktRV042VERnMWNqTnlXbnA2VG5rdFJHYxAB",
            "text": "Incredible food. No complaints. I brought my office staff here for a work meeting and everyone really enjoyed their food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNME4xcDJTVGxFZVVGTlEwMUlkVVI0UlRscGEyYxAB",
            "text": "I am a big Spitz fan and have loved their locations up north. I was so excited to hear they were coming to St. George. Sadly, this is my least favorite location. Look I know they are brand new, but they wouldn’t accept my app coupon, my food was cold, and the service was not great. If a customer has a coupon you should really honor it:) hope it improves and does well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRFpIZzNPVWRhT0hKS1lVNWZRVkY2UmkxWFVYYxAB",
            "text": "I went to the Opening night at Spitz and was really blown away. This place has a great atmosphere and a very nice and well trained staff.  I ordered a Street Cart Wrap, a Gyro and Donner Bowl. All the food was fantastic in flavor and quantity. I give them 2 thumbs up. Great food, great atmosphere and great service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeVYwUTJTWEJJUkZOZldUZHliMFZZWjJKU2NIYxAB",
            "text": "This is the best Spitz so far! Love it!  The Berliner bowl with chicken is my fav.  Highly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MU5tTTBSekZIZFdkdWEzUmhjRkJaWkdaUldFRRAB",
            "text": "Street Car fries, Gyro meat. Half and half regular and waffle fries.  Extra sauce!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zME9VcFFjV1o1WkZKV05rcFJTbFZ2WXpZNE4xRRAB",
            "text": "V excited to have this in the neighborhood! Great food, super kind employees, great vibe 🇬🇷"
        }
    ],
    "reviews_count": 51
}